[
  {
    "title": "Here's What's New in Android 16's Second Major Update",
    "url": "https://lifehacker.com/tech/whats-new-with-android-16-major-update?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG4NKBF4W4PX6NXZ6F2B10G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-02T19:00:00.000Z",
    "description": "\n        \n        Android 16 officially started rolling out back in June, with most of the Material 3 Expressive visual overhaul added in a major upda",
    "body": "\n        \n        Android 16 officially started rolling out back in June, with most of the Material 3 Expressive visual overhaul added in a major update in September. Now, the second big Android 16 update is here, ushering in a host of new features across notifications, customization, accessibility, and device restrictions.As is the norm, this update will arrive on Pixel devices first. For other Android devices, including those made by Samsung, it's up to each phone and tablet manufacturer to adjust the software update as needed and push it out to their users. Despite the limited rollout, Google says this marks a \"new chapter\" for Android releases, which, going forward, will be \"more frequent\" rather than once a year. In other words, we might be seeing Android 17 much sooner than expected. But we won't see it today. We're still in the Android 16 era, which is about to get the following new features and changes:\nMore interface customization\n    \n            \n            You now have more control over home screen icons.\n                                        Credit: Google\n                    \n    \nCustomization has always been one of the strengths of Android, and this Android 16 update brings with it a bunch of features to help you change the interface in a more flexible and consistent way. Home screen icons can now have custom shapes, while themed icons are auto-applied across apps.Both of those changes should mean that when you play around with the visual look of Android, there isn't a jarring icon or two that stands out from the rest—everything should look more uniform. \"Your phone should reflect your own unique aesthetic,\" Google says, and these tweaks should help.There's also an improvement to dark mode: Dark mode will now be applied across all apps, even those that haven't been coded to include a dark mode by their developer. Again, the end result should be a more consistent visual look, plus extra savings on battery life if more of the screen is dimmed more often.Improved parental controls\n    \n            \n            More parental controls can now be managed on-device.\n                                        Credit: Google\n                    \n    \nIf you have kids who use an Android device, you'll know the current parental controls are a little bit clunky, and mostly managed remotely. Going forward, more of these controls will be available on the actual devices your youngsters are using, which should mean they're easier to access and manage.The new on-board settings will be protected by a PIN, so your kids can't change them, and will cover screen time, downtime schedules, and app usage. You'll also be able to add more time for app and device usage from the phone or tablet that's being used, which is more convenient if you're actually with a child.Additionally, Google is making it easier to set up a Google Family Link from Android 16 phones and tablets, which is where the family connections and device rules are set to begin with. Other key parental controls, including protections over purchases and location tracking, are still managed remotely.AI in your notifications\n    \n            \n            AI will group and summarize your notifications.\n                                        Credit: Google\n                    \n    \nTechnically launched in last month's Pixel Drop, Android 16 now summarizes your notifications for you through the power of AI—something that tech companies are continuing to push, in an effort to save us all time and avoid notification fatigue, even if the results have been mixed so far. Why Google is announcing it alongside these other new features isn't clear, but it's a good reminder for any Pixel users who might be interested in trying it out.  \n            \n                What do you think so far?\n            \n        \nAI summaries are something Apple introduced for the iPhone, then partially pulled for certain apps, then brought back. According to Google, these AI summaries will give you \"quick understanding and context at a glance\"—so let's hope they understand what's important in your group chats and what isn't.On top of that, we're getting AI-powered notification organization too, with \"lower-priority notifications\" (which Google says include promotions and social alerts) silenced and grouped together so they're not so much of a distraction. As yet, it's not clear exactly how much control you'll get over how all this works.And even more updates\n    \n            \n            You'll be able to mark your calls as urgent in the future.\n                                        Credit: Google\n                    \n    \nThere are plenty of other minor updates rolling out to a broader selection of Android devices too, not just those running Android 16. They include more expressive closed captions; ease-of-use improvements to accessibility features, such as TalkBack (voice dictation) and Auto Click (using a mouse with Android); and pinned tabs in Chrome for Android.Emoji Kitchen is getting more features and more ways to combine emojis, Circle to Search is adding a scam detection feature (just point it towards a suspected scam message), and group chats in Google Messages will now come with options for reporting issues—chats can be easily left, blocked, and reported.We'll also soon be getting a beta version of a feature Google has named Call Reason, in the Phone app. This lets you mark your outgoing calls to saved contacts as urgent, which they'll see when you ring them (and might encourage them to pick up. For more details on this and everything else rolling out to Android from today, see the official blog post.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's What's New in Android 16's Second Major Update",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG4NKBF4W4PX6NXZ6F2B10G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-02T19:00:00.000Z",
      "dateModified": "2025-12-02T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the 'MIT Method' to Keep Your Big-Picture Goals in Mind During Everyday Tasks",
    "url": "https://lifehacker.com/work/how-to-use-the-mit-productivity-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01J336QQAET3RS8QW5PARXXZ4J/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-08T13:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: GaudiLab / Shutterstock.co",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: GaudiLab / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        So many productivity methods ask you to prioritize your daily tasks by considering how much time or effort they'll require, then tackling the resource-heavy ones first. For some people, that's a solid strategy, since you can definitely get some motivation from getting your toughest, most demanding responsibilities out of the way. There's even a weird name for doing that: \"Eating the frog.\" But you can also find motivation in working toward a bigger goal, so what if you prioritized your tasks based on importance and impact, no matter how big or small they are? That's what the Most Important Task (MIT) method involves: rather than thinking of specific tasks and how long they'll take, the MIT method asks you to look more broadly at the overall goal you're trying to accomplish. Reframing your approach to productivity by focusing on your goal instead can motivate you to get more done and achieve better results.First, you'll need to nail down your goals. You can set SMART goals or combine the MIT method with the Results Planning Method (RPM), which asks you to consider your purpose when planning your day. Take some time to write down your goals—the big ones, the ones that all your daily tasks are ostensibly supposed to move you toward. Think of weekly goals, monthly goals, and annual goals, as well as ongoing, long-term ones. Write these down or just keep them in mind, but always think about the broader, bigger picture. An easy example is school: You're not just studying so you can pass the test, but because your overall goal is to graduate, to do so with a solid GPA, and to get a quality job offer. Taking time to reaffirm that broader goal reframes how you view studying for one boring old test.\nEvery morning, make a list of two or three Most Important Tasks for the day. These are critical tasks that will have an impact on your goals, but they don't have to be huge or resource-draining. If answering emails from a potential client will move you toward a monthly sales goal, that is more of an MIT goal than building a presentation for your boss, even though creating the presentation seems like the more demanding, large-scale project. Consider the results of your tasks and prioritize those that have fast or meaningful ones. You want to focus on the two or three tasks that will actually make a difference in moving you toward your goal. \n            \n                What do you think so far?\n            \n        \nTake care of those two or three tasks first, then handle other, less important tasks from your to-do list for the rest of the day. You can use a scheduling technique like the 1-3-5 list or the pickle jar method to figure out which those are and how much time and energy you'll have for them. When using the MIT technique, you should also use a productivity journal to write down your daily to-dos in the morning and reflections on how it all went at night. If you're not familiar, learn how to conduct an after-action review so you have some structure to follow while reflecting and you can efficiently build on whatever takeaways you find. That nighttime reflection is key: You need to be able to identify and see how taking on those critical tasks impacts your progress toward your goal, plus what you did well and what you could do better as you keep striving. That will keep you motivated and moving forward. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the 'MIT Method' to Keep Your Big-Picture Goals in Mind During Everyday Tasks",
      "image": [
        "https://lifehacker.com/imagery/articles/01J336QQAET3RS8QW5PARXXZ4J/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-08T13:30:00.000Z",
      "dateModified": "2025-12-08T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods 4 (With ANC) Are Just $99 Right Now",
    "url": "https://lifehacker.com/tech/anc-airpods-4-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T21:30:21.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Zain Awais and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods 4 dropped to a record low price during Black Friday last week, and after restocking, they're back on Amazon (and even slightly cheaper). The ANC AirPods 4 are $99 (originally $179.99) after a 45% discount. This is the lowest price they've ever been, according to price-tracking tools.\nThe AirPods 4 have updated USB-C charging. Both models (the ANC and non-ANC) are powered by Apple's H2 chip, so you'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" and answer calls. Apple added a live translation feature to the ANC model when iOS 26 rolled out earlier this year.The biggest difference if you choose to go with the non-ANC is that you'll miss out on the charging case with a built-in speaker, which you can use with Find My to locate it if you lose them. You'll also miss features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio (combines ANC and Transparency mode to adjust ANC levels based on the noise around you).\n            \n                What do you think so far?\n            \n        \nBoth versions are rated IP54 for dust and water resistance, offer up to five hours of listening per charge (up to 30 hours with the charging case), and can handle automatic switching with your other Apple devices. You can read more about the non-ANC AirPods in PCMag's \"excellent\" review, and more about the ANC AirPods in PCMag's \"outstanding\" review.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods 4 (With ANC) Are Just $99 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T21:30:21.000Z",
      "dateModified": "2025-12-04T21:30:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Red Dead Redemption' Is Available on Mobile for the First Time Ever, but There's a Catch",
    "url": "https://lifehacker.com/tech/red-dead-redemption-available-on-mobile-for-first-time?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJEBGJ5W2VJA4G5JZ84WXN1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T16:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Rockstar Games\n                            \n            \n                Key Takeaways\n                                            \"Red Dead Redemption\" is finally playable on mobile devices for the first time in 15 years.\n                                            Rockstar announced the news on Tuesday, alongside free upgrades to the PS5, Xbox Series X|S, and Switch 2 versions of the game.\n                                            Mobile players will have the choice of paying $39.99 for the game, or playing for free—assuming they have an active Netflix subscription.\n                                    \n            \n    Table of Contents\n    \n        \n        Rockstar fans might be all-in on waiting for GTA VI, but Grand Theft Auto is far from the only big title the company makes. One of Rockstar's most impactful games, Red Dead Redemption, turned 15 in May. All these years later, it's still very much worth your time—if critics and fans have anything to say about it. On Tuesday, Rockstar announced some big news for the first Red Dead: First, anyone who owns a copy of the game for PS4, Xbox One, and Nintendo Switch, can now upgrade to the PS5, Xbox Series X|S, or Nintendo Switch 2 versions for free. That includes upgrades like 60 fps, upgraded visuals, support for HDR, and 4K resolution—at least on PlayStation and Xbox. But console gamers aren't the only ones impacted here. Rockstar also revealed that Red Dead Redemption is now available on mobile for the first time ever. This could open the game up to a whole new market of players who don't own a console—if your primary gaming device is your smartphone or tablet, you can now check out Red Dead Redemption in its entirety. Depending on your device, you may even have access to a \"performance mode\" that boosts the frame rate of the game. Otherwise, it appears locked to 30 fps—though that might not be as noticeable on mobile as it would on a TV.  \nRed Dead on mobile is either free, or very expensiveHowever, there's a bit of a catch here. Depending on your current subscriptions, Red Dead Redemption's mobile port can either be completely free, or quite expensive. If you look at the listings for the game on the Google Play Store and iOS App Store, you'll see the game currently costs $39.99. That's pricey for a mobile game, even a console port. While there aren't many games as large as Red Dead with mobile versions, the ones that are aren't quite this expensive. Stardew Valley is $4.99; Minecraft is $6.99; GTA: San Andreas is $6.99 (though the \"Definitive\" edition is $19.99); Hitman: Absolution is $14.99. $39.99, by comparison, is steep.I'm not saying Red Dead isn't worth $40, but you need to be sure you want to commit to the mobile port of the game—especially if you have other means of playing it. The PS4 version is currently $29.99 at Best Buy: If you have either a PS4 or PS5, you can enjoy the game on your TV for $10 less. Plus, PS5 owners can upgrade to the higher-performing version for free.\n            \n                What do you think so far?\n            \n        \nSpeaking of free, however, there is a way to play Red Dead Redemption on the go without spending anything—or, at least, anything extra. If you have an active Netflix subscription, you can download the Netflix version on your iPhone or Android free of charge. It's the same game, just validated through your Netflix account—so if you have a Netflix subscription, I highly recommend you download this version before you spend money on the game.  If it sounds weird that Netflix is offering Red Dead for free, I don't blame you. However, this isn't really something new for the company. Netflix has been offering free games for subscribers for four years now, and while some of them are Netflix-owned, others are major titles the company licenses. That includes games like Into the Breach, Moonlighter, Heads Up!, and, of course, Red Dead Redemption. Netflix doesn't even require you to have a specific subscription to access these games: All subs, including its cheapest \"With Ads\" plan, can play.If you've never played Red Dead Redemption, the cheapest way to experience the game right now is to subscribe to Netflix for a month. You could pay $7.99 for the company's least expensive plan, and after catching up on Stranger Things, you could play through all of Red Dead. Not a bad deal. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Red Dead Redemption' Is Available on Mobile for the First Time Ever, but There's a Catch",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJEBGJ5W2VJA4G5JZ84WXN1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T16:30:00.000Z",
      "dateModified": "2025-12-03T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
    "url": "https://lifehacker.com/tech/apple-watchos-262-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            watchOS 26.2 is bringing three new features and changes to your Apple Watch.\n                                            Apple is updating Sleep Score, which should now be a bit more accurate when calculating your overall score.\n                                            The update also fixes an annoying Music glitch and introduces Enhanced Safety Alerts.\n                                    \n            \n    Table of Contents\n    \n        \n        Yesterday, Apple unveiled release candidates (RCs) for its slate of upcoming updates. An RC, as the name implies, is the version of a software update Apple intends to release to the general public. Before it rolls out, though, Apple sends the update out to beta testers to see if there are any bugs or glitches that need addressing. If not, these are the updates that will hit your Apple devices sometime this month. That includes watchOS 26.2, Apple's latest OS for its line of smartwatches. While there aren't nearly as many new features and changes in this update as there were in watchOS 26 proper, there are still some key things to highlight in this RC. In fact, as noted by 9to5Mac, there are three:Updates to Sleep ScorewatchOS 26 introduced Sleep Score, a feature that was sorely missing on the Apple Watch. Sleep Score analyzes a host of data collected while you slept, including sleep duration, the time you actually went to bed, and any wake-ups you might have had during the night, and gives you an overall score. The idea is to glance at the score and see how you slept that night, so you can either take steps to improve your sleep going forward, or know you're on the right track. The total score is out of 100: Duration gets you up to 50 points, bedtime gets up to 30, and sleep interruptions go up to 20.  \nwatchOS 26.2 refines the feature, by adjusting the final Sleep Score metrics. The feature had a tendency to give you higher scores than you might have otherwise felt you earned: A mediocre night's sleep might have have scored \"High\" on your chart, which wouldn't have made much sense to you. Going forward, the scoring is a bit more conservative. Here's what you can expect, and how the scores changed from the last update:Very Low: 0–40 (previously 0–29)Low: 41–60 (previously 30–49)OK: 61–80 (previously 50–69)High: 81–95 (previously 70–89)Very High: 96–100 (previously 90–100) You'll also noticed Apple changed the \"Excellent\" score to \"Very High,\" which keeps the naming a bit more consistent.Music app glitch fixIf you've been using the Music app on your Apple Watch, but have been struggling to get your songs to actually, you know, play, good news: Apple says in the release notes for watchOS 26.2 RC that there is now a fix for an issue where the Music app doesn't move to the next song.\n            \n                What do you think so far?\n            \n        \nEnhanced Safety AlertsFinally, watchOS 26.2, along with other Apple updates, introduces Enhanced Safety Alerts. According to Apple, this feature will warn you about \"imminent threats,\" including floods, natural disasters, and other emergencies. The feature will also include data like maps and links to official safety advice. Apple has been positioning the Apple Watch to be an overall health and safety device, and this feature only seems to complement that. Recent Apple Watches have hypertension alerts, which can help you passively identify high blood pressure, while fall and crash protection can automatically call for help in emergencies when you can't reach the phone. When does watchOS 26.2 come out?Apple doesn't have a set date for watchOS 26.2, or iOS 26.2 and macOS 26.2 for that matter. However, now that the RCs are out, these updates are likely coming soon. As long as there aren't any glaring bugs or glitches in these RCs, Apple will likely ship the updates sometime this month.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:30:00.000Z",
      "dateModified": "2025-12-04T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-portrait-night-mode-missing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n     ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's latest iPhone 17 Pro models are missing a feature found in the last five generations of Pro iPhones.\n                                            For some reason, you can no longer take Portrait mode shots with Night mode—though Night mode itself still works for standard shots.\n                                            Apple has not disclosed why this feature is missing.\n                                    \n            \n    Table of Contents\n    \n        \n        New products tend to add features, not take them away. That isn't always the case with Apple, however. The company has a long history of removing functions from one generation of devices to the next, whether that's removing the disc drive from its MacBooks back in 2012, or taking away the iPhone's Home button in 2017. Some of these changes are good, some are controversial, while others are undone altogether: MagSafe and HDMI both found their way back to MacBooks after all.It's not often I hear about Apple removing software features from one generation of product to the next, however. So, imagine my surprise when I saw a number of headlines this morning asserting that the iPhone 17 Pro, Apple's latest and greatest flagship, is missing a feature found in the last five generations of Pro iPhones—and nobody noticed for nearly three months. Night mode is missing from Portrait mode on the iPhone 17 Pro and 17 Pro Max. The short answer? We have no idea. This was not something Apple announced publicly, of course. In fact, Macworld spotted the change in an Apple support doc: If you scroll down to the section where it says \"On supported models, you can take Night mode photos with Portrait mode,\" and click the hyperlink on \"On supported models,\" you'll pull up a list of iPhones that, mysteriously, doesn't include the 17 Pro or 17 Pro Max. The list includes:\niPhone 12 ProiPhone 12 Pro MaxiPhone 13 ProiPhone 13 Pro MaxiPhone 14 ProiPhone 14 Pro MaxiPhone 15 ProiPhone 15 Pro MaxiPhone 16 ProiPhone 16 Pro Max For the uninitiated, Night mode and Portrait mode are technically two distinct features. Portrait mode was released first, all the way back on the iPhone 7 Plus, which utilized the dual-camera system to add a bokeh effect to shots of people. Those early shots were hit or miss, and were often no replacement for a true DSLR, but as Apple's tech and cameras have improved, so has Portrait mode. Part of the improvement was the introduction of Night mode. This feature, which Apple was a bit late to the game on, allowed you to take brighter images in low-light environments by lengthening the time the shutter stays engaged. Older iPhones without the feature would take images that were hard to see without the flash engaged, but Night mode could pull in details as long as there was just enough light present in the scene. Since the iPhone 12 Pro, Portrait mode came with the option of Night mode, as well. If you're trying to take a portrait shot in a dark environment, Night mode kicks in and gives the image a chance to turn out brighter and more detailed. But now, it seems, the 17 Pro and 17 Pro Max do not have this option. \n            \n                What do you think so far?\n            \n        \nTo be clear, these new iPhones still have Night mode: Per that previously mentioned support page, you can take brighter shots at night when taking standard photos, selfies, and time-lapse videos. It just seems Apple decided to remove the feature for Portrait mode shots on its latest Pros.Of course, this news started breaking on Dec. 3, nearly three months after the 17 Pros launched. If it took this long for someone to notice a missing feature, was it really all that important to begin with? I don't have a 17 Pro, so I really can't say, but I also can't say I take many Portrait mode shots in dark environments. I've reached out to Apple for comment, and will update this story if I hear back. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:00:00.000Z",
      "dateModified": "2025-12-04T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Spot a ‘Sleeper’ Browser Extension That’s Actually Malware",
    "url": "https://lifehacker.com/tech/spot-sleeper-browser-malware-extensions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBXCY3SNDWTKDSFJFA4PAZA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T14:00:00.000Z",
    "description": "\n        \n        Malicious extensions do occasionally find their way into the Chrome Web Store (and similar libraries in other browsers) by posing as",
    "body": "\n        \n        Malicious extensions do occasionally find their way into the Chrome Web Store (and similar libraries in other browsers) by posing as legitimate add-ons. They are particularly difficult to catch when they are benign to begin with, only morphing into malware after gaining user trust. That's what happened with a number of extensions on Google Chrome and Microsoft Edge: researchers at Koi Security identified add-ons across both browsers that operated legitimately for several years before receiving malicious updates that allow hackers to surveil users and collect and exfiltrate sensitive data. The scheme, known as ShadyPanda, reached four million downloads and is still active on Edge. Threat actors ran a similar campaign targeting Firefox earlier this year: They gained approval for benign extensions mimicking popular crypto wallets, accumulated downloads and positive reviews, and then injected the add-ons with malicious code capable of logging form field inputs, which they used to access and steal crypto assets. \nBrowser extensions can turn badAs Koi Security outlines, ShadyPanda started out as an affiliate scam, with 145 extensions masquerading as wallpaper and productivity apps across the two browsers. The initial phase injected affiliate tracking codes and paid commissions with clicks to eBay, Amazon, and Booking.com and then evolved to hijack and manipulate search results before launching the five extensions in 2018 that would later be converted to malware. Those add-ons were marked as Featured and Verified in Chrome—one, a cache cleaner known as Clean Master, accrued a 4.8 rating from thousands of reviews. The extensions were updated in 2024 to run malware that could check hourly for new instructions and maintain full browser access, feeding information to ShadyPanda's servers. (These have since been removed from Chrome.) Hackers launched an additional five extensions, including WeTab, to Edge in 2023. Two are comprehensive spyware, and all were still active as of Koi's report. \n            \n                What do you think so far?\n            \n        \nHow to find malicious extensions in Chrome and EdgeUnfortunately, malicious extensions are usually pretending to be something else, so a quick visual check of your installed extensions may not reveal a problem. In this case, Koi Security has a list of the extension IDs associated with the ShadyPanda campaign, and you'll have to search for them one by one. In Chrome, type chrome://extensions/  into your address bar and hit Enter. Toggle on Developer mode in the top-right corner to reveal the IDs for installed extensions. From here, you can copy and paste each ID into the search bar (Ctrl+F on your PC or Cmd+F on your Mac). If there are no results, your browser is safe. If you do find a malicious add-on, click the Remove button. In Edge, follow the same process from edge://extensions/. While this campaign shows that extensions can be weaponized long after they've been installed, you should still follow best practices for vetting browser add-ons just as you would apps for your device. Check the name carefully, as fraudulent extensions often have names that are nearly identical to trustworthy ones. Review the description for any red flags, such as misspellings and unrelated images. If you see a lot of positive reviews in a short amount of time on a new extension, or if they seem to be reviewing something else entirely, proceed with caution. You can also do additional research, such as a search on Google or Reddit, to see if the extension is legit. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Spot a ‘Sleeper’ Browser Extension That’s Actually Malware",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBXCY3SNDWTKDSFJFA4PAZA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T14:00:00.000Z",
      "dateModified": "2025-12-08T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Noise-Canceling JBL Headphones Are Nearly Half Off Right Now",
    "url": "https://lifehacker.com/tech/jbl-tune-770nc-wireless-headphones-december-2025?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBR40Y62EBSWB9VS32CD3YS7/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-05T21:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        If you missed out on all the best headphone deals during Black Friday, there are still some bargains to be found, including on these JBL Tune 770NC wireless headphones, currently $80 from Amazon, 47% off the usual $150 price tag. They’re a solid choice for anyone seeking over-ear headphones with decent noise cancellation and that signature JBL sound. \nAccording PCMag's review, these headphones offer a “sculpted sound signature with palpable bass,” which you can tweak using the adjustable in-app EQ. Long battery life is a major perk: They should last up to 70 hours with ANC off, letting you go at least a week of heavy use between charges. They also have Bluetooth 5.3 connectivity and multipoint pairing, as well as three different ambient modes and a built-in mic for calls. The 770NCs come in three colors, and the design is lightweight and foldable, with generous cushioning and a padded headband. While control buttons are responsive, they can be tricky to distinguish by feel, and PCMag notes that controls can be sensitive to misfires. The adaptive noise cancellation likewise isn’t top-tier; while it will reduce outside sound, it doesn’t do much against low-frequency noise.\n            \n                What do you think so far?\n            \n        \nThose caveats aside, if you want comfortable, long-lasting over-ear headphones with bass-y sound for a budget price (and you don’t need best-in-class noise cancellation), the JBL Tune 770NC wireless headphones land firmly in the “good enough” category, and deliver strong value at the current 47% discount.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Noise-Canceling JBL Headphones Are Nearly Half Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBR40Y62EBSWB9VS32CD3YS7/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-05T21:30:00.000Z",
      "dateModified": "2025-12-05T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One of the Mac's Best Productivity Apps Is Now on Windows",
    "url": "https://lifehacker.com/tech/raycast-is-finally-on-windows?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                            \n            \n                Key Takeaways\n                                            Raycast is finally available on Windows.\n                                            The previously Mac-exclusive app makes it easy to search for apps and files anywhere on your PC.\n                                            You can also use the tool for a number of tasks, including converting currencies and dimensions, managing your clipboard history, and emptying your recycle bin.\n                                    \n            \n    Table of Contents\n    \n        \n        Raycast is one of the best things to happen to Windows. It brings one of my favorite Mac apps to Microsoft's operating system. In fact, I've enjoyed using Raycast for Windows so much, I can't see myself going back to the non-Raycast life. This app is free to download and use, though there is an optional paid subscription for those who want certain additional features. What is Raycast?\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nAt its heart, Raycast is an app that lets you search for apps and files stored in your computer. It stays hidden until you press its keyboard shortcut (Alt-Space on Windows). Once you do, Raycast appears as a floating search bar on the desktop. You can type anything you want to locate in the search bar, and Raycast forages through your computer to find it. I primarily use it as an app launcher since I have way too many apps on my Mac (and PC). Raycast helps me find the right app quickly and open it.That's just the surface layer of Raycast, though. You can use Raycast to search for files on your computer, retrieve items you've copied to the clipboard, send queries to ChatGPT (or other AI tools), convert currencies and units, and much more. All of these features are available under the same simple floating search bar.\nSet up keyboard shortcuts in Raycast\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast is designed for people who love keyboard shortcuts. You can totally use it without them, but you'll enjoy it a lot more if you set up a few shortcuts of your own. As an example, if you open Raycast and press Tab, it switches to AI mode, and you can directly send your questions and requests to ChatGPT from Raycast.Whenever you search for anything in Raycast, you'll probably see a button called Record hotkey next to the results. This is your cue to set up a keyboard shortcut for that action, and doing so will allow you to get to it faster. You can also go to Raycast settings to find commonly used actions and record your preferred keyboard shortcuts for all of them.Note that the Raycast app is still in beta on Windows, and during this trial period, you can use these AI features for free. Expect that to change, though, once it's out of beta. If you want to keep using these features, the pro tier costs $8 per month for most AI models, but certain advanced AI models are only available in the $16 per month subscription tier.What I use Raycast for on Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI use Raycast for a lot more than just launching apps on Windows. As someone who lives outside the US, converting units and currencies is a big part of my work day. Raycast's workflow is quite seamless for this task. You can just type \"$499\" or any other number after the dollar sign, and Raycast automatically converts it to your local currency. You can also type something like \"EUR499 to USD\" and it'll convert euros to the US dollar. I really like the fact that you don't even have to press the Enter/Return key to see the converted currency. The moment you type a currency number, the result shows up without any further prompts.You can also try other unit conversions with Raycast, eg: \"100kg to lbs,\" \"800ml to fl oz,\" \"44 sqm to sqft,\" etc. This helps me a lot when I'm ordering things from international websites that don't always have dimensions, weight, or pricing available in units I'm used to.\n            \n                What do you think so far?\n            \n        \nBeyond this, I like using Raycast to store and view clipboard history. You can search for Clipboard in Raycast to access items you've copied, and the app even categorizes these items for you. You can search just for links, images, files, or email address you've copied, which makes it easy to quickly find specific items from your clipboard history.Raycast also supports many other things such as window management, emptying the recycle bin, restarting your computer, locking your PC, bookmarking links and opening them in specific browsers, and text snippets—which let you quickly create or copy bits of text or code. You can open Raycast, and press Ctrl-, (comma) to open its settings and explore all its features.The limitations of Raycast for Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast only recently launched on Windows, which means there are a few things still missing from the macOS version. This includes the AI Chat feature (more advanced than the quick AI search available now), focus timers, the built-in notes feature, and support for more extensions. Many of its extensions were originally built only for macOS, so it's going to take some time to bring them to Windows. The feature that I miss the most is the ability to sync your snippets, notes, chats, and other data across devices. This feature is yet to come to the Windows app, and I hope the developers change that soon.Raycast is available on the Mac, iPhone, and now, Windows.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One of the Mac's Best Productivity Apps Is Now on Windows",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What People Are Getting Wrong This Week: When Was Jesus Actually Born?",
    "url": "https://lifehacker.com/entertainment/when-was-jesus-actually-born?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBG8E4ZHG6ND650JE7N9RCQV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T21:00:58.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Volodymyr TVERDOKHLIB - Sh",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n            Credit: Volodymyr TVERDOKHLIB - Shutterstock\n                            \n    \n            \n            \n        \n            The internet is full is misinformation, conspiracies, and lies. Each week, we tackle the misunderstandings that are going viral.\n        \n    \n    Table of Contents\n    \n        \n        It's Christmas time, and people believe a lot of inaccurate things about the holiday, so for the next few weeks, I'm going to take a look at the truth behind Christmas mythology, starting with the biggest misconception of them all: Not \"how can the North Pole support an industrial infrastructure large enough to build toys for all the world's children,\" but whether Jesus was really born on Dec. 25.  Was Jesus born on Dec. 25?Most Christians celebrate the Baby J's birthday on Dec. 25, but he probably wasn't born on that day. The Bible doesn't provide a specific date, neither does any historical document, and early Christians didn't even celebrate Christmas. So Jesus could have been born on Dec. 25, but he could have been born on March 7, or any other date. Here are some popular alternatives for Jesus' birthday:January 6 or 7—favored by  Orthodox ChristiansNovember 18—according to Clement of AlexandriaMarch or April—based on Biblical passages describing shepherds watching their flocks.September or October—based on John the Baptist's father's membership in \"The Order of Abijah.\" This theory is too complex to explain here, but it's fascinating, and I urge you to fall into the priestly division of Abijah rabbit hole like I did. If Jesus wasn't born on Dec. 25, why is it Christmas?No one knows for sure why we have mostly landed on Dec. 25 as Jesus' birthday, but there are theories. Here are two of the most common:\nSolar Theory: The first solid reference to Jesus being born on Dec. 25 was in the Calendar of Filocalus, a Roman almanac written in 354. The calendar denotes Dec. 25 as both Christ's birth date and the date of an older holiday, \"The Birthday of the Unconquered Sun,\" suggesting both holidays were celebrated on the same day in Rome (or were at least listed that way by the 4th century). The theory is that Romans were like \"we celebrate the day anyway\" and early Christians were all \"we got your unconquered sun right here\" and accepted the 25th to celebrate, eventually outlasting the Romans and leaving the pagan holiday a footnote that no one celebrates besides my friend Gary.Calculation Theory: Early Christians believed that prophets and martyrs died on the same day they were conceived—I assume a second-century skeptic carved a scathing tablet debunking this, but it's what many early Christians believed. Jesus' martyrdom/conception was said to have happened on March 25, so his birth would be on Dec. 25 (assuming he was punctual.) \n            \n                What do you think so far?\n            \n        \nThere are other theories—the date was chosen to coincide with Hannukah, Saturnalia, the re-dedication of the Second Temple in Jerusalem, or the Eagles/Bears game in 2006. The point is we don't actually know, but it's probably a \"little from column A, a little from column B\" situation. The Calculation Theory provided a theological justification for the date, and the Solar symbolism provided cultural relevance; both Jesus and Santa like when we work together, after all. What is the true meaning of Christmas?Ultimately, the murkiness around Jesus' exact birthday isn't important. Christmas doesn't exist because a Roman bureaucrat wrote it on a calendar or some pagans wanted to blow off steam. Whether you celebrate Christmas as the birthday of Christ or a mid-winter celebration of light, the holiday's meaning was been built collectively over centuries, and is molded and changed constantly to fit the needs and desires of the people who celebrate it. Whether that celebration is a somber religious expression or listening to Mariah Carey while drinking eggnog, it's all good. \n            \n    \n\n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from Jordan and the team.\n    \n    \n        The Daily Newsletter\n            Ready to do everything better? Get daily tips, tricks, and tech guides from Jordan and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What People Are Getting Wrong This Week: When Was Jesus Actually Born?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBG8E4ZHG6ND650JE7N9RCQV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T21:00:58.000Z",
      "dateModified": "2025-12-02T21:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It's Easier to Fall for a Bank Fraud Scam Than You Think",
    "url": "https://lifehacker.com/money/bank-fraud-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBGJT85Y2K9RYW909X3WDXDV/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T14:00:00.000Z",
    "description": "\n        \n        The FBI's Internet Crime Complaint Center (IC3) is warning consumers about a type of fraud in which threat actors pretend to be from",
    "body": "\n        \n        The FBI's Internet Crime Complaint Center (IC3) is warning consumers about a type of fraud in which threat actors pretend to be from trusted financial institutions in order to obtain login credentials and gain access to financial and personal data. The consequences are high: With stolen credentials, scammers can gain full control of your accounts and your money. According to the FBI advisory, criminals will quickly wire funds from your bank to cryptocurrency wallets, making the money nearly impossible to trace and recover, and lock you out of your account in the process. Here's how account takeover scams work—and how to avoid becoming a victim. \nAccount takeover scams may impersonate your bankMost account takeover scams use social engineering: a series of tactics designed to manipulate you into giving up personal information, downloading malware, or paying money to bad actors. Scammers impersonate financial institution employees as well as customer support and technical support staff and reach out to targets via text, call, or email to say that their account has been compromised in some way.They may tell you that there have been fraudulent charges on your account and send you a link to report the fraud—but this is actually a phishing site designed to harvest your login credentials. They may ask directly for your username, password, or multi-factor authentication (MFA) code over the phone. In some cases, they may even claim that your information was used to buy firearms and pass you off to a second scammer impersonating law enforcement. They're counting on you to feel fear and confusion and act quickly to \"resolve\" the issue by handing over your information. The FBI has also identified a version of account takeover using search engine optimization (SEO) poisoning, in which scammers buy ads that appear to be for legitimate businesses but actually allow them to place malicious links to spoofed bank websites higher in search results. How to avoid falling for account takeover scamsWhile being targeted for an account takeover may be unavoidable, there are a few red flags that can help you identify the fraud before it goes south. \n            \n                What do you think so far?\n            \n        \nFirst, you should always be wary of calls, texts, emails, and other communication (such as social media messages) from someone claiming to be from your bank or creditor, especially if they ask for personal information like your username, password, or time-based one-time password (TOTP). Reputable institutions will not contact you to request your credentials or other sensitive data—so these are almost certainly phishing attempts. You should also be wary of trusting websites that look like they belong to your financial institution, especially if you click to them from a browser search. Cybercriminals can easily build convincing (but spoofed) websites and place the malicious links at the top of search results. Bookmark the trusted link rather than going through a search engine, or use the verified app on your mobile device. Always avoid clicking directly from unsolicited communication, and check URLs and email addresses carefully, as scammers can also use homographs to hide malicious links.  Finally, protect your personal information. Use complex, unique passwords stored securely (such as in a password manager), enable a stronger form of MFA (and never give away codes), and limit what you share online. Scammers may use what you've posted—like your date of birth, pet's name, or information about family members—to get past your security questions, guess your password, or make an impersonation attempt sound more convincing. The IC3 also recommends monitoring your financial accounts for irregularities, such as unauthorized withdrawals or transfers, which may be a sign of an account takeover. Consider setting up transaction alerts with your financial institutions to be notified immediately of any suspicious activity. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It's Easier to Fall for a Bank Fraud Scam Than You Think",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBGJT85Y2K9RYW909X3WDXDV/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T14:00:00.000Z",
      "dateModified": "2025-12-03T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
    "url": "https://lifehacker.com/tech/apple-support-ticket-imitation-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-05T20:00:00.000Z",
    "description": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For",
    "body": "\n        \n        You may have a keen eye for spotting scams, but fraudsters are finding new ways to weaponize trusted systems to avoid detection. For example, threat actors are generating real Apple support tickets to phish two-factor authentication (2FA) codes and gain access to iCloud accounts. The scheme, detailed on Medium by a security researcher and software product manager Eric Moret, shows how social engineering tactics can sow just enough fear and confusion to trick even those who know the red flags. (The money transfer scam that conned a financial advice columnist out of $50,000 is another example.) How scammers are exploiting Apple's support systemThe Apple support scam started with a text message from Apple containing a 2FA code, followed by verification notifications across devices, indicating that someone was trying to log into Moret's account. He then received an automated call from Apple with another 2FA code. The text was delivered from a five-digit short code, and the call from a toll-free number, both of which are used by legitimate businesses and not necessarily red flags of a scam.\nThe next call, however, came from an Atlanta-based 404 phone number. The caller claimed to be from Apple Support, stated that Moret's account was under attack, and assured him that they were opening up a support ticket. During a follow-up call lasting 25 minutes, Moret received a real Apple Support case confirmation via email (it turns out anyone can create an Apple support ticket in someone else's name) and was directed to reset his iCloud password. He was then sent a link via text—from the 404 number this time—to close the ticket. After clicking through, Moret was directed to a phishing website that spoofed a real Apple page (the URL was appeal-apple[dot]com), where he was prompted to enter a 6-digit 2FA code he'd just received via text. An email to his inbox then alerted him that an unknown Mac mini had been used to sign into his iCloud account, which the rep on the phone told him was \"expected as part of the security process\" and \"standard procedure.\" Moret then immediately reset his iCloud password again to kick the unauthorized device off.  It may be easy in hindsight to see the signs: the unsolicited call about an urgent security issue, the 404 number, the phishing link that isn't a real Apple subdomain, the request for an authentication code. But the Apple support ticket—with a real case number and official emails from apple.com domains—lent just enough credibility, and the multiple 2FA notifications just enough urgency, to work.  \n            \n                What do you think so far?\n            \n        \nThat's the problem with social engineering. It manipulates emotions and instincts that are stronger than logic and reason, leading to actions that are not in our interest. How to stay safe As always, you should be wary of anyone who calls, texts, or emails you about a security or account issue, even if you have received real security alerts or they have a legitimate case number. Don't click links, enter credentials, or provide codes when prompted by these unsolicited callers. Don't accept reassurance from anyone on the phone, no matter how calm and confident they sound. If you are concerned, you should reach out directly using trusted contact information or open support tickets yourself. Always check URLs and subdomains carefully, as hackers can play tricks to make them look legit. Also, know that simply having 2FA enabled isn't enough to keep your accounts secure. Some forms are (obviously) easily phished, so if possible, you should use a multi-factor authentication method like a hardware key or WebAuthn credentials (biometrics and passkeys) rather than codes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Surprisingly Convincing Phishing Scam Imitates Apple Support",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBQT32MVCHGMC1BT7C0WBR01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-05T20:00:00.000Z",
      "dateModified": "2025-12-05T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Windows Update Pop-Up Is a Scam",
    "url": "https://lifehacker.com/tech/windows-update-pop-up-clickfix-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T17:30:00.000Z",
    "description": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto dev",
    "body": "\n        \n        The update screen is a normal occurrence on Windows machines, so of course hackers are now manipulating it to sneak malware onto devices. The scheme, a recent iteration of a ClickFix attack, is designed to trick you into executing a dangerous command under the guise of completing a \"critical security update.\" But what you're actually doing is installing an infostealer that hands data over to bad actors. When a Windows update pop-up is actually a ClickFix attackClickFix is a social engineering ploy that uses tactics like fake error messages, CAPTCHA forms, and command prompts to deliver malware to your device. As PCMag reports, the Windows update scam is a pop-up that looks like a standard Windows blue screen but is actually a full screen browser page being displayed from a malicious domain. The ClickFix element is a set of keystrokes—not part of the real update interface—that have the user paste and execute a malicious command, ultimately delivering malware to their device. These instructions have an air of urgency, which is a common element of a scam. \nResearchers at cybersecurity firm Huntress have detailed the exact mechanism behind this attack, including an iteration in which users are prompted to verify they are human (rather than complete a security update). As Bleeping Computer outlines, the malicious code is embedded into the pixel data of PNG images, and the final payload is one of two known infostealers.According to the Huntress analysis, following a recent law enforcement operation, fake Windows update pages continue to exist across multiple domains, but those domains no longer seem to host the malware payload. That doesn't mean, however, that this attack, or some version of it, won't pop up elsewhere. \n            \n                What do you think so far?\n            \n        \nHow to stay safe from this ClickFix attackIf you run Windows on your device, you've probably seen a blue or black update or error screen many times, and you may not be suspicious if your computer randomly begins an update or prompts you to take an extra step to confirm it. But while a legitimate update screen will have a progress indicator and instructions not to turn off your computer, you should never need to input manual commands. This is a red flag of a ClickFix attack and not something a trusted service will require.  Of course, it's important to keep your computer up to date. Microsoft releases security updates on the second Tuesday of the month, known as Patch Tuesday, and you can enable automatic updates on your machine to ensure you get fixes as soon as they're available. If you want to take additional steps to prevent ClickFix attacks on Windows, you can disable the Windows Run box to prevent unauthorized access to commands.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Windows Update Pop-Up Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBK2SENEP0XTH9T90WPKGE98/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T17:30:00.000Z",
      "dateModified": "2025-12-04T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The Ultimate Ears Wonderboom 4 Speaker",
    "url": "https://lifehacker.com/tech/my-favorite-amazon-deal-of-the-day-ultimate-ears-wonderboom-4?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JEXYTFXHD918NQ4F04DATV5M/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-02T16:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 2, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        I've been a fan of Ultimate Ears since I first got the Ultimate Ears Megaboom 3 back in 2018, and I'm still using it as my personal go-to portable speaker. The Wonderboom is their smaller, more portable version. The Wonderboom 4 released last summer, and dropped in price 40% during Cyber Monday, but you can still get it for $59.99 (originally $99.99) right now. This is the lowest price it has reached according to price-tracking tools, and it's cheaper than the Ultimate Ears Wonderboom 3.\nThe Wonderboom 4 is a slight improvement on an already good portable rugged speaker, the Wonderboom 3. It is small enough to fit in most people's hands, and it is rated IP67 for water- and dust-proofing. The 14-hour battery life completes the trifecta of what you expect on a decent portable speaker. This new version comes with USB-C for faster charging, and a Podcast mode, which tweaks the EQ to suit spoken vocals. Unfortunately, there is no full EQ customization or support with the Ultimate Ears app.The sound is where most Ultimate Ears speakers shine, using their 360-degree sound, great for group listening. Like the Podcast mode, there is also an Outdoor mode which makes the EQ sound better at higher volumes so you can listen to it outdoors in noisy environments. \n            \n                What do you think so far?\n            \n        \nAs an outdoor speaker or for someone who likes to listen to podcasts or audiobooks at home without headphones, the Wonderboom 4 is great, especially at its current $59.99 price. There aren't many outdoor speakers at this price tag that can compete with it, other than the JBL Clip 5, which is currently at the same price.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The Ultimate Ears Wonderboom 4 Speaker",
      "image": [
        "https://lifehacker.com/imagery/articles/01JEXYTFXHD918NQ4F04DATV5M/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-02T16:00:00.000Z",
      "dateModified": "2025-12-02T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]