[
  {
    "title": "Check This iPhone Setting to Make Texting Better for Everyone",
    "url": "https://lifehacker.com/tech/check-this-iphone-setting-to-make-texting-better-for-everyone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-13T21:00:28.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: enesdigital / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Hey, would you mind doing me a favor real quick? If you're on an iPhone, can you double check that you've got RCS chat enabled for me? Thanks, I appreciate it. See, as an Android user, I don't get to use all the fun iMessage features, but RCS lets us share some of them. The only problem is, iPhones seem to sometimes disable RCS for some chats after an update. Or for no reason at all.RCS has been around for a while, but since it needs to be supported on both the carrier and device level, it's taken some time to reach ubiquity. Understandably, you might have seen some chat conversations between iOS and Android users that still default to the older SMS-style texting, and just gone about your day. However, these days, if you're chatting with your Android friends and you don't see read receipts, or your pictures and videos are coming through in potato quality, there's probably an easy fix.To check if RCS is enabled on your phone:\nOpen the Settings app on your iOS device, then go to Apps.Go to Messages > RCS MessagingEnable the RCS Messaging toggle.And that's it! If you text your contacts from multiple devices, it's also worth checking for RCS support on each of them. It might be a little annoying, but trust me, your Android friends will thank you.\n            \n                What do you think so far?\n            \n        \nIf you're the one using an Android phone, it can also be worth double-checking that RCS support is enabled, although it's less likely to be a problem. While iOS devices support both iMessage and RCS as robust texting options, Android only has RCS. Both platforms can fall back to SMS, but your Android phone probably reaches for RCS as a default. Still, it can't hurt to check. The specific directions will differ based on manufacturer, but generally you can go to your default messaging app's settings and look for an \"RCS Chats\" section to make sure the protocol is enabled on your end as well.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Check This iPhone Setting to Make Texting Better for Everyone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWDA68BYW5KT04J8C7XHEHA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-13T21:00:28.000Z",
      "dateModified": "2026-01-13T21:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Updates All Your Mac Apps in One Place",
    "url": "https://lifehacker.com/tech/this-app-updates-all-your-mac-apps-in-one-place?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWERQ8EQVDBH11T8C08850Q/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-14T13:00:36.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Are you tired of every application you open offering to install an update before you can use it? Do you wish you could take care of all those updates at once? Updatest is an application made for exactly this.I've talked about Homebrew for Mac, which is a command line tool for installing and updating Mac software. Updatest scans all the software on your computer and updates it using Homebrew, even if you didn't initially install it that way. But there's more. Many applications use an open source tool called Sparkle to offer updates, and Updatest can find and update all of them. The application can also identify applications downloaded from GitHub that have newer releases, along with any application you downloaded from the Mac App Store.Basically, if an application has updates, Updatest can find them and install them for you. To get started, click the download button on the app's website (you can also install using Homebrew, if you've already set that up). The application will tell you a bit about how it works, ask you which categories of applications you want to update using the tool, and offer to install Homebrew if you haven't done that already.\nOnce you're done with all of that, you will see a list of all the applications on your system. You can filter to see only the apps that need updates, if you want.Click any application to learn more about the update. From here you can install the update. Alternatively, you can click the Bulk Update button below the search bar to update all of your outdated applications at once. You can watch the updates happen by clicking the Terminal button in the top-right corner, or you can let the application do its thing while you work on something else.\n            \n                What do you think so far?\n            \n        \nSome updates require passwords, in which case you'll be asked to run the update command in the Terminal.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nAnd in some cases, applications from the Mac App Store won't update—in my tests, this was mostly iPad apps I've installed. The application will instead give you a link to open the App Store and install the update.These minor annoyances are inevitable, and not too burdensome. And it's nice to be able to check all of my applications for updates in once place. If you're interested, there's a 15-day free trial, allowing you to get a feel for how the application works. After that you can buy a personal license, which works on up to three Macs, for $9.99; a household license, which works on up to 10 Macs, costs $19.99.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Updates All Your Mac Apps in One Place",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWERQ8EQVDBH11T8C08850Q/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-14T13:00:36.000Z",
      "dateModified": "2026-01-14T13:00:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Now Block Your Kids From Watching YouTube Shorts",
    "url": "https://lifehacker.com/tech/how-to-block-kids-from-watching-youtube-shorts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEYPRFYZAJBMDJWKZXPBKRNW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T18:00:47.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: PixieMe/Shutterstock\n                            \n            \n                Key Takeaways\n                                            YouTube is now allowing parents to block Shorts for their kids.\n                                            The company is rolling out the option to set YouTube Shorts timer to \"zero\" for kids, effectively blocking the service.\n                                            This should be a welcome change for parents who want their kids to have access to YouTube, without the option to watch endless short-form video content.\n                                    \n            \n    Table of Contents\n    \n        \n        Short form videos are addicting. They're also often low quality, AI-generated, misinformation, or some combination of the bunch, and may have a negative impact on our attention spans and mental health. In short, they're just not that good for us. It's bad enough for grown adults to control their scrolling habits, but it's another thing entirely for children, which poses quite the a challenge.It's easy enough to ban short-form video apps entirely, like TikTok. But what about apps that have short-form content as just one pillar of the overall package? Take YouTube: You might not mind your child having limited access to the app or site to watch long-form content you approve of, but having Shorts always in the way throws a wrench in that system. Any type of short-form video feed would be an issue here, but YouTube Shorts is particularly egregious, allowing kids to watch some truly horrific content, often generated by AI. Choosing whether your kids watch YouTube ShortsLuckily, YouTube finally appears to be giving parents some control here. As spotted by TechCrunch, YouTube announced updates to its parental controls on Wednesday. While there are a few changes on the way, the headline for me concerns Shorts. Not only will YouTube let parents choose a timer for how often their kids can watch Shorts, they can choose to set the timer to zero—effectively blocking Shorts for their kids' and teens' accounts. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThis should be welcome news to any parents struggling to limit the short-form video content their kids are watching. You can let them watch other types of videos on YouTube Kids, or even standard YouTube if its a teen account, without worrying about them going down short-form video rabbit holes for hours. \n            \n                What do you think so far?\n            \n        \nThe control here can be even more granular than an outright ban, too. Since you're always in control of the timer, YouTube says you can customize timers based on the scenario: You could set the Shorts timer to zero during homework time, then offer 30 minutes of scrolling after dinner. You could bump that to 60 minutes on weekends, or when in the car. If your child is under a supervised account, you'll also be able to control both custom Bedtime and \"Take a Break\" reminders. This is not the first time YouTube has offered users more control over Shorts. Last week, the company rolled out a new search filter that lets you choose to only see long-form videos in any given result, and since October, you've been able to limit the number of shorts you can watch in a day. YouTube, and parent company Google, are also expanding parental controls and enhancing protections for kids and teens. YouTube now uses AI to guess your age, and, if it believes you're under 18, will add restrictions to your account. Google also gives parents more control over supervised accounts: Previously, teens could choose to remove supervision after turning 13, but now, they need their parents to sign off on it too.     \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Now Block Your Kids From Watching YouTube Shorts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEYPRFYZAJBMDJWKZXPBKRNW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T18:00:47.000Z",
      "dateModified": "2026-01-14T18:00:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
    "url": "https://lifehacker.com/tech/microsoft-patch-tuesday-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T13:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: ACHPF/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Microsoft's Patch Tuesday update for January addresses 114 vulnerabilities in total, including three zero-days.\n                                            Eight of the vulnerabilities are labeled as \"critical.\"\n                                            Ensure your Windows machine has updated and installed these security fixes.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft has released its \"Patch Tuesday\" update for January, and you should ensure your computer receives these security fixes as soon as possible. This update addresses 114 vulnerabilities in total, including three zero-days (bugs that have been actively exploited or publicly disclosed before an official fix is available from the developer). As reported by BleepingComputer, security flaws were found across the following categories: 57 elevation-of-privilege vulnerabilities, three security feature bypass vulnerabilities, 22 remote code-execution vulnerabilities, 22 information disclosure vulnerabilities, two denial of service vulnerabilities, and five spoofing vulnerabilities. Six of the remote code execution vulnerabilities and two of the elevation of privilege vulnerabilities are considered \"critical.\" Your machine should receive security updates automatically when Patch Tuesday drops, which is around 10 am PT on the second Tuesday of the month. You can check to confirm by going to Start > Settings > Windows Update and selecting Check for Windows updates\nThree zero-days patched in JanuaryOne of the three zero-days fixed this month has been actively exploited in the wild. The flaw, labeled CVE-2026-20805, is an information disclosure vulnerability in the Desktop Windows Manager that allows attackers access to memory addresses from a remote ALPC port. Microsoft Threat Intelligence Center (MSTIC) & Microsoft Security Response Center (MSRC) have been credited with identifying this bug. \n            \n                What do you think so far?\n            \n        \nThe other two zero-days have been publicly disclosed. CVE-2026-21265 is a security bypass feature vulnerability that allows threat actors to bypass Secure Boot on systems that have not updated certificates issued in 2011 and nearing expiration. CVE-2023-31096 is an elevation of privilege vulnerability in third-party Agere Soft Modem drivers that ship with supported Windows operating systems installed. Microsoft has removed these drivers from Windows. Microsoft released other non-security updates today, as well as additional patches for Microsoft Edge and Mariner vulnerabilities earlier this month.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Latest Patch Tuesday Fixes 114 Vulnerabilities",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWSRKZ2BAFKD483MGAJ5048/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T13:30:00.000Z",
      "dateModified": "2026-01-14T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Betterment Users Are Being Targeted in This Crypto Scam",
    "url": "https://lifehacker.com/money/betterment-users-are-being-targeted-in-this-crypto-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T14:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n   ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam.\n                                            Threat actors gained access to a third-party system and sent emails to some users from a legitimate Betterment subdomain.\n                                            Login credentials weren't compromised, but you should be wary of any communication about your Betterment account.\n                                    \n            \n    Table of Contents\n    \n        \n        Customers of automated investment platform Betterment are being targeted with a cryptocurrency rewards scam following a data breach that allowed threat actors to obtain some user data and send fake emails promising huge returns on Bitcoin and Ethereum deposits. According to a Jan. 12 security update posted on Betterment's website (and sent to users via email), hackers gained unauthorized access on Jan. 9 to a third-party platform used for marketing and operations. Following the breach, they sent fraudulent messages to some customers with offers to triple crypto investments. The scam emails were sent to Betterment users on Jan. 9, soon after the data breach, with subject lines like \"We'll triple your crypto!\" The message inside claimed that Betterment was \"giving back\" for a limited time and tripling Bitcoin and Ethereum deposits as large as $750,000 to specified wallets. Threat actors tried to create a sense of urgency with an expiration deadline for the promotion (a typical scam tactic). \nThe messages came from [email protected], which is a legitimate Betterment subdomain, allowing them to appear verified in users' inboxes. Note that this is the same email address Betterment used to send the security update to all of its customers. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nA nearly identical crypto scheme targeted Grubhub users in December with emails—also sent from a real Grubhub subdomain—promoting a 10x return on $1,000 in deposited bitcoin. \n            \n                What do you think so far?\n            \n        \nBetterment data hackedCybercriminals were able to steal some customer information from the compromised system, including names, email addresses, mailing addresses, phone numbers, and dates of birth. Betterment has said that no passwords or credentials were included in the breach, nor did threat actors gain access to user accounts. While few official details have been published, the company is reportedly being extorted as the target of the distributed denial-of-service (DDoS) attack. If you're a Betterment customer, be wary of any unsolicited communication in the coming days and weeks about your account. Scammers will use events like this as a phishing opportunity. Know that Betterment (and other legitimate companies) will not request your password or other personal information via email, text, or phone call. If you are concerned about your account or want to update your credentials or other data, go directly to the website or app and do so there—this is generally safer than clicking links in communication, even if messages from Betterment are (or seem) legitimate. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Betterment Users Are Being Targeted in This Crypto Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEX03B4475XYZ4N8PBFZWHRA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T14:00:00.000Z",
      "dateModified": "2026-01-14T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is Why You're Having Trouble Resizing Windows in macOS Tahoe",
    "url": "https://lifehacker.com/tech/this-is-why-you-are-having-trouble-with-windows-in-macos-tahoe?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESFZJPJ0ZR692131HZW8APJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-12T18:30:57.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Apple/YouTube\n                            \n            \n                Key Takeaways\n                                            macOS Tahoe has an odd quirk when it comes to window resizing.\n                                            The latest update makes it more difficult to grab the corner of any given window, placing most of the target area outside the window itself.\n                                            This issue seems like something that would be easy for Apple to fix, but the company has not publicly acknowledged the issue at this time.\n                                    \n            \n    Table of Contents\n    \n        \n        Apple's latest crop of updates was met with a bit of a mixed reaction. While some users love the new Liquid Glass design across iPhone, iPad, and Mac, others decidedly do not—which is likely what led Apple to introduce a dedicated setting to control the intensity of the effect. I'm partial to it, but I understand for some users, it's a tad too much, especially if it makes certain UI elements more difficult to see. But Liquid Glass isn't the only thing Apple users have complained about, especially with regards to macOS Tahoe. Mac users reported various problems with performance and stability across macOS 26.0 and macOS 26.1, and have criticized design choices like overly rounded corners. Myself, I held out on updating my M3 Pro Mac until macOS 26.2, where many of these issues appeared to be fixed, but my M1 iMac is still on macOS Sequoia for the time being. All that to say, macOS 26 hasn't had the smoothest start compared to some of Apple's previous Mac updates. If you've been noticing, for example, that your Mac's window management isn't as cooperative as it's been in the past, you're not alone. In fact, there seems to be a clear explanation for what's behind the issues. The issue with windows on macOS TahoeAs with other versions of macOS, you can resize and adjust your Mac apps' windows by clicking and dragging from the bottom corners. The issue, however, is that as of Apple's newest update, it can be fairly difficult to grab the corner of the window. You might, instead, find you click on the bottom corner of the app or website instead, leading to unintended actions. Clicking the top right corner of Chrome, for example, will drag the whole app window, rather than resize it. Clicking the bottom left corner and dragging will start to highlight everything in the app window instead, perhaps sending you all around the screen as well. \nIf you slowly hover your cursor over the corner of the window, eventually you'll find a spot that turns your cursor into a resize icon, and you'll know you're good to click and drag to resize. But why is this so much more difficult to do quickly than it was in macOS Sequoia or beyond?\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nNorbert Heger, a software developer, seemingly has an answer. In a blog post on Sunday, Heger explains that those rounded corners Apple designed for Tahoe are having a negative impact on the clickable area of the window. With a square corner, most of the clickable area—Heger says 62% of it—lies within the corner of the window itself. That gives users a relatively large area to click within the corner in order to grab onto the window, and a little bit of room outside the window to click, as well. But these new rounded corners don't seem to take that into consideration. Instead, they're relying on the same click area as before, but because there's less corner to work with now, the actual clickable area of the window is far less. Heger says about 75% of the clickable area now exists outside the window itself, giving users just 25% to work with in the actual corner of the window. \n            \n                What do you think so far?\n            \n        \nIf you're running macOS Tahoe, you can try this out for yourself right now: Move your cursor to the corner of the window, and wait for it to change into the resize icon. If you're hovering within the window itself, it won't change until you're just about to move outside the window. You can keep going a bit, and see you can get pretty darn far outside the window before the cursor changes back. \n    \n            \n            Why am I able to resize the window from outside the window, Apple?\n                                        Credit: Lifehacker\n                    \n    \nThis seems like a relatively easy fix on Apple's part, assuming they're aware of the issue. Maybe a patch will even make it into macOS 26.3. That said, the company has not publicly acknowledged the quirk, so it's anyone's guess. Until a potential fix, those of us on macOS Tahoe will just need to retrain our muscle memories around window resizing. For anyone who hasn't upgraded yet, you can simply carry on as usual. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is Why You're Having Trouble Resizing Windows in macOS Tahoe",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESFZJPJ0ZR692131HZW8APJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-12T18:30:57.000Z",
      "dateModified": "2026-01-12T18:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Stylish Marshall Headphones Are $100 Off Right Now",
    "url": "https://lifehacker.com/tech/marshall-iii-headphones-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Marshall/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The ANC headphones from Sony and Bose are great, but they look like gadgets, not music gear. Luckily, Marshall is offering these Monitor III ANC earbuds, which offer a cool retro look. And right now, they're available for the lowest price ever, at $279.99 (down from $379.99), beating the heavyweights from Sony and Bose on price.\nThese Monitor III headphones feature the iconic Marshall script logo, a retro brass control knob (instead of touch buttons), and a textured black vinyl finish that mimics Marshall guitar amps. Other than the looks, the most impressive part is the battery life. These will last you for 70 hours of ANC playback (and 100 hours without ANC). That is a staggering number; for comparison, the Sony XM6 gets you 30-40 hours of playback per charge. The headphones are also collapsible, folding into a small ball. They come with a hard-shell travel case and are pretty lightweight, too, at 250 grams. There is no 3.5mm headphone jack here, but the box does include a USB-C to 3.5mm cable for wired listening.They feature the signature Marshall sound, warm and punchy. They are tuned for listening to rock, heavy metal and guitar-heavy music, and offer a more fun sound profile compared to Sony or Bose, which can sound a bit more flat or balanced.\n            \n                What do you think so far?\n            \n        \nIn its review, PCMag gave the Monitor IIIs a 4.0 star rating, noting that they deliver a \"pleasing audio signature, a comfortable fit with intuitive controls, easy portability, and excellent battery life.\" \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Stylish Marshall Headphones Are $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T17:00:00.000Z",
      "dateModified": "2026-01-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
    "url": "https://lifehacker.com/tech/gmail-ending-pop3-support-email-importing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T21:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n    ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Ascannio / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is removing support for the POP3 protocol, which allows users to sync emails from third-party accounts into Gmail.\n                                            POP3 is an older standard of syncing emails, so it's not surprising that Google's disallowing it.\n                                            There are a couple of other ways to make sure you can still import emails from other accounts into Gmail., such as email forwarding and IMAP.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've been running several email accounts through your Gmail, you might want to double-check your settings this month—that's because Google is ending support for the POP3 protocol that can sync emails from third-party accounts. And while there are some other solutions, they don't work quite the same.POP3 is an older standard of syncing emails between multiple accounts that allowed users to import emails from a third-party account and manage them in one spot. It's also a less secure method of transferring emails, so it's not a total surprise that Google is phasing it out, but the company hasn't broadcast the change too loudly, so it might come as a surprise to some users.How to keep your third-party accounts working in GmailIf you're still using POP3 to fetch your emails from a third-party account, there are a couple of ways to fix it before Google pulls the plug:\nForward emails from your other accounts. Rather than having Gmail reach out to your third-party accounts, you can set up automatic forwarding on the other end. How to do this will depend on which email providers you use, so check your third-party account settings for forwarding options.Use IMAP to check your email from the Gmail apps. In the Gmail app for Android and iOS, you can log into third-party email accounts that support IMAP connections.The IMAP protocol works a bit differently than POP3. While POP3 would import messages into your Gmail but leave the original, IMAP syncs between your accounts. So if you use the Gmail app to check your email and delete some messages, they'll be gone if you check the original account later.\n            \n                What do you think so far?\n            \n        \nGoogle's support doc says this change will take effect \"Starting January 2026\" with no more specific time frame. At time of writing, POP3 support is still working on my own email accounts, so it's not disabled just yet, but it's a good idea to update your email setup sooner rather than later.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's Getting Rid of a Way to Import Third-Party Accounts Into Gmail",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFPNQA250RDQZVEXF1CWENH/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T21:30:00.000Z",
      "dateModified": "2026-01-08T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
    "url": "https://lifehacker.com/tech/this-accessory-turns-your-macbook-display-into-a-touchscreen-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T16:30:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Intricuit\n                            \n    Table of Contents\n    \n        \n        Plenty of people have been asking for a MacBook with a touchscreen display, and now that is possible with the Intricuit Magic Screen, according to an announcement at CES 2026. It's a snap-on accessory that attaches to your MacBook's display, and uses one of the USB-C ports on the laptop for power. Once connected, you can touch the Magic Screen and your input will be registered on the Mac.The good news is that this product ships with a stylus, which will make it a lot easier to interact with different Mac apps. When you tap something on your iPhone or iPad, the UI takes into account the fact that your fingers are a lot thicker than a mouse pointer. On the Mac, the default input is the mouse cursor, so the Magic Screen's stylus is better suited to those interactions than using your fingers. Having said that, you can use your fingers with this touchscreen accessory too.Keep in mind that using a snap-on touchscreen accessory has a few caveats. The first is that you can't quickly close your MacBook's lid when the Magic Screen is attached. The company has added a thick piece of plastic to the base of the accessory. This part rests just above your MacBook's keyboard and it'll stop you from accidentally closing your laptop's lid with the Magic Screen attached. This ensures that you won't accidentally damage your laptop'd display by slamming the lid shut when the accessory is attached.\nIt also means that you'll always have to unplug the Magic Screen when you're not using the Mac, which can be a bit annoying. Intricuit says it also works in pen tablet mode, so you can place the Magic Screen on your desk and use your stylus to draw something or to control the Mac. This accessory's battery will last up to 100 hours on a single charge, the company claims.\n            \n                What do you think so far?\n            \n        \nIntricuit announced this product at CES 2026 and said the Magic Screen will be on Kickstarter soon at a launch price of $139. The company says it expects to start shipping the product in the first quarter of 2026. It currently supports the 16-inch M-series MacBook Pro, 14-inch M-series MacBook Pro, 15-inch M-series MacBook Air, and 13-inch M-series MacBook Air models. You'll just need to choose the correct variant for your laptop while placing the order.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T16:30:07.000Z",
      "dateModified": "2026-01-07T16:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why TikTokers Are Injecting Salmon Sperm Into Their Faces",
    "url": "https://lifehacker.com/health/why-tiktokers-are-injecting-salmon-sperm-into-their-faces?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEW08J4P0BDDP5Z1TZFY9GYW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-14T16:30:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith Dietz is Lifehacker’s Senior Staff Writer. She earned her bachelor’s degree in English and Communications from Northeastern University, where she graduated as valedictorian of her college. She grew up waitressing in her family restaurant in Wilmington, DE and worked at Hasbro Games, where she wrote rules for new games. Previously, she worked in the non-profit space as a Leadership Resident with the Harpswell Foundation in Phnom Penh, Cambodia; later, she was a travel coordinator for a study abroad program that traced the rise of fascist propaganda across Western Europe.Meredith is a marathon runner and stand-up comedian who has been a regular contributor to The Onion and Reductress. Meredith lives in Brooklyn, NY.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Meredith Dietz\n                            \n    Table of Contents\n    \n        \n        Scroll through TikTok or Instagram, and you'll find influencers swearing by unconventional treatments, posting dramatic before-and-after photos and glowing testimonials about their rejuvenated skin. And the skincare \"It Girl\" of the moment? It's salmon sperm. Yeah.As we kick off the new year—prime time for beauty resolutions!—a growing number of people are seeking out \"salmon sperm facials.\" Before your imagination paints an extra fishy picture (pun intended), understand that people aren't really smearing straight-up salmon sperm on their face. The secret ingredient is something called PDRN, or polydeoxyribonucleotide, a compound extracted from salmon DNA. So, what exactly is this secret ingredient, and is it truly the next frontier in anti-aging skincare?The science behind the hypePDRN isn't totally snake oil; the compound has legitimate clinical backing for its regenerative properties. Research suggests that PDRN can stimulate tissue repair, promote collagen production, and improve skin elasticity by activating adenosine receptors in cells. Several sources claim it's been used in medical applications since the 1980s in Italy and South Korea. Whatever the actual origins, PDRN has gradually made its way into mainstream skincare.\n\n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nThe treatment typically involves a series of micro-injections delivered directly into the skin, similar to mesotherapy or microneedling procedures. In the U.S., however, PDRN is only legal to use topically, since the FDA qualifies it as a beauty product and not a drug. Proponents claim it can reduce fine lines, improve skin texture, minimize scarring, and create an overall more youthful appearance. Unlike other cosmetic procedures that simply fill or temporarily plump the skin, PDRN is said to actually stimulate the skin's natural healing processes. But as always, there's a significant gap between reality and what you see online. The reality checkSocial media thrives on transformation narratives, and skincare content is no exception. The algorithms favor dramatic reveals, leading creators to emphasize stunning results while downplaying less glamorous details—like the fact that these injections can be quite painful according to some. \"While PDRN has legitimate clinical data supporting skin repair and regeneration,\" says Dr. Claudia Kim, \"viral content often exaggerates results and glosses over who is—and isn't—an appropriate candidate. Context and medical supervision matter.\" When it comes to the injections specifically, these treatments can cause temporary swelling and bruising. At the very least, they could require multiple sessions to see results. \n            \n                What do you think so far?\n            \n        \nAgain: If you're in the U.S., and there's a syringe full of salmon sperm headed straight for you, it might not be FDA-approved. That means its purity, safety, and effectiveness are not regulated. As with any medical aesthetic procedure, you shouldn't sign up for PDRN treatments without careful consideration—considerations that extend beyond the promise of better skin. Do you know which salmon DNA procedure you're signing up for? Is it an injection, or is it technically microneedling? Did you opt for PDRN or PN (polynucleotides), a purer and more concentrated form of PDRN? To make things even more confusing, these treatments can go by different names, from “salmon skin facials,” to “salmon sperm injections,” or “PDRN facials” to the brand name Rejuran. One thing is sure: As demand grows, so does the risk of unqualified practitioners offering the treatment, potentially leading to complications or disappointing results.The bottom lineThe salmon sperm trend may sound bizarre, but there is science backing it up. And when your favorite beauty influencer credits their glowing skin to a specific treatment, it's tempting to believe you can achieve the same results. Social media will always continue to drive beauty trends, and there's nothing inherently wrong with being inspired by what you see online. But for your looks and your safety, you need to understand the difference between a carefully curated social media moment and the full reality of medical aesthetic procedures.If you're intrigued by PDRN treatments after seeing them online, consult with a qualified dermatologist or licensed aesthetic practitioner. They can assess whether you're an appropriate candidate, explain realistic expectations, discuss potential side effects, and ensure the treatment is administered safely. As more advanced treatments become increasingly accessible and visible online, don't let TikTok influencers replace professional medical consultation. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why TikTokers Are Injecting Salmon Sperm Into Their Faces",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEW08J4P0BDDP5Z1TZFY9GYW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-14T16:30:00.000Z",
      "dateModified": "2026-01-14T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
    "url": "https://lifehacker.com/tech/find-free-movies-legally-with-wikiflix-a-database-of-films-in-the-public?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-13T14:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n  ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                David Nield\n                            \n        \n            David Nield\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceDavid Nield is a technology journalist from Manchester in the U.K. who has been writing about gadgets and apps for more than 20 years. He has a bachelor's degree in English Literature from Durham University, where he also spent a term as editor of the award-winning student newspaper Palatinate. His journalism career started in print media, where he contributed to and edited several technology magazines and bookazines sold in the U.K. and internationally. More recently, he has worked as a freelancer for some of the biggest technology publications on the web, covering everything from on-the-ground reporting about product launches, to detailed explainers and how-to guides on apps, gadgets, and platforms. His expertise covers broad areas of consumer tech, including smartphones, laptops, wearables, and AI.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lifehacker\n                            \n    Table of Contents\n    \n        \n        I love movies, and especially when I can watch them for free: And while streaming the latest Hollywood blockbusters might come at a price (at least for those wanting to stay on the right side of the law), there's an ever-growing collection of older films that you can get at online without paying a dime.The site WikiFlix (as spotted by the fine folks at Gizmodo) lists movies available to stream that are now in the public domain. The way that copyright works in the U.S. basically means that copyright expires on films after a period of 95 years—so with every year that passes, a batch of new flicks become available to view by anyone, free of charge.If you're looking for something classic for your next movie night, it's well worth a look. \n\n    \n            \n            There are plenty of categories to choose from.\n                                        Credit: Lifehacker\n                    \n    \nWikiFlix is straightforward to use, right from the homepage. It tracks films added to sites such as Wikimedia Commons, YouTube, and the Internet Archive, and whenever you click through on a movie, you can also see where it has come from. When you've made your pick, it streams right in your browser window.The home page is split up into categories that you can browse through—including female directions, animations, and biographical films, the last time I checked—and there's also a search button up in the top right corner if you know what you're looking for. Next to the search button is an account button, which enables you to sign up for a MediaWiki account if you want to be able to contribute to the site too.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nHover over the main WikiFlix heading at the top of the page and a quick link to Movies by year pops up. This is a useful way of finding the most recent flicks added to WikiFlix, and digging back into the archive—not all of the movies here are in the public domain because their copyright has expired, and you will find more recent titles too.Click through on any thumbnail to get more information about each movie. You can typically get information on the director, cast, and running time, and a plot summary is included too. Some of the entries come with trailers (although you can also search for these separately on sites like YouTube).\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            Each movie comes with a cast list.\n                                        Credit: Lifehacker\n                    \n    \nStart streaming a movie, and the usual playback controls appear, though the interface does depend to some extent on the site that's hosting the movie. For films hosted on YouTube, for example, you can typically adjust the playback quality and speed. Some movies come with subtitles too.Obviously a site like this is going to skew towards older, classic movies, but there's plenty to explore here: Metropolis, It's a Wonderful Life, All Quiet on the Western Front, Nosferatu, Charlie Chaplin comedy The Gold Rush, and lots more.Free movie repositories aren't quite as rare online as you might think. We've written before about the best free and legal streaming services for movies and TV, featuring ad-supported streaming platforms such as Tubi and PlutoTV. Again, the emphasis is on older films, but there's a huge amount on offer at no charge.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Find Free Movies (Legally) With WikiFlix, a Database of Films in the Public Domain",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEVNNV3VH06MZKWV4DHKQWP5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-13T14:00:00.000Z",
      "dateModified": "2026-01-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Budget 65-Inch Hisense QLED TV Is Over $300 Off",
    "url": "https://lifehacker.com/tech/hisense-65-inch-qled-tv-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEWE4ZCM1QS92W6FE03RRG39/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-13T20:30:14.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 13, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Rene Ramos.\n                            \n    Table of Contents\n    \n        \n        Budget TVs have improved dramatically over the years, and the Hisense U6 Series is a great example of what you can get today for a \"budget\" price. This is a QLED Mini LED TV, so while it's not at the quality that OLED TVs can offer, it makes up for it with a much lower price. Right now, the 65-inch Hisense Class U6 Series TV is $529.96 (originally $847.99), the lowest price it has been, according to price-checking tools.\nDon't let the budget price fool you; this is a quality TV. The best one of 2025, according to PCMag's \"outstanding\" review. Its main attributes are its incredible levels of brightness, peaking at 1,024 nits, and its beautiful colors. This is expected from a QLED Mini LED TV, but not for under $550 for a 65-inch TV. It is also packed with features and specs that you won't find in other TVs at this price.The refresh rate is 144Hz with VRR and AMD FreeSync Premium Pro, making it a good option to play games. You'll get an input lag of 4.6 ms at 1080p and 13.1 ms at 4K. For those who pay premium in their streaming apps for HDR, you'll be able to take advantage of HDR10+ and Dolby Vision IQ. If you have a surround sound system, you'll also be able to take advantage of Dolby Atmos for a more immersive, 3D sound.The biggest downside, in my opinion, is that the OS is Amazon’s Fire TV, but that's fixable with a TV stick, and also down to preference. While there is no hands-free voice control, there is Apple AirPlay for casting devices.\n            \n                What do you think so far?\n            \n        \nIf you're looking for a 65-inch TV that punches above its price tag, is at a great discount, offers great colors, brightness, and features, get the Hisense Class U6 Series TV.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Budget 65-Inch Hisense QLED TV Is Over $300 Off",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEWE4ZCM1QS92W6FE03RRG39/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-13T20:30:14.000Z",
      "dateModified": "2026-01-13T20:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The 77-inch Sony Bravia A95L OLED TV",
    "url": "https://lifehacker.com/tech/my-favorite-amazon-deal-of-the-day-the-77-inch-sony-bravia-a95l-oled-tv?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESK60XJ5CPSXP9SC2BSZKT3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-12T17:30:41.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        As is usually the case during CES, older models get big discounts, making it one of the best times to shop for premium tech. If you've been looking for a massive OLED TV with a massive discount, it doesn't get much better than the 77-inch Sony Bravia A95L OLED TV, currently going for $3,498 (originally $4,999.99). This is the lowest price this premium TV has ever reached, according to price-tracking tools.\n The 77-inch Bravia A95L uses the same QD-OLED panel technology that has been successful with Samsung's OLED TVs, and it combines it with their best-in-class Cognitive Processor XR. This makes the color volume, peak brightness in HDR content, and motion handling one of the best in OLED TVs, even in 2026. This makes it a great OLED TV for people who want a premium theater TV that can also look great while gaming. \n            \n                What do you think so far?\n            \n        \nThe A95L comes with the Google TV smart interface, which is my personal favorite since it makes casting to the TV from your phone or laptop easy, and has an internal microphone for hands-free voice control. There aren't many options for 77-inch premium OLED TVs, and even fewer that have withstood the test of time. The Bravia A95L is still relevant in 2026 for its quality, size, but most importantly, its price. If you can afford it and have a wall big enough for it, this massive OLED is a bargain.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The 77-inch Sony Bravia A95L OLED TV",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESK60XJ5CPSXP9SC2BSZKT3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-12T17:30:41.000Z",
      "dateModified": "2026-01-12T17:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This App Brings Some of My Favorite Windows Features to Mac",
    "url": "https://lifehacker.com/tech/this-app-brings-some-of-my-favorite-windows-features-to-mac?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-14T15:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 14, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: aileenchik via Shutterstock\n                            \n    Table of Contents\n    \n        \n        As someone who regularly switches between the Mac and PC, I really can't live without the PowerToys app on Windows. It adds little missing features that I really like on the Mac, like a Spotlight Search alternative, auto dark mode, screen awake, on-screen OCR (which lets you pull text from images), and more.But the reverse is also true. When I'm on MacOS, I start to miss the little features and commands that I've been used to Windows having for decades now (I started using Windows in school, but was only exposed to macOS when I was in college).It's the little things, like not being able to cut and paste files in Finder. And why must I accidentally open the Music app every time I press the play button? This is just the beginning.\nEnter Supercharge, a utility from prolific indie developer Sindre Sorhus. Think of it not as a single app, but as a Swiss army knife for your menu bar—a collection of micro-utilities designed to patch the specific usability holes that Apple has left open, many of which Microsoft has already plugged. The app offers an unlimited free trial (with a prompt to upgrade every 12 hours), or you can buy it outright for $18. It's also available as part of a Setapp subscription. \n    \n            \n            \n                                        Credit: Supercharge\n                    \n    \nThe best Supercharge tweaks that you should enableThe Supercharge app works in two ways. The first is by giving you a set-and-forget settings menu. Secondly, it adds a menu bar app where you can quickly access small features on the fly.The tweaks part, to me, is a lot more interesting. Once the app is installed, open the menu bar app and go to Settings. Go to the Tweaks tab and take some time to customize your Mac's behavior.Make Finder work more like Windows File Explorer\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe Finder is where Supercharge shines, fixing legacy behaviors that have frustrated Windows switchers for years. The first thing I enabled was the \"Cut and Paste\" functionality. Finally, you can use Cmd+X to cut a file and Cmd+V to move it, eliminating the awkward Cmd+C followed by Cmd+Option+V dance required by default.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nBeyond moving files, the app allows you to enable the Option+N shortcut to instantly create a new text file in your current folder—another Windows muscle memory I've had for decades. Additional tweaks include toggling the Enter key to open a file instead of renaming it, and an option to show hidden files by default.Mission Control featuresApple's Mission Control provides a bird's-eye view of all your windows, but it's hardly interactive. Supercharge changes that by adding window management buttons directly to the overlay. You can now add dedicated Close, Minimize, and Quit buttons for every window inside Mission Control, helping you clear cluttered app windows in seconds, and in a fairly visual way.Dock enhancementsSupercharge also brings much-needed flexibility to the Dock, making it more like the taskbar on Windows or Linux. Enable the Click-to-Hide feature, and you can minimize or hide an app simply by clicking on the app icon. My favorite, though, is the option to open folders directly in the Finder from the Dock. You can also set Supercharge to add spacers to the Dock, and quit apps using the middle-click mouse button.\n            \n                What do you think so far?\n            \n        \nThe Apple Music app fixPerhaps the most useful fix in the entire suite is the ability to stop Apple Music from launching automatically. This feature stops the app from popping up when you press Play on your keyboard or Bluetooth headphones. If you are a dedicated Spotify user or simply dislike it when your headphones accidentally wake up Apple Music, this feature alone makes a Supercharge installation worth it.Other useful featuresThe Supercharge app includes several other quality-of-life improvements. The Notification Nuke feature allows you to set a global hotkey to instantly clear all notifications from Notification Center, acting as a panic button for focus. To prevent accidents, you can also enable Accidental Quit Prevention, which requires a double-press or a Shift + Cmd + Q combo to actually quit an application.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nThe second part of the equation here is the menu bar app. Here, you can add small missing features that usually require downloading separate apps. There are more than two dozen options. Go to Settings > General > Show Menu Items to see the whole list.Here, you can add options to quickly capture and copy any text from an image (or translate it). There are one-click options for hiding all windows, showing the desktop, quitting all apps except the current one, clearing all notifications, and more. There's also a simple Keep Awake feature that will keep your Mac active even when the screen is off. And there's also a simple default browser switcher built-in, though I prefer using Sindre's dedicated Default Browser app.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This App Brings Some of My Favorite Windows Features to Mac",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEXSRGN5TZ31YRPCRT6TZGJD/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-14T15:00:00.000Z",
      "dateModified": "2026-01-14T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four Ways to Speed Up Your Hot Water (Without Installing a Tankless Water Heater)",
    "url": "https://lifehacker.com/home/how-to-speed-up-your-hot-water-without-a-tankless-water-heater?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KESNDX88GQA4F25ZZBKVYQ0Q/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-12T19:00:19.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n  ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jeff Somers\n                            \n        \n            Jeff Somers\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceJeff Somers is a freelancer who has been writing about writing, books, personal finance, and home maintenance since 2012.Jeff has published nine novels and more than 70 short stories; his story Ringing the Changes was selected for inclusion in The Best American Mystery Stories 2006. In 2018, Jeff published the book Writing Without Rules: How to Write & Sell a Novel Without Guidelines, Experts, or (Occasionally) Pants. He holds a bachelor’s degree in English and previously worked in medical publishing as a production editor. When not writing, Jeff spends his free time fixing up his old house. He has tackled a wide range of DIY projects, including remodeling a bathroom entirely on his own in two weeks, and building a roof deck that hasn't fallen down yet. You can find him on Bluesky.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Lensw0rId / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        Despite all of the technological advances that have made our lives so comfortable and convenient, from on-demand movies to smart devices that can be controlled from a handheld computer in our pockets, there are still some primitive situations we have to endure. For example, that seemingly endless time spent shivering in the shower while you wait for the water to heat up. Or that painful moment when you go to wash your hands and water that feels like it’s being pumped directly from the Arctic splashes you.Waiting for the water to heat up is an age-old problem caused by simple laws of physics: Your water heater is far away from the tap or shower head, and it takes time to flush out the cold water in the pipes. But there are ways to speed up your hot water delivery. The easiest is to install a tankless water heater, but those can cost thousands of dollars to install, and require a lot of space your house may not have. If you want to speed up your hot water without taking on that much of an expense, you have a few more affordable choices.Install a recirculating pumpOne reason it takes a while for hot water to arrive is time: When you turn off the faucet, the hot water sitting in the pipes starts to cool off. The next time you turn on the tap, that cooled water has to be pushed out of the hot water pipes before the hot water can arrive.\n\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nTo solve this, you can have a recirculating pump installed at a cost typically under $1,000. These pumps are installed on your existing water heater, and work by continuously circulating the water in the pipes so it never sits there, cooling off. Because it’s installed at the water heater, it speeds up hot water to your appliances, as well, including washing machines and dishwashers, which can help them operate more efficiently.Point-of-use tankless heatersWhile a whole-house tankless water heater can be a big and expensive project, what’s known as a “point-of-use” tankless water heater can be a more manageable and affordable solution. These are small enough to install under a sink, and are designed to provide hot water on demand just at that point of use. The heaters themselves typically run a few hundred bucks, with installation typically running less than $1,000. Because of their small size, it’s feasible to install one of these yourself if you’re comfortable with plumbing and electrical work, but they can require careful calibration, so hiring a professional plumber is probably your best move.\n            \n                What do you think so far?\n            \n        \nInsulateSince part of the problem with slow hot water is heat loss as the water sits in the pipes, you can sometimes improve the situation just by insulating your hot water pipes thoroughly. This is definitely a DIY job if you can identify and access your hot water pipes, and it’s not a terribly expensive job to hire out, costing as little as $350 on average. It’s just a matter of wrapping the pipes with insulating cuffs, then taping everything off so it’s sealed up nicely. This can help keep water hot while it sits, so the next time you turn on the faucet, you get the hot water you expect.Adjust restrictorsCold water has to drain out of your pipes for the hot water to hit your faucet or showerhead, so one possible way to speed things up is to remove any flow regulators/restrictors that have been installed. These simple devices do exactly what it sounds like: They restrict the flow of water, conserving energy and water and keeping your utility bills lower. But since they restrict flow, they also mean it can take longer for cold water to drain off and hot water to arrive, so removing or adjusting them can reduce the time it takes for that hot water to get to you.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four Ways to Speed Up Your Hot Water (Without Installing a Tankless Water Heater)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KESNDX88GQA4F25ZZBKVYQ0Q/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-12T19:00:19.000Z",
      "dateModified": "2026-01-12T19:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]