[
  {
    "title": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
    "url": "https://lifehacker.com/tech/learn-macos-app-shortcuts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-05T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutter",
    "body": "\n        \n    \n                                        \n        \n        \n        December 5, 2025\n    \n            Credit: sergey causelove / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Using keyboard shortcuts is a lot faster than clicking around in the menus, but only after you learn them. That's the hard part.You could look up the documentation for the application or explore the menu bar—but if you're on a Mac, you could also just install KeyClu. This free application shows an overlay with all the keyboard shortcuts for the currently open Mac application, which is very useful for anyone trying to become a more keyboard-savvy computer user.To get started, install the application. Then, you'll need to choose a trigger key (basically one of the modifier keys on your keyboard). By default, you will tap the key twice and hold on the second tap to trigger the overlay, but you can optionally set the application to simply press and hold the key if you prefer. I opted to press and hold Command.\nAfter that, you'll be asked to enable permissions so KeyClu can access the keyboard shortcuts for your applications. Then you can start using the application. I tend to ignore the application until I wonder whether a keyboard shortcut for a particular function exists. I trigger the application, look through the list of keyboard shortcuts, and see what's available. When I let go of the trigger key, the window disappears.This default floating window is useful, but you might want a window listing shortcuts to stay open even when you let go of the trigger. That's where the persistent panel comes in. This window, which you can trigger using the menu bar, stays open and always shows a list of keyboard shortcuts for the currently active application. You can add a separate keyboard shortcut for this window in the settings, if you like.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIf you dig around in KeyClu's settings, you can configure the layout of both the pop-up and persistent panels, changing the size of the windows, how many columns shortcuts are sorted into, and which display the panels show up on.\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nIt's a simple piece of software, but it's completely free and can help you get better at using your computer. And if you're reading Lifehacker, that's probably something you want. Speaking of keyboard shortcuts: here are a few keyboard shortcuts you should know. You can also check out our guide to creating your own macOS keyboard shortcuts.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This macOS App Makes It Easy to See (and Use) Your Keyboard Shortcuts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQ0H4F582WCTDJF7E7Z8H/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-05T15:30:00.000Z",
      "dateModified": "2025-12-05T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New Android Feature Protects You From a Scam Call While It's Happening",
    "url": "https://lifehacker.com/tech/this-new-android-feature-protects-you-from-a-scam-call-while-its-happening?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Google / Hight Photography / Shutterstock\n                            \n            \n                Key Takeaways\n                                            Android users in the U.S. will soon have extra protection against scams targeting their financial apps.\n                                            You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call.\n                                            U.S. users will see these protections when trying to access Cash App and JPMorganChase.\n                                    \n            \n    Table of Contents\n    \n        \n        Bank impersonation is a popular scam tactic, and one I've written about a lot. Fraudsters prey on people's fear, confusion, and desire to protect their money, which may lead targets to hand over login credentials, make irreversible wire transfers, or provide other sensitive information without stopping to question their actions. Android users in the U.S. will soon have extra protection against scams targeting their financial apps, preventing threat actors impersonating bank representatives from accessing data on their devices. Google's in-call scam protection is designed to prevent users from sharing their screens with threat actors and help them avoid revealing their banking information. How Android in-call protection worksAndroid's scam protection kicks in if you are on a phone call with a number not saved in your contacts and attempt to open a participating financial app. You'll get a pop-up warning that the call is likely a scam with a reminder not to make payments or share personal information and a button to end the call (and stop screen sharing). There's also a 30-second delay on further action on your device, which Google says is designed to disrupt any sense of urgency. \nNote that financial institutions must opt into in this feature—at this time, Google has specifically named Cash App and JPMorganChase as partners, though it indicates expansion to other popular fintechs and banks. \n            \n                What do you think so far?\n            \n        \nGoogle initially rolled out in-call protections for banking apps to UK users earlier this year as part of a larger package of security features announced ahead of Google I/O. That launch also included real-time scam detection alerts for calls and texts, improved theft protection via remote lock and identity check, key verifier for Google Messages, and device-level Advanced Protection (in addition to account-level settings). Alongside the US pilot, in-call scam protections will now cover most major banks in the UK as well as financial apps in Brazil and India. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New Android Feature Protects You From a Scam Call While It's Happening",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN5YJXM3RYZVHHBB4D420Z3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:30:00.000Z",
      "dateModified": "2025-12-04T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung's One UI 8.5 Beta Is Now Officially Available",
    "url": "https://lifehacker.com/tech/samsung-galaxy-one-ui-85-beta?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBZ8XK9WHPT7MZD5TPKDJ0RX/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T16:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Framesira/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Framesira/Shutterstock\n                            \n            \n                Key Takeaways\n                                            One UI 8.5 is officially in beta, rolling out a handful of new features for Galaxy devices.\n                                            According to Samsung, the update rolls out upgrades to Photo Assist, Theft Protection, and Quick Share, as well as the ability to manage storage across Samsung devices.\n                                            The beta is currently limited to Galaxy S25 devices, though Samsung could expand that down the line.\n                                    \n            \n    Table of Contents\n    \n        \n        If you're getting bored with your Galaxy phone, there are changes on the horizon. Samsung announced One UI 8.5 on Monday, Dec. 8, the latest update for Galaxy devices. At present, this new update is only out in beta, but select Galaxy users can try it out right now. Here's what's new, according to Samsung. With One UI 8.5, Quick Share can automatically identify people in photos. While that sounds a bit creepy, the idea is to proactively offer sharing recommendations to the people who are featured in any given photo. Say you hit Quick Share on a family photo you took over the weekend. Rather than manually enter all of the contacts you'd like to share that image with, the feature can identify each, and automatically suggest sending the image to those contacts. It should speed up sharing pictures with groups of people after you take them, but, again, a little unsettling. Photo Assist updates\n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nThe Gallery app's Photo Assist feature is getting some upgrades in One UI 8.5. As of this version, Photo Assist now supports \"uninterrupted editing.\" That means you can make your AI-generated edits without needing to save in between each change. Previously, each edit would produce an entirely new image, so this makes the feature a bit more like a traditional photo editor. In addition, you'll be able to view all of the AI images you made in your edit history, and choose the one you like the most. \nSide note: Samsung says Photo Assist's Generate Edit feature requires an internet connection as well as a Samsung Account login. The feature also places a watermark on the image, so other people will know it was manipulated or generated with AI.   Audio Broadcast\n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nOne UI 8.5 now supports sharing audio to other devices via Auracast, following Google's wider support for the standard back in September. If you have any LE Audio-supported devices, like headphones or speakers, you can use Audio Broadcast to share media from your Galaxy. This isn't limited to music, podcasts, or audio from videos, either, as Samsung says you can also broadcast your Galaxy's microphone to LE Audio devices, too.  This feature is limited to Galaxy S25 devices, even after One UI 8.5 rolls out to other Galaxy phones. \n    \n            \n            \n                                        Credit: Samsung\n                    \n    \nIf you have a number of Samsung Galaxy devices, you might find Storage Share useful. This One UI 8.5 feature lets you manage your files across other devices, including tablets, PCs and even TVs, in the My Files app on your smartphone.   \n            \n                What do you think so far?\n            \n        \nEnhanced Security ControlsSamsung is also expanding One UI's security features with this latest beta. The company is rolling out updates to Theft Protection with One UI 8.5, an existing feature that can lock your device if it's lost or stolen. That way, whoever picks it up won't have access to your data, or won't be able to erase the device and set it up as their own. In that same vein, Samsung is also launching Failed Authentication Lock, which locks the display after too many failed verification attempts. If a thief tries too many PIN combinations, or the fingerprint scanner fails too many times, your screen will lock them out.  How to try the beta on your GalaxyWhile you can apply for the beta program today, first, consider the risks. Like all beta software, this version of One UI is currently in testing, which means there may be bugs and glitches that could interrupt your experience using your smartphone. If you understand these risks (and back up all important information ahead of time), here's what you need to know. First, this beta is only open for Galaxy S25 users in the U.S., Germany, India, Korea, Poland, and the UK. If you have an S24 or older, you'll need to wait for Samsung to roll out the One UI 8.5 beta more widely, or for the full release down the line. Next, you'll need to apply to join the beta from the Samsung Members app. If you don't have the app yet, download it from the Play Store, then follow the instructions to enroll in the beta.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung's One UI 8.5 Beta Is Now Officially Available",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBZ8XK9WHPT7MZD5TPKDJ0RX/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T16:00:00.000Z",
      "dateModified": "2025-12-08T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Android 16 Just Put Parental Controls Directly on Your Kid's Phone",
    "url": "https://lifehacker.com/tech/android-16-new-parental-controls?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBMPR1K2ATMCKXMFGQ63PXWP/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T18:30:00.000Z",
    "description": "\n        \n        In the long-running Android vs. iOS competition, iPhones have historically had the edge in terms of parental controls: They've been ",
    "body": "\n        \n        In the long-running Android vs. iOS competition, iPhones have historically had the edge in terms of parental controls: They've been a bit more straightforward and intuitive, and easier for caregivers to understand and manage. Apple does many things well, and getting its apps and devices working seamlessly together is definitely one of them.Google, however, is gradually improving the experience for parents, with a batch of updates earlier this year, and now some more changes as part of a significant Android 16 upgrade. The latest changes mean more controls can be accessed on your kids' devices.What's new in Android 16The usual Android caveat applies here: Each Android phone maker does things slightly differently, though there's not actually too much variation in this particular area. The latest Android 16 updates mentioned above are rolling out now to Pixel phones (and I've tested them on a Pixel), but will take a while to reach other handsets—Samsung phones will most likely get them early next year, for example, with One UI 8.5.\nSo what's new? Essentially, more of the existing parental controls are available on the Android devices of your youngsters, so you can get at them from their phones and tablets as well as accessing them remotely. It should make life easier if you're with your kids and they pass their devices over to you.You can find the options that have been added to kids' devices by opening Settings on the phone or tablet of your young person and choosing Parental controls. Right away you'll see a toggle switch for enabling on-device controls, and when you do enable them you need to enter a PIN—to stop your kid from changing these settings themselves.\n    \n            \n            The new on-device controls in Android 16.\n                                        Credit: Lifehacker\n                    \n    \nThere are then four sections you can access: Daily limit, App limits, Downtime, and Website content filters. Tap on any of these to set restrictions for the current device, which can be adjusted depending on the day of the week in some cases. Pick Downtime, for example, and you can set times during which the device is locked. These match the tools you've previously been able to manage remotely.Select Daily limit, then turn on the Use daily limit toggle switch, and you're able to control how many hours your kid can use their phone or tablet for each day. There's also a bar chart showing device usage over time, so you can see how much screen time your child has been taking advantage of. These settings are simple, understandable, and a breeze to use—you don't have to mess around with Google accounts or family relationships if you don't want to. You can just enter a PIN and start making changes—you don't necessarily have to connect these settings to any other devices. If you want to manage them remotely, though, Google has a wider parental control system in place.Google's Family Link controls The new Android 16 controls that appear on devices can work independently of anything else, but Google already offers plenty of options if you need them. Everything is managed through the Google Family Link portal, which you can access on the web or through the apps on Android or iOS.\n            \n                What do you think so far?\n            \n        \nYou can use Google Family Link to set up Google accounts for your kids, and then manage what they're able to do with them. The idea is that they sign into their Android devices using the account you've created for them, and because Google knows you have a verified connection to them, you can put restrictions on those devices remotely.All the usual safeguards and protections are covered: You can set screen time limits, manage the apps your kids can use (and for how often), put blocks on certain websites and categories of website, and put parental approvals in place for making purchases through Google's various digital storefronts. These mostly match what's now available on-device.\n    \n            \n            Google Family Link on the web.\n                                        Credit: Lifehacker\n                    \n    \nThere's a location tracking element to Google Family Link as well, so you can see where your young people are at all times, and even get notifications based on their movements: You might want to get a ping when they turn up at school, for example, or when they leave home. All this can be managed through the apps.More recent updates let you control the amount of screen time your children can have during school hours, and there are also now tools for managing the contacts that youngsters are able to interact with—as yet you can't get to these controls directly on your kids' devices. There's plenty in the way of reports on usage too, alongside these controls.Add everything up, and Google now has a fairly comprehensive set of parental controls that you can manage from just about any device, or from the devices your kids are using—assuming you've given them Android phones or tablets. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Android 16 Just Put Parental Controls Directly on Your Kid's Phone",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBMPR1K2ATMCKXMFGQ63PXWP/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T18:30:00.000Z",
      "dateModified": "2025-12-04T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
    "url": "https://lifehacker.com/tech/iphone-alarm-for-reminders?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T15:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n           ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Khamosh Pathak\n                            \n    Table of Contents\n    \n        \n        Apple’s various apps and utilities are finally starting to talk to each other, and it’s great news for iPhone users. Last year, Apple added the ability to sync Reminders with Calendar, which added time-based reminders directly into your Calendar view—a feature I now regularly use. Now, with iOS 26.2, Apple is finally integrating Reminders with the Alarms app; you'll be able to set an accompanying alarm for any reminder. If, like me, you tend to be forgetful—if you need a reminder for your reminder—this will be a handy feature. The alarm will sound, taking up your entire screen until you dismiss it. And yes, you can snooze it.How to add an alarm to any reminder on your iPhoneTo get started, open the Reminder app, navigate to a task list, and either create a new reminder, or edit it. When you’re adding a date and time, you’ll see a new Urgent toggle. When you enable the Urgent mode, it will turn on an alarm that will go off when the reminder is due. The alarm will trigger even when your iPhone is in silent mode or in a Do Not Disturb Focus mode, so be careful when setting it up.\n\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nWhen you enable this for the first time, you’ll get a connection request for integrating Reminders with Alarms. Here, tap Allow. If you don’t see this popup, or if you’ve dismissed it before, go to Settings > Apps > Reminders, and in the \"Allow Reminders to Access\" section, enable the Alarms toggle.When the reminder is due, you’ll see a full-screen reminder interface, with the reminder up top, and an option to slide to stop (using Apple’s new sliding interface for dismissing alarms, which you can disable if you want). You’ll also see a big blue Snooze button. This will snooze the reminder for nine minutes.\n            \n                What do you think so far?\n            \n        \nWhether you hit the Snooze button or you use the slider to stop the alarm, Apple will add the Reminder to the top of the notifications list, as a Live Activity. You’ll see the reminder, with the snooze duration (if enabled), and the task. To actually complete the task, you’ll have to check it off from the Live Activity or the Reminders app.\n    \n            \n            \n                                        Credit: Khamosh Pathak\n                    \n    \nUnlike in the new alarm feature, there’s no way to edit the Snooze duration for reminders, or to disable the slider. If you don’t like the Snooze feature or the two-tap approach to completing reminders, you can switch it out for a Complete button instead. Go to Settings > Apps > Reminders and in the \"Urgent Reminders\" section, enable the Complete from Alarm feature. Now, when the alarm goes off, you’ll see two buttons instead: Slide to Stop and Complete. When you tap Complete, the alarm will disappear, and the task will be marked as Complete.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s New iPhone Update Will Make Sure You’ll Never Miss a Reminder Again",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1HZPG712EAKM1NVA9T5DGC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T15:30:00.000Z",
      "dateModified": "2025-12-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NotebookLM Has a New Feature for Visual Learners",
    "url": "https://lifehacker.com/tech/how-to-use-notebooklms-new-infographics-generator-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T20:30:49.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Google\n                            \n    Table of Contents\n    \n        \n        Another day, another update to Google's NotebookLM, the versatile AI tool that functions like a personal assistant focused only on you and your needs. The latest update is for visual learners: You can turn your source materials into helpful infographics that give you a clear picture—literally—of what the PDFs, websites, videos, or other materials you're studying or organizing are about. How to use the new NotebookLM infographics featureTo use the new feature, open any of your NotebookLM Notebooks (the name given to folders full of specific materials you've uploaded) and navigate to the panel on the right side. It's the same panel where you find the other offerings like the video creator and flashcard maker.As with those tools, you just tap the associated button to generate the corresponding product, making sure the sources from your left panel that you want to include are all checked off. I tried it out this morning, first using the NotebookLM account associated with my personal Chrome profile and what I'm studying in my private life, then using the one I have set up for work, which has a tester notebook full of materials about how to study for the SAT. (I am strict about using different Chrome profiles for various parts of my life and am now up to seven.) \nIn my personal account, the button was labeled BETA—and it acted like it. After two failed attempts, NotebookLM could not produce an infographic based on my materials. In my work account, though, the beta label was missing and it performed the function just fine, spitting this out:\n    \n            \n            \n                                        Credit: Google\n                    \n    \nThis is rolling out in full functionality to accounts at different times, obviously, but I was glad to see one of mine had easy access because I thought the infographic was solid.\n            \n                What do you think so far?\n            \n        \nWho the infographics feature is helpful forI don't consider myself a visual learner and primarily use NotebookLM to refine ideas or generate educational audio clips I can listen to while I clean the house, so I wasn't expecting to like this. I don't like the mind map creator within NotebookLM at all, for instance; flowcharts just aren't how I learn best, and that's fine. But the infographic was concise, engaging, and just detailed enough to keep me interested and looking at it. It's unlikely I'll use this to study or refine my work often, but I can absolutely see how it would be useful to someone who learns more visually, especially if all the lines and boxes of a mind map can get too convoluted to be useful.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NotebookLM Has a New Feature for Visual Learners",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2C7Q7BC1AJG0759KMFJ476/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T20:30:49.000Z",
      "dateModified": "2025-12-09T20:30:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Spot a ‘Sleeper’ Browser Extension That’s Actually Malware",
    "url": "https://lifehacker.com/tech/spot-sleeper-browser-malware-extensions?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBXCY3SNDWTKDSFJFA4PAZA2/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-08T14:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Evan Lorne/Shutterstock \n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 8, 2025\n    \n            Credit: Evan Lorne/Shutterstock \n                            \n    Table of Contents\n    \n        \n        Malicious extensions do occasionally find their way into the Chrome Web Store (and similar libraries in other browsers) by posing as legitimate add-ons. They are particularly difficult to catch when they are benign to begin with, only morphing into malware after gaining user trust. That's what happened with a number of extensions on Google Chrome and Microsoft Edge: researchers at Koi Security identified add-ons across both browsers that operated legitimately for several years before receiving malicious updates that allow hackers to surveil users and collect and exfiltrate sensitive data. The scheme, known as ShadyPanda, reached four million downloads and is still active on Edge. Threat actors ran a similar campaign targeting Firefox earlier this year: They gained approval for benign extensions mimicking popular crypto wallets, accumulated downloads and positive reviews, and then injected the add-ons with malicious code capable of logging form field inputs, which they used to access and steal crypto assets. \nBrowser extensions can turn badAs Koi Security outlines, ShadyPanda started out as an affiliate scam, with 145 extensions masquerading as wallpaper and productivity apps across the two browsers. The initial phase injected affiliate tracking codes and paid commissions with clicks to eBay, Amazon, and Booking.com and then evolved to hijack and manipulate search results before launching the five extensions in 2018 that would later be converted to malware. Those add-ons were marked as Featured and Verified in Chrome—one, a cache cleaner known as Clean Master, accrued a 4.8 rating from thousands of reviews. The extensions were updated in 2024 to run malware that could check hourly for new instructions and maintain full browser access, feeding information to ShadyPanda's servers. (These have since been removed from Chrome.) Hackers launched an additional five extensions, including WeTab, to Edge in 2023. Two are comprehensive spyware, and all were still active as of Koi's report. \n            \n                What do you think so far?\n            \n        \nHow to find malicious extensions in Chrome and EdgeUnfortunately, malicious extensions are usually pretending to be something else, so a quick visual check of your installed extensions may not reveal a problem. In this case, Koi Security has a list of the extension IDs associated with the ShadyPanda campaign, and you'll have to search for them one by one. In Chrome, type chrome://extensions/  into your address bar and hit Enter. Toggle on Developer mode in the top-right corner to reveal the IDs for installed extensions. From here, you can copy and paste each ID into the search bar (Ctrl+F on your PC or Cmd+F on your Mac). If there are no results, your browser is safe. If you do find a malicious add-on, click the Remove button. In Edge, follow the same process from edge://extensions/. While this campaign shows that extensions can be weaponized long after they've been installed, you should still follow best practices for vetting browser add-ons just as you would apps for your device. Check the name carefully, as fraudulent extensions often have names that are nearly identical to trustworthy ones. Review the description for any red flags, such as misspellings and unrelated images. If you see a lot of positive reviews in a short amount of time on a new extension, or if they seem to be reviewing something else entirely, proceed with caution. You can also do additional research, such as a search on Google or Reddit, to see if the extension is legit. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Spot a ‘Sleeper’ Browser Extension That’s Actually Malware",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBXCY3SNDWTKDSFJFA4PAZA2/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-08T14:00:00.000Z",
      "dateModified": "2025-12-08T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
    "url": "https://lifehacker.com/tech/iphone-17-pro-portrait-night-mode-missing?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n     ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Hadrian/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Apple's latest iPhone 17 Pro models are missing a feature found in the last five generations of Pro iPhones.\n                                            For some reason, you can no longer take Portrait mode shots with Night mode—though Night mode itself still works for standard shots.\n                                            Apple has not disclosed why this feature is missing.\n                                    \n            \n    Table of Contents\n    \n        \n        New products tend to add features, not take them away. That isn't always the case with Apple, however. The company has a long history of removing functions from one generation of devices to the next, whether that's removing the disc drive from its MacBooks back in 2012, or taking away the iPhone's Home button in 2017. Some of these changes are good, some are controversial, while others are undone altogether: MagSafe and HDMI both found their way back to MacBooks after all.It's not often I hear about Apple removing software features from one generation of product to the next, however. So, imagine my surprise when I saw a number of headlines this morning asserting that the iPhone 17 Pro, Apple's latest and greatest flagship, is missing a feature found in the last five generations of Pro iPhones—and nobody noticed for nearly three months. Night mode is missing from Portrait mode on the iPhone 17 Pro and 17 Pro Max. The short answer? We have no idea. This was not something Apple announced publicly, of course. In fact, Macworld spotted the change in an Apple support doc: If you scroll down to the section where it says \"On supported models, you can take Night mode photos with Portrait mode,\" and click the hyperlink on \"On supported models,\" you'll pull up a list of iPhones that, mysteriously, doesn't include the 17 Pro or 17 Pro Max. The list includes:\niPhone 12 ProiPhone 12 Pro MaxiPhone 13 ProiPhone 13 Pro MaxiPhone 14 ProiPhone 14 Pro MaxiPhone 15 ProiPhone 15 Pro MaxiPhone 16 ProiPhone 16 Pro Max For the uninitiated, Night mode and Portrait mode are technically two distinct features. Portrait mode was released first, all the way back on the iPhone 7 Plus, which utilized the dual-camera system to add a bokeh effect to shots of people. Those early shots were hit or miss, and were often no replacement for a true DSLR, but as Apple's tech and cameras have improved, so has Portrait mode. Part of the improvement was the introduction of Night mode. This feature, which Apple was a bit late to the game on, allowed you to take brighter images in low-light environments by lengthening the time the shutter stays engaged. Older iPhones without the feature would take images that were hard to see without the flash engaged, but Night mode could pull in details as long as there was just enough light present in the scene. Since the iPhone 12 Pro, Portrait mode came with the option of Night mode, as well. If you're trying to take a portrait shot in a dark environment, Night mode kicks in and gives the image a chance to turn out brighter and more detailed. But now, it seems, the 17 Pro and 17 Pro Max do not have this option. \n            \n                What do you think so far?\n            \n        \nTo be clear, these new iPhones still have Night mode: Per that previously mentioned support page, you can take brighter shots at night when taking standard photos, selfies, and time-lapse videos. It just seems Apple decided to remove the feature for Portrait mode shots on its latest Pros.Of course, this news started breaking on Dec. 3, nearly three months after the 17 Pros launched. If it took this long for someone to notice a missing feature, was it really all that important to begin with? I don't have a 17 Pro, so I really can't say, but I also can't say I take many Portrait mode shots in dark environments. I've reached out to Apple for comment, and will update this story if I hear back. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Happened to the iPhone 17 Pro’s Portrait Night Mode?",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNG47316RZ18KQCY4V2BFM8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:00:00.000Z",
      "dateModified": "2025-12-04T22:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
    "url": "https://lifehacker.com/tech/apple-watchos-262-updates?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-04T22:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n   ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: DenPhotos/Shutterstock\n                            \n            \n                Key Takeaways\n                                            watchOS 26.2 is bringing three new features and changes to your Apple Watch.\n                                            Apple is updating Sleep Score, which should now be a bit more accurate when calculating your overall score.\n                                            The update also fixes an annoying Music glitch and introduces Enhanced Safety Alerts.\n                                    \n            \n    Table of Contents\n    \n        \n        Yesterday, Apple unveiled release candidates (RCs) for its slate of upcoming updates. An RC, as the name implies, is the version of a software update Apple intends to release to the general public. Before it rolls out, though, Apple sends the update out to beta testers to see if there are any bugs or glitches that need addressing. If not, these are the updates that will hit your Apple devices sometime this month. That includes watchOS 26.2, Apple's latest OS for its line of smartwatches. While there aren't nearly as many new features and changes in this update as there were in watchOS 26 proper, there are still some key things to highlight in this RC. In fact, as noted by 9to5Mac, there are three:Updates to Sleep ScorewatchOS 26 introduced Sleep Score, a feature that was sorely missing on the Apple Watch. Sleep Score analyzes a host of data collected while you slept, including sleep duration, the time you actually went to bed, and any wake-ups you might have had during the night, and gives you an overall score. The idea is to glance at the score and see how you slept that night, so you can either take steps to improve your sleep going forward, or know you're on the right track. The total score is out of 100: Duration gets you up to 50 points, bedtime gets up to 30, and sleep interruptions go up to 20.  \nwatchOS 26.2 refines the feature, by adjusting the final Sleep Score metrics. The feature had a tendency to give you higher scores than you might have otherwise felt you earned: A mediocre night's sleep might have have scored \"High\" on your chart, which wouldn't have made much sense to you. Going forward, the scoring is a bit more conservative. Here's what you can expect, and how the scores changed from the last update:Very Low: 0–40 (previously 0–29)Low: 41–60 (previously 30–49)OK: 61–80 (previously 50–69)High: 81–95 (previously 70–89)Very High: 96–100 (previously 90–100) You'll also noticed Apple changed the \"Excellent\" score to \"Very High,\" which keeps the naming a bit more consistent.Music app glitch fixIf you've been using the Music app on your Apple Watch, but have been struggling to get your songs to actually, you know, play, good news: Apple says in the release notes for watchOS 26.2 RC that there is now a fix for an issue where the Music app doesn't move to the next song.\n            \n                What do you think so far?\n            \n        \nEnhanced Safety AlertsFinally, watchOS 26.2, along with other Apple updates, introduces Enhanced Safety Alerts. According to Apple, this feature will warn you about \"imminent threats,\" including floods, natural disasters, and other emergencies. The feature will also include data like maps and links to official safety advice. Apple has been positioning the Apple Watch to be an overall health and safety device, and this feature only seems to complement that. Recent Apple Watches have hypertension alerts, which can help you passively identify high blood pressure, while fall and crash protection can automatically call for help in emergencies when you can't reach the phone. When does watchOS 26.2 come out?Apple doesn't have a set date for watchOS 26.2, or iOS 26.2 and macOS 26.2 for that matter. However, now that the RCs are out, these updates are likely coming soon. As long as there aren't any glaring bugs or glitches in these RCs, Apple will likely ship the updates sometime this month.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Changes Coming to Your Apple Watch With watchOS 26.2",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNMEX42ZBVNCHDQH53K9ACF/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-04T22:30:00.000Z",
      "dateModified": "2025-12-04T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 Hacks Every Homeowner Should Know",
    "url": "https://lifehacker.com/home/hacks-every-homeowner-should-know?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KB5T7BM47A5TMTBGPRBM8A2J/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T20:00:57.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n        \n    \n                                        \n        \n ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: René Ramos/Lifehacker/ingwervanille/DEV IMAGES/Moment/Getty Images\n                            \n    Table of Contents\n    \n        \n        When you buy a house, you buy a long list of projects that stretch into the distant future. Planning your time and budget for everything that will need to be done can be a challenge, but it’s worth it for the comfort, security, and financial cushion that home ownership offers. That doesn’t mean it can’t get a little stressful from time to time, though, which is why we could all use a few small tricks that can make a big difference as a homeowner. Here are 10 essential hacks that every homeowner should know.Enlarge rooms with paintOne of the most common reasons for a home-buyer’s remorse is size. It can be difficult to gauge how you’ll use a space until you’re actually in it, and our lives don’t always go according to plan. As a result, it’s not uncommon for folks to feel like their house seems a bit too small for their liking.Adding onto a house is expensive—a much more budget-friendly approach is to use visual tricks to make your house feel larger. Paint is a powerful tool for this. By leveraging color theory, you can make a room feel larger by using lighter colors on the walls and glossy white on the ceiling, and using a single color on all the walls to erase the edges that define the space, thus making it appear larger. If you don’t have a handy fortune to throw at a major home renovation, a low-cost paint project can give you the feeling of a larger room, at least.\nNo-dig fencesIf you’ve ever been house-hunting, you’re familiar with one surprising fact: A lot of houses, especially new builds, don’t have fencing. You walk into the backyard and it’s just an open field, with invisible property lines somewhere in the near distance.Fencing can be expensive if you hire someone to install it, with a price tag potentially in the thousands of dollars. Installing a fence on your own, DIY-style, is labor-intensive, especially if your yard is rocky. If all you need is a perimeter fence, however, a no-dig fence like this one is an easy solution that will mark off your property and pen in small pets without the effort or expense of a traditional fence project.Dowel pin screw hole repairWhether your house is new, lightly used, or historical in nature, eventually you’re going to deal with loose screws, especially in your door and cabinet hinges. Hinges carry so much weight and get so much use, the screws inevitably work themselves loose. You can fix this a few times just by tightening everything up again, but over time, this pattern will result in stripped screw holes and permanently sagging doors. At that point, you can either try to reposition the hinge so you can bite into fresh wood, or replace the door frame or cabinets at great expense.That is, unless you know the dowel hack. All you need are some wooden dowel pins and some wood glue. Fill the stripped screw hole with glue, insert a dowel, trim as needed, and let the glue set. Then you can drill a fresh hole, and your screws will bite like new again, all for less than $10.Rain-X on shower doorsOne of the mysteries of the universe is the fact that bathrooms in general aren’t self-cleaning. How can a space doused with soap and water on a regular basis be so filthy?One reason is the mineral content of your water, and the tendency for soap to transmogrify into soap scum. These two elements combine to turn glass shower doors into opaque, cloudy barriers that never look clean. Cleaning those hard water and scum stains off the glass requires a lot of elbow grease, and it’s the sort of chore we put off for months (or longer) simply because of the effort involved.The trick is, once you do clean those glass doors, you should spray them with Rain-X. This is a product made for car windshields, but it will work a charm in your bathroom, too. It’s a water repellent, so your shower water will bead up on the glass, making it super easy to squeegee it off before it can evaporate and leave behind all those mineral deposits and soap residue. Using it on a regular basis when you clean your shower will keep those glass doors clear and free of build-up.Deodorize with vodkaVodka doesn’t have much of a taste, it has almost no odor, and it’s typically about 40% alcohol. All this means that vodka—even the cheap stuff—is actually a very good disinfectant and deodorizer. Many theater companies and theme parks use a mixture of vodka and water to spray down costumes between performances when there’s no time to send them out for cleaning. The alcohol kills off germs and odor-creating bacteria, and once it dries, there’s no smell or residue.You can use this in your house, too. If your bedding, shoes, or towels have gotten a bit musty, a good spray with a 50/50 mix of vodka and water will deodorize and sanitize them effectively. You can add a drop of an essential oil too, if you want a light scent left behind.Paint your roofPeople typically don’t think about the roof of their house until it leaks—which is a mistake, because roofs are expensive to fix, even more expensive to replace, and a failing roof can allow water damage to destroy other parts of your home.Becoming a roofing expert isn’t in the cards for most of us, but one thing any homeowner can do (usually as a DIY project) is coat the roof. Specialty coatings for flat roofs and shingles protect your roof from sun damage, fill in microscopic cracks before they can develop into leaks, and can extend the life of your roof by years, saving you a lot of money over time.\n            \n                What do you think so far?\n            \n        \nRun appliances at nightThe modern house is an energy-sucking monster. We run lights, heat and cooling systems, televisions, computers, washers, dryers—the list is almost endless. And all of these devices and appliances require electricity, which, as you may have noticed, is expensive stuff.If you can commit to running a lot of appliances at night, you can generally save money, however. That’s because electricity rates have “peak” and “off-peak” hours, so running your washing machine at night instead of the afternoon can cost a lot less. Some utility companies offer formal Time of Use plans, where you are charged a higher rate during peak hours, but a much lower rate during off-peak hours. If you can be disciplined about your power use, you can save a lot of money this way.Get a ladder LevlerDoing DIY work around the house can be dangerous, and ladders are often involved. People often don’t know the proper way to position and secure a ladder, try to carry stuff while climbing, or forget that gravity is a thing and try to reach stuff they really shouldn’t while standing twelve feet in the air on an improperly balanced ladder. And then there’s the fun experience of having tools and fasteners in your pockets while you’re clinging to a ladder for dear life.That can all be solved with this gizmo: The Ladder Levler. This gadget makes it safer to use your ladder on uneven surfaces (like stairs or sloped yards), and it’s also a storage bin that clips right onto your ladder, leaving your hands free to, you know, hold on like your life depends on it.Leak detectorsWater will destroy your house if you’re not careful. Roof, pipe, and appliance leaks can persist for a long time before they become apparent, and every day a leak remains active means potential mold, dry rot, and structural damage to your home. And if you’re not home when a pipe or water heater bursts, sending gallons of water to gleefully rampage throughout your home, the cost of cleanup and repair can be astronomical.That’s why leak detectors and alarms are an essential hack. Having these seeded throughout the house means you’ll never be caught by surprise—the moment moisture is detected, the alarms will sound, and you can deal with the problem before it ruins everything. You can get detectors that will ing you on your phone or other devices so you’ll be warned even if you’re not home, and you can often pair them with automatic shutoff valves on your water supply, stopping the flow of water the instant it becomes a threat to your home.Thorny home securityKeeping your house secure usually involves technology like alarm systems and doorbell cameras, often backed up by a security service that can contact the police on your behalf. That’s always a sound idea, but it can be expensive and occasionally intrusive (especially if you find yourself having to reset systems and call off false alarms regularly).But there’s also a passive way to enhance your home’s security: landscaping. A few thorny bushes near windows and thoughtful management of tree branches and ground covers can go a long way toward making your home less likely to be robbed. While this isn’t a set-it-and-forget-it kind of security plan, you’re going to have to manage some amount of landscaping anyway, so why not make choices in your outdoor spaces that actually make your home more secure while you're at it.\n            \n    \n\n    \n        Smarter Home & Living Newsletter\n            Never miss a story\n        \n        \n            Lindsey Ellefson\n            \n        \n        Get the latest smart home news, trends, and advice from Lindsey and the team.\n    \n    \n        Smarter Home & Living Newsletter\n            Never miss a story. Get the latest smart home news, trends, and advice from Lindsey and the team.\n        \n    \n\n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 Hacks Every Homeowner Should Know",
      "image": [
        "https://lifehacker.com/imagery/articles/01KB5T7BM47A5TMTBGPRBM8A2J/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T20:00:57.000Z",
      "dateModified": "2025-12-09T20:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
    "url": "https://lifehacker.com/tech/pebble-is-releasing-the-index-01-ring?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T21:30:40.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on this page.\n    \n            Credit: Pebble\n                            \n            \n                Key Takeaways\n                                            Pebble's new ring is called the Index 01, and it costs $75 to pre-order.\n                                            The ring has a button and microphone, but no heart rate sensor.\n                                            It's intended to be a one-handed input for voice notes that are sent to your phone and/or Pebble watch.\n                                    \n            \n    Table of Contents\n    \n        \n        When I hear that a smartwatch company is launching a ring, I assume it’s going to be a smart ring. But Pebble went a different direction, instead creating what’s basically a remote microphone that can work with your phone and other devices. It's available for pre-order for $75, and will sell for $99 after launch.Pebble’s new ring is called the Index 01. It’s got a button you can click and hold, and a microphone that will listen to what you’re saying as you hold the button. The recording is then sent to your phone, where it’s processed on-device. That's it—no heart rate sensor, and no charging dock.The Index 01's specs and functionalityEric Migicovsky, Pebble’s founder, describes using the Index to capture short messages and send instructions to his Pebble watch via his phone. The idea is that you wear the Index on your index finger (get it?) and press the button with your thumb. The ring comes in three colors: matte black with a black button, polished gold with a blue button, and silver with a white button. \nThere is no battery to charge, just a built-in battery that lasts a total of 12 to 15 hours. Migicovsky writes: “On average, I use it 10-20 times per day to record 3-6 second thoughts. That’s up to 2 years of usage.” The ring doesn’t have a speaker and can’t vibrate for notifications; it’s just for input. Communication between the ring and your phone is encrypted, and the voice recordings are processed into text on your phone, without requiring an internet connection. The ring doesn’t talk directly to a Pebble watch, but it can talk to your phone and your phone can then display any output to the watch—for example, displaying the text of a reminder that you set. Who should buy an Index 01 ring?So far, Pebble users don’t seem to be nearly as excited about this product as Migicovsky is. A Reddit thread discussing the announcement has comments like “Cool idea, weird product,” and “Why would I want this if I already have a Pebble that has all the capability to take voice notes?” \n            \n                What do you think so far?\n            \n        \nMigicovsky explains in the company’s blog post that his goal was for the button to be operated with one hand, and gestures on the Pebble weren’t reliable enough. He also emphasizes the fact you don’t need to charge it, while some of the users seem to be more concerned that a device that can't be charged is basically disposable—\"manufactured e-waste.\" After about two years of use (or less, if you make longer recordings), the app will ask if you’d like to order another ring. The ring will cost $75 to pre-order, and $99 at its regular price. There hasn’t been any mention of a discounted rate for a replacement; it sounds like you’re supposed to buy a new $99 ring every two years. The ring’s functionality could be extended in the future. A double click-and-hold could signal the Pebble app to process the data in a different way (perhaps sending it to ChatGPT, Migicovsky suggests) and developers could connect the voice processing in the app to other services like calendar and weather apps. \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pebble Is Releasing a $75 Ring, but It’s Not an Oura Competitor",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC2E547V2E9MXT03HQM9TRA3/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T21:30:40.000Z",
      "dateModified": "2025-12-09T21:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google's New 'Call Reason' Feature Lets You Mark Outgoing Calls As Urgent",
    "url": "https://lifehacker.com/tech/try-google-call-reason-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBJYRR2BFD3PR5CE87QNGRP4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-03T21:30:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Tada Images/Shutterstock\n ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 3, 2025\n    \n            Credit: Tada Images/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is rolling out a new feature for its Phone app that lets you mark a call as urgent.\n                                            \"Call Reason\" will tell your friends and family a call is urgent, possibly improving the odds they pick up the phone.\n                                            The feature is rolling out in beta in Google's Phone app for Android.\n                                    \n            \n    Table of Contents\n    \n        \n        It's tough to get people to answer the phone—though I'm not really blaming those who don't pick up. We are so inundated with spam calls these days that refusing to answer incoming calls en masse isn't actually a bad strategy. When that call could be someone trying to break into your bank account, or alerting you to fraudulent credit card charges that never happened, perhaps it's best to just wait for friends and family to text instead. But let's say the call is from you to someone you know and trust, and let's assume they see it's you who's calling. Even though they know the call isn't spam, there are still plenty of reasons someone won't pick up the phone—including, of course, because they don't actually want to talk right now. But if you really need to get a hold of someone and don't want meetings, commutes, or the lack of desire for a phone call to get in the way, Google is currently working on a solution you can try right now. The new feature, named \"Call Reason,\" is designed to separate important phone calls from the rest. When you start dialing a number, Google will give you the option to mark the call as urgent. If you choose to do so, the person you're calling will see a pop-up reading \"It's urgent!\" on the call screen. Hopefully, that pop-up will encourage them to answer; however, I imagine they'll stop picking up if you start using it too often. \nThat said, not everyone ignores calls on purpose. If you aren't by your phone when it goes off, or if it's on silent in your pocket or bag, you obviously won't catch the urgent tag on the call screen. In that case, Android adds the urgent tag to the missed call in their recipient's call history. As long as the person you're trying to reach checks out their missed calls, they should see that this one was marked urgent—though if it's a real emergency, they might've received extra calls and messages from you in the interim anyway. It seems Google has been working on this feature for some time. Android Authority previously spotted something called Expressive Calling in the Phone app's APK, which would let the caller add animations and emojis to calls. In addition to that functionality, however, was the ability to flag the reason for a call when dialing. \n            \n                What do you think so far?\n            \n        \nHow to try Call Reason Google is still testing the Call Reason feature, but anyone using the current version of the Google Phone app will be able to try it out. (It's still rolling out, though, so you may not see it yet.) The feature also only works with saved contacts, and when calling Android users who have Google's Phone app set as the primary calling app.  When Call Reason does show up on your phone, you'll see it appear after placing your call. The UI says \"Mark call as urgent?,\" with a prompt letting you know that the call will ring through and show the call is urgent. Tap \"Notify,\" and you're set. Once the recipient sees the call, they'll see the \"Incoming call\" banner replaced by an animated \"It's urgent!\" pop-up. It's a fun design, but perhaps a bit too fun, when you're likely using this in important situations.  \n    \n            \n            \n                                        Credit: Google\n                    \n    \nAlongside Call Reason, Google announced a number of new features for Android 16. There are now improved parental controls locked behind a PIN of the parents' choosing; new UI customization options, like expanded dark mode support and new custom shapes for home screen icons; and the continued roll out of Google's AI notification summaries, which Lifehacker writer David Nield hasn't found all that useful yet.  \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google's New 'Call Reason' Feature Lets You Mark Outgoing Calls As Urgent",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBJYRR2BFD3PR5CE87QNGRP4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-03T21:30:00.000Z",
      "dateModified": "2025-12-03T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
    "url": "https://lifehacker.com/tech/google-will-fix-pixel-broken-display-for-free-if-it-qualifies?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-09T17:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shuttersto",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n            Credit: Karlis Dambrans/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Google is launching a new Extended Repair Program for Pixel 9 Pro devices with specific display issues.\n                                            Pixel 9 Pro and 9 Pro XL units with a vertical line running from the top of the display to bottom qualify.\n                                            Your Pixel 9 Pro and 9 Pro XL device also qualifies if the display flickers.\n                                            The Pixel 9 Pro Fold has a repair program too, though Google does not specify what issues it covers.\n                                    \n            \n    Table of Contents\n    \n        \n        Smartphone display issues are nothing new. Most of us have dropped our phones the wrong way one time or another, and had to deal with the pain (and cost) of getting them fixed. But when your smartphone's screen starts acting up for no particular reason, it's pretty frustrating—especially if the manufacturer still holds you accountable for the repair fees. If that sounds like your experience with your Pixel 9 Pro, Pixel 9 Pro XL, or Pixel 9 Pro Fold, there's good news: Google is now launching an Extended Repair Program for the Pixel 9 Pro line. According to Google's announcement on Monday, the company has identified a \"limited number\" of Pixel 9 Pro and Pixel 9 Pro XL units that might exhibit display issues that impact the user's experience with the device. Should your Pixel 9 Pro's display show these symptoms, Google will fix the display at no cost to you.  What it takes for your Pixel 9 Pro to qualifyThat doesn't mean any and all display issues on your Pixel 9 Pro device qualify here. Google has identified two specific problems that this Extended Repair Program actually covers. The first is a vertical line present on the display. The line has to run from the bottom of the screen to the top, so partial lines won't quality. The second is display flicker. If you notice your Pixel 9 Pro's display quickly getting brighter and darker, as if someone was flicking a switch back and forth, you qualify for the repair program. \nThe Pixel 9 Fold is another story altogether. Like the 9 Pro and 9 Pro XL, Google is offering a free repair program for the 9 Pro Fold. However, unlike the other devices, there are no specific issues identified here. The problems may be display-related, but since the company won't specify, you could bring your 9 Pro Fold in for just about anything that's going wrong with it—as long as you didn't cause the issue yourself. In addition, Google won't actually fix your foldable, but will instead replace it entirely. The company is also being strict regarding the quality of the display outside of these issues across all Pixel 9 Pro devices. If your Pixel's display or cover-glass is cracked, that may disqualify you from the free repair. If Google finds liquid damage in your device, same story. In any of these cases, the company will still fix the display issues mentioned above, but they might charge you for it.    \n            \n                What do you think so far?\n            \n        \nHow to get your Pixel 9 Pro fixedAffected Pixel 9 Pro, 9 Pro XL, and 9 Pro Fold units qualify for repair as of Dec. 8, and coverage will last for three years after the original purchase date of the device. You will need to have your device inspected at a Google walk-in center, Google-authorized center, or an online repair store before the company can confirm eligibility. You can get started on your claim from Google's official repair site. This is good news for any Pixel 9 Pro users who have these specific issues—or any issues at all for Pixel 9 Pro Fold users. It joins a host of other Extended Repair Programs for Pixel devices, including the Pixel 4a battery program, the Pixel 6a battery program, the Pixel 7a repair program, and the Pixel 8 repair program, \n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Will Fix Your Pixel’s Broken Display for Free (If It Qualifies)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KC1X6QJ222BT0E57J35XZQXA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-09T17:00:00.000Z",
      "dateModified": "2025-12-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One of the Mac's Best Productivity Apps Is Now on Windows",
    "url": "https://lifehacker.com/tech/raycast-is-finally-on-windows?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-04T20:00:00.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                  ",
    "body": "\n        \n    \n                                        \n        \n        \n        December 4, 2025\n    \n            Credit: Raycast\n                            \n            \n                Key Takeaways\n                                            Raycast is finally available on Windows.\n                                            The previously Mac-exclusive app makes it easy to search for apps and files anywhere on your PC.\n                                            You can also use the tool for a number of tasks, including converting currencies and dimensions, managing your clipboard history, and emptying your recycle bin.\n                                    \n            \n    Table of Contents\n    \n        \n        Raycast is one of the best things to happen to Windows. It brings one of my favorite Mac apps to Microsoft's operating system. In fact, I've enjoyed using Raycast for Windows so much, I can't see myself going back to the non-Raycast life. This app is free to download and use, though there is an optional paid subscription for those who want certain additional features. What is Raycast?\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nAt its heart, Raycast is an app that lets you search for apps and files stored in your computer. It stays hidden until you press its keyboard shortcut (Alt-Space on Windows). Once you do, Raycast appears as a floating search bar on the desktop. You can type anything you want to locate in the search bar, and Raycast forages through your computer to find it. I primarily use it as an app launcher since I have way too many apps on my Mac (and PC). Raycast helps me find the right app quickly and open it.That's just the surface layer of Raycast, though. You can use Raycast to search for files on your computer, retrieve items you've copied to the clipboard, send queries to ChatGPT (or other AI tools), convert currencies and units, and much more. All of these features are available under the same simple floating search bar.\nSet up keyboard shortcuts in Raycast\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast is designed for people who love keyboard shortcuts. You can totally use it without them, but you'll enjoy it a lot more if you set up a few shortcuts of your own. As an example, if you open Raycast and press Tab, it switches to AI mode, and you can directly send your questions and requests to ChatGPT from Raycast.Whenever you search for anything in Raycast, you'll probably see a button called Record hotkey next to the results. This is your cue to set up a keyboard shortcut for that action, and doing so will allow you to get to it faster. You can also go to Raycast settings to find commonly used actions and record your preferred keyboard shortcuts for all of them.Note that the Raycast app is still in beta on Windows, and during this trial period, you can use these AI features for free. Expect that to change, though, once it's out of beta. If you want to keep using these features, the pro tier costs $8 per month for most AI models, but certain advanced AI models are only available in the $16 per month subscription tier.What I use Raycast for on Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nI use Raycast for a lot more than just launching apps on Windows. As someone who lives outside the US, converting units and currencies is a big part of my work day. Raycast's workflow is quite seamless for this task. You can just type \"$499\" or any other number after the dollar sign, and Raycast automatically converts it to your local currency. You can also type something like \"EUR499 to USD\" and it'll convert euros to the US dollar. I really like the fact that you don't even have to press the Enter/Return key to see the converted currency. The moment you type a currency number, the result shows up without any further prompts.You can also try other unit conversions with Raycast, eg: \"100kg to lbs,\" \"800ml to fl oz,\" \"44 sqm to sqft,\" etc. This helps me a lot when I'm ordering things from international websites that don't always have dimensions, weight, or pricing available in units I'm used to.\n            \n                What do you think so far?\n            \n        \nBeyond this, I like using Raycast to store and view clipboard history. You can search for Clipboard in Raycast to access items you've copied, and the app even categorizes these items for you. You can search just for links, images, files, or email address you've copied, which makes it easy to quickly find specific items from your clipboard history.Raycast also supports many other things such as window management, emptying the recycle bin, restarting your computer, locking your PC, bookmarking links and opening them in specific browsers, and text snippets—which let you quickly create or copy bits of text or code. You can open Raycast, and press Ctrl-, (comma) to open its settings and explore all its features.The limitations of Raycast for Windows\n    \n            \n            \n                                        Credit: Pranay Parab\n                    \n    \nRaycast only recently launched on Windows, which means there are a few things still missing from the macOS version. This includes the AI Chat feature (more advanced than the quick AI search available now), focus timers, the built-in notes feature, and support for more extensions. Many of its extensions were originally built only for macOS, so it's going to take some time to bring them to Windows. The feature that I miss the most is the ability to sync your snippets, notes, chats, and other data across devices. This feature is yet to come to the Windows app, and I hope the developers change that soon.Raycast is available on the Mac, iPhone, and now, Windows.\n            \n    \n\n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n    \n    \n        The Download Newsletter\n            Never miss a tech story. Get the latest tech news, reviews, and advice from Jake and the team.\n        \n    \n\n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One of the Mac's Best Productivity Apps Is Now on Windows",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBN70EVQ6Y5Q9205YSR8ZV7J/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-04T20:00:00.000Z",
      "dateModified": "2025-12-04T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AirPods 4 With (and Without) ANC Are Under $100 Right Now",
    "url": "https://lifehacker.com/tech/anc-airpods-4-sale?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-09T19:00:21.000Z",
    "description": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on thi",
    "body": "\n        \n    \n                                        \n        \n        \n        December 9, 2025\n    \n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Zain Awais and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods 4 dropped to a record low price during Black Friday in November, according to price-tracking tools, and after restocking, they're back on Amazon. The ANC AirPods 4 are $99.99 (originally $179.99) after a 44% discount, and the non-ANC AirPods 4 are $79.99 (originally $129.99). It's a great opportunity to get these revamped flagship earbuds from Apple with the latest features Apple has to offer.\nThe AirPods 4 have updated USB-C charging. Both models (the ANC and non-ANC) are powered by Apple's H2 chip, so you'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" and answer calls. Apple added a live translation feature to the ANC model when iOS 26 rolled out earlier this year.The biggest difference if you choose to go with the non-ANC is that you'll miss out on the charging case with a built-in speaker, which you can use with Find My to locate it if you lose them. You'll also miss features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio (combines ANC and Transparency mode to adjust ANC levels based on the noise around you).\n            \n                What do you think so far?\n            \n        \nBoth versions are rated IP54 for dust and water resistance, offer up to five hours of listening per charge (up to 30 hours with the charging case), and can handle automatic switching with your other Apple devices. You can read more about the non-ANC AirPods in PCMag's \"excellent\" review, and more about the ANC AirPods in PCMag's \"outstanding\" review.\n            \n    \n\n    \n        Add to Cart Newsletter\n            Shop smarter, save more money\n        \n        \n            Daniel Oropeza\n            \n        \n        Get all the best deals and biggest sales curated by Daniel and the team.\n    \n    \n        Add to Cart Newsletter\n            Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n        \n    \n\n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2025 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AirPods 4 With (and Without) ANC Are Under $100 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KBNBQGX6AE1DJEGPMS0JKN4E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-09T19:00:21.000Z",
      "dateModified": "2025-12-09T19:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]