[
  {
    "title": "Why I Won't Be Giving ChatGPT Health My Medical Records",
    "url": "https://lifehacker.com/tech/dont-give-chatgpt-health-your-medical-records?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T20:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key T",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            ChatGPT Health is a sandboxed tab for conversations about your health, including medical records.\n                                            OpenAI says it's \"not intended for diagnosis or treatment.\"\n                                            LLMs' unreliability, as well as privacy and security concerns, mean using ChatGPT Health might be unwise.\n                                    \n            \n    Table of Contents\n    \n        \n        This week, OpenAI announced its new ChatGPT Health feature, which will let users upload their medical records and ask health related questions. However, I certainly won't be making use of it, it might not be the best idea for you to do it either, for both reliability and privacy reasons. The new ChatGPT Health feature will be a sandboxed tab inside the app that is isolated from your conversation history in other conversations with the chatbot. This tab also allows users to connect a variety of health-tracking apps like Apple Health, MyFitnessPal, and Peloton, as well as uploading medical records directly.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nIt's important to note that this is a lot of really personal information to hand over to any tech company—but especially one that isn't primarily focused on providing medical services. OpenAI says that the ChatGPT Health space operates with \"enhanced privacy to protect sensitive data,\" but it doesn't use end-to-end encryption to secure that data. And while the company says data collected via Health isn't used to train its foundation models, it's impossible to know whether that may change in the future. Security breaches can also occur (and have in the past), potentially leaving your medical records exposed.\nThere's also the question of whether the risk of uploading your data is worth it in the first place. According to OpenAI's own data, around 5% of all messages to ChatGPT are already users asking questions about their health, and ChatGPT (and other LLM tools) have a nasty habit of providing inaccurate diagnostic information. This is perhaps why OpenAI says that its new ChatGPT Health feature is \"not intended for diagnosis or treatment.\"\n            \n                What do you think so far?\n            \n        \nCurrently, there's a waitlist to sign up for ChatGPT Health, and over time it will roll out to all users. At the very least, that means that until the feature is available, it's probably a good idea not to ask the regular version of ChatGPT about your health concerns. At the very least, wait until the enhanced privacy sandbox is available. In the meantime, consider whether it makes more sense to just talk to your doctor directly if you have questions or concerns about your health.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why I Won't Be Giving ChatGPT Health My Medical Records",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGNJDCMT3JTWC4A7YNJXZ3/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T20:00:00.000Z",
      "dateModified": "2026-01-08T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
    "url": "https://lifehacker.com/tech/delete-bloatware-from-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: rblfmr / Shutterstock\n                            \n    Table of Contents\n    \n        \n        Any new phone almost certainly comes with a handful of preinstalled apps you'll never use, regardless of which manufacturer you buy from or which operating system you're on. Some devices are more bloated than others: Google Pixels have a relatively \"clean\" build compared to Samsung phones, for example, and don't typically come with third-party apps and games. But you may still want to eliminate apps and features that clutter your home screen, take up valuable space, and create a drag on performance, especially if you have alternatives you like more. On Android, that likely means uninstalling what you easily can and disabling everything else. What you can (and can't) uninstall on AndroidUnfortunately, many preinstalled first-party apps can't be easily removed. This varies by manufacturer and device—for example, Pixel users can uninstall Google Play Games and Books but are stuck with Chrome, Drive, Maps, and Calculator. As HowToGeek points out, you can delete other pre-selected Google apps added during initial setup, such as the Pixel Watch app and NotebookLM. \nOn Samsung Galaxy phones, again, some preinstalled bloatware is locked in, but ZDNET calls out five native apps that most users should delete right away: Global Goals, Samsung Free, Samsung TV Plus, Samsung Shop, and Samsung Kids. To uninstall an app on your Pixel, go to the Google Play Store and tap the Profile icon. Tap Manage apps & devices > Manage, select the app you want to remove, and tap Uninstall. On Samsung, go to Settings > Apps, tap the app name, and tap Uninstall > OK. You can also touch and hold the app icon on your home screen and tap or drag to uninstall. \n            \n                What do you think so far?\n            \n        \nIf you're absolutely set on removing preinstalled apps that can't be deleted using the above steps, you can use the Android Debug Bridge (ADB), but these methods are more advanced. How to disable preinstalled appsBuilt-in apps that aren't in use can be disabled, which hides the icon from your app drawer. They'll still take up space, but at least they'll be out of sight. Most preinstalled apps can be disabled if you don't need them, with the exception of critical system apps. On your Pixel, go to Settings > Apps > See all apps to select individual apps, and tap Disable at the top of the screen. You can hide preinstalled Samsung apps from your home screen settings: tap Hide apps and tap the icon of the apps you want to disable, the press Done. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Delete 'Bloatware' From Your Android (and Why You Should)",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHZX6P8BKAS9C0QZX82B0DT/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T19:30:00.000Z",
      "dateModified": "2026-01-09T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Best Firewall App for Mac I've Ever Used, and It's Free",
    "url": "https://lifehacker.com/tech/firewally-free-app-for-macos?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEJ4C3JQFF5DYWJYBKHXPS6A/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Justin Pot\n                            \n    Table of Contents\n    \n        \n        Most people haven't actively managed a firewall in at least a decade, assuming they ever have. But keeping track of which applications are using the internet—and how much data they're using—is still useful at times, as is blocking apps from accessing the net entirely.While you're traveling, for example, internet access might be limited, so it's a good idea to cut off applications that constantly churn through data. But even while at home, it's a good security practice to review which applications are connecting to the internet. And while macOS comes with a firewall, it's not really a useful tool for that.Which is why I like FireWally. This totally free application, offered by the Ukraine-based indie Mac developers Nektony, isn't a tool for power users—it's streamlined and user friendly. Click the menu bar icon and you'll see a list of applications using the internet. You can see a summary of all traffic today, in the past hour, or monitor incoming traffic in real time.\nBeside every application is its data usage. You can see a breakdown of inbound and outbound traffic for any application by hovering the mouse over it. You can block any application from accessing the internet by toggling the switch.\n            \n                What do you think so far?\n            \n        \n\n    \n            \n            \n                                        Credit: Justin Pot\n                    \n    \nWhat if you don't recognize an application? I, traditionally, ended up copying the name of the application and pasting it into a search engine. FireWally tries to save you some time by providing AI-generated summaries of each application using Apple Intelligence (assuming your Mac supports that feature). It's a useful way to quickly remind yourself what a particular application is, or to identify one you don't recognize.It's a very streamlined application, but perfect for anyone hoping to understand a bit more about how much data their various Mac applications are using. Give it a spin if you're looking for a simple firewall application.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Best Firewall App for Mac I've Ever Used, and It's Free",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEJ4C3JQFF5DYWJYBKHXPS6A/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T20:30:00.000Z",
      "dateModified": "2026-01-09T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Now Lets You Filter Shorts Out of Search",
    "url": "https://lifehacker.com/tech/youtube-now-lets-you-filter-shorts-out-of-search?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHWWQHE9MYVT1AMJZAFVWV8/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T18:30:01.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Senior Technology Editor. He has a BFA in Film & TV from NYU, where he specialized in writing. Jake has been helping people with their technology professionally since 2016, beginning as a technical specialist at New York’s 5th Avenue Apple Store, then as a writer for the website Gadget Hacks. In that time, he wrote and edited thousands of news and how-to articles about iPhones and Androids, including reporting on live demos from product launches from Samsung and Google. In 2021, he moved to Lifehacker and covers everything from the best uses of AI in your daily life to which MacBook to buy. His team covers all things tech, including smartphones, computers, game consoles, and subscriptions. He lives in Connecticut.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: 19 STUDIO/Shutterstock\n                            \n            \n                Key Takeaways\n                                            YouTube now officially lets you filter Shorts out of search.\n                                            When you search for something on YouTube, you can choose to only see long-form videos, and omit Shorts completely.\n                                            You have to set this filter each time you perform a search.\n                                            The change is part of a wider update to how YouTube's search filters work.\n                                    \n            \n    Table of Contents\n    \n        \n        Internet videos have always been addicting, but short-form content is a whole other beast. Whatever platform you watch them on, these brief clips pull you in and don't let go, and, before you know it, you've mindlessly scrolled through hours of videos, most of which you'll never remember watching. YouTube Shorts are no exception. But unlike TikTok or Instagram, short-form content is not the main source of videos on the platform. YouTube, of course, hosts long-form videos first and foremost, and is the sole reason why many of us visit the site or app. Shorts are just an afterthought, but an afterthought that YouTube pushes hard. You might hop on to watch a specific video, or check out new content from your subscriptions, but to do so, you'll have to push past rows of \"Shorts\" all vying for your attention. God help your afternoon if you accidentally click on one. If you like YouTube Shorts, please disregard. But for the rest of us that just want to find and watch standard videos on YouTube, there's now some respite: As part of a larger update to search filters and content discovery, YouTube is now allowing users to filter out Shorts in searches. The company is pitching this as a way to separate searches between either Shorts or traditional videos, but you'll never catch me searching specifically for Shorts. What YouTube has done here, at least for users like myself, is to create a way to exclude Shorts from any particular search. \nHow to remove YouTube Shorts from searchTo start, open YouTube and search for something. You should now see a series of options along the top of the display, one of which is \"Videos.\" Choose it, and you'll reload the search with only long-form videos. Huzzah. You can also do the same from the greater search filters settings: On desktop, when the results appear, select \"Filters\" in the top right then look for \"Type\" on the left of the \"Search filters\" pop-up window. On mobile, tap the three dots icon, then choose \"Search filters.\" On both platforms, you'll find the \"Videos\" option here.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nUnfortunately, this isn't something you can set and forget: You'll need to choose this option every time you search for something, which is definitely a bummer. That said, at least there's some way to filter Shorts out of a search—especially if those Shorts were impacting your ability to find what you were looking for in the first place. \n            \n                What do you think so far?\n            \n        \nYouTube might not ever let us disable Shorts completely, but there are tools to get around them. You can choose to limit how many Shorts you watch in any given day—though the guardrails aren't necessarily strict. The company also lets you tell them to show you fewer Shorts on the home page, but if that's not enough, you can also install an extension to block Shorts from your feeds.Other changes to YouTube filtersIn addition to this new Shorts filter, YouTube made some adjustments to filters and sorting options. \"Sort By\" is now known as \"Prioritize,\" and while YouTube doesn't say whether it changed the function, it does say the menu \"aims to maximize utility.\" The company also changed the \"View count\" sort option to \"Popularity.\" The menu still takes view count into consideration, but also watch time, to sort videos in a search by the algorithms' assumed popularity.    Finally, YouTube is removing the \"Upload Date - Last Hour\" and \"Sort by Rating\" options from search. The company says you can still find videos uploaded most recently from the \"Upload Date\" filters. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Now Lets You Filter Shorts Out of Search",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHWWQHE9MYVT1AMJZAFVWV8/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T18:30:01.000Z",
      "dateModified": "2026-01-09T18:30:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Stylish Marshall Headphones Are $100 Off Right Now",
    "url": "https://lifehacker.com/tech/marshall-iii-headphones-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Khamosh Pathak\n                            \n        \n            Khamosh Pathak\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceKhamosh Pathak is a freelance tech journalist with over 13 years of experience writing online. An accounting graduate, he turned his interest in writing and technology into a career. He holds a specialization in user experience design from ISDI Parsons in Mumbai, where he sought to deepen his understanding of UX, consumer devices, and interplay between software and technology.Khamosh has written thousands of how-tos and guides on every major platform (iOS, macOS, Android, and Windows). He got started writing how-tos and guides for Guiding Tech, where he also published several e-books. His work has also been seen at MakeUseOf, How-To Geek, and PCMag. He is truly passionate about brewing good coffee.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Marshall/Lifehacker \n                            \n    Table of Contents\n    \n        \n        The ANC headphones from Sony and Bose are great, but they look like gadgets, not music gear. Luckily, Marshall is offering these Monitor III ANC earbuds, which offer a cool retro look. And right now, they're available for the lowest price ever, at $279.99 (down from $379.99), beating the heavyweights from Sony and Bose on price.\nThese Monitor III headphones feature the iconic Marshall script logo, a retro brass control knob (instead of touch buttons), and a textured black vinyl finish that mimics Marshall guitar amps. Other than the looks, the most impressive part is the battery life. These will last you for 70 hours of ANC playback (and 100 hours without ANC). That is a staggering number; for comparison, the Sony XM6 gets you 30-40 hours of playback per charge. The headphones are also collapsible, folding into a small ball. They come with a hard-shell travel case and are pretty lightweight, too, at 250 grams. There is no 3.5mm headphone jack here, but the box does include a USB-C to 3.5mm cable for wired listening.They feature the signature Marshall sound, warm and punchy. They are tuned for listening to rock, heavy metal and guitar-heavy music, and offer a more fun sound profile compared to Sony or Bose, which can sound a bit more flat or balanced.\n            \n                What do you think so far?\n            \n        \nIn its review, PCMag gave the Monitor IIIs a 4.0 star rating, noting that they deliver a \"pleasing audio signature, a comfortable fit with intuitive controls, easy portability, and excellent battery life.\" \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Stylish Marshall Headphones Are $100 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHK89GBWKVY5XPEGZN36WDH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T17:00:00.000Z",
      "dateModified": "2026-01-09T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
    "url": "https://lifehacker.com/tech/ces-2026-chain-up-to-100-ikeas-bluetooth-speakers-together?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Ikea\n                            \n            \n                Key Takeaways\n                                            Ikea showed off the Kallsup Bluetooth speaker, which will cost just $10 in the U.S.\n                                            Ikea is claiming that you can chain up to 100 of them together.\n                                            This product is expected to ship in April 2026.\n                                    \n            \n    Table of Contents\n    \n        \n        At CES 2026, Swedish furniture giant Ikea showed off its new Kallsup Bluetooth speaker, which will cost just $10 in the U.S. Normally, I'd be skeptical of any speaker this cheap, but the Kallsup grabbed my attention for a few reasons—chief among them that Ikea says you can chain up to 100 of them together to create the multi-speaker setup of your dreams. That aside, the hardware seems pretty basic: The speaker has a USB-C port at the back, and two buttons up top (play/pause, and pair).Chaining together Bluetooth speakers is nothing new, but this is the first time I'm seeing the ability to pair as many as 100 of them. The only reason this use case is even remotely plausible is the pricing: As reported by The Verge, the Kallsup Bluetooth speaker will be priced at $10 in the U.S. and €5 (roughly $6) in Europe, which means you can buy 10 of them for the same price as one HomePod mini. The Verge also says  that once you pair one of them to your phone (the company promises Bluetooth 5.3 support), you can add more to the chain with a two-button sequence. \n            \n                What do you think so far?\n            \n        \nDesign-wise, the speakers are cubical and colorful, which I'm a fan of (at the moment, Ikea is showing them off  in white, green, and pink). But how do they sound? Well, Gizmodo says that while they are loud, they don't deliver much in the way of bass. I'd love to get a couple to judge for myself before committing to chaining a few dozen of them together, but I definitely  admire Ikea's big swing here. That said, while CES is the place to grab attention with out-there ideas, and I am struggling to find a use case for chaining 100 Bluetooth speakers together. Maybe if you're an amusement park owner and you want the cheapest possible audio setup for a haunted house? Likely most people will be content with a more reasonable number of them, spread around the house.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: You Can Chain 100 of These Ikea Bluetooth Speakers Together",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECNBP0N5XH5CM568DVVBBVS/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T18:00:00.000Z",
      "dateModified": "2026-01-07T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
    "url": "https://lifehacker.com/tech/turn-on-app-pinning-before-letting-someone-else-use-your-android?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T20:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Tada Images / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        There are likely occasions in your day-to-day life in which you allow someone else to use your phone, whether it's letting your kid play a game or sharing content with a friend. You may do this without thinking about the privacy implications and what might happen if another person has access to everything on your device and—accidentally or on purpose—uses it to view your search history, scroll through your photos, or send messages to your contacts. If you're an Android user, you should enable app pinning to keep others from snooping around your device. This feature keeps the user in the pinned app until you enter your PIN, pattern, or password. (On iOS, you can achieve a similar effect with Guided Access, which also allows you to set time limits and disable the keyboard and touch input.)To pin apps, you'll need to enable the feature in your phone's Settings app. To do so, go to Security or Security & location > Advanced > App pinning and toggle on Use app pinning and Ask for PIN before unpinning. \nBefore handing your phone over, open to the app screen you want to pin, then swipe up to the middle of the screen and hold to open your Overview. Tap the app's icon, then tap Pin. This will keep the user locked into that app until you unpin (using your PIN, pattern, or password). \n            \n                What do you think so far?\n            \n        \nDepending on your device navigation settings, there are a few ways to unpin an app: Gesture navigation: Swipe up and hold2-button navigation: Touch and hold Back + Home3-button navigation: Touch and hold Back + OverviewNote that pinning won't prevent someone from using the app fully, such as swiping through your photos or typing in the search bar, as Android doesn't have the option to disable touch. Pinned apps can also open other apps. At the very least, though, it keeps someone from having access to anything and everything on your device. \n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turn on 'App Pinning' Before Letting Someone Else Use Your Android",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEAM64MC29Q85Y03VTPCQXCV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T20:30:00.000Z",
      "dateModified": "2026-01-07T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
    "url": "https://lifehacker.com/tech/this-accessory-turns-your-macbook-display-into-a-touchscreen-ces-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-07T16:30:07.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                     ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Pranay Parab\n                            \n        \n            Pranay Parab\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePranay Parab is an independent tech journalist based in Mumbai, India. He covers tech for Lifehacker, and specializes in tutorials and in-depth features.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 7, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Intricuit\n                            \n    Table of Contents\n    \n        \n        Plenty of people have been asking for a MacBook with a touchscreen display, and now that is possible with the Intricuit Magic Screen, according to an announcement at CES 2026. It's a snap-on accessory that attaches to your MacBook's display, and uses one of the USB-C ports on the laptop for power. Once connected, you can touch the Magic Screen and your input will be registered on the Mac.The good news is that this product ships with a stylus, which will make it a lot easier to interact with different Mac apps. When you tap something on your iPhone or iPad, the UI takes into account the fact that your fingers are a lot thicker than a mouse pointer. On the Mac, the default input is the mouse cursor, so the Magic Screen's stylus is better suited to those interactions than using your fingers. Having said that, you can use your fingers with this touchscreen accessory too.Keep in mind that using a snap-on touchscreen accessory has a few caveats. The first is that you can't quickly close your MacBook's lid when the Magic Screen is attached. The company has added a thick piece of plastic to the base of the accessory. This part rests just above your MacBook's keyboard and it'll stop you from accidentally closing your laptop's lid with the Magic Screen attached. This ensures that you won't accidentally damage your laptop'd display by slamming the lid shut when the accessory is attached.\nIt also means that you'll always have to unplug the Magic Screen when you're not using the Mac, which can be a bit annoying. Intricuit says it also works in pen tablet mode, so you can place the Magic Screen on your desk and use your stylus to draw something or to control the Mac. This accessory's battery will last up to 100 hours on a single charge, the company claims.\n            \n                What do you think so far?\n            \n        \nIntricuit announced this product at CES 2026 and said the Magic Screen will be on Kickstarter soon at a launch price of $139. The company says it expects to start shipping the product in the first quarter of 2026. It currently supports the 16-inch M-series MacBook Pro, 14-inch M-series MacBook Pro, 15-inch M-series MacBook Air, and 13-inch M-series MacBook Air models. You'll just need to choose the correct variant for your laptop while placing the order.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: This Accessory Can Turn Your MacBook’s Display Into a Touchscreen",
      "image": [
        "https://lifehacker.com/imagery/articles/01KECJZHYKZXDK8DSY00KQED53/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-07T16:30:07.000Z",
      "dateModified": "2026-01-07T16:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to Choose the Right VPN for You",
    "url": "https://lifehacker.com/tech/how-to-choose-the-right-vpn-for-you?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-07T14:30:00.000Z",
    "description": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for an",
    "body": "\n        \n        There are many good reasons to get a VPN (Virtual Private Network) app installed on your phone or laptop: They make it harder for anyone else to track your browsing, they keep your data safe when you're on public wifi networks, and they even let you spoof your location so you can access geolocation-locked content.You'll also find plenty of choice when it comes to VPNs. Our own guides to the best paid VPNs and the best free VPNs show the wealth of impressive apps out there, and even when you narrow down the criteria, you've still got lots of options to pick from—see our recommendations for the best free VPNs for Android.So what exactly should you be looking for when it comes to choosing the right VPN for you? These are the features and selling points that you'll see mentioned when you're browsing VPN comparisons, and what they mean (and once you've built up a shortlist from these criteria, then you can look at the prices and extras).\nBrowsing speedOne of the downsides of loading up a VPN is that your browsing speed can suffer, while your data gets pinged around multiple servers across the globe. Ideally, you want all the protection that a VPN offers, without too much of a hit on download and upload rates (no matter how many other people are using the same VPN).Unfortunately, this isn't really something you can gauge just by looking at VPN listings and ads, as most VPNs will claim to be the fastest. Either read benchmark tests put together by publications and authors you trust (watch out for sponsored content), or make use of as many free trials as you can and do some testing yourself.Server locations\n    \n            \n            Even VPN service will tell you how many servers it has, and where they are.\n                                        Credit: ExpressVPN\n                    \n    \nYour VPN of choice needs to reroute your internet traffic somewhere, and how many servers a particular VPN has around the world can make a substantial difference to speed and availability. It's also going to determine where in the world you can pretend to be of course, if you want to jump to another country virtually.Broadly speaking, the more servers the better, though as with VPN speeds you may have to do some testing of your own to check reliability and transfer rates. Look for server locations close to you (for speed), and outside of heavily censored or surveilled countries (for privacy), and check any technical specs that are given for them.Split tunneling and kill switchesSomething else to look out for is split tunneling, or the ability to send only some of your internet traffic through a VPN. This means you get better speeds (and less security and privacy) on data that's not so important, if you're just reading the news or learning a language. It's a feature that many of the best VPNs now offer.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAnother feature worth checking for is a kill switch. It sounds rather dramatic, but it's simply a feature that shuts down your internet connection if the data encryption somehow fails—cutting you off from the internet, but preventing your connection and data from being exposed. Again, this is now fairly common, but not every VPN offers it.No logs or zero logs\n    \n            \n            Mullvad VPN lets you pay by cash, if you don't want to enter payment info.\n                                        Credit: Mullvad VPN\n                    \n    \nYou should only consider VPNs that have clear no-logs policies (no browsing data is permanently retained) or zero-logs policies (supposedly even stricter, covering more data). Don't take the VPN's word for it. though: Look for third-party audits from independent security companies, carried out regularly, to verify these claims.If these logs are retained, they might be sold to data brokers, or pulled by law enforcement agencies—so check the individual privacy policies for details of what happens when you're connected to your VPN. Some VPNs go above and beyond when it comes to letting you stay anonymous: Mullvad VPN lets you pay by cash through the post, for example.\n            \n                What do you think so far?\n            \n        \nVPN protocolA VPN protocol is the way that the VPN connects to the internet at large: It makes a major difference to speed and security, and you'll often see it mentioned in VPN listings. However, as important as it is, it's not something that's easy to compare across different VPN services—most VPNs will simply say their protocol of choice is the best.Once you've got a shortlist of VPNs together, do some background reading on the protocols they use: Look for independent assessments of their security and transparency, technical benchmarks, and protocols that have been open sourced so they can be analyzed. OpenVPN and WireGuard are two well-regarded protocols, for example.Location and reputation\n    \n            \n            Where a VPN is based is important, as well as where it connects to.\n                                        Credit: Lifehacker\n                    \n    \nVPN companies are bound by the laws and regulations of the country that they're based in—so it's a good idea to look for ones based in places where surveillance regulation and government monitoring is less strict. If necessary, check the VPN's policies on how it deals with data requests from the authorities and law enforcement in its local region.It's also worth weighinga VPN company's reputation: How does it make money? What other services does it offer? What's its record with data breaches? This is much more important with a VPN than it is with your streaming music provider, for example, because you're trusting it with all of your online data while you're connected.Trials and money backGenerally speaking, it's worth paying for a VPN, as you're giving it so much responsibility in terms of your online access and security. The paid options are almost always going to give you a faster and more reliable service, and if you regularly make use of a VPN then the monthly fee is well worth the investment.It is, however, worth looking for services that offer free trials and your money back if you're not satisfied (usually after 30 days). Not only does it reflect well on the VPN company, it means you can see if the VPN suits your needs—and check how fast its servers are—before signing up for any kind of payment plan.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to Choose the Right VPN for You",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEC6X19FDSW9A9CDGB0RG4B0/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-07T14:30:00.000Z",
      "dateModified": "2026-01-07T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CES 2026: XREAL's New Smart Glasses Put a Massive Gaming Monitor Right on Your Face",
    "url": "https://lifehacker.com/tech/ces-2026-xreals-new-gaming-glasses-put-huge-gaming-monitor-on-face?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEARPEB5CC2HAP0XRW2DPNQ4/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-06T23:48:16.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                         ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle Ehrhardt is Lifehacker's Associate Tech Editor. She has a bachelor's degree in history from Earlham College, where she also double majored in theatre. She also holds an MFA in game design from NYU. Michelle's career as a journalist began at Out Magazine, where she covered games, music, film, and politics with an eye towards the LGBT perspective.Michelle is a member of the New York Video Games Critics Circle, where she sits on the Game Journalism Award committee. She has participated in panels and workshops at New York's DreamYard Program and has hosted both the Tom's Hardware Show and the Gadgettes podcast.Her work has been featured in outlets including Paste, The Atlantic, Tom's Hardware, Gizmodo, and The Advocate. Some of her favorite pieces include her annual CES recaps, her video game reviews, and her interviews with hardware makers and independent video game developers.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Michelle Ehrhardt\n                            \n            \n                Key Takeaways\n                                            The ROG XREAL AR glasses bring a 171-inch, 240Hz screen into AR.\n                                            They come with a dock that can support up to three devices at once.\n                                            2D-to-3D conversion is planned for the future.\n                                    \n            \n    Table of Contents\n    \n        \n        I've been a fan of XREAL for a while, but outside of people who are really into AR, it's still a lesser-known company. Lifehacker has given XREAL's glasses stellar reviews before, but in the company's new collaboration with Asus, it's aiming to expand its market. The new ROG XREAL R1 AR glasses are the first XREAL glasses aimed specifically at gaming (though its other models aren't exactly bad for gaming), and they basically put the best gaming monitor you could ever want right in front of your face. You wear these like a normal pair of sunglasses, and you get a massive 171-inch virtual TV floating in a black void right in front of you. It's an OLED, so there are crisp colors and high contrast, and the resolution is a respectable 1080p. Most importantly, the glasses max out at a 240Hz refresh rate, meaning they can display up to 240 frames per second.Taken all together, that's better than pretty much all of the full-size desktop monitors I have at home, but these are portable. They're barely heavier than my reading glasses, too, and you can set your virtual screen to either be anchored in one spot (meaning it won't follow your head) or stay in front of your eyes at all times. I prefer the former, since it shakes around less.\n\n    \n            \n            \n                                        Credit: Michelle Ehrhardt\n                    \n    \nI also didn't get any of the usual problems I have with AR or VR, like light bleed or fuzzy graphics. Aside from the black void, this really did feel like looking at a real-life screen. And you don't even have to use the full 171 inches, if you prefer something smaller.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nAside from the glasses, Asus is also shipping these with a dock, to help you better use them with your various devices. It has two HDMI ports and one DisplayPort connection, so you can have up to three devices ready to go at one time. It's probably the most realistic way to simulate gaming on a movie theater screen, and it's only set to improve down the line. Asus told me these glasses will eventually support XREAL's 2D-to-3D conversion tech, which just came out on the new XREAL 1S glasses and automatically converts any image to 3D. The effect uses AI to determine how to split the image between your eyes, but it was so convincing to me when I tried it with Mario Kart World that it felt like it was officially developed by Nintendo.\n            \n                What do you think so far?\n            \n        \nAnd on that end, I have confirmation from XREAL that the ROG XREAL R1 glasses are compatible with the XREAL Neo mobile dock and battery pack. This is much more compact than the dock that comes with the headset, and, if you plug the glasses and the Nintendo Switch or Switch 2 into it at the same time, it will allow you to play your Nintendo console in AR. Even Asus' dock can't do that without another Switch dock acting as an intermediary first. Plus, this will charge whatever device you're playing at the same time.The ROG XREAL R1 AR glasses will release later this year, although pricing isn't available quite yet. They're expected to release in the first half of this year.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CES 2026: XREAL's New Smart Glasses Put a Massive Gaming Monitor Right on Your Face",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEARPEB5CC2HAP0XRW2DPNQ4/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-06T23:48:16.000Z",
      "dateModified": "2026-01-06T23:48:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Apple Watch Ultra 2 Is Back to Its Lowest-Ever Price",
    "url": "https://lifehacker.com/tech/apple-watch-2-ultra-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HHJN6EY1XT8S8N4MCQN3W3WV/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Rene Ramos\n                            \n    Table of Contents\n    \n        \n        Apple's flagship products rarely get substantial discounts—but if you wait for the right moment, you can grab a great deal. If you've been eyeing Apple's top-of-the-line smartwatch, that moment is now: The Apple Watch Ultra 2 has dropped to $549.99 on Amazon, saving you $250 off the retail price. This matches the lowest price it has yet reached, according to price tracking tools. \nThe Apple Watch Ultra 2 was released in September 2023, and after the Ultra 3 dropped last two years later. it was inevitable that the Ultra 2 would see a price reduction. The cool thing is you don't need the latest model to receive the latest WatchOS features, since Apple has a good record of updating their flagship products for many years to come. The Ultra is the premium Apple Watch model, with the biggest case size, brightest screen (3,000 nits), deepest water resistance (100 meters), and longest battery life (up to 36 hours).\nThe Apple Watch Ultra 2 is packed with fitness-focused features, but even if you aren’t a health nut, it also has a lot of great features for casual users. People who want a reliable sleep tracker can learn a lot about their sleep habits with the Ultra 2 as long as they keep it well-charged. \n            \n                What do you think so far?\n            \n        \nCurrently, all sizes are available for $549.99, but not all colors are available. You can read more about this watch on PCMag's \"excellent\" review.The Ultra 2 is different than the previous first-generation Apple Watch Ultra, which you can find for $319 refurbished at Amazon. It’s also different from the Apple Watch Series 11, which you can get for $329 on Amazon right now. If you're looking for the latest budget-friendly Apple Watch, consider the third-generation Apple Watch SE available for $269 (originally $299).\n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Apple Watch Ultra 2 Is Back to Its Lowest-Ever Price",
      "image": [
        "https://lifehacker.com/imagery/articles/01HHJN6EY1XT8S8N4MCQN3W3WV/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T19:00:00.000Z",
      "dateModified": "2026-01-09T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
    "url": "https://lifehacker.com/tech/airpods-pro-3-deal-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-08T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                   ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Daniel Oropeza\n                            \n        \n            Daniel Oropeza\n                \n                                            Staff Writer\n                                    \n            \n            \n        \n            ExperienceDaniel is a Staff Writer for Lifehacker. He served in the U.S. Navy, where he reached the rank of Petty Officer 3rd Class as a Logistic Specialist and was awarded a Navy Community Service Medal and Navy Letter of Commendation for his exemplary service aboard the USS Theodore Roosevelt aircraft carrier. He earned his bachelor's in Environmental Science from the University of California, Davis, and earned his master’s degree from the Columbia University Graduate School of Journalism. Daniel was a business reporter for the Miami Herald before joining Lifehacker. He lives in Atlanta, GA.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 8, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Illustration by Ian Moore and product image courtesy of Amazon.\n                            \n    Table of Contents\n    \n        \n        The latest AirPods Pro are a big step up from the first-generation buds. The third (and newest) generation comes with OTA updates that the AirPods Pro 2 also get to enjoy—but considering the second and third generations are the same price right now, why not go with the newer version? The AirPods Pro 3 are down to $199 (originally $249.99), which they briefly hit back in December during the holiday sales—the lowest price yet, according to price tracking tools.\nThe AirPods Pro 3 improve on already great premium earbuds with new features (like a heart rate sensor) without increasing the list price. You'll get Personalized Spatial Audio (so you can hear sounds seemingly coming from different directions as you move your head) and the ability to use head gestures to tell Siri \"yes\" or \"no\" (this also works for answering or denying calls). Apple added a live translation feature to both the second- and third-generation AirPods Pro when iOS 26 rolled out earlier this year. You'll also get features like Conversation Awareness, which lowers your music volume when your AirPods detect that you're talking to someone; Transparency Mode, which lets you better hear your surroundings while your earbuds are in; and Adaptive Audio, which combines ANC and Transparency mode to adjust ANC levels based on the noise around you.\n            \n                What do you think so far?\n            \n        \nSince these are in-ear earbuds (as supposed to regular earbuds like the AirPods 4) the ANC is much better since it naturally blocks out the noise with a tight seal, but the ANC technology itself has also improved—as has the sound quality, thanks to the new H3 chip, as PCMag detailed in its \"exemplary\" review, calling them the best earbuds your money can buy. You can expect about eight hours of juice, depending on your usage, and another 24 hours from the charging case. \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The AirPods Pro 3",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEFGV810HZDZJX0870BHJ3X4/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-08T19:30:00.000Z",
      "dateModified": "2026-01-08T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Popular Chrome Extensions Are Stealing Your AI Chats",
    "url": "https://lifehacker.com/tech/chrome-extension-stealing-ai-chats?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEF38R9Z7WSA2ND991PT9G9G/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-09T14:00:00.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n   ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Bangla press/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Two malicious Chrome extensions are sending AI chatbot conversations and browsing data directly to threat actors' servers.\n                                            The offenders are impersonating legitimate extensions that connect with ChatGPT and DeepSeek.\n                                            Just because a browser extension is labeled as featured or verified doesn't mean it can be trusted.\n                                    \n            \n    Table of Contents\n    \n        \n        Hackers continue to find ways to sneak malicious extensions into the Chrome web store—this time, the two offenders are impersonating an add-on that allows users to have conversations with ChatGPT and DeepSeek while on other websites and exfiltrating the data to threat actors' servers. On the surface, the two extensions identified by Ox Security researchers look pretty benign. The first, named \"Chat GPT for Chrome with GPT-5, Claude Sonnet & DeepSeek AI,\" has a Featured badge and 2.7K ratings with over 600,000 users. \"AI Sidebar with Deepseek, ChatGPT, Claude and more\" appears verified and has 2.2K ratings with 300,000 users. However, these add-ons are actually sending AI chatbot conversations and browsing data directly to threat actors' servers. This means that hackers have access to plenty of sensitive information that users share with ChatGPT and DeepSeek as well as URLs from Chrome tabs, search queries, session tokens, user IDs, and authentication data. Any of this can be used to conduct identity theft, phishing campaigns, and even corporate espionage. \nResearchers found that the extensions impersonate legitimate Chrome add-ons developed by AITOPIA that add a sidebar to any website with the ability to chat with popular LLMs. The malicious capabilities stem from a request for consent for “anonymous, non-identifiable analytics data.\" Threat actors are  using Lovable, a web development platform, to host privacy policies and infrastructure, obscuring their processes. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nResearchers also found that if you uninstalled one of the extensions, the other would open in a new tab in an attempt to trick users into installing that one instead. How to avoid malicious browser add-onsIf you've added AI-related extensions to Chrome, go to chrome://extensions/ and look for the malicious impersonators. Hit Remove if you find them. As of this writing, the extensions identified by Ox no longer appear in the Chrome Web Store. \n            \n                What do you think so far?\n            \n        \nAs I've written about before, malicious extensions occasionally evade detection and gain approval from browser libraries by posing as legitimate add-ons, even earning \"Featured\" and \"Verified\" tags. Some threat actors playing the long game will convert extensions to malware several years after launch. This means you can't blindly trust ratings and reviews, even if they've been accrued over time. To minimize risk, you should always vet browser extensions carefully (even those that appear legit) for obvious red flags, like misspellings in the description and a large number of positive reviews accumulated in a short time. Head to Google or Reddit to see if anyone has identified the add-on as malicious or found any issues with the developer or source. Make sure you're downloading the right extension—threat actors often try to confuse users with names that appear similar to popular add-ons. Finally, you should regularly audit your extensions and remove those that aren't essential. Go to chrome://extensions/ to see everything you have installed. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Popular Chrome Extensions Are Stealing Your AI Chats",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEF38R9Z7WSA2ND991PT9G9G/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-09T14:00:00.000Z",
      "dateModified": "2026-01-09T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Samsung 65-Inch QLED TV Is $400 Off Right Now",
    "url": "https://lifehacker.com/tech/samsungs-65-inch-qn90f-neo-qled-tv-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEGYJV3A0V1V3385JJVAV62X/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T13:30:11.000Z",
    "description": "\n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                        ",
    "body": "\n    \n                                    \n        \n        \n        \n    \n                                Pradershika Sharma\n                            \n        \n            Pradershika Sharma\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperiencePradershika Sharma is a tech deals writer for Lifehacker. She has a Master’s degree in English Literature, a B.Ed., and a TESOL certification. She has been writing professionally since 2018, creating product reviews, affiliate articles, and search ads for global clients while working with Rubix Agency and Cognizant. Previously, she spent a year teaching English at the junior high level.An avid reader since childhood, Pradershika's idea of extreme sports is staying up to read “just one more chapter.” She lives in India.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        January 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        The 65-inch Samsung QN90F Neo QLED TV is currently $1,199.99 on Woot in \"factory-reconditioned\" condition. That undercuts a new unit, which sits around $1,600 on Amazon, and even slips below what some retailers ask for “like-new” stock. This deal runs for seven days or until it sells out. Shipping is free for Prime members, while everyone else pays a flat $6 fee. One thing to note before checkout: This item doesn’t ship to Alaska, Hawaii, or PO boxes, and you’ll need to provide a valid phone number and physical shipping address.The QN90F isn’t a midrange panel dressed up with buzzwords. It’s Samsung’s current flagship mini-LED 4K TV, built to get extremely bright (over 2,500 nits) while still holding deep blacks and tight contrast. The screen uses Samsung’s glare-reducing coating, which won’t defeat direct sunlight but does take the edge off harsh overhead lighting. In daily use, the QN90F feels more polished than most LED TVs. The bezel-free design keeps attention on the screen, and the compact metal stand doesn’t dominate your media console. Around back, you get four HDMI ports, two USB ports, Ethernet, optical audio, and an antenna input, all tucked into a side-facing recess that keeps cables tidy. The included SolarCell Remote is refreshingly practical. It charges via USB-C or ambient light, so you’re not cycling through disposable batteries. Picture quality is where this TV earns its flagship status. Mini-LED backlighting delivers OLED-like blacks with minimal bloom, and colors stay balanced rather than oversaturated. That said, there’s no Dolby Vision support, which is still a sticking point for some buyers, but HDR10 and HDR10+ performance here is strong enough that many viewers won’t miss it.\n            \n                What do you think so far?\n            \n        \n\n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \nThis TV also leans hard into gaming and smart features. The panel runs at 120Hz natively and supports VRR up to 165Hz, along with AMD FreeSync Premium Pro. Input lag stays under 10ms, which is well within “good for gaming” territory, according to PCMag’s “excellent” review of this smart TV. PC gamers can even use ultrawide 21:9 or 32:9 modes. Sound is better than average, too, thanks to a 60W 4.2.2-channel system with Dolby Atmos and support for Samsung’s Q-Symphony if you add a compatible soundbar. Tizen OS covers every major streaming service and supports Alexa, Apple AirPlay, and Matter smart-home control, though the interface still feels busy and occasionally buried under layers of menus. At this price, the reconditioned QN90F makes sense for buyers who want top-tier brightness and gaming performance without paying the full flagship price.\n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Samsung 65-Inch QLED TV Is $400 Off Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEGYJV3A0V1V3385JJVAV62X/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T13:30:11.000Z",
      "dateModified": "2026-01-09T13:30:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Premium Earbuds Are Over $100 Right Now",
    "url": "https://lifehacker.com/tech/bowers-wilkins-pi8-anc-earbuds-sale-january-2026?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KEHS9AQTJJSTTQGFB4VXSNFA/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-09T17:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Woot\n                            \n    Table of Contents\n    \n        \n        Premium noise-canceling wireless earbuds don’t come cheap, and Bowers & Wilkins earbuds (a brand owned by Samsung) are definitely at the top end of that category. But in a market crowded with ANC earbuds that do little more than meet the bare minimum, these justify their price tag by leaning into thoughtful features, sound quality, and build that go beyond the basics. Right now, a brand-new pair of Bowers & Wilkins Pi8 earbuds are going for $279.99 (originally $399) on Woot, their lowest price ever. \nCompared to the Pi7, the Pi8 has improved noise cancellation, higher-grade 12mm drivers with Carbon Cone technology, and an upgraded digital-to-analog converter alongside an updated digital signal processor. Its charging case also functions as a Bluetooth transceiver, making it seamlessly functional with in-flight entertainment when you’re on the go. CNET, in a glowing review, dubbed them “easily among the best-sounding earbuds out there,” and they also have a more secure and comfortable fit than their predecessors, making them more ergonomic. The review does note that they don’t have a 3.5mm headphone port but do include a USB-C to 3.5mm cable adaptor.The Pi8 earbuds have the latest Bluetooth 5.4 with support for aptX Adaptive and aptX Lossless for top-quality wireless streaming, as well as an IP54 dust and sweat rating. The case offers around 6.5 hours per charge with ANC on, going up to 13.5 hours with the charging case and a 15-minute quick charge that gives you 2 hours of playback. While 6.5 hours is decent, it’s not best-in-class compared to competitors that reach the eight to 10 hour mark. And although it has three built-in mics for calls, users also note that background noise can occasionally leak through.\n            \n                What do you think so far?\n            \n        \nUltimately, if premium sound quality, music fidelity, and rare features like wired retransmission are at the top of your priority list, the Bowers & Wilkins Pi8 earbuds are a comfy and travel-friendly option with competitive ANC. However, if your top priorities are maximum noise cancellation and battery life, you may want to consider the (lower-priced) Bose QuietComfort earbuds instead. \n            \n                    Our Best Editor-Vetted Tech Deals Right Now\n                \n            Deals are selected by our commerce team\n                            \n        \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Premium Earbuds Are Over $100 Right Now",
      "image": [
        "https://lifehacker.com/imagery/articles/01KEHS9AQTJJSTTQGFB4VXSNFA/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-09T17:30:00.000Z",
      "dateModified": "2026-01-09T17:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]