[
  {
    "title": "That Grubhub Bitcoin Email Is a Scam",
    "url": "https://lifehacker.com/money/grubhub-bitcoin-email-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: BestStockFoto/Shutterstock \n                            \n            \n                Key Takeaways\n                                            Scammers are impersonating Grubhub to promote a crypto rewards scam.\n                                            Emails were sent from addresses on a legitimate Grubhub subdomain.\n                                            Grubhub is not actually doling out $10,000 in bitcoin.\n                                    \n            \n    Table of Contents\n    \n        \n        Some Grubhub users have received a tempting email offer from the food delivery service: Send $1,000 in bitcoin to a specified wallet, and get 10 times that amount back. Unfortunately, this is very much a scam.  As BleepingComputer reports, these promo emails were sent from addresses on b.grubhub.com, a legitimate Grubhub subdomain, so they appear verified in recipients' inboxes. Two examples of senders include [email protected] and [email protected]. Beyond that, there are some pretty clear red flags. The subject line reads \"30 minutes left - We'll 10x your Bitcoin!\" to promote a sense of urgency and an offer too good to be true (but also too good to ignore). The body includes the recipient's name and instructions on how to participate in Grubhub's \"Holiday Crypto Promotion\" with a bitcoin wallet address. While Grubhub has acknowledged the problem, they haven't released any details as to what facilitated attackers sending emails using a company address. The company did suffer a major security breach earlier this year, resulting in the leak of some user data (including names and email addresses). \n            \n                What do you think so far?\n            \n        \nThere are several varieties of the crypto reward scamThe Grubhub email promotion is a pretty typical example of a cryptocurrency scam. The Federal Trade Commission outlines several variants, including get-rich-quick schemes guaranteeing big returns on your investment and celebrity-promoted \"giveaways\" that claim to multiply any funds you send.If you fall for crypto fraud, there's no way to track or get your money back, and even if victims are few and far between, scammers can score big paydays. That's why you should be especially wary of anything and everything requiring a crypto transaction, especially if the offer sounds urgent or provokes a sense of either excitement or fear. And remember that no legitimate organization—government agency, law enforcement official, utility company, or prize promoter—will ever ask for payments in cryptocurrency.\n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Grubhub Bitcoin Email Is a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDPB8KZSCNR1QX8Q9JQ4RMPY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Don't Fall for This 'Out of Stock' Purchase Scam",
    "url": "https://lifehacker.com/money/out-of-stock-purchase-scams?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD13SDCX6KCTMZNT4Y30R6K1/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-22T15:00:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Ta",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n    Table of Contents\n    \n        \n        Scammers frequently target shoppers who are looking for a good deal or a rare find (or both). As holiday sale season winds down, the Better Business Bureau is warning buyers about a scheme in which fraudsters charge you for \"out of stock\" goods and fail to refund your money. The out-of-stock purchase scam is simple: After you buy a product online, scammers send you a notification that said item is no longer available, cancel your order, and tell you that you'll get your money back. Obviously, the refund never arrives, and no one ever responds to further inquiries. As the BBB points out, in most cases, the item you thought you bought probably never existed in the first place—rather, scammers are selling fake stock, charging customers, and vanishing in hopes you won't notice that you didn't receive your refund. Some consumers who submitted reports to the BBB Scam Tracker said that they did receive products, but items were of poor quality or not what they ordered, and no refund was ever issued. Spot out-of-stock purchase scamsThese fake purchase schemes may have the usual red flags, like prices that are too good to be true, especially those promoted on social media. Personalized items are ripe for scams, as are hard-to-find products or collectibles. If you find an amazing deal from a company or seller you don't recognize, search the name with \"scam\" and read reviews on Google and Reddit to identify patterns of suspicious activity (or poor-quality products). You should also be wary of websites that aren't secure—those that don't start with HTTPS or have a lock icon in the browser bar—as these are more vulnerable to hackers looking to intercept credit card info and other personal data. Legitimate vendors collect payment securely. \n            \n                What do you think so far?\n            \n        \nShop with a credit cardShopping scams are a good reason to use a credit card for online purchases, as they offer protection against fraudulent charges. If you don't receive a refund from a seller, you can file a chargeback—while this isn't as simple or swift a process, it is likely you'll get your money eventually.  Always keep receipts, order confirmations, and any communication with sellers in case you need to make a claim for a scam purchase. \n            \n    \n    \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Don't Fall for This 'Out of Stock' Purchase Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD13SDCX6KCTMZNT4Y30R6K1/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-22T15:00:00.000Z",
      "dateModified": "2025-12-22T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the RAFT Technique to Quickly Sort Emails",
    "url": "https://lifehacker.com/how-to-use-the-raft-technique-to-manage-emails?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GGY97XFSWBKK6R08FS0TE/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-24T13:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Vigni Michael - Shutterstock\n                            \n    Table of Contents",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Vigni Michael - Shutterstock\n                            \n    Table of Contents\n    \n        \n        To manage your inbox, you need dedication. You need a plan. You need acronyms. One such acronym is RAFT, which will literally keep you afloat in the sea of emails you receive every day. You can combine it with others, like LIFO and 4D to maximize its benefits, but first you need to know what to do with it on its own.What is RAFT email management?RAFT stands for the following: ReadActFileTrash.Easy! With this management system, you take the time to read an email first, then act on it however you need to—if you need to, that is—before either filing it away somewhere or deleting it. That’s basically all there is to it, but it works because it requires you to focus on each individual email and make an assessment right away, so you don’t miss anything.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nLike the one- and two-touch rules, this one does require you to open your emails as they come in. For me, that's the hardest part because it's a habit you need to build. This approach reminds me of a more broadly-applicable productivity technique I use often, which is the two-minute rule. When you think of something or are prompted to deal with it, handle it right away. Again, it's a habit that needs to be built up, but I like this approach for all kinds of productivity needs—and with RAFT, you have a clearly outlined series of next steps after you open it up. How to get the most out of RAFTTo maximize the benefits, you should combine this with another system or two. For instance, combine RAFT with the LIFO—last in, first out—method, which calls for you to answer your most recent emails before older ones. If you do this, you’ll always be acting on the most urgent needs instead of playing endless catch-up with things that you let slip by. If something from the past is truly important, you’ll get a follow-up email and you can RAFT then. Otherwise, stick with your most pressing, recent messages and read them, act on them, and file or trash them after that.\n            \n                What do you think so far?\n            \n        \nWhen it comes to the acting part, you can call on the trusty 4D method to help you out. The four Ds are delete, do, delegate, or defer, and they refer to the four things you can do with any email. (Delete here is redundant, since “trash” is part of RAFT, but it’s good to reinforce the notion that useless emails should be nuked.) Either do what the email says or delegate it to someone who can, but keep the process moving swiftly. If you don’t end up forwarding it to someone else, delete it or defer (file) it. The main rule of RAFT is you have to do something with every message, not ignore it. As for the filing component of RAFT, make sure you have a great file system in place in advance. If you use Gmail, consider using labels as a more organized archive system, to make whatever you choose to file away more easily accessible. You can label these mini-archives by date, by project, or by whatever makes sense for your retrieval, but be consistent about it so you’re not just banishing all your dealt-with messages to an email limbo. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the RAFT Technique to Quickly Sort Emails",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GGY97XFSWBKK6R08FS0TE/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-24T13:30:00.000Z",
      "dateModified": "2025-12-24T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Is the Easiest Way to Filter Junk Out of Your Gmail Inbox",
    "url": "https://lifehacker.com/the-easiest-way-to-filter-junk-out-of-your-gmail-inbox?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2GM9VNRCNAZ4S1G8DJ9VC5/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-24T13:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Jarretera - Shutterstock\n                            \n    Table of Contents\n   ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Jarretera - Shutterstock\n                            \n    Table of Contents\n    \n        \n        No matter how dedicated you are to responding to and archiving all your emails, there will always be one thing preventing you from hitting true inbox zero: all of those mailing lists you're subscribed to. These horrors will visit you at all hours of the day, making it harder to spot the truly important messages in your inbox—and it gets worse once you've gotten fed up enough to disable push notifications and they start to really pile up. It’s time to banish these buggers. And, if you're using Gmail, there’s an easy way to do it.Use filters to manage mailing list emails in GmailYou can use a third-party add-on to go through your mailing lists and unsubscribe, saying goodbye to newsletters and e-blasts. But you know what’s easier and less expensive? Setting a filter in Gmail. Open up one of your mailing list emails and click the three dots in the menu bar. You’ll see “Mark as unread,” “Mark as important,” and a few other options, but the one you want is “Filter messages like these.”\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n\n    \n            \n            \n                                        Credit: Gmail\n                    \n    \nFrom there, you’ll see a dialog box asking how you want to filter your messages. You can filter by sender, recipients, and subjects, but also by anything that “has the words…” In the “has the words” row, type “unsubscribe.” \n            \n                What do you think so far?\n            \n        \nNow, any email containing the word “unsubscribe”—which reputable email blasts almost always do—can be filtered out of your inbox without you having to do anything. Once you type “unsubscribe” there, hit the “create filter” button. The following dialog box will ask how you want these filtered. You can choose to have them archived, marked as read, starred, forwarded, or immediately deleted.Things to consider when creating Gmail filtersI recommend archiving over deleting in case you ever want to find them again, but if you are sure you’ll never want to open another mailing list, newsletter, or sales blast, feel free to check the box next to “delete.” Note that if you choose to archive but later want to delete them, you’ll have to do so manually. Personally, I am happy to pay for extra Google storage to keep a record of messages instead of inadvertently lose something I need, but I know that's needlessly neurotic. If you do end up archiving those, the next step needs to be actually unsubscribing from the messages you truly don't want to receive. Gmail has recently made this a lot easier: You can usually click an unsubscribe button up at the top of the offending email. The Google-run email service also rolled out a Manage Subscriptions service this past summer, so once you take a gander at the archive full of junk and notice what you're not exactly needing or opening up, you can head over there and nuke your subscriptions quickly and easily. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Is the Easiest Way to Filter Junk Out of Your Gmail Inbox",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2GM9VNRCNAZ4S1G8DJ9VC5/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-24T13:00:00.000Z",
      "dateModified": "2025-12-24T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "My Favorite Amazon Deal of the Day: The Soundcore Sleep A20 Earbuds",
    "url": "https://lifehacker.com/tech/anker-soundcore-sleep-a20-sleep-earbuds-deal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JRTHEYAHMCVMN13EV39NJ3AG/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-23T18:30:09.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availab",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n            Deal pricing and availability subject to change after time of publication.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        I've used regular earbuds to help me sleep for a while now, but I never expected a company to actually make earbuds specifically for sleeping. Anker's Soundcore Sleep A20 are exactly that: earbuds designed to block out excess noise without pressing uncomfortably against your ear. I've been using them for a year and can't recommend them enough. Right now, these sleep earbuds are on sale for $107.99 (originally $179.99)—that is the lowest price they've been, according to price-tracking tools.\nThe Sleep A20 are not active noise-cancelling earbuds, which is how they're able to have such a small, unobtrusive form factor. Instead, they use the in-ear seal to create a natural noise blocker, which, in my opinion, works well enough to block out sounds. They fit quite comfortably and don't press against your ear when you sleep on your side. Very rarely do I wake up with one of them lost in the covers after falling off during the night, but it does happen occasionally (you can use the Find Device feature, which emits a loud sound through the earbuds). The battery life is 14 hours on sleep mode, which includes sounds from the Soundcore app (think white noise or relaxing sounds). If you have it in Bluetooth mode, where you can listen to Spotify or whatever else you want, the battery will last eight hours, but the charging case gives it a total life of up to 80 hours between plug-ins.\n            \n                What do you think so far?\n            \n        \nThe companion app is great, with many useful features for sleeping. You can turn your earbuds off after a set amount of time, have a sleep tracker that records your sleep data, a smart volume feature that increases or decreases in volume depending on the sound in your room, full EQ, and other features. \n            \n    \n    \n            Shop smarter, save more money\n                Get all the best deals and biggest sales curated by Daniel and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "My Favorite Amazon Deal of the Day: The Soundcore Sleep A20 Earbuds",
      "image": [
        "https://lifehacker.com/imagery/articles/01JRTHEYAHMCVMN13EV39NJ3AG/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-23T18:30:09.000Z",
      "dateModified": "2025-12-23T18:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
    "url": "https://lifehacker.com/tech/ghostpairing-attacks-are-taking-over-whatsapp-accounts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T18:30:06.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of C",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Melnikov Dmitriy / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you use WhatsApp, you may be targeted by scammers looking to take over your account by pairing their browser to your number. This scheme, dubbed GhostPairing by researchers, uses WhatsApp's device linking process to allow fraudsters to access all of your messages, impersonate you in chats, and perpetuate the scam to your contacts. Here's how threat actors are hijacking WhatsApp accounts—and how to defend yours. GhostPairing manipulates WhatsApp device linkingWhatsApp allows users to link their desktop or browser to their account without needing to enter login credentials in one of two ways: scanning a QR code and approving the session or confirming a numeric pairing code in the mobile app. While the GhostPairing scam could theoretically manipulate users in either approach, researchers found that the latter is much more common. The fraud begins with a short message sent from a contact with a link that purportedly goes to a Facebook photo or some type of Facebook content. If you click through, you'll be directed to a spoofed Facebook login page to enter your phone number—a familiar confirmation flow for Meta platforms. The next screen will likely show a numeric code with instructions to enter said code into WhatsApp to confirm the login (again, this may feel like a familiar two-step verification). If you're not paying attention, you may not realize that this didn't do anything on your end but instead registered the attacker's browser as a linked device to your account. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe danger in this scam is that everything will seem normal on your device and in your account, as attackers haven't hijacked your credentials to lock you out. However, they can do anything and everything in WhatsApp that you can, such as reading chats, receiving messages, viewing and downloading media, collecting information from your contacts, and forwarding the same phishing link. As they learn more about you and the people you know, they can potentially use that for ongoing scams. How to protect your WhatsApp accountAs always, be wary of links received via messaging platforms, even if they seem harmless or you think you know and can trust the sender. Threat actors frequently use social media and direct messaging to spread phishing lures. If you do click a link in WhatsApp (or any other communication), read all prompts carefully before providing or verifying any information to identify scams. \n            \n                What do you think so far?\n            \n        \nTo protect your WhatsApp account specifically, you can set up two-step verification, which will also prevent attackers from adding or changing a connected email address. Go to Settings > Account > Two-step verification > Turn on or Set up PIN and add an email address when prompted. You can also check to see if there are any suspicious devices paired with your account under Settings > Linked devices and remove any you don't recognize or regularly use.Finally, if you have been targeted by this scam, let your WhatsApp contacts know, as threat actors may spread the malicious link by making it look like it came from you. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'GhostPairing' Attacks Are Taking Over WhatsApp Accounts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDNG01324DJGEC5DZVSBVB38/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T18:30:06.000Z",
      "dateModified": "2025-12-29T18:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Do This Quick (and Quiet) Circuit Workout When You Need a Break From Holiday Family Gatherings",
    "url": "https://lifehacker.com/health/quick-circuit-workout-to-do-when-you-need-a-break-from-holiday-family-gatherings?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD5Z831X4F6E6HQPQA9K2K7Y/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-23T17:00:15.000Z",
    "description": "\n        \n        The holidays are for rest, relaxation, and eating your weight in cookies shaped like reindeer. Your fitness goals can absolutely wai",
    "body": "\n        \n        The holidays are for rest, relaxation, and eating your weight in cookies shaped like reindeer. Your fitness goals can absolutely wait until the new year. But if you find yourself trapped in a house where someone just said, \"well, actually\" for the third time in ten minutes, and you need to escape to your old bedroom before you say something you'll regret—here's a quick (and quiet) bodyweight circuit you can do surrounded by your high school participation trophies.These are my favorite beginner-friendly exercises to efficiently blow off some steam. Hopefully you have some floor space next to your twin bed. Tactical door-closed push-ups (10-15 reps)These are classic push-ups, but you're listening intently for footsteps. Is someone coming to ask why you fled the living room? This adds an element of anxious anticipation that really engages your core. Modify on your knees if needed.Spite squats (20 reps)Do some deep squats while internally composing the perfect rebuttal you'll never actually say. Feel the burn in your quads and your self-restraint. Make sure you're pushing your hips back until your thighs are parallel with the floor, looking to keep your knees bent at 90 degrees and in line with your toes. Bonus points if you can do these silently enough that no one downstairs hears the floorboards creaking. Frustration lunges (10 per leg)Lunge from your bed to your old dresser (the one still covered in stickers, right?). Consider each lunge as representing a point in the argument you're nobly choosing not to make. You're not avoiding conflict; you're being the bigger person. And getting stronger glutes! \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nRemember, when you lunge, keep your front knee over your ankle, not your toes. Keep your torso upright and your core engaged.Diplomatic plank hold (30-60 seconds)Hold a plank while contemplating how you've become the most emotionally mature person in your family. This is harder than it sounds, both physically and existentially. If you need to drop to your knees after 20 seconds, that's fine—you're still doing better than the conversation downstairs. My top tip for keeping your body in a straight line is to engage your glutes more than you might think. \n            \n                What do you think so far?\n            \n        \nPassive-aggressive mountain climbers (30 seconds)Quick, quiet mountain climbers that let you burn off steam without making enough noise to alert anyone that you've rage-quit the family gathering. Imagine you're running away from the discussion, but in place, silently, on your childhood floor. Peacekeeper glute bridges (15-20 reps)Lie on your back (hey, you're already thinking about taking a nap anyway), feet flat, and lift those hips. Each bridge is you rising above the drama. You're literally elevating yourself. Metaphorically and gluteally.Zen bicycle crunches (20 total)Finish with bicycle crunches while pretending you're pedaling away from this entire situation. Alternate elbow to opposite knee and find your center. Cool downSit on the edge of your too-small bed, breathing deeply, feeling virtuously exercised and only slightly guilty for abandoning your family. Check your phone. Consider going back downstairs. Hear a raised voice mention \"fake news\" or \"snowflake\" or whatever the discourse is today. Do another round.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Do This Quick (and Quiet) Circuit Workout When You Need a Break From Holiday Family Gatherings",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD5Z831X4F6E6HQPQA9K2K7Y/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-23T17:00:15.000Z",
      "dateModified": "2025-12-23T17:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How a Simple URL Typo Can Make You a Target for Malware",
    "url": "https://lifehacker.com/tech/parked-urls-malware-risk?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KCVZS3G7CF97KC6RNDHYE1SH/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-19T20:30:00.000Z",
    "description": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n      ",
    "body": "\n        \n    \n        Add as a preferred source on Google\n\n            Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            Parked domains are now serving up malicious content at an increased rate.\n                                            If you type a URL into your browser's address bar incorrectly, you may end up on a phishing site.\n                                            Check top- and second-level domains carefully before navigating to a website.\n                                    \n            \n    Table of Contents\n    \n        \n        Clicking through search results to a website comes with the risk of landing on a spoofed page that is actually a phishing scam, but so does navigating directly by typing a URL into your browser. As reported by Krebs on Security, researchers at security firm Infoblox have identified a swath of scams on lookalike and parked (or placeholder) domains. If you end up on one of these websites, you'll be directed not to the trusted page you're expecting but scam content, including scareware and other malware.  Lookalike domains contain malicious contentThis scam capitalizes on you navigating directly to a website by typing the URL into your browser's address bar. If you accidentally mistype either the top-level domain (TLD)—.gov or .com, for example—or the second-level domain (SLD), which is the company name (Google or Amazon), you could land on a page that has been commandeered by threat actors for malicious purposes. In some cases, these may be typosquats, meaning cybercriminals have registered domain names that look nearly identical to trusted ones. In others, they may be real domains that have expired and are simply advertising placeholders that spread malware. Infoblox researchers found that visiting one of these sites often initiates a chain of redirects, through which threat actors profile data like your IP geolocation, device fingerprint, and cookies. That means you don't necessarily need to click any links on the parked page to be served malicious content. They note, though, that parked websites were only malicious if visited from a residential IP address and benign if accessed using a VPN or a non-residential IP. \n            \n                What do you think so far?\n            \n        \nHow to avoid parked domain scamsOne common piece of advice for avoiding phishing websites is to type trusted URLs directly into the address bar rather than clicking through search, as threat actors will try to exploit results, including placing paid ads, to redirect you to malicious domains. This can still be a safe way to get to your destination, but you should check your spelling of both TLDs and SLDs carefully, as small errors could land you on a scam site. I've covered similar website trickery like homograph attacks, which use lookalike characters in URLs to direct you to phishing sites that, on the surface, appear to be legitimate domains. Unless you inspect the address very carefully, you may not catch the scam.\n            \n    \n    \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How a Simple URL Typo Can Make You a Target for Malware",
      "image": [
        "https://lifehacker.com/imagery/articles/01KCVZS3G7CF97KC6RNDHYE1SH/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-19T20:30:00.000Z",
      "dateModified": "2025-12-19T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Start Each Week With This Digital Decluttering Method",
    "url": "https://lifehacker.com/best-digital-decluttering-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-30T13:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Content",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Prathankarnpap - Shutterstock\n                            \n    Table of Contents\n    \n        \n        It’s well-established that physical clutter impairs your productivity and focus, going as far as to make you exhausted, stressed, and burnt out, which is why decluttering your workspace is key component in a lot of productivity techniques. In this day and age, though, your \"workspace\" isn't always (or, in some cases, even) an office or desk. Your phone and computer are your workspace. That's where you spend most of your work day looking and interacting—and when it's cluttered, you can feel discombobulated, the same as you might with a messy cubicle. It's time to stop thinking only about decluttering the physical world and make a better plan to keep the digital one in good shape. Take stock of your desktop, your tabs, your inbox, and your home screen: How many different windows do you have open right now? They are not only bogging down your mental energy, but your device’s energy, too. Let's fix that—and find a solution that sticks.When to declutter your devicesAim to start each week with a digital decluttering. It doesn’t have to take more than 15 minutes, but you’ll be more productive when it’s done, so it’s a good investment of your time. Approaches like this work best when you actively take the time to schedule them out, so fall back on time boxing and time blocking, and consider using a specialized to-do list system like 3-3-3, then designating the weekly decluttering one of Monday's three small tasks. How to digitally declutter (easily)On your desktop, create folders that can store whatever you need, whether those are documents for work or screenshots for your side business. Each Monday, go through whatever docs or pics have accumulated on the desktop and stick them in their respective folders so the whole thing looks cleaner. Do the same thing with any new apps you’ve put on your phone. There’s no reason to scroll through pages and pages of apps to find the one you need when you can stash it in a folder and keep your home screen organized. Only keep the necessary, daily-use folders available on your desktop and home screen. The rest should be banished somewhere invisible, but searchable.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nClose all open windows you’re not using—and all the tabs left over from your last browsing session. If you genuinely need something available, bookmark it. Get in the habit of closing tabs whenever you’re done with them. (Check for minimized browser windows, too; I always have at least two that need to be closed, but I rarely realize they're running in the background.)\n            \n                What do you think so far?\n            \n        \nNext up is email. I've recommended the “one-touch” method of inbox management before, and an adaptation of it works great here: Open every email you’ve gotten in the last week and either delete it or archive it, depending on whether you anticipate needing it later. Anything you archive, be sure to set aside time to respond to later in the day or week. (Again, time box and time block this, plus add it to your to-do list so it's a real, scheduled task, not just a good idea you may or may not get around to.)Perhaps most importantly, delete as you go. This is the the one I struggle with most, but once you get in the habit, it's easy. If you downloaded an app for a single purpose and don’t use it anymore, delete it. If you have docs in your files from an old class or work project, delete them. Stick to doing this for the first 15 minutes every Monday (or whenever you start your week) to dramatically reduce your digital clutter and any related stress. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Start Each Week With This Digital Decluttering Method",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H6ND61Y2JAHPTZQJM2DSW/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-30T13:00:00.000Z",
      "dateModified": "2025-12-30T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Punkt Has a New Smartphone for People Who Hate Smartphones",
    "url": "https://lifehacker.com/tech/punkt-mp03-privacy-focused-smartphone?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDZX68GV520JN3TEGYYMC0TA/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-01-02T20:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Punkt\n                            \n            \n                Key Takeaways\n ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Punkt\n                            \n            \n                Key Takeaways\n                                            Punkt just announced the MC03, the company's latest minimalist smartphone.\n                                            Unlike the MP01 and MP02, the MC03 actually looks like a smartphone, with a large display, selfie camera, and four rear cameras.\n                                            Unlike other smartphones, however, the MC03 runs the minimalist, privacy-focused OS, AphyOS.\n                                    \n            \n    Table of Contents\n    \n        \n        If you've ever looked into trading in your smartphone for a dumbphone, you might have stumbled across Punkt. The German-based company's MP01 and MP02 phone were purposely not \"smart;\" rather, they were minimalist slabs of plastic, sporting a tiny display and an array of large, physical buttons. The point of owning one of these Punkt devices isn't to sit scrolling on your smartphone for hours on end; it's to use your phone when you need to—privately, at that. The MC03 looks like any other smartphone at firstThe company's MC0 line flips the script a bit, and that doesn't change with the latest: MC03. While there's still a focus on privacy and minimalism, this newest device is virtually indistinguishable from other Android smartphones on the market—at least, in outward appearance. Gone are the physical buttons and tiny display; now, you have a large 120Hz OLED display, complete with a selfie camera at the top. Flip the MC03 around, and you'll find a set of four rear cameras, corralled in the top-left corner of the back. Aside from the large \"Punkt\" logo in the bottom right, this really could be any other phone.What separates the MC03 from phones from Samsung or Motorola is what's on the inside, including, namely, the OS. When you open the phone, you aren't greeted by a grid of app icons and widgets. Instead, you see a list of app and function names, without icons or colors. This is just about as simple an interface as you can expect from a device with a modern smartphone display, which may appeal to those who are looking for a minimalist experience.   That's because the MC03 isn't running Android. Like previous Punkt phones, this device runs AphyOS, an operating system built by Apostrophe. This custom OS is advertised as a privacy-focused operating system, something Punkt runs with for the MC03. According to the company, AphysOS can block tracking and profiling tools, and keeps out bloatware, hidden apps, and background services. The OS can also reportedly fight against spying with \"hardened code\" to block attacks. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nThe company says this new phone separates data and functions in two key \"repositories:\" First, there's the \"Vault,\" which includes Punkt-approved apps and that minimalist UI. Proton is a trusted company here, so you can expect to find Proton Mail, Proton Calendar, Proton Drive, Proton VPN, and Proton Pass in the Vault. Second, there's \"Wild Web,\" which lets you install any app you want, against a strict system of safeguards and privacy settings. You can choose to download apps from either Punkt's privacy-focused app store, featuring programs approved by both AphyOS and Punkt, as well as a store with \"widely available apps.\"\n            \n                What do you think so far?\n            \n        \nIn addition to that display, Punkt says the device comes with other hardware perks, like a 5,200mAh removable battery—a rarity with modern smartphone—IP68 water and dust resistance, and a 64MP camera.  Privacy isn't free on the MC03All those features come at a recurring cost, however. After one year, you'll need to pay for AphyOS, which charges $10 per month. You can also choose to subscribe for three years for $129 ($5.38 per month), or five years for $199 ($4.15 per month). The phone itself costs $699, which is relatively expensive for a phone of this caliber, so whether or not the privacy and minimalism perks are worth the price will really come down to the individual customer. (I'm a huge privacy advocate, but the MC03 would definitely need to impress me before I commit to a subscription model for its OS.) If you don't want a new phone, there are hacks to dumb down your existing device into something more minimal—and, of course, there are steps you can take to protect your privacy on any device.  The MC03 isn't available yet. Punkt announced the new phone ahead of CES next week, and says the new device will launch in North America this spring. Pre-orders are currently available in Europe.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Punkt Has a New Smartphone for People Who Hate Smartphones",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDZX68GV520JN3TEGYYMC0TA/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-01-02T20:30:00.000Z",
      "dateModified": "2026-01-02T20:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Petkit Just Announced Three New Smart Devices for Your Pets",
    "url": "https://lifehacker.com/tech/petkit-has-three-new-smart-devices-for-pets?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KDZNMKJYZ90G9AE0E9FJG7FC/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-01-02T16:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Petkit\n                            \n            \n                Key Takeaways\n",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Petkit\n                            \n            \n                Key Takeaways\n                                            Petkit just announced three new AI-powered pet tech devices ahead of CES.\n                                            The company is launching a smart litter box, water dispenser, and an automated feeder that works with wet food.\n                                            While many companies advertise their products as \"AI-powered,\" Petkit's new products may give users some useful health insights into their pets.\n                                    \n            \n    Table of Contents\n    \n        \n        Petkit just announced three new smart pet tech products ahead of CES. Despite the conference not kicking off until Tuesday, the company shared details around its upcoming devices that are likely to launch this spring. Perhaps unsurprisingly, Petkit advertises all three pet devices as \"AI-powered,\" and while that's been a go-to gimmick for companies since 2023, there are some unique applications here—assuming the devices actually do what Petkit says they do. Purobot Crystal Duo litterboxPetkit says the Purobot Crystal Duo is the first AI-powered open-top litter box, and that the Purobot uses the tech for health detection. This device has an 720p AI-powered camera that monitors your cat's stools as well as their behavior when visiting the litter box. The Purobot looks at things like stool consistency and urine pH, as well as \"vocalizations,\" and noting all in the Petkit app. You can take any of those findings to your vet if you have concerns. Petkit says the Purobot uses crystal litter to absorb urine and dehydrate waste to manage odors. The company claims users can wait 30 days before needing to scoop the contents of the litter box, which also comes with disposable trays. The company plans to launch Purobot in July, on both Amazon as well as Petkit's official site. Eversweet Ultra water dispenser Petkit's new water dispenser also uses an AI-powered camera to track health habits, only this time through your pet's \"hydration habits.\" The device ships with a 1080p camera with a 140-degree wide-angle view that tracks your pet as they drink, even in the dark. The Eversweet supports facial recognition for multiple pets, which, in theory, allows it to track the habits of specific pets drinking from the same device.The dispenser comes with a five-liter tank, which Petkit claims supports two full weeks of drinking water for one pet. The device detects when the water is low, and refills the bowl when needed, passing through a \"antibacterial filter cube\" to prevent bacterial growth. Any \"waste\" water is not recirculated through the dispenser, and is instead separated, so pets should always have fresh water while the reservoir is full.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nPetkit says the Eversweet Ultra may launch in April, though that's only an estimate. It, too, will be available on both Amazon, as well as Petkit's official site.  Perhaps Petkit's biggest announcement is the Yumshare Daily Feast, an automatic feeder that works with wet food. This feeder can portion out fresh food for cats and dogs on a custom schedule, while tracking your pet's eating habits to build \"eating insights.\" Those insights are partially informed by the feeder's built-in 1080p AI-powered camera, with a 140-degree wide-angle view. It also supports facial recognition for multiple pets.\n            \n                What do you think so far?\n            \n        \nPetkit says the Yumshare Daily Feast supports up to seven days of fully automated wet meals—the keyword being \"automated.\" The machine opens each food pack itself, and each portion is \"kept within its freshness window.\" That means if your pet doesn't finish its meal, the device will take away the leftovers, and uses ultraviolet light (specifically UVC) to sanitize before delivering the next portion.  Petkit estimates it will release the Yumshare Daily Feast in April, both on Amazon as well as Petkit's official website. As with any new products, we'll have to wait until reviewers can perform hands-on testing before deciding whether these devices can actually achieve what they claim to. However, if Petkit's products are up to snuff, they could offer pet owners some legitimate benefits. The wet feeder really could be great for anyone who needs to leave their cat for long periods of time. The Purobot and Eversweet could also provide some essential health insights ahead of a vet visit: If you're seeing reports that your cat is crying while using the litter box, or isn't drinking as much water as they usually do, you could get ahead of a health problem by notifying your vet early.   \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Petkit Just Announced Three New Smart Devices for Your Pets",
      "image": [
        "https://lifehacker.com/imagery/articles/01KDZNMKJYZ90G9AE0E9FJG7FC/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-01-02T16:30:00.000Z",
      "dateModified": "2026-01-02T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "To Achieve Inbox Zero, Declare 'Email Amnesty'",
    "url": "https://lifehacker.com/achieve-inbox-zero?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2H1TE5CDFG5XP5JJKKYNAW/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-29T14:00:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Joel Cunningham\n                            \n    Table of Contents\n    \n       ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Joel Cunningham\n                            \n    Table of Contents\n    \n        \n        The idea of declaring “email bankruptcy”—just deleting all the emails in your inbox past a certain date—is so popular, it has its own Wikipedia entry. I can see why it's tempting to just blow everything up and start over, and the temptation goes far beyond emails: Declaring a personal bankruptcy and mass-deleting games, movies, and e-books you fear you’ll never play, watch, or read is a practice with proponents far and wide (including some of us here at Lifehacker). But declaring bankruptcy is such a drastic step. What if you tried inbox amnesty instead?What is inbox amnesty?The idea for inbox amnesty comes from Lifehacker’s health editor, Beth Skwarecki, who advocates for achieving inbox zero by selecting all your emails and archiving them, instead of deleting them. “BOOM,” she says. “You have inbox zero and will do better in the future.”While there are tricks you can employ to manage your inbox in real time and keep the number of unread messages down (like the “one touch” rule), there will still be times when your inbox gets unruly. That doesn’t bother some people, but the ever-increasing number in the notifications badge makes others feel like they’re losing their minds. If that’s you, declare inbox amnesty and just start over. \n            Ready to do everything better?\n                Get daily tips, tricks, and tech guides from our expert team.\n            \n        \nPersonally, I don't much care what the red badge on my email app says. I have maintained the same primary email address since I was in high school and have designated numerous other addresses for various needs in my life. I gave up on the idea of \"inbox zero\" long, long ago. But I still get the compulsion to go bankrupt in other spheres. A bit over a year ago, I did a major cleaning and organizing overhaul in my apartment. I began by going scorched-earth, throwing things away right and left. I came to regret that quickly, as I tossed things I ended up needing, or at least could have sold or donated. Eventually, I designated two different closets as liminal spaces where I could let things marinate while I figured out what to do with them. That was my version of amnesty, and now, months later, I've freed up enough space and time to dedicate myself to my resale business, and I'm glad I didn't just go the bankruptcy route.\n            \n                What do you think so far?\n            \n        \nWhy inbox amnesty is better than inbox bankruptcyWhile inbox amnesty and bankruptcy both rely on the same idea—nuking all the emails and starting again, determined not to let the unreads get out of hand this time—there is one key difference: Amnesty doesn’t destroy the emails forever, it just marks them as read and tucks them away, out of sight. Just as I learned the value of keeping unwanted things around when I did my big apartment decluttering, you might learn it when you accidentally delete an email you need back in the future. Email amnesty helps you avoid learning the hard way.With amnesty, you can go back into that archive if you need to, finding contact information or threads that you might actually need to follow up on in the future. If you go bankrupt and destroy them all, you won’t be able to refer to anything from the past—and you just know something will come up that requires you to look at an older email you no longer have. You can set a reminder for yourself to fully delete your archived messages after six months if they don’t become necessary, but as long as they’re not clogging up too much of your storage, feel free to hold onto them in case of emergency. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "To Achieve Inbox Zero, Declare 'Email Amnesty'",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2H1TE5CDFG5XP5JJKKYNAW/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-29T14:00:00.000Z",
      "dateModified": "2025-12-29T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Hidden Spotify Feature Makes the Best Personalized Playlists",
    "url": "https://lifehacker.com/tech/use-this-hidden-spotify-feature-to-make-better-playlists?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD8K3F0CKHVYTTGY9NY1RK9G/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-24T17:00:47.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: Spotify\n                            \n    Table of Contents\n    \n        \n      ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: Spotify\n                            \n    Table of Contents\n    \n        \n        Spotify playlists are a surprisingly big part of my life. I make a handful of new, curated, choreographed ones for the spin classes I teach every week and otherwise meticulously maintain quarterly playlists designed to represent the overall vibe of specific, three-month periods in my life. I only edit those during the 12 weeks of the quarter, then leave them alone so I can revisit them and relive the era. This means I am constantly fiddling with the present playlist to make it just right, searching for songs that feel precisely aligned with however I'm feeling. It's actually a time-consuming hobby—but I stumbled across a feature the other day that has made creating spin playlists and soundtracking Q1 of 2026 easier than ever. The best way I can describe the feature I stumbled upon is that it's like Tinder for songs. If you're listening to a song within the app, scroll down. Go past the buttons for Play and Next, past the About the artist section, past the lyrics, and stop when you see Explore [artist name]. Then, you'll have three options like Similar to [artist name] and Similar to [song name], but these can differ slightly. Tapping one of those opens up the new feature. Say you choose Similar to [song name]. You'll be given 30 seconds of a song that Spotify's algorithm considers \"similar\" to the one you were just listening to, plus the artist's name, how many Spotify followers they have, and a three-dot menu that will let you add the song to your likes, add it to a playlist, go to the artist's page, and more. If you like the 30-second clip, you can add the song to your playlists. If not, you can keep swiping downward to hear a new one. \n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nSee how it's like Tinder? You make fairly snap decisions based on the quick preview and few details you get, then swipe away if you don't like it. I found a community forum post on Spotify's website about it, but otherwise, not much chatter. All I can tell is that it's been out since about May. Why I like the featureI prefer this to the other music-discovery options on Spotify because it gives you a quick preview of the song and makes the finding process simple. I am, of course, a big fan of the pre-generated Discover Weekly playlist or New Releases playlist Spotify makes for me every week, but it's time-consuming to listen to all the songs in them and it's not intuitive to find other new songs based on the finite playlists themselves. The 30-second quick hits and easy, swipeable dismissal of the new feature help me figure out if a song is worth my time, either for spin class or personal use, add it to the appropriate playlist if so, and keep moving. \n            \n                What do you think so far?\n            \n        \nWhat I especially like is the three hashtags under the artist's name. They are genre descriptions that match up with whatever song you're previewing and I've found them helpful because I have a hard time describing what kind of music I even like. Apparently, per the new feature, I like something called \"speed garage.\" Tapping the #speedgarage hashtag that appears in the song previews brings me to another scrollable preview pane full of, exclusively, more speed garage—whatever that actually is. I still can't define it, but I learned I like it, and that alone is more beneficial than a year's worth of Discover Weekly playlists. I used this feature during my Uber ride to the airport the other day and, by the time I was through TSA, I had 29 new songs in my Q1 playlist. I listened to them on the plane, weeded out ones that didn't match the quarterly vibe well enough, then sent it to my friends, who all gave the collection rave reviews like, and I quote, \"this slaps.\" \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Hidden Spotify Feature Makes the Best Personalized Playlists",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD8K3F0CKHVYTTGY9NY1RK9G/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-24T17:00:47.000Z",
      "dateModified": "2025-12-24T17:00:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use the ‘OHIO’ Method to Manage Your Endless Tasks and Messages",
    "url": "https://lifehacker.com/the-ohio-organization-method?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01HF2HBQCXQ2AHV8JFPE3D7CR6/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2025-12-29T13:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n            Credit: NicoElNino - Shutterstock\n                            \n    Table of Contents\n  ",
    "body": "\n    \n        Add as a preferred source on Google\n\n            Credit: NicoElNino - Shutterstock\n                            \n    Table of Contents\n    \n        \n        When you're wading through all the emails, Slack messages, and other notifications you get on an average day, it’s easy to get overwhelmed. When that happens, you can might yourself getting distracted and missing important messages—at least, that's what happens to me, unless I have some kind of plan in place.There are a few different approaches you can consider to prevent this, but the \"OHIO\" technique is the one to try if you need extra help being decisive—though it's important to note that while it can ease your decision paralysis, it does have a few limitations worth considering. What is the OHIO method of time management?OHIO is an acronym for “Only Handle It Once” and you'll hear it crop up in a variety of productivity-based conversations, like ones around tidying up. Proponents say it helps you avoid unnecessary dawdling, delays, and indecision, as it calls for you to handle any task, email, message, or assignment just one time. It's definitely a habit you need to build up to, but it's one that pays off the longer you work at it.\n            Never miss a tech story\n                Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \nYou can broadly apply it to what you’re working by assessing your entire inbox, to-do list, or other group of tasks all at once. Prioritize the tasks in order of importance using a system like the Eisenhower Matrix or ABC method. (If the workload isn’t too complex, feel free to prioritize them quickly on your own without a fancy system, but I'm a big fan of customizing hyper-specific productivity techniques to meet my needs.) Then take immediate action on each, starting from the top. Either delete them, delegate them, do what they say, or defer them, using the 4D method.\n            \n                What do you think so far?\n            \n        \nThe OHIO method works great for emails, too, but it can suck you into time-wasting if you’re not careful. Only handling each email once is a solid way not to spend too much time on it, but you have to plan what you’re going to do. Otherwise, you may end up clicking every new email that comes in and trying to manage it in real time.Emails are harder to prioritize than a to-do list, so you may struggle to determine which one you should jump on first. Instead of implementing the OHIO method in the moment every moment, set aside time every morning and afternoon to go through your messages and, of course, only handle them once. (You can use time boxing and time blocking to make sure you do this at the same time every day, plus a 3-3-3 to-do list to make sure you have time to prioritize the task.) Try a half hour at the start of your workday, a half hour after lunch, and 15 minutes just before clocking out. If you base your approach on time, rather than a prioritized list, you’ll still be able to open each message and handle it, but won’t be swamped by having to do that every time you get a new alert. \n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use the ‘OHIO’ Method to Manage Your Endless Tasks and Messages",
      "image": [
        "https://lifehacker.com/imagery/articles/01HF2HBQCXQ2AHV8JFPE3D7CR6/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2025-12-29T13:30:00.000Z",
      "dateModified": "2025-12-29T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Cordless Blower Is the Overlooked Tool You Definitely Need",
    "url": "https://lifehacker.com/home/cordless-blower-the-overlooked-tool-you-need?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KD3H333C5VWRBWQ4BCH5E62F/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2025-12-22T18:30:00.000Z",
    "description": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Amazon\n             ",
    "body": "\n    \n        Add as a preferred source on Google\n\n    We may earn a commission from links on this page.\n    \n            Credit: Amazon\n                            \n    Table of Contents\n    \n        \n        Once you start down the path of DIY, you'll soon realize that any time you find yourself wishing someone had created a tool to serve a specific purpose, someone probably has—no matter how narrow the use case. Case in point: The cordless blower/inflator.This tool is exactly what it sounds like. Shaped like a power drill, it simply...blows air (though sort of like a handheld leaf blower, these tools typically come with an array of nozzles to give you a bit of precision with the flow of your forced air). You might think this sounds like a tool you’ll never actually need, because you have lungs. But I'm here to convince you that you're wrong: A cordless blower will absolutely be one of the most useful tools you ever acquire.\nOne tool, many usesHandheld blowers have a lot of uses that make every DIY job you do a little bit easier and faster:\n            Never miss a story\n                Get the latest smart home news, trends, and advice from Lindsey and the team.\n            \n        \nCleaning. Probably the most common use case for a blower is to quickly clean a work area by blowing away dust, sawdust, clippings, shavings, and other small debris. You can use a blower to quickly clear off a workbench, blow dust out of keyboards, engines, or anywhere else. This is also really useful if you have a tight spot where you can’t fit a tool—the blower can clean it out in a jiffy. It’s also useful for a quick cleanup on outdoor furniture or even my deck—while you might want an actual leaf blower for full-scale yard cleanup, a handheld blower can do an adequate, quickie cleanup on demand.Shortening drying times. If you’re waiting on something to dry out before you can move on to the next stage of your project, a blower can speed up that drying time considerably.Cooling other tools down. There’s nothing more irritating than an overheating tool that forces you to stop and wait for it to return to a safe operating temperature. A blower can speed up that process, acting as a high-powered fan with a very precise, narrow blast of air to cool down hot components.Redirecting dust and debris. When working inside, you often want to use a vacuum to collect dust as you work, but outside, a small, handheld blower can be more convenient. Using it to redirect dust and debris away from you as you work can keep grit out of your eyes and your workspace clean as you go.Inflating stuff. These blowers come with attachments that not only allow you to be as narrow or wide with your airstream as needed, but also fit into standard nozzles. Need to inflate an air mattress, pool ball, or anything else? The blower will make short work of it.Once I started using a blower while I worked, I found myself reaching for it constantly just to keep my workspace clear of dust, and then I started grabbing it literally any time a blast of air seemed helpful. You might not think you need a blower in your tool chest, but you probably do.\n            \n                What do you think so far?\n            \n        \nChoosing a blowerMost cordless blowers are similar in terms of shape and function. The two from major brands you’ll come across most are Milwaukee’s M18 18V Brushless Cordless Precision Blower and Makita’s 18V LXT Brushless Cordless High Speed Blower/Inflator. They’re both solid tools, but I prefer the Makita because, in my experience, its battery life is much better (the Milwaukee has a bit more power, but I’ve never had a scenario where I needed more power). The Makita tends to last 45 minutes to an hour on a single charge, but when I borrowed a Milwaukee it died about a half hour into the job. Obviously, this will depend on a lot of variables, including what you’re using it for, but the Makita wins for me because every time I grabbed it there was enough charge left to finish the job.\n            \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Cordless Blower Is the Overlooked Tool You Definitely Need",
      "image": [
        "https://lifehacker.com/imagery/articles/01KD3H333C5VWRBWQ4BCH5E62F/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2025-12-22T18:30:00.000Z",
      "dateModified": "2025-12-22T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]