[
  {
    "title": "That Political 'Call to Action' Might Actually Be a Scam",
    "url": "https://lifehacker.com/tech/political-call-to-action-might-be-a-scam?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T19:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    No, SendGrid isn't adding a \"Support ICE\" link to your company's emails.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 6, 2026\n            \n            \n                        Credit: Ian Moore/Lifehacker/Adobe Stock\n                            \n    \n        \n        I'm just a humble immigrant, but as a mere (legal!) guest in the U.S., I can't help but notice that the country is rather, shall we say, politically divided these days (sorry if pointing that out seems rude). It seems international scammers have also noticed—and are taking advantage in subtle ways.Recently, investor Fred Benenson blogged about a sophisticated phishing campaign targeting SendGrid users. Phishers sent emails claiming the company was going to add a large \"Support ICE\" button at the bottom of every outgoing email unless users opted out. The emails also featured a large blue button promising to help you disable the message, which, when clicked, naturally led to a fake version of SendGrid that would allow the scammers to steal login information.As scams go, it's not a bad play: Phishing emails work best when they induce a sense of panic—that way you're less likely to think critically about them, and just act. It's not hard to imagine this particular email being effective, given the political climate right now. Say you're running a fair trade coffee company—you wouldn't want a giant \"Support ICE\" button below your signature at this moment in history.But the trick didn't just target left-wing organizations: Variations on the theme claimed the company was going to add pro-LGBT+ and Black Lives Matter banners as well. The differing political messages aren't really the point of the scam, you see—the point is to get business owners to panic about projecting the \"wrong\" values so that they will click the link and give away their login information. Scammers rely on psychological tricks to rope in their victims, all of them designed to get you to stop thinking rationally. Exploiting America's political divide seems to be an excellent way to do that.Political phishing schemes are nothing newThis is just the latest example of a scam that uses politics as a tool. Back in 2020, a fake Black Lives Matter voting campaign spread malware by pretending to be from a county official looking for feedback on the then-exploding political movement. People on both side of the partisan divide ended up clicking through and getting infected.And then there are the campaigns where people pretend to be politicians and beg for donations: Back in 2024 Lifehacker reported on a rash of political donation scams that popped up during the presidential election cycle. That trend is still growing, according to Stacey Wood, a fraud expert writing for Psychology Today. \"What is especially challenging for consumers and voters is that legitimate campaign operatives use many of the same common persuasion techniques employed by scammers,\" she writes.\n            \n                What do you think so far?\n            \n        \nAll of which is to say that international scammers have equal access to American media outlets, are aware of our political divides, and are effective at using them to exploit your emotions in order to steal your money.How to spot a political phishing scamWhat can you do to protect yourself? First, be aware of the tricks that scammers use, and always approach your email inbox with skepticism. Before you click any link from an unfamiliar sender or in an unsolicited email, hover over it to see if it's going to a website that looks legit. Even better: Avoid clicking links altogether, and head to the website for a given service directly by typing it into your browser.Remember, it's easier to fall for a scam than you think, so it pays to be skeptical, especially when you encounter a call to action designed to get you to react in a panic.\n            \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Justin Pot\n                                \n                                            Justin Pot is a freelance journalist who helps people get more out of technology.\n                                    \n                Read Justin's full bio\n                            \n        \n                \n                                            \n    More by Justin\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "That Political 'Call to Action' Might Actually Be a Scam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KG65AQZT1BGJW2MP7E11RTHY/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T19:00:00.000Z",
      "dateModified": "2026-02-06T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This New iOS 26 Feature Helps Eliminate Text Spam",
    "url": "https://lifehacker.com/tech/ios-26-screen-unknown-senders-feature?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH2K5S97KXYRF7TY347M8YKK/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-10T16:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 10, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Talukdar David/Shutterstock \n                            \n    Table of Contents\n    \n        \n        With iOS 26, Apple made it easier for users to reduce spam and overall clutter in their Messages inbox. Your iPhone will detect and hide spam messages, and with the Screen Unknown Senders feature, you can filter out texts from anyone you don't know. You can also disable push notifications for these conversations to reduce how often you're alerted for messages you don't need to see. Note that this feature works only on iOS, so if you have Messages synced on your Mac, you'll see everything and receive notifications for all messages unless you mute specific conversations. How to reduce clutter in Messages on iOSTo send messages from numbers you don't know to a separate folder, go to Settings > Apps > Messages and toggle on Screen Unknown Senders. You can also get here through the Messages app on your iPhone by tapping the three horizontal menu lines in the top-right corner and selecting Manage Filtering. Enabling Screen Unknown Senders will hide notifications and move messages to your Unknown Senders list. If you want to allow (or disallow) certain types of notifications, tap Allow Notifications and toggle categories on or off: \nTime Sensitive includes alerts, verification codes, and urgent requests. Personal includes messages identified as not sent by a business or organization. Transactions include order updates, receipts, and confirmations. Promotions include general offers and updates sent to multiple recipients. Most users will want to enable time-sensitive notifications to receive messages that include time-based one-time passwords (TOTPs) and other urgent alerts. You may also want to allow personal notifications so you don't miss messages directed to you individually from real people who aren't saved in your contacts.  \n            \n                What do you think so far?\n            \n        \nWhen you allow notifications, texts identified in those categories will appear in your Messages list for only 12 hours before being moved to Unknown Senders—a behavior that keeps your primary inbox streamlined. If you want to make an unknown sender a known sender to prevent future messages from being filtered out, open the conversation and tap Mark as Known at the bottom or add the number to your contacts. A known sender is anyone you've added to your Contacts, sent a message to, or marked as known in the conversation. Finally, if you enable Filter Spam under the same menu in your device settings, Apple will send messages identified as spam to a separate Spam list and hide notifications. You can view these and conversations from unknown senders at any time via Messages > Menu. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This New iOS 26 Feature Helps Eliminate Text Spam",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH2K5S97KXYRF7TY347M8YKK/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-10T16:00:00.000Z",
      "dateModified": "2026-02-10T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Dark Side of the Modern Male Body ‘Ideal’",
    "url": "https://lifehacker.com/health/the-dark-side-of-modern-male-body-ideal?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH1N9PACBBK9DHT2281X8KVN/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-09T18:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Bro-speak makes dangerous behaviors sound like virtues.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Meredith Dietz\n                            \n        \n            Meredith Dietz\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceMeredith is a marathon runner and stand-up comedian. As Lifehacker’s Senior Staff Writer, she covers personal fitness tech, home gym equipment, and more.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 9, 2026\n            \n            \n                        Credit: René Ramos/Lifehacker Composite/Adobe Stock\n                            \n    \n        \n        When I asked real people why they post their workouts online, I received well over a hundred replies, many of them filled with venting about body image issues and unattainable beauty standards. That's didn't surprise me. What did surprise me was that the majority of these responses came from men. Carefully measured chicken and rice, obsessive tracking of macros, the guilt when a workout is missed: On social media, these behaviors are framed in the language of performance and strength. The same rituals that would be clear indications of disordered behavior for women are redefined as “discipline” and “optimization” for men. How many men suffer in silence because eating disorders are coded as a women's issue? How many cases go unrecognized when they're framed as \"clean eating\" or \"serious training\"? When eating disorders and body dysmorphia get rebranded as \"fitness goals,\" a lot of men are left struggling in plain sight. Men can have eating disorders, tooBoys and men now make up about a third of those diagnosed with eating disorders, and that figure likely understates the crisis. In particular, muscle dysmorphia—sometimes called \"bigorexia\"—is characterized by excessive and compulsive exercise, a persistent belief that one is insufficiently muscular, and an obsession with muscle mass, size, and leanness. Unfortunately, much of fitness culture allows men to engage in disordered behaviors by wrapping them in performance language. \"Bulking\" and \"shredding\" cycles can mask seriously problematic eating patterns. Without giving certain men in my life an armchair diagnosis, I can confidently say I’ve seen the mental fallout when someone’s extreme caloric restriction becomes \"cutting\" or compulsive exercise becomes \"staying on track.\"Unsurprisingly, social media amplifies these harmful messages. Mason Boudrye, who describes himself as \"someone known to post gratuitous thirst traps,\" shared with me the mental fallout of always trying to look a certain way. “Even if people don't admit that the obsessive tracking and strict adherence to diet qualifies as disordered eating, I know it’s true for me,” he says. The social media of it all makes these feelings even more public and persistent. We all scroll through feeds of chemically enhanced physiques presented as natural and achievable. This naturally breeds more self-scrutiny, more comparison, more perceived inadequacy. Matthew Singer, a yoga teacher, says most “fitspo” (fitness inspiration) “is as helpful for fitness as previous winning lottery numbers are for winning millions. Fitspo cannot take into account genetics, job and family circumstances, health history, or any of the other countless factors that influence health outcomes.\" Our bodies are treated like projects always in need of correction, devoid of much-needed context.What’s most troubling to me is the way men don’t get to call out disordered behaviors by name. There is both a misconception around who eating disorders affect, and a deep reluctance among affected men to seek help for a problem they've been socialized to handle alone. Society has constructed a masculine ideal that equates vulnerability with weakness, making it nearly impossible for some men to admit they're struggling with their relationship to food and their bodies.Unattainable beauty standards stay unattainableBotox injections in men may get called “Brotox,\" but a cheeky nickname shouldn't shroud the fact that unattainable beauty standards are leading men to take more extreme measures. Dr. Claudia Kim of New Look New Life Cosmetic Surgery says she's seen a rise in men turning to beauty treatments: jawline contouring, under-eye correction, hair restoration, skin rejuvenation.  “These approaches offer noticeable yet discreet results with little downtime,” says Kim, fitting neatly into lives that were never supposed to include these concerns.\n            \n                What do you think so far?\n            \n        \nWhat's telling, Kim adds, is that her male patients are usually entering the aesthetic realm for the first time. In this sense, men are catching up to beauty  regimens women have been undertaking for generations, and slowly learning what women have long understood: Namely, that appearance affects professional success, social capital, and romantic prospects—and the goalposts are always moving. At the same time, the masculine ideal demands stoic self-sufficiency, even as it requires costly and constant aesthetic labor. What does all this mean for the average person with an average budget? The treatments Kim describes—jawline contouring, hair restoration, aesthetic procedures—aren't cheap. Nor are supplements, meal prep services, personal trainers, specialized equipment, and so on. Beauty standards increasingly require you to spend more money, meaning your appearance is yet another health arena where class determines outcomes. And if they can’t afford to look the way they feel pressured to look, men are uniquely left behind to suffer in silence.As a woman, I’ve spent most of my life jealous of how men were allowed to age, or gain weight, or simply be in their bodies without constant intervention. Now I have a more sympathetic gaze, especially after hearing so many men admit they were never given the language to articulate aesthetic concerns without shame.The bottom lineThere’s a big difference between healthy self-care and the sense that your body is never good enough. Meticulously tracking every calorie, every rep, every perceived flaw—why should one woman’s obvious eating disorder be another man’s enviable achievement? Women have been battling body image issues and unattainable beauty standards since birth, but a lot of men were never taught how to fight this particular war. To me, the takeaway is that we all need to be on the same side. To fight this war, we need a more honest conversation about what we're doing to men's relationships with their bodies. Until we acknowledge that, all this talk of \"cutting\" and \"discipline\" will allow dangerous behaviors to keep hiding in plain sight.\n            \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Meredith Dietz\n                                    Senior Staff Writer\n                                \n                                            Covering personal fitness tech, home gym equipment, and more.\n                                    \n                Read Meredith's full bio\n                            \n        \n                \n                                            \n    More by Meredith\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Dark Side of the Modern Male Body ‘Ideal’",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH1N9PACBBK9DHT2281X8KVN/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-09T18:00:00.000Z",
      "dateModified": "2026-02-09T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI Chatbots Are Even Worse at Giving Medical Advice Than We Thought",
    "url": "https://lifehacker.com/health/ai-chatbots-are-even-worse-at-medical-advice-than-we-thought?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH4VNDPMV1RN3JEVQ4YTSPXQ/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T15:00:00.000Z",
    "description": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n            ",
    "body": "\n    \n        \n            \n                \n            \n        \n    \n            \n                                                    \n                    Even when they have the “right” information, they can lead you astray.\n            \n                        \n    \n                    \n        \n        \n        \n    \n                                Beth Skwarecki\n                            \n        \n            Beth Skwarecki\n                \n                                            Senior Health Editor\n                                    \n            \n            \n        \n            ExperienceBeth Skwarecki is Lifehacker’s Senior Health Editor, and holds certifications as a personal trainer and weightlifting coach. She has been writing about health for over 10 years.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                            \n        \n        \n        February 12, 2026\n            \n            \n                        Credit: Jeffrey Hazelwood/Lifehacker/Getty Images\n                            \n    \n        \n        It’s tempting to think that an LLM chatbot can answer any question you pose it, including those about your health. After all, chatbots have been trained on plenty of medical information, and can regurgitate it if given the right prompts. But that doesn’t mean they will give you accurate medical advice, and a new study shows how easily AI’s supposed expertise breaks down. In short, they are even worse at it than I thought.In the study, researchers first quizzed several chatbots about medical information. In these carefully conducted tests, ChatGPT-4o, Llama 3, and Command R+ correctly diagnosed medical scenarios an impressive 94% of the time—though they were able to recommend the right treatment a much less impressive 56% of the time. But that wasn’t a real-world test for the chatbots medical utility. The researchers then gave medical scenarios to 1,298 people, and asked them to use an LLM to figure out what might be going on in that scenario, plus what they should do about it (for example, whether they should call an ambulance, follow up with their doctor when convenient, or take care of the issue on their own). The participants were recruited through an online platform that reported it verifies that research subjects are real humans and not bots themselves. Some participants were in a control group that was told to research the scenario on their own, and not using any AI tools. In the end, the no-AI control group did far better than the LLM-using group in correctly identifying medical conditions, including most serious “red flag” scenarios. How a chatbot with “correct” information can lead people astrayAs the researchers write, “Strong performance from the LLMs operating alone is not sufficient for strong performance with users.” Plenty of previous research has shown that chatbot output is sensitive to the exact phrasing people use when asking questions, and that chatbots seem to prioritize pleasing a user over giving correct information. Even if an LLM bot can correctly answer an objectively phrased question, that doesn’t mean it will give you good advice when you need it. That’s why it doesn’t really matter that ChatGPT can “pass” a modified medical licensing exam—success at answering formulaic multiple choice questions is not the same thing as telling you when you need to go to the hospital.  The researchers analyzed chat logs to figure out where things broke down. Here are some of the issues they identified:The users didn’t always give the bot all of the relevant information. As non-experts, the users certainly didn’t know what was most important to include. If you’ve been to a doctor about anything potentially serious, you know they’ll pepper you with questions to be sure you aren’t leaving out something important. The bots don’t necessarily do that. The bots “generated several types of misleading and incorrect information.” Sometimes they ignored important details to narrow in on something else; sometimes they recommended calling an emergency number but gave the wrong one (such as an Australian emergency number for U.K. users).Responses could be drastically different for similar prompts. In one example, two users gave nearly identical messages about a subarachnoid hemorrhage. One response told the user to seek emergency care; the other said to lie down in a dark room. People varied in how they conversed with the chatbot. For example, some asked specific questions to constrain the bot’s answers, but some let the bot take the lead. Either method could introduce unreliability into the LLM's output.Correct answers were often grouped with incorrect answers. On average, each LLM gave 2.21 answers for the user to choose from. People understandably did not always choose correctly from those options. Overall, people who didn't use LLMs were 1.76 times more likely to get the right diagnosis. (Both groups were similarly likely to figure out the right course of action, but that's not saying much—on average, they only got it right about 43% of the time.) The researchers described the control group as doing \"significantly better\" at the task. And this may represent a best-case scenario: the researchers point out that they provided clear examples of common conditions, and LLMs would likely do worse with rare conditions or more complicated medical scenarios. They conclude: “Despite strong performance from the LLMs alone, both on existing benchmarks and on our scenarios, medical expertise was insufficient for effective patient care.”\n            \n                What do you think so far?\n            \n        \nChatbots are a risk for doctors, tooPatients may not know how to talk to an LLM, or how to vet its output, but surely doctors would fare better, right? Unfortunately, people in the medical field are also using AI chatbots for medical information in ways that create risks to patient care. ECRI, a medical safety nonprofit, put the misuse of AI chatbots in the number one spot on its list of health technology hazards of 2026. While the AI hype machine is trying to convince you to give ChatGPT your medical information, ECRI correctly points out that it’s wrong to think of these chatbots as having human personalities or cognition: “While these models produce humanlike responses, they do so by predicting the next word based on large datasets, not through genuine comprehension of the information.”ECRI reports that physicians are, in fact, using generative AI tools for patient care, and that research has already shown the serious risks involved. Using LLMs does not improve doctors’ clinical reasoning. LLMs will elaborate confidently on incorrect details included in prompts. Google’s Med-Gemini model, created for medical use, made up a nonexistent body part whose name was a mashup of two unrelated real body parts; Google told a Verge reporter that the mistake was a “typo.”  ECRI argues that “because LLM responses often sound authoritative, the risk exists that clinicians may subconsciously factor AI-generated suggestions into their judgments without critical review.”Even in situations that don’t seem like life-and-death cases, consulting a chatbot can cause harm. ECRI asked four LLMs to recommend brands of gel that could be used with a certain ultrasound device on a patient with an indwelling catheter near the area being scanned. It’s important to use a sterile gel in this situation, because of the risk of infection. Only one of the four chatbots identified this issue and made appropriate suggestions; the others just recommended regular ultrasound gels. In other cases, ECRI’s tests resulted in chatbots giving unsafe advice on electrode placement and isolation gowns. Clearly, LLM chatbots are not ready to be trusted to keep people safe when seeking medical care, whether you’re the person who needs care, the doctor treating them, or even the staffer ordering supplies. But the services are already out there, being widely used and aggressively promoted. (Their makers are even fighting in the Super Bowl ads.) There’s no good way to be sure these chatbots aren’t involved in your care, but at the very least we can stick with good old Dr. Google—just make sure to disable AI-powered search results. \n            \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n                        \n                \n            \n                    \n                                            \n                \n            \n                Beth Skwarecki\n                                    Senior Health Editor\n                                \n                                            Covering health, fitness tech, home gym equipment, and more.\n                                    \n                Read Beth's full bio\n                            \n        \n                \n                                            \n    More by Beth\n        \n        \n                        \n                \n                    \n                \n            \n        \n                    \n                \n                    \n                \n            \n        \n                                        \n            \n                                    \n                                            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI Chatbots Are Even Worse at Giving Medical Advice Than We Thought",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH4VNDPMV1RN3JEVQ4YTSPXQ/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T15:00:00.000Z",
      "dateModified": "2026-02-12T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Claim Your Payout From the 23andMe Data Breach Before It's Too Late",
    "url": "https://lifehacker.com/tech/23andme-data-breach-payout?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01JV5C7A284BR4Q698FBBHS8JJ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T14:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Jennie Book/Shutterstock\n                            \n            \n                Key Takeaways\n                                            If you were affected by 23andMe's data breach, you have just a few more days to claim your compensation.\n                                            \"Extraordinary\" claims may qualify for up to a $10,000 payout.\n                                            Claims can be filed online via the settlement website, or you can mail a hard copy of your claim form (postmarked by Feb. 17) to the address listed.\n                                    \n            \n    Table of Contents\n    \n        \n        If you were affected by 23andMe's data breach—which involved the information of approximately 6.4 million U.S. residents—you have just a few more days to claim your compensation. Following the 2023 credential-stuffing attack, 23AndMe in 2024 agreed to a $30–$50 million payout for impacted consumers. The genetic testing company then filed for Chapter 11 bankruptcy in 2025 (introducing new privacy concerns around the potential sale of customer data).  The courts approved the deal last month, and class members have until Feb. 17 to submit claims related to the cyber incident. How much you'll receive from the 23andMe settlementThere are several tiers of payouts with the 23andMe settlement. Users with an \"extraordinary claim\"—those who experienced identity theft or fraudulent tax filings as a result of the breach—could qualify for up to $10,000 to reimburse verified expenses, including costs for physical or cyber security systems as well as mental health treatment. Claimants who received notices that certain health information was leaked in the breach will be paid up to $165. Eligible data include raw genotype data, health reports (including health predisposition reports, wellness reports, and carrier status reports), and self-reported health conditions. Individuals residing in Alaska, California, Illinois, and Oregon will receive an additional $100 thanks to state privacy laws. Note that payments will likely take time to be distributed. \nThe settlement also provides for five years of identity monitoring services through a customized program called Privacy & Medical Shield + Genetic Monitoring. This is available to all class members regardless of payout.  \n            \n                What do you think so far?\n            \n        \nHow to file a 23andMe claimConsumers who were impacted by the 2023 data breach can file a Cyber Security Incident Claim, which must be submitted by Feb. 17, 2026 (unless you received a notice in 2026 indicating otherwise). To be eligible, you must have been a 23andMe customer between May 1, 2023 and October 1, 2023 and have received a notice (via letter or email) that your information was compromised in the breach. You also must attest that you incurred damages (monetary or non-monetary) as a result of the incident. Claims can be filed online via the settlement website, or you can mail a hard copy of your claim form (postmarked by Feb. 17) to the address listed. To complete a claim, you must provide some personal information as well as details about the harm incurred with supporting documentation, such as bank or credit card statements substantiating losses. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Claim Your Payout From the 23andMe Data Breach Before It's Too Late",
      "image": [
        "https://lifehacker.com/imagery/articles/01JV5C7A284BR4Q698FBBHS8JJ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T14:30:00.000Z",
      "dateModified": "2026-02-11T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
    "url": "https://lifehacker.com/tech/aggressive-spyware-targeting-android-ios-devices?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-11T19:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Credit: Zooey Liao/Lifehacker/Getty Images\n                            \n            \n                Key Takeaways\n                                            A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates.\n                                            Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft.\n                                            ZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed.\n                                    \n            \n    Table of Contents\n    \n        \n        Threat actors don't have to work that hard to obtain sophisticated malware to deploy against unsuspecting targets. A new spyware platform known as ZeroDayRAT is reportedly being sold on Telegram, complete with customer support and updates. According to mobile security company iVerify, this aggressive spyware grants full remote control over devices running Android 15 through 16 and iOS versions up to iOS 26. Once deployed, it allows everything from user profiling and location tracking to live surveillance and financial theft. What ZeroDayRAT can gather from your deviceThis spyware has wide-ranging capabilities that, according to iVerify, have traditionally been found on platforms sponsored by state actors. Here's a look at what ZeroDayRAT can do: \nCollect information about the device, such as model, OS, battery, country, lock status, SIM and carrier info, app usage, live activity, and SMS message previews. This allows threat actors to develop user profiles for further targeting.Pull GPS coordinates, capture notifications from apps and systems, and harvest account information, such as usernames and emails. Send SMS messages and receive verification codes to bypass two-factor authentication. Log keystrokes (including biometric unlocks, gestures, and app launches), access the camera and microphone, and screen record.  Log crypto wallet addresses and target banking and payment app credentials via overlay attacks. How to protect against spywareZeroDayRAT can infect your device only if a malicious binary—an APK on Android or iOS payload—is downloaded and installed. These may be distributed through phishing, such as links sent via emails, texts, or messaging platforms, as well as in fake app stores. \n            \n                What do you think so far?\n            \n        \nAll standard guidance for avoiding scams and malware applies: never click links in unsolicited communication, including conversations in apps like Telegram and WhatsApp, and only download apps and extensions from official, trusted sources. Users at high risk of being targeted and anyone who wants an extra layer of security can consider enabling Lockdown Mode (iOS) or Advanced Protection (Android). \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Aggressive Spyware Is Targeting Both Android and iOS Devices",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH6WXXANC515RHZS40RVFH01/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-11T19:00:00.000Z",
      "dateModified": "2026-02-11T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube Finally Released an App for the Apple Vision Pro",
    "url": "https://lifehacker.com/tech/youtube-app-for-apple-vision-pro?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-12T21:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                  ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Stephen Johnson\n                            \n        \n            Stephen Johnson\n                \n                                            Senior Staff Writer\n                                    \n            \n            \n        \n            ExperienceStephen Johnson is a senior staff writer at Lifehacker covering pop culture and technology, including the columns “The Out-of-Touch Adults’ Guide to Kid Culture” and “What People Are Getting Wrong This Week.”\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 12, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: YouTube\n                            \n            \n                Key Takeaways\n                                            A YouTube app is now available for Apple Vision Pro.\n                                            Users can stream every video on YouTube, even 8K video.\n                                            The standalone YouTube app was designed with Vision's spatial computing in mind.\n                                    \n            \n    Table of Contents\n    \n        \n        YouTube has finally come to Apple Vision Pro. YouTube for Vision OS is a free, standalone app that lets users log into their existing YouTube accounts through their Vision headsets and stream videos like they would expect to, including standard videos, 180° videos, 360° videos, and YouTube Shorts. Vision Pro M5 users can stream 8K videos, and premium YouTube members can download videos directly to their headsets, a must for long flights.  Google, YouTube's parent company, has apparently been working on the app for a while. In 2024, a spokesperson confirmed that a standalone Vision Pro app was \"on our roadmap,\" but until today, the only way Vision users could watch YouTube on their headsets was through the Safari web browser. The new YouTube app is designed to fit into Vision's spatial computing environments. \"Rather than just responding to different screen sizes, we needed something that responds to different spaces, volumes and use cases,\" YouTube's senior UX designer Brendan Polley told Apple. \"We built an entirely new design system that isolated core elements—comments, the play button, 'like' and 'dislike'—to fit any layout.\"\n            \n                What do you think so far?\n            \n        \nHaving downloaded the app, it works exactly as intended. If you're looking for something that demonstrates Vision Pro's immersive video capabilities, you should check out the just-released 360° videos from the Milano Cortina winter Olympics on NBC's channel. Immersive luge is terrifying! \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube Finally Released an App for the Apple Vision Pro",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH9SVASV7VEXA78TP418XENK/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-12T21:30:00.000Z",
      "dateModified": "2026-02-12T21:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bluesky Finally Has Drafts",
    "url": "https://lifehacker.com/tech/bluesky-finally-has-drafts?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH44A7CD186WD3C961XGVYVQ/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-10T18:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Michelle Ehrhardt\n                            \n        \n            Michelle Ehrhardt\n                \n                                            Associate Tech Editor\n                                    \n            \n            \n        \n            ExperienceMichelle is Lifehacker's Associate Tech Editor, and has been reviewing games, laptops, phones, and more for over 10 years. She is based in New York City and holds a master's degree from NYU.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 10, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Bluesky\n                            \n            \n                Key Takeaways\n                                            Drafts are now rolling out in Bluesky.\n                                            Drafts work with singular posts and pre-written threads.\n                                            Other commonly requested features include an edit button, but you'll need to rely on third-party tools for that.\n                                    \n            \n    Table of Contents\n    \n        \n        I'm one of those folks who has completely moved from X to Bluesky, and for the most part, it's been a pretty seamless experience. It's not hard to move your following list over; you can upload (almost) all of your old tweets if you want; and the scrolling and posting experience is almost identical to what you'll remember from the old days of Twitter. The only feature I've missed? Drafts.Finally, drafts have arrived. In a post to the official Bluesky account, the company announced that it's added drafts to the platform, and that they're rolling out now. To create a draft, just start writing a post, and instead of tapping the Post button, hit Cancel or Drafts instead and choose Save draft. What you've written will be saved as a draft that you can return to later. The feature works for pre-written threads, too (made using the + button on the post screen). To see your saved drafts, open a blank post and hit Drafts before typing anything else. You'll see a list of your stored drafts, and you can either tap on a draft to open it, or hit the three-dots button to the right of the drift and then Discard to delete it.Drafts were a big part of Twitter for me—not just because they helped save posts if my connection dropped in the middle of writing them, but because they also gave me some time to consider if I really wanted to post something before taking it live. It's a handy feature for a platform with such a small character limit, where it might be easy to toss a stray thought out into the ether without really knowing how it might land or if you've expressed yourself as well as you could have. \nI'm not alone, here: A common trend on Twitter was posting screenshots of draft libraries, to give your followers a peak at the half-formed ideas you didn't think were quite ready for prime time. It's a bit of culture I've missed in moving over to the new site, and I'm glad it's now possible once agin.\n            \n                What do you think so far?\n            \n        \nAs for where Bluesky could go next, responses to the drafts announcement include requests for more robust DMs or an edit button, although Bluesky staffers have expressed both logistical and ethical concerns with implementing these. In the meantime, there are third-party tools that try to add some of this functionality, but they do come with wonky formatting that an official solution could probably avoid.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bluesky Finally Has Drafts",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH44A7CD186WD3C961XGVYVQ/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-10T18:00:00.000Z",
      "dateModified": "2026-02-10T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
    "url": "https://lifehacker.com/tech/microsofts-february-patch-tuesday-update?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-11T17:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 11, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Daniel Chetroni / Shutterstock.com\n                            \n            \n                Key Takeaways\n                                            The latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws.\n                                            Three of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities.\n                                            Machines receive updates automatically, but you can check your settings to be sure.\n                                    \n            \n    Table of Contents\n    \n        \n        Microsoft's February security update is a big one. This latest \"Patch Tuesday\" fixes 58 vulnerabilities in total, six of which are zero-day flaws. As a reminder, a zero-day is a vulnerability that has been either actively exploited in the wild or publicly disclosed before an official fix is released by the developer. As BleepingComputer reports, security flaws were found in the following categories: 25 elevation-of-privilege vulnerabilities, five security feature bypass vulnerabilities, 12 remote code-execution vulnerabilities, six information disclosure vulnerabilities, three denial of service vulnerabilities, and seven spoofing vulnerabilities. Three of the elevation of privilege vulnerabilities and two of the information disclosure vulnerabilities are considered \"critical.\" (These numbers do not include the three Microsoft Edge vulnerabilities patched earlier in February.)Patch Tuesday updates are typically released around 10 am PT on the second Tuesday of every month, and your device should receive them automatically. BleepingComputer reports that this month's release also includes Secure Boot certificate updates for 2011 certificates that are expiring in June. \nSix zero-days patched in FebruaryThree of the six actively exploited zero-days fixed in February are security feature bypass vulnerabilities: CVE-2026-21510: This is a flaw the Windows Shell that allows an attacker to execute content without warning or gaining user consent, though the user does need to open a malicious link or shortcut file. CVE-2026-21513: This MSHTML Framework vulnerability allows an unauthorized attacker to bypass a security feature over a network. Microsoft has not released details on how this flaw was exploited. CVE-2026-21514: This vulnerability in Microsoft Word allows an attacker to bypasses OLE mitigations in Microsoft 365 and Microsoft Office once a user has opened a malicious Office file. All three of the above flaws have been attributed to Microsoft Threat Intelligence Center (MSTIC), Microsoft Security Response Center (MSRC), Office Product Group Security Team, and Google Threat Intelligence Group along with an anonymous researcher for CVE-2026-21510 and CVE-2026-21514.\n            \n                What do you think so far?\n            \n        \nTwo of the zero-days are elevation of privilege vulnerabilities. CVE-2026-21519 is a Desktop Windows Manager flaw that allows an attacker to gain SYSTEM privileges, while CVE-2026-21533 is a Windows Remote Desktop Services flaw that allows an attacker to elevate privileges locally. The former has been attributed to MSTIC and MSRC, while the latter was discovered by the Advanced Research Team at CrowdStrike.Finally, CVE-2026-21525 is a denial of service vulnerability in the Windows Remote Access Connection Manager that allows an unauthorized attacker to deny service locally. This flaw was discovered by the ACROS Security team with 0patch—it was reportedly found in a public malware repository in December 2025. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's February Patch Tuesday Update Fixes Six Zero-Day Exploits",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH5ESZQAD4AGMV8N9G6S3Y5P/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-11T17:00:00.000Z",
      "dateModified": "2026-02-11T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp's Web App Is Getting a Huge Upgrade",
    "url": "https://lifehacker.com/tech/whatsapps-web-app-audio-video-calling?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH4GKF97FEFMJAZ2RWTSK25W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-10T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 10, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Hengki Tj/Shutterstock\n                            \n            \n                Key Takeaways\n                                            WhatsApp is finally rolling out audio and video calls for its web app.\n                                            The option is launching in beta for individual chats, but will roll out to all users soon.\n                                            You can try it now by enrolling in the WhatsApp web app beta.\n                                            WhatsApp is also working on group chat calling in the web app, but this is not yet available in beta.\n                                    \n            \n    Table of Contents\n    \n        \n        While there are a lot of chat apps out there, WhatsApp is the undeniable leader of the pack. The app has over three billion monthly active users, constantly messaging and calling one another across the globe. However, currently those calls are all happening over the mobile app, or maybe the desktop app. Though WhatsApp does have a web app, the service has never supported audio or video calls outside of its downloadable apps—until now. You can now make calls from the WhatsApp web appAccording to WABetaInfo, WhatsApp is slowly rolling out audio and video calls to its web app. At launch, the functionality is coming to individual chats with users who elect to enroll in the WhatsApp web app's beta, but the company plans to roll out the feature to all web app users over the coming weeks.WABetaInfo notes that voice and audio calls work about the same as they do in the WhatsApp desktop app. When you open an individual chat in the web app, you'll now see a video call icon at the top. Click this, and you'll find two options: one to place a voice call, and one to place a video call. These calls are still end-to-end encrypted, as they are on WhatsApp's desktop and mobile apps, meaning only the users who are a part of the calls can hear what's being said. In addition, the web app's video call client supports Screen Share, so you can share a live stream of your computer's screen to another WhatsApp contact. \nWhatsApp is also reportedly working on group chat calls for web app users, as well. While that feature won't roll out alongside individual calls, when it does launch, you'll be able to join group chats with up to 32 people. If you tend to use the WhatsApp desktop or mobile apps, this might not seem like huge news—but it is pretty substantial for a few subsets of WhatsApp users. One, of course, is the user base that just prefers using WhatsApp in their computer's web browser—but the other is Linux users. WhatsApp doesn't actually offer a version of its desktop app for Linux, so those users have to use the web app if they want to run WhatsApp on their computers. That means they've never before been able to place calls without pulling out a mobile device.\n            \n                What do you think so far?\n            \n        \nHow to sign up for the WhatsApp web app betaThis feature will soon roll out to all web app users, but until then, you need to be running the WhatsApp web app beta in order to try it.Luckily, it's pretty easy to get up and running. To start, open the web app, then head to the settings menu, choose \"Help,\" then choose the \"Join beta\" option. This will immediately switch you over to the beta version of the web app. (You should see a \"Beta\" label on your screen.) Now that you're running the beta, should you find the option to place calls in individual chats. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp's Web App Is Getting a Huge Upgrade",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH4GKF97FEFMJAZ2RWTSK25W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-10T20:00:00.000Z",
      "dateModified": "2026-02-10T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube TV Will Soon Offer a Cheaper, Sports-Only Plan",
    "url": "https://lifehacker.com/entertainment/youtube-tv-sports-only-plan?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH1Y33RZNJJK1NXJPPWZEY6E/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-09T20:00:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Justin Pot\n                            \n        \n            Justin Pot\n                \n                                                                        Editorial Author\n                                                            \n            \n            \n        \n            ExperienceJustin Pot is a freelance journalist who helps people get more out of technology. If you've ever searched online for a specific tech problem you've read Justin's work, because he's been doing it for a long time. Since 2009, he has written tutorials and essays about technology for outlets including WIRED, The Atlantic, PCMag, Popular Science, How-to Geek, and The Wall Street Journal. For Lifehacker, he mostly writes about software, with a particular focus on open source programs and indie apps. Justin has a bachelor's degree in Communications and International Relations. He once worked in marketing for a software company and hated it, but it did teach him a lot about why software tends to get worse over time in large companies. He lives in Oregon with his cat (and his wife). He enjoys brewing beer, exploring nature, and spending time with friends. You can follow Justin on Mastodon and Bluesky, or sign up for his newsletter, Connectivity.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: NurPhoto / Contributor via Getty Images\n                            \n            \n                Key Takeaways\n                                            YouTube TV will soon offer a number of new plans with more tailored options for less than the current subscription price.\n                                            Options will include a sports-only package, an entertainment-focused package, and at least 10 others.\n                                            YouTube TV currently costs $82.99 per month, but these new plans seem to cost about $10-$30 less per month, depending on the plan.\n                                    \n            \n    Table of Contents\n    \n        \n        Traditional TV works best for live events, and for many people, that means sports. Most of the online services providing access to traditional TV, however, don't allow you to only subscribe to sports. That's going to change.Today YouTube TV announced new plans that are a little bit cheaper than the current cost of $82.99 per month. Among them is a $64.99-per-month Sports plan, which includes access to the big national sports channels including FS1, NBC Sports Network, and all of the ESPN channels, along with access to network television. Basically, if a game is broadcast nationally, this package should give you access. And it will eventually give you access to many out-of-market—the post mentions that ESPN Unlimited will be part of the bundle starting in the fall.The new plan is only an $18 discount over the \"main\" YouTube TV plan, but if you're already paying for YouTube TV and are only ever watching sports, this could be a nice discount, particularly if you get access to ESPN Unlimited. \nThere are a few other discounted plans included in the announcement: The Sports + News package adds CNBC, Fox News, MSNow (formerly MSNBC), CNN, and more to the sports bundle, and costs $71.99. That's only $11 cheaper than the full plan, but is still a nice discount if you were only watching sports and news.\n            \n                What do you think so far?\n            \n        \nBut maybe the biggest savings are for people who don't want to watch sports at all. The Entertainment plan costs $54.99, which is $28 cheaper than the main plan ($336 cheaper per year). If you only watch entertainment channels, with no news or sports, this is the package to look into.There will be more than 10 plans like this rolling out in the next few weeks, according to YouTube TV. I've long dreamed of a world where I could pay only for the cable channels I care about at an affordable rate. This isn't perfect, but it's a bit closer than what YouTube TV offered before.\n            \n    \n    \n        The Daily Newsletter\n            Ready to do everything better?\n        \n        \n            Jordan Calhoun\n            \n        \n        Get daily tips, tricks, and tech guides from our expert team.\n            The Daily NewsletterReady to do everything better?\n                    Get daily tips, tricks, and tech guides from our expert team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube TV Will Soon Offer a Cheaper, Sports-Only Plan",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH1Y33RZNJJK1NXJPPWZEY6E/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-09T20:00:00.000Z",
      "dateModified": "2026-02-09T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You Can Opt Out of Ads on ChatGPT, but It Might Not Be Worth It",
    "url": "https://lifehacker.com/tech/ads-on-chatgpt-free?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH26KJW3KJD43H7MWGTR35FH/hero-image.fill.size_1200x675.webp",
    "tag": "Life",
    "date": "2026-02-09T22:20:40.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: OpenAI\n                            \n            \n                Key Takeaways\n                                            OpenAI is rolling out ads to all ChatGPT Free and Go users.\n                                            The company says that ads are private, but are informed by your current and past chats.\n                                            You can opt out of ads for free, but you will reduce your ChatGPT message limits.\n                                    \n            \n    Table of Contents\n    \n        \n        It finally happened. After months of speculation, ChatGPT officially has ads. OpenAI revealed the news on Monday, announcing that ads would roll out in testing for logged-in adult users on Free and Go subscriptions. If you or your organization pays for ChatGPT, such as with a Plus, Pro, Business, Enterprise, or Education account, you won't see ads with the bot.OpenAI says that ads do not have an impact on the answers ChatGPT generates, and that these posts are always clearly separated from ChatGPT's actual responses. In addition, ads are labeled as \"Sponsored.\" That being said, it's not exactly a church-and-state situation here. OpenAI says that it decides which ads to show you based on your current and past chats, as well as your past interactions with ChatGPT ads. If you're asking for help with a dinner recipe, you might get an ad for a meal kit or grocery service. The company claims it keeps your chats away from advertisers. The idea, according to the company, is strictly funding-based so that OpenAI can expand ChatGPT access to more users. That's reportedly why ads are starting as a test, not a hardcoded feature: OpenAI says it wants to \"learn, listen, and make sure [it gets] the experience right.\" As such, advertisers don't have access to chats, chat histories, memories, or your personal details. They do have access to aggregate information about ad performance, including views and click metrics.   \nOpenAI will only show ads to adults. If the service detects that you are under 18, it will block ads from populating in your chats. Ads also will not appear if you're talking to ChatGPT about something related to health, medicine, or politics. You can offer OpenAI feedback on the ads you do see, which should inform the ads you receive in the future. You can also delete your ad data and manage ad personalization, if you want to reset the information OpenAI is using to send you ads.\n    \n            \n            \n                                        Credit: OpenAI\n                    \n    \nThe thing is, you don't actually have to deal with ads, even if you use ChatGPT for free. That's not just by upgrading to a paid ChatGPT plan, though OpenAI does suggest that option in its announcement. In addition, OpenAI is offering Free and Go users a dedicated choice to opt out of ads here. There is, of course, a pretty sizable catch: You have to agree to fewer daily free messages with ChatGPT. OpenAI doesn't offer specifics here, so it's not clear how limited the ad-free experience will be. But if you hate ads, or if you simply don't want to see an ad for something irrelevant to your ChatGPT conversation, it's an option.\n            \n                What do you think so far?\n            \n        \nIf you like that trade-off, here's how to opt out of ads. Open ChatGPT, then head to your profile, which opens your profile's Settings page. Here, scroll down to \"Ads controls,\" then choose \"Change plan to go ad-free.\" Select \"Reduce message limits,\" and ChatGPT will confirm ads are off for your account. You can return to this page at any time to turn ads back on and restore your message limits.  Disclosure: Ziff Davis, Mashable’s parent company, in April 2025 filed a lawsuit against OpenAI, alleging it infringed Ziff Davis copyrights in training and operating its AI systems.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You Can Opt Out of Ads on ChatGPT, but It Might Not Be Worth It",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH26KJW3KJD43H7MWGTR35FH/hero-image.fill.size_1200x675.webp"
      ],
      "datePublished": "2026-02-09T22:20:40.000Z",
      "dateModified": "2026-02-09T22:20:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scammers Are Sending Fake Invites With Malware",
    "url": "https://lifehacker.com/tech/scammers-are-sending-fake-invites-with-malware?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGZ6YPTHD2KZC8JCB7KNJ83W/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-09T15:00:59.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Supapich Methaset / Shutterstock.com\n                            \n    Table of Contents\n    \n        \n        If you receive an event invitation via email, verify it's legit before you RSVP, as you may not actually be invited to anything. Malwarebytes Labs has identified a new scam in which threat actors are using party invites to trick users into installing a remote access tool (RAT) that gives them full control over infected devices. (This specific campaign seems to be limited to the UK, but similar tactics could easily spread.) These malicious invites contain a ScreenConnect installerThe scam starts with an innocuous-looking email invitation with an informal \"Save the Date\" vibe that may appear to come from a friend or acquaintance. The message contains a link to \"View Invitation\" for event details. If you click through, you'll end up on a landing page with a bold \"You're Invited\" header and a button to download your invitation, but you don't actually need to take any further action—your browser automatically triggers the download of a .msi file, which is not actually a party invitation or RSVP form but an installer. The MSI silently installs ScreenConnect Client, a legitimate IT support tool that allows remote access into the user's machine. Once this connection is established, attackers have the ability to see your screen, control your mouse and keyboard, and upload or download files—even if you restart your computer. All of this happens in the background with no obvious indicators that a remote access tool has been installed and is now running, so victims are unlikely to have cause for concern. \nYou should know these remote access red flagsAs Malwarebytes points out, this scheme is successful because it relies on normal human behavior around a seemingly low-risk situation: opening an event invitation. What's unusual is that there's little pressure or urgency in the initial message. Instead, the landing page has language like \"a friend has sent you an invitation\" and \"I opened mine and it was so easy,\" which is a form of social proof that guides users to take the desired action. You should always be alert to unsolicited invites sent via regular email with a link to an external site as well as any communication that prompts you to download or install software. These days, invitations are commonly delivered through apps and digital services like Partiful, Paperless Post, Evite, or Apple Invites, which are generally more trustworthy than random emails with hyperlinked text. If you're unsure whether the invite is real, verify with the sender through another channel before clicking or downloading anything. \n            \n                What do you think so far?\n            \n        \nAs mentioned, victims of this scam may not immediately notice that a RAT has been installed on their device. But there are some red flags, such as unexplained cursor movement or windows opening or closing on their own. You can check your machine for a file named \"RSVPPartyInvitationCard.msi\" or a service called ScreenConnect Client with additional random characters in the title.  If you've already downloaded ScreenConnect from a malicious invite, Malwarebytes recommends disconnecting from the internet and uninstalling the program immediately. Run a security scan to check your device for malware, and change important passwords from a separate device. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    \n        \n                \n                    \n                Lifehacker has been a go-to source of tech help and life advice since 2005. Our mission is to offer reliable tech help and credible, practical, science-based life advice to help you live better.\n                \n                \n                    \n                        Our Mission\n                        Our Team\n                        Newsletter\n                    \n                \n            \n        \n                © 2001-2026 Ziff Davis, LLC., A ZIFF DAVIS COMPANY. ALL RIGHTS RESERVED.\n                Lifehacker is a federally registered trademark of Ziff Davis and may not be used by third parties without explicit permission. The display of third-party trademarks and trade names on this site does not necessarily indicate\n                    any affiliation or the\n                    endorsement of Lifehacker. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scammers Are Sending Fake Invites With Malware",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGZ6YPTHD2KZC8JCB7KNJ83W/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-09T15:00:59.000Z",
      "dateModified": "2026-02-09T15:00:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Substack Data Breach May Have Compromised Nearly 700,000 User Records",
    "url": "https://lifehacker.com/tech/substack-user-records-data-breach?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KGT4BA905YCK53HNVCFP4JGG/hero-image.fill.size_1200x675.jpg",
    "tag": "Life",
    "date": "2026-02-06T19:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                    ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Jake Peterson\n                            \n        \n            Jake Peterson\n                \n                                            Senior Technology Editor\n                                    \n            \n            \n        \n            ExperienceJake Peterson is Lifehacker’s Tech Editor, and has been covering tech news and how-tos for nearly a decade. His team covers all things technology, including AI, smartphones, computers, game consoles, and subscriptions.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 6, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: PJ McDonnell/Shutterstock\n                            \n            \n                Key Takeaways\n                                            Substack disclosed a data breach this week that occurred in October of 2025.\n                                            Hackers compromised email addresses, phone numbers, and \"other internal metadata.\"\n                                            One threat actor claims the breach resulted in the loss of nearly 700,000 user records.\n                                    \n            \n    Table of Contents\n    \n        \n        When you sign up for a subscription on Substack, you're thinking you'll receive newsletters and posts from online creators, not lose the data you share with the platform. But like any digital service, the data you provide when signing up is at the mercy of Substack, or anyone who happens to gain access to that data. Unfortunately, that's now the case. As reported by BleepingComputer, Substack recently disclosed a significant data breach. The company's CEO, Chris Best, sent users a notice of the breach this week, sharing that email addresses, phone numbers, and \"other internal metadata\" were shared from Substack accounts without their permission. The company reportedly discovered the breach on Feb. 3, even though hackers accessed the data itself in October of 2025. That means the data was in unauthorized hands for roughly four months before Substack identified the breach. Best explained that Substack has since fixed the problem with the system that allowed an unauthorized third party to access this data. The company is launching an investigation and is reportedly taking steps to prevent this type of breach from happening going forward. On the bright side, Best claims that credit card numbers, passwords, and financial information were not accessed in the breach. \nWhat Best doesn't share is the scope of the breach. For that, we have to turn to BleepingComputer, which found a post from a \"threat actor\" on the hacking forum BreachForums. The actor posted a database of 697,313 Substack records, sharing that the Substack user base is much larger, but the scraping method was \"noisy and patched fast.\" This actor says the data compromised includes email addresses, phone numbers, names, user IDs, Stripe IDs, profile pictures, and bios—a bit more detailed than the report from Substack's CEO.700,000 records isn't the same as 700,000 users: Each record is something like an email address or a phone number, which means one Substack user could have lost multiple records in the breach. Still, it's a large number of data points, and is little consolation to the users who have lost information here. \n            \n                What do you think so far?\n            \n        \nWhat Substack can do after this breachUnfortunately, there's not much users can do to mitigate a data breach once it's happened. The data stolen from Substack is already lost, and you won't be able to undo that. However, there are some steps you can take to protect yourself in the wake of the breach, and to prevent this data loss in the future. First, closely monitor your incoming texts and emails. Hackers will take advantage of the data here to target Substack users in phishing schemes. If you receive messages from strangers, or even suspicious messages claiming to come from Substack, exercise caution. As per usual, never click on links in messages from senders you don't know, and, even more importantly, never download files or applications if instructed. You may also want to consider masking your email address going forward. Use a service like Apple's \"Hide My Email\" or DuckDuckGo's email protection to generate a \"burner\" address each time you need to share your email with a service. The service will send messages to the burner address, which gets forwarded to your real address. That way, the service doesn't know your real address, and, if hacked, won't compromise it. Hackers will only get the burner, which you can shut down at any time.\n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Substack Data Breach May Have Compromised Nearly 700,000 User Records",
      "image": [
        "https://lifehacker.com/imagery/articles/01KGT4BA905YCK53HNVCFP4JGG/hero-image.fill.size_1200x675.jpg"
      ],
      "datePublished": "2026-02-06T19:30:00.000Z",
      "dateModified": "2026-02-06T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Study's List of the Most Invasive AI Browser Extensions Includes a Few You Probably Use",
    "url": "https://lifehacker.com/tech/invasive-ai-browser-extensions-study-grammarly?utm_medium=RSS",
    "image": "https://lifehacker.com/imagery/articles/01KH0F0DCSGGX7YXWDCMW41CCN/hero-image.fill.size_1200x675.png",
    "tag": "Life",
    "date": "2026-02-09T15:30:00.000Z",
    "description": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                       ",
    "body": "\n        \n    \n                                    \n        \n        \n        \n    \n                                Emily Long\n                            \n        \n            Emily Long\n                \n                                                                        Freelance Writer\n                                                            \n            \n            \n        \n            ExperienceEmily Long is a freelance writer based in Salt Lake City. After graduating from Duke University, she spent several years reporting on the federal workforce for Government Executive, a publication of Atlantic Media Company, in Washington, D.C. She has nearly a decade of experience as a freelancer covering tech (including issues related to security, privacy, and streaming) as well as personal finance and travel. In addition to Lifehacker, her work has been featured on Wirecutter, Tom’s Guide, and ZDNET. Emily has also worked as a travel guide around the U.S. and as a content editor. She has a masters in social work and is a licensed therapist in Utah.\n        \n        \n            Areas of Expertise\n        \n        Read Full Bio\n    \n\n    \n                                        \n        \n        \n        February 9, 2026\n                \n        Add as a preferred source on Google\n\n    \n    \n        Add as a preferred source on Google\n\n            Credit: Smith Collection/Gado / Archive Photos via Getty Images\n                            \n            \n                Key Takeaways\n                                            A host of AI-powered browser extensions that have been installed by tens of millions of users may also be invading your privacy.\n                                            The most invasive extensions fall in the programming and mathematical aid category followed closely by meeting assistants and audio transcribers.\n                                            When adding an extension (or installing an app or program), carefully review the permissions requested.\n                                    \n            \n    Table of Contents\n    \n        \n        Browser extensions, even ones from trustworthy sources, are not without privacy and security risks. I've written before about add-ons that manage to slip through official store safeguards and even some that \"wake up\" as malware after operating normally for several years, so it should come as no surprise that a host of AI-powered browser extensions—collectively  installed by tens of millions of users—may also be invading your privacy. Researchers at data removal service Incogni looked at browser extensions available in the Chrome Web Store that included \"AI\" in their name or description and employed AI as part of their core functionality. By analyzing the data collected and permissions required, they assessed both how likely extensions are to be used maliciously and their potential to cause significant damage if compromised.AI-powered browser extensions collect extensive user dataIncogni found that website content, such as text, images, sounds, videos, and hyperlinks, was the most commonly collected data type (by nearly a third of AI-powered extensions). More than 29% of extensions investigated harvest personally identifiable information (PII)—name, address, email, age, identification number, for example—from users. Other forms of data collected include user activity, authentication information, personal communication, location, financial and payment information, web history, and health information. \nThe most invasive extensions fall in the programming and mathematical aid category (such as Classology AI and StudyX), followed closely by meeting assistants and audio transcribers. Writing and personal assistants also pose privacy risks—and many of these are also among the most downloaded AI-powered extensions in Chrome. How popular AI-powered Chrome extensions stack up on privacyIncogni also assigned \"privacy-invasiveness\" scores to the most downloaded AI-powered extensions, a combination of the amount of data collected and both general and sensitive permissions required: \n            \n                What do you think so far?\n            \n        \nGrammarly: AI Writing Assistant and Grammar Checker App (tied for #1)Quillbot: AI Writing and Grammar Checker Tool (tied for #1)Sider: Chat wiht all AI (tied for #3)AI Grammar Checker & Paraphraser — LanguageTool (tied for #3)Google Translate (tied for #4)WPS PDF — Read, Edit, Fill, Convert, and AI Chat PDF with Ease (tied for #4)Monica: All-in-One AI Assist  (tied for #4)AI Chat for Google (tied for #4)Immersive Translate — Translate Web & PDFChatGPT searchGrammarly and Quillbot were found to collect PII and website content as well as location data like region, IP address, and GPS coordinates. Grammarly also harvest user activity through network monitoring, clicks, mouse and scroll positions, and keystroke logging. While both also require sensitive permissions—such as the ability to inject code into websites and access active browser tabs—they have a relatively low risk of being used maliciously. How to protect your personal informationBrowser extensions that use AI aren't inherently bad, but you should be aware of what information they are collecting and what permissions they are requiring. The most common type of sensitive permissions required are scripting, which allows the extension to interact with pages as you navigate online, as well as activeTab, which lets it read or modify the page for the current session. When adding an extension (or installing an app or program), carefully review the permissions requested. If they aren't essential to the extension's functionality–or if they are but don't seem justified—you may be putting your data or device at risk by allowing them. As Incogni points out, users have to decide how much privacy to sacrifice in order to use apps and services. \n            \n    \n    \n        The Download Newsletter\n            Never miss a tech story\n        \n        \n            Jake Peterson\n            \n        \n        Get the latest tech news, reviews, and advice from Jake and the team.\n            The Download NewsletterNever miss a tech story.\n                    Get the latest tech news, reviews, and advice from Jake and the team.\n            \n        \n    \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Study's List of the Most Invasive AI Browser Extensions Includes a Few You Probably Use",
      "image": [
        "https://lifehacker.com/imagery/articles/01KH0F0DCSGGX7YXWDCMW41CCN/hero-image.fill.size_1200x675.png"
      ],
      "datePublished": "2026-02-09T15:30:00.000Z",
      "dateModified": "2026-02-09T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]