[
  {
    "title": "Nobel Prize winner Machado says Venezuela is in 'chaos' under current regime",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5571541/nobel-winner-machado-venezuela-maduro",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7314x4114+0+381/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2F07%2F4c1c4a1844d697ff51dea9bfe9ef%2Fgettyimages-2193162841.jpg",
    "tag": "Politics",
    "date": "2025-10-11T21:42:09.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Opposition leader Maria Corina Machado g",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Opposition leader Maria Corina Machado gives a speech during an Anti-government protest on Jan. 9, 2025 in Caracas, Venezuela.\n                \n                    Alfredo Lasry R/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alfredo Lasry R/Getty Images\n    \n\n   \n   Venezuela opposition leader and Nobel Peace Prize winner María Corina Machado said in an interview with NPR's Weekend Edition Sunday that her country is in chaos and called for the removal of Venezuela's authoritarian President Nicolás Maduro.   Speaking while still in hiding within Venezuela's borders, the far-right leader decried Maduro as an illegitimate strongman who had elbowed his way into a third term despite consistent evidence that his administration had rigged the vote.   \"I want to be very clear with this: Regime change was already mandated by the Venezuelan people on July 28, 2024,\" Machado said during an interview with NPR's Ayesha Rascoe on Saturday, citing last year's controversial, closely watched election.   \n   \"The narrative of the regime right now is that if Maduro goes, chaos will come to Venezuela. That's absolutely false,\" she said. \"Venezuela is in profound, total chaos right now.\"   Machado – whom Maduro's regime had barred from running in the race – had backed opposition candidate Edmundo González in the race to steer Venezuela as it suffers through a political and economic crisis that has forced more than one-fifth of its residents to flee the country.   Machado has been one of the staunchest critics of the powerful United Socialist Party of Venezuela (PSUV) since it first came to power in the late 1990s. A former legislator in the Venezuelan National Assembly, Machado has been shot at, targeted by federal prosecutors, banned from running for office, and forced into hiding by the government of Maduro, who succeeded PSUV founder Hugo Chávez in 2013.   \"We won by a landslide in the presidential election, and we proved it with over 85% of the original tally sheets. The whole world knows that. Even Maduro's allies know that he was defeated,\" Machado said.   Several Latin American countries, alongside the United States, agree that Maduro manipulated the electoral system in order to maintain his grip on Venezuela's government. The country has been riddled with corruption and, under Maduro's leadership, seen the country descend into economic collapse and a crackdown on free speech.   \n   The Trump administration has accused Maduro of leading a drug cartel and has ordered deadly strikes on boats it says were carrying drugs. The U.S. State Department is offering a reward of up to $50 million for information that would lead to Maduro's arrest.   Machado echoed those claims that Maduro is operating as a cartel head and blamed him for the boat strikes and broader international hostility towards Venezuela.   \"[The cartel] are destabilizing, intentionally, the region and undermining the institutions in the United States, because they have turned Venezuela into the safe haven of the enemies of the United States – Iran, China, Russia, Hezbollah, Hamas, and others,\" she said.   \"So, this is a war that was declared by Maduro, not us.\"   When asked if she would support U.S. military invasion of Venezuela to see Maduro deposed, Machado declined to speculate on whether President Trump would authorize such actions, but she called Trump a valuable ally in recognizing the \"threat\" Maduro presents as a leader.   \"You cannot have peace without freedom, and you cannot have freedom without strength,\" Machado said.   \"When you are facing a criminal structure, they have used violence, all the resources of the Venezuelan people against innocent people. People that are in prison right now that are tortured, persecuted and killed,\" she said. \"We need to stop this because it is a matter of saving lives and the regime has to understand that impunity is over.\"   Machado had dedicated her Nobel Peace Prize to Trump, whom she has supported and called on directly to help steer Venezuela towards democracy.   When asked whether she did so in the hopes that it would inspire Trump to help force Maduro out, Machado said: \"I dedicated it to the people of Venezuela and President Trump because I think it's the correct thing to do.\"   \n   \"I think it is fair, not only for what he has been doing in the last months to solve long and painful conflicts around the world, but precisely for what he's doing right now for the Americas,\" she said, adding that, if and when Maduro is ousted, she hoped to see the fall of other repressive regimes in Cuba and Nicaragua as well.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nobel Prize winner Machado says Venezuela is in 'chaos' under current regime",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7314x4114+0+381/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2F07%2F4c1c4a1844d697ff51dea9bfe9ef%2Fgettyimages-2193162841.jpg"
      ],
      "datePublished": "2025-10-11T21:42:09.000Z",
      "dateModified": "2025-10-11T21:42:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump directs Pentagon to use 'available funds' to pay military during shutdown",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5571945/trump-pentagon-hegseth-pay-military-during-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F50%2Ff9%2F05d0bbf4401aaea42268db7eaa05%2Fgettyimages-2229561471.jpg",
    "tag": "Politics",
    "date": "2025-10-11T21:00:41.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump delivers remarks ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump delivers remarks during a press conference at the White House along with Secretary of Defense Pete Hegseth.\n                \n                    Andrew Harnik/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images North America\n    \n\n   \n   In a post on Truth Social, President Trump said he has \"identified funds\" to ensure the active military gets paid next week, as Congress stalls over negotiations to reopen the federal government.   \"I am using my authority, as Commander in Chief, to direct our Secretary of War, Pete Hegseth, to use all available funds to get our Troops PAID on October 15th. We have identified funds to do this, and Secretary Hegseth will use them to PAY OUR TROOPS,\" Trump said.    Active-duty troops risked missing their first full paychecks on Wednesday, October 15.   Secretary of Defense Pete Hegseth reposted Trump's social media post on X stating, \"President Trump delivers for the troops.\"    \n   A White House official not authorized to speak publicly says that the Defense Department will be able to use research and development funding to pay service members. Those funds are available for two years, the official said but they did not provide further details on how much money is set aside.   President Trump previously said he would ensure active military would be paid despite the shutdown.    \"We will get our service members every last penny,\" Trump said at a Navy event in Norfolk, Virginia, last weekend. \"Don't worry about it,\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump directs Pentagon to use 'available funds' to pay military during shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F50%2Ff9%2F05d0bbf4401aaea42268db7eaa05%2Fgettyimages-2229561471.jpg"
      ],
      "datePublished": "2025-10-11T21:00:41.000Z",
      "dateModified": "2025-10-11T21:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Georgia politics and Rep. Marjorie Taylor Greene's stance on the shutdown",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5570741/georgia-politics-and-rep-marjorie-taylor-greenes-stance-on-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:46:11.000Z",
    "description": "\n      NPR's Scott Simon speaks to reporter Greg Bluestein about Georgia Rep. Marjorie Taylor Greene, who says her party needs to end the government s",
    "body": "\n      NPR's Scott Simon speaks to reporter Greg Bluestein about Georgia Rep. Marjorie Taylor Greene, who says her party needs to end the government shutdown and work with Democrats on health care.   \n\n    SCOTT SIMON, HOST:  Georgia Representative Marjorie Taylor Greene told NBC News this week...(SOUNDBITE OF ARCHIVED RECORDING)MARJORIE TAYLOR GREENE: I'm not some sort of blind slave to the president, and I don't think anyone should be. And I'm not elected by the president. I'm not elected by anyone that works in the White House. I'm elected by my district. That's who I work for. And I got elected without the president's endorsement. And, you know, I think that has served me really well.SIMON: Representative Greene is calling on her fellow Republicans to end the government shutdown by working with Democrats to extend Affordable Care Act subsidies. Her outspokenness on this issue and others is just one item of Georgia politics these days. We're joined now by Greg Bluestein. He's chief political correspondent for The Atlanta Journal-Constitution. Thanks so much for being with us.GREG BLUESTEIN: Thanks for having me.SIMON: How much does this most recent break from Republican leadership fit into Marjorie Taylor Greene's broader moves?BLUESTEIN: I mean, she's always been such a maverick in Georgia politics. But lately, it's really felt like she's even more of a wild card ever since she decided not to run for U.S. Senate for the spot challenging Senator Jon Ossoff, maybe the most vulnerable Democratic incumbent on the midterm ballot. Ever since she made that decision, she has been even more of a maverick, even more of a wild card. For the first time, really, that I can remember in Georgia politics, a bunch of Democrats are now praising Marjorie Taylor Greene, saying, I didn't think we could ever say this, but I agree with Marjorie Taylor Greene.SIMON: How have her constituents reacted?BLUESTEIN: Well, she is in a very, very red district up in northwest Georgia. There's been Democratic challengers to her that have raised lots of money but really made no headway. So she's safe politically. Her constituents - by her accounts, about 60% of them have agreed with her stance. Time and time again, we will talk to her constituents who say they might not like everything she says on Twitter, or on social media or on TV, but they agree with most of her votes. By some projections, ending these federal subsidies could affect more than 1.4 million Georgians. So to many of her constituents, she's not just speaking as a lawmaker; she's speaking as a mom whose children will have to pay more in health care insurance.SIMON: And, of course, this comes as there are two big races next year in Georgia for the Senate and for governor. What, so far, seems to be the major themes for both those campaigns?BLUESTEIN: Well, the biggest theme, I think, is it is wide open for both races. Other than Jon Ossoff, the incumbent Democratic senator, there seems to be a candidate for every lane. You have candidates in the governor's race from the far left to former Republican Lieutenant Governor Geoff Duncan, now running as a moderate Democrat. And then, of course, on the Republican side of that governor's race, you've got MAGA allies. You've also got Brad Raffensperger, the secretary of state, who famously defied Donald Trump's demand to find just enough votes to overturn the 2020 election in Georgia.SIMON: What about the economy? What kind of issue is that?BLUESTEIN: Yeah. Every poll that I've seen in Georgia, economy and jobs and inflation have always been the top issue, and I don't think that's going to change. But we have started to see - at least in polls of Democratic voters - number two is standing up to Donald Trump. And that reflects a lot of Democratic voters - especially the more liberal and progressive ones - who want a more confrontational, aggressive approach to the president. And there's candidates who are promising to do that in 2026, and there's others who are saying, no, look, we need to figure out ways we can work with the Republicans.SIMON: OK. And what are the issues on the Republican side?BLUESTEIN: Trump shadows everything as well. On the Senate race, for instance, there's pretty much a three-person race for Donald Trump's endorsement right now. There's former football coach Derek Dooley and Congressmen Mike Collins and Buddy Carter. Derek Dooley is probably the least known of any of them. He has a famous last name, thanks to his father, the legendary University of Georgia football coach. He has Governor Kemp's endorsement, though, so that helps him a lot. On the other side, the other two candidates, Collins and Carter, they're both depicting themselves as MAGA warriors who are going to be President Trump's biggest ally in the Senate should they win.SIMON: Where do a lot of Georgians see themselves fitting into the national landscape of politics now?BLUESTEIN: You know, we went from a state that was an afterthought - I remember in the 2016 presidential election, neither Trump nor Clinton even came to Georgia after the primary. They never had substantial operations in Georgia or big campaign rallies, and nor did they really need to. I mean, Donald Trump was always favored to win Georgia. He did. But in the process of 2016, he lost the Atlanta suburbs, and that was the first real inkling that Georgia was being competitive. And now we're used to being competitive. Now there's even voter fatigue because there have been so many competitive elections.You know, close to a billion dollars was spent in Georgia during the 2020 campaign. About 500 million was spent in 2022. So you're going into 2026 - yes, Georgia's still a battleground. Is it blue? No. Is it red? No. It's probably a sort of darker shade of purple right now but certainly still one of the most competitive places in the nation.SIMON: Greg Bluestein is chief political correspondent for the Atlanta Journal-Constitution. Thanks so much for being with us.BLUESTEIN: Thanks for having me.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Georgia politics and Rep. Marjorie Taylor Greene's stance on the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:46:11.000Z",
      "dateModified": "2025-10-11T11:46:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens tech export limits, new 100% tariff on Chinese imports",
    "url": "https://www.npr.org/2025/10/11/g-s1-93113/trump-threatens-100-tariff-chinese-imports",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F61%2Ff5%2F538af430432ab0e329ff0e1c0938%2Fap25283809175090.jpg",
    "tag": "Politics",
    "date": "2025-10-11T07:44:18.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks in the Ova",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks in the Oval Office of the White House, Friday, Oct. 10, 2025, in Washington, as Virginia Gov. Glenn Youngkin, Centers for Medicare & Medicaid Services administrator Dr. Mehmet Oz and Health and Human Services Secretary Robert F. Kennedy Jr., listen.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — President Donald Trump on Friday threatened to place an additional 100% tax on Chinese imports starting on Nov. 1 or sooner, potentially escalating tariff rates close to levels that in April fanned fears of a global recession.   \n   The president expressed frustration with new export controls placed on rare earth elements by China — and said on social media that \"there seems to be no reason\" to meet with Chinese leader Xi Jinping as part of an upcoming trip to South Korea.   Trump later told reporters he had not canceled his meeting. \"But I don't know that we're going to have it,\" he said during an Oval Office appearance on another subject. \"I'm going to be there regardless, so I would assume we might have it.\"   \n   Trump also suggested there may be time to ratchet down his steep new tariff threat. \"We're going to have to see what happens. That's why I made it Nov. 1,\" he said.   China's new restrictions   On Thursday, the Chinese government restricted access to rare earth minerals, requiring foreign companies to get special approval for shipping the metallic elements abroad. It also announced permitting requirements on exports of technologies used in the mining, smelting and recycling of rare earths, adding that any export requests for products used in military goods would be rejected.   On social media, Trump described the export controls as \"shocking\" and \"out of the blue.\" He said China is \"becoming very hostile\" and that it's holding the world \"captive\" by restricting access to the metals and magnets used in electronics, computer chips, lasers, jet engines and other technologies.   Trump said in a post that \"starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying.\" The president also said the U.S. government would respond to China by putting its own export controls \"on any and all critical software\" from American firms.   \n   The Chinese Embassy in Washington did not immediately respond to an Associated Press request for comment.   Trump is known for using threats as a tactic   The S&P 500 tumbled 2.7% on worries about the rising tensions between the world's largest economies. It was the market's worst day since April when the president last bandied about import taxes this high. Still, the stock market closed before the president spelled out the terms of his threat.   Not only could the global trade war instigated by Trump be rekindled, but import taxes being heaped on top of the 30% already being levied on Chinese goods could, by the administration's past statements, cause trade to break down between the U.S. and China in ways that could cause growth worldwide to slump.   \n   While Trump's wording was definitive, he is also famously known for backing down from threats. Earlier this year, some investors began engaging in what the Financial Times called the \"TACO\" trade, which stands for \"Trump Always Chickens Out.\"   The prospect of tariffs this large could compound the president's own political worries, potentially pushing up inflation at a moment when the job market appears fragile and the drags from a government shutdown are starting to compound with layoffs of federal workers.   The United States and China have been jostling for advantage in trade talks, after the import taxes announced earlier this year triggered the trade war. Both countries agreed to ratchet down tariffs after negotiations in Switzerland and the United Kingdom, yet tensions remain as China has continued to restrict America's access to the difficult-to-mine rare earths needed for a wide array of U.S. technologies.   There is already a backlog of export license applications from Beijing's previous round of export controls on rare earth elements, and the latest announcements \"add further complexity to the global supply chain of rare earth elements,\" the European Union Chamber of Commerce in China said in a statement.   \n   There are other flashpoints in the trade relationship, including U.S. restrictions on China's ability to import advanced computer chips, sales of American-grown soybeans and a series of tit-for-tat port fees being levied by both countries starting on Tuesday.   Analysts say there's time to de-escalate   Trump did not formally cancel the meeting with Xi, so much as indicating that it might not happen as part of a trip at the end of the month in Asia. The trip was scheduled to include a stop in Malaysia, which is hosting the Association of Southeast Asian Nations summit; a stop in Japan; and a visit to South Korea, where he was slated to meet with Xi ahead of the Asia-Pacific Economic Cooperation summit.   Sun Yun, director of the China program at the Stimson Center, said Beijing's move was a reaction to U.S. sanctions of Chinese companies this week and the upcoming port fees targeting China-related vessels — but said there's room for de-escalation to keep the leaders' meeting alive. \"It is a disproportional reaction,\" Sun said. \"Beijing feels that de-escalation will have to be mutual as well. There is room for maneuver, especially on the implementation.\"   Gracelin Baskaran, director of the Critical Minerals Security Program at the Center for Strategic and International Studies in Washington, D.C., said China holds leverage because it dominates the market for rare earths with 70% of the mining and 93% of the production of permanent magnets made from them, which are crucial to high-tech products and the military.   \"These restrictions undermine our ability to develop our industrial base at a time when we need to. And then second, it's a powerful negotiating tool,\" she said.   Craig Singleton, senior director of the China program at the Foundation for Defense of Democracies, a think tank, said Trump's post could \"mark the beginning of the end of the tariff truce\" that had lowered the tax rates charged by both countries.   \n   \"Mutually assured disruption between the two sides is no longer a metaphor,\" Singleton said. \"Both sides are reaching for their economic weapons at the same time, and neither seems willing to back down.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens tech export limits, new 100% tariff on Chinese imports",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F61%2Ff5%2F538af430432ab0e329ff0e1c0938%2Fap25283809175090.jpg"
      ],
      "datePublished": "2025-10-11T07:44:18.000Z",
      "dateModified": "2025-10-11T07:44:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week in Politics: Trump on Gaza ceasefire and tariffs on China; government shutdown",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5566667/week-in-politics-trump-on-gaza-ceasefire-and-tariffs-on-china-government-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:45:57.000Z",
    "description": "\n      President Trump threatens a massive tariff hike on China, and Americans begin to feel the effects of the government shutdown.   \n\n    SCOTT SIM",
    "body": "\n      President Trump threatens a massive tariff hike on China, and Americans begin to feel the effects of the government shutdown.   \n\n    SCOTT SIMON, HOST:  President Trump said he's confident the Israel-Hamas ceasefire will hold. He's expected to be in Israel Monday to speak to the country's Knesset. NPR senior political contributor Ron Elving joins us. Ron, thanks for being with us.RON ELVING, BYLINE: Good to be with you, Scott.SIMON: How big an achievement is this ceasefire for President Trump?ELVING: We are still in the first phase of watching this agreement play out, but even now, it's a significant achievement just getting these parties - Hamas with all its factions, Israel with all its factions - all coming together on an agreement on these terms. So it's an enormously welcome breakthrough. And if it holds up, it would certainly be a highlight of Trump's presidency, perhaps reminiscent of the way the Camp David Accords were the pinnacle of Jimmy Carter's presidency. But we haven't seen the return of the hostages yet. We still don't know whether that will lead to the next steps in the peace plan or potentially unleash more violence. If Trump and his team can keep Bibi Netanyahu on board and if he, in turn, can control his hard-liners, this will indeed be a monument to peace and to Trump and his administration, and they will deserve a great deal of credit.SIMON: Staying with foreign policy for a moment, the president said yesterday he plans an additional 100% tariff on China starting November 1 or sooner. Should we take his words as policy or posturing?ELVING: China announced some new restrictions on the export of rare earths, which are minerals crucial in high-tech manufacturing. Trump erupted with promises of payback. He said he would raise tariffs 100% on everything Chinese. Now, perhaps we should be accustomed by now to this kind of threat from Trump, especially to gaudy numbers like 100%. But Wall Street took it seriously - had its worst day in six months, with deep losses in the midst of what has been a long-running rally for stocks. So what happens next? We've seen this thrust and parry before. Will Chinese President Xi's trip to the U.S. be canceled, and which side will do the canceling? And we wait to see how much this disrupts the most important trading relationship in the world - the relationship between the two largest economic powers.SIMON: U.S. government shutdown heading into its third week. Layoffs of federal workers have begun. When asked by a reporter yesterday how many layoffs he'd authorized, the president said, a lot.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: And it will be Democrat-oriented because we figure, you know, they started this thing...UNIDENTIFIED PERSON: Can you give us some numbers?TRUMP: ...So they should be Democrat-oriented. It'll be a lot, and we'll announce the numbers over the next couple of days. But it'll be a lot of people, all because of the Democrats.SIMON: I think he's blaming the Democrats. What more can you tell us?ELVING: Yes, he continues to blame the Democrats, and he is openly punishing the people in blue states, whether they're Democrats or not. I think we all know at this point that the impasse between lawmakers in Congress has caused federal workers to be furloughed, but fired? Their jobs are just as mandated by legislation as they were before. They have been assured their jobs were protected and they would get back pay. Now the White House is casting doubt on both.And the cuts are concentrated in some highly sensitive departments such as health and treasury. We've seen the figure of 4,000 already and more, and the aggressiveness of these firings is causing some heartburn among Republicans as well as the targeted Democrats. Republicans have voters who work for the federal government, too, and even more who depend on the government for services and for other things as well.SIMON: Ron, are we reaching the point where enough people are feeling the effects of this shutdown that we can expect some movement to bring it to an end?ELVING: People are feeling it, Scott, at airports, in farm country, wherever people do business with the government in any way or depend on it in any way. Republicans had hoped those people would blame the Democrats and put pressure on them. Some do and some have, but polls show more people are blaming the president and his party. So can there be an end in sight? Yes, when both sides are willing to talk seriously about the coming cuts to health care, cuts that will hurt people in red states as much as in blue states and very possibly hurt them more.Some of Trump's biggest counties have very high rates of dependence on Medicaid. Republicans say they are willing to talk about health care and its costs after the shutdown ends, but if they have ideas and a willingness to address this issue, people who are suffering are very likely to ask, why can't they talk now?SIMON: NPR senior political contributor Ron Elving. Ron, thanks so much.ELVING: Thank you, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week in Politics: Trump on Gaza ceasefire and tariffs on China; government shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:45:57.000Z",
      "dateModified": "2025-10-11T11:45:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Smithsonian museums and National Zoo set to close as shutdown takes its toll",
    "url": "https://www.npr.org/2025/10/11/g-s1-93157/smithsonian-national-zoo-federal-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7977x4487+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fa3%2Fb63c6a8b48569c0b0463509f46cc%2Fgettyimages-2196458567.jpg",
    "tag": "Politics",
    "date": "2025-10-11T17:35:53.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Panda Bao Li eats bamboo at the Smithson",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Panda Bao Li eats bamboo at the Smithsonian National Zoo in Washington, D.C., on Jan. 28. The zoo, as well as other Smithsonian facilities, will be closed beginning on Oct. 12 as the government shutdown continues.\n                \n                    Kayla Bartkowski/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kayla Bartkowski/Getty Images\n    \n\n   \n   As the government shutdown drags on, Smithsonian museums, the National Zoo and other facilities are the latest to be caught in the fray, with the federal trust announcing the closure of all of its sites beginning on Sunday.   \"We will update our operating status as soon as the situation is resolved,\" the Smithsonian announced on social media. \"We do not plan to update social media other than to inform you of changes to our operating status.\"   The closure affects all of the Smithsonian's 21 museums, its research centers and the National Zoo.   \n   As worried social media users expressed concern about the well-being of the animals at the zoo, the Smithsonian assured its supporters that the animals would still be cared for during the zoo's closure.   \"All the animals at the Zoo and at the Smithsonian Conservation Biology Institute in Front Royal, Virginia, will continue to be fed and cared for,\" the Smithsonian said. \"A shutdown will not affect our commitment to the safety of our staff and standard of excellence in animal care.\"   The zoo's beloved animal cams, however, are considered nonessential and will be turned off for the remainder of the shutdown.   The Smithsonian receives about 62% of its funding from the federal government, which helps support free admission to all of its D.C. museums and the National Zoo.   Its facilities had been able to keep their doors open for the first 11 days of the shutdown by relying on prior-year funds, but those coffers have since run dry.   \n   The Smithsonian is just the most recent entity to find itself ensnared in the ongoing dispute on government funding.   Some national parks around the country have also been forced to close as staff have been deemed nonessential and sent home until Congress can reach an agreement on government funding.   On Friday, thousands of federal employees across agencies including the Department of Health and Human Services and the Department of Education began receiving reduction in force notices, informing them that they would be laid off.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Smithsonian museums and National Zoo set to close as shutdown takes its toll",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7977x4487+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fa3%2Fb63c6a8b48569c0b0463509f46cc%2Fgettyimages-2196458567.jpg"
      ],
      "datePublished": "2025-10-11T17:35:53.000Z",
      "dateModified": "2025-10-11T17:35:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How will Trump rescue Argentina's economy?",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5566745/how-will-trump-rescue-argentinas-economy",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:45:59.000Z",
    "description": "\n      Argentina's economy is spiraling. NPR's Scott Simon speaks with economist Monica de Bolle about the Trump administration's plan to rescue it.  ",
    "body": "\n      Argentina's economy is spiraling. NPR's Scott Simon speaks with economist Monica de Bolle about the Trump administration's plan to rescue it.   \n\n    SCOTT SIMON, HOST:  The Trump administration is throwing an economic lifeline to Argentina. Last month, President Javier Milei's party lost crucial provincial elections. In turn, Argentina's currency plunged, and stock prices plummeted. This has jeopardized reforms that Milei, an ideological ally of President Trump, has undertaken to try to balance Argentina's budget and tame its triple-digit inflation. This week, U.S. Treasury Secretary Scott Bessent formalized an agreement to loan $20 billion to Argentina, writing that the United States is, quote, \"prepared, immediately, to take whatever exceptional measures are warranted to provide stability.\" Monica de Bolle is an economist with the Peterson Institute for International Economics who specializes in Latin America and joins us now. Thanks so much for being with us.MONICA DE BOLLE: Thank you very much for having me.SIMON: Just eight months ago, President Milei was at a conservative political conference here in the U.S., waving a chainsaw around on stage to symbolize his efforts to downsize Argentina's government bureaucracy. What's happened since then?DE BOLLE: So Milei has actually been quite successful in downsizing Argentina's government, and he's been pretty successful at enacting some of the other very ambitious reforms that he had planned. Inflation did come down quite substantially. Argentina also had a very high fiscal deficit, and they managed to turn that situation around. The problem is that Argentina is a country that's quite unique because it operates with two currencies, not just one. So they have their own currency - the peso - and they also use dollars in the same way that we use dollars in the U.S.And oftentimes, because of that system, they find themselves in a situation where they don't have enough dollars for the economy to function properly. And one of the things that did spark this dollar shortage was a corruption scandal involving Milei's sister, who is actually a very key figure in his government. So that coupled with the provincial elections in Buenos Aires, which did not go Milei's way, led to the kind of dollar outflows and hence market turmoil that we saw very recently.SIMON: What would the $20 billion in aid the U.S. will provide do for Argentina?DE BOLLE: So it won't really do all that much. I mean, it will resolve temporarily the kind of dollar shortages that they're currently facing, which is making markets very nervous and is having an impact on the exchange rate and on their domestic currency. So the domestic currency is weakening, and when that happens, usually inflation starts to spike again. So what the $20 billion will do is provide relief to that situation. But the problem is that longer term, it doesn't solve the issue that Argentina has because of the nature of its regime. Since it operates with two currencies and since it uses the dollar as if it were their own currency, they will probably face another dollar shortage not too far from where we are now.And in addition to that, the lifeline that the U.S. is giving to Argentina now - so the $20 billion - the idea behind it is that it calms things down sufficiently for Milei to be able to navigate the next few weeks because come October 26, there are going to be legislative elections or congressional elections in Argentina. So there is sort of a bet behind this that, you know, by sort of staving off the turmoil, perhaps that will give Milei a better chance to garner more support in Congress in the upcoming elections, and that in turn would pave the way for the continuation of his reforms.SIMON: There's a long history in Argentina of defaulting on its obligations. I mean, isn't the U.S. taking a big risk here?DE BOLLE: Yes. The U.S. is definitely taking a big risk. If there is one country in the world that has surprised me in terms of the U.S. providing support to it, that country could be no other than Argentina, precisely because of that fraught history.SIMON: There's been criticism, of course, of the decision to provide aid to Argentina, especially among Democrats. Is there an argument to be made that it's in the interest of the United States to advance $20 billion to Argentina?DE BOLLE: There's no economic argument to be made that it is in the interest of the U.S. There is potentially a geopolitical argument to be made as it pertains to China. So China has been, over the past many years, very heavily involved in the region, very heavily involved in Argentina. This, I think, has become an issue now for the administration. So the way I see the motivation for this 20-billion lifeline is to try to get Argentina more into the zone of influence of the United States and away from the zone of influence of China.SIMON: Monica de Bolle from the Peterson Institute for International Economics. Thanks so much for being with us.DE BOLLE: Thank you very much for having me.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How will Trump rescue Argentina's economy?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:45:59.000Z",
      "dateModified": "2025-10-11T11:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump slashes mental health agency as shutdown drags on",
    "url": "https://www.npr.org/sections/shots-health-news/2025/10/11/nx-s1-5571948/trump-mental-health-substance-abuse-cdc-layoffs-jobs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+76/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F93%2Fbd%2F2cdf09154c4fa4ae3493700e0db1%2Fgettyimages-2192048758.jpg",
    "tag": "Politics",
    "date": "2025-10-11T23:10:36.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sign for the 988 Lifeline mental health ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sign for the 988 Lifeline mental health emergency hotline, Walnut Creek, California, December 20, 2024. The Trump administration has laid off more than 100 employees at the agency responsible for overseeing the number.\n                \n                    Smith Collection/Gado via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Smith Collection/Gado via Getty Images\n    \n\n   \n   The Trump administration has laid off more than 100 employees at the nation's main mental health agency, NPR has learned.   Current and former employees at the Substance Abuse and Mental Health Services Administration (SAMHSA) told NPR about the layoffs, which were part of a government-wide reduction in force. The sources, who were not authorized to speak publicly about the agency, said the layoffs came late Friday, as the nation's government shutdown dragged on.   Employees were notified of a \"Reduction in Force\" shortly before 8 p.m. ET on Friday, according to a source within the agency who was not authorized to discuss the layoffs publicly. According to the source, administration officials offered no rationale for who lost their jobs:   \n   \"I think the general feeling today is shock — and not understanding why?\" the source told NPR.   That source was aware of dozens of firings. Two former employees told NPR that the total number of employees at SAMHSA who lost their jobs was around 125, though that number was a rough estimate. SAMHSA had employed around 900 people.   The Department of Health and Human Services did not immediately respond to NPR's request for comment.   SAMHSA is responsible for overseeing the new 988 suicide prevention hotline. It also gives out billions in grants for mental health and addiction services. It was created in 1992 through bipartisan legislation signed by then-President George H.W. Bush. In 2024 its budget was about $7.5 billion, most of which went directly to states for programs aimed at mental health issues and addiction.   \n   SAMHSA funds \"are the backbone of behavioral health in this country,\" Rachel Winograd, a psychologist at the University of Missouri-Saint Louis, told NPR earlier this year. \"If those grants were to go away, we'd be screwed.\"   Despite having what many see as an essential role in protecting the nation's mental health, SAMHSA has not been viewed favorably by the current administration. President Trump had proposed slashing its budget as part of his Big Beautiful Bill. And earlier this year, Health Secretary Robert F. Kennedy Jr. told Congress that he intended to fold its duties into a new program he calls the Administration for a Healthy America.   \n   CDC in confusion as some cuts reversed   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A sign marks the entrance to the U.S. Centers for Disease Control and Prevention headquarters Wednesday, Aug. 27, 2025, in Atlanta. Several key parts of the agency are losing employees.\n                \n                    Brynn Anderson/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brynn Anderson/AP\n    \n\n   \n   SAMHSA was not the only agency to see staff laid off on Friday evening. The Centers for Disease Control and Prevention also appears to have suffered cuts to staffing, according to two employees who say they were affected by the firings. Both employees were not authorized to speak to the press while the layoffs are being finalized.   But the cuts at CDC seemed to be in flux late Saturday. In an apparent reversal, one employee had their firing undone according to a letter seen by NPR. The letter, from Tom Nagy, the Chief Human Capital Officer at the department of Health and Human Services said the employee's Reduction in Force was \"hereby revoked.\"   The source said they were aware of other reversals at the CDC, but it was unclear how many employees received such letters.   \n   Before the reversals went out, one CDC official who was laid off told NPR that the agency had been the subject of sweeping cuts to staff at offices responsible for disease surveillance, outbreak forecasting, chronic diseases, and immunization and respiratory diseases, to name but a few. \"If you wanted to weaken America's public health capacity without saying it outright, this is how you'd do it — remove the people who connect the dots, steady the ship, and keep the public informed,\" the official who was laid off told NPR.   The New York Times also reported extensive cuts at the public health agency, including two senior officials responsible for overseeing the CDC's measles response team. HHS did not respond to NPR's request for comment about CDC cuts by deadline.   NPR's Pien Huang and Jeff Brady contributed to this report.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump slashes mental health agency as shutdown drags on",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+76/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F93%2Fbd%2F2cdf09154c4fa4ae3493700e0db1%2Fgettyimages-2192048758.jpg"
      ],
      "datePublished": "2025-10-11T23:10:36.000Z",
      "dateModified": "2025-10-11T23:10:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5570868/analyzing-dominion-voting-systems-sale-to-firm-run-by-ex-republican-elections-official",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:46:15.000Z",
    "description": "\n      \n      Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official\n    \n            \n                \n              ",
    "body": "\n      \n      Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5570868/nx-s1-9488474\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Dominion Voting Systems has been sold to Liberty Vote. Dominion was at the center of fraudulent vote rigging claims by President Trump and his allies during the 2020 election.   \n\n    SCOTT SIMON, HOST:  Dominion Voting Systems, the election technology company that's at the heart of countless conspiracy theories after the 2020 election, has been sold. Dominion machines are used in more than half the states, and the company's buyer seems to be leaning into some of President Trump's language about voting. NPR's voting correspondent, Miles Parks, joins us in our studios. Miles, thanks so much for being with us.MILES PARKS, BYLINE: Hey, Scott. Thanks for having me.SIMON: Dominion became what amounts to a household name after the 2020 elections. Remind us why.PARKS: Well, if you think back to November 2020, the Trump campaign, influential people on the right, were really throwing spaghetti at the wall, trying to find a conspiracy theory to stick about why President Trump did not win that election. You know, Italian satellites, late-night ballot dumps, and Dominion really got pulled into that. Here's former Trump attorney Sidney Powell talking a little bit after the election on Fox Business.(SOUNDBITE OF TV SHOW, \"FOX BUSINESS\")SIDNEY POWELL: I can hardly wait to put forth all the evidence we have collected on Dominion, starting with the fact it was created to produce altered voting results in Venezuela for Hugo Chavez.PARKS: So you get a taste a little bit of the kind of accusations that were being made about the company, even though none of them were ever proven true. Fox News ended up settling a defamation lawsuit with the company for close to $800 million, and the far-right outlet Newsmax also settled a similar lawsuit for more than $60 million.SIMON: Now, I imagine none of that can be good for business. Is that why the company's been sold?PARKS: Well, we haven't heard from Dominion about the sale, but I can say the rumors have not completely died and have clearly impacted the business. You know, in 2023, a Republican-leaning county in California actually voted to get rid of their Dominion counting machines in favor of hand-counting ballots, even though it was estimated to triple their costs. And even this year, officials with Trump's Justice Department reached out to local clerks in Missouri wanting to access their Dominion machines. We aren't really sure exactly why, but it is clear that there is still a lot of skepticism about this company among people who deny the 2020 results.SIMON: And, of course, that could be a big task for the buyer of Dominion, which is who? And why are they buying?PARKS: Right. So it's someone who wants to - who already owns a voting equipment company and wants to expand. Scott Leiendecker is his name, and he's been working in elections for decades, first as an official. He was the Republican elections director in St. Louis. And then in 2011, he started a company called KNOWiNK that has become the nation's largest vendor for voting check-in equipment. To acquire Dominion, Leiendecker started a new company called Liberty Vote, and where it gets really interesting is how much he seems to be leaning into the right's election integrity language.SIMON: Did the Liberty Vote detail how they plan to change Dominion?PARKS: So it's still a little bit unclear, but there is definitely a rebrand going on. The announcement explicitly said that they would only use domestic staffing and software development, which seemed to nod to the conspiracy theorizing about Venezuela that we heard a little bit of before. And the announcement also said it would prioritize complying with President Trump's March executive order on voting.But just to be clear, it's not like the Dominion machines are just going away. You know, government contracts are already in place and, in many case, for many years down the road. So counties that have these vote tabulators are probably still going to use them in elections in 2026. It will be interesting to watch then how the election integrity activists - the most ardent ones on the right - take this news, considering it's just, at this point, a change in ownership.SIMON: NPR's Miles Parks. Thanks for joining us this morning.PARKS: Thanks, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:46:15.000Z",
      "dateModified": "2025-10-11T11:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "She posted about Charlie Kirk's death. Within eight hours, she was fired",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5550366/charlie-kirk-social-media-firings",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2530+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8a%2F17%2F0a583b5b4dff8281a3a063e2c3ca%2Fonline-vigilantism-final.jpeg",
    "tag": "Politics",
    "date": "2025-10-11T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        Xinyue Chen for NPR\n    \n\n   \n   Scrolling through social",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        Xinyue Chen for NPR\n    \n\n   \n   Scrolling through social media during a work break, Alexandra realized she was going to lose her new job.   An X account with over 500,000 followers had reposted a screenshot of a Facebook post she'd made about slain conservative activist Charlie Kirk.   \"You log onto Twitter and you see half a million people following a page, including Elon Musk. They're saying, you better fire this person,\" said Alexandra. \"I knew that they were going to fire me because of the pressure by the mob.\"   \n   The X account also named Alexandra and her employer. NPR is not naming the X account and also only using Alexandra's middle name because she is concerned about her safety.   Less than three hours after the X post about her, Alexandra's employer fired her via email. There was no conversation, Alexandra said. She had started the cybersecurity job just two weeks before.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                After a post on X named Alexandra and her employer, an employment termination email arrived in her inbox.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   And then there were the threats. One user on Facebook asked Alexandra how she liked an Italian restaurant across the street from where she lives in New York City, a sign that someone had tracked down her address and possibly other personal information.   \"4.5 out of 5 stars, sounds pretty decent,\" the post said.   Alexandra left her apartment. \"If they can come for me on the Internet, they can definitely come for me in real life.\"   She first went to a friend's place across town. \"I woke up in her kid's princess room in the morning, and then I went to another friend's house in Connecticut for the next three or four days.\"   \n   Alexandra is among the people who lost their jobs because of their social media posts about Kirk's death. She is not the only one who has expressed concerns about physical safety after naming-and-shaming campaigns online. While such campaigns are not new, both Alexandra and researchers watching them noted how the scrutiny is now sharply focused on employment, and that pressure now comes with the weight from figures with political power.   Guest-hosting the podcast Kirk used to host, Vice President Vance told viewers to call out people for what he called \"celebrating Charlie's murder.\"   \n   \"Hell, call their employer,\" he said. Online, people traded tips to not only make phone calls, but to also leave negative Google reviews and send emails to management. Multiple websites popped up to collect offending social media posts and information about the people who posted them.   Born in the former Soviet Union, Alexandra moved to the U.S. with her family as an infant decades ago. \"My entire life, they would tell me that they left to come here for me, you know, with no idea of ever being able to return\".   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Alexandra's family moved to the U.S. from the Soviet Union so she could grow up with more freedoms.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   Her family left, she said, so she could grow up with more freedoms — something she now feels is at risk. She understood that her former employer could fire her for any reason, but she feels frustrated that it happened — in her view — because of an online pressure campaign backed by people with political power. \"I don't think that was ever what the standard issue response was.\"   \"What's currently happening is state-sponsored censorship,\" Alexandra said, \"While it may not be officially documented sponsored by the state, it is verbally sponsored by the state.\"   From employed to unemployed in eight hours    Alexandra wrote the Facebook post that got her fired at 10:13 A.M. on Sept 12, two days after Kirk was assassinated.   The post was a riff on Kirk's own words about an attack on Paul Pelosi, the husband of then-House Speaker Nancy Pelosi, after a man entered their home in San Francisco and attacked Paul with a hammer shortly before the 2022 midterms. He sustained a fractured skull and other severe injuries.   \n   Days after the attack, Kirk spoke about the attacker on his show, \"And why is he still in jail? Why has he not been bailed out? By the way, if some amazing patriot out there in San Francisco, or the Bay Area, wants to really be a midterm hero, someone should go and bail this guy out, I get his bail is about $30,000 or $40,000. Bail him out and then go ask him some questions.\"   Alexandra's post mimicked Kirk's words: \"They caught the guy (allegedly)...\" she wrote after the alleged gunman was named and arrested. \"And why is he still in jail? Why has he not been bailed out? By the way, if some amazing patriot out there in Utah wants to be a midterm hero, someone should go and bail out Tyler Robinson... Bail him out and then go ask him some questions about Charlie.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Ever since the post on X revealed her personal information, Alexandra worries for her personal safety.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   Alexandra said \"it was horrible\" the way Kirk died. \"I felt as bad for him as I feel for any victim of gun violence, especially in schools.\"   \n   But she said she was objecting to the way \"everybody was making him to be a martyr for free speech and some kind of hero nationally ... a hero, because he was a right-wing Christian nationalist.\"   \n   In recent years Kirk began to frame his political arguments in explicitly Christian terms, including some tropes and imagery used by activists with anti-democratic aims.   \n   \"I don't value those things.\" Alexandra said, \"As an American, I don't think we have to value the same things. We just have to protect each other's ability to say, though.\"   For the first few hours, Alexandra's post didn't draw much attention. The ire she faced only started after she commented on someone else's friends-only Facebook post. That person was criticizing posts that were what he called an \"endorsement of Charlie Kirk's death\"   \"[W]e are quoting him. If you big mad you mad at him\" Alexandra wrote around midday. \"I had said that comment and then went back to work,\" Alexandra said.   She did not see his response until much later.   \"You cannot redeem yourself here. Your presence is voluntary, I'm only leaving you for the wolves,\" wrote her now-former Facebook friend. The two have since blocked each other.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                \"As an American, I don't think we have to value the same things. We just have to protect each other's ability to say, though,\" Alexandra said.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   More comments flowed in, focusing on who her employer was. Around three o'clock, another account wrote, \"It would be a shame if people started posting this,\" followed by a screenshot of Alexandra's post that echoed Kirk's words.   \"Already submitted, currently going viral on Twitter,\" a third account wrote. \"Have a good day\"   Around the same time, the prominent X account with half-a-million followers posted a screenshot of Alexandra's original post. It was sharply critical of what she'd written and gave her full name and the name of her employer. Within minutes, other accounts replied.   \"On it,\" one account wrote, \"this time I'm contacting any board/investor contacts as well and leaving the CEO in the dark.\" Another posted a screenshot of the employer's contact information.   \n   About two-and-a-half hours later, the account that screenshotted the employer contact information followed up with another screenshot that appears to be an email from Alexandra's employer, saying that it was \"reviewing the situation internally\"   About 20 minutes after the email screenshot, Alexandra was fired by email.   Alexandra's employer confirmed to NPR that a firing was made that day but did not confirm it was her, saying the decision was \"based on the employee's failure to adhere to our established company policies.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Alexandra had only recently started her new job when she was fired.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   The reach of large accounts   Unlike the many posts that went viral in the wake of Kirk's assassination, Alexandra's message did not have a particularly broad reach.   It garnered fewer than 100,000 views and before Alexandra's employer fired her, it had under 80 replies.   The dozens of comments or even emails and phone calls probably weren't as big of a concern for an employer as worries about even bigger heavyweight users the post could potentially draw, said Daniel Trottier, a professor at Erasmus University Rotterdam, who has studied naming and shaming online campaigns.   \n   Multiple users with much smaller followings tagged Libs of Tik Tok and Laura Loomer, two prominent users who have a history of publicizing other accounts they disagree with. Libs of Tik Tok is an account run by right wing influencer Chaya Raichik, who has a track record of running targeted campaigns against drag queens and children's hospitals that she falsely accused of performing certain kinds of gender-affirming surgery on young children.   Although no one tagged Musk, X's most influential user, he has interacted with the account that shared Alexandra's post multiple times in the past.   \"Having Elon Musk as part of this — I can imagine that for the employers in this case, they could see how it could potentially escalate,\" Trottier said.   Alexandra agreed, \"If they did this in real life and I was physically in an office, they [employer] wouldn't be like 'oh, you're fired here.'\"   \n   She said, \"They wouldn't do that. They would say 'no, you guys are crazy — like, what are you talking about? And why are you here?'\"   \"They're only worried because of the exposure of that page on Twitter and Elon being part of it,\" she said.   While busy exposing other people, many of the online activists appeared to have no desire to unmask themselves. The large account that highlighted Alexandra is run anonymously. The account and its followers tried to pressure one employer when, according to a screenshot, the employer asked for the name, business address and phone number of the person writing in to complain before they would provide an update.   \"Is this an attempt at intimidation or a threat?\" an anonymous sender wrote in the screenshot. The large X account called for more pressure.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The large account that highlighted Alexandra's private information is run anonymously.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   The employer, a real estate company, did not respond to NPR's requests for comment. No one associated with the X account that shared Alexandra's post responded to NPR's requests for comment.   Consequences   Although the rapid succession of reports about people being fired for their posts about Kirk's death seems more widespread than in other instances, it's not yet clear exactly how many people have been affected, and how often such campaigns manage to get people fired. At least one of the databases that compiled information about Kirk-related social media posts and their authors is no longer online. Self-proclaimed hackers claimed responsibility for taking the site down though it's not possible to verify their claims.   Employers have responded to campaigns in different ways. In one case NPR was able to verify, a public institution resisted disciplining a staff member despite pressure from multiple branches of local government. The staffer in question is a survivor of a mass shooting and posted a meme critiquing Kirk's support for gun rights. Meanwhile other staff members at other public institutions have been fired for making similar critiques, some of whom had family and friends who survived gun violence.   \n   A review of the timeline of the X account that highlighted Alexandra shows that it targeted at least 150 people for their speech about Charlie Kirk between Sept 10 to Sept 19. It flagged outcomes of their campaigns for just 13 cases, of which NPR was able to verify 12. Ten employers fired their employees, and two — one state legislator and one pet store owner — issued statements standing behind the employee.   In several other cases, employers did not respond even as the X account posted repeatedly, doubling down on its pressure campaign.   The kinds of consequences people should face for making unpopular or distasteful statements has often been ambiguous in previous naming and shaming campaigns, Trottier said. But what's notable this time, he said, was the explicit focus on firing people.   \"I don't think there is much controversy in the idea that the notion of proportionality is out the window,\" Trottier said.   \n   Nine days after Kirk was killed, the large X account stopped calling for people to get fired over their posts about Charlie Kirk. President Trump announced he wanted to hike visa fees on immigrant workers and the account moved onto critiquing the visa system.   Alexandra has not moved on. Having returned to her apartment, she continues to worry about her safety. \"There was a guy standing on the roof across the street from my house. And normally there's not usually people there. And normally it wouldn't really, really faze me. But I lowered my shades.\" She's appealed to X to take down the post about her to no success, and she has been seeking legal help.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Alexandra continues to worry about her safety.\n                \n                    Keren Carrión/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Keren Carrión/NPR\n    \n\n   \n   Alexandra said she has warned friends about posting online. \"I probably was on social media too much. So okay, you win. I'm not going to post more things on the internet.\" She took down photos of herself, made her Facebook posts non-public and archived the post that got her fired.   \n   But she's worried about the larger chilling effects on speech. \"Where does this stop? What if I went to a protest? And what if I made a sign that somebody took a picture of and they didn't like it?\"   NPR's Jude Joffe-Block contributed reporting   Have a tip? NPR's Huo Jingnan can be contacted through encrypted communications at _J_H.07 on Signal.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "She posted about Charlie Kirk's death. Within eight hours, she was fired",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2530+0+430/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8a%2F17%2F0a583b5b4dff8281a3a063e2c3ca%2Fonline-vigilantism-final.jpeg"
      ],
      "datePublished": "2025-10-11T09:00:00.000Z",
      "dateModified": "2025-10-11T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]