[
  {
    "title": "Politics chat: East Wing demolition, sanctions on Russia, redistricting",
    "url": "https://www.npr.org/2025/10/26/nx-s1-5583976/politics-chat-east-wing-demolition-sanctions-on-russia-redistricting",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-26T12:02:36.000Z",
    "description": "\n      President Trump visits Asia this week to work on trade deals with allies and to try pushing a deal with China.   \n\n    AYESHA RASCOE, HOST:  Pr",
    "body": "\n      President Trump visits Asia this week to work on trade deals with allies and to try pushing a deal with China.   \n\n    AYESHA RASCOE, HOST:  President Trump is in Asia this week, leaving behind a government shutdown and a demolition site at the White House. The East Wing has been torn down to make room for something Trump says he really wants - a new massive ballroom.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Sir, this is the White House. You're the president of the United States. You can do anything you want.RASCOE: That's Trump earlier this month on what advisers told him about making this project happen. Joining me now is NPR senior political correspondent Mara Liasson. Good morning, Mara.MARA LIASSON, BYLINE: Good morning.RASCOE: So before we get into the Asia trip, you saw the White House up close this week. What are you going to miss about the East Wing?LIASSON: The East Wing was beautiful and historic. It was a magical way to enter the White House for a Christmas party or another event. But that clip you just played, where Trump was talking to donors at a dinner to thank them for the funds to make his ballroom dreams come true, pretty much sums up his approach to power. He says, when you're president of the United States, you can do anything you want, and this is what he wants to do.RASCOE: Well, another thing he wants to do is finalize trade deals with Japan and South Korea this week and make a deal with China's leader, Xi Jinping. The two are set to meet at the Asia Pacific Economic Cooperation summit in South Korea. How hard will it be for Trump to get an agreement with Xi?LIASSON: It could be hard. This is the most high-stakes meeting Trump has had this term, with the potential to benefit the U.S. economy or make it worse. And China is a very powerful interlocuter. As Trump would say, China has a lot of cards, and they've been playing them - refusing to sell raw earth materials, not buying any soybeans from the United States.And on Air Force One on his way to Asia, Trump said, they'll have to make concessions, and we will, too. And the big question is, which concessions will Trump make? Will he let China buy more advanced semiconductor chips, which some national security experts say would be dangerous? Or would he say the U.S. opposes Taiwanese independence? China wants that. He's already held up a $400 million arms package to Taiwan. And what would he get in exchange? Would China start buying soybeans again? Would it resume rare earth material trade?And today on - this week on ABC, treasury secretary Scott Bessent said what he thinks will happen - what will be in a deal - he said that China had, quote, \"threatened to put a global exporting license regime on rare earths\", and he said, I believe they are going to delay that for a year while they reexamine it. Now, the Chinese readout of that meeting between Bessent and Chinese officials did not say there would be a delay in the rare earth pause. So we don't have any details yet.RASCOE: Trump has been focused on foreign relations lately. And he did something unexpected last week. He put sanctions on two Russian oil companies. What more can you tell us about why Trump decided to do this now?LIASSON: He decided to do it 'cause he was frustrated with Vladimir Putin. This is the first time in this term that he's done anything to pressure Russia other than just rhetorically. Sanctions will hurt the Russian economy, but they're not as powerful as Tomahawk missiles. That's what Ukraine wanted from the U.S., and the president appears to have ruled that out.RASCOE: I wanted to ask you about the redistricting push President Trump kicked off this year by getting Texas to redraw its maps to favor Republicans. Now it looks like Virginia lawmakers are holding a special session tomorrow to talk about redrawing its congressional maps to favor Democrats.LIASSON: That's right. Trump really kicked of a kind of cycle of tit for tat in partisan gerrymandering. California Democrats already are taking their redistricting plans to voters. Illinois and Maryland, two more blue states, are considering options to give Democrats more advantages. And that follows successful Republican efforts to redraw maps in North Carolina and Missouri. More red states are going to do the same.And I think all of this could mean that this mid-decade redistricting or partisan gerrymandering becomes a new normal. And in this game, the Republican party has the advantage because they control more governorships and state houses in the same state and because Republican voters are sprinkled more efficiently for electoral purposes throughout the heartland. Democratic voters tend to be more clustered inefficiently for electoral purposes in urban areas and along the coast, so they are much easier to gerrymander.RASCOE: OK, today is the 26th day of the government shutdown. That's the other big thing happening. And still no movement toward negotiations. This is now the second-longest shutdown in U.S. history. What are your thoughts?LIASSON: I have never covered a shutdown where both sides sincerely believe they have the political advantage.  One of them has to be wrong. Polls show more voters do blame Republicans for the shutdown. They are the party in power, but the Republicans are confident that they can pin this on the Democrats.As far as where do we go from here, there is no more center anymore in Congress. There's no kind of overlap between a group of conservative Democrats and moderate Republicans. In the past, that's where deals were hashed out between the parties. The only solution now is if President Trump calls Democrats to the White House for negotiations, but he says he is not going to do that until they vote to open the government.RASCOE: That's NPR senior national political correspondent Mara Liasson. Thank you, Mara.LIASSON: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Politics chat: East Wing demolition, sanctions on Russia, redistricting",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-26T12:02:36.000Z",
      "dateModified": "2025-10-26T12:02:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why public media giants NPR and CPB are fighting in court this week",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5586147/npr-cpb-lawsuit-political-pressure",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2980x1676+0+151/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2Fb6%2Fa5dea3824553b1604439d6759c32%2Fgettyimages-180967640.jpg",
    "tag": "Politics",
    "date": "2025-10-27T10:26:54.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The headquarters for National Public Rad",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The headquarters for National Public Radio, or NPR, are seen in Washington, DC, September 17, 2013.\n                \n                    SAUL LOEB/AFP via Getty Images/AFP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        SAUL LOEB/AFP via Getty Images/AFP\n    \n\n   \n   The chasm is widening between NPR and the Corporation for Public Broadcasting, the nonprofit that funneled federal dollars to public media until Congress killed that funding earlier this year.   NPR's legal team privately questioned the CPB's longtime chief executive, Patricia Harrison, under oath earlier this month, according to the radio network's legal filings, and is scheduled to do so publicly at a court hearing Tuesday morning.   In court documents, NPR has presented evidence to bolster its case that the board of the nonprofit corporation first approved a multiyear, multimillion-dollar contract for NPR to operate a satellite distribution system for public radio stations. Then, NPR alleges, CPB unlawfully yielded to political pressure by yanking the contract just days after President Trump warned that NPR should receive no more federal dollars. NPR contends it is yet one more example of a major institution yielding to the president's whim.   \n   CPB rejects that, saying that it awarded the contract to a different group to better serve the nation's diverse array of public radio stations. NPR and CPB each declined comment for this story, citing the litigation.   The two institutions — along with PBS — have stood together at the core of public media for more than a half century. They formed a united front, at least publicly, as they lobbied lawmakers against clawing back the $1.1 billion already approved by Congress and signed into law by the president for the broader public media system.   Behind the scenes, however, CPB and PBS officials signaled they would not object to pulling funding for NPR, which has drawn the lion's share of Republicans' accusations of liberal bias.   A White House budget official warns CPB of her \"intense dislike for NPR\"    NPR's legal documents offer the following chronology: In late March and early April, Trump called NPR and PBS \"monsters\" and demanded Congress eliminate federal funds for them.   On April 2, CPB's board directed officials to negotiate the fine print of a contract with NPR to operate the satellite for the next three years, according to NPR's filings. The radio network has operated the system, through which local radio stations receive and share programs, podcasts and other content, for four decades.   \n   Two days later, a senior White House budget official met with three CPB executives.   \"It would be a shame to throw the baby out with the bath water,\" the administration official, Katherine Sullivan, said, according to accounts from CPB officials cited by NPR in its legal filings. She suggested CPB could salvage its future and relayed her \"intense dislike for NPR,\" Harrison wrote to NPR CEO Katherine Maher a few days later, according to NPR's recent filings in the case.   Harrison expressed deep fears that the White House could take an ax to CPB and public media more broadly. \"These rumors have potential to turn into boy who cried wolf,\" Harrison wrote in her email to Maher. \"Except the wolf is really coming.\" Within days, CPB's board moved to direct executives to refashion the terms of the contract so it could only be granted to an entity that stood entirely apart from NPR.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Patricia Harrison, right, accepts the Governors Award on behalf of the Corporation for Public Broadcasting (CPB) from Henry Louis Gates Jr. during the Television Academy's 2025 Creative Arts Emmy Awards on Sept. 7, 2025.\n                \n                    Phil McCarten/Phil McCarten/Invision/AP/Invision\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Phil McCarten/Phil McCarten/Invision/AP/Invision\n    \n\n   \n   Even as they moved to sever the NPR contract, and linked the decision privately to the political climate, court documents show several CPB executives told a newly hired Republican consultant they could not simply announce they were withdrawing the satellite contract from NPR to appease the White House.   \"There are obvious political challenges, but we can't 'own that' outright,\" Debra Sanchez, CPB's chief of staff, wrote to the Republican consultant, Carl Forti, in one of several such exchanges captured in NPR's court filings. \"So we are in a tight spot sort of. What are the strongest messages we can make about the 'why' or the 'because?'\"   For all those efforts, when Trump and his Republican allies in Congress stripped public media of subsidies, it was the beginning of the end of CPB. The nonprofit laid off most of its staff last month and expects to shut down in January. Layoffs also have ensued at PBS and many public media stations.   \n   NPR and CPB are battling in court over a separate pot of money, worth tens of millions of dollars, to operate the satellite system.   CPB argues NPR and public media stations may have separate interests   CPB argues that NPR is wrongfully acting as though it is entitled to operate the satellite in perpetuity. Its legal team has waved off NPR's arguments that it acted due to political pressure. Instead, CPB contends that, with the elimination of federal subsidies, the radio network's interests may diverge from those of local public media stations. CPB's lawyers say the decision to grant the contract to another group is intended to ensure that stations' long-term interests are protected.   The offer pulled from NPR — a three-year contract worth nearly $36 million — pales in comparison to the new one announced in September. That one is valued at $57 million over five years. CPB has awarded it to a consortium that includes New York Public Radio, American Public Media, the National Federation of Community Broadcasters and a consulting firm called the Station Resource Group, among them. It is called Public Media Infrastructure, reviving the dormant nonprofit Public Radio International.   Earlier this month, Harrison told officials at public media stations receiving a final round of federal grants that she would be compelled to reveal unflattering critiques of NPR's leadership as a result of the litigation.   \"As this lawsuit moves forward, CPB will be required to place into the public record evidence of its concerns and the concerns of others about NPR's management, its resistance to innovation and reforms that many in our system have urged it to undertake, and its repeated dismissal of the importance of the federal appropriation that sustains public media,\" Harrison warned Oct. 13 in an email to station officials.   In court filings, CPB says the April decision came \"after decades of studies by outside consultants\" and embodied \"a strategy of having an independent entity that was more inclusive of the broad range of public media entities across the country\" than NPR.   \n   NPR alleges political pressure behind a change of mind   By NPR's telling, the allegations represent a case study in what happens when institutions wilt under the president's unprecedented exercise of executive authority. CPB and the Trump administration are co-defendants in this case, which was filed by NPR and three Colorado public radio stations over Trump's executive order which sought to simply order the ending of all federal funding for public media. Yet CPB earlier sued Trump over his efforts to oust its board members, calling that unconstitutional.   As CPB pulled back from the contract understanding with NPR, Sanchez hired Forti, the Republican consultant. On his first day on the job, April 10, he wrote a memo defining CPB's challenge as he saw it: \"BIAS: Belief both in Administration and among general public that the media is biased against conservatives and more specifically against Trump. NPR is high on those lists.\"   That same day, Trump posted online: \"NO MORE FUNDING FOR NPR, A TOTAL SCAM!\"   On April 14 — the same day that news broke that Trump would formally request Congress to rescind all future funding for CPB — CPB Chief Operating Officer Kathy Merritt called her counterpart at NPR, Ryan Merkley, to say the board had changed course. It would no longer award federal money to operate the public radio satellite and distribution system unless it were spun off NPR.   On Capitol Hill, as Trump's push to eliminate all federal subsidies for public radio, CPB executives mapped out a strategy to appeal to Republican Senators John Barrasso of Wyoming and Shelley Moore Capito of West Virginia — red states where statewide public media networks carry broad appeal. (CPB's board chair had previously headed Wyoming PBS.)    But it was to no avail. The senators voted along with all but two of their Republican colleagues to successfully eliminate all funding for public media — helping to seal the fate of CPB.   \n   Disclosure: This story was reported and written by NPR media correspondent David Folkenflik. It was edited by Deputy Business Editor Emily Kopp and Managing Editors Gerry Holmes and Vickie Walton-James. Under NPR's protocol for reporting on itself, no NPR corporate official or news executive reviewed this story before it was posted publicly.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why public media giants NPR and CPB are fighting in court this week",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2980x1676+0+151/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2Fb6%2Fa5dea3824553b1604439d6759c32%2Fgettyimages-180967640.jpg"
      ],
      "datePublished": "2025-10-27T10:26:54.000Z",
      "dateModified": "2025-10-27T10:26:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump attends ceasefire ceremony with Thailand and Cambodia during Malaysia visit",
    "url": "https://www.npr.org/2025/10/26/nx-s1-5586583/trump-ceasefire-ceremony-thailand-cambodia-malaysia-visit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7452x4192+0+388/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F64%2F8b6468bd4c4299a39cf6669b31de%2Fap25299185444404.jpg",
    "tag": "Politics",
    "date": "2025-10-26T07:41:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Malaysia's Prime Minister Anwar Ibrahim,",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Malaysia's Prime Minister Anwar Ibrahim, left, and U.S. President Donald Trump, right, watch as Thailand's Prime Minister Anutin Charnvirakul, second left, and Cambodia's Prime Minister Hun Manet hold up a document after the ceremonial signing of a ceasefire agreement between Thailand and Cambodia on the sidelines of the 47th Association of Southeast Asian Nations (ASEAN) summit in Kuala Lumpur, Malaysia, Sunday, Oct. 26, 2025.\n                \n                    Mohd Rasfan/POOL AFP/ AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mohd Rasfan/POOL AFP/ AP\n    \n\n   \n   KUALA LUMPUR, Malaysia — Thailand and Cambodia signed an expanded ceasefire agreement on Sunday during a ceremony attended by U.S. President Donald Trump, whose threats of economic pressure prodded the two nations to halt skirmishes along their disputed border earlier this year.   \n   Thailand will release Cambodian prisoners and Cambodia will begin withdrawing heavy artillery as part of the first phase of the deal. Regional observers will monitor the situation to ensure fighting doesn't restart.   \"We did something that a lot of people said couldn't be done,\" Trump said. Cambodian Prime Minister Hun Manet called it a \"historic day,\" and Thai Prime Minister Anutin Charnvirakul said the agreement creates \"the building blocks for a lasting peace.\"   The ceremony was Trump's first event after arriving at the annual summit of the Association of Southeast Asian Nations, hosted in Kuala Lumpur. The trip, which will continue with visits to Japan and South Korea and a potential meeting with Chinese leader Xi Jinping, is an opportunity for Trump to burnish his reputation as an international dealmaker at a time when his tariffs have scrambled the international economy and he's feuding with Democrats over a government shutdown back home.   \n   Trump touched down in the Malaysian capital shortly before 0200 GMT, where he performed his trademark campaign trail dance with local performers and waved an American flag in one hand and a Malaysian flag in the other.   \n   The president signed economic agreements with Cambodia, Thailand and Malaysia, some of them aimed at increasing trade involving critical minerals. The U.S. wants to rely less on China, which has limited exports of key components in technology manufacturing.   \"It's very important that we cooperate as willing partners with each other to ensure that we can have smooth supply chains, secure supply chains, for the quality of life, for our people and security,\" said U.S. Trade Representative Jamieson Greer.   Trump reengages with a key region of the world   The president attended this summit only once during his first term, and Defense Secretary Pete Hegseth seemed unfamiliar with ASEAN during his confirmation hearing in January.   But this year's event was a chance for Trump to reengage with a collection of nations that has a combined $3.8 trillion economy and 680 million people.   \"The United States is with you 100%, and we intend to be a strong partner and friend for many generations to come,\" Trump said. He described his counterparts as \"spectacular leaders\" and said, \"everything you touch turns to gold.\"   \n   The summit also allowed Trump to play global peacemaker with Thailand and Cambodia, which have competing territorial claims that result in periodic violence along their border. Some of the worst modern fighting between the two countries took place over five days in July, killing dozens and displacing hundreds of thousands of people, some of the worst modern fighting between the two countries.   Trump threatened, at the time, to withhold trade agreements unless the fighting stopped in a display of economic leverage credited with spurring negotiations. A shaky truce has persisted since then.   \"The fact that Trump was holding the tariff card was actually very, very significant,\" said Ou Virak, president of Phnom Penh's Future Forum think tank. \"That's probably the main reason, if not the only reason, but definitely the main reason why the two sides agreed immediately to the ceasefire.\"   Now, he said, \"there's a ceremony for Trump to be in front of cameras\" so he can be \"seen as the champion that brings an end to wars and conflicts,\" giving him \"more ammunition for his bid for Nobel Peace Prize.\"   Trump has explicitly campaigned for the honor, continuously adding to a list of conflicts that he either helped resolve or claims to have ended.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. President Donald Trump attends the ceremonial signing of a ceasefire agreement between Thailand and Cambodia on the sidelines of the 47th Association of Southeast Asian Nations (ASEAN) summit in Kuala Lumpur, Malaysia, Sunday, Oct. 26, 2025.\n                \n                    Mohd Rasfan/POOL AFP/ AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mohd Rasfan/POOL AFP/ AP\n    \n\n   \n   Malaysian Prime Minister Anwar Ibrahim praised the agreement between Thailand and Cambodia during opening remarks at the summit, saying, \"it reminds us that reconciliation is not concession, but an act of courage.\"   Thai foreign ministry spokesperson Nikorndej Balankura described the deal on Saturday as a \"joint declaration\" that will show Thailand and Cambodia \"are committed to renewing their relations.\"   \"It's not an end in itself,\" Nikorndej said. \"Work has just begun.\"   Tariffs are in focus on Trump's trip   Trump is expected to sit down with Brazilian President Luiz Inácio Lula da Silva while he's in Kuala Lumpur, but not Canadian Prime Minister Mark Carney. The U.S. leader is angry with Canada because of a television ad protesting his tariffs, and on his way to the summit, announced on social media he would hike tariffs on Canada because of it.   \n   Another trade war is front and center on Trump's trip — this one, with China. Trump told reporters traveling with him on Air Force One that he was optimistic his meeting with Xi, expected to take place in South Korea, could yield progress on a range of issues. Fentanyl trafficking and soybean sales are among Trump's priorities.   \"I think we have a really good chance of making a very comprehensive deal,\" Trump said. \"I want our farmers to be taken care of. And he wants things also.\"   It remains to be seen whether Trump's dealmaking addresses longstanding issues or puts them off for another day.   U.S. Treasury Secretary Scott Bessent suggested Sunday that Washington and Beijing could step back from their confrontation instead of pushing forward with higher tariffs by America and export restrictions on rare earth elements by China.   When asked if the two countries could extend the trade truce from earlier this year, Bessent said: \"I would say yes.\" However, he emphasized that the final decision would be up to Trump.   Trump has expressed confidence about the prospect of finalizing trade agreements with Japan and South Korea, two longstanding allies and trading partners, during the trip.   \"We have deals with a lot of people and they're very good deals,\" he told reporters traveling with him on Air Force One.   One leader who was absent from the summit in Kuala Lumpur is Indian Prime Minister Narendra Modi. Although he was close with Trump during his first term, the relationship has been more tense lately. Trump caused irritation by boasting that he settled a recent conflict between India and Pakistan, and he has increased tariffs on India for its purchase of Russian oil.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump attends ceasefire ceremony with Thailand and Cambodia during Malaysia visit",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7452x4192+0+388/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F64%2F8b6468bd4c4299a39cf6669b31de%2Fap25299185444404.jpg"
      ],
      "datePublished": "2025-10-26T07:41:12.000Z",
      "dateModified": "2025-10-26T07:41:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The White House movie theater demolition ends a storied era in presidential history",
    "url": "https://www.npr.org/2025/10/25/nx-s1-5586110/white-house-movie-theater-cultural-history-demolition",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3500x1969+0+182/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2F36%2F8aa0bb5644e59099d50ffb62a269%2Fgettyimages-86505206.jpg",
    "tag": "Politics",
    "date": "2025-10-25T22:23:07.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former President Barack Obama and first ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former President Barack Obama and first lady Michelle Obama wear 3-D glasses during a Super Bowl party in the White House Family Theater in 2009.\n                \n                    The White House/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        The White House/Getty Images\n    \n\n   \n   It was, on occasion, used by presidents to rehearse important speeches such as the State of the Union address; and at other times, as a spot for visitors to dump their hats, bags and coats. But for more than 80 years, the White House movie theater was mostly a place where the first family and their guests went for entertainment.   Demolition began this week of the White House Family Theater — along with the rest of the White House's East Wing where the snug, shoe-box-shaped auditorium was located — to make way for a new $300 million ballroom. It marks the end of an era in American movie theater history.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An excavator works to clear rubble on Thursday after the East Wing of the White House was demolished in Washington, D.C. The historic White House Family Theater was destroyed as part of President Trump's effort to make way for a new ballroom.\n                \n                    Eric Lee/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Eric Lee/Getty Images\n    \n\n   \n   Since its conversion from a cloakroom by Franklin Roosevelt in 1942, the private, 40-ish-seat theater has screened everything from newsreels and documentaries to westerns and musicals. It has been through several facelifts, most recently ditching cream and red floral curtains, and beige walls and seating for all-round \"movie-palace red\" ornamented with gold molding and dark wood trim following a renovation overseen by first lady Laura Bush in 2004.   \n   \"The best perk of the White House is not Air Force One or Camp David or anything else, it's the wonderful movie theater I get here,\" then-President Bill Clinton told film critic Roger Ebert in a 1999 interview.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                April 14, 1989: President George Bush and first lady Barbara Bush host a screening in the White House movie theater. The first lady is sharing a seat with her grandson Jebbie Bush.\n                \n                    George Bush Presidential Library and Museum/NARA\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        George Bush Presidential Library and Museum/NARA\n    \n\n   \n   Jimmy Carter was also a big fan. In a single term, the 39th president screened at least 400 films between this venue and Camp David, starting with All the President's Men — a movie about the Watergate scandal — soon after he was sworn in. Richard Nixon saw Patton, about the controversial World War II Gen. George S. Patton, multiple times during the Vietnam War. Barack Obama's many screenings at the theater ranged from Mandela: Long Walk to Freedom and Selma to Julie & Julia and Star Wars Rogue One. President Trump's picks have included Finding Dory and Sunset Boulevard. John F. Kennedy, who loved James Bond movies, saw From Russia With Love the day before he was assassinated in 1963.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. first lady Melania Trump (R) and then education secretary Betsy DeVos host students for a screening of the motion picture 'Wonder' in the White House movie theater in 2018.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   Not all U.S. presidents were film buffs. According to a 1997 New York Times interview with Paul Fischer, who served as the White House's projectionist from the 1950s to the '80s, Lyndon B. Johnson slept through most screenings. (Fischer kept careful logs of all of the movies shown at the theater. A sample from Kennedy's White House years can be seen here.)   \n   \"It was a place for the president to watch what America was watching,\" said Matt Lambros, who authored several books about historic movie theaters, in an interview with NPR. \"To have it destroyed is bulldozing a piece of American history.\"   The White House did not respond to NPR's request for comment, nor confirm reports from other media outlets about plans to build a new movie theater as part of the East Wing's redevelopment.   \"We're just going off of their word that a theater will be rebuilt,\" said Lambros. \"I hope that's the case, and the next hundred years of presidents can enjoy it.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The White House movie theater demolition ends a storied era in presidential history",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3500x1969+0+182/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2F36%2F8aa0bb5644e59099d50ffb62a269%2Fgettyimages-86505206.jpg"
      ],
      "datePublished": "2025-10-25T22:23:07.000Z",
      "dateModified": "2025-10-25T22:23:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Kevin Kiley, R-Calif., is at work every day. He wants his colleagues there too",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5586745/rep-kevin-kiley-r-calif-is-at-work-every-day-he-wants-his-colleagues-there-too",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-27T09:00:28.000Z",
    "description": "Rep. Kevin Kiley, R-Calif., is at work every day. He wants his colleagues there too   NPR's Michel Martin speaks with Rep. Kevin Kiley, R-Calif., who ",
    "body": "Rep. Kevin Kiley, R-Calif., is at work every day. He wants his colleagues there too   NPR's Michel Martin speaks with Rep. Kevin Kiley, R-Calif., who has been working from his Capitol Hill office throughout the shutdown. He's trying to persuade his colleagues to do the same.\n\n    \n        Politics\n    \n\n\n                  \n            October 27, 20255:00 AM ET\n         \n      \n\n      \n      Rep. Kevin Kiley, R-Calif., is at work every day. He wants his colleagues there too\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5586745/nx-s1-9507394\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n\n      NPR's Michel Martin speaks with Rep. Kevin Kiley, R-Calif., who has been working from his Capitol Hill office throughout the shutdown. He's trying to persuade his colleagues to do the same.   \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Kevin Kiley, R-Calif., is at work every day. He wants his colleagues there too",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-27T09:00:28.000Z",
      "dateModified": "2025-10-27T09:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former deputy secretary of state talks about Trump's visit to Asia",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5584963/former-deputy-secretary-of-state-talks-about-trumps-visit-to-asia",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-27T10:57:06.000Z",
    "description": "\n      \n      Former deputy secretary of state talks about Trump's visit to Asia\n    \n        \n                Download\n                \n             ",
    "body": "\n      \n      Former deputy secretary of state talks about Trump's visit to Asia\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5584963/nx-s1-9507436\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Michel Martin speaks with former Deputy Secretary of State Kurt Campbell about President Trump's visit to Asia, where he's looking to make deals and contain the rising influence of China.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former deputy secretary of state talks about Trump's visit to Asia",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-27T10:57:06.000Z",
      "dateModified": "2025-10-27T10:57:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northern California to decide on redistricting, potentially benefiting Democrats",
    "url": "https://www.npr.org/2025/10/25/nx-s1-5581322/northern-california-to-decide-on-redistricting-potentially-benefiting-democrats",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-25T11:42:41.000Z",
    "description": "\n      In Northern California, congressional districts could be redrawn by a vote on Election Day. Republicans say they're victims of the national red",
    "body": "\n      In Northern California, congressional districts could be redrawn by a vote on Election Day. Republicans say they're victims of the national redistricting fight, while Democrats blame President Trump.   \n\n    SCOTT SIMON, HOST:  In just over a week, voters in California face a question that could determine who controls Congress after the 2026 midterm elections. They're deciding if the state should redistrict, giving Democrats an edge to win five more seats in the narrowly divided U.S. House. Now, this vote comes in response to President Trump encouraging Texas to redraw lines to favor Republicans. CapRadio's Laura Fitzgerald reports from a part of California where Republicans could lose out.LAURA FITZGERALD, BYLINE: Loomis, California, is a suburban town of about 7,000 people outside of Sacramento. It's a red area, represented by a Republican in Congress. But under the redistricting map on the ballot in the November 4 election, voters there would be divided and drawn into districts likely to elect Democrats. Amanda Cortez is a Republican on the town council organizing opposition.AMANDA CORTEZ: We want to keep our communities that are like together, right? And so if we get sucked into Sacramento or, you know, somewhere, we don't share the same needs, right?CORTEZ: This area has lots of single-family homes on either side of a major freeway and faces suburban issues, like traffic getting in and out, rapid development and high gas prices. Mike Murray (ph) also lives in the area, and he's involved in his county's Republican club. He's voting no on the measure, called Prop 50, because he says his future votes for Congress will be swamped by the Democratic votes in nearby Sacramento.MIKE MURRAY: If we wanted to live in an urban community with the problems and the benefits of an urban community, we would. But we choose to live here. And when we choose to live here, we hope that somebody will represent us and our way of life.FITZGERALD: Usually, states redistrict at the start of the decade, when the census comes out, but California Republicans could end up paying the price for the redistricting battle that President Trump has set off around the country now. Murray says, for him, this isn't about national politics or redistricting in other states.MURRAY: My concern has always been on our community and our representation. When things are wrong in other places, doing things wrong here, it's not the way to go. Hey, this is something you teach your kids. Two wrongs don't make it right.FITZGERALD: But Trump did get Texas to write a new map that could flip five more seats to Republican candidates. So California's Democratic leaders say they drew their map to flip five seats for Democrats and counter Texas. Eric Schickler is a co-director at the Institute of Governmental Studies at the University of California Berkeley. He says opponents to California's redistricting are concerned it'll sideline the state's Independent Redistricting Commission that's helped give their communities a voice.ERIC SCHICKLER: The basic argument made by opponents of Prop 50 is that the nonpartisan process, you know, has worked well for the state. It's given rise to more competitive elections.FITZGERALD: But for proponents, mainly Democrats, it's about Congress and the Trump administration.SCHICKLER: To the extent that voters care about having a check on President Trump - well, you need a Democratic house to do that, is the argument that Democrats are making.FITZGERALD: In the town of Truckee, a blue dot in the same red congressional district as Loomis, Democrats were wrapping up a meeting to organize for Prop 50. Cyan Samone sees redistricting as a chance to counteract Trump's immigration crackdown.(CROSSTALK)CYAN SAMONE: I have a lot of friends who are immigrants from different countries who have left authoritarian regimes. And you see the patterns, and you just don't want to see that happen here. And I don't want to have to see people who fled terrible situations having to run again.FITZGERALD: Her husband, Ben Woodard (ph), says redistricting could mean Democrats are able to elect a representative that'll pay more attention to what his community needs.BEN WOODARD: I think that the Democratic Party representative would do that and would look over our interests, like, you know, the cuts to Medicare definitely impacted rural health care.FITZGERALD: The proponents appear to have the upper hand heading into the November 4 election. It's a state where most voters are Democrats, and they see this election as part of a national struggle.For NPR News, I'm Laura Fitzgerald in Sacramento.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northern California to decide on redistricting, potentially benefiting Democrats",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-25T11:42:41.000Z",
      "dateModified": "2025-10-25T11:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US and China say trade deal drawing closer as Trump and Xi prepare for meeting",
    "url": "https://www.npr.org/2025/10/26/nx-s1-5586646/us-china-trade-deal-drawing-closer",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5312x2988+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Fbf%2Fb2a9b3214ec09da0abda740b74c6%2Fap25299262157006.jpg",
    "tag": "Politics",
    "date": "2025-10-26T15:18:38.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump addresses during ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump addresses during the ASEAN US Summit in Kuala Lumpur, Malaysia, Sunday, Oct. 26, 2025.\n                \n                    Vincent Thian//AP POOL\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Vincent Thian//AP POOL\n    \n\n   \n   KUALA LUMPUR, Malaysia — A trade deal between the United States and China is drawing closer, officials from the world's two largest economies said Sunday as they reached an initial consensus for President Donald Trump and Chinese leader Xi Jinping to aim to finalize during their high-stakes meeting.   Any agreement would be a relief to international markets even it does not address underlying issues involving manufacturing imbalances and access to state-of-the-art computer chips.   \n   Beijing recently limited exports of rare earth elements that are needed for advanced technologies, and Trump responded by threatening additional tariffs on Chinese products. The prospect of a widening conflict risked weakening economic growth worldwide.   China's top trade negotiator, Li Chenggang, told reporters that the two sides had reached a \"preliminary consensus,\" while Trump's treasury secretary, Scott Bessent, said there was \"a very successful framework.\"   Trump also expressed confidence that an agreement was at hand, saying the Chinese \"want to make a deal and we want to make a deal.\" The Republican president is set to meet with Xi on Thursday in South Korea, the final stop of his trip through Asia. Trump reiterated that he plans to visit China in the future and suggested that Xi could come to Washington or Mar-a-Lago, Trump's private club in Florida.   \n   Bessent told CBS' \"Face the Nation\" that the threat of additional higher tariffs on China was \"effectively off the table.\" In interviews on several American news shows, he said discussions with China yielded initial agreements to stop the precursor chemicals for fentanyl from coming into the U.S., and that Beijing would make \"substantial\" purchases of soybean and other agricultural products while putting off export controls on rare earths.   The progress toward a potential agreement came during the annual summit of the Association of Southeast Asian Nations, in Kuala Lumpur, with Trump seeking to burnish his reputation as an international dealmaker.   Yet his way of pursuing deals has meant serious disruptions at home and abroad. His import taxes have scrambled relationships with trading partners while a U.S. government shutdown has him feuding with Democrats.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                United States Secretary of the Treasury Scott Bessent reacts during a meeting between President Donald Trump and Brazil's President Luiz Inacio Lula da Silva on the sidelines of the ASEAN Summit in Kuala Lumpur, Malaysia, Sunday, Oct. 26, 2025.\n                \n                    Mark Schiefelbein/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Schiefelbein/AP\n    \n\n   \n   Trump attends ceasefire ceremony between Thailand and Cambodia   At the summit, Thailand and Cambodia signed an expanded ceasefire agreement during a ceremony attended by Trump. His threats of economic pressure prodded the two nations to halt skirmishes along their disputed border earlier this year.   Thailand will release Cambodian prisoners and Cambodia will begin withdrawing heavy artillery as part of the first phase of the deal. Regional observers will monitor the situation to ensure fighting doesn't restart.   \n   \"We did something that a lot of people said couldn't be done,\" Trump said. Cambodian Prime Minister Hun Manet called it a \"historic day,\" and Thai Prime Minister Anutin Charnvirakul said the agreement creates \"the building blocks for a lasting peace.\"   The president signed economic frameworks with Cambodia, Thailand and Malaysia, some of them aimed at increasing trade involving critical minerals. The United States wants to rely less on China, which has used limited on exports of key components in technology manufacturing as a bargaining chip in trade talks.   \n   \"It's very important that we cooperate as willing partners with each other to ensure that we can have smooth supply chains, secure supply chains, for the quality of life, for our people and security,\" U.S. Trade Representative Jamieson Greer said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, centre left, poses with other leaders during the ASEAN US Summit in Kuala Lumpur, Malaysia, Sunday, Oct. 26, 2025.\n                \n                    Vincent Thian/AP POOL\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Vincent Thian/AP POOL\n    \n\n   \n   Trump reengages with a key region of the world   Trump attended this summit only once during his first term, and U.S. Defense Secretary Pete Hegseth seemed unfamiliar with ASEAN during his confirmation hearing in January.   This year's event was a chance for Trump to reengage with nations that have a combined $3.8 trillion economy and 680 million people.   \"The United States is with you 100%, and we intend to be a strong partner and friend for many generations to come,\" Trump said. He described his counterparts as \"spectacular leaders\" and said that \"everything you touch turns to gold.\"   Trump's tariff threats were credited with helping spur negotiations Thailand and Cambodia. Some of the worst modern fighting between the two countries took place over five days in July, killing dozens and displacing hundreds of thousands of people.   The president threatened, at the time, to withhold trade agreements unless the fighting stopped. A shaky truce has persisted since then.   Malaysian Prime Minister Anwar Ibrahim praised the agreement between Thailand and Cambodia, saying at the summit that \"it reminds us that reconciliation is not concession, but an act of courage.\"   Tariffs are in focus on Trump's trip   Trump met Brazilian President Luiz Inácio Lula da Silva in Kuala Lumpur, who was also attending the summit. There has been friction between them over Brazil's prosecution of Jair Bolsonaro, the country's former president and a close Trump ally. Bolsonaro was convicted last month of attempting to overturn election results in his country.   During their meeting, Trump said he could reduce tariffs on Brazil that he enacted in a push for leniency for Bolsonaro.   \n   \"I think we should be able to make some good deals for both countries,\" he said.   While Trump was warming to Lula, he avoided Canadian Prime Minister Mark Carney. The president is angry with Canada because of a television advertisement protesting his trade policies, and on his way to the summit, announced on social media he would raise tariffs on Canada because of it.   One leader absent from the summit was Indian Prime Minister Narendra Modi. Although he was close with Trump during Trump's first term, the relationship has been more tense lately. Trump caused irritation by boasting that he settled a recent conflict between India and Pakistan, and he has increased tariffs on India for its purchase of Russian oil.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US and China say trade deal drawing closer as Trump and Xi prepare for meeting",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5312x2988+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Fbf%2Fb2a9b3214ec09da0abda740b74c6%2Fap25299262157006.jpg"
      ],
      "datePublished": "2025-10-26T15:18:38.000Z",
      "dateModified": "2025-10-26T15:18:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What one Texas Republican Congressman tells his constituents about the shutdown",
    "url": "https://www.npr.org/2025/10/25/nx-s1-5581251/what-one-texas-republican-congressman-tells-his-constituents-about-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-25T11:42:54.000Z",
    "description": "\n      The government shutdown is dragging on, with no serious negotiations between the parties. The House is not in session and most members are back",
    "body": "\n      The government shutdown is dragging on, with no serious negotiations between the parties. The House is not in session and most members are back home in their districts, hearing from constituents.   \n\n    SCOTT SIMON, HOST:  There are still no serious negotiations in Congress to bring the government shutdown to a close. The House of Representatives hasn't even had a vote in over a month. NPR congressional correspondent Barbara Sprunt left the halls of the Capitol to find one member in his Texas district. Barbara, thanks for being with us.BARBARA SPRUNT, BYLINE: Thanks for having me.SIMON: I gather you visited Llano, about 90 minutes northwest of Austin. It's represented by Congressman August Pfluger. What did he say to constituents?SPRUNT: Well, he praised Republicans' signature tax and spending bill from earlier this year. It included tax cuts and changes to the Medicaid program, all very popular with this group of about 40 people, including some members of local government. That wasn't a surprise to me. This district went for President Trump in 2024 by 72%. It is a solid red district. He also talked a lot about the shutdown. He said the House did its job in passing a continuing resolution to temporarily fund the government just before they left in mid-September.SIMON: But the House still hasn't returned.SPRUNT: That's right. For now, the speaker isn't bringing the chamber back until Senate Democrats agree to fund the government. And the congressman laid out why he thinks Democrats haven't done that yet. Pfluger said Senate Minority Leader Chuck Schumer needs to look like he's opposing President Trump at every turn.AUGUST PFLUGER: I think he has to look tough to his radical-left base because he's worried about AOC being the next senator from New York, and so he has to be seen as fighting Trump.SPRUNT: Of course, Senate Democrats would put it a bit differently. They say they're trying to force a negotiation on extending ACA subsidies that are set to expire at the end of the year. Pfluger, like his party leadership, says they should fund the government first and then negotiate on the subsidies. So I asked voters at this about the town hall. Carlton Johnson (ph), a Republican, said he has big concerns about health care, but Democrats' message just doesn't resonate with him.CARLTON JOHNSON: What I see is the Democrats trying to hold the country hostage to get what they want. Yeah, I think it's very childish.SIMON: Of course, health care is at the center of why the shutdown continues. More and more states will be feeling the consequences, particularly cuts to nutrition assistance. Did that come up?SPRUNT: It did. Here's the congressman.PFLUGER: I think the food assistance is one that I would put at the very highest level of worry. Can you imagine kids not getting the funding they need?SPRUNT: Now, in Texas, over 3 million people use SNAP benefits, and about 10% of households in Pfluger's district, according to an estimate from the U.S. Census. One constituent told me she's very concerned about kids not getting this assistance, but she hopes that food banks can step up.SIMON: Is that even possible?SPRUNT: Well, I called the CEO of the Central Texas Food Bank to ask exactly that question. Here's Sari Vatske.SARI VATSKE: There is no way that we alone can make up for a $44 million food budget shortfall. We are currently spending $1.3 million per month, which is already up from $1.1 million to purchase food to make up for the increased need. So simply put, we need the government to reopen.SPRUNT: Now, she said that if November SNAP benefits are gone for families in Central Texas, what that means is 127,000 households without those benefits.SIMON: And of course, President Trump hasn't stepped forward to try to broker a deal. What did people there have to say about his involvement?SPRUNT: Well, you know, a few people mentioned wanting to see him step in and play a role. Small business owner Mickey Kasarik (ph) is particularly concerned about these health care premiums skyrocketing without an extension of the subsidies. And he said he wonders where the president is in all of this.MICKEY KASARIK: I mean, he wrote \"The Art Of The Deal,\" right? You know, if he's such a good negotiator and does that, why doesn't he say, let's sit down. Let's find something?SPRUNT: He's a Republican, but he's critical of the president. He says that if Trump stepped in to stop the shutdown, it would be a plus in his book. But the president left for a trip to Asia yesterday, so it's looking unlikely that he'll be sitting down at any negotiating table with Democrats and Republicans anytime soon.SIMON: NPR's Barbara Sprunt. Thanks so much.SPRUNT: Thank you, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What one Texas Republican Congressman tells his constituents about the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-25T11:42:54.000Z",
      "dateModified": "2025-10-25T11:42:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week in Politics: Trump's relations with Latin America and Canada; East Wing demolition",
    "url": "https://www.npr.org/2025/10/25/nx-s1-5583991/week-in-politics-trumps-relations-with-latin-america-and-canada-east-wing-demolition",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-25T11:42:46.000Z",
    "description": "\n      \n      Week in Politics: Trump’s relations with Latin America and Canada; East Wing demolition\n    \n            \n                \n             ",
    "body": "\n      \n      Week in Politics: Trump’s relations with Latin America and Canada; East Wing demolition\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5583991/nx-s1-9506500\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      We discuss President Trump's escalation in Latin America, trade with Canada, and demolition at the White House.   \n\n    SCOTT SIMON, HOST:  There has been a major escalation in President Trump's military actions in Latin America. Yesterday, the Pentagon announced the deployment of the USS Gerald Ford, the world's largest aircraft carrier, just hours after the tenth U.S. strike on alleged drug vessels in the Caribbean and Pacific. NPR senior political contributor Ron Elving joins us. Ron, thanks for being with us.RON ELVING, BYLINE: Good to be with you, Scott.SIMON: The president said there could also be U.S. land strikes. How serious is the situation now?ELVING: It's as serious as it looks and was meant to look. The world's largest aircraft carrier, with 5,000 sailors, scores of aircraft, eight additional warships. You know, some of these small boat operators may begin to feel a bit outgunned. But you have to wonder if it's really all about the drug runners. Let's accept that the 10 blasted on the high seas so far were carrying drugs and were heading this way, although there have been reports raising questions on both counts. Setting those doubts aside, the sheer size of this naval force suggests something else, something like the, quote, \"gunboat diplomacy,\" unquote, the U.S. has practiced as far back as the early 1900s, pressuring regimes in Central America and the Caribbean.SIMON: President Trump said he's halting trade talks with Canada over an ad in Ontario featuring Ronald Reagan, which, by the way, has subsequently been withdrawn. The president called the ad fake. Was it?ELVING: The voice in the ad is Ronald Reagan's, and the words are from a radio address he gave in April 1987. But the ad is guilty of changing the order of sentences, and that is wrong. The ad also ought to have made clear that Reagan was about to impose a tariff on Japanese semiconductors at the time, despite his own dislike of tariffs and his strong preference for free trade. Now, the Reagan Foundation called this out, published a link to the audio and transcript. And to their credit, the provincial officials in Ontario who paid for this ad in the first place have also published that same link. And everyone who cares ought to check it out. They will find Reagan condemning tariffs in no uncertain terms as a prelude to trade wars and deep economic harm.SIMON: The U.S. government is in its fourth week of a shutdown. More than a million federal workers missed a paycheck yesterday. What could end this - air traffic controllers, Obamacare premiums going up?ELVING: And maybe both. It was the absentee problem among air traffic controllers that ended the last shutdown of the record five-week-long freeze-up in 2019. This time, the Democrats say it's all about health care - premium subsidies for people on Obamacare. Much higher bills are about to hit home for millions of Americans, and they live disproportionately in states that voted for Trump, so there could be some rising tension there. The Republicans in Congress say the Democrats just want to fight. And they say, for their part, there's nothing to negotiate. My guess is that they would be back at the negotiating table on Monday if summoned by the president, but he does not seem to be so inclined.SIMON: Ron, the east wing of the White House was demolished this week to make way for a new ballroom President Trump wants built. Why did the demolition of the east wing seem to strike a chord with so many?ELVING: It's the permanence of the look of it. You know, they knocked down the whole east wing of the White House, carried it off in trucks, with some of it going to a golf course. It's not coming back. And for many people, that is a metaphor for all that's happening in Trump's second term. I have to confess, this is a hard one for people who care about the White House - the tradition, the symbolic value. Just a few days ago, Trump said he was only making some adjustments and modifications to the east wing. Then this week, after demolition had begun, he said architects and engineers needed to take the whole thing down in order to build the ballroom Trump wanted - a ballroom financed not by the people but by Amazon and Apple and Google and Meta, some major government contractors and Wall Street billionaires. The ballroom they build may well be impressive, but what has been lost in this process will not easily be replaced.SIMON: NPR's Ron Elving, thanks so much.ELVING: Thank you, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week in Politics: Trump's relations with Latin America and Canada; East Wing demolition",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-25T11:42:46.000Z",
      "dateModified": "2025-10-25T11:42:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]