[
  {
    "title": "Judge blocks HUD homelessness overhaul, rebukes agency for causing 'chaos'",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649501/judge-blocks-hud-homelessness-funding-overhaul",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+31/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd4%2Fee%2Feaa54ada4e9c9ee64d0765dfdc46%2Fgettyimages-2223538078-594x594.jpg",
    "tag": "Politics",
    "date": "2025-12-19T20:37:51.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Department of Housing and Urban",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Department of Housing and Urban Development faces legal challenges over proposed major changes to homelessness funding.\n                \n                    Kent Nishimura/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kent Nishimura/Getty Images\n    \n\n   \n   The U.S. Department of Housing and Urban Development cannot impose dramatically different conditions for homelessness programs for now, according to an oral ruling Friday by U.S. District Judge Mary McElroy in Rhode Island.   \n   McElroy granted a preliminary injunction to a group of states, cities and nonprofits who said a last minute overhaul of how to spend $4 billion on homelessness programs was unlawful. She also agreed with their argument that it likely would push many people back onto the streets in the middle of winter, causing irreparable harm.    \"Continuity of housing and stability for vulnerable populations is clearly in the public interest,\" said McElroy, ordering HUD to maintain its previous funding formula.   The National Alliance to End Homelessness, one of the plaintiffs, said in a statement the order \"means that more than 170,000 people – families, seniors, veterans, and people with disabilities – have respite from the government's assault.\"   \n   HUD has sought to dramatically slash funding for permanent housing and encourage more transitional housing that mandates work and treatment for addiction or mental illness. The overhaul – announced last month – also would allow the agency to deny money to local groups that don't comply with the Trump administration's agenda on things like DEI, the restriction of transgender rights and immigration enforcement.   \"HUD will continue working to provide homelessness assistance funding to grantees nationwide,\" said HUD spokeswoman Kasey Lovett in a statement to NPR. \"The Department remains committed to program reforms intended to assist our nation's most vulnerable citizens and will continue to do so in accordance with the law.\"   'Chaos seems to be the point'   McElroy expressed frustration with a series of HUD actions in recent weeks. Just hours before a Dec. 8 hearing, the agency withdrew its new funding notice, saying it would make changes to address critics' concerns. But on Friday, HUD's attorney said the new version would not be ready until the end of the day.   \n   \"The timing seems to be strategic,\" McElroy said, asserting there was no reason the document could not have been ready before the hearing. \"The constant churn and chaos seems to be the point.\"   In defending the agency, attorney John Bailey said HUD was simply trying to change its policies to reflect President Trump's executive orders, which he called \"legal directives.\" The judge interjected repeatedly to explain that he was conflating things, noting Congress – not the president – makes laws.   'It's kind of shocking'   HUD's changes were announced in November with little notice and only weeks before local homeless service providers must apply for new funding.   \n   \"Our agencies are just scrambling right now to try to respond,\" said Pam Johnson with Minnesota Community Action Partnership, whose members provide housing and other services for homeless people. \"It also just reverses 40 years of bipartisan work on proven solutions to homelessness. So it's really, it's kind of shocking.\"   For decades, U.S. policy favored permanent housing with optional treatment for addiction or mental illness Years of research has found the strategy is effective at keeping people off the streets.   But many conservatives argue it's failed to stop record rates of homelessness.   \"What is the root cause of homelessness? Mental illness, drug addiction, drug abuse,\" HUD Secretary Scottt Turner said recently on Fox Business Network. \"During the Biden administration, it was just warehousing. It was a homeless industrial complex.\"   Turner and others who support the changes say the goal is to push people towards self-sufficiency.   But local advocates say mental health and substance abuse are not the main factors driving homelessness.   \"It's poverty. Poverty, low income and significant lack of affordable housing,\" says Julie Embree, who heads the Toledo Lucas County Homelessness Board in Ohio.   Many in permanent housing have disabilities that make it hard to work full time, she said. Embree agrees with Trump administration goals like efficiency and saving money, but says pushing people back into homelessness, where they're more likely to land in jail, the courts or a hospital, is not cost-effective.   \"One emergency room visit is just as expensive as a month of sustaining this [permanent housing] program,\" she said.   In Los Angeles, Stephanie Klasky-Gamer with LA Family Housing said there is a need for more transitional housing, but not at the expense of long-term housing. And the idea that programs could simply switch from one to the other is not only unrealistic, it's illegal.   \"You cannot take a building that has a 75-year deed restriction and just - ding! - call it interim housing,\" she said.   \n   Those challenging HUD say providers who own such properties – or states who've invested millions of dollars in permanent housing projects – face \"significant financial jeopardy\" if their funding is not renewed.   In addition to the legal challenges, members of Congress from both parties have questioned HUD's sudden shift on homelessness. Advocates have lobbied lawmakers to step in and, at the least, push for more time to prepare for such a massive overhaul.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks HUD homelessness overhaul, rebukes agency for causing 'chaos'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+31/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd4%2Fee%2Feaa54ada4e9c9ee64d0765dfdc46%2Fgettyimages-2223538078-594x594.jpg"
      ],
      "datePublished": "2025-12-19T20:37:51.000Z",
      "dateModified": "2025-12-19T20:37:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scientists push back on Trump plan to break up a critical climate and weather center",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5648270/trump-weather-climate-national-center-atmospheric-research-ncar",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2678x1506+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F0e%2F43971af04cef9f1ef2d9933421ef%2Fgettyimages-1172289651.jpg",
    "tag": "Politics",
    "date": "2025-12-19T18:25:37.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump references a map while t",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump references a map while talking to reporters about Hurricane Dorian on Sept. 4, 2019. The map appears to have been altered by a black marker to extend the hurricane's range to include Alabama.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   The White House plans to break up a key weather and climate research center in Colorado, a move experts say could jeopardize the accuracy of forecasting and prediction systems.   It's the latest climate-related move by President Trump, who has called climate change a hoax, cut funding for climate research, and removed climate and weather scientists from their posts across the federal government. During his first term, Trump famously contradicted the nation's weather forecasting service by redrawing a Hurricane Dorian's path on a map with a Sharpie.   \n   White House Office of Management and Budget Director Russ Vought, in a post Tuesday on X, announced the plan to dismantle the National Center for Atmospheric Research (NCAR) in Boulder, calling it \"one of the largest sources of climate alarmism in the country.\" NCAR was founded more than six decades ago to provide universities with expertise and resources for collaborative research on global weather, water, and climate challenges.   Vought said the center was undergoing a \"comprehensive review\" and that any \"vital activities such as weather research will be moved to another entity or location.\"   Antonio Busalacchi, who heads the University Corporation for Atmospheric Research, a nonprofit consortium of 129 U.S. universities that oversees the Boulder facility, told NPR he received no prior notice before the announcement and believes the decision \"is entirely political.\"   NCAR's job is to study both climate and weather, and Busalacchi says the two cannot be understood separately. \"Our job is to state what the science is, and it's for others to interpret what the significance of that science is,\" he says. \"We're very careful not to cross over that line to advocacy or policy prescription.\"   Plan faces a political backlash   Vought's announcement drew an immediate response from Colorado Gov. Jared Polis, a Democrat, who said in a statement that if the White House goes ahead with the plan, \"public safety is at risk and science is being attacked.\"   \n   Sen. Michael Bennet, D-Colo., and Rep. Joe Neguse, a Democrat whose district includes Boulder, have suggested that the proposed NCAR closure amounts to political brinkmanship by the White House in response to Colorado's refusal to release Tina Peters. Peters, a former Mesa County clerk, is serving a nine-year prison sentence for illegally accessing voting machines after the 2020 election. A Republican, Peters was recently pardoned by Trump, a largely symbolic action since she has neither been charged nor convicted in federal court.   \n   \"The judgement is that this is very much about Tina Peters,\" Bennet told local media in Colorado. And that the president attempted to get his way through intimidation and he hasn't gotten his way and he is trying to punish Colorado as a result.\" In a joint statement, Bennett, Neguse and U.S. Sen. John Hickenlooper called the administration's plan \"deeply dangerous and blatantly retaliatory.\"   NPR reached out to Vought's Office of Management and Budget, but received no response. The White House press office did not answer specific questions, including one asking if \"breaking up\" NCAR meant it would be closed. But in a statement, the White House said \"NCAR's activities veer far from strong or useful science,\" adding that the center was being dismantled \"to eliminate Green New Scam research activities.\"   American Meteorological Society President David Stensrud says he has used NCAR weather models throughout his career. \"I think the work that I and others have done have led to the improvements that we see [in] … weather predictions,\" he says. \"Losing that [will cause] a great deal of hurt in terms of our ability to continue to improve forecasts and the future.\"   The \"beating heart\" of climate and weather science   Among NCAR's many contributions, in the 1960s, it developed dropsondes — tube-shaped instruments released from aircraft, including hurricane hunters, to measure temperature, pressure, humidity and wind. In the 1980s, the center helped develop and refine technology to monitor wind shear at airports.   \n   Busalacchi says these efforts have contributed to decades without passenger plane crashes caused by wind shear or downbursts. \"We've had zero loss of life from these weather events that can be directly attributed to our research. And that's what we're talking about losing\" if NCAR shuts down, he says.   NCAR, which employs about 830 people, is also known for developing and maintaining tools such as the Weather Research and Forecasting Model (WRF), which is used around the world to predict everything from thunderstorms to large-scale systems, including hurricanes and frontal systems. NCAR's Community Earth Systems Model (CESM) is also widely used by scientists, including Jason Furtado, an associate professor of meteorology at the University of Oklahoma.   \n   Furtado says he and his colleagues have used the model to run experiments \"to look for where in the atmosphere and ocean we get long-range signals for extreme cold air outbreaks\" such as the February 2021 event that hit the midsection of the country, resulting in sub-zero temperatures for days and the total breakdown of the electrical grid in central Texas. \"We've used [CESM] and come up with some really important research,\" Furtado says.   He calls NCAR \"a world-envied research center for atmospheric science\" and \"a beating heart for the atmospheric science community.\" He says his research and that of many other scientists would simply not be possible without the Boulder center. \"In some way every atmospheric scientist has a connection to NCAR, whether they've directly been to the building or they have not,\" he says.   Ken Davis, a professor of atmospheric and climate science at Penn State, did research at NCAR from the time he was a graduate student until after his postdoc. He says NCAR plays a critical role in providing its members with cutting-edge computing resources, observational resources and scientific expertise \"which no university can provide on its own.\"   \n   \"If any investigator anywhere in the country wants to request a research aircraft … NCAR will take a look at that proposal and say, 'Yeah, we can do that,' \" Davis says. \"As a university investigator, I can show up with an instrumented C-130 [aircraft] to do a whole bunch of airborne research, which would be totally impossible without this facility to support the community.\"   This isn't the first time the Trump administration has found itself at odds with the science community. In April, the administration dismissed scientists working on the country's flagship climate report and then removed the report from a government website.   \n   In 2019, Trump landed himself in a scandal known as \"Sharpiegate,\" in which he contradicted official National Weather Service forecasts for Hurricane Dorian by insisting the storm directly threatened Alabama. He later displayed an Oval Office map showing an altered storm path that appeared to have been drawn with a black marker. Earlier this year, the Senate approved the nomination of Neil Jacobs, a National Oceanic and Atmospheric Administration (NOAA) official cited for misconduct related to the episode, to lead the agency.   \n   In its 2026 budget plan, the White House has also proposed cutting NOAA's budget by about 27% and eliminating NOAA's Office of Oceanic and Atmospheric Research, the agency's core climate and weather research branch. The administration has also rolled back National Science Foundation funding for climate science.   Ultimately, closing NCAR wouldn't have an immediate impact on weather forecasting, Furtado says. Instead, he says, it would slowly erode the scientific community's ability to make further progress on understanding weather and climate.   \"We can either accept the facts and work on ways to mitigate and adapt, or ignore the data and not be ready for the changing world we have,\" Furtado says.   \"Having less accurate forecasts and being more in the dark about what is coming puts lives and property at risk,\" he says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scientists push back on Trump plan to break up a critical climate and weather center",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2678x1506+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F0e%2F43971af04cef9f1ef2d9933421ef%2Fgettyimages-1172289651.jpg"
      ],
      "datePublished": "2025-12-19T18:25:37.000Z",
      "dateModified": "2025-12-19T18:25:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's year in Washington",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5646603/trumps-year-in-washington",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-19T21:57:34.000Z",
    "description": "\n      \n      Trump's year in Washington\n    \n        \n                Download\n                \n                \n                    \n               ",
    "body": "\n      \n      Trump's year in Washington\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5646603/nx-s1-9580148\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      President Trump won re-election in 2024 on a promise to upend Washington. He pitched a presidency where he alone could solve America's problems. Where does the current reality of these promises stand?   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's year in Washington",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-19T21:57:34.000Z",
      "dateModified": "2025-12-19T21:57:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump will revisit a North Carolina town, now the focus of a newly redrawn congressional district",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5648862/trump-visit-north-carolina-congress-midterms-economy",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5206x2928+0+536/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd3%2Fcd%2Fa855781342918ff3ea9f4afc711a%2Fgettyimages-2181978279.jpg",
    "tag": "Politics",
    "date": "2025-12-19T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks during a campaign",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks during a campaign event on Oct. 30, 2024 in Rocky Mount, North Carolina. He plans to return to the city on Friday.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   ROCKY MOUNT, N.C. — President Trump will visit Rocky Mount, N.C., on Friday, capping off a week in which his administration has attempted to reassure Americans that the nation's economy is improving.   On Wednesday, the president gave a primetime address stating that the country's current economic woes are due to the policies of former Democratic President Joe Biden.   Earlier this month, Trump visited the swing state of Pennsylvania with a similar message blaming the previous administration for the challenges his administration is currently experiencing and saying that he is igniting an economic turnaround.   This week, a NPR/PBS News/Marist poll found that only 36% of voters approve of Trump's handling of the economy, the lowest mark since the poll started asking the question six years ago.   \n   Other recent polls have shown that Trump is losing popularity with voters in North Carolina, a state he's won in three consecutive presidential elections.   A late November poll from High Point University found that about 60% of North Carolina voters surveyed disapprove of how Trump is addressing inflation, while 52% disapprove of his tariff policies.   Still, Trump is visiting a decidedly purple part of a decidedly purple state in a congressional district recently redrawn by state Republicans to boost their chances of maintaining control of Congress.   And many state residents who voted for Trump in 2024 believe his policies are moving the country in the right direction.   Ronnie Peede, an HVAC technician who was working in downtown Rocky Mount on Thursday, is among those who voted for Trump last year.   \"He wants to get people back to work and get off of government help as much as possible,\" Peede said.   Peede also said while HVAC prices initially started rising after the Trump administration implemented tariffs, he thinks they have started to level off now and even drop in some cases.   Up the street from where Peede was working, Jonathan Sutton was tending to clients inside his barbershop on Thursday.   Sutton, a Democrat, said he has seen higher prices on some of the clippers and blades he orders from Europe and believes this is due to Trump's tariffs. But he doesn't necessarily blame the president for broader inflation.   \n   \"I think prices just go up, period. Since I've been alive, I don't remember a time when prices went down,\" Sutton said.   Sutton added that he thinks Trump is \"insensitive\" in how he talks to and about people, adding, \"for a president, it's kind of rough.\"   Sutton referred to Trump's recent remarks about Hollywood director Rob Reiner who was killed along with his wife, Michele, and what Sutton considers xenophobic comments about Somali immigrants.   All eyes on North Carolina's 2026 midterm elections   Trump's visit to Rocky Mount will take place just hours after the state's filing period for the 2026 elections closes, with highly competitive races expected in both the U.S. House and the U.S. Senate.   North Carolina will be home to one of the country's most-anticipated U.S. Senate races next year. The race is one of the few happening in a swing state, with Democratic and Republican voter registrations almost evenly split here. North Carolina voters have also shown a willingness in recent elections to split their tickets.   Former two-term Gov. Roy Cooper is expected to secure the Democratic nomination for the U.S. Senate race. Both times Cooper was elected governor in 2016 and 2020, Trump was also on the ballot.   Amongst the GOP primary candidates so far in the U.S. Senate race, Trump has endorsed Michael Whatley, a former Republican National Committee chairman, but former U.S. Navy JAG officer Don Brown and one-time state superintendent candidate Michele Morrow are both trying to stake out positions to Whatley's right.   North Carolina became the first swing state to draw new congressional districts amid a nationwide arms race between Republicans and Democrats to secure additional seats ahead of next year's midterm elections.   Rocky Mount itself is the largest city in the state's 1st Congressional District. State Republicans redrew that district and the neighboring 3rd Congressional District in an effort to give House GOP candidates an advantage in both. Using results from the 2024 presidential election, Republicans swapped 10 counties between the 1st and 3rd districts to increase the proportion of voters with a history of casting their ballot for GOP candidates in the 1st district.   \n   U.S. Rep. Don Davis, a moderate Democrat, won the seat twice in a row. Black Democrats have held the seat since 1992.   When Eva Clayton won the district in 1992, it marked the first time that North Carolina had elected a Black person to Congress since Reconstruction. In each election since, a Black Democrat has won the seat.   When voting rights groups challenged new maps in court earlier this year, they said the new district would dilute the influence of Black voters. But a panel of three federal judges ruled that the maps were intended to take power away from Democratic voters. Both North Carolina courts and the U.S. Supreme Court ruled in recent years that they will not overturn maps on the basis of partisan gerrymandering.   \n   As of Thursday evening, four Republicans have filed to run in the 23-county district. Trump has not yet made an endorsement in the primary, even as several GOP candidates have touted their allegiance to the president.   Peede, the HVAC technician, says he's unaffiliated but typically votes in Republican primaries. If Trump endorses in the state's 1st Congressional District primary, Peede said he would take it into consideration but also vet the candidates for himself.   \"I still like to look at the candidates to see what they stand for,\" he said. \"So it's not just because Trump said it. I mean, Trump's not perfect.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump will revisit a North Carolina town, now the focus of a newly redrawn congressional district",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5206x2928+0+536/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd3%2Fcd%2Fa855781342918ff3ea9f4afc711a%2Fgettyimages-2181978279.jpg"
      ],
      "datePublished": "2025-12-19T10:00:00.000Z",
      "dateModified": "2025-12-19T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs executive order that could ease marijuana restrictions",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5648579/trump-signs-executive-order-that-could-ease-marijuana-restrictions",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-19T11:49:17.000Z",
    "description": "\n      \n      Trump signs executive order that could ease marijuana restrictions\n    \n        \n                Download\n                \n             ",
    "body": "\n      \n      Trump signs executive order that could ease marijuana restrictions\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5648579/nx-s1-9578971\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Trump's executive order stops short of legalizing marijuana for recreational use, but will allow more research and medical treatment, and will clear the way for Medicare to cover some cannabis-related treatments.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs executive order that could ease marijuana restrictions",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-19T11:49:17.000Z",
      "dateModified": "2025-12-19T11:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justice Department official says full Epstein files won't come by Friday deadline",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5647638/epstein-files-release-law-deadline-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7798x4386+0+406/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2Fc4%2F041c40024efdbabae5ea89543902%2Fgettyimages-2245832638.jpg",
    "tag": "Politics",
    "date": "2025-12-19T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester holds a sign related to the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester holds a sign related to the release of the Jeffrey Epstein case files outside the U.S. Capitol in Washington, D.C., on Nov. 12.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   A top Justice Department official says the government will not fully release its files on the life and death of Jeffrey Epstein by Friday's deadline.   Deputy Attorney General Todd Blanche said in an interview with Fox News Friday morning he expects \"several hundred thousand documents\" would be released today and hundreds of thousands more would come later.    \"I expect that we're going to release more documents over the next couple of weeks,\" Blanche said. \"So today, several hundred thousand, and then over the next couple weeks I expect several hundred thousand more.\"   Under the Epstein Files Transparency Act signed by President Trump last month, the attorney general is directed to \"make publicly available in a searchable and downloadable format all unclassified records, documents, communications, and investigative materials in the possession of the Department of Justice, including the Federal Bureau of Investigation and United States Attorneys' Offices\" related to Epstein and his associate Ghislaine Maxwell.   \n   More specifically, the law targets the release of information about individuals affiliated with Epstein's criminal activities, any decisions not to charge Epstein and his associates and \"entities (corporate, nonprofit, academic, or governmental) with known or alleged ties to Epstein's trafficking or financial networks.\"   The files include \"more than 300 gigabytes of data and physical evidence\" in the FBI's custody and internal Justice Department records from criminal cases against Epstein, according to a memo from the FBI in July. Some files include photos and videos of Epstein's accusers, including minors, and other depictions of abuse that will be withheld.    \n   The text of the law that passed Congress with near-unanimous support also reads that \"no record shall be withheld, delayed, or redacted on the basis of embarrassment, reputational harm, or political sensitivity, including to any government official, public figure, or foreign dignitary.\"   Ahead of the release, some members of Congress have expressed concern about what may be shared and when. Rep. Thomas Massie, R-Ky., a co-sponsor of the bill pushing for the release of Epstein files, shared a 14-minute video online Thursday explaining his expectations.   \n            Our Epstein Files Transparency Act is now law. It establishes a December 19 deadline for the Attorney General to release the Epstein files. In this video, I’ll tell you what to expect in advance of tomorrow's statutory disclosure deadline. pic.twitter.com/7aD7q1kyLC— Thomas Massie (@RepThomasMassie) December 18, 2025\n   \n   Massie said that he spoke with lawyers for some of Epstein's victims who allege that \"there are at least 20 names of men who are accused of sex crimes in the possession of the FBI.\"   \"So if we get a large production on December 19th and it does not contain a single name of any male who's accused of a sex crime or sex trafficking or rape or any of these things, then we know they haven't produced all the documents,\" he said. \"It's that simple.\"   \n   While the law gives the Justice Department 30 days after Trump signed it to publish the files, there is notably no mechanism to enforce the deadline or seek punishment if the deadline is not met or if lawmakers argue some redactions are improper.   There's also language in the law that allows redactions for classified national security or foreign policy purposes as well as anything \"that would jeopardize an active federal investigation or ongoing prosecution.\"   Politics at play   But in recent weeks, Trump called on the Justice Department to investigate Democrats and financial institutions that have been mentioned in Epstein's private communications that have been released by the House Oversight Committee, complicating potential disclosures.   The attorney general is supposed to submit to the House and Senate a report listing the categories of records released and withheld, a summary of redactions made and \"a list of all government officials and politically exposed persons named or referenced in the released materials\" without redactions.   House Minority Leader Hakeem Jeffries, D-N.Y., told reporters Thursday that Democrats \"expect compliance\" with Friday's deadline.   \"But if the Department of Justice does not comply with what is federal law at this point, there will be strong bipartisan pushback,\" he said.   After Friday morning's interview, House Oversight Committee Ranking Member Rep. Robert Garcia, D-Calif., and House Judiciary Committee Ranking Member Rep. Jamie Raskin, D-Md. issued a statement saying that Democrats were examining \"all legal options.\"    \"Donald Trump and the Department of Justice are now violating federal law as they continue covering up the facts and the evidence about Jeffrey Epstein's decades-long, billion-dollar, international sex trafficking ring,\" the statement reads. \"For months, Pam Bondi has denied survivors the transparency and accountability they have demanded and deserve and has defied the Oversight Committee's subpoena. The Department of Justice is now making clear it intends to defy Congress itself, even as it gives star treatment to Epstein's convicted co-conspirator, Ghislaine Maxwell.\"   \n   In the meantime, there has been a steady drip of releases by Democrats and Republicans on the House Oversight Committee of documents from Epstein's private files, handed over by his estate under a subpoena.   \n   The way the Trump administration has handled the Epstein files — including downplaying the information for much of the year — means that this release likely won't be the end of the story.   Democrats have used the files and Trump's changing message as one of the few levers of power they have to go after the Republican Party, which controls Congress and the White House.   Before returning to office, Trump and other key figures vowed to release the Epstein files as proof that a cabal of child predators was being protected by the government and working to undermine Trump. Now, some of Trump's base believes that he himself is part of the cover-up.    Throughout all of this, Epstein and Maxwell's accusers say they're disappointed that their allegations of abuse have been used as a political cudgel wielded by politicians in Washington.   \"It's time that we put the political agendas and party affiliations to the side,\" Haley Robson, one accuser, said in a Nov. 18 press conference outside the Capitol. \"This is a human issue. This is about children. There is no place in society for exploitation, sexual crimes, or exploitation of women in society.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justice Department official says full Epstein files won't come by Friday deadline",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7798x4386+0+406/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2Fc4%2F041c40024efdbabae5ea89543902%2Fgettyimages-2245832638.jpg"
      ],
      "datePublished": "2025-12-19T10:00:00.000Z",
      "dateModified": "2025-12-19T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ releases Epstein files and the first batch is short on new information",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5615152/epstein-files-release-trump-pam-bondi-democrats",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1d%2Fa4%2F3b45080d4eebbe1e5183d165aa81%2Fgettyimages-590696434.jpg",
    "tag": "Politics",
    "date": "2025-12-19T21:04:15.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein and Ghislaine Maxwell in",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein and Ghislaine Maxwell in 2005.\n                \n                    Joe Schildhorn/Patrick McMullan/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Schildhorn/Patrick McMullan/Getty Images\n    \n\n   \n   The Justice Department has released a trove of documents related to the life, death and criminal investigation of convicted sex offender Jeffrey Epstein, including many that have already been made public from prior disclosures. Others are filled with heavy redactions.    Among the new, previously unseen files released Friday were several photos of former President Bill Clinton, including one of him in a hot tub with a person whose face has been redacted. Another shows Clinton standing next to Epstein. Clinton is also pictured at an event with rock star Mick Jagger and a female whose face has been redacted.    \n   Some of the most sought after information was redacted, including 119 pages of New York grand jury testimony. Rep. Ro Khanna, D-Calif., who co-sponsored the Epstein Files Transparency Act,  which legally required the files be released, expressed disappointment with the contents during an NPR interview with Mary Louise Kelly on All Things Considered Friday.   Khanna said the drop didn't contain the files he was looking for, stating the release \"seems at very best incomplete.\"   \"There's a draft indictment of the first Jeffrey Epstein case that really implicates other rich and powerful men who knew about the abuse or participated in it. That indictment should be released,\" Khanna said when Mary Louise Kelly asked what he still needed to see. \"There are witness interviews between the FBI and other people who were accused of being at Jeffrey Epstein's rape island or going to parties where there were 16 and 17-year-old girls being paraded around, those witness memorandums need to be released.\"   \n   On Friday morning, Deputy Attorney General Todd Blanche suggested in an interview with Fox News that \"several hundred thousand\" pages would be released on Friday, with more to follow.    Khanna said he would like an explanation from Blanche about where the missing documents are and what the DOJ's timeline is to make them public.    Politics at play   The release of the Epstein files is the latest development in a political saga that has dogged President Trump's second term in office and caused bipartisan backlash against Trump's conflicting and shifting commentary on the subject.   \n   Trump amplified conspiracy theories about the files relating to his onetime friend Epstein on the campaign trail, vowing to publicize information about the financier's crimes and ties to powerful people that he alleged was being covered up by the government.   \n   After he returned to the White House, Trump fought efforts by lawmakers and his supporters to release those files, calling Republicans who demanded transparency \"stupid\" and blaming Democrats for pushing a \"hoax\" before ultimately signing a law that was passed with near unanimous support.   The Epstein Files Transparency Act gave Attorney General Pam Bondi 30 days to publish \"all unclassified records, documents, communications, and investigative materials\" about Epstein available in a searchable and downloadable format.    The law also directed the Justice Department to share documents related to Epstein's accomplice Ghislaine Maxwell and \"individuals named or referenced in connection with Epstein's criminal activities,\" information regarding plea deals and decisions not to charge Epstein for other alleged crimes, as well as records pertaining to his 2019 death by suicide in federal custody.   Over the summer, the FBI put out a memo that said their files include \"a significant amount of material, including more than 300 gigabytes of data and physical evidence.\"   Some of that includes photos and videos of Epstein's accusers, including minors, and disturbing material that will not be made public. The bill from Congress also says anything \"that would jeopardize an active federal investigation or ongoing prosecution\" can be withheld or redacted, too.   \n   Trump called on the Justice Department to investigate some Democrats and institutions he said were complicit in Epstein's crimes or mentioned in other documents made public, including tens of thousands of emails and private files turned over to the House Oversight committee under subpoena, FBI records and numerous court cases over the years.   \"I will be asking A.G. Pam Bondi, and the Department of Justice, together with our great patriots at the FBI, to investigate Jeffrey Epstein's involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase, and many other people and institutions, to determine what was going on with them, and him,\" Trump wrote on Truth Social in November.   \n   In a separate Truth Social post announcing his signing of the Epstein Files Transparency Act, Trump said Democrats were using the issue to distract from what he says are victories for his administration.   \"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he posted.   The president had the authority to release the files without congressional action.   Thousands of pages are already public   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein in Cambridge, Mass. in September 2004.\n                \n                    Rick Friedman/Corbis/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rick Friedman/Corbis/Getty Images\n    \n\n   \n   Friday's release of Justice Department files joins tens of thousands of other records made public over the years, including court cases, government document dumps and subpoenas from Congress.   Spread throughout roughly 23,000 documents released by the House Oversight Committee in early November, emails and texts revealed a list of powerful people in politics, academia and business that sought his counsel and friendship in the years after he pleaded guilty to state charges of solicitation of prostitution and of solicitation of prostitution with a minor under the age of 18 in 2008.   The people who consulted with Epstein in those documents rarely acknowledged the severity of the crimes that required him to register as a sex offender, though simply corresponding with Epstein does not implicate individuals in his criminal activities, convicted or accused.   \n   There's an apparent letter of recommendation for Epstein from linguist Noam Chomsky, calling him a \"highly valued friend,\" that recalled how Epstein connected him with former Israeli Prime Minister Ehud Barak — another frequent Epstein correspondent.   \"Jeffrey constantly raises searching questions and puts forth provocative ideas, which have repeatedly led me to rethink crucial issues,\" the letter reads.   There's advice Epstein gave to Steve Bannon, Trump's former strategist, about ways to build a far-right political movement overseas.   \"If you are going to play here, you'll have to spend time, [E]urope by remote doesn't work,\" Epstein wrote in 2018. \"Lots and lots of face time and hand holding. Europe can be a wife not a mistress.\"   \n   Former Harvard University president and onetime Treasury Secretary Larry Summers is documented numerous times having intimate personal chats with Epstein, including asking for romantic advice and joking about women's intelligence.   \"I yipped about inclusion,\" wrote Summers in 2017. \"I observed that half the IQ [in the] world was possessed by women without mentioning they are more than 51 percent of population....\"   In the weeks since the latest Epstein emails release, he has resigned from the board of OpenAI and abruptly left his teaching role at Harvard, as the university announced a probe of \"information concerning individuals at Harvard included in the newly released Jeffrey Epstein documents to evaluate what actions may be warranted.\"   Summers isn't the only high-profile Democrat who found himself in Epstein's orbit. Kathryn Ruemmler, former White House counsel in the Obama administration and current chief legal officer for Goldman Sachs, messaged with Epstein before and during Trump's first term.   \"Trump is living proof of the adage that it is better to be lucky than smart,\" she wrote in August 2015.   \"I regret ever knowing Jeffrey Epstein,\" Ruemmler told the Wall Street Journal in 2023.   Trump's name appears repeatedly   Trump was a frequent subject of emails and text messages in the latest private Epstein file tranche — well over a thousand different mentions — though mainly the subject of Epstein's near-obsession with his presidency, as the latter positioned himself as a Trump whisperer of sorts to his powerful associates.   In one 2015 email between Epstein and author Michael Wolff, the pair discuss a potential question from an upcoming CNN appearance about Trump and Epstein's personal ties.   \"I think you should let him hang himself,\" Wolff wrote. \"If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.\"   \n   Another email Epstein sent in 2011 to Ghislaine Maxwell, his associate who has been convicted on trafficking charges, called Trump the \"dog that hasn't barked\" and says Trump spent \"hours at my house\" with one of the alleged sex trafficking victims.   Still another is a 2019 message between Epstein and Wolff in which the disgraced financier wrote that \"of course [Trump] knew about the girls as he asked Ghislaine to stop.\" The email does not elaborate any further.   \"I have met some very bad people, none as bad as Trump,\" Epstein wrote in 2017 to Summers. \"Not one decent cell in his body.\"   In September, House Democrats released more than 200 pages of a birthday book for Epstein created more than two decades ago that includes a lewd drawing and letter that appears to be signed by Trump.   The president, who has consistently denied any meaningful connection to Epstein, called the drawing and signature \"fake.\"   In July, Trump told reporters that he and Epstein fell out because Epstein hired away young female employees who worked at the spa at Mar-a-Lago.   Anusha Mathur contributed to this reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ releases Epstein files and the first batch is short on new information",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1d%2Fa4%2F3b45080d4eebbe1e5183d165aa81%2Fgettyimages-590696434.jpg"
      ],
      "datePublished": "2025-12-19T21:04:15.000Z",
      "dateModified": "2025-12-19T21:04:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ABC News' Jonathan Karl unpacks Trump's behavior this week",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5648371/abc-news-jonathan-karl-unpacks-trumps-behavior-this-week",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-19T09:46:24.000Z",
    "description": "\n      NPR's Steve Inskeep looks back at President Trump's behavior over the past week with Jonathan Karl of ABC News. He's the author of \"Retribution",
    "body": "\n      NPR's Steve Inskeep looks back at President Trump's behavior over the past week with Jonathan Karl of ABC News. He's the author of \"Retribution: Donald Trump and the Campaign That Changed America.\"   \n\n    STEVE INSKEEP, HOST:  This week, President Trump made presidential history in that he literally wrote the histories of presidents. He had partisan descriptions of his predecessors posted on plaques at the White House. This same week, the president's appointees claim to have added his name to the Kennedy Center for the Performing Arts. Trump also dismayed his own allies by suggesting the filmmaker Rob Reiner was killed for not liking Trump. And then there was the address to the nation in which many people felt that Trump was shouting at them. All this is on-brand for the president, but is he getting less restrained over time? Jonathan Karl is our guide on this. He is chief Washington correspondent for ABC News, has covered Trump for three decades and has written several books about him, including his latest, \"Retribution.\" Jon Karl, welcome back.JONATHAN KARL: Thank you.INSKEEP: Does the Donald Trump that we've seen in recent days look familiar to you?KARL: He certainly looks familiar. I mean, this is Trump. I mean, everything is about Trump. The fact that he is rewriting history and putting himself at the middle of it. The fact that he wants to put his name on the Kennedy Center, hardly surprising. The fact that he wants to address the world with a primetime address that really doesn't have anything to say that would warrant a traditional primetime presidential address, not really surprising. But, Steve, when you add it all up, the big difference from what we have seen in the past is he is truly untethered. There is nobody in the White House that is trying to tell him, look, sir, you may not have the authority to do this. It might look bad. Nobody is having that conversation with him.INSKEEP: I would like to know if this is purely a matter of staffing.KARL: No. It'd be a mistake to think this is just about staffing. That would be a mistake. That is a factor. Look, I wrote \"Retribution\" about his journey back to the White House. He faced a campaign where he was either going to face the very real possibility of going to prison or becoming the most powerful president in modern American history. Powerful because of his total control over his party and also, of course, a Supreme Court decision that basically said he's not going to be prosecuted. So he's dealing with a situation where he feels empowered to do whatever the hell he wants.I mean, the Kennedy Center was named by an act of Congress. You can't have your allies on the board wave a magic wand and have a vote and say, we're calling it the Trump Kennedy Center. That's a violation of a law. Will it be stopped? I mean, I would think eventually it would be, but he doesn't feel any such constraint.INSKEEP: People in the White House were upset when The New York Times took note of the president's age recently, but is that at all a factor in someone who is less and less in control of what he says?KARL: You know, our friend Jonathan Martin of Politico wrote a piece saying that he is basically like the kid in the movie \"Big\" - the Tom Hanks character in the movie \"Big.\" He's having a great time. He can do whatever he wants. Sometimes you go to the White House and you hear loud music coming from the direction of the Rose Garden. That's because the Rose Garden, which he has largely paved over, he goes out there and he plays DJ. Is he slipping? Is his age a factor here?Look, you clearly see him at times where he seems very tired. You see him at times where he's ridiculously energetic. It goes up and down. But I don't know that you can look at his behavior and say that the primary factor here is age. But he is 79 years old.INSKEEP: Do you think that he is concerned at all about the political effects of what he does, people disapproving?KARL: He does obsess over polls and over media coverage, like he always has. He sees what you see, what we all see, which is he is at some of the lowest approval ratings that he has ever had, and particularly on the areas that have been his strengths - the handling of the economy. So he knows that. He is concerned about it, but will it dissuade him and cause him to act in a different way? I think that's what prompted the speech to the nation, but, you know, he's going to say what he wants to say.INSKEEP: What do you think about when you see that the Trump merch store is selling Trump 2028 hats, and he encourages people to talk about a third term?KARL: I think he loves that. I think you'll hear more of it. I do not think it his intention to serve a third term. I think his intention is to leave this all, but I don't think you can count on it. One of the themes I close on in \"Retribution\" is that he is making changes that will far out survive him, including the changes right there to the White House. I think that, you know, his efforts to change the world and get retribution on those who stopped him the first time around are really only getting started.INSKEEP: Jonathan Karl is chief Washington correspondent for ABC News and the author of \"Retribution.\" Thanks so much.KARL: Thank you, Steve.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ABC News' Jonathan Karl unpacks Trump's behavior this week",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-19T09:46:24.000Z",
      "dateModified": "2025-12-19T09:46:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok signs deal to give U.S. operations to Oracle-led investor group",
    "url": "https://www.npr.org/2025/12/18/nx-s1-5648844/tiktok-deal-oracle-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4960x2790+0+517/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2c%2F8b%2Fef76c8dc4ccdab1393dcda6d5974%2Fgettyimages-2237992797.jpg",
    "tag": "Politics",
    "date": "2025-12-19T00:26:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                TikTok company offices in Culver City, C",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                TikTok company offices in Culver City, Calif. on Sept. 30, 2025. A deal to sell the American part of the company to a group of U.S. investors was signed on Dec. 18.\n                \n                    Patrick T. Fallon/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Patrick T. Fallon/AFP via Getty Images\n    \n\n   \n   TikTok has signed a deal to spin-off its U.S. operations to a group controlled by mostly American investors, including software giant Oracle, a company run by billionaire Trump ally Larry Ellison.   TikTok's hyper-engaging algorithm and the massive amount of data the app has collected on millions of Americans is set to be overseen by the new U.S. firm. According to the agreement, TikTok's U.S. algorithm will be retrained with only Americans' data. Content moderation rules around what is permitted and what is not will be set by the new  investor-controlled entity.   Yet the underlying algorithm will still be owned by Beijing-based ByteDance, with the blessing of American auditors, according to an internal TikTok memo reviewed by NPR and two sources familiar with the deal who were not authorized to speak publicly.   \n   \"With an American majority running the content moderation, concerns about foreign propaganda seem to have been alleviated,\" said Anupam Chander, a professor of law and technology at Georgetown University who studies the regulation of new technology. \"But it is possible that the American TikTok might end up censoring or hiding speech that is permissible on the global TikTok platform. I would hope that the U.S. content moderation team would allow speech that the American owners might dislike.\"   \n   Under the terms of the sale, half of the new entity that will control the American version of TikTok will be owned by a consortium of investors including Oracle, private equity firm Silver Lake and United Arab Emirates state-backed investment firm MGX. Those three will control 45% of the new U.S. TikTok entity.   Oracle, Silver Lake and MGX did not return requests for comment.   About a third of the newly-formed TikTok operation will be held by existing investors of ByteDance, the Chinese parent company of the video app. And around 20% will be kept by ByteDance.   A seven-member board of directors, most being American, will oversee the new entity, according to the memo, which was first reported by Axios.   The deal caps more than five years of mounting pressure from Washington, where bipartisan concerns about TikTok's ties to China prompted Congress to pass a law in 2024 that would have banned the app unless it was sold.   \n   The law was upheld by the Supreme Court in January. For months, TikTok was technically operating in violation of federal law, but Trump issued a flurry of executive actions to delay enforcement of the law that would have banned the popular video app.   Jim Secreto, former Treasury official who worked on TikTok policy during the Biden administration, said the deal signed on Thuesday does not completely sever ties with ByteDance, something the law Congress passed was intended to set into motion.   \"The law requires a clean break from ByteDance. This structure doesn't meet that standard,\" Secreto said. \"It looks more like a franchise deal that leaves TikTok's core technology in China than a true divestment. By sidestepping the guardrails Congress set, the national security concerns around covert data access and manipulation of the algorithm remain unresolved.\"   The White House declined to comment.   TikTok has an estimated 2 billion users globally, and less than 10% of its worldwide users are based in the U.S.   A new U.S. entity overseeing the American version creates a curious situation for the viral video app: One version of the service will be under the direction of an American-backed company, with additional checks and balances on content flows and data security while a second version of the app, wholly operated by ByteDance, will be available to the rest of the world.   The deal delivers a major win for Larry Ellison, expanding his family's grip on more corners of American media and entertainment.   \n   Ellison is a major backer of Paramount Skydance, a deal that was completed this year.   His son, David Ellison, who is the chairman and CEO of Paramount Skydance, has made a hostile bid to take over Warner Bros. Discovery, just as streaming giant Netflix has made its own bid, which top officials at Warner have endorsed.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok signs deal to give U.S. operations to Oracle-led investor group",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4960x2790+0+517/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2c%2F8b%2Fef76c8dc4ccdab1393dcda6d5974%2Fgettyimages-2237992797.jpg"
      ],
      "datePublished": "2025-12-19T00:26:21.000Z",
      "dateModified": "2025-12-19T00:26:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]