[
  {
    "title": "Smithsonian museums and National Zoo set to close as shutdown takes its toll",
    "url": "https://www.npr.org/2025/10/11/g-s1-93157/smithsonian-national-zoo-federal-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7977x4487+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fa3%2Fb63c6a8b48569c0b0463509f46cc%2Fgettyimages-2196458567.jpg",
    "tag": "Politics",
    "date": "2025-10-11T17:35:53.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Panda Bao Li eats bamboo at the Smithson",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Panda Bao Li eats bamboo at the Smithsonian National Zoo in Washington, D.C., on Jan. 28. The zoo, as well as other Smithsonian facilities, will be closed beginning on Oct. 12 as the government shutdown continues.\n                \n                    Kayla Bartkowski/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kayla Bartkowski/Getty Images\n    \n\n   \n   As the government shutdown drags on, Smithsonian museums, the National Zoo and other facilities are the latest to be caught in the fray, with the federal trust announcing the closure of all of its sites beginning on Sunday.   \"We will update our operating status as soon as the situation is resolved,\" the Smithsonian announced on social media. \"We do not plan to update social media other than to inform you of changes to our operating status.\"   The closure affects all of the Smithsonian's 21 museums, its research centers and the National Zoo.   \n   As worried social media users expressed concern about the well-being of the animals at the zoo, the Smithsonian assured its supporters that the animals would still be cared for during the zoo's closure.   \"All the animals at the Zoo and at the Smithsonian Conservation Biology Institute in Front Royal, Virginia, will continue to be fed and cared for,\" the Smithsonian said. \"A shutdown will not affect our commitment to the safety of our staff and standard of excellence in animal care.\"   The zoo's beloved animal cams, however, are considered nonessential and will be turned off for the remainder of the shutdown.   The Smithsonian receives about 62% of its funding from the federal government, which helps support free admission to all of its D.C. museums and the National Zoo.   Its facilities had been able to keep their doors open for the first 11 days of the shutdown by relying on prior-year funds, but those coffers have since run dry.   \n   The Smithsonian is just the most recent entity to find itself ensnared in the ongoing dispute on government funding.   Some national parks around the country have also been forced to close as staff have been deemed nonessential and sent home until Congress can reach an agreement on government funding.   On Friday, thousands of federal employees across agencies including the Department of Health and Human Services and the Department of Education began receiving reduction in force notices, informing them that they would be laid off.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Smithsonian museums and National Zoo set to close as shutdown takes its toll",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7977x4487+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fa3%2Fb63c6a8b48569c0b0463509f46cc%2Fgettyimages-2196458567.jpg"
      ],
      "datePublished": "2025-10-11T17:35:53.000Z",
      "dateModified": "2025-10-11T17:35:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nobel Prize winner Machado says Venezuela is in 'chaos' under current regime",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5571541/nobel-winner-machado-venezuela-maduro",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7314x4114+0+381/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2F07%2F4c1c4a1844d697ff51dea9bfe9ef%2Fgettyimages-2193162841.jpg",
    "tag": "Politics",
    "date": "2025-10-11T21:42:09.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Opposition leader Maria Corina Machado g",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Opposition leader Maria Corina Machado gives a speech during an Anti-government protest on Jan. 9, 2025 in Caracas, Venezuela.\n                \n                    Alfredo Lasry R/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alfredo Lasry R/Getty Images\n    \n\n   \n   Venezuela opposition leader and Nobel Peace Prize winner María Corina Machado said in an interview with NPR's Weekend Edition Sunday that her country is in chaos and called for the removal of Venezuela's authoritarian President Nicolás Maduro.   Speaking while still in hiding within Venezuela's borders, the right-wing leader decried Maduro as an illegitimate strongman who had elbowed his way into a third term despite consistent evidence that his administration had rigged the vote.   \"I want to be very clear with this: Regime change was already mandated by the Venezuelan people on July 28, 2024,\" Machado said during an interview with NPR's Ayesha Rascoe on Saturday, citing last year's controversial, closely watched election.   \n   \"The narrative of the regime right now is that if Maduro goes, chaos will come to Venezuela. That's absolutely false,\" she said. \"Venezuela is in profound, total chaos right now.\"   Machado – whom Maduro's regime had barred from running in the race – had backed opposition candidate Edmundo González in the race to steer Venezuela as it suffers through a political and economic crisis that has forced more than one-fifth of its residents to flee the country.   Machado has been one of the staunchest critics of the powerful United Socialist Party of Venezuela (PSUV) since it first came to power in the late 1990s. A former legislator in the Venezuelan National Assembly, Machado has been shot at, targeted by federal prosecutors, banned from running for office, and forced into hiding by the government of Maduro, who succeeded PSUV founder Hugo Chávez in 2013.   \"We won by a landslide in the presidential election, and we proved it with over 85% of the original tally sheets. The whole world knows that. Even Maduro's allies know that he was defeated,\" Machado said.   Several Latin American countries, alongside the United States, agree that Maduro manipulated the electoral system in order to maintain his grip on Venezuela's government. The country has been riddled with corruption and, under Maduro's leadership, seen the country descend into economic collapse and a crackdown on free speech.   \n   The Trump administration has accused Maduro of leading a drug cartel and has ordered deadly strikes on boats it says were carrying drugs. The U.S. State Department is offering a reward of up to $50 million for information that would lead to Maduro's arrest.   Machado echoed those claims that Maduro is operating as a cartel head and blamed him for the boat strikes and broader international hostility towards Venezuela.   \"[The cartel] are destabilizing, intentionally, the region and undermining the institutions in the United States, because they have turned Venezuela into the safe haven of the enemies of the United States – Iran, China, Russia, Hezbollah, Hamas, and others,\" she said.   \"So, this is a war that was declared by Maduro, not us.\"   When asked if she would support U.S. military invasion of Venezuela to see Maduro deposed, Machado declined to speculate on whether President Trump would authorize such actions, but she called Trump a valuable ally in recognizing the \"threat\" Maduro presents as a leader.   \"You cannot have peace without freedom, and you cannot have freedom without strength,\" Machado said.   \"When you are facing a criminal structure, they have used violence, all the resources of the Venezuelan people against innocent people. People that are in prison right now that are tortured, persecuted and killed,\" she said. \"We need to stop this because it is a matter of saving lives and the regime has to understand that impunity is over.\"   Machado had dedicated her Nobel Peace Prize to Trump, whom she has supported and called on directly to help steer Venezuela towards democracy.   When asked whether she did so in the hopes that it would inspire Trump to help force Maduro out, Machado said: \"I dedicated it to the people of Venezuela and President Trump because I think it's the correct thing to do.\"   \n   \"I think it is fair, not only for what he has been doing in the last months to solve long and painful conflicts around the world, but precisely for what he's doing right now for the Americas,\" she said, adding that, if and when Maduro is ousted, she hoped to see the fall of other repressive regimes in Cuba and Nicaragua as well.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nobel Prize winner Machado says Venezuela is in 'chaos' under current regime",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7314x4114+0+381/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2F07%2F4c1c4a1844d697ff51dea9bfe9ef%2Fgettyimages-2193162841.jpg"
      ],
      "datePublished": "2025-10-11T21:42:09.000Z",
      "dateModified": "2025-10-11T21:42:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "\"It feels terrible.\" Federal worker's family tightens their belts as shutdown drags on",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5565232/government-shutdown-federal-workers-furlough-finances-bills",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4032x2268+0+210/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd8%2F13d4b89d4f1ba465c358d17eafd3%2Fimg-3308.jpg",
    "tag": "Politics",
    "date": "2025-10-12T13:07:14.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Stephanie Rogers at her mother's home ou",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Stephanie Rogers at her mother's home outside Denver, where she and her two young daughters now live. Rogers has dipped into her retirement to help the family get through the federal shutdown.\n                \n                    Tegan Wendland/CPR News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tegan Wendland/CPR News\n    \n\n   \n   In a way, Stephanie Rogers started preparing for the current moment months ago, when she and her two daughters moved in with her mother about half an hour south of Denver. High prices for everything was certainly one reason.   \"When you added up the numbers between both of our family households, it was going to be something that we could not keep going long term,\" says Rogers, who's 44 and divorced with no child support.   Rogers has been a microbiologist with the Food and Drug Administration for 16 years and is now among hundreds of thousands of federal employees not working. She is also a chapter president with the National Treasury Employees Union (NTEU).   \n   Another big motivation for living together? The uncertainty of a new administration focused on shrinking the government, plus Rogers' memory of the last federal shutdown, back in 2018.   \"And we're living in that reality now,\" she says. \"And so that is our decision, to just make sure all of us survive this process.\"   Her mother, Nina Chapman, says she loves having her granddaughters around. \"I was grateful we had a basement.  It was just a wonderful area to put everybody,\" she says.   Planning ahead for life without a paycheck   When the previous shutdown dragged on for 35 days, from late 2018 into 2019, Rogers says she was \"utterly unprepared.\" So she made sure to plan better this time.   In the weeks before this shutdown, as the deadline for the funding lapse approached, she rushed to squeeze in medical appointments. She requested early refills of the kids' medications in case she couldn't afford them without a paycheck.   Rogers also made a painful decision that will carry its own financial cost. \"I had to pull out of my retirement, which has some tax consequences for next year,\" she says.   \n   Rogers has asked for flexibility with her car payment and is thinking twice about extracurriculars for her girls, who are 10 and 12. They might have to skip field trips that cost extra or volleyball games that are a long drive away. And the plan has been to buy only essential food.   \"In fact, we just had our freezer go out,\" she says. \"We lost our meat, and that's just devastating to us because we were counting on that.\"   Rogers has also applied for state unemployment. Furloughed federal workers are generally eligible for that, though they must refund the money when the shutdown ends, and after they get any retroactive pay withheld during that time.   \n   \"We don't know what our future looks like\"   But President Trump has floated the idea that some workers might be denied backpay, despite a law he signed mandating it in 2019. He's also threatened mass firings during the shutdown, a process the administration said had begun Friday. And Trump has talked about permanently cutting \"Democrat programs,\" without saying specifically what that means. Rogers says all of this makes the current shutdown feel very different.   \"It feels terrible,\" she says. \"I don't know if I even have a job when I walk away from this, much less if I will get paid. Do I have health insurance if we don't get back pay? It's a really hard place to be in when you have children who rely on you.\"   Rogers believes she and other federal employees do essential work — such as food inspections — that the general public may only appreciate when they're gone.    But across the federal government, it's been stressful all year. Mass layoffs and funding cuts have left fewer people working longer hours, she says, only to be sent the message now that they're not really wanted.   \"My mother worries about [it] constantly. My daughter has woken up and said, 'Does mommy have a job today?' We don't know what our future looks like,\" she says.   So even though she's in her dream job, Rogers says she's started applying for other positions outside the federal government.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "\"It feels terrible.\" Federal worker's family tightens their belts as shutdown drags on",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4032x2268+0+210/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd8%2F13d4b89d4f1ba465c358d17eafd3%2Fimg-3308.jpg"
      ],
      "datePublished": "2025-10-12T13:07:14.000Z",
      "dateModified": "2025-10-12T13:07:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump directs Pentagon to use 'available funds' to pay military during shutdown",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5571945/trump-pentagon-hegseth-pay-military-during-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F50%2Ff9%2F05d0bbf4401aaea42268db7eaa05%2Fgettyimages-2229561471.jpg",
    "tag": "Politics",
    "date": "2025-10-11T21:00:41.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump delivers remarks ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump delivers remarks during a press conference at the White House along with Secretary of Defense Pete Hegseth.\n                \n                    Andrew Harnik/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images North America\n    \n\n   \n   President Trump says he has \"identified funds\" to ensure the active military gets paid next week, as Congress stalls over negotiations to reopen the federal government.   \"I am using my authority, as Commander in Chief, to direct our Secretary of War, Pete Hegseth, to use all available funds to get our Troops PAID on October 15th. We have identified funds to do this, and Secretary Hegseth will use them to PAY OUR TROOPS,\" Trump said Saturday in a post on Truth Social.    Active-duty troops risked missing their first full paychecks on Wednesday, October 15.   Secretary of Defense Pete Hegseth reposted Trump's announcement on X stating, \"President Trump delivers for the troops.\"    \n   The Defense Department will use \"approximately $8 billion\" of unused research and development funding from last year to pay service members if the government doesn't reopen by October 15, according to a Pentagon official not authorized to speak publicly.    In 2024, the federal government spent nearly $192 billion annually in soldier compensation, according to a White House budget summary.  On average, the government paid nearly $7.4 billion each two-week pay period last year. Meaning, the recently identified $8 billion would likely cover one pay period — leaving future soldier pay uncertain.    If troops go unpaid, that could further amp up the pressure on lawmakers to reopen the government. Many service members live paycheck to paycheck and could feel the impact quickly.    Some members of Congress have proposed a standalone bill — called the \"Pay Our Troops Act\" — to compensate soldiers, but Republican leaders in both chambers have insisted that the way to ensure military members are paid is to pass the GOP-backed short-term funding bill that would reopen the government.   Democrats and Republicans have both pinned blame across the aisle if troops go without pay.    \"You've got millions of American families who will now have to figure out how to make their mortgage, how to cover their rent, pay the car note, and keep food on the table, because Democrats are here playing games,\" House Speaker Mike Johnson said Friday.   \n   Meanwhile, a nonprofit organization that provide services to soldiers and their families is blaming both parties.    \"Military families deserve better than to have our livelihoods tied to political stalemates,\" Besa Pinchotti, CEO of the National Military Family Association and a military spouse, said in a statement. \"Congress must pass the Pay Our Troops Act to ensure servicemembers receive their pay on time and that our families' financial stability isn't jeopardized while the nation relies on our servicemembers to keep us safe.\"   President Trump previously said he would ensure active military would be paid despite the shutdown.    \"We will get our service members every last penny,\" Trump said at a Navy event in Norfolk, Virginia, last weekend. \"Don't worry about it.\"   NPR's Tom Bowman and Sam Gringlas contributed to this story.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump directs Pentagon to use 'available funds' to pay military during shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F50%2Ff9%2F05d0bbf4401aaea42268db7eaa05%2Fgettyimages-2229561471.jpg"
      ],
      "datePublished": "2025-10-11T21:00:41.000Z",
      "dateModified": "2025-10-11T21:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Georgia politics and Rep. Marjorie Taylor Greene's stance on the shutdown",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5570741/georgia-politics-and-rep-marjorie-taylor-greenes-stance-on-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:46:11.000Z",
    "description": "\n      NPR's Scott Simon speaks to reporter Greg Bluestein about Georgia Rep. Marjorie Taylor Greene, who says her party needs to end the government s",
    "body": "\n      NPR's Scott Simon speaks to reporter Greg Bluestein about Georgia Rep. Marjorie Taylor Greene, who says her party needs to end the government shutdown and work with Democrats on health care.   \n\n    SCOTT SIMON, HOST:  Georgia Representative Marjorie Taylor Greene told NBC News this week...(SOUNDBITE OF ARCHIVED RECORDING)MARJORIE TAYLOR GREENE: I'm not some sort of blind slave to the president, and I don't think anyone should be. And I'm not elected by the president. I'm not elected by anyone that works in the White House. I'm elected by my district. That's who I work for. And I got elected without the president's endorsement. And, you know, I think that has served me really well.SIMON: Representative Greene is calling on her fellow Republicans to end the government shutdown by working with Democrats to extend Affordable Care Act subsidies. Her outspokenness on this issue and others is just one item of Georgia politics these days. We're joined now by Greg Bluestein. He's chief political correspondent for The Atlanta Journal-Constitution. Thanks so much for being with us.GREG BLUESTEIN: Thanks for having me.SIMON: How much does this most recent break from Republican leadership fit into Marjorie Taylor Greene's broader moves?BLUESTEIN: I mean, she's always been such a maverick in Georgia politics. But lately, it's really felt like she's even more of a wild card ever since she decided not to run for U.S. Senate for the spot challenging Senator Jon Ossoff, maybe the most vulnerable Democratic incumbent on the midterm ballot. Ever since she made that decision, she has been even more of a maverick, even more of a wild card. For the first time, really, that I can remember in Georgia politics, a bunch of Democrats are now praising Marjorie Taylor Greene, saying, I didn't think we could ever say this, but I agree with Marjorie Taylor Greene.SIMON: How have her constituents reacted?BLUESTEIN: Well, she is in a very, very red district up in northwest Georgia. There's been Democratic challengers to her that have raised lots of money but really made no headway. So she's safe politically. Her constituents - by her accounts, about 60% of them have agreed with her stance. Time and time again, we will talk to her constituents who say they might not like everything she says on Twitter, or on social media or on TV, but they agree with most of her votes. By some projections, ending these federal subsidies could affect more than 1.4 million Georgians. So to many of her constituents, she's not just speaking as a lawmaker; she's speaking as a mom whose children will have to pay more in health care insurance.SIMON: And, of course, this comes as there are two big races next year in Georgia for the Senate and for governor. What, so far, seems to be the major themes for both those campaigns?BLUESTEIN: Well, the biggest theme, I think, is it is wide open for both races. Other than Jon Ossoff, the incumbent Democratic senator, there seems to be a candidate for every lane. You have candidates in the governor's race from the far left to former Republican Lieutenant Governor Geoff Duncan, now running as a moderate Democrat. And then, of course, on the Republican side of that governor's race, you've got MAGA allies. You've also got Brad Raffensperger, the secretary of state, who famously defied Donald Trump's demand to find just enough votes to overturn the 2020 election in Georgia.SIMON: What about the economy? What kind of issue is that?BLUESTEIN: Yeah. Every poll that I've seen in Georgia, economy and jobs and inflation have always been the top issue, and I don't think that's going to change. But we have started to see - at least in polls of Democratic voters - number two is standing up to Donald Trump. And that reflects a lot of Democratic voters - especially the more liberal and progressive ones - who want a more confrontational, aggressive approach to the president. And there's candidates who are promising to do that in 2026, and there's others who are saying, no, look, we need to figure out ways we can work with the Republicans.SIMON: OK. And what are the issues on the Republican side?BLUESTEIN: Trump shadows everything as well. On the Senate race, for instance, there's pretty much a three-person race for Donald Trump's endorsement right now. There's former football coach Derek Dooley and Congressmen Mike Collins and Buddy Carter. Derek Dooley is probably the least known of any of them. He has a famous last name, thanks to his father, the legendary University of Georgia football coach. He has Governor Kemp's endorsement, though, so that helps him a lot. On the other side, the other two candidates, Collins and Carter, they're both depicting themselves as MAGA warriors who are going to be President Trump's biggest ally in the Senate should they win.SIMON: Where do a lot of Georgians see themselves fitting into the national landscape of politics now?BLUESTEIN: You know, we went from a state that was an afterthought - I remember in the 2016 presidential election, neither Trump nor Clinton even came to Georgia after the primary. They never had substantial operations in Georgia or big campaign rallies, and nor did they really need to. I mean, Donald Trump was always favored to win Georgia. He did. But in the process of 2016, he lost the Atlanta suburbs, and that was the first real inkling that Georgia was being competitive. And now we're used to being competitive. Now there's even voter fatigue because there have been so many competitive elections.You know, close to a billion dollars was spent in Georgia during the 2020 campaign. About 500 million was spent in 2022. So you're going into 2026 - yes, Georgia's still a battleground. Is it blue? No. Is it red? No. It's probably a sort of darker shade of purple right now but certainly still one of the most competitive places in the nation.SIMON: Greg Bluestein is chief political correspondent for the Atlanta Journal-Constitution. Thanks so much for being with us.BLUESTEIN: Thanks for having me.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Georgia politics and Rep. Marjorie Taylor Greene's stance on the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:46:11.000Z",
      "dateModified": "2025-10-11T11:46:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5570868/analyzing-dominion-voting-systems-sale-to-firm-run-by-ex-republican-elections-official",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-11T11:46:15.000Z",
    "description": "\n      \n      Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official\n    \n            \n                \n              ",
    "body": "\n      \n      Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5570868/nx-s1-9488474\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Dominion Voting Systems has been sold to Liberty Vote. Dominion was at the center of fraudulent vote rigging claims by President Trump and his allies during the 2020 election.   \n\n    SCOTT SIMON, HOST:  Dominion Voting Systems, the election technology company that's at the heart of countless conspiracy theories after the 2020 election, has been sold. Dominion machines are used in more than half the states, and the company's buyer seems to be leaning into some of President Trump's language about voting. NPR's voting correspondent, Miles Parks, joins us in our studios. Miles, thanks so much for being with us.MILES PARKS, BYLINE: Hey, Scott. Thanks for having me.SIMON: Dominion became what amounts to a household name after the 2020 elections. Remind us why.PARKS: Well, if you think back to November 2020, the Trump campaign, influential people on the right, were really throwing spaghetti at the wall, trying to find a conspiracy theory to stick about why President Trump did not win that election. You know, Italian satellites, late-night ballot dumps, and Dominion really got pulled into that. Here's former Trump attorney Sidney Powell talking a little bit after the election on Fox Business.(SOUNDBITE OF TV SHOW, \"FOX BUSINESS\")SIDNEY POWELL: I can hardly wait to put forth all the evidence we have collected on Dominion, starting with the fact it was created to produce altered voting results in Venezuela for Hugo Chavez.PARKS: So you get a taste a little bit of the kind of accusations that were being made about the company, even though none of them were ever proven true. Fox News ended up settling a defamation lawsuit with the company for close to $800 million, and the far-right outlet Newsmax also settled a similar lawsuit for more than $60 million.SIMON: Now, I imagine none of that can be good for business. Is that why the company's been sold?PARKS: Well, we haven't heard from Dominion about the sale, but I can say the rumors have not completely died and have clearly impacted the business. You know, in 2023, a Republican-leaning county in California actually voted to get rid of their Dominion counting machines in favor of hand-counting ballots, even though it was estimated to triple their costs. And even this year, officials with Trump's Justice Department reached out to local clerks in Missouri wanting to access their Dominion machines. We aren't really sure exactly why, but it is clear that there is still a lot of skepticism about this company among people who deny the 2020 results.SIMON: And, of course, that could be a big task for the buyer of Dominion, which is who? And why are they buying?PARKS: Right. So it's someone who wants to - who already owns a voting equipment company and wants to expand. Scott Leiendecker is his name, and he's been working in elections for decades, first as an official. He was the Republican elections director in St. Louis. And then in 2011, he started a company called KNOWiNK that has become the nation's largest vendor for voting check-in equipment. To acquire Dominion, Leiendecker started a new company called Liberty Vote, and where it gets really interesting is how much he seems to be leaning into the right's election integrity language.SIMON: Did the Liberty Vote detail how they plan to change Dominion?PARKS: So it's still a little bit unclear, but there is definitely a rebrand going on. The announcement explicitly said that they would only use domestic staffing and software development, which seemed to nod to the conspiracy theorizing about Venezuela that we heard a little bit of before. And the announcement also said it would prioritize complying with President Trump's March executive order on voting.But just to be clear, it's not like the Dominion machines are just going away. You know, government contracts are already in place and, in many case, for many years down the road. So counties that have these vote tabulators are probably still going to use them in elections in 2026. It will be interesting to watch then how the election integrity activists - the most ardent ones on the right - take this news, considering it's just, at this point, a change in ownership.SIMON: NPR's Miles Parks. Thanks for joining us this morning.PARKS: Thanks, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Analyzing Dominion Voting Systems sale to firm run by ex-Republican elections official",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-11T11:46:15.000Z",
      "dateModified": "2025-10-11T11:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "5 things to know about the health care fight behind the shutdown",
    "url": "https://www.npr.org/2025/10/12/nx-s1-5570849/shutdown-aca-health-care-tax-credits",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F89%2F61%2F42a357b447b6a77d340116f3b53a%2Fgettyimages-2239432954.jpg",
    "tag": "Politics",
    "date": "2025-10-12T11:02:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Mike Lawler (right), R-N.Y., confro",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Mike Lawler (right), R-N.Y., confronts House Minority Leader Hakeem Jeffries, D-N.Y., about signing on to a bill that would extend Affordable Care Act tax credits, on Oct. 8.\n                \n                    Tom Williams/CQ-Roll Call/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Williams/CQ-Roll Call/Getty Images\n    \n\n   \n   Democrats say extending the Affordable Care Act tax credits is urgent. Republicans say there's plenty of time to figure it out.   As the government shutdown goes on, there are a lot of mixed messages on Capitol Hill about the health care issue at the center of the fight.   The tax credits that make ACA health care premiums affordable for many Americans don't expire until December, as Republican lawmakers note. But Democratic lawmakers want to see them extended before enrollment begins Nov. 1, and they have made that a condition of voting to reopen the government.   It's not just a battle over political messaging. These are real health insurance marketplaces where real people — 24 million of them — buy coverage. The amount the federal government picks up for their monthly premiums makes a big difference.    \n   Here are five key facts about the policy.   1. The public supports the subsidies   A poll last week found that more than three-quarters of people across the political spectrum are in favor of Congress extending the enhanced ACA tax credits. The poll was conducted by KFF, the nonpartisan health research organization.   \"What we found is 78% of the public — including majorities of Democrats, independents, Republicans and [Make America Great Again] supporters — all think Congress should extend the premium tax credits beyond 2025,\" says Ashley Kirzinger, KFF's director of survey methodology.   Other polls have had similar findings: 72% of voters across political parties supported extending the policy, according to a July survey by Republican pollsters Tony Fabrizio and Bob Ward. They surveyed two dozen competitive congressional districts and found that support for the policy was high even for those who had no personal connection to these health plans.   In a memo, they wrote: \"Voters don't want to see people losing their health insurance.\"   2. The issue is urgent since open enrollment starts soon   North Dakota's insurance commissioner, Jon Godfread, says the enhanced subsidies need to be extended before open enrollment starts Nov. 1, calling on lawmakers to \"do this now.\"   He's an elected Republican in his state and the president of the National Association of Insurance Commissioners, a membership organization of state insurance regulators across the United States. \"Red state, blue state, appointed, elected — we have unanimous approval supporting these tax credits,\" he says.   \n   If Congress acts quickly, the marketplaces could possibly show the subsidized rates to those who log in to shop as soon as open enrollment begins. \"Most states, if not all states, had their [insurance] carriers file two sets of rates — one with subsidies, one without,\" he says. \"And so if they do a clean extension of these subsidies, I think most states will be ready to go on that.\"   If Congress misses that deadline, he says, consumers who log in to shop for a plan will see much higher premiums and they may not come back, even if Congress ultimately extends the credits by the end of December.   3. Premiums are set to shoot up next year   When health insurers were setting their rates for 2026, they factored in the rising cost of health care, plus the possibility that the subsidies would expire and drive the healthiest people out of the ACA marketplaces.   When researchers at KFF analyzed 2026 insurance filings, they found that premiums will double for many consumers next year. \"On average, we're expecting premium payments by enrollees to increase by 114% if these enhanced tax credits expire,\" says Cynthia Cox, director of the Program on the ACA at KFF.   Sky-high premiums might drive people to risk it and go uninsured, she says. The Congressional Budget Office estimates that 4 million people will become uninsured in the next few years if the enhanced tax credits expire.   4. Most enrollees live in states that Trump won   The people who rely on HealthCare.gov and the other Obamacare marketplaces are people who \"work at a place that doesn't offer them coverage,\" explains Cox, of KFF. \"A lot of times, that's a small business. Or it could be farmers and ranchers. It could be gig workers like Uber drivers.\"   Geographically, more than 3 in 4 enrollees live in states that President Trump won in 2024, according to KFF. Part of that is due to the fact that some Southern states have seen dramatic growth in enrollment recently. \"In six states (Texas, Louisiana, Mississippi, Tennessee, Georgia and West Virginia), enrollment has more than tripled in five years,\" notes Cox's colleague Emma Wager.   \n   5. The subsidies are expensive for the government   The subsidies that kept costs down for consumers cost the federal government a lot of money. The Congressional Budget Office estimates it would cost the government $350 billion over the next decade if the enhanced subsidies were extended permanently.   Conservative groups that have always opposed the Affordable Care Act are against the enhanced subsidies. A coalition of groups recently argued in a letter to the president that the enhanced tax credits were meant to be temporary during the COVID-19 pandemic and that extending them will exacerbate rising health care costs.   \"While some Americans may be concerned about premiums going up in the short term, removing the incentive for insurers to continue raising their prices will save patients money in the long run,\" they write.   Other Republicans — like Rep. Marjorie Taylor Greene of Georgia and Sen. Josh Hawley of Missouri — have said they support extending the tax credits or coming up with a different plan to prevent dramatic rate hikes for consumers.   Godfread, the Republican insurance commissioner of North Dakota, says that the debate over rising health costs is real and worthwhile, but there's urgency in this moment.   \"That discussion is separate,\" he argues. \"We can talk about the costs of health care and pharmaceuticals, all the pieces — but we've still got to get access to consumers and that's what these subsidies have helped provide.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "5 things to know about the health care fight behind the shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F89%2F61%2F42a357b447b6a77d340116f3b53a%2Fgettyimages-2239432954.jpg"
      ],
      "datePublished": "2025-10-12T11:02:00.000Z",
      "dateModified": "2025-10-12T11:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump slashes mental health agency as shutdown drags on",
    "url": "https://www.npr.org/sections/shots-health-news/2025/10/11/nx-s1-5571948/trump-mental-health-substance-abuse-cdc-layoffs-jobs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+76/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F93%2Fbd%2F2cdf09154c4fa4ae3493700e0db1%2Fgettyimages-2192048758.jpg",
    "tag": "Politics",
    "date": "2025-10-11T23:10:36.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sign for the 988 Lifeline mental health ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sign for the 988 Lifeline mental health emergency hotline, Walnut Creek, California, December 20, 2024. The Trump administration has laid off more than 100 employees at the agency responsible for overseeing the number.\n                \n                    Smith Collection/Gado via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Smith Collection/Gado via Getty Images\n    \n\n   \n   The Trump administration has laid off more than 100 employees at the nation's main mental health agency, NPR has learned.   Current and former employees at the Substance Abuse and Mental Health Services Administration (SAMHSA) told NPR about the layoffs, which were part of a government-wide reduction in force. The sources, who were not authorized to speak publicly about the agency, said the layoffs came late Friday, as the nation's government shutdown dragged on.   Employees were notified of a \"Reduction in Force\" shortly before 8 p.m. ET on Friday, according to a source within the agency who was not authorized to discuss the layoffs publicly. According to the source, administration officials offered no rationale for who lost their jobs:   \n   \"I think the general feeling today is shock — and not understanding why?\" the source told NPR.   That source was aware of dozens of firings. Two former employees told NPR that the total number of employees at SAMHSA who lost their jobs was around 125, though that number was a rough estimate. SAMHSA had employed around 900 people at the start of this administration, but had already lost a third of that number to layoffs in the spring. With this latest round of firings, that number is down to nearly half.    In a statement, the Department of Health and Human Services, which houses SAMHSA, confirmed the cuts.    \"HHS employees across multiple divisions are receiving reduction-in-force notices as a direct consequence of the Democrat-led government shutdown,\" Andrew Nixon, the department's director of communications, wrote to NPR in an email late Saturday.   SAMHSA is responsible for overseeing the new 988 suicide prevention hotline. It also gives out billions in grants for mental health and addiction services. It was created in 1992 through bipartisan legislation signed by then-President George H.W. Bush. In 2024 its budget was about $7.5 billion, most of which went directly to states for programs aimed at mental health issues and addiction.   \n   SAMHSA funds \"are the backbone of behavioral health in this country,\" Rachel Winograd, a psychologist at the University of Missouri-Saint Louis, told NPR earlier this year. \"If those grants were to go away, we'd be screwed.\"   \n   Despite having what many see as an essential role in protecting the nation's mental health, SAMHSA has not been viewed favorably by the current administration. President Trump had proposed slashing its budget as part of his Big Beautiful Bill. And earlier this year, Health Secretary Robert F. Kennedy Jr. told Congress that he intended to fold its duties into a new program he calls the Administration for a Healthy America.   CDC in confusion as some cuts reversed   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A sign marks the entrance to the U.S. Centers for Disease Control and Prevention headquarters Wednesday, Aug. 27, 2025, in Atlanta. Several key parts of the agency are losing employees.\n                \n                    Brynn Anderson/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brynn Anderson/AP\n    \n\n   \n   SAMHSA was not the only agency to see staff laid off on Friday evening. The Centers for Disease Control and Prevention also appears to have suffered cuts to staffing, according to two employees who say they were affected by the firings. Both employees were not authorized to speak to the press while the layoffs are being finalized.   \n   But the cuts at CDC seemed to be in flux late Saturday. In an apparent reversal, one employee had their firing undone according to a letter seen by NPR. The letter, from Tom Nagy, the Chief Human Capital Officer at the department of Health and Human Services said the employee's Reduction in Force was \"hereby revoked.\"   The source said they were aware of other reversals at the CDC, but it was unclear how many employees received such letters.   \n   Before the reversals went out, one CDC official who was laid off told NPR that the agency had been the subject of sweeping cuts to staff at offices responsible for disease surveillance, outbreak forecasting, chronic diseases, and immunization and respiratory diseases, to name but a few. \"If you wanted to weaken America's public health capacity without saying it outright, this is how you'd do it — remove the people who connect the dots, steady the ship, and keep the public informed,\" the official who was laid off told NPR.   The New York Times also reported extensive cuts at the public health agency, including two senior officials responsible for overseeing the CDC's measles response team.    In a separate statement sent to NPR, HHS's Nixon said that some employees received \"incorrect notifications\" and \"were never separated from the agency.\" \"They are not subject to the reduction in force,\" he wrote.   Nixon also indicated more cuts could come: \"HHS continues to close wasteful and duplicative entities, including those that are at odds with the Trump administration's Make America Healthy Again agenda,\" it said.   NPR's Pien Huang and Jeff Brady contributed to this report.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump slashes mental health agency as shutdown drags on",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+76/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F93%2Fbd%2F2cdf09154c4fa4ae3493700e0db1%2Fgettyimages-2192048758.jpg"
      ],
      "datePublished": "2025-10-11T23:10:36.000Z",
      "dateModified": "2025-10-11T23:10:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amid shutdown, Trump administration guts department overseeing special education",
    "url": "https://www.npr.org/2025/10/13/nx-s1-5572489/trump-special-education-department-funding-layoffs-disabilities",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7877x4431+0+410/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Faa%2F163f4ae54dd1970ccf9cb96be049%2Fgettyimages-2206055353.jpg",
    "tag": "Politics",
    "date": "2025-10-13T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person walks past the U.S. Department ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person walks past the U.S. Department of Education  in Washington, DC.\n                \n                    Win McNamee/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Win McNamee/Getty Images\n    \n\n   \n   Sweeping layoffs announced Friday by the Trump administration landed another body blow to the U.S. Department of Education, this time gutting the office responsible for overseeing special education, according to multiple sources within the department.   The reduction-in-force, or RIF, affects the dozens of staff responsible for roughly $15 billion dollars in special education funding, and for making sure states provide special education services to the nation's 7.5 million children with disabilities.   \n   \"This is decimating the office responsible for safeguarding the rights of infants, toddlers, children and youth with disabilities,\" said one department employee, who, like the others NPR spoke with, requested anonymity for fear of retribution.   According to sources, all staff in the Office of Special Education and Rehabilitative Services (OSERS), with the exception of a handful of top officials and support staff, were cut in Friday's RIF. The office is the central nervous system for programs that support students with disabilities, not only offering guidance to families but providing monitoring and oversight of states to make sure they're complying with the landmark Individuals with Disabilities Education Act (IDEA).   \n   The layoffs at the Education Department, 466 in total, were part of broader cuts – some 4,200 jobs – announced by government lawyers in a court filing on Friday as the shutdown continues.   At the Education Department, it's not clear precisely how many workers in the special education office were cut. Department officials did not respond to NPR's requests for clarity or comment.   \"Based on multiple reports from staff and their managers, we believe that all remaining staff in the Office of Special Education and Rehabilitative Services (OSERS), including the Office of Special Education Programs (OSEP) and the Rehabilitative Services Administration (RSA), have been illegally fired,\" said Rachel Gittleman, president of AFGE Local 252, a union that represents many Education Department employees.   \"The harm these cuts will cause for the 7.5 million students with disabilities across the country is only beginning,\" Gittelman added.   Employees who received a notice Friday were told they would remain employed until Dec. 9.   Protecting students with disabilities   NPR spoke with half-a-dozen federal workers who have been cut – all of them in the Office of Special Education and Rehabilitative Services, and also with former officials with close ties to the office of special education.   Employees in the office of special education described a host of key responsibilities that they worried might now go unmet, creating a painful void for states, school districts and families.   \n   The federal law known as IDEA, which turned 50 years old this year, guarantees all children with disabilities the right to a free and appropriate public education. Before the law was passed, those children were often refused admission to schools, including public schools, or warehoused in substandard facilities where they learned little and enjoyed few rights.   IDEA is considered a civil rights law first and foremost, requiring states to provide special education services for children from birth to age 21. It also helps fund those services.   As part of the law, every year states must submit student data to OSERS staff, to show they're following the requirements of the law. States must also submit annual plans and apply, each year, for the billions of dollars available through IDEA to help them pay for special education.   OSERS staff review those state plans, analysing the data and ensuring they are in compliance with federal law. These staffers can initiate investigations into states if they believe they have intentionally or unintentionally fallen out of compliance. They also provide technical assistance to states.   Without these OSERS staff, one employee told NPR, \"there is no oversight to make sure all children with disabilities get the services they're entitled to.\"   OSERS staff also field calls directly from parents and families around the country seeking help understanding their child's rights under federal disability law and, in some cases, seeking help when they worry they're being unlawfully denied services.   \"I don't think people realize how many calls we get from parents and families every day,\" one affected worker told NPR. Now these calls will go unanswered.   Returning education to the states   President Trump has talked repeatedly about wanting to return education to the states, and that dismantling the Education Department is part of that plan.   Eliminating these staff members does not, at this point, cut special education funding to states.   \n   But one state director of special education, who spoke with NPR on the condition of anonymity out of concern the government would retaliate against that state, said they worry about the implications for students and families.   \"I'm fearful. I think it's good for states to know there's federal oversight and that they'll be held accountable,\" the official said. \"The concept of leaving special education up to states sounds great, but it's scary. What happens if one state decides to interpret the law one way, but another state disagrees and interprets it differently?\"   Multiple sources also questioned the legality of the cuts to OSERS. Federal law requires that there be an Office of Special Education Programs – within the U.S. Department of Education – to manage and oversee special education funding and programs. As such, these sources said, effectively closing the office by firing its staff should require an act of Congress.   \"Now, the federal government is out of compliance with federal disability law,\" one OSERS employee told NPR. Another wondered: \"Who will families go to when there's nobody left?\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amid shutdown, Trump administration guts department overseeing special education",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7877x4431+0+410/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Faa%2F163f4ae54dd1970ccf9cb96be049%2Fgettyimages-2206055353.jpg"
      ],
      "datePublished": "2025-10-13T09:00:00.000Z",
      "dateModified": "2025-10-13T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Media companies thought late night TV was irrelevant. Kimmel proved them wrong",
    "url": "https://www.npr.org/2025/10/13/nx-s1-5558154/jimmy-kimmel-late-night-history-colbert-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa3%2Fde%2Fbe5aecd7400ba36bc3067015e208%2F3116179-0319.jpg",
    "tag": "Politics",
    "date": "2025-10-13T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jimmy Kimmel appeared as a guest on The ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jimmy Kimmel appeared as a guest on The Late Show with Stephen Colbert on Tuesday, September 30, a week after Kimmel's return to ABC.\n                \n                    Scott Kowalchyk/CBS\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Scott Kowalchyk/CBS\n    \n\n   \n   When Jimmy Kimmel returned to his late-night show on ABC after a near-weeklong suspension, some cheered it as a triumph of free speech over the oppressive reach of government censorship. But I saw something a little different.   I saw bold proof that, despite all the talk about late-night TV losing its relevance, there sure seemed to be a lot of people who still cared about what hosts like Kimmel had to say.   That feeling deepened after watching Kimmel hang with his fellow late night hosts in New York during a long-planned week in Brooklyn.   From the moment when Kimmel visited Stephen Colbert's Late Show to tell him he thought \"I'm never coming back on air\" after ABC's parent company Disney sidelined him to Kimmel, Colbert and Seth Meyers trolling President Trump with a photo at Jimmy Kimmel Live!, there seemed to be an energized spirit in these hosts joining forces to remind fans why the genre is so special.   \n   Honchos at Disney learned this surprising truth the hard way after they moved to suspend Kimmel last month for sardonic comments he made about supporters of Trump's MAGA movement trying to capitalize politically on the assassination of conservative activist Charlie Kirk.   Given that the suspension decision came after the head of the Federal Communications Commission threatened Disney, ABC and its affiliates, it sure looked like Kimmel was about to join CBS host Stephen Colbert as another Trump critic on late-night TV who would soon lose his job.   And then something amazing happened. People pushed back.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        Randy Holmes/Disney\n    \n\n   \n   The American Civil Liberties Union published a petition of protest with signatures from more than 400 artists, including names like Tom Hanks, Meryl Streep, Hasan Minhaj and Amber Ruffin. People began canceling their subscriptions to Disney-owned streaming services like Hulu and Disney+, urged on by celebrities like John Oliver and Howard Stern. Republican senator Ted Cruz called FCC chair Brendan Carr's threats \"dangerous,\" and podcaster Joe Rogan, who endorsed Trump ahead of the 2024 election, warned against government pressure on comedians. Even former President Barack Obama weighed in, calling the situation \"government coercion\" that media companies should resist.   And when Kimmel returned last month, it was with an emotional, passionate episode that drew nearly 6.3 million viewers to the network – despite the fact that local TV station owners Nexstar and Sinclair Broadcast Group preempted it on the ABC stations they operate, which cover 23% of U.S. households. It was the show's highest rated regularly scheduled episode in over 10 years, drawing another 26 million views on YouTube and social media, according to ABC.   \n   During the episode, Kimmel thanked his audience for standing up to \"make your voices heard so mine could be heard\" — and they did, pushing Disney, Nexstar and Sinclair to resume airing Jimmy Kimmel Live! in an outcome that seemed wholly unlikely just days earlier.   I'll go a step further and suggest that this episode was also a much-needed lesson for late-night TV itself, which has struggled in recent years to prove it can still matter for most viewers.   Just maybe, in saving Kimmel, late night TV can learn to save itself.   An institution once at the heart of pop culture needs revitalization   Amid all the headlines about falling ratings, production cutbacks and monetary losses, it's easy to forget that late-night TV programs have historically occupied a singular space in pop culture that viewers couldn't easily find anywhere else.   But in modern times, that hasn't seemed true. Cheaply made podcasts and video hits on social media offer the kinds of commentary, comedy bits and celebrity interviews still at the core of today's network TV late-night shows. And these new media platforms have an advantage: they can meet viewers where they are — catching them as they migrate from broadcast outlets and cable channels to the world of online streaming.   In the past, late-night TV stayed relevant by constantly evolving to offer experiences that were both familiar and unique. So, perhaps looking back at that history might offer clues for how today's programs can build a new future for the genre.   Because it needs one. Badly.   The first version: Late-night TV as a place where the cool kids hang out   The best place to start is with the longest-running program still airing: NBC's The Tonight Show, which began in 1954 with host Steve Allen — a pianist, composer, actor, comic and longtime TV personality seen as a savvy industry pioneer.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Steve Allen in June 1956.\n                \n                    Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Associated Press\n    \n\n   \n   Like a lot of shows at the dawn of network TV, Tonight Starring Steve Allen wasn't really sure what it initially wanted to be or quite how to use this new medium. And if you watch recordings of the first episode — still available on YouTube — you'll see how Allen's sardonically witty vibe feels an awful lot like the cheeky irreverence David Letterman would bring to late night decades later.   Still, despite the experimental vibe of the program, it featured a lot of elements we still see in the genre more than 70 years later: an opening monologue, celebrity interviews, a live band and a show presented before a studio audience with some comedy bits filmed outside.   \n   Based in Manhattan, Tonight was a transition from popular variety programs like The Ed Sullivan Show to something hipper — a way for viewers around the country to soak up a bit of show-business glamour at the end of the day. Big names from Broadway or the sports world could drop by to kibitz with Allen, making viewers feel like they were at the coolest after-hours party in the country.   The next version: Late-night TV as the center of showbiz establishment   After Allen left the show, Tonight's formula was refined through the late 1950s and early 1960s by hosts Jack Paar and his successor, Johnny Carson, the man often dubbed the \"King of Late Night.\" Raised in Iowa and Nebraska, Carson built his career as a host of variety and game shows with an approachable ease, developing a reserved charisma that helped fuel the rise of his show as a gigantically influential program with a massive audience.   The name of the game for network TV back then was material that offered the biggest tent possible — nothing too controversial or complicated to turn off the masses. So the nation's viewers grew used to Carson tucking them in bed, backed by a sprawling big band, with a monologue that gently poked fun at the day's news events and chummy interactions with celebrities.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Steve Martin appeared on The Tonight Show Starring Johnny Carson in July 1980, wearing fake jewelry to poke fun at his own success.\n                \n                    Lennox McLendon/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Lennox McLendon/Associated Press\n    \n\n   \n   For standup comics, an endorsement from Carson — getting waved over to sit next to him for a conversation after they delivered their best five minutes of jokes — was an honor that could make a comedian's career.   The list of performers who benefited from that nod included everyone from Bill Cosby to Drew Carey, Tim Allen, Roseanne Barr, Freddie Prinze and David Letterman. Viewers also knew: the standup comic who was making Carson laugh one night could be starring in TV's biggest sitcom soon after.   \n   Another version: Late night as a home for comedic innovation aimed at young viewers   By 1982, Carson had negotiated to take ownership of the time slot after his program, teaming with NBC to create a late-night show at 12:30 a.m. featuring Letterman. Dubbed Late Night With David Letterman, the show had a slimmed-down, modernized band and made fun of the TV institutions Carson's generation built.   Letterman wasn't a smoothly chummy figure like Carson was on screen. He picked real fights on air with some celebrities — Cher famously called Letterman an \"a**hole\" during an interview segment — and brought on younger upstart comics, like subversive comedy pioneer Bill Hicks and some leather-jacket wearing guy from Boston named Jay Leno. (Letterman later came in for some criticism after he moved his show to CBS and refused to air a set by Hicks, who joked about religion and abortion protesters.)   Letterman's antics appealed to college students and young media nerds — I still remember watching him lowered into a vat of water wearing a suit festooned with Alka-Seltzer tablets one minute and throwing watermelons off the roof of a New York skyscraper the next. Much of what he did was a nod to the pioneering early days of late night TV with a twist; for example, one \"celebrity\" he featured in fake ads, Larry \"Bud\" Melman, was a character played by file clerk-turned-actor Calvert DeForest.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Comedian Richard Pryor as a guest on Late Night With David Letterman in January 1987. Pryor was starring in the film Critical Condition.\n                \n                    Susan Ragan/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Susan Ragan/Associated Press\n    \n\n   \n   He struck a chord with viewers younger than the Carson generation who yearned for a voice on TV that felt more modern — reflecting their growing cynicism about show business while stretching the boundaries of the medium. That youthful connection continued through other hosts who took over NBC's Late Night franchise, from the serious silliness of Conan O'Brien to the hard-partying glad-handing of Jimmy Fallon.   When Carson retired in 1992, NBC snubbed Letterman to hand The Tonight Show to Leno. Letterman decamped for CBS, where he began hosting The Late Show, a glitzier, less subversive program, from the sprawling confines of the Ed Sullivan Theater in Manhattan. Like Carson, Letterman negotiated control of the time slot after his program to create The Late Late Show, where hosts ranging from Craig Ferguson to James Corden twisted the format to serve their tastes in ways Letterman had become too big to attempt.   \n   An alternative version: Late-night TV upstart succeeds by catering to audiences left out by the big players   Other hosts tried to challenge Carson's hold on the genre, but one of the few to find real success was comic Arsenio Hall, who offered a late-night show syndicated individually to TV stations across the country centered on Black culture and performers too small time for Carson's stage. Debuting in 1989, The Arsenio Hall Show had a funk and jazz fusion outfit as its house band. Its most buzzed-about guests were artists on the cutting edge of Black culture, like Prince, Bobby Brown and MC Hammer (before the mega-hit \"U Can't Touch This\" made him a household name).   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Magic Johnson, left, made his first public appearance on The Arsenio Hall Show after announcing he tested positive for HIV in Nov. 1991.\n                \n                    Nick Ut/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nick Ut/Associated Press\n    \n\n   \n   There's a reason why a modern late-night program like Fallon's Tonight Show now has hip-hop pioneers The Roots as its house band. If networks include as many people as possible on their big TV shows, then they don't have to worry about a new version of Arsenio building an empire on performers excluded from the mainstream.   Today's version: The rise of the political crusaders   When Jon Stewart took over The Daily Show in 1999 and centered its humor on real headlines and actual news clips, he pushed an evolution nearly as seismic as Saturday Night Live's decision to use guest hosts every week or Carson's move to give Letterman his own show.   In addition to delivering a string of successful alumni to the comedy world – including Stephen Colbert, Steve Carell, Samantha Bee, John Oliver and Roy Wood Jr. – The Daily Show helped viewers process events by digging into the hypocrisies and absurdities of politics and media. In particular, Stewart highlighted what he saw as the shortcomings of traditional journalism, the toxicity of media outlets like CNN and the pandering of conservative platforms like the Fox News Channel — teaching audiences to decode this new type of messaging.   \n   In contrast, Fox News Channel's Gutfeld!, which airs at the earlier hour of 10 p.m. on a cable channel and has access to a larger potential audience, seems to benefit from being the most prominent effort to create a conservative-oriented version of late-night broadcast shows on traditional TV.   Politics have only gotten more partisan. So Stewart's approach has spread across late-night TV, led by Colbert's version of The Late Show on CBS, John Oliver's Last Week Tonight, Bill Maher's Real Time on HBO and Kimmel himself. In particular, hosts like Colbert, Kimmel and Seth Meyers have become passionate critics of Trump's policies, including his aggressive use of tariffs, his Kennedy Center takeover and his ties to Jeffrey Epstein — but that approach could also sometimes feel predictable and ineffective.   Until the attempt to muzzle Kimmel failed, giving satirists a new cause and fresh passion to pursue it.   Kimmel, in particular, has seemed like a good-natured everyguy who got pulled into becoming a political figure, speaking out against what he likely sees as Trump's growing extremism as president. Now that he and his fellow hosts are in the crosshairs, it's time to use this moment as fuel for fresh satire. Kimmel's bit, on the night of his return show, featuring Robert De Niro as a mafioso-style FCC commissioner was an excellent example — constantly reminding viewers how they can say things with a star power one guy with a podcast microphone can't equal.   Before Kimmel's moment, I thought figures like Conan O'Brien might offer an answer to the future of the late-night genre — which has always been more about a comedic attitude than the actual times the shows air. Since the end of his show on TBS, O'Brien has soared — freeing himself from the meddling of big media companies by building his own empire across several platforms, ranging from radio and podcasts for Sirius XM to travel specials on HBO Max and his own content leveraged across social media and YouTube.   \n   But now, seeing how energized Kimmel, The Daily Show and Colbert have become in recent weeks as big media companies and the Trump administration have threatened their existence, I'm wondering if there isn't another answer.   The allegiance last week among Kimmel, Colbert, Meyers and other late-night hosts — including Daily Show host Stewart, who crashed one of Kimmel's monologues — proved that these hosts and their insistence on speaking truth to power will likely only survive if they stick together.   United, they can create viral events that push through the media noise to draw attention – as when Kimmel ensured that his first post-suspension interview occurred on another late-night show that has been threatened by the president. And when these events go viral, they meet the audiences where they are, as late-night shows need to do more regularly.   And these hosts need one more thing: Their bosses, whose companies own America's most powerful media outlets, must support their employees when they speak out.   As a fan of the genre who has attended everything from an Arsenio Hall taping in 1990 to more recent shows by Colbert, Letterman, Meyers, Fallon, O'Brien and Stewart, I believe that late-night TV is an important cornerstone in America's comedy universe and that we'll all lose a lot if these shows largely go away.   Wouldn't it be fitting if the very attempts by Trump officials and power-hungry media executives to snuff out these hosts help endear their shows to an entirely new audience, eager to hear voices pushing back?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Media companies thought late night TV was irrelevant. Kimmel proved them wrong",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa3%2Fde%2Fbe5aecd7400ba36bc3067015e208%2F3116179-0319.jpg"
      ],
      "datePublished": "2025-10-13T10:00:00.000Z",
      "dateModified": "2025-10-13T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]