[
  {
    "title": "The political implications of the Supreme Court's ruling on Trump's tariffs",
    "url": "https://www.npr.org/2026/02/23/nx-s1-5722874/the-political-implications-of-the-supreme-courts-ruling-on-trumps-tariffs",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-23T11:40:45.000Z",
    "description": "\n      \n      The political implications of the Supreme Court's ruling on Trump's tariffs\n    \n        \n                Download\n                \n    ",
    "body": "\n      \n      The political implications of the Supreme Court's ruling on Trump's tariffs\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5722874/nx-s1-9659385\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      The Supreme Court has found some of President Trump's tariffs to be illegal. What are the political implications?   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The political implications of the Supreme Court's ruling on Trump's tariffs",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-23T11:40:45.000Z",
      "dateModified": "2026-02-23T11:40:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Politics chat: Trump says he'll raise tariffs despite Supreme Court ruling",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5719174/politics-chat-trump-says-hell-raise-tariffs-despite-supreme-court-ruling",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-22T13:08:38.000Z",
    "description": "\n      President Trump says he will raise global tariffs by 15% days after the Supreme Court ruled he doesn't have the emergency power to raise tariff",
    "body": "\n      President Trump says he will raise global tariffs by 15% days after the Supreme Court ruled he doesn't have the emergency power to raise tariffs. And the world waits to see if Trump will strike Iran.   \n\n    AYESHA RASCOE, HOST:  The Supreme Court on Friday delivered a stunning decision saying that President Trump doesn't have an emergency power to raise tariffs - a major promise of his. But the president says he's going to raise global tariffs by 15% anyway, under a different authority. On Friday, he said he was disappointed with the judges who voted no.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: They're against anything that makes America strong, healthy and great again. They also are a frankly disgrace to our nation, those justices.RASCOE: And the world braces for possible strikes on Iran as Trump beefs up U.S. military presence in the Middle East. We're joined now by NPR senior national political correspondent Mara Liasson. Welcome to the program, Mara.MARA LIASSON, BYLINE: Hi there.RASCOE: Well, you're always here. But, you know, welcome.(LAUGHTER)RASCOE: Let's start with those tariffs. Trump was not happy with the court's decision, was he?LIASSON: No. He was hopping mad as expected. He said the Supreme Court justices were disloyal, unpatriotic, they were swayed by foreign interests, they were an embarrassment, the decision was anti-American. He called them lapdogs and fools. The significance of this ruling was really big. I mean, this is the first time that the Supreme Court ruled on the merits, and this is a court that has a conservative supermajority appointed by Trump to put the brakes on Trump's efforts to expand executive power. They stood up for checks and balances. They reaffirmed the powers of Congress, which is supposed to be a coequal branch of government, at a time when Congress seems unwilling to do that for itself.RASCOE: Well, now President Trump says he's just going to raise the tariffs anyway under a different authority. Can he do that?LIASSON: The short answer is yes, he can. He says he's going to put global tariffs of 15% on all foreign goods. He's going to use a different section of the Trade Act, but those sections are much more cumbersome than the legal authority under which he claims sweeping powers. For instance, some of the tariffs will only last 150 days before Congress has to weigh in. Others could be permanent, but they require lengthy investigations.RASCOE: So how much does this matter that we are in a midterms year?LIASSON: It matters a lot. The politics of this are very complicated, and they're shifting. At first, this ruling looked like a godsend for Republicans. They were breathing a sigh of relief. The Supreme Court saved them from tariffs, which were costing consumers money, adding to voters' dissatisfaction with the economy. Sixty percent of voters say they disapprove of Trump's tariffs, and they thought that they would no longer have to defend these unpopular tariffs and maybe prices would go down. But that optimism lasted about five minutes because Trump immediately said that not only was he going to put more tariffs on under a different authority, but that authority calls for congressional approval. So now Republicans in Congress are going to have to show their loyalty to Donald Trump by voting to impose tariffs, taking personal responsibility for this. This is something they don't want to do. Now, he might back off if he doesn't have the votes. We did see six House Republicans join Democrats to vote against Trump's tariffs on Canada.RASCOE: And the bad news keeps coming for the administration. And, I mean, it's not good for the country. The economic report on Friday was not very good.LIASSON: No, it's just one quarter, but GDP did not grow as much as expected, just 1.4%. Inflation is still high at 3%, and this comes at a time when the midterm elections - the No. 1 issue for voters is affordability, and Republicans and the president have been on the back foot on that issue.RASCOE: Meanwhile, the world is waiting to see if Trump is going to follow up on this threat to bomb Iran. What are you hearing on that?LIASSON: Well, he sent a - the most massive buildup of U.S. military strength to the Persian Gulf since 2003. So if he decides he wants to make a major military strike on Iran, he has the weapons ready in the Middle East to do that. But no one is quite sure what he's going to decide. He says he's prefer a deal where Iran agrees to give up its nuclear program. And in the past, Trump has shown that he prefers military actions that you could call one-and-done, a quick bombing raid on Iran's nuclear facilities or a quick raid into Venezuela to nab Nicolás Maduro. We don't know if he has the stomach for a long, protracted fight. And if he wants to change the regime in Iran, that's what it would entail.RASCOE: So State of the Union is on Tuesday. What will you be listening for?LIASSON: Well, the timing of this is really incredible. The State of the Union is the president's biggest opportunity to speak to the public, any president's biggest opportunity. It's their biggest audience of the year. And the big question for me is how much time Trump will spend in his State of the Union address excoriating the Supreme Court justices, who will be sitting right in front of him. And how much time will he talk about affordability? How much time will he spend trying to convince voters that he is lowering prices? This is something that he has struggled to do consistently for many months.RASCOE: That's NPR senior national political correspondent Mara Liasson. Thank you so much.LIASSON: You're welcome.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Politics chat: Trump says he'll raise tariffs despite Supreme Court ruling",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-22T13:08:38.000Z",
      "dateModified": "2026-02-22T13:08:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats and Republicans agree on one thing: regulating the use of AI",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5712709/democrats-and-republicans-agree-on-one-thing-regulating-the-use-of-ai",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-22T13:08:26.000Z",
    "description": "\n      Republicans and Democrats in state capitols across the country agree on some things when it comes to regulating Artificial Intelligence and dat",
    "body": "\n      Republicans and Democrats in state capitols across the country agree on some things when it comes to regulating Artificial Intelligence and data centers.   \n\n    AYESHA RASCOE, HOST:  Unlike in Congress right now, Republicans and Democrats and state capitals agree on some major issues this year. In many places, lawmakers want to regulate the many ways companies and people use artificial intelligence, and they want to curb the sprawling, electricity-hungry data centers that make AI possible in the first place. To talk about some of the big trends this legislative season, we're joined by Samuel King with WXXI and the New York Public News Network in Albany and Regan McCarthy of WFSU in Tallahassee, Florida. Welcome.REGAN MCCARTHY, BYLINE: Hi, thank you.SAMUEL KING, BYLINE: Great to be here.RASCOE: Starting with AI, Regan, Florida Governor Ron DeSantis is a Republican who's often aligned with President Trump, but it seems like not necessarily on AI. What's DeSantis been doing as the session gets going there?MCCARTHY: Yeah. So DeSantis has unveiled what he's calling an AI bill of rights, and several parts of that plan have just passed in the Florida Senate. And that proposal includes making it illegal to use a person's name, image or likeness without their consent. It also includes protections for kids, like requiring parental consent before minors can engage with companion chatbots and requiring the bots to remind people that they aren't human. And so, as you mentioned, this is an area where President Trump and DeSantis may be headed in different directions. Trump issued an executive order trying to limit what states can do about AI on their own. DeSantis worries giving AI companies a free pass could be dangerous.(SOUNDBITE OF ARCHIVED RECORDING)RON DESANTIS: I really fear that if this is not addressed in an intelligent and proper way, you know, it could set off an age of darkness and deceit.MCCARTHY: So almost every state has a proposal to regulate AI, and some examples include making sure humans oversee decisions AI makes about employees or blocking AI surveillance that could be used to set different prices for different consumers.RASCOE: Samuel, how about in New York? Your state is run by Democrats, but is it looking similar there?KING: Yeah, Ayesha. Some of the things we're hearing sound similar to what we're hearing in Florida. Governor Kathy Hochul has thrown her support behind legislation aimed at online safety. The proposals expand age verification requirements, including for online gaming and social media platforms and seek to keep strangers from contacting kids online by placing privacy settings on those platforms at their highest levels by the fall. New York has already required chatbots to identify themselves, and this year is looking at more limits on how they work on social media. Here's Hochul speaking at her high school alma mater, just outside Buffalo, earlier this year.(SOUNDBITE OF ARCHIVED RECORDING)KATHY HOCHUL: Under our proposals, we're removing that burden from parents and placing the responsibility where it belongs - on the shoulders of the app companies and the platforms themselves.KING: A lot of states led by both parties have bills about how kids can interact with chatbots. Some are looking at regulating how AI is used in mental health treatment, like Maine, but these could also face a lot of opposition from big AI companies and maybe President Trump.RASCOE: Of course, when you talk about AI and other internet activity, that's related to another big issue both parties are looking at, and that's data centers. What are the concerns there?KING: This has become a major issue because of power and environmental concerns across the country. To operate, the centers require a large amount of electricity and fresh water. So opponents believe they are driving up the cost of energy for everyone. Democratic lawmakers in New York, for example, are proposing a temporary ban on data centers. That bill hasn't seen much movement yet, but Hochul has announced the state's Public Service Commission will take a close look at the issue to ensure that data centers are, quote, \"paying their fair share.\" Meanwhile, Maine legislators are looking at a ban on new large data centers. While in Colorado, a proposal would require data centers to at least use renewable energy for their operations. Meanwhile, the White House, a lot like the AI battle Regan mentioned, has largely been supportive of data centers, and reports say the administration is trying to get the big tech companies to voluntarily agree to commitments preserving electricity and water.MCCARTHY: Yeah. So those data centers are a big concern for Republican-led states, too, including here in Florida, where lawmakers are raising concerns about issues like the impact on the power grid, water use, and the possibility of passing higher utility costs along to residents, even the possibility of noise pollution. So the Senate is working to put some protections in place now to address that. DeSantis says he thinks a lot of the arguments in favor of data centers, like the idea that they'll drive jobs or lower property tax rates, are largely overinflated. And one other thing worth noting is that amid this energy use discussion, lawmakers across the country are looking into the possible expansion of nuclear energy. That includes restarting or building new kinds of nuclear reactors.RASCOE: OK. Well, we should know that there are tens of thousands of bills lawmakers file every year. What are some of the other big issues?MCCARTHY: Yeah. So here's where you'll start to see a bit more of that partisan divide. So one of the big-ticket issues in Florida is immigration. And while many blue states are putting rules in place to limit immigration enforcement efforts, many red states, like Florida, are looking into more rules to crack down on people who are in the country illegally. For example, Florida is looking into proposals to reduce access to mortgages or changing how it administers its driver's license tests. And Florida's also got some measures this session to expand firearm access. One proposal would allow certain faculty to carry guns on college and university campuses. And while housing affordability is a major issue across the country, one of the ways Florida Governor Ron DeSantis wants to address that is by cutting property taxes. That's a big concern for Democrats here who worry about the impact to local governments and say decreasing property insurance rates would be a better path.RASCOE: Samuel, what are the other concerns out there in blue-state New York?KING: Well, one is housing. They want to keep people here so they can afford housing and not go to states like Florida, so they're looking at streamlining some environmental regulations. Other states are looking at zoning. Immigration remains a huge issue. States like New York and Maryland are trying to limit local law enforcement cooperation with ICE after what happened in Minnesota. And states are grappling with the potential impact of H.R.1, Trump's big tax and spending bill. In New York, there's a bit of a reprieve for this budget cycle as some of the Medicaid and other cuts don't take effect until next year, but there could be potential cuts to Medicaid and other social programs in future years. So groups are trying to get their request in now because the money may not be there next year.RASCOE: That's Samuel King in Albany and Regan McCarthy in Tallahassee. Thank you so much.MCCARTHY: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats and Republicans agree on one thing: regulating the use of AI",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-22T13:08:26.000Z",
      "dateModified": "2026-02-22T13:08:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vietnam Veterans sue to block proposed 'Independence Arch' near Arlington National Cemetery",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5721786/vietnam-veterans-sue-trump-arch",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5777x3250+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F74%2F89bc5033437eafa3fc534e390f64%2Fap26034830892619.jpg",
    "tag": "Politics",
    "date": "2026-02-21T19:27:56.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Memorial Circle, the proposed plot of la",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Memorial Circle, the proposed plot of land near Memorial Bridge where the Independence Arch could be built is seen in Washington, Tuesday, Feb. 3, 2026.\n                \n                    Nathan Howard/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nathan Howard/AP\n    \n\n   \n   A group of Vietnam War veterans and a retired architectural historian have filed a federal lawsuit seeking to block construction of a proposed monument near Arlington National Cemetery.   The lawsuit, filed Thursday in the U.S. District Court for the District of Columbia, challenges President Trump's plans for \"Independence Arch,\" a 250-foot structure proposed for Memorial Circle.   The plaintiffs, represented by Public Citizen Litigation Group, call the proposed plan a \"vanity project\" that would disrupt one of Washington's most symbolically charged sightlines between the Lincoln Memorial and Arlington House, a view designed to evoke national unity after the Civil War.   \n   Vietnam veterans Michael Lemmon, Shaun Byrnes and Jon Gundersen believe the structure would \"dishonor their military and foreign service\" by intruding on a solemn view they visit regularly, according to the complaint.   The arch could also \"pose a hazard to air travel at nearby Reagan National Airport,\" the plaintiffs argue. At 250 feet, the proposed arch would stand more than twice the height of the Lincoln Memorial and sit directly on the ceremonial axis that anchors the capital's monumental core.   The lawsuit names Trump, senior White House officials and the National Park Service (NPS) as defendants. It alleges the plan violates multiple federal laws, including the Commemorative Works Act, the National Environmental Policy Act and the National Historic Preservation Act.   NPR reached out to the White House and NPS for comment about the lawsuit but have not received a response.   \n   Administration officials have framed the proposal as part of a broader effort to commemorate the country's 250th anniversary with new monuments and public works projects highlighting American history and military service.   White House spokesman Davis Ingle said in a statement to The Washington Post the arch \"will enhance the visitor experience at Arlington National Cemetery for veterans, the families of the fallen, and all Americans alike, serving as a visual reminder of the noble sacrifices borne by so many American heroes throughout our 250-year history.\"   \n   Ingle also said Trump \"will continue to honor our veterans and give the greatest Nation on earth America the glory it deserves.\"   The plaintiffs also argue that approval has not been granted and that required environmental and historic preservation reviews have not been completed. Under the Commemorative Works Act, memorials built on federal land in Washington generally require authorization from Congress.   Legal opposition to the project follows a separate lawsuit by the National Trust for Historic Preservation over plans for a privately funded ballroom in place of the White House East Wing.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vietnam Veterans sue to block proposed 'Independence Arch' near Arlington National Cemetery",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5777x3250+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F74%2F89bc5033437eafa3fc534e390f64%2Fap26034830892619.jpg"
      ],
      "datePublished": "2026-02-21T19:27:56.000Z",
      "dateModified": "2026-02-21T19:27:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to raise global tariffs to 15%",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5722111/trump-global-tariffs-15-percent",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6973x3922+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdd%2Fb1%2F1f494cb74151a2d2a6f29fa18f1e%2Fgettyimages-2262154068.jpg",
    "tag": "Politics",
    "date": "2026-02-21T18:57:02.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump answers questions",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump answers questions during a press briefing held at the White House Feb. 20, 2026 in Washington, D.C.\n                \n                    Aaron Schwartz/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Aaron Schwartz/Getty Images\n    \n\n   \n   President Trump on Saturday said he plans to raise global tariffs from 10% to 15%.   \"...I, as President of the United States of America, will be, effective immediately, raising the 10% Worldwide Tariff on Countries, many of which have been \"ripping\" the U.S. off for decades, without retribution (until I came along!), to the fully allowed, and legally tested, 15% level,\" the president posted on Truth Social.   The announcement was made a day after the U.S. Supreme Court struck down the president's sweeping use of emergency powers to impose tariffs under the International Emergency Economic Powers Act (IEEPA). The 6-3 ruling is a major blow to Trump's economic policy agenda.   \n   Trump said his decision to raise taxes on imports to 15% is based on \"a thorough, detailed, and complete review of the ridiculous, poorly written, and extraordinarily anti-American decision on Tariffs issued yesterday.\"   Many countries were still reeling from Trump's announcement of new tariffs Friday night when he signed a proclamation to impose a temporary 10% hike on imports of goods from around the world. The tariffs would be limited to 150 days.   In the proclamation, Trump cites the Trade Act of 1974 as authorizing the tariffs. Trump made clear on Saturday he plans to continue centering tariffs in his economic policy, despite legal setbacks.   \"During the next short number of months, the Trump Administration will determine and issue the new and legally permissible Tariffs, which will continue our extraordinarily successful process of Making America Great Again,\" he said in the social media post.   The president's proclamation issued Friday said that certain goods from Canada and Mexico covered under a separate agreement with the U.S. would be exempt from the new tariffs. It also said the levies would not apply to certain agricultural products, including beef, tomatoes, and oranges.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to raise global tariffs to 15%",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6973x3922+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdd%2Fb1%2F1f494cb74151a2d2a6f29fa18f1e%2Fgettyimages-2262154068.jpg"
      ],
      "datePublished": "2026-02-21T18:57:02.000Z",
      "dateModified": "2026-02-21T18:57:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Only a fraction of House seats are competitive. Redistricting is driving that lower",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5707254/power-trump-congress-house-representatives-voters-control",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+434/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F71%2F98%2Fb5c2883e4abb98eb68eba50568b2%2Fgettyimages-2223367744.jpg",
    "tag": "Politics",
    "date": "2026-02-22T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The extraordinary mid-decade redistricti",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The extraordinary mid-decade redistricting push has \"eviscerated the competitive range of districts in which Americans have a real say over who controls Congress in November,\" says David Wasserman, senior elections analyst for the Cook Political Report.\n                \n                    Kayla Bartkowski/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kayla Bartkowski/Getty Images\n    \n\n   \n   Fewer congressional contests are expected to be competitive this fall, compared with past election cycles, and experts say the extraordinary mid-decade redistricting efforts initiated by President Trump are largely to blame.   Fewer competitive seats means the overwhelming majority — more than 90% — of congressional races will pretty much be decided during primary elections, which see far fewer voters participate than general elections.   \"Right now, we only rate 18 out of 435 races as toss ups, which means that less than 5% of Americans will truly be deciding who's in control of the House,\" David Wasserman, senior elections analyst for the Cook Political Report, told NPR.   \n   This disparity in the voting power of Americans in congressional races has been a worsening problem for several election cycles.   Unite America Institute, which tracks what it refers to as the \"primary problem\" and advocates for election reforms, calculated that in 2024, just 7% voters elected 87% of U.S. House races.   Loading...\n   Voters have self-sorted themselves geographically, and technology in recent years has allowed lawmakers to more effectively carve up congressional districts that give one party an advantage over another.   Nick Troiano, executive director of Unite America, said the mid-decade redistricting prompted by Trump last year has further reduced the number of competitive seats. His organization says 32 states currently don't have a single competitive congressional race.   \"The primary problem is bad and getting worse,\" he told NPR. \"We are about to enter a midterm election season that will be the least competitive of our lifetimes, which means that we will have, no matter who wins in November, the least accountable Congress of our lifetime.\"   Last year, Trump asked Texas lawmakers to redraw the state's congressional map to create five more seats that could favor Republicans in 2026. Democratic leaders in California responded, putting forward a successful ballot measure to circumvent the state's independent redistricting commission and create five more favorable seats for Democrats.   \n   Lawmakers in other states, including North Carolina and Missouri, crafted new maps as well, and Florida and Virginia are among the states that may join them.   \n   But so far, Wasserman said the redrawing of congressional boundaries ahead of this year's elections hasn't led to any \"pronounced advantage\" for either Republicans or Democrats.   \"Instead, what it's done is it's eviscerated the competitive range of districts in which Americans have a real say over who controls Congress in November,\" he said.   Wasserman explained that even if one were to include races that Cook rates as \"leaning\" toward one party or another, that would only be 36 seats.   \"That's still less than 10% of the House,\" he said. \"By comparison, at this point in Trump's first term, we had 48 races that were competitive between the two parties.\"   Wasserman said new district lines in California and Texas are driving most of this.   \"Whereas we used to have a robust number of Republicans from California and Democrats from Texas and Florida, today blue states' delegations are becoming bluer, red states' delegations are becoming redder,\" he said. \"And there are fewer opportunities for bipartisan dialogue.\"   Primary voters tend to be more ideologically extreme than the general public   Troiano said there are some serious democratic issues raised by the fact that so few voters will have so much power to decide what party will control Congress.   For one, he says, primary voters are not representative of the broader American electorate. According to an analysis from his group, primary voters tend to be older, whiter, wealthier, more educated and more ideologically extreme than the general public.   \"And so when you look at an old, white, wealthy Congress that is ideologically polarizing, can't get anything done, they reflect exactly who sent them there,\" Troiano said.   There have been some efforts in recent years to open up primaries to independent voters — which is the fastest-growing part of the U.S. electorate. New Mexico, for instance, now allows non-affiliated and independent voters to participate in party primaries. However, Louisiana and West Virginia recently went the other way, restricting some primaries to just registered party members. Currently, 17 states have either completely closed or partially closed primaries.   \n   And in 2024, there were several ballot measures before voters in states like Arizona, Colorado, Nevada and Oregon that would have created nonpartisan primaries. But those statewide efforts failed across the board.   Unite America advocates for nonpartisan primaries or the inclusion of independent voters in party primaries for a slew of reasons, but one of their biggest arguments is that they allow more voters to take part in the most determinative elections.   And that's especially important, Troiano said, as more states whittle down the number of competitive seats.   \"So if you think dysfunction and division is bad right now in Washington,\" he said, \"it's going to get worse in the next congressional session because of the lack of competition in this year's elections.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Only a fraction of House seats are competitive. Redistricting is driving that lower",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+434/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F71%2F98%2Fb5c2883e4abb98eb68eba50568b2%2Fgettyimages-2223367744.jpg"
      ],
      "datePublished": "2026-02-22T10:00:00.000Z",
      "dateModified": "2026-02-22T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poll: Most say the state of the union is not strong and the U.S. is worse off",
    "url": "https://www.npr.org/2026/02/23/nx-s1-5720975/poll-trump-state-of-the-union-sotu",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1273x715+114+75/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F43%2Fa6%2Fb94368904435ba92579409d4854c%2Fmarist-poll-2026-sotu.png",
    "tag": "Politics",
    "date": "2026-02-23T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump holds a press briefing h",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump holds a press briefing held at the White House on Friday after the U.S. Supreme Court ruled against his use of emergency powers to implement international trade tariffs.\n                \n                    Alex Wong/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Wong/Getty Images\n    \n\n   \n   As President Trump is set to deliver his first official State of the Union address of his second term, most Americans say the country is worse off than a year ago and that the state of the union is not strong, according to the latest NPR/PBS News/Marist poll.   Additionally, more people than ever are describing the direction Trump is moving the country as \"change for the worse.\"   Loading...\n   \"It's not unusual for a president having a long 'to do' list for the [State of the Union address], but President Trump's 'check list' seems exceptionally large,\" said Lee Miringoff, director of the Marist University Institute for Public Opinion, which conducts the survey. The address, he said, represents \"a big opportunity for him to try to reset with the nation, but it's a tall order when views about him are so baked in.\"   The poll is the latest sign of the political headwinds Trump is facing, particularly with persuadable voters. But given that his base continues to stand behind him — more than 8 in 10 Republicans think the country is better off than a year ago — Trump is unlikely to cede any ground in Tuesday's address.   The survey of 1,462 adults was conducted from Jan. 27-30 and has a margin of error of +/-2.9 percentage points, meaning results could be about 3 points higher or lower than the reported number. Pollsters reached out to respondents in multiple ways, including with live callers, by text and online and in both English and Spanish.   \n   Respondents largely say the state of the union is not strong   By a 57%-to-43% margin, respondents said the state of the union is not strong, a 4-point increase from a year ago.   That includes 8 in 10 Democrats and about two-thirds of independents. Roughly three-quarters of Republicans, however, said they think it is strong.   One of the sharpest divides on this question is by education — 69% of college graduates said the state of the union is not strong, while those without degrees are split 50%-50% on whether it's strong or not.   Among the groups most likely to say the state of the union is not strong are those over 60 years old and women who live in small cities or the suburbs. There is a notable gender divide, with women 12 points more likely to say the union is not strong compared to men (63% vs. 51%).   Republicans, white evangelical Christians, people who live in rural areas and parents with children under 18 were the most likely to say the state of the union is strong.   Loading...\n   A country viewed as worse off with Trump's policies to blame   Sixty percent said the country is worse off than a year ago, including about two-thirds of independents and 9 in 10 Democrats.   Like most other issues, 8 in 10 Republicans side with Trump.   \n   Most respondents (55%) also see the direction Trump is moving the country in as a \"change for the worse.\" That's the highest number recorded by Marist on the question between both of Trump's terms.   What's more, 53% of respondents said Trump's policies have had a mostly negative impact on them personally, 4 points higher than a year ago.   Most say there's a serious threat to democracy   A whopping 78% said they see a serious threat to the future of American democracy, and 68% said the system of checks and balances dividing power between the president, Congress and the courts is not working well.   \n   Majorities across political groups — 91% of Democrats, 80% of independents and 61% of Republicans — said they see a serious threat to the future of democracy. But, as seen in past surveys and interviews, their reasons for that might well be very different.   On checks and balances, there's been a 12-point jump from a year ago in the percentage of those saying the system isn't working well. That was driven by an 11-point increase from independents and 17 points from Republicans, though a majority of Republicans continue to say the system is working well.   \n   The high numbers of respondents saying the system isn't working is reflective of the broader decline in trust in institutions and government.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poll: Most say the state of the union is not strong and the U.S. is worse off",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1273x715+114+75/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F43%2Fa6%2Fb94368904435ba92579409d4854c%2Fmarist-poll-2026-sotu.png"
      ],
      "datePublished": "2026-02-23T10:00:00.000Z",
      "dateModified": "2026-02-23T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TSA says PreCheck still operational after previous announcement of suspension",
    "url": "https://www.npr.org/2026/02/22/nx-s1-5722770/homeland-security-suspends-tsa-precheck-and-global-entry-airport-security",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3744x2106+0+195/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2Ff2%2F3c61bcd649019ca12fe88efdc61d%2Fap26044775586476.jpg",
    "tag": "Politics",
    "date": "2026-02-22T07:07:58.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - U.S. Homeland Security Secretary ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - U.S. Homeland Security Secretary Kristi Noem, right, shakes hands with Transportation Security Administration Officer Monica Degro at a news conference at Harry Reid International Airport, Nov. 22, 2025, in Las Vegas.\n                \n                    Ronda Churchill/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Ronda Churchill/AP\n    \n\n   \n   WASHINGTON — The Transportation Security Administration said Sunday that its PreCheck program would remain operational despite an earlier announcement from the U.S. Department of Homeland Security that the airport security service was being suspended during the partial government shutdown.   \"As staffing constraints arise, TSA will evaluate on a case by case basis and adjust operations accordingly,\" the agency said.   It was not immediately clear whether Global Entry, another airport service, would be affected. PreCheck and Global Entry are designed to help speed registered travelers through security lines, and suspensions would likely cause headaches and delays.   \n   The turmoil is tied to a partial government shutdown that began Feb. 14 after Democrats and the White House were unable to reach a deal on legislation to fund the Department of Homeland Security. Democrats have been demanding changes to immigration operations that are core to President Donald Trump's deportation campaign.   Homeland Security previously said it was taking \"emergency measures to preserve limited funds.\" Among the steps listed were \"ending Transportation Security Administration (TSA) PreCheck lanes and Customs and Border Protection (CBP) Global Entry service, to refocus Department personnel on the majority of travelers.\"   Secretary Kristi Noem said in a statement on Saturday night that \"shutdowns have serious real world consequences.\"   One group of fliers will definitely be affected, according to TSA.   \"Courtesy escorts, such as those for Members of Congress, have been suspended to allow officers to focus on the mission of securing America's skies,\" the agency said.   Airlines for America, a trade group representing major carriers, said Saturday night that \"it's past time for Congress to get to the table and get a deal done.\" It also criticized the announcement by saying it was \"issued with extremely short notice to travelers, giving them little time to plan accordingly.\"   Democrats on the House Committee on Homeland Security criticized Homeland Security handling of airport security after the initial announcement on Saturday night. They accused the administration of \"kneecapping the programs that make travel smoother and secure.\"   \n   Sen. Andy Kim, a New Jersey Democrat, said Noem's actions are part of an administration strategy to distract from other issues and shift responsibility.   \"This administration is trying to weaponize our government, trying to make things intentionally more difficult for the American people as a political leverage,\" he told CNN on Sunday. \"And the American people see that.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TSA says PreCheck still operational after previous announcement of suspension",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3744x2106+0+195/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb2%2Ff2%2F3c61bcd649019ca12fe88efdc61d%2Fap26044775586476.jpg"
      ],
      "datePublished": "2026-02-22T07:07:58.000Z",
      "dateModified": "2026-02-22T07:07:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military airlifts small reactor as Trump pushes to quickly deploy nuclear power",
    "url": "https://www.npr.org/2026/02/21/nx-s1-5721761/us-military-airlifts-small-reactor",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3813x2145+0+10/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2Fb7%2F9aa477d74802b781d91ee6f79474%2Fap26050704729644.jpg",
    "tag": "Politics",
    "date": "2026-02-21T15:23:17.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Valar Atomics microreactor is seen on ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Valar Atomics microreactor is seen on a C-17 aircraft, without nuclear fuel, at March Air Reserve Base, Calif., Sunday, Feb. 15, 2026.  The reactor was transported from March Air Reserve Base to Hill Air Force Base in Utah.\n                \n                    Matthew Daly/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Matthew Daly/AP\n    \n\n   \n   HILL AIR FORCE BASE, Utah  — The Pentagon and the Energy Department for the first time airlifted a small nuclear reactor from California to Utah, demonstrating what they say is U.S. potential to quickly deploy nuclear power for military and civilian use.   The nearly 700-mile flight last weekend — which transported a 5-megawatt microreactor without nuclear fuel — highlights the Trump administration's drive to promote nuclear energy to help meet skyrocketing demand for power from artificial intelligence and data centers, as well for use by the military.   \n   Energy Secretary Chris Wright and Undersecretary of Defense Michael Duffey, who traveled with the privately built reactor, hailed the Feb. 15 trip on a C-17 military aircraft as a breakthrough for U.S. efforts to fast-track commercial licensing for the microreactors, part of a broader effort by the Trump administration to reshape the country's energy landscape.   A new emphasis on nuclear energy   President Donald Trump supports nuclear power — a carbon-free source of electricity — as a reliable energy source, even as he has been broadly hostile to renewable energy and prioritizes coal and other fossil fuels to produce electricity.   Skeptics warn that nuclear energy poses risks and say microreactors may not be safe or feasible and have not proved they can meet demand for a reasonable price.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Energy Secretary Chris Wright speaks at a news conference at March Air Reserve Base, Calif., Sunday Feb. 15, 2026.\n                \n                    Matthew Daly/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Matthew Daly/AP\n    \n\n   \n   Wright brushed those concerns aside as he touted progress on Trump's push for a quick escalation of nuclear power. Trump signed a series of executive orders last year that allow Wright to approve some advanced reactor designs and projects, taking authority away from the independent safety agency that has regulated the U.S. nuclear industry for five decades.   \"Today is history. A multi-megawatt, next-generation nuclear power plant is loaded in the C-17 behind us,\" Wright said before the two-hour flight from March Air Reserve Base in California to Hill Air Force base in Utah.   \n   The minivan-sized reactor transported by the military is one of at least three that will reach \"criticality\" — when a nuclear reaction can sustain an ongoing series of reactions — by July 4, as Trump has promised, Wright said.   \"That's speed, that's innovation, that's the start of a nuclear renaissance,\" he said.   Microreactors would be for civilian and military use   Currently, there are 94 operable nuclear reactors in the U.S. that generate about 19% of the country's electricity, according to the U.S. Energy Information Administration. That's down from 104 reactors in 2013 and includes two new commercial reactors in Georgia that were the nation's first large reactors built from scratch in a generation.   \n   Recognizing delays inherent to deployment of new, full-scale reactors, the industry and government have focused in recent years on more efficient designs, including a small modular reactor proposed by the nation's largest public power company, the Tennessee Valley Authority.   Microreactors, designed to be portable, can take that a step further and \"accelerate the delivery of resilient power to where it's needed,\" Duffey said. Eventually, the mobile reactors could provide energy security on a military base without the civilian grid, he and other officials said.   The demonstration flight \"gets us closer to deploy nuclear power when and where it is needed to give our nation's warfighters the tools to win in battle,\" Duffey said.   The reactor transported to Utah will be able to generate up to 5 megawatts of electricity, enough to power 5,000 homes, said Isaiah Taylor, CEO of Valar Atomics, the California startup that produced the reactor. The company hopes to start selling power on a test basis next year and become fully commercial in 2028.   Some safety concerns haven't been addressed, experts say   Edwin Lyman, director of nuclear power safety at the Union of Concerned Scientists, said the transport flight — which included a throng of reporters, photographers and TV news crews — was little more than \"a dog-and-pony show\" that merely demonstrated the Pentagon's ability to ship a piece of heavy equipment.   \n   The flight \"doesn't answer any questions about whether the project is feasible, economic, workable or safe — for the military and the public,\" Lyman said in an interview.   \n   The Trump administration \"hasn't made the safety case\" for how microreactors, once loaded with nuclear fuel, can be transported securely to data centers or military bases, Lyman said.   Officials also have not resolved how nuclear waste will be disposed, although Wright said the Energy Department is in talks with Utah and other states to host sites that could reprocess fuel or handle permanent disposal.   The microreactor flown to Utah will be sent to the Utah San Rafael Energy Lab for testing and evaluation, Wright said. Fuel will be provided by the Nevada National Security site, Taylor said.   \"The answer to energy is always more,\" Wright said. After four years of restrictions on more polluting forms of energy under the Biden administration, he said, \"now we're trying to set everything free. And nuclear will be flying soon.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military airlifts small reactor as Trump pushes to quickly deploy nuclear power",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3813x2145+0+10/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2Fb7%2F9aa477d74802b781d91ee6f79474%2Fap26050704729644.jpg"
      ],
      "datePublished": "2026-02-21T15:23:17.000Z",
      "dateModified": "2026-02-21T15:23:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. has a quarter fewer immigration judges than it did a year ago. Here's why",
    "url": "https://www.npr.org/2026/02/23/g-s1-110911/trump-immigration-judges-dismissals-numbers",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+574/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F18%2F57%2F7392de054151bf6826c0a5a13b8c%2Fgettyimages-2258753132.jpg",
    "tag": "Politics",
    "date": "2026-02-23T10:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The front lobby of the Miami Immigration",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The front lobby of the Miami Immigration Court seen on Jan. 28, 2026 in Miami, Florida.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   Amiena Khan was supposed to have the day off that December. But, in a supervisory role at an immigration court, \"you never really are on leave,\" she said. So Khan was working — mostly on performance evaluations for the 36 immigration judges and dozens of staff members she oversaw at the court in Manhattan's 26 Federal Plaza.   At 11:29 a.m., while in the middle of a meeting, Khan received the email she had been dreading for months: she had been fired. As her phone began blowing up, she learned that six of the judges she supervised had been terminated as well.   \n   \"As I tried to reassure them, I was trying to explain, 'But I've been terminated too,'\" said Khan, who had been an assistant chief immigration judge at the court. \"It was chilling and — in how the terminations were effectuated — it was disrespectful. It was utter disregard of dedicated public servants.\"   While Khan's firing was upsetting, she said it wasn't altogether shocking. The Trump administration fired nearly 100 judges in 2025. The dismissals were part of a larger push by the Trump administration to reshape America's immigration courts.   \n   The number of judges in the nation's immigration courts shrunk by about a quarter in the last year due to firings and resignations — even when accounting for new hires. Twelve immigration courts have lost over half of their judges. Many courts are down to skeleton crews to handle thousands of cases; two courts have no judges at all.   In total, the Department of Justice's Executive Office for Immigration Review, or EOIR, lost over 400 legal assistants, attorney advisers and legal administrative specialists, according to data obtained and verified by NPR.   The continued drain of personnel and resources from the already strained immigration court system has contributed to depleted staff morale, mounting case backlogs — and a floundering due process system.   \n   Some former judges call this a shrinkage of America's immigration courts that sends a clear message from the Trump administration: to green-light mass deportations, and get rid of the judges they think stand in the way.   \n   \"You are telling every other judge that is left that they better not be following the law or their conscience; that they need to apply the law as you are interpreting it,\" said Arwen Swink, a former immigration judge fired from a San Francisco court in December. \"You lose a little piece of justice. You lose some fundamental fairness, and understandably, you undermine confidence in the proceedings.\"   The Trump administration has defended its personnel decisions, saying judges under the Biden administration were too lenient with granting asylum or other statuses to those seeking to stay in the U.S.   \"After four years of the Biden Administration forcing Immigration Courts to implement a de facto amnesty for hundreds of thousands of aliens, this Department of Justice is restoring integrity to our immigration system by following the law, timely completing cases, and hiring the most talented legal professionals to join in our mission to protect national security and public safety,\" a DOJ spokesperson said in a statement to NPR in response to questions about the loss of personnel.   Loading...\n   Cuts nationwide, with some courts hit worse than others   On Feb. 4, 2025 — the day before the first immigration judge firing under President Trump's second term — the corps of permanent immigration judges consisted of 726 people: 683 immigration judges and 43 assistant chief immigration judges. They were spread across 75 courts nationwide.   As of Monday, there are 520 permanent immigration judges and 33 assistant chief immigration judges, even after accounting for recent new hires.   \n   Over the next several months, the Trump administration fired nearly 100 of these judges, according to an independent tally kept by NPR. Dozens more judges retired or resigned, citing discomfort surrounding new policies about how they were supposed to adjudicate, according to interviews with current and former EOIR staff.   \"I really wanted to retire from this job much, much later than I did,\" said Ana Partida, a judge who retired from the Otay Mesa court in San Diego in October. \"I no longer felt that I had judicial independence to conduct my courtroom and to make decisions under the law as I interpreted it.\"   \n   In total, 202 judges who were working in early 2025 are no longer there. Attrition has trickled down. About 75% of the attorney advisers have left EOIR. Fifty-four percent of court supervisors are also gone – which means that those who remain are managing multiple courts at once.   Loading...\n   Five courts have more judges assigned to them than they did at the start of 2025. Separately, the Baton Rouge Immigration Court in Louisiana, created during the Biden administration, officially opened last year, but was staffed with existing judges who were previously assigned to other locations.   Firings \"sent waves all across the United States\"   For years, being an immigration judge was considered a stable job.   \"When I was onboarded, there were all kinds of jokes in the agency that if you were a judge and you wanted to get fired, they'd have to catch you with a bloody axe,\" said Swink, the former San Francisco judge, who had been at the agency since December 2016. \"It was very, very, very rare for judges to be fired.\"   The Trump administration began 2025 by wiping the slate clean by letting go of leadership at the highest levels of EOIR. Then it moved to terminating judges who were still within their two-year probationary period, a trial period for federal workers before they are \"converted\" to permanent employees.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Immigration and Customs Enforcement agents look over lists of names and their hearing times and locations inside the Federal Plaza courthouse before making arrests in June 2025 in New York.\n                \n                    Bryan R. Smith/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Bryan R. Smith/AFP via Getty Images\n    \n\n   \n   The first judge fired was Tania Nemer in the Cleveland Immigration Court. She was dismissed while in the middle of a hearing and escorted out of the building. (She has since sued over her termination, arguing it violated civil rights law and her First Amendment rights.)   \"Being walked off a bench like you're a criminal is just very shocking,\" Nemer said. \"That shock sent waves all across the United States. Everyone heard that this judge from Cleveland got escorted out of the building.\"   But by the end of the year, the administration moved beyond probationary workers, with tenured judges and DOJ employees being cut.   \n   Khan, the courthouse supervisor at New York's 26 Federal Plaza immigration court, pushed back on the idea that dismissed judges weren't meeting work standards, as the administration has argued.   \"The message and the mission of [EOIR] is to ensure fundamentally fair hearings and due process and efficiency. And that's what immigration judges strive to do,\" Khan said. \"As a supervisor of the dismissed judges, each and every one of them was meeting their obligations.\"   EOIR has previously said that any staff reductions have not affected productivity. But the system still has a nearly 4 million case backlog.   \n   Those who stay face push to be \"deportation judges\"    Judges and staff who are left in the immigration courts describe the past year as traumatizing and demoralizing. They say the current justice system is fundamentally different from one a year ago.   One visible change was to the work environment.   From New York to Connecticut to San Francisco, people in otherwise bureaucratic roles like clerks, interpreters and judges were surrounded by the chaos of violent arrests by Immigration and Customs officers in the hallways of courtrooms and witnessed these agents clash with protestors outside, several told NPR.   \n   \"There were a couple of times where we could hear respondents screaming when they were getting arrested. You have to pretend you're not hearing or seeing anything,\" said a court clerk at an immigration court who spoke on the condition of anonymity out of fear of reprisals for their position. \"Because you're not really supposed to show emotion in court, you're supposed to be neutral.\"   Judges also feel pressure to decide cases in line with the administration's priorities.   A public hiring campaign to beef up the immigration court system with \"deportation judges\" is in full swing, as the Trump administration seeks to make up for the judges who were fired or left.   \n   \"Deliver justice to criminal illegal aliens. Become a deportation judge. Save your country,\" the social media ads read.   Olivia Cassin saw an advertisement for deportation judges posted online by the Department of Homeland Security on Nov. 21, 2025 — the same day that she was fired from the immigration court at 290 Broadway Court in New York.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Federal agents patrol the halls of immigration court at the Jacob K. Javits Federal Building in July 2025 in New York City.\n                \n                    Michael M. Santiago/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Michael M. Santiago/Getty Images\n    \n\n   \n   \"We were like, that's a hoax, that can't be,\" Cassin said. \"And then we looked at the website for the Department of Justice, and there was the same. It's a clear message that what you're there to do – is not to carefully examine each case for people due process. The main point seems to be expedited deportation and resolution of cases.\"   Since launching the campaign in November, DOJ has hired 17 permanent judges, most who come from ICE and other DHS backgrounds, and 52 temporary judges. The temporary judges are military lawyers approved for temporary assignments by the Pentagon.   New judges who don't comply with the administration's priorities may already be facing consequences. One JAG judge, Christopher Day, a U.S. Army Reserve lawyer, had granted asylum and relief from immediate deportation at a higher rate than his other JAG counterparts, according to EOIR data compiled by Mobile Pathways.   Day has been removed from his post, per EOIR's website.   \n   Courts squeezed, one will shutter as judges are fired    While the majority of courts across the country have lost judges, the impacts have not been spread evenly. Of the 17 new permanent judges onboarded by the Trump administration, only one has been assigned to work in a court that has lost the majority of its judges.   EOIR declined to specify how it allocates new judges, but noted that any immigration judge can hear any case at any time throughout the country to assist with caseloads.   Loading...\n   It's been an especially tumultuous year for the San Francisco Immigration Court. The court was a visible point of conflict in 2025, as immigrant justice groups frequently rallied outside it to protest ICE arrests.   At the start of 2025, the judges in San Francisco were pushed to hear four cases per day — double their typical workload — and were told to grant asylum more sparingly, according to multiple interviews with current and former judges. Then, the firings and resignations began.   In 2025, the court lost 16 judges — the most of any court in the country. NPR confirmed that at least 12 of these people were fired.   EOIR announced that the court would be closing its doors at 100 Montgomery St. at the end of the year. The caseload at San Francisco, which is currently sitting at around 120,000 immigration cases, will be transferred to the Concord Immigration Court in a neighboring city, which has 60,000 cases of its own, according to December Transactional Records Access Clearinghouse data.   \"If you're trying to promote access to justice, having the San Francisco court open is a big boon,\" Swink said. \"But if the goals are the opposite, then a court like San Francisco would be first on the chopping block.\"   \n   EOIR spokesperson Kathryn Mattingly told NPR the move to Concord \"would be more cost-effective.\"   \n   \"Tremendous weight\" on smaller courts   While losses have been spread across the country, some of the biggest impacts have been felt inside smaller courts, fourteen of which are now operating with two or fewer permanent judges.   \"Even with a fully staffed court and wonderful people in your court, it is a very difficult job to do because you take so much of that secondary trauma home,\" said Partida, who retired from the Otay Mesa court in San Diego. Her two former colleagues now must oversee more than 1,000 active cases in total.   As the number of detentions surge and judge caseloads increase, \"the stress of having no resources and no help, even as to other judges hearing cases, that is a tremendous weight,\" she added.   The Aurora Immigration Court in Colorado and the Oakdale Immigration Court in Louisiana, which started 2025 with two and three judges respectively, now have zero permanent judges. They both still have an ACIJ, or court supervisor, who may be handling dockets, although both of those people are also responsible for supervising other courts.   At the beginning of 2025, the Saipan Immigration Court in the Northern Mariana Islands, a U.S. territory, was the only court operating with one judge. Now, five courts – whose case loads range from several hundred to over 40,000 – have just one permanent judge.   \n   Former immigration judge Ted Doolittle said the workload at the Hartford Immigration Court in Connecticut was overwhelming, topping 40,000 at the start of 2025, when there were five judges on the bench.   \"I felt like they're asking me to be a judge and make these legal decisions, and meanwhile, I'm flying a small plane,\" Doolittle said.   Doolittle was terminated in September 2025. Three of his colleagues retired or took a \"fork in the road\" offer to leave their positions and retire early. The court is now down to one permanent judge.   \n   \"Those cases essentially are not being heard in any meaningful volume,\" he said. \"One guy can only do so much.\"   —With assistance from NPR's Rahul Mukherjee.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. has a quarter fewer immigration judges than it did a year ago. Here's why",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+574/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F18%2F57%2F7392de054151bf6826c0a5a13b8c%2Fgettyimages-2258753132.jpg"
      ],
      "datePublished": "2026-02-23T10:30:00.000Z",
      "dateModified": "2026-02-23T10:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]