[
  {
    "title": "'Make it stop.' For lawmakers, the shutdown feels like purgatory (but with Thai food)",
    "url": "https://www.npr.org/2025/10/10/nx-s1-5566770/make-it-stop-for-lawmakers-the-shutdown-feels-like-purgatory-but-with-thai-food",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-10T20:36:41.000Z",
    "description": "On Capitol Hill, there has been almost no sign of progress toward ending the shutdown. Senators say they aren't even formally negotiating, which begs the question: what are they actually doing?",
    "body": "\n      On Capitol Hill, there has been almost no sign of progress toward ending the shutdown. Senators say they aren't even formally negotiating, which begs the question: what are they actually doing?   \n\n    AILSA CHANG, HOST:  It is Day 10 of the government shutdown. And on Capitol Hill, there have been almost no signs of progress. The Senate has voted seven times on the same two short-term funding measures, and seven times they failed to end the shutdown. And now, senators say they aren't even formally negotiating. So what are they doing? NPR congressional reporter Sam Gringlas spends some time with senators asking just that.(SOUNDBITE OF MONTAGE)UNIDENTIFIED PERSON #1: Three-fifths of the senators duly chosen and sworn not having voted in the affirmative, the motion is not agreed to.UNIDENTIFIED PERSON #2: Is not agreed to.UNIDENTIFIED PERSON #3: Not agreed to.UNIDENTIFIED PERSON #4: Is not agreed to.UNIDENTIFIED PERSON #5: This motion is not agreed to.SAM GRINGLAS, BYLINE: Day after day, lawmakers have been filing into the Senate chamber to vote on the same two proposals to reopen the government - one backed by mostly Republicans, the other by Democrats. The spending bills need 60 votes to advance, which means bipartisan support is the only way forward.JOHN FETTERMAN: People really are just kind of dug in and then everything is hyper-politicized.GRINGLAS: Democratic Senator John Fetterman of Pennsylvania has been 1 of 2 Democrats voting with Republicans on a bill to fund the government for a few more weeks. Most Democrats are holding out for a deal to renew expiring health insurance subsidies. Sitting on a bench outside the chamber, Fetterman says the endless loop of votes is not what he envisioned serving in the Senate would be like.FETTERMAN: I think people should realize that there's no glamor.GRINGLAS: President James Buchanan described the U.S. Senate as the world's greatest deliberative body. Ask senators this week if they think that's true, and you get a lot of responses like this from Democratic Senator Raphael Warnock of Georgia.RAPHAEL WARNOCK: I wish we did more deliberating.GRINGLAS: Even so, he says voting no on the Republican-backed bill in order to preserve the subsidies is exactly what his constituents sent him to Washington to do. Warnock, a Baptist pastor, says maybe his colleagues across the aisle will come around.WARNOCK: It's never too late to come to Jesus.GRINGLAS: At the onset of this shutdown, Republicans promised cracks in the Democratic Caucus. Democrats said they would soon peel off Republicans. Neither has happened. Here's Senator John Kennedy, Republican of Louisiana.JOHN KENNEDY: The further we go, the deeper we get dug in. That's the way I see it.GRINGLAS: And that can make it seem a little like \"Groundhog Day.\" Republican Senator Thom Tillis walked away from a press gaggle muttering, my God, make it stop. Independent Senator Angus King of Maine says he doesn't believe this is what the founders intended.ANGUS KING: If you think about it, we've only really passed, I think, two or three bills this year, and that's not what this institution was designed to do.GRINGLAS: But some lawmakers are trying to keep that spirit of give and take alive. A bipartisan group of senators traded ideas over Thai food earlier this week, though Alaska Republican Senator Lisa Murkowski was tight-lipped about the details.LISA MURKOWSKI: I don't talk about what happens at mealtimes.GRINGLAS: Why is it important to keep having informal gatherings like that at this time?MURKOWSKI: Talking. Talking, absolutely. If you don't have communication, nothing changes, right?GRINGLAS: Republican Senator Markwayne Mullin of Oklahoma also attended but skipped the Thai food.MARKWAYNE MULLIN: I like cheeseburgers. I like hot dogs. I like pop tarts. I like cookies.GRINGLAS: Mullin says the group didn't negotiate the end of a shutdown. They talked about what should happen after.MULLIN: 'Cause we trust each other, and we can have candid conversations. And they've been, I think, pretty productive.GRINGLAS: There have been glimmers of a potential path forward, like a possible vote after reopening the government to extend the subsidies. That's why Democratic Senator Tim Kaine of Virginia says the repetitive votes are not a waste.TIM KAINE: Votes tend to be the reason that everybody comes to the floor and then spends time talking to try to find a solution. We haven't found a solution yet, but we're going to keep at it.GRINGLAS: But on Friday, the senators went home for the weekend with no deal and the shutdown now stretching into another week.Sam Gringlas, NPR News, Washington.(SOUNDBITE OF MARISA ANDERSON'S \"HESITATION THEME AND VARIATION BLUES\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n"
  },
  {
    "title": "Former Biden official on President Trump's peace plan for Gaza",
    "url": "https://www.npr.org/2025/10/10/nx-s1-5568333/former-biden-official-on-president-trumps-peace-plan-for-gaza",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-10T20:26:36.000Z",
    "description": "NPR's Scott Detrow talks with Jake Sullivan, national security adviser to former President Biden, about President Trump's plan for peace in Gaza.       SCOTT DETROW, HOST:  The ceasefire is now in effect...",
    "body": "\n      NPR's Scott Detrow talks with Jake Sullivan, national security adviser to former President Biden, about President Trump's plan for peace in Gaza.   \n\n    SCOTT DETROW, HOST:  The ceasefire is now in effect between Israel and Hamas. The Israeli military has pulled back from certain positions in the Gaza strip. In the coming days, a hostage and prisoner exchange is set to begin, and hundreds of humanitarian aid trucks are expected to be allowed into Gaza. It's all part of President Trump's 20-point peace plan, a plan whose outline does closely resemble that of his predecessor, former President Joe Biden. Here to talk about this moment and what is ahead is Jake Sullivan. He served as National Security Advisor to President Biden and was deeply involved in negotiations and policymaking around the Gaza War. Welcome back to the program.JAKE SULLIVAN: Thanks for having me.DETROW: Look, let's start. We've been here before. As you deeply know, you and others in the Biden administration helped broker a multiphase ceasefire in the final days of the administration. Then it fell apart a couple of months later. So what to you may be different now?SULLIVAN: Well, first, I think we have to start with the good news, which is we have a ceasefire. The guns have gone silent. Unless something terrible happens, hostages will be coming out and aid will be going in. And these hostages have been living through hell, and they're finally going to be reunited with their families. And Palestinian civilians have been living through hell, and they're finally going to get a measure of relief. So there are a lot of questions about what comes next for the long term. But in the immediate term, it does look as though all of the parties have determined that the next step will be ceasefire, hostages, aid relief, and that formula is a good formula on a very basic human level.DETROW: I wanted to ask you about something that we heard on our show this morning on Morning Edition. We talked to veteran hostage negotiator Gershon Baskin, who was involved in these talks, and he told my colleague, Leila Fadel, about what was different this time, and he said President Trump made a difference. Here's what he said.(SOUNDBITE OF ARCHIVED NPR CONTENT)GERSHON BASKIN: Let's face it, Benjamin Netanyahu and Ron Dermer, his main ally in the Israeli government, support the American Republican Party, not the Democratic Party. They were hostile to Barack Obama. They were hostile to Joe Biden, and they're very supportive of Donald Trump. So that was one thing. Biden never had the leverage over Netanyahu that Trump has.DETROW: I'm curious what your response is to that statement.SULLIVAN: Well, first, I would say that when President Biden left office, there was, as you said, a ceasefire in place. There were hostages coming out. There was aid going in then. And more importantly, there was a roadmap for a final and comprehensive end to the war. Israel actually walked away from that under President Trump, and we had six more months of fighting. So I'm very glad that President Trump finally came around to the view that this war had to end and applied pressure on Prime Minister Netanyahu. But I think something else happened, as well, which is that Hamas' position got very badly weakened over the course of this time. One year ago today, Hamas' leader, Sinwar, was still alive. There were still Hamas military elements. Today, Hamas is a shadow of its former self, and that's part of why we ended up where we are.DETROW: Yeah.SULLIVAN: So I believe that it's a combination of facts on the ground and the fact that it was time for the American president - past time for the American president, in this case, President Trump, to bring pressure to bear to end this war.DETROW: I do want to ask about one more contrast between Presidents Trump and Biden that a lot of people in Israel, especially, have been telling our reporters that they felt like President Trump was much more willing to make direct threats in public, in private, and they felt like that made a difference in getting both sides to try to end this war. Do you think there's any accuracy to that?SULLIVAN: Well, I didn't really see direct threats in public against Prime Minister Netanyahu. I've seen some reported threats that he made privately but not publicly, and, of course, President Biden had very tough private conversations with Prime Minister Netanyahu. I did see some of the public threats with respect to Hamas, but he made those threats six months ago and obviously, Hamas kept fighting. He's made them recently. So to me, the key thing here is that Israel had no more military objectives to achieve in Gaza, and Hamas had lost a huge amount of its capacity to continue to resist militarily. And when you put those two things together, this situation was ripe to be resolved. I would argue that it was ripe to be resolved months ago after the first ceasefire came into place and that we've had months of needless fighting. But I am glad that they finally come around to the position where they've got the ceasefire in place, and now I hope that they can make it durable by actually working on the remaining points of this plan.DETROW: What are your biggest questions about what the Israeli government and military does in the coming months, based on all of your experiences dealing with them?SULLIVAN: Well, a huge question is what actually happens with the disposition of Israeli forces inside Gaza? They've pulled back to a certain extent, but they, of course, have not fully withdrawn. And then a second main question is what happens to Hamas? To what extent are there Hamas fighters who continue to operate inside Gaza in the future? And then the final question is who will govern Gaza as we go forward? The right answer is a Palestinian government that does not include Hamas, does not include any terrorist organizations. Is that achievable? I think these are all very difficult and challenging both logistical and political issues, and it's what the Americans and all of the Arab countries as well as the Israelis and Palestinians are going to have to turn to next.DETROW: I've noticed that you've been pretty introspective in recent interviews. I read a quote where you said that sometimes you have a hard time sleeping at night just because of the nature of the job you held for four years. I'm wondering, do you, in this moment, as you think about things and how this took two years, is there anything you're thinking perhaps if we had done this differently, exerted pressure differently, this war could have ended sooner?SULLIVAN: Of course I think about that. I think about that all the time because there's been such a massive human toll, a massive human toll for innocent Palestinians, a massive human toll for the hostages and their families. So I wrestle with that every day, and I don't think I'd be human if I didn't. But I think it's also important to recognize, again, that we left office with a ceasefire in place, and that ceasefire broke down in March, and we've had six months of fighting since President Trump has been president - or more than six months of fighting. So I hope the Trump administration is also asking itself the same question. Is there anything they could have done to end the war sooner than now, and is there any lesson that they take from the last time the ceasefire broke down to make sure that it doesn't break down again?DETROW: That is Jake Sullivan, National Security Advisor under former president Joe Biden. Thank you so much for talking to us.SULLIVAN: Thanks for having me.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n"
  },
  {
    "title": "Social Security workers say the shutdown has them unable to help with benefit letters",
    "url": "https://www.npr.org/2025/10/10/nx-s1-5566395/social-security-shutdown-benefit-verification-letters",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7067x3975+0+186/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5d%2Fbc%2F950d283045638a4dad93a9369334%2Fgettyimages-2206443388.jpg",
    "tag": "Politics",
    "date": "2025-10-10T09:00:00.000Z",
    "description": "A Social Security Administration office in Washington, D.C., is seen on March 26.                                    Saul Loeb/AFP via Getty Images                                hide...",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Social Security Administration office in Washington, D.C., is seen on March 26.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   Employees at Social Security field offices say the government shutdown has left them unable to carry out an important service for some recipients.   While the agency continues to disburse retirement and disability benefits, workers say they are unable to provide benefit verification letters to people calling in to request them.   These official letters act as a sort of income verification and are therefore key to obtaining aid like housing assistance, fuel assistance and help from nonprofits.   \"Not only do people need these letters when they apply for those benefits, but they also often need to recertify to prove that they continue to have an eligible income level, and it often happens on a deadline,\" says Kathleen Romig, director of Social Security and disability policy at the Center on Budget and Policy Priorities.   \n   Beneficiaries can still access their verification letter online and through the Social Security Administration's automated phone system, the agency says. But during the shutdown, in-person support for the letters is suspended, and when recipients call in to speak with a field office representative, they can't get help with their letter.   And field office workers tell NPR that many people are calling in, seeking assistance. (The workers who spoke to NPR were speaking on behalf of their union because they can't speak on behalf of the Social Security Administration.)   \"Anywhere between 60 to 70% of our calls are, 'I need my benefit verification letter right now at this time' during the shutdown,\" says Tierra Carter, a teleservice worker at an office in Tampa, Fla., who also represents a chapter of the American Federation of Government Employees. \"A beneficiary cannot receive a benefit verification letter from the telephone receiver or by walking in through their local Social Security office. And that burdens a lot of our recipients.\"   \n   Romig notes that \"Social Security beneficiaries are much older than the American population on average, so not everybody has a lot of facility with online tools. And likewise, Social Security serves many people with disabilities. And those disabilities could include things that make it hard to use a device, like cognitive disabilities or motor skills or memory issues.\"   Additionally, critics of the SSA's automated phone system, which include a group of Democratic senators, have reported that it often glitches, loops and doesn't solve a caller's problem.   \n   Barri Sue Bryant, who has worked at the agency for 20 years and represents the Wilkes-Barre, Pa.-area union, says a lot of these calls \"tear at our heartstrings.\"   She says she got a call this week from an elderly man who doesn't know how to use a computer and needed a benefit verification letter so he could finalize his mortgage.   \"So, he was going to lose the mortgage if he didn't get it in time,\" Bryant says. \"And then we also had an 89-year-young woman who needed it to get her rent subsidy or she was going to lose it. So, she ultimately could lose her housing over it.\"   In a statement to NPR, an agency spokesperson said beneficiaries will continue to get their payments, but \"as a result of the lapse in appropriation, SSA is following the contingency plan for continued activities.\"   Bryant and other Social Security employees say it's frustrating that they can't provide the verification letter service during the shutdown.   \"They don't consider benefit verification letters essential, but they are to the public, you know. It really runs many of their lives,\" Bryant says.   Christine Lizotte, a claims representative for the agency in Auburn, Maine, who also represents a union chapter in New England, says even when beneficiaries are able to set up an account online, they often have issues.   \"We have some that have navigated it, set up an account, can't remember their email, can't remember their password,\" she says.   \n   Lizotte said the timing of this shutdown is particularly worrisome in Maine.   Open enrollment for fuel assistance, which for some people requires one of these SSA letters, has begun. She says it's already getting cold in New England, and many folks are calling in for letters and are now worried their assistance won't be sorted out in time.   \"If you don't have your application done, by the time it gets cold — and I mean, it's starting to get cold — you may lose out or you may have a delayed fuel assistance voucher, which means the first few months you might be cold,\" she says.   \n   \"So it feels like this huge disservice that we've spent our entire careers here to help these individuals and now are being told, 'Oh, I'm sorry — we can't help you today.' And that is beyond frustrating. Goes against everything we are.\"   \"Almost at a breaking point\"   Many workers report an uptick in these frantic and upset callers at a time when SSA workers themselves are struggling.   Because of the shutdown, employees are going without pay, and many of them have also taken on more work in the past several months due to thousands of staff departures at the agency prompted by the Trump administration.   \n   Alex Creese, a claims specialist with the agency in Aurora, Colo., says on behalf of his local AFGE union chapter that many employees are \"living paycheck to paycheck\" and are worried about paying their bills as long as the shutdown continues. He said the stress of these heartbreaking calls from recipients is exacerbating an already tough situation.   \"Right now, with the shutdown, our hands are tied and we're already stretched so thin that now we're stretched even thinner,\" he says. \"So whether it's these programs that we can't offer or programs that we can offer, everything's being impacted. And right now we're just almost at a breaking point.\"   Creese worries that even more employees will leave the agency.   \"We are running on fumes right now,\" he says. \"If the shutdown continues, then … I could see all these talented people leaving. It's just not a good situation right now whatsoever.\"\n"
  },
  {
    "title": "Trump administration says about 4,200 federal employees face layoffs",
    "url": "https://www.npr.org/2025/10/10/nx-s1-5570933/shutdown-federal-workers-rifs-layoffs-vought",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2Fc7%2F933767f14dcb9207fbe18333e586%2Fgettyimages-2225607094.jpg",
    "tag": "Politics",
    "date": "2025-10-10T18:27:00.000Z",
    "description": "The Trump administration says it has started the process of issuing \"substantial\" reduction-in-force notices to federal employees. Court filings suggest around 4,200 affected so far.",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Russell Vought, director of the Office of Management and Budget (OMB), speaks with reporters outside of the West Wing of the White House in July 2025.\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   More than a week into the government shutdown, layoffs of federal workers have begun, following through on administration threats to slash the size of government during the shutdown.   In a court filing late Friday, lawyers for the government wrote that an estimated 4,200 employees across at least seven agencies began receiving reduction in force, or RIF, notices on Oct. 10.   The declaration, from Office of Management and Budget (OMB) senior advisor Stephen Billy, came in response to an order from the federal judge assigned to a lawsuit challenging the Trump administration's shutdown layoffs.   \n   Word that layoffs were underway first came from OMB Director Russell Vought in a social media post on X that said, \"The RIFs have begun.\"   While the administration initially offered few details on the scope of what it called \"substantial\" layoffs, some federal employees began sharing actual layoff notices on social media while federal employee unions said they'd been notified of pending cuts.   Asked by reporters Friday how many workers may lose their jobs, President Trump did not give an exact figure, but told reporters \"it'll be a lot.\"   \"We'll announce the numbers over the next couple of days, but it'll be a lot of people, all because of the Democrats,\" Trump said.   \n   In his declaration, OMB senior advisor Billy stressed that while the information he was providing Friday was the most current, the situation \"is fluid and rapidly evolving.\" The numbers are subject to change, he wrote, suggesting more RIFs could come in the future.   Here are the agencies affected by the RIFs, according to the declaration, with the estimated numbers of employees who will be affected:   Department of Health and Human Services: 1100-1200 employees    Earlier Friday, HHS spokesperson Andrew Nixon confirmed that RIF notices are being sent out to agency employees.   \n   \"HHS employees across multiple divisions are receiving reduction-in-force notices as a direct consequence of the Democrat-led government shutdown,\" said Nixon shortly after Vought's post. \"All HHS employees receiving reduction-in-force notices were designated non-essential by their respective divisions.\"   Nixon blamed the Biden administration for creating a \"bloated bureaucracy,\" although HHS has already cut more workers — 20,000 workers through an earlier RIF and through voluntary resignations and retirements — than were added during the Biden administration.   Department of Education: 466 employees    A union representing Education Department employees said in a statement that \"multiple union members\" confirmed that at least two offices would be affected by RIFs: the Office of Communications and Outreach as well as the Office of Elementary and Secondary Education.   \"This administration continues to use every opportunity to illegally dismantle the Department of Education (ED) against congressional intent,\" AFGE Local 252 president Rachel Gittleman said in a statement on Friday. \"They are using the same playbook to cut staff without regard for the impacts to students and families in communities across the country.\"   \n   Department of Housing and Urban Development: 442 employees    Antonio Gaines, president of AFGE Council 222, representing employees of the Department of Housing and Urban Development (HUD) across the country, confirmed to NPR that the union had received notice from HUD of its \"intent to fire a number of employees.\"   \"We are in the process of reviewing the notice, assessing the impact and magnitude of the agency's decision, while acquiring legal guidance from the National office,\" Gaines wrote.   A HUD spokesperson said the reduction in force was \"to align our programs with the Administration's priorities and the appropriations available to the department.\"   Treasury Department: 1446 employees   On Reddit, IRS employees posted screenshots of actual RIF notices they had received, informing them of their last day, Dec. 9.   \"The Internal Revenue Service has determined it is necessary to abolish some positions in INFORMATION TECHNOLOGY to further workforce shaping efforts,\" read one such notice.   \n   An employee with the Community Development Financial Institutions Fund shared a notice that the entire organization was set to be abolished.   Environmental Protection Agency: 20-30 employees    In court filings, the Trump administration said the EPA has not made a final decision on \"whether or when to issue RIF notices.\"   But earlier Friday, AFGE Council 238 president Justin Chen said he'd learned that Environmental Protection Agency employees overseeing recycling and composting initiatives, plastics reduction and other programs, were among those targeted for layoffs.   \"Weakening the EPA workforce is a direct threat to the health and safety of Americans,\" wrote Chen in a statement. \"If Trump thinks he is only hurting federal workers with this decision, he is sorely mistaken.\"   An EPA spokesperson blamed Democrats and the government shutdown for the layoffs.   Other agencies   The other agencies mentioned in the declaration are the Commerce Department, with 315 employees affected; the Energy Department, with 187 employees affected; and the Department of Homeland Security, with 176 employees affected.   Here's what's ahead with mass layoffs at federal agencies : NPR   Federal law is specific about the process that RIFs must follow, including a minimum 60 days' notice of their end date, or 30 days if a waiver is granted by the Office of Personnel Management.   Some agencies may need to notify unions or Congress, and then draft official notices to send to affected employees. The notices are required to include information such as the reasons for the RIF and the effective date.   Unions seek legal recourse, again   The declaration came in a lawsuit filed by several unions over the threat of RIFs ahead of the shutdown, arguing \"the Trump administration has made unlawful threats to dismantle essential federal services and functions provided by federal personnel, deviating from historic practice and violating applicable laws.\"   U.S. District Judge Susan Illston had ordered the Trump administration to detail the status of \"any currently planned or in-progress RIF notices to be issued during/because of the government shutdown.\" Illston will hold a hearing in the case next Wednesday.   \n   In a statement Friday, American Federation of Government Employees National president Everett Kelley slammed the RIFs announcement.   \n   \"It is disgraceful that the Trump administration has used the government shutdown as an excuse to illegally fire thousands of workers who provide critical services to communities across the country,\" he said.   Since the shutdown began, the Trump administration has made several threats to cut spending, fire workers and not pay some furloughed employees, arguing that the reductions are the fault of Democrats who won't drop their demands for extended health care subsidies in exchange for reopening the government.   The White House has also said its decision to freeze transportation funding in Chicago and New York and cancel billions of dollars in Biden-era energy project grants are a continuation of their push to shrink the size and scope of the federal bureaucracy.   Mass layoffs were a hallmark policy of the Department of Government Efficiency effort that began when Trump returned to office in January.   In February, a memo from the Office of Personnel Management and OMB asked federal agencies to prepare multi-phase plans to implement Trump's \"workforce optimization initiative\" that includes layoffs and what the workforce would look like when the new fiscal year started Oct. 1.   As NPR has previously reported, many agencies that implemented layoffs at the pressure and direction of DOGE have hired back workers in recent weeks, citing the inability to perform basic tasks and carry out Trump's policy priorities.   While the Trump administration has argued that cuts to the federal government need to happen because of the lapse in funding, some experts say a shutdown does not mean layoffs are necessary.   \"There is no statute requiring them to lay off a substantial share of federal employees during a temporary government shutdown,\" Jessica Riedl with the center-right Manhattan Institute said. \"That statute doesn't exist, and such practice has not occurred during previous shutdowns.\"   \n   Layoffs dampen chance of funding compromise   Top Republicans on Capitol Hill are pinning blame for the mass layoffs on Democrats, who have refused to support a Republican-backed measure to reopen the government because it does not extend health insurance subsidies that are expiring later this year.   GOP leaders also hoped the threat of mass layoffs would compel Democrats to relent. Senate Majority Leader John Thune, R-S.D., said the Trump administration was left with no choice.   \"I think they held off as long as they could,\" Thune told reporters Friday.   But Democrats say Republicans are taking advantage of the shutdown to continue their ongoing effort to slash the footprint of the federal government.   \"Let's be blunt: nobody's forcing Trump and Vought to do this,\" Minority Leader Chuck Schumer, D-N.Y., wrote in a statement Friday. \"They don't have to do it; they want to. They're callously choosing to hurt people—the workers who protect our country, inspect our food, respond when disasters strike. This is deliberate chaos.\"   Sen. Susan Collins, R-Maine., told reporters on Thursday that a bipartisan group was making progress on a possible path to end the shutdown that would include a vote on health insurance subsidies after the government reopens.   But hope of a compromise may be fading again, as the layoffs inflame tensions in Congress even more.   Collins was among the few Republicans to criticize the layoffs on Friday.   \"I strongly oppose OMB Director Russ Vought's attempt to permanently lay off federal workers who have been furloughed due to a completely unnecessary government shutdown caused by Senator Schumer,\" Collins wrote. \"Regardless of whether federal employees have been working without pay or have been furloughed, their work is incredibly important to serving the public.\"   NPR's Cory Turner, Jennifer Ludden and Michael Copley contributed to this report.    Have information you want to share about agency reduction-in-force plans and other changes to the federal government? Reach out to this author through encrypted communications on Signal: Stephen Fowler is at stphnfwlr.25.\n"
  },
  {
    "title": "Justice Department indicts Letitia James after pressure from Trump",
    "url": "https://www.npr.org/2025/10/09/nx-s1-5569792/letitia-james-indictment-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5602x3151+0+291/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fca%2F52%2Fac7980374c7b8c591fca3c2f4c7f%2Fgettyimages-21929875081.jpg",
    "tag": "Politics",
    "date": "2025-10-09T21:05:14.000Z",
    "description": "Justice Department indicts Letitia James after pressure from Trump                       Audio for this story is...",
    "body": "\n      \n      Justice Department indicts Letitia James after pressure from Trump\n   \n        \n            Audio for this story is unavailable.\n        \n\n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                New York Attorney General Letitia James speaks during a press conference on Jan. 8 in New York City.\n                \n                    Michael M. Santiago/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Michael M. Santiago/Getty Images\n    \n\n   \n   A federal grand jury in Virginia has indicted New York Attorney General Letitia James on one count of bank fraud and one count of making a false statement to a financial institution — charges that come after steady pressure from President Trump to prosecute one of his longtime political foes.   James, a Democrat who pledged to investigate Trump during her campaign, eventually sued Trump and his company for inflating the value of some of its properties, winning more than $450 million in the civil business fraud case. The financial penalty was later thrown out on appeal.    At one of his own campaign rallies last year, Trump called for both James and the judge in that case to \"be arrested and punished accordingly.\" The president has been persistent in his calls since taking office, writing \"JUSTICE MUST BE SERVED\" in a post on Truth Social last month that was directed at U.S. Attorney General Pam Bondi.    \n   Thursday's indictment accuses James of lying on her application for a $109,600 mortgage to buy a property in Norfolk, Va., in 2020, alleging she promised her financial lenders it would be a secondary property for her personal use — but that she instead rented it out. The government says she benefited from \"ill-gotten gains\" of $18,933 from favorable terms including a lower borrowing rate and a higher seller credit.   In a video posted to social media, James denied the charges as \"baseless\" and criticized the president's actions as a \"grave violation of our constitutional order.\"     \"This is nothing more than a continuation of the president's desperate weaponization of our justice system,\" James said. \"He is forcing federal law enforcement agencies to do his bidding, all because I did my job as the New York state attorney general.\"    Federal prosecutors in the Eastern District of Virginia spent months on the case this year. A Republican career prosecutor there determined there was not enough evidence to bring a case against James. Then he was forced out of his job by the White House, only to be replaced by Lindsey Halligan, a former insurance lawyer in Florida with no experience as a prosecutor.   \"No one is above the law. The charges as alleged in this case represent intentional, criminal acts and tremendous breaches of the public's trust,\" Halligan said in a statement. \"The facts and the law in this case are clear, and we will continue following them to ensure that justice is served.\"   \n   Last month, Halligan secured an indictment against former FBI Director James Comey, who has pleaded not guilty to two felony charges.   The charges for James have been pushed in part by Ed Martin, the weaponization czar inside the Justice Department who traveled to Brooklyn to stand outside one of James's properties, where he was photographed by The New York Post.    Abbe Lowell, a lawyer for James, has criticized Martin for targeting Democratic lawmakers and other figures to settle scores for Trump.    \"We are deeply concerned that this case is driven by President Trump's desire for revenge,\" Lowell said in a statement on Thursday. \"When a President can publicly direct charges to be filed against someone — when it was reported that career attorneys concluded none were warranted — it marks a serious attack on the rule of law. We will fight these charges in every process allowed in the law.\"   James is scheduled for an initial court appearance on Oct. 24. \n"
  },
  {
    "title": "Dominion, the voting tech company at the center of false 2020 claims, is sold",
    "url": "https://www.npr.org/2025/10/09/nx-s1-5569817/dominion-voting-liberty-vote-false-claims",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5426x3052+0+620/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F09%2F41%2Ffd767f654e27acfd2d2d65e07c75%2Fgettyimages-1242291376.jpg",
    "tag": "Politics",
    "date": "2025-10-09T21:32:55.000Z",
    "description": "An election judge sets up a Dominion voting machine during a public accuracy test of voting equipment on Aug. 3, 2022, in Burnsville, Minn.                                    Stephen Maturen/Getty...",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An election judge sets up a Dominion voting machine during a public accuracy test of voting equipment on Aug. 3, 2022, in Burnsville, Minn.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   Dominion Voting Systems, the company at the center of false fraud claims about the 2020 election, has been acquired by an entity called Liberty Vote.   \"As of today, Dominion is gone,\" the company said in a press release Thursday. \"Liberty Vote assumes full ownership and operational control.\" Dominion's website now redirects to libertyvote.com.   President Trump and his allies, including Rudy Giuliani, have falsely blamed Dominion and its machines for rigging the 2020 election, taking votes from Trump. The baseless claims against Dominion caused one of its executives to go into hiding in 2020, and led to numerous defamation lawsuits.    \n   Giuliani recently reached a confidential settlement with Dominion. Most notably, Dominion won a nearly $800 million defamation case against Fox News.   Earlier this year, an official with Trump's Justice Department reached out to county clerks in Missouri and asked to inspect Dominion voting equipment they used in 2020.   The Liberty Vote release makes a couple of nods to conservative election priorities, including calling the acquisition \"a bold and historic move to transform and improve election integrity in America.\" Conservatives in recent years have used the phrase \"election integrity\" and talked about increasing faith in the nation's voting systems.   \n   The release also notes that one of Liberty Vote's priorities is \"[l]everaging hand-marked paper ballots enabling compliance with President Trump's executive order, and ensuring election security and compliance with federal standards.\"   Most U.S. voters already vote using hand-marked paper ballots. Much of Trump's March executive order on voting has been halted by federal judges.   The new company is founded by Scott Leiendecker, a onetime St. Louis Republican election director who founded an election technology company that's broadly used by election officials.\n"
  },
  {
    "title": "What to know about the Nobel Peace Prize",
    "url": "https://www.npr.org/2025/10/09/nx-s1-5567786/nobel-peace-prize-explained",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7535x4238+0+392/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F94%2F20%2F4dae2161455abf52494616a23c9d%2Fgettyimages-2173737057.jpg",
    "tag": "Politics",
    "date": "2025-10-09T16:17:08.000Z",
    "description": "Anticipation is growing and bookies around the world are taking bets on who'll be awarded this year's Nobel Peace Prize. Here is what to know ahead of the award announcement this week.",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Replicas of the obverse and reverse of the Nobel Peace Prize medal displayed at The Norwegian Nobel Institute in Oslo.\n                \n                    Jonathan Nackstrand/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jonathan Nackstrand/AFP via Getty Images\n    \n\n   \n   UPDATE: Click here to read about the winner of the 2025 Nobel Peace Prize.   Anticipation is growing and bookies around the world are taking bets on who'll be awarded this year's Nobel Peace Prize, with President Trump among the most high-profile — and controversial — contenders.   On Friday, the Norwegian Nobel Committee will announce the winner. The committee says the award goes to the person or organization that has done the most \"for fraternity between the nations and the abolition or reduction of standing armies and the formation and spreading of peace congresses.\"   Trump has received multiple nominations and has never made a secret of his desire to win the prestigious accolade. And, as the first phase of his Gaza peace plan makes headway, the focus on the prospect of him winning is intensifying.   \n   Here's what to know ahead of this year's announcement.   How did the peace prize come about?    In his 1895 will, Swedish inventor and businessman Alfred Nobel declared his fortune should be divided into five parts to honor outstanding achievements in physics, chemistry, physiology or medicine, literature and for work in peace.   The first prizes were given in 1901 and are now announced every October and awarded in a ceremony in December. In 1968, a new prize was established — the Sveriges Riksbank Prize in Economic Sciences.   \n   Thousands of people can choose to nominate a person or organization as a candidate for the peace prize, though you cannot nominate yourself. Those eligible to nominate a candidate include members of national governments, officials with international peace organizations, university professors and former recipients.   \n   The recipients of four of the prizes are decided by a Swedish committee, while the recipient of the peace prize is decided by a Norwegian committee composed of five members appointed by the Norwegian parliament. The peace prize committee deliberates in secret for months before coming up with a shortlist and narrowing it down to pick the winner.   The winner of the Nobel Peace Prize receives a medal and about $1.17 million in prize money.   Who has won it in the past?   Some of the world's most famous names have won in the past, including former South African presidents Nelson Mandela and F.W. de Klerk in 1993 for bringing a peaceful end to apartheid and Martin Luther King Jr. in 1964 for his nonviolent civil rights struggle. Mother Theresa, the Dalai Lama and Malala Yousafzai are also all past winners.   \n   The prize has also gone to people or groups that are not household names. Last year it was awarded to Nihon Hidankyo, a Japanese grassroots movement of atomic bomb survivors from Hiroshima and Nagasaki.   The awarding of the prize has also courted controversy. Former U.S. Secretary of State Henry Kissinger received the prize in 1973 along with North Vietnam's chief communist negotiator, Le Duc Tho, for establishing the Paris Peace Accords — which led to America's exit from the Vietnam War. Tho declined the award, but the decision to award Kissinger shocked many of his critics who saw him as a warmonger.   \n   Also controversial was President Barack Obama's Nobel Peace Prize in 2009, just months into his first term. Some criticized the decision, saying the president hadn't had time to prove himself. Ethiopian Prime Minister Abiy Ahmed received the award for efforts to reach peace with neighboring Eritrea in 2019. He later went on to wage a brutal war in Ethiopia's northernmost region of Tigray.   \n   Leaders in the Americas, including Costa Rica and Colombia, as well as human rights defenders in Russia, Belarus and Ukraine have also won the award.   Who is nominated this time?   There are 338 candidates for the Nobel Peace Prize this year — 244 individuals and 94 organizations.   At the center of intense speculation about this year's award is President Trump, who is currently engaged in negotiations to end the war in Gaza.    The Nobel website does not list the candidates, although some of the nominators have told the media who they've put forward. Cambodian Prime Minister Hun Manet and Israeli Prime Minister Benjamin Netanyahu have both confirmed they nominated Trump.   \n   Trump has  repeatedly said he deserves the prize, saying he's ended multiple wars this year already, although fact-checkers dispute the claim as several conflicts he has attempted to end remain ongoing. Earlier this year he said at the White House: \"They will never give me a Nobel Peace Prize. I deserve it, but they will never give it to me.\"   Other names making the rounds as possible winners this year include Sudan's Emergency Response Rooms, a volunteer network helping civilians despite great risk in the midst of the country's civil war, and Yulia Navalnaya, the widow of Russian opposition politician Alexei Navalny.   In terms of the likelihood of Trump winning, the Gaza ceasefire may come too late to change the outcome of this year's award, and the committee is known to value sustained peace efforts over quick political wins.   However, as of Thursday morning, bookmakers' odds had Trump and the Sudanese group as the joint favorites, according to Oddschecker.\n"
  },
  {
    "title": "Government shutdown, text message scandal could reshape Virginia's gubernatorial race",
    "url": "https://www.npr.org/2025/10/10/nx-s1-5561112/government-shutdown-text-message-scandal-could-reshape-virginias-gubernatorial-race",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-10T08:26:46.000Z",
    "description": "Government shutdown, text message scandal could reshape Virginia's gubernatorial race                                                Transcript                                   ...",
    "body": "\n      \n      Government shutdown, text message scandal could reshape Virginia's gubernatorial race\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5561112/nx-s1-9486674\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Virginia is just weeks away from electing a new governor, but the government shutdown and a recent text message scandal could reshape the race.   \n\n    LEILA FADEL, HOST:  The Virginia governor's race is in its final stretch. The contest in the purplish state is often seen as a gauge of national voter sentiment in between a presidential election and the midterms. This year, some late breaking events may be reshaping the race. Here's Margaret Barthel of member station WAMU.MARGARET BARTHEL, BYLINE: First, there's the government shutdown. Virginia is home to about 320,000 federal workers. Right now, many of them are furloughed. The Trump administration's cuts to the federal workforce have hit the commonwealth hard, with an estimated 11,000 jobs eliminated, and Democrats are eager to use their votes to push back.(APPLAUSE)BARTHEL: That much was clear at a recent town hall meeting in northern Virginia. Marsha Peltz (ph) was there. She said her son lost his federal job in a mass layoff earlier this year. Now he's a contractor worried about his paycheck again. And that's got her feeling motivated to get out and vote.MARSHA PELTZ: There's not much I can do on a federal level. But on a state level, I do have some influence. So I'm encouraging my neighbors, please, go out and vote. Please volunteer.BARTHEL: That's good news for the Democrat in the governor's race. She's former Congresswoman Abigail Spanberger. On the campaign trail, she portrays herself as a champion for affordability and a defender of federal workers. Here she is at a debate on WAVY-TV last night.(SOUNDBITE OF ARCHIVED RECORDING)ABIGAIL SPANBERGER: It is only increasing the challenge that they are facing after months and months of the attacks from this White House under DOGE.BARTHEL: Stephen Farnsworth is a professor of political science at the University of Mary Washington.STEPHEN FARNSWORTH: When you add up all those people who have directly or indirectly some downstream effect of federal employment, it is a very, very damaging environment for Republicans.BARTHEL: The Republican in the race is Virginia Lieutenant Governor Winsome Earle-Sears. She's supported Trump's cuts to government jobs, insisting she's helped create plenty of jobs in the private sector. Instead, she talks a lot about transgender kids in bathrooms and locker rooms. Here she is last night.(SOUNDBITE OF ARCHIVED RECORDING)WINSOME EARLE-SEARS: This is not hard. Are you going to change in a gym where men are nude in the locker rooms? Are you going to do that, Abigail?BARTHEL: Her message is motivating for conservative-leaning voters like Ursula Bocall (ph), a federal contractor who came to a Moms for Liberty event to hear Earle-Sears speak.URSULA BOCALL: It just seems that now there's more of a push of the schools to over-insert themselves in the whole sort of sexuality issues that are going on in schools.BARTHEL: And there's another big development that may boost Earle-Sears, a scandal in the race for attorney general - violent and disturbing text messages from the Democratic candidate, Jay Jones, recently surfaced by the National Review. In a series of 3-year-old messages, Jones imagines a distressing scenario where a top Virginia Republican is shot. He goes on to wish the Republicans' children would die, too. This in hopes that he would change his policy positions. Zack Roday is a partner with Ascent Media, a Republican-leaning strategic communications firm.ZACK RODAY: It's going to fire up a whole lot of infrequent, probably right-of-center to conservative voters that are not Republican consistent voters. They may vote in presidentials. They don't vote in governors' races.BARTHEL: Virginia Republicans, President Trump and the Fraternal Order of Police have called for Jones to drop out. Spanberger has condemned the messages but hasn't said he should leave the race, and Republicans are already running ads criticizing her for it. In the meantime, early voting is in full swing in the commonwealth with nearly 450,000 ballots already cast.For NPR News, I'm Margaret Barthel in Arlington, Virginia.(SOUNDBITE OF ROEDELIUS AND TIM STORY'S \"CONCISE\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n"
  },
  {
    "title": "How the Trump administration is reshaping the military",
    "url": "https://www.npr.org/2025/10/09/nx-s1-5567205/how-the-trump-administration-is-reshaping-the-military",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-09T16:51:37.000Z",
    "description": "President Trump is deploying National Guard troops to U.S. cities, erasing \"woke\" in the military and striking alleged drug boats off Venezuela. <em>The Atlantic</em>'s Nancy Youssef discusses what this means.",
    "body": "\n    TONYA MOSLEY, HOST:  This is FRESH AIR. I'm Tonya Mosley.(SOUNDBITE OF ARCHIVED NPR CONTENT)TINA KOTEK: To put military troops in American cities is a threat to our democracy. If you think about the speech that the president gave to the hundreds of generals that were gathered a week or so ago to talk about training our troops in the cities of America, we're not at war with ourselves here. There is not an insurrection or a rebellion not only in Portland or Chicago or other places. Look, there are challenges. There's lawful demonstrations. Local law enforcement is handling the situation. And I think this is an overreaction to the situation, and it's just not true. Facts should matter.MOSLEY: That was Oregon governor Tina Kotek on NPR reacting to President Donald Trump's order to deploy national guard troops into several U.S. cities. Her words capture the anxiety and disbelief reverberating through many city halls and state houses and even inside the Pentagon. In Portland, a federal judge has temporarily blocked the guard's arrival. In Chicago, city and state leaders are suing to stop similar deployments. But that resistance is falling largely along partisan lines. While Democratic governors oppose the deployments, some Republican governors are welcoming them. Louisiana governor Jeff Landry requested up to 1,000 troops for New Orleans and Shreveport and Baton Rouge, citing high crime rates. And at least six Republican-led states, including West Virginia, South Carolina and Ohio, have sent hundreds of guard troops to Washington, D.C., at Trump's request. But the deployment orders are just one part of a larger shift happening inside of the military itself. Last week, Defense Secretary Pete Hegseth delivered what's being described as one of the most politicized military addresses in modern history.Speaking to about 800 generals, admirals and senior leaders, Hegseth called for reshaping the armed forces around a warrior ethos and suggested the military must be ready for domestic urban operations. He rejected what he called woke weakness. My guest today is Nancy Youssef, a national security staff writer with The Atlantic. She's been reporting on the reaction inside the Pentagon to Hegseth's speech and what this moment means for civil military relations in America. Prior to joining The Atlantic, Youssef covered the military and the Arab world for The Wall Street Journal. Our interview was recorded yesterday.Nancy Youssef, welcome to FRESH AIR.NANCY YOUSSEF: Thank you so much for having me.MOSLEY: Nancy, President Trump has been deploying National Guard troops from states like Texas to cities like Chicago and Portland and others. And these deployments, as we know, have faced legal challenges from federal judges and lawsuits from state officials. Can you bring us up to speed on where this stands and help us understand what's happening?YOUSSEF: Sure. I should begin by describing sort of what the National Guard does and under what authority they can deploy. Most National Guard answer to governors, and their job is to respond to demands within that state under the authority of the governor. So you might think of it or seen it as National Guardsmen responding to natural disasters - hurricanes, tornadoes, other natural disasters within their state. They might get support from nearby states, but all of those guardsmen are under the deployment of a governor. And then there are instances where the National Guard can be federalized, which means that they are under the authority of the federal government. The most sort of common one that we would think of is when they are deployed overseas because they are needed to sort of supplement the active duty component. We saw this both in Iraq and Afghanistan. What the president is doing is he is federalizing troops in these cities over the objections of the governor. And so by doing so, he is limited in terms of where he can deploy them because the governor hasn't signed off on them. So they're going to federal buildings because that's under the federal government, and they are escorting ICE agents around on some missions.MOSLEY: I want to ask you some questions about some of the rhetoric from the president's deputy chief of staff, Steven Miller, because I think we can't overstate some of the language being used. He is describing what's happening in Portland as a terrorist assault - an organized terrorist attack on federal officers. As you have said, many local leaders and governors are saying that's just not true. In Oregon, the Oregon governor actually says the protests are so small, they just span a city block. Tell me first what role Miller is playing here and what his rhetoric might tell us about where this could be heading.YOUSSEF: Well, based on my reporting, I think he is someone who's a proponent of using military force in cities that he sees it as a necessity and that he believes that the president has wide authorities to deploy them into American cities because the threat as he sees them as domestic terrorists and he's described it widely, what constitutes a threat to the United States. What's interesting is not only the language that you pointed out, but in a tweet over the weekend, he said that the Portland local authorities are unwilling to protect these areas. And the reason that's important is the use of the Insurrection Act can happen when local governments are unable or unwilling to protect streets. And so I think that raised a lot of eyebrows here in Washington. Was he laying the groundwork for potentially invoking the Insurrection Act to an American city, to Portland or somewhere else? And the president made reference to it earlier this week and said he could invoke it but didn't have an immediate plan to but certainly suggested that that was something he would consider doing.MOSLEY: I actually want us to hear his words directly. So this was President Trump when asked about the Insurrection Act during a White House press briefing on Monday. Let's listen.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Well, I'd do it if it was necessary. So far, it hasn't been necessary, but we have an Insurrection Act for a reason. If I had to enact it, I'd do that. If people were being killed and courts were holding us up or governors or mayors were holding us up, sure, I'd do that. I mean, I want to make sure that people aren't killed. We have to make sure that our cities are safe. And it's turning out - and we started with D.C. It's been so successful. Think of it. People wouldn't go to restaurants. The restaurants were closing. We were losing a lot of restaurants, as you all know. And now restaurants are opening, and they're thriving.MOSLEY: That was President Trump being asked about the Insurrection Act. Walk us through the legal chess game in this instance because we know that the deployment of National Guardsmen up to this point, using that other statue that you brought up, is being contested in the courts. How likely could something like invoking the Insurrection Act be a reality?YOUSSEF: I think, frankly, it could be because the legal language around it gives wide discretion to the president. The Insurrection Act, it gives the president the power to federalize National Guard troops anywhere in the United States to restore order during an insurrection, during some catastrophic, major breach of security in the country. And that hasn't happened yet, but there has been increased talk about it. The president has described what's happening in Portland, for example, as an insurrection, but hasn't provided evidence to support that. And, in fact, the local government says that they are able to maintain order, that they haven't made any arrests and that they don't need federal troops at federal buildings, and they certainly don't need the use of the Insurrection Act in their city. The reason I think there's a lot of concern about the use of the Insurrection Act is that has been used for extraordinary circumstances. It's been used less than 30 times across the history of this country. I think the time that we think about it that most listeners might be familiar with was in 1992 after the riots in response to the Rodney King trial. And so that was an extraordinary circumstance. And I think the concern is that if this is allowed to proceed, that it will lower the threshold for when the federal government can put military troops on American streets, that it's no longer for extraordinary circumstances but ones that fall far short of that.MOSLEY: Have you heard anything about how these deployments are sitting with the National Guardsmen themselves?YOUSSEF: It's funny. When you talk to them, there's a whole wide spectrum of responses. You'll have people who are really frustrated, for example, in Washington because some missed the first days of school with their children during this deployment. Some of them are feeling the stress in their own homes, in their own communities, in their own businesses. Then there are some who are delighted to be a part of this mission and that they see themselves as defending the nation's capital, that they're carrying out the president's mission.We did a story with National Guardsmen, and one thing that jumped out to me is that when we ask them, what is your mission or the president's mission? - which was an interesting use of language to me because some might see themselves as really carrying out the vision of the use of National Guard as the president wants it. But that's different from a guard that often, up until that point, really largely defined themselves as protecting their communities or protecting the nation.MOSLEY: ...The nation.Let's take a short break. If you're just joining us, we're talking with Nancy Youssef, national security staff writer for The Atlantic. We'll be right back after a short break. This is FRESH AIR.(SOUNDBITE OF SLOWBERN'S \"WHEN WAR WAS KING\")MOSLEY: This is FRESH AIR, and today we're talking with Nancy Youssef, national security staff writer for The Atlantic. Our interview was recorded yesterday.So, Nancy, all of this - the deployments, the legal battles, the rhetoric about the enemies within - it all connects back to Defense Secretary Pete Hegseth's speech last week, where he told military leaders, about 800 generals and admirals from around the world on short notice - and basically told them that the old military is over. And I want us to listen to just a bit of it.(SOUNDBITE OF ARCHIVED RECORDING)PETE HEGSETH: This administration has done a great deal from Day 1 to remove the social justice, politically correct and toxic ideological garbage that had infected our department, to rip out the politics. No more identity months, DEI offices, dudes in dresses. No more climate change worship. No more division, distraction or gender delusions. No more debris. As I've said before and will say again, we are done with that [expletive]. I've made it my mission to uproot the obvious distractions that made us less capable and less lethal. That said, the War Department requires the next step. Underneath the woke garbage is a deeper problem and a more important problem that we are fixing and fixing fast. Common sense is back at the White House. So making the necessary changes is actually pretty straightforward.MOSLEY: That was Defense Secretary Pete Hegseth on September 30 at a Marine Corps base in Virginia. Nancy, beyond what he actually said, what we just heard, what made that gathering itself so unusual?YOUSSEF: A couple things. I've been covering the Pentagon, and I was in Iraq and Afghanistan before that, so since 2003, and I've never seen a gathering of all generals and admirals. I mean, logistically, it's such a challenge. There were admirals who had to be pulled off of ships and then flown from ship to shore and then from shore to Washington for this gathering. And they arrived not knowing what the purpose of the meeting was. Some were asking themselves privately, what would I do if I was asked to take a loyalty test, for example? Some were telling their staffs I'm - what they would or wouldn't do in those situations. Some were trying to protect their staffs. And so usually, you would not gather that many because - and this sounds flip - they're busy. These guys are busy and they're busy on important missions, and they're supporting troops on the front line. And then to not know why sort of created a - I think, a climate of fear in the run-up to it.And then during the conversation - you know, usually, secretaries of defense in the past have focused on sort of thinking about fighting the next war, the future of the military 10 or 20 years. And what they heard from Hegseth was a lot of focus on things that usually don't come from a secretary in terms of the priorities - fitness and social programs. Usually, those are things that are reserved for lower-ranking officers. It was, to me, a speech that was sort of an extension of his book in which he argues a lot of these same points, and those views and that book was based on his experience as a National Guard major. And so I think a lot of those in the room heard a message that this secretary of defense wants a very different force. I think if you're a woman - and we heard from women who kind of kept hearing if there's going to be same standards across, and then they want to be judged for what they do. You know, he said repeatedly, we have to - sort of suggests that there have been lower standards for women. There haven't been.And I think the message that the generals heard more than anything was - I mean, frankly, a lot of them joked that they kind of got lectured by a major. But they didn't hear something that sort of was unifying, but really looking for ways to narrow the definition of what makes an exceptional soldier, sailor, airman or Marine. Up until this point, I think the military really celebrated exceptional Americans of different backgrounds, different races, different genders. And the secretary really kind of narrowed that definition to a certain kind of troop, a certain kind of American with certain views. And I think that was the message that came across more than any other.MOSLEY: That's really interesting about how they said they felt like they were being lectured by a major because, of course, in the military, hierarchy is super important. Many of those people in the room have more experience than Hegseth. What are you hearing from both rank-and-file service members afterwards? When they were able to talk about it and parse out, what was the takeaway for them to go back to their bases and places? Like, what did they interpret as the directive?YOUSSEF: The thing I hear more than anything is sort of fear about what they can say, what they can do, what they cannot do. For some in the room, I think they wondered if they were being sort of personally targeted in some way, that they wouldn't be welcome in a military that they spent decades serving.MOSLEY: Because many of them are those identities. They are women. They are people of color.YOUSSEF: And they got there because of their qualifications. This assumption that there was some sort of favor done to let them in, you know, in many ways, the military - and I'm not saying that it's perfect, but it is a meritocracy. It is harder for women and people of color to advance in this military. I don't want to oversimplify it. But there's a lot of meritocracy in that system as well. And there has been efforts over time to make sure that that is more in place, not less so. I did a story a few years ago with a general who was trying to interview future colonels and put them behind a screen so that those evaluating them couldn't see them, that they could remove identifying factors so that you could really judge rising colonels based on their merits. So there have been efforts to get at this. The other interesting thing that happened is there was such an awareness about the message they were sending with their response.If you'll remember, in June, President Trump came to Fort Bragg, North Carolina. And there were lower ranking troops there who were cheering when he was mocking President Biden, who were buying Trump merchandise that was being sold nearby and putting it on their uniforms. And there was such an awareness that how they reacted was going to send a message to the force and to the country, that they see themselves as an apolitical force and that they are there to defend the nation, and that they're there not to only defend certain causes or certain parts of the country or against certain threats. And so there was a real awareness about reactions, which is why you didn't see any. I think they were trying to send a message to the country, but also to lower ranking troops, that this is the expectation in terms of how you respond, that we remain America's military and we are here to defend the nation.MOSLEY: I mean, just thinking about some of those initiatives that really have been part of the fabric of the military for several decades. If you're a woman in the military right now or LGBTQ, a person of color, where do you turn at this moment if you face discrimination? Have the headwinds turned pretty quickly? What are you hearing?YOUSSEF: I'm hearing people really consider whether they can stay and also what to tell people coming up behind them, whether they should encourage them to stay in because they don't know. I mean, in that speech, the secretary also said, you know, people are accused of bullying too often and that we need to reassess that sort of standard, that we're not going to ruin people's careers over minor infractions but then was quite vague about what a minor infraction was. Which for some people, these were a lot of the checks that were put in place to make sure that there's an equal opportunity, to make sure that people are protected - that if they, for example, complain of sexual harassment that it won't be career-ending for the person who was harassed but for the person who did the harassment.And so what I hear from a lot of people is a question about whether they can continue to serve. Now, having said that, there are people both in that room and certainly across the force who saw that message as important and necessary, that too much time had been taken, focused on social issues and not enough on war fighting, that the military needs to get back to a standard, that it needs to be more focused on physical fitness. So for some people, it resonated that the force had gotten too off of mark of its priorities. For others, though, I think particularly for women and minorities that I've spoken to, there's a feeling that maybe I'm not welcome here anymore. And I've had service members tell me that directly, really asking themselves, is there a place for me in this military going forward?MOSLEY: You know, the timing is striking because I was also reading that there has been, over the last few years, a steady uptick of particularly Black recruitment and Hispanic recruitment under the military's DEI policies. Is there kind of the bet that Hegseth can attract more recruits from a conservative base that might be turned off by diversity? And does that math actually work when there has been a struggle in the past to find qualified people to enlist?YOUSSEF: I think it depends on what kind of military you see in the future. If you see a smaller military, if you see one that doesn't need to represent, sort of in terms of its physical composition, the American population - it doesn't fully now, right? The middle of the country is where the majority of service members come from. But if that's the goal then this becomes harder.If the goal is a smaller military, one that sort of is more homogenous in terms of values - where they're more focused on internal threats, where we don't have as many troops in Europe or in the Middle East, where we're depending more on drones and other technology and less so on having a physical foot presence in those areas - then it might work. And I think that's the ultimate question. What kind of military do they see? They're hinting at it, but they haven't spelled it out.MOSLEY: Let's take a short break. Our guest today is Nancy Youssef, national security writer for The Atlantic. We'll be right back after a short break. I'm Tonya Mosley, and this is FRESH AIR.(SOUNDBITE OF WAYNE HORVITZ'S \"IN FIELDS THEY LAY\")MOSLEY: This is FRESH AIR. I'm Tonya Mosley. And today, I'm talking with Nancy Youssef, national security writer for The Atlantic. She's been reporting on the fallout from Defense Secretary Pete Hegseth's recent remarks and what they potentially signal about the future of the U.S. military and its relationship to American democracy. Youssef has covered national security and the military for two decades, reporting in Iraq, Afghanistan and the Pentagon. Her latest story explores how senior military leaders are interpreting this moment and what it could mean for civil military relations in the United States. Youssef has also worked for The Wall Street Journal and McClatchy newspapers. Our interview was recorded yesterday.You know, something that Hegseth referred to - he referred to the time period of the 1990s almost as some sort of golden age. And there's a lot of change that was happening back then, but I also wanted to note that women first flew combat missions in the '90s. But then there was also Don't Ask, Don't Tell as a policy. So what version of the '90s does he want to return to?YOUSSEF: He didn't say in this speech. He said, we'll just pick a year. He mentioned General Schwarzkopf as a kind of general that the U.S. military should be like. I think he sort of suggested because that was the last major military win and referring to the Gulf War. I mean, the thing is, though, you know, one year after that period was the Tailhook scandal in which 70-plus women and seven men were sexually harassed and assaulted at a convention. Generals had tried to complain about this conference and the behavior that happened there in the years prior and were ignored. A lot of the reforms that we have in place now were a product of the mistakes of that period.Moreover, the idea that the 1990 war was sort of the metric, you could argue that the U.S. had to - didn't finish that war. And one of the reasons that you saw the U.S. intervention ramp up afterwards in the Middle East was because of sort of the consequences of that war. And so he seemed to suggest that it was a time when you had fewer women, you had fewer restrictions. But just scratch below the surface, it was not a time that everybody could serve and serve in an environment that they felt that was safe and fair to them.MOSLEY: Nancy, Hegseth isn't just changing who's in the military and what they do. He's also controlling who military leaders can even talk to. So you reported on this back in July. Tell us what happened with the Aspen Security Forum. And it might actually help for you to go over exactly what is the Aspen Security Forum and then tell us what happened.YOUSSEF: Sure. This is part of a broader restriction that the secretary's putting on generals, admirals, civilians to talk about what the Pentagon is doing. So military officers go to maybe hundreds of conferences across the services a year, and one reason they go is to show the American public who they are, to engage, to have conversations, to hear ideas from different places. And there's one that's held every year, every summer in July called the Aspen Security Institute, and it's sort of one of the bigger ones where you see a lot of four stars going. They meet with top policymakers, and that's really an opportunity to have sort of a broad discussion about national security.Immediately before that conference was supposed to begin, the secretary issued guidance that essentially said that those generals and admirals couldn't go, that there would be restrictions on what they could go to going forward and that they needed approval from the department before they go to such conferences in the future. And so you had people, in some cases, getting ready to board flights who had to cancel their plans because they were not allowed to go to something that has been really a staple in terms of formats where there can be discussions outside of the Pentagon about national security. And I've gone to several of them, and I do find that often when you're in Washington, you know, you end up looking at things from where you sit, and that there are so many opportunities at those kinds of forums to just hear different thoughts or get a sense in terms of how national security policy is being received outside of the building. And so I think that's why so many agree to do it. And so now you're seeing far fewer generals and admirals going to such events and even lower ranking, for that matter, and that those that they are allowed to go to tend to be organizations that are perceived to have a political affiliation or agreement with the administration, which hadn't happened historically in the past.MOSLEY: Can you briefly just go a little bit deeper on the value of these events for these military officials? Because I just want to get a clear understanding of what could potentially happen when you cut the Pentagon off from those types of events.YOUSSEF: Well, you know, only a small, small percentage of Americans even serve in the military. So even though it gets nearly a trillion now of taxpayer dollars, I think a lot of people don't understand the military. They haven't been exposed to it in a way that gives them a real understanding of what the military does. And sometimes these formats offer opportunities for the military to introduce themselves to the American public.In addition, so many of these events that they go to, there are people who are doing work that might on the face of it not seem relevant or useful to the military. But they might introduce the military to new technologies where interest can overlap, where they can sort of advance a technology because they're seeing it used somewhere else. Sometimes it's meeting officers from other countries and seeing how they're tackling a threat versus how the United States is tackling a threat. Sometimes it's just the face-to-face meeting to get to know somebody so that in the future, if there is some sort of conflict and you need to be able to get somebody on the phone, you've had that face-to-face interaction that can be the difference between the right and the wrong response to a crisis.And so it's just an opportunity for real discourse that their jobs usually don't allow. They're often so immersed in the problem set in front of them and around other military officers, around like-minded thinkers that the opportunity to get outside of that and think outside of that. And how each side can bring lessons and experiences to the other has - from the cheap seats where I sit, has been beneficial.MOSLEY: Well, let's talk a little bit about the cheap seats where you sit, your job. In September, Hegseth told Pentagon reporters, sign this pledge. Don't report anything, even unclassified information, without our approval. Now The New York Times is reporting that those rules have been relaxed. What's actually going on?YOUSSEF: So...MOSLEY: And how has your job been impacted?YOUSSEF: I don't see the rules as loosened. Well, let me begin by saying what the rules were. So we've had a wonderful opportunity as Pentagon reporters in that we could walk most of the building. Now, that doesn't mean we could go into secure rooms or go into areas. There are many, many, many secure areas, most of them. But you could walk and hear and get a sense of how headquarters, the mood of headquarters as it was contemplating these decisions. And so it's been an enormous resource for us.Now, having said that, it's also been to the great benefit of the Pentagon, because the Pentagon had never let us in as a favor to us, but they understood that if you're going to ask for such an enormous amount of money, and for American families to volunteer their sons and daughters to serve, that they had an obligation and actually a benefit in showing the American public what was being done with that money, the decision-makers behind it. It's why they did embeds, for example, when they allowed us the experience of being in the Humvee with them and experiencing what we as a country were asking them to do.And so this has been the case since the Pentagon opened in 1943, through many wars, through many tense moments between the press and the Department of Defense. In May, we were told we could only walk through certain hallways. And now they set new rules that in order for us to continue to be in the building, they have to sign off on what we ask - not publish, ask - that the mere solicitation of information unapproved could lead to us being kicked out of the building. So for example, if I were to...MOSLEY: Right, I was going to say, yes, how did that work?YOUSSEF: I don't know. Let's say I ask someone, where is the USS Truman operating in? What ocean? That's a violation because it wasn't sort of through the channels as they spell them out. And I should note, this wasn't brought about because there was some egregious security violation, there weas some breach that happened, there was some threat to national security that demanded some change. This has been part of a consistent message from the secretary that he doesn't want the military engaging with mainstream press, for lack of a better term. That he wants to engage directly on social media and only speak to those who sort of are like-minded in their views of his conduct.He doesn't do regular interviews. You know, up until this point, and certainly during the wars, we had secretaries and chairmen of the joint chiefs of staff who regularly came into the brief room and answered questions. That doesn't happen anymore. There aren't regular briefings. It's so hard to get basic information now. And once we're out of the building, if that's what happens, it'll be even harder. And I worry about the chilling effect because the messaging is, you, general officers, you, leadership, don't have to engage. You don't owe anybody answers to such consequential decisions that you're making.MOSLEY: You're worried about the chilling effect. But, I mean, isn't this also a violation of the First Amendment? Doesn't this run into First Amendment problems?YOUSSEF: So here's what the Pentagon would say. You can keep reporting. You just can't do it from the building. You just can't have access to the building. So therefore, we're not violating your First Amendment right. Now, does that go with the spirit of the First Amendment, the spirit of this country? I would argue, no, that we have encouraged a robust conversation about policies and demanded answers of the leaders making them. So that's the way that they're arguing in terms of the First Amendment right, because they have the discretion over who comes into the building. But it's not clear whether we can still go to any military installation. And does it create sort of two tiers, those who agree and those who don't?MOSLEY: Let's take a short break. If you're just joining us, we're talking with Nancy Youssef, national security staff writer for The Atlantic. We'll be right back after a short break. This is FRESH AIR.(SOUNDBITE OF THE AMERICAN ANALOG SET SONG, \"WEATHER REPORT\")MOSLEY: This is FRESH AIR. And today, we're talking with Nancy Youssef, national security staff writer for The Atlantic. Our interview was recorded yesterday.Nancy, I want to talk just a little bit about how the military is now operating outside of the country. There was this incident that happened back in September in the Caribbean. Trump announced the U.S. Navy struck a boat from Venezuela, killing 11 people who were aboard that boat. There have been more strikes since then. I think there are more than 20 people who have died. What is the latest that you know about that situation?YOUSSEF: So it's a great question because it is an unprecedented use of military force against drug traffickers. So the administration has said that they want to use the military to combat drug trafficking, and that they have named some narco trafficking groups as foreign terrorist organizations. When they describe those on these boats, they use language that we used to reserve for al-Qaida and ISIS, calling them combatants and saying that...MOSLEY: Unlawful combatants, yes.YOUSSEF: That's right, which we hadn't - you know, you think of that more for groups like al-Qaida. And that they need to strike these boats to stop the flow of drugs into the United States. The problem is we don't actually know, nor have they told us in any detail, who's on these boats, why striking these boats in particular combats that problem. The president has described fentanyl as the drug that he wants to stop from entering the United States. Well, fentanyl doesn't come from Venezuela. There are countries that are trafficking more drugs than Venezuela by a lot. Venezuela is more for transiting drugs. But Colombia, Mexico, if we're going after a drug problem, it would seem like those are the countries one would target more.And it's not clear how hitting these boats, even if they have drugs on them, has an enduring impact on drug trafficking in the United States, nor has the administration described it. Secretary Hegseth has put out on social media this is protecting the American people. but I'm not sure that it's clear how. If this is truly about going after drugs and using the military for something that had been reserved for law enforcement - and you would bring in the Coast Guard in a law enforcement capacity as part of that. If we're going to turn that now into a military mission, it's not clear why now, why these targets, what the end state looks like and whether it is legal to go after drug traffickers, because the foreign terrorist designation in and of itself doesn't legally justify it. Again, we haven't gotten any clarity from the administration. Earlier this week, Pam Bondi was on Capitol Hill and asked about the legal justification and said she wouldn't answer it. We've heard from the administration that this is a new, better use of the U.S. military, that we're going to focus on threats in the Western Hemisphere, that this is a threat to the United States. But I don't know that there's been a clear line drawn between these specific strikes and that threat.The other interesting thing to me is, you know, this idea of going after non-state actors. This has faced legal questions than before - with al-Qaida, the courts had some questions at the beginning about it and said because they are seeking to destroy the United States, they can be considered a threat that should be dealt with militarily. These drug traffickers have not said that. Their aim is not to destroy the United States. Their aim is profit. And so it's not clear to me legally how these strikes are being justified. They are because they're still happening, but we haven't heard more of an explanation. What we have heard the administration say is that more of these strikes are coming.MOSLEY: You're actually - you've been doing some reporting on this. What are some things that you're looking at and watching for?YOUSSEF: So what's interesting to me is why the administration has chosen this to use U.S. military force on. I mean, these are the most aggressive strikes happening by the U.S. military from anywhere that I can say. I mean, we've had strikes against Iran and against the Houthis in Yemen, but right now this is the most aggressive military campaign.And I think there's a Venn diagram of sort of interest happening where you have people like Secretary of State Marco Rubio, who has been a long advocate of opposition in Venezuela, who want to see the Maduro government fall. It's an illegitimate government by the United States' standards, stayed in power even after election deemed otherwise. There are people like Stephen Miller and JD Vance who I think see this as a way to project power. They see it as a form of deterrence against drug traffickers, that even if they're not the sort of ones that are posing the biggest threat, that the hope is that drug traffickers will see this and take from it that they shouldn't be sending drugs into the United States. And then there's the president himself who has indicated that he wants to use the U.S. military in different ways, who sees these strikes as a way to sort of have an influence on the world stage. And it's hard to push back, I think, for some because the administration will say you're defending drug traffickers. So the sort of questions around these strikes, I think, are harder for some who oppose them to make.MOSLEY: Nancy, you've covered the Pentagon for decades. How would you characterize this moment?YOUSSEF: I think it's a potential inflection point in terms of the use of U.S. military force, what we constitute as a threat, how big we want the military to be, what we want it to look like. The decisions that are being made now will reshape the military for many years. It takes years to kind of train an officer, to build an ethos within the force. And, like, the changes can happen very quickly, but the consequences of them will take years to play out. And I think we're at this point where there's a real question about what is the U.S. military here for now? What kind of threats do we consider a priority? What is our relationship with our allies? What can they count on us for? There's a lot of changes happening. And to be clear, there are some people who welcome those changes. But it is an important inflection point for a military that has really projected itself as the leading defenders of the rule-based order and a certain moral view on how foreign policy should be conducted.MOSLEY: Nancy Youssef, thank you so much.YOUSSEF: Thank you.MOSLEY: Nancy Youssef, national security correspondent for The Atlantic. Coming up, film critic Justin Chang reviews Luca Guadagnino's new film \"After The Hunt,\" starring Julia Roberts and Ayo Edebiri. This is FRESH AIR.(SOUNDBITE OF TOMMASO AND RAVA QUARTET'S, \"L'AVVENTURA\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n"
  }
]