[
  {
    "title": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5588624/a-gop-led-house-committee-takes-aim-at-what-it-calls-bidens-autopen-presidency",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-28T20:20:31.000Z",
    "description": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Tra",
    "body": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5588624/nx-s1-9509951\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      NPR's Ailsa Chang speaks with University of St. Thomas law professor Mark Osler about the House Oversight Committee's call for an investigation into President Biden's executive actions signed by autopen.   \n\n    AILSA CHANG, HOST:  Hours before President Biden left office, he signed a number of preemptive pardons, and those pardons went to the House committee investigating January 6. These are preemptive pardons for people like Dr. Anthony Fauci, General Mark Milley. In a statement, Biden had said that he wanted to shield these people from, quote, \"unjustified and politically motivated prosecutions\" from the incoming Trump White House.Well, since entering office, President Trump has declared on social media that Biden's pardons are invalid, claiming without evidence that the Biden administration used a writing machine called an autopen to sign those pardons without Biden's knowledge. Trump's statement does not have the force of law, and Biden has repeatedly insisted that he was personally behind all the decisions made during his presidency. But today, the House Oversight Committee, chaired by Republican Congressman James Comer, asked the Justice Department to look into what they call the, quote, \"Biden autopen presidency.\" Attorney General Pam Bondi says her team is doing exactly that.To talk more about this, we're joined now by Mark Osler. He's a law professor at the University of St. Thomas, known for his work on clemency. Welcome.MARK OSLER: Thank you.CHANG: So this House Oversight Committee accuses the Biden White House of covering up Biden's cognitive decline. Let me just ask you, what does this report ultimately ask for?OSLER: Well, it's asking for a further investigation by the Department of Justice. I think they were frustrated because some of the witnesses pled the Fifth. And there's a political point being made as well.CHANG: OK. And just to remind everyone, this is a Republican-led committee. What do you make of the argument that they lay out in this report about Biden's cognitive decline and the permanence of these preemptive pardons?OSLER: Yeah. I'm not an expert on cognition, but I am an expert on clemency, and I can tell you that the Constitution doesn't make any requirement whatsoever as to how a pardon or a commutation is going to be put into writing or issued at all. And we've seen a variety of methods used over the years. You know, in 2005, the Office of Legal Counsel provided the president with advice that the president could use an autopen to sign bills - obviously one of the most important things the president is going to sign. And since then, presidents have used autopens for a wide variety of things...CHANG: Right.OSLER: ...Especially when there's a lot to be signed at once.CHANG: Well, what can the Department of Justice actually do in this situation? Like, can you think of anytime a pardon from a president has been reversed or declared null and void, as this House committee and President Trump would like to see happen here?OSLER: No, that hasn't happened. Once a president issues a pardon, it's been viewed as final. And so if something was to get overturned here, this would really be breaking new ground.CHANG: So are you telling me that a president's pardon power is absolute?OSLER: It's surprising, but that's what it says in the Constitution. It's almost absolute. It can't cover people who are under impeachment, and it's generally accepted that it can't pardon future crimes, those that haven't been committed yet. But yes. It's really rare in having so few checks and balances.CHANG: Well, then - OK - say you're a person who did receive a pardon from President Biden. What would you advise that person to do to protect themselves legally now from having that pardon reversed or somehow invalidated during the Trump administration?OSLER: Yeah. There's really not that much that they can do. Again, I think most people who have studied this would be shocked if a pardon was overturned. One of the things that I really fear that could happen with this investigation and some of the conclusions that they seem to want to reach is you have 37 people who received a commutation of their death sentence by President Biden. And I would really think it would cause a constitutional crisis if President Trump moved to execute those people despite that commutation of the death sentence. But going forward, I hope that pardons aren't undermined. They're under enough stress as they are.CHANG: Mark Osler, from the University of St. Thomas, thank you very much for being with us today.OSLER: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-28T20:20:31.000Z",
      "dateModified": "2025-10-28T20:20:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Are you worried about your SNAP benefits? NPR wants to hear your story",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5587760/snap-benefits-callout",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7820x4399+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F71%2Ffecf7a174a12a81c2974da4f6e18%2Fap25289506125167.jpg",
    "tag": "Politics",
    "date": "2025-10-28T19:02:09.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A California SNAP benefits shopper pushe",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A California SNAP benefits shopper pushes a cart through a supermarket.\n                \n                    Allison Dinner/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Allison Dinner/AP\n    \n\n   \n   As the federal government shutdown drags on, tens of millions of people are at risk of losing food and nutrition aid as a result. This includes the 42 million people who rely on the Supplemental Nutrition Assistance Program (SNAP), previously known as food stamps.   The NPR Network wants to hear from you about the potential loss or delay of these food benefits. Has the uncertainty already changed your plans around food? What other local resources are you turning to?   Fill out the form below and tell us your story. If you would be open to an NPR or member station producer contacting you for a story, please indicate that in the appropriate field. We will not use your submission in our story until we have communicated with you and obtained your consent to use the details that will be published.   \n   Your submission will be governed by our general Terms of Use and Privacy Policy. As the Privacy Policy says, we want you to be aware that there may be circumstances in which the exemptions provided under law for journalistic activities or freedom of expression may override privacy rights you might otherwise have.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Are you worried about your SNAP benefits? NPR wants to hear your story",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7820x4399+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F71%2Ffecf7a174a12a81c2974da4f6e18%2Fap25289506125167.jpg"
      ],
      "datePublished": "2025-10-28T19:02:09.000Z",
      "dateModified": "2025-10-28T19:02:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Want to opt out of AI? State labeling laws might help",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5575748/some-states-want-labels-ai-opt-out",
    "image": "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg",
    "tag": "Politics",
    "date": "2025-10-28T20:07:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting d",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting details taped to a light pole on a city street in San Francisco, California on May 20, 2025.\n                \n                    Smith Collection/Gado/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Smith Collection/Gado/Getty Images\n    \n\n   \n   Utah and California have passed laws requiring entities to disclose when they use AI. More states are considering similar legislation. Proponents say labels make it easier for people who don't like AI to opt out of using it.   \"They just want to be able to know,\" says Utah Department of Commerce executive director Margaret Woolley Busse, who is implementing new state laws requiring state-regulated businesses to disclose when they use AI with their customers.   \"If that person wants to know if it's human or not, they can ask. And the chatbot has to say.\"   California passed a similar law regarding chatbots back in 2019. This year it expanded disclosure rules, requiring police departments to specify when they use AI products to help write incident reports.   \n   \"I think AI in general and police AI in specific really thrives in the shadows, and is most successful when people don't know that it's being used,\" says Matthew Guariglia, a senior policy analyst for the Electronic Frontier Foundation, which supported the new law. \"I think labeling and transparency is really the first step.\"   As an example, Guariglia points to San Francisco, which now requires all city departments to report publicly how and when they use AI.   Such localized regulations are the kind of thing the Trump Administration has tried to head off. White House \"AI Czar\" David Sacks has referred to a \"state regulatory frenzy that is damaging the startup ecosystem.\"   Daniel Castro, with the industry-supported think tank Information Technology & Innovation Foundation, says AI transparency can be good for markets and democracy, but it may also slow innovation.   \"You can think of an electrician that wants to use AI to help communicate with his or her customers ... to answer queries about when they're available,\" Castro says. If companies have to disclose the use of AI, he says, \"maybe that turns off the customers and they don't really want to use it anymore.\"   For Kara Quinn, a homeschool teacher in Bremerton, Wash., slowing down the spread of AI seems appealing.   \n   \"Part of the issue, I think, is not just the thing itself; it's how quickly our lives have changed,\" she says. \"There may be things that I would buy into if there were a lot more time for development and implementation.\"   At the moment, she's changing email addresses because her longtime provider recently started summarizing the contents of her messages with AI.   \"Who decided that I don't get to read what another human being wrote? Who decides that this summary is actually what I'm going to think of their email?\" Quinn says. \"I value my ability to think. I don't want to outsource it.\"   Quinn's attitude to AI caught the attention of her sister-in-law, Ann-Elise Quinn, a supply chain analyst who lives in Washington, D.C. She's been holding \"salons\" for friends and acquaintances who want to discuss the implications of AI, and Kara Quinn's objections to the technology inspired the theme of a recent session.   \"How do we opt out if we want to?\" she asks. \"Or maybe [people] don't want to opt out, but they want to be consulted, at the very least.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Want to opt out of AI? State labeling laws might help",
      "image": [
        "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg"
      ],
      "datePublished": "2025-10-28T20:07:40.000Z",
      "dateModified": "2025-10-28T20:07:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump praises Japan's new prime minister during visit",
    "url": "https://www.npr.org/2025/10/28/g-s1-95314/trump-japan-visit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7925x4459+0+249/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd5%2F1729682e4e218ef178066899d230%2Fap25301176761115.jpg",
    "tag": "Politics",
    "date": "2025-10-28T08:47:29.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, left, and Japane",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, left, and Japanese Prime Minister Sanae Takaichi shake hands before their summit talk at Akasaka Palace in Tokyo, on Tuesday.\n                \n                    Japan Pool via Kyodo News/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Japan Pool via Kyodo News/AP\n    \n\n   \n   TOKYO — President Donald Trump began one of his busiest days of his Asia trip on Tuesday by warmly greeting the new Japanese prime minister, and taking her with him as he spoke to U.S. troops aboard an aircraft carrier.   \n   Although Trump is visiting one of America's most steadfast allies in Asia, there's no shortage of uncertainty while he's there. Sanae Takaichi, who became the country's first female prime minister only days ago, must solidify her relationship with Trump while defending her country's economic interests. Trump is trying to nail down $550 billion in Japanese investment as part of a trade agreement.   Trump and Takaichi swap warm words   As Trump and Takaichi met on Tuesday, they shook hands and he paid her a compliment: \"That's a very strong handshake.\"   \n   In return, Takaichi talked about watching the third game of the U.S. World Series before the event. She added that Japan would give Washington 250 cherry trees next year to honor America's 250th anniversary, as well as fireworks from Akita Prefecture for July 4 celebrations.   She used her early remarks to mention former Japanese Prime Minister Shinzo Abe, her archconservative mentor who forged a strong bond with Trump during his first term through their shared interest of golf.   \"As a matter of fact, Prime Minister Abe often told me about your dynamic diplomacy,\" she said.   Trump called her role as Japan's first woman prime minister as a \"big deal,\" putting an emphasis on the U.S. commitment to Japan. While the president in the past has publicly scolded his foreign counterparts, he had nothing but praise for Takaichi.   \"Anything I can do to help Japan, we will be there,\" Trump said. \"We are an ally at the strongest level.\"   Takaichi is primed for a charm offensive, including a potential purchase of Ford F-150 trucks. Reporters arriving for the event were hustled past a gold-hued Ford F-150 as well as what appeared to be white American-made Toyota vehicles parked outside the Akasaka Palace, which is Tokyo's guest house for visiting foreign leaders.   \n   Trump has often complained that Japan doesn't buy American vehicles, which are often too wide to be practical on narrow Japanese streets.   The Japanese delegation also made the strategic choice to serve American beef and rice during a working lunch that was mixed with Japanese ingredients, at which the two leaders also discussed efforts to end Russia's war in Ukraine.   Takaichi also gave Trump a putter used by Abe, the former prime minister, and a golf bag signed by the professional golfer Hideki Matsuyama, according to a post on X by White House aide Margo Martin. They signed black \"Japan is Back\" baseball caps that resembled Trump's own red \"Make America Great Again\" caps.   Agreements vow a 'golden age' for alliance and cooperation on critical minerals   Both leaders signed the implementation of an agreement for the \"golden age\" of their nations' alliance. When the document was held up after signing, it ran to less than one page and reaffirmed the earlier framework by which the U.S. would tax goods imported from Japan at 15% and the creation of a $550 billion fund for Japan to invest in the U.S.   \n   Trump and Takaichi then signed a second agreement, this one laying out a U.S.-Japan framework for securing the supply of critical minerals and rare earths. That agreement suggested that some of the investment dollars would go to the development of rare earths needed for advanced technologies.   White House press secretary Karoline Leavitt told reporters that Takaichi would be nominating Trump for the Nobel Peace Prize. The two leaders also met with people whose family members were abducted by North Korea.   Trump talks to troops on US aircraft carrier   Although Trump has focused his foreign policy toward Asia around tariffs and trade, he also spoke aboard the USS George Washington, an aircraft carrier docked at an American naval base near Tokyo. The president brought Takaichi with him and she also spoke.   \n   The president talked about individual units on the aircraft carrier, his political opponents, national security and the U.S. economy, saying that Takaichi had told him that Toyota would be investing $10 billion in auto plants in America.   Trump arrived in Tokyo on Monday, when he met with the emperor in a ceremonial visit. He was previously in Kuala Lumpur, Malaysia, where he participated in the annual summit of the Association of Southeast Asian Nations.   The gathering was an opportunity for Trump to celebrate an expanded ceasefire agreement between Thailand and Cambodia, which skirmished along their disputed border earlier this year. Trump had pressured them to stop fighting by threatening to withhold trade agreements.   There were also signs that tensions between the U.S. and China were cooling off ahead of a planned meeting between Trump and Chinese leader Xi Jinping, which is expected to take place in South Korea later this week. Top negotiators from each country said a trade deal was coming together, which could prevent a potentially damaging confrontation between the world's two largest economies.   Details were scarce, and it was unclear how much any agreement would resolve long-standing issues, or if it would return the relationship to the status quo before recent confrontations. China has restructured the export of rare earth elements that are critical for high-tech manufacturing, and Trump responded by threatening tariffs that even he admits would be unsustainable.   Trump is scheduled to leave Wednesday for South Korea, which is hosting the Asia-Pacific Economic Cooperation summit.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump praises Japan's new prime minister during visit",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7925x4459+0+249/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd5%2F1729682e4e218ef178066899d230%2Fap25301176761115.jpg"
      ],
      "datePublished": "2025-10-28T08:47:29.000Z",
      "dateModified": "2025-10-28T08:47:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lawmakers want to crack down on websites pirating sports content",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5564791/lawmakers-want-to-crack-down-on-websites-pirating-sports-content",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-28T08:57:35.000Z",
    "description": "\n      The cost of streaming services can add up when you're a sports fan. That's why some turn to pirated websites to follow their teams. A bill intr",
    "body": "\n      The cost of streaming services can add up when you're a sports fan. That's why some turn to pirated websites to follow their teams. A bill introduced in Congress aims to crack down on that practice.   \n\n    MICHEL MARTIN, HOST:  Steve, OK, let me ask. Did you stay up late - I mean really late - to watch the World Series last night?STEVE INSKEEP, HOST:  (Laughter) No, it was exactly the time period that I'm asleep.MARTIN: Well, you know, if you had stayed up, it aired for free on local Fox stations. But most of the regular season games you're going to want to see require a subscription, so some fans are turning to pirated websites. NPR's Ben Abrams reports on efforts to block those sites.BEN ABRAMS, BYLINE: Cable and streaming subscriptions are sacking Dai Nixon's wallet. He's a podcaster and a Philadelphia Eagles fan.DAI NIXON: We have to purchase these different subscriptions just to keep up with our favorite sports teams, which is, you know, kind of ridiculous.ABRAMS: Nixon watches games on YouTube TV, which costs him about $83 a month. But he lives in Charlotte, North Carolina. So some weekends, he can't watch his favorite team on an NFL-sanctioned platform. That's when he turns to NFLBITE, one of the popular foreign-based websites that illegally streams the games. The site is also free.NIXON: You know, I love my team. But, I mean, I'm not going to, you know, kick out over 300, 350 bucks annually just to watch them every week when I can do the same thing for not that price.ABRAMS: In 2023, about 1 out of 3 NFL fans said they watched some games on illegal streaming platforms. That's according to betting site Oddspedia. And there's little to stop them.MIKE SMITH: The challenge is, under existing U.S. law, there's just not much they can do to shut down these sites.ABRAMS: That's Mike Smith, professor of information technology and policy at Carnegie Mellon University. Earlier this year, authorities shut down StreamEast, a popular network that offers unauthorized sports content.SMITH: It required a yearlong investigation between U.S. rights holders and Egyptian law enforcement to finally get these sites shut down. When you shut down those sites, a bunch of new copycat sites appear quite quickly.ABRAMS: Now Congress wants to make it harder for pirate websites to stream stolen content. Democratic Senator Adam Schiff of California is sponsoring the Block Bad Electronic Art and Recording Distributors Act, known as the Block BEARD Act for short.ADAM SCHIFF: This is an effort to allow copyright holders to go to court and say, hey, this is my property. And this foreign site is predominantly in the business of theft.ABRAMS: The bipartisan bill would allow copyright holders, such as the NFL, to request federal courts to direct service providers to block sites that have stolen their content. Democratic Senator Chris Coons of Delaware is cosponsoring the bill. He says it's about keeping Americans' information safe.CHRIS COONS: Maybe you do get a chance to watch the Eagles for free or to see the latest movie you want to watch. But what you're also doing is opening the front door to all of your data, your finances, your web-browsing history.ABRAMS: Mike Smith of Carnegie Mellon says his research shows that laws similar to the Block BEARD Act passed in other countries discourage internet piracy.SMITH: Just blocking access to the site from within the country increases people's likelihood to pay for legal content.ABRAMS: NPR reached out to a handful of sites that pirate NFL games to ask for comment about how the act would affect their operations. None of them responded. Eagles fan Dai Nixon doesn't share the same worries about pirated streams hurting copyright holders. He's also not concerned about his personal data being stolen. But if his favorite pirating site did get shut down?NIXON: Every system can be finessed, just ask the president. So it may be a bump in the road, but the road is still there.ABRAMS: So for now, Nixon can keep streaming pirated games. And the Senate authors of the Block BEARD Act hope to release a bicameral bill with the House by the end of this year.Ben Abrams, NPR News.(SOUNDBITE OF MUSIC)\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lawmakers want to crack down on websites pirating sports content",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-28T08:57:35.000Z",
      "dateModified": "2025-10-28T08:57:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "America's immigration crackdown is disrupting the global remittance market",
    "url": "https://www.npr.org/sections/planet-money/2025/10/28/g-s1-94960/americas-immigration-crackdown-is-disrupting-the-global-remittance-market",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg",
    "tag": "Politics",
    "date": "2025-10-28T10:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the Trump administration shut down USAID and slashed spending on international aid and development. Development advocates worried — and continue to worry — that this will hurt the economies of developing nations and have deadly consequences for some of the poorest people on Earth. That story generated tons of headlines earlier this year.   But Dean Yang, an economist at the University of Michigan, argues \"the anti-immigration actions of the Trump administration are likely to have an even bigger negative effect on the economic development of the world's poor countries\" — and that story has gotten much less attention.   \n   It's not just that migration is one of the best known mechanisms to lift people out of poverty. Studies suggest those who move from poor countries to work in rich nations like the United States often see a four-to-five fold increase in the amount they're able to earn, and sometimes way more.   What leads Yang to argue this is that immigrants in the United States send a jaw-dropping amount of money back home to their families. These remittances, as they're known, have dwarfed the size of official foreign aid that the U.S. spends on things like economic development, health, and humanitarian assistance.   In fact, the United States has far and away been the number one source of remittances in the world. According to the International Organization for Migration, which works with the United Nations, immigrants in the United States sent almost $80 billion to their origin countries in 2022 (the last available year of data).   In an upcoming episode of Planet Money, which will be released Oct. 29, we dive into the disruption of these large financial flows in an era of immigration restriction. While some countries, including Mexico, have already seen a large drop in remittances from the United States in recent months, others are seeing a rather surprising pattern: a record-breaking surge. Our episode focuses on the causes and consequences of this surge and dives into the economics of remittances.   \n   This recent surge of remittances, however, is likely only going to be a temporary blip. Remittances will likely drop in the near future, with the large decline of immigration to the U.S., and the large numbers of immigrants already here getting deported.   And that could have significant macroeconomic effects on a whole host of nations, especially in Central America. For countries like Honduras, Nicaragua, El Salvador, and Guatemala, remittances account for a staggering share of their economies, ranging from around 20% to 27% of each country's GDP. These nations are already politically and economically fragile, which is a big reason why so many of their citizens immigrated to the United States in the first place. It's one reason why Yang believes the immigration crackdown could have severe consequences in the developing world.   Stay tuned for our new episode of Planet Money that dives more into this story.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "America's immigration crackdown is disrupting the global remittance market",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg"
      ],
      "datePublished": "2025-10-28T10:30:00.000Z",
      "dateModified": "2025-10-28T10:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5589180/trump-tariffs-senate-vote",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg",
    "tag": "Politics",
    "date": "2025-10-28T23:47:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping con",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping containers at the Port of Los Angeles on Sept. 26.\n                \n                    Mario Tama/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mario Tama/Getty Images\n    \n\n   \n   The Republican-led Senate on Tuesday delivered a rare bipartisan rebuke of President Trump in a vote to terminate the emergency powers he has used to set tariffs on Brazil, part of a larger push to rein in the administration's efforts to install trade barriers.   By a vote of 52 to 48, the Senate approved a measure that would roll back the 50% tariffs on Brazil imposed by President Trump in July. Five Republicans joined with Democrats to pass it: Susan Collins of Maine, Alaska's Lisa Murkowski, Thom Tillis of North Carolina and Kentucky's Mitch McConnell and Rand Paul.   \n   The success of the resolution, which needed just a simple majority to pass, may only prove symbolic. Speaker Mike Johnson, R-La., is unlikely to bring the measure up for a vote in the House, and even if he did President Trump would almost certainly veto it.   Still, the vote marked a test of support for the president's tariff policies among Republicans, reflecting unease inside the party about their impacts on the U.S. economy, and specifically the farming and manufacturing sectors. It came ahead of arguments at the Supreme Court this fall in a case challenging Trump's authority to put sweeping tariffs in place using emergency powers.   \n   Tuesday's vote was the first of three planned by Democrats and a handful of Republicans aimed at rolling back the president's tariff policies. Later this week, the Senate is expected to take up similar votes to reverse tariffs on Canada and other nations.   One of the lawmakers behind the push is Sen. Tim Kaine, D-Va., the lead sponsor of the measure approved Tuesday. Ahead of the vote, Kaine told reporters the effort highlights the tariffs' stark impacts on the U.S. economy in recent months.   \"They're about the economic destruction of tariffs, but they are also really about how much will we let a president get away with?\" Kaine asked. \"Do my colleagues have a gag reflex or not, in terms of powers that constitutionally are handed to Congress?\"   \n   The five Republicans who broke ranks did so despite a last minute lobbying push by Vice President JD Vance, who met with Senate Republicans on Capitol Hill on Tuesday and urged them to back the president's policies. Vance told reporters after the lunch meeting that the tariffs are critical leverage for Trump in international negotiations.   To block the president's emergency powers to set tariffs, \"is to strip that incredible leverage from the president of the United States,\" Vance told reporters outside the meeting room near the Senate chamber. \"I think it's a huge mistake, and I know most of the people in there agree with me.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President JD Vance talks with reporters after attending the weekly Senate Republican policy lunch on Tuesday. Vance told reporters that tariffs are a critical source of leverage for President Trump on the international stage.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   The vote took place as President Trump is in Asia for a multi-nation trip where trade talks are a top focus.   Sen. Josh Hawley, R-Mo., said Vance told Republicans that Trump is essentially on a trade mission.   \"It's successful, and it's bringing in a lot of revenue,\" Hawley said about the trip as he explained his opposition to the measure. \"I'm supportive of the president's tariff policy.\"   \n   Not all Republicans were convinced. Tillis said after the meeting he would vote to limit the tariffs.   \"I just don't think there's a rational basis for it,\" Tillis said. \"If you start allowing that … that creates a big uncertainty in the business community.\"   Trump triggered the Brazil tariffs this summer to pressure the country's government to end what he called a \"witch hunt\" against his ally, former far-right Brazilian President Jair Bolsonaro. Last month, Bolsonaro was sentenced to 27 years in prison for attempting a coup to stay in power following his 2022 election defeat.   The vote wasn't the first time Senate Republicans have broken with Trump on tariffs. In April, a measure to block tariffs on Canada drew a simple majority of the Republican-led Senate as a handful of G.O.P senators joined Democrats to push the measure across the finish line. Kaine and Paul co-sponsored the measure, and McConnell, Collins and Murkowski voted in favor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg"
      ],
      "datePublished": "2025-10-28T23:47:12.000Z",
      "dateModified": "2025-10-28T23:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As Trump talks of designating antifa a foreign terrorist group, experts see danger",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5587726/trump-antifa-terrorist-group",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5653x3180+0+295/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F79%2F4310ac134638800569f178f2cc8a%2Fgettyimages-2239999886.jpg",
    "tag": "Politics",
    "date": "2025-10-28T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as (L-R) White Ho",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as (L-R) White House Deputy Chief of Staff Stephen Miller, White House Chief of Staff Susie Wiles, Attorney General Pam Bondi, Secretary of Homeland Security Kristi Noem and Federal Bureau of Investigation Director Kash Patel listen during a roundtable discussion at the White House on Oct. 8. The administration held the roundtable to discuss the antifa movement after the president signed an executive order designating it as a \"domestic terrorist organization.\"\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   Earlier this month, President Trump hosted a roundtable at the White House about antifa, the far-left movement or ideology opposed to fascism. Some of the right-wing influencers gathered around the table urged him to designate antifa as a foreign terrorist organization.   \"Would you like to see it done?\" the president asked. \"You think it would help? I'd be glad to do it. I think it's the kind of thing I'd like to do. Does everybody agree? If you agree, I agree. Let's get it done.\" Trump then turned to Secretary of State Marco Rubio and said, \"Marco, we'll take care of that.\"   \n   Trump has already issued an executive order that labels antifa a domestic terrorist organization, but the impact of that is unclear since there is no federal legal provision to designate domestic terrorism groups.   The State Department does have the authority, however, to designate foreign terrorist groups, a move that has real legal teeth. If the Trump administration were to take that step against antifa, it would likely have massive implications.   \"It would have a legal impact that would have a cascading effect across civil society, including social media organizations, civic organizations and everything in between,\" said Thomas Brzozowski, the former counsel for domestic terrorism at the Justice Department.   \"It would effectively criminalize activity that is associated with a diffuse — I hesitate to use the term organization — but more of an ethos or a shared collective dissent to a lot of what the administration is doing.\"   Trump has made no secret of his antipathy for the political left   During Trump's first term in office, he blamed far-left radicals and antifa for violence in cities during social justice protests after the police killing of George Floyd in Minneapolis.   The Justice Department tried to figure out then if there was a funding network or leadership structure for antifa but never presented evidence of either.    \n   The FBI director at the time, Christopher Wray, testified before Congress in 2020 that antifa is not a group but rather an ideology, while also stating that the bureau did have investigations into people who identify as antifa.    This year, after the assassination of conservative activist Charlie Kirk, Trump said there are \"radical left lunatics out there and we just have to beat the hell out of them.\"   \n   Deputy White House Chief of Staff Stephen Miller recently said the Democratic party \"is not a political party. It is a domestic extremist organization.\"   Miller, who was at the White House roundtable, was asked by Trump about possibly designating antifa as a foreign terrorist group.   In response, Miller claimed antifa has \"extensive\" foreign ties and said designating it \"would be a very valid step to take.\"           The secretary of state designates a foreign terrorist organization based on certain legal criteria: Is the entity in question an organization? Is it foreign? Is it engaged in terrorism against Americans or American national security interests?   Based on those criteria, it would be difficult from a legal perspective to designate antifa a foreign terrorist organization, said Jason Blazakis, who for a decade led the State Department office responsible for designations under the Obama and first Trump administrations.    \"First and foremost, antifa is not necessarily an organization. It is at best a movement of disparately linked individuals who are united based on an ideology, which is a belief that fascism is bad,\" Blazakis said.   Antifa isn't a functioning, cohesive organization like ISIS or al-Qaida, he said, which had clear leaders and a hierarchy.   \"I would really call on the State Department or the U.S. government to tell us who the leader of antifa is and where they are based,\" he said. \"We've not heard anybody from the administration really talk about antifa's leadership and its organization structure.\"   \n   Even if officials were to try to characterize antifa as a formal group, senior administration officials have repeatedly described it as inherently domestic, which would make it difficult to suddenly declare it a foreign entity, Blazakis said.   Still, he acknowledged that the Trump administration could push a designation over the line if the president wants it to happen.   Far-right allies in Hungary and the Netherlands, for example, have made statements — echoing Trump — about declaring antifa a terrorist organization.   The administration could point to those, Blazakis said, to \"try to make a creative argument that there is some foreign-based nexus that exists here.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protest sign held by a demonstrator at a rally at the Atlanta Civic Center on Oct. 18 in Atlanta.\n                \n                    Julia Beverly/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Julia Beverly/Getty Images\n    \n\n   \n   \"It's not necessarily something that we can ignore as a possibility that this administration, they want to pursue, essentially just stretch the truth, to fit its policy objective, in this case going after left-wing or progressives through the lens of using counterterrorism tools,\" Blazakis said.   Asked whether the State Department had begun the process of designating antifa, a department spokesperson said: \"Antifa represents a dangerous threat to law and order. The United States has a variety of options available to target terrorists and terrorist organizations, and the State Department will use all available tools to keep Americans safe.\"   Criminal charges could begin with material support   If the Trump administration does designate antifa a foreign terrorist group, the reverberations would likely be huge, starting with the ability of federal prosecutors to bring the criminal charge of material support to a designated terrorist organization.   This has been a standing charge against ISIS and al-Qaida supporters, and it carries a penalty of up to 20 years in prison.   Material support has been broadly defined over the years; it can mean everything from financial or educational support to something as small as a bottle of water or a $10 gift card.   The law also extends to activity between two people just talking about providing material support to a foreign terrorist organization, which is cause for concern with a nebulous term like antifa, said Brzozowski, the former counsel for domestic terrorism at the Justice Department.   \n   \"When that foreign terrorist organization is so ill defined and nobody even knows what it is, and it potentially includes all activity that can be painted as left wing or whatever term you'd like to hang on it, that becomes potentially catastrophically dangerous for anybody, for everybody,\" Brzozowski said.   There are also potential ripple effects.   Social media companies, for example, take their cues from the government on which groups are dangerous. If antifa is designated, social media companies would likely take steps to restrict any communication that could be seen as related to antifa, Brzozowski said.   The companies also would likely build mechanisms to affirmatively report such activities on their platforms to the government.   \"The social media piece is super important,\" Brzozowski said. \"That really in today's environment obviously is going to dictate in many respects what the broader public sees and what they don't see. So that's going to have an immediate impact on public discourse across the board.\"   Universities, meanwhile, could cancel conferences that touch any topic that might be viewed as related to anti-fascism, and faculty research could be curtailed, Brzozowski said.   Then there are the insurance firms that insure universities, nonprofits, progressive think tanks and foundations.   \"They're not going to insure these institutions if they touch anything that remotely concerns anti-fascism,\" Brzozowksi said. \"And think about how broad that is. What does that even mean? It sounds crazy, Kafkaesque, but that's what this designation would bring into play.\"   All of these ripple effects depend, of course, on the Trump administration following through and designating antifa a foreign terrorist organization.   In Brzozowski's view, there's good reason to believe the administration will.   \"The president himself during a roundtable at the White House turned to his senior advisers whose job it is to designate these entities and instructed them to do it, on TV,\" he said. \"So yeah I think they might do it. And people are not ready for it. People are not ready for it. If that goes through, I'm telling you, unbelievable.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As Trump talks of designating antifa a foreign terrorist group, experts see danger",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5653x3180+0+295/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F79%2F4310ac134638800569f178f2cc8a%2Fgettyimages-2239999886.jpg"
      ],
      "datePublished": "2025-10-28T09:00:00.000Z",
      "dateModified": "2025-10-28T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge indefinitely halts shutdown layoffs noting human toll",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5585083/government-shutdown-trump-rif-layoffs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6816x3834+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F04%2Fc6ae1c6c4e81b2a0a7a2c8655cd9%2Fimage-credit-tom-williamscq-roll-call-inc-via-getty-images.jpg",
    "tag": "Politics",
    "date": "2025-10-28T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Signs with the image of Office of Manage",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Signs with the image of Office of Management and Budget Director Russell Vought are seen during a news conference Congressional Democrats held to protest the Trump administration's mass firing of federal employees in Washington, D.C., on Tuesday, Oct. 14.\n                \n                    Tom Williams/CQ-Roll Call, Inc via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Williams/CQ-Roll Call, Inc via Getty Images\n    \n\n   \n   A federal judge in San Francisco has indefinitely halted the Trump administration's mass layoffs of federal employees tied to the government shutdown.   The decision came almost two weeks after U.S. District Judge Susan Illston temporarily paused thousands of layoffs, known as RIFs, or reductions-in-force, at agencies where the federal employee unions that brought the lawsuit, including the American Federation of Government Employees, have members or bargaining units.   In court on Tuesday, an attorney representing the Trump administration pushed back, asserting that the executive branch can conduct RIFs before, during or after a lapse in Congressional appropriations to achieve the president's policy priorities — and that it's good policy to do so.   \n   \"If you don't have money coming in, you should be looking for ways to cut costs,\" argued Michael Velchik, an attorney with the Justice Department.   The plaintiffs' attorney, Danielle Leonard, countered that a lapse in appropriations is not the same thing as an elimination of statutory authority, and that the government cannot simply tell agencies they no longer need to comply with Congressional mandates. She further argued that the government had violated federal law by ordering employees to work on RIFs during the shutdown.   In the days since Illston first issued her temporary restraining order, the two sides have haggled over its scope. The Trump administration initially determined it did not apply to most of the roughly 4,000 federal employees who have received layoff notices since the government shutdown began on Oct. 1, including those working for the Treasury Department and the Centers for Disease Control and Prevention. Illston later modified the order, including by broadening it to cover six additional unions.   \n   On Tuesday, Illston said she believed the unions were likely to prove that the Trump administration's actions were unlawful, but she appeared to pull back slightly on the scope of her order. She said she would hold another hearing to determine whether some of the RIFs announced since the shutdown began, including at the Interior Department and the Education Department, were in fact related to the lapse in appropriations.   Whatever comes of President Trump's latest attempts to slash the federal workforce, it's clear that the administration's modus operandi — taking sweeping and legally questionable actions to swiftly eliminate jobs — is taking a toll on workers, a point Illston underscored in court on Tuesday.   \n   In her opening remarks, Illston read from several of the declarations submitted by employees who have received layoff notices since Oct. 1, including an Air Force veteran and longtime federal employee who wrote that she had never gone through anything as traumatizing as what she's going through now — including during her combat deployment.   \"Human lives are being dramatically affected by the activities we're discussing,\" Illston said.   For many of those receiving layoff notices amid the shutdown, it's not the first time the Trump administration has tried to fire them.   In one testimony filed with the court, Mayra Medrano, a program analyst with the Commerce Department's Minority Business Development Agency and a member of the National Federation of Federal Employees, wrote that she first received a RIF notice in April with an effective termination date of May 9 before being reinstated by court order in June.   \"The constant threat of being fired, which has persisted for months, has caused me tremendous physical and mental distress,\" she wrote, elaborating that she experienced a severe stress-induced seizure while on administrative leave this spring.   She wrote that she now feels as if she's reliving that nightmare.   \"Receiving a RIF notice during the government shutdown, on top of the previous RIF, has been traumatic and it will have a lasting impact on my health,\" she wrote. \"It doesn't feel as though the administration thought about or cared about that long-lasting impact.\"   Medrano did not respond to NPR's request for further comment.    In the initial hearing in the case two weeks ago, the plaintiffs' attorney Leonard pointed to comments made by White House Office of Management and Budget Director Russell Vought before Trump's re-election.   In a private speech in 2023 surfaced by ProPublica, Vought, who is now largely seen as the force behind the shutdown layoffs, said he wanted government bureaucrats to be \"traumatically affected\" to the point of not wanting to go to work.   \n   \"That's exactly what they are doing,\" Leonard told the court.   In an interview with The Charlie Kirk Show before Illston blocked the layoffs, Vought said more than 10,000 people could receive RIF notices during the shutdown.   \n   Still, that amounts to only a fraction of the federal employees who have been fired since Trump returned to the White House in January.   Back in August, Office of Personnel Management Director Scott Kupor said roughly 300,000 federal workers would be gone from the government by the end of the year, noting that 80% of those departures were voluntary.   That means even prior to the shutdown, roughly 60,000 federal workers faced involuntary separation, according to Kupor's estimates.   Another 154,000 workers took the Trump administration's \"Fork in the Road\" buyout offer, according to OPM. Many who took the buyout told NPR they feared they would be fired if they didn't leave.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge indefinitely halts shutdown layoffs noting human toll",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6816x3834+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F04%2Fc6ae1c6c4e81b2a0a7a2c8655cd9%2Fimage-credit-tom-williamscq-roll-call-inc-via-getty-images.jpg"
      ],
      "datePublished": "2025-10-28T09:00:00.000Z",
      "dateModified": "2025-10-28T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNAP runs out of money Nov. 1. States are now figuring out how to feed millions of people",
    "url": "https://www.npr.org/2025/10/28/g-s1-95189/snap-food-stamps-government-shutdown-november",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+77/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F69%2F1c9cb034456cb4e3aab6e90cc907%2F251021-food-for-fed-workers-wamu-08.JPG",
    "tag": "Politics",
    "date": "2025-10-28T18:46:17.000Z",
    "description": "SNAP runs out of money Nov. 1. Here's what that means in your state   As November looms, states are trying to sort what options they can offer benefic",
    "body": "SNAP runs out of money Nov. 1. Here's what that means in your state   As November looms, states are trying to sort what options they can offer beneficiaries to fill the gap in food assistance. Reporters from the NPR Network are covering the impact of this potential lapse in states across the country.\n\n   \n\n                  \n            Updated October 28, 20254:15 PM ET\n                \n                    Originally published October 28, 20252:46 PM ET\n                \n                \n\n      \n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal worker moves through the food distribution line at an event giving food to federal workers affected by the shutdown in Hyattesville, Md., on Oct. 21, 2025.\n                \n                    Tyrone Turner/WAMU\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tyrone Turner/WAMU\n    \n\n   \n   The federal government shutdown continues without an end in sight. In just a few days, tens of millions of people are at risk of losing federal food and nutrition benefits as a result. This includes the nearly 42 million people who rely on the Supplemental Nutrition Assistance Program, or SNAP, previously known as food stamps.   The Trump administration has warned that the debit-like EBT cards will not be refilled and that the program will run out of money on Nov. 1.   SNAP, the country's largest anti-hunger program, dates back to the Great Depression and has never been disrupted this way. Most recipients are seniors, families with kids and people with disabilities.   \n   Individual states handle the distribution, while the federal government provides the funds and infrastructure that power the debit-like cards.   Are you worried about your SNAP benefits? NPR wants to hear your story   In a letter dated Oct. 10, the U.S. Department of Agriculture (USDA) told state agencies to hold off distributing November benefits \"until further notice\" because of insufficient funds. The left-leaning Center on Budget and Policy Priorities has called on the agency to shift money from its contingency fund and other places to keep SNAP at least partially funded. It contends the USDA has a legal obligation to do so since SNAP is an entitlement program. But the USDA rejects that argument, stating in a memo Friday that its contingency funds are \"not legally available\" to extend regular benefits and are meant only for \"natural disasters like hurricanes, tornadoes, and floods.\"   As NPR's Stephen Fowler reports, a coalition of more than two dozen Democratic state leaders are suing the Trump administration over its decision to suspend federal food benefits during the government shutdown.    Now, as November looms, states are trying to sort what options they can offer beneficiaries to fill the gap in food assistance.   — Jennifer Ludden, NPR    Reporters from the NPR Network are covering the impact of this potential lapse in states across the country.   \n   Here's what we know so far.      Alabama   Roughly 749,000 people participate in SNAP in Alabama, according to the USDA. Alabama's Department of Human Resources (DHR), the agency responsible for SNAP in the state, says on its website that individuals can still apply for SNAP benefits during the suspension and DHR will continue to process applications and determine eligibility. Benefits will not be issued until the suspension is lifted.Current SNAP recipients, however, \"must continue to recertify their benefits, report as they normally would, and submit all documentation that would normally be required for them to continue in the program,\" DHR says. This is necessary so that each SNAP recipient can more quickly use their November funds in the grocery stores.      Alaska   Roughly 66,000 people participate in SNAP in Alaska, according to the USDA. Alaskans will not receive SNAP benefits for November, according to the state Division of Public Assistance, unless the federal government shutdown ends before then. [Alaska Public Media]Officials say the division will continue adding SNAP beneficiaries during the shutdown and Alaskans who lost food because of Typhoon Halong in western Alaska can apply to get October SNAP benefits re-issued. Michelle DeWitt, executive director of Bethel Community Services Foundation, said the state's formal food security safety nets are already stretched thin in the wake of the early October storm. [Alaska Public Media]      Arizona   More than 887,000 people participate in SNAP in Arizona, according to the USDA. The Arizona Department of Economic Security, which administers SNAP in the state, is directing Arizona SNAP recipients to local food banks if they need immediate food assistance. Food banks in Arizona can be found through the Arizona Food Bank Network. [KJZZ]      Arkansas   Roughly 236,000 people participate in SNAP in Arkansas, according to the USDA. Arkansas' Department of Human Services says SNAP beneficiaries should prepare for a delay or disruption in November benefits, according to an Oct. 22 post on the agency website. The agency is awaiting further guidance from USDA.On X , Gov. Sarah Huckabee Sanders echoed Republican talking points, blaming Democrats for the shutdown and the impact on SNAP beneficiaries in her state.  She wrote Monday, \"SNAP doesn't just serve families - it helps small town grocery stores too. But 2,700 Arkansas retailers soon won't be able to serve SNAP-recipient customers because of the Democrat's shutdown. Democrats need to do their job and stop punishing families and small businesses.\"Arkansas' DHS is pushing SNAP recipients to find local food pantries, churches and other organizations for temporary food assistance and to check for eligibility of other food programs.    \n      California   Over 5.5 million people participate in CalFresh — the state's implementation of the federally funded SNAP program. Well over 1 million people in LA County. The other major SoCal counties — San Bernardino, Riverside and Orange — each have more than 300,000 people on CalFresh, according to state data. [LAist]Gov. Gavin Newsom announced Oct. 22 that he would deploy the California National Guard to support food banks across California as the federal government shutdown drags on. [KQED]   For more on alternative free resources in the San Francisco Bay Area, head to KQED.      Are you worried about your SNAP benefits? NPR wants to hear your story      Colorado   Gov. Jared Polis said 600,000 Coloradans, half of whom are children, won't get SNAP benefits on Nov. 1. Polis warned that state funding would not be nearly enough to offset the federal SNAP delay. [Colorado Public Radio]As the Nov. 1 date nears, food banks and county health services have been preparing for a delay in the federal program and increased crowds needing assistance. [Colorado Public Radio]Colorado is among the states suing the Trump administration over its decision to suspend federal food benefits during the government shutdown. [Colorado Public Radio]      Connecticut   SNAP serves an estimated 360,000 people in Connecticut per year, according to state officials. [CT Public]Connecticut will spend $3 million, which will stretch about two weeks, to partially supplement federal food aid benefits through the nonprofit Connecticut Foodshare. [WSHU]Shortly after the latest shutdown began, some Connecticut legislators asked if the state — which has enjoyed unprecedented budget surpluses averaging more than $1.8 billion since 2017 — could again pump some of its own resources into SNAP benefits. But if EBT cards are shut off that could prove ineffective. Officials say  they are exploring options to expand emergency aid to food pantries and banks and other nonprofit nutrition assistance services. [CT Public]      Delaware   Over 110,000 people in Delaware participate in SNAP according to the USDA.Gov. Matt Meyer confirmed on X that the government shutdown means Delaware will not be able to issue more than $20 million dollars in monthly SNAP food benefits to approximately 60,000 Delaware households. He wrote, \"We're a state of neighbors, and we'll get through this — together.\"   \n      District of Columbia   Over 130,000 people in the District of Columbia participate in SNAP according to the USDA.D.C. Attorney General Brian L. Schwalb was among a group of state attorneys general who signed on to a letter to the USDA asking for clarification on why reserve funds set aside for this purpose were not being used. The Capital Area Food Bank has seen some of its own federal funding slashed even as demand skyrockets. [WAMU]      Florida   Nearly 3 million people in Florida participate in SNAP, according to the USDA.State officials have warned SNAP recipients that benefits for the month of November \"will not be issued until federal funding is restored.\" [WLRN]U.S. Rep. Maxwell Alejandro Frost, a Democrat from Orlando, is calling on Republican Gov. Ron DeSantis and the Republican-majority Florida Legislature to convene a special session and pass legislation to fund SNAP, as a potential lapse in federal funding looms due to the federal government shutdown. [WLRN]In addition, earlier this month, Florida lawmakers learned that the state had a 15% administrative error rate in 2024, which will cost the state roughly $1 billion a year starting as early as 2027. [WUSF]      Are you worried about your SNAP benefits? NPR wants to hear your story      Georgia   SNAP serves 1.3 million people in Georgia, according to the USDA.At the same time, the state's SNAP administrators say they need more than $60 million from the state to maintain staffing in 2026 to make up for federal cuts. [WABE]Local reporting highlights the direct impact this loss of funding has on the state's economy and rural communities, especially. Fox5 Atlanta reports that SNAP \"injects more than $3 billion per year into Georgia's economy, supporting over 2,300 grocery stores, big box chains, specialty shops and farmers markets statewide.\" And 17% of rural Georgians rely on SNAP, compared to 11% in metro areas.    \n      Guam   Over 32,000 people in Guam participate in SNAP, according to the USDA.Gov. Lou Leon Guerrero signed a bill Monday that funds SNAP through November for the nearly 30% of Guam's population that receive the benefits. Pacific Daily News reports that the law means that $12.3 million will go to SNAP and $800,000 will go to the USDA's Special Supplemental Nutrition Program for Women, Infants, and Children, or WIC benefits.      Hawaii   Over 160,000 people in Hawaii participate in SNAP, according to the USDA.Hawaii is setting aside $100 million to help eligible families with housing and utility payments. [Hawai'i Public Radio]Earlier this month, Hawaii Foodbank Vice President Marielle Terbio told Hawai'i Public Radio that those in need should reach out for assistance. Updated lists of food distributions can be found at hawaiifoodbank.org/help, as well as resources for Maui at mauifoodbank.org. [Hawai'i Public Radio]   For more resources in Hawaii, head to Hawai'i Public Radio.       Idaho   Over 130,000 people in Idaho participate in SNAP, according to the USDA.The Idaho Department of Health and Welfare says it will not distribute food stamps in November. [Boise State Public Radio]The Idaho Foodbank, which serves about 216,000 people each month through 400 partners across the state, anticipates an increase in people accessing food pantries and soup kitchens as benefits run out at the end of the month. [Boise State Public Radio]      Illinois   Nearly 2 million people in Illinois participate in SNAP, according to the USDA.Food pantries in Chicago are urging families to prepare a \"plan B\" if federal benefits are paused for the nutritional program that helps low-income households. [WBEZ]      Indiana   Roughly 600,000 people in Indiana participate in SNAP, according to the USDA.A message on the Indiana Family and Social Services Administration website says the state can't issue November SNAP benefits until funding is restored. [Louisville Public Media]Nonprofits that serve lower-income families in Southern Indiana say they're worried about the shutdown exacerbating food insecurity in the area.  [Louisville Public Media]   \n      Iowa   Over 250,000 people in Iowa participate in SNAP according to the USDA.Gov. Kim Reynolds said Thursday she has directed the Iowa Department of Health and Human Services to hold regular calls with food banks and is reviewing the state's food insecurity response plan. [Iowa Public Radio]Kathy Underhill, CEO of the Des Moines Area Religious Council (DMARC), which runs a network of 14 food pantries, said this would hit low-income Iowans incredibly hard. \"November is always the busiest month in the food bank and food pantry world, and if SNAP benefits do not go out on time in November, the capacity of food banks and food pantries will be pushed to their very limits,\" Underhill said. [Iowa Public Radio]      Are you worried about your SNAP benefits? NPR wants to hear your story      Kansas   Over 186,000 people in Kansas participate in SNAP, according to the USDA.Gov. Laura Kelly joined a lawsuit by other Democratic governors and state attorneys general against the U.S. Department of Agriculture for refusing to fund the Supplemental Nutrition Assistance Program, or SNAP. [KCUR]Kelly said she will hold food drives on her statewide budget listening tour to benefit Kansans who have lost employment or welfare benefits due to the shutdown. [KCUR]      Kentucky   Over 550,000 people in Kentucky participate in SNAP, according to the USDA. Funding for food assistance benefits next month isn't coming, Gov. Andy Beshear said, due to the federal government shutdown. Funding for the Temporary Assistance for Needy Families program is also delayed. [LPM]Beshear is among the three Democratic governors and more than two dozen Democratic attorneys general suing the USDA over suspension of SNAP benefits.      Louisiana   Over 800,000 people in Louisiana participate in SNAP according to the USDA. Gov. Jeff Landry and the Louisiana Department of Health are notifying SNAP recipients they will not receive new benefits starting Nov. 1. Louisiana Department of Health Secretary Bruce Greenstein sent a letter this week announcing plans to furlough staff who work for SNAP as a result of the federal government shutdown. [WWNO/WRKF]   \n      Maine   Nearly 170,000 Mainers, or over 12% of the state's total population, could lose food assistance if SNAP benefits are not funded for November.  According to Maine Department of Health and Human Services, those who need additional resources are encouraged to call 211 for help. [Maine Public]      Maryland   Over 660,000 people in Maryland participate in SNAP, according to the USDA.Maryland Gov. Wes Moore said Friday that he will not tap into state cash reserves to pay for benefits. [WYPR]The Maryland Department of Aging is urging people to go to food banks if they are unable to afford food during the halt in benefits. [WYPR]In addition to the added demand, the Capital Area Food Bank has seen some of its own federal funding slashed even as demand skyrockets. [WAMU]      Massachusetts   Over 1 million people in Massachusetts participate in SNAP, according to the USDA. State officials and the United Way are partnering to help raise money to offset the potential lapse in federal food assistance. [GBH]Massachusetts receives about $240 million monthly from the federal government for the program, which officials say can't be covered by the state budget. [WBUR]      Michigan   Over 1.4 million people in Michigan participate in SNAP, according to the USDA.Michigan is suspending food assistance payments starting in November until further notice, according to the state health department. [Michigan Public]The Greater Lansing Food Bank, which covers seven counties through 300 food partners,  purchased additional food to account for an expected higher demand [Michigan Public]      Are you worried about your SNAP benefits? NPR wants to hear your story      Minnesota   Nearly half a million people in Minnesota participate in SNAP according to the USDA.The loss of federal funding leaves a $73 million void in Minnesota's nutritional safety net, and state officials say there isn't enough money to provide Minnesota participants with their November benefits. [MPR News]Gov. Tim Walz announced today $4 million in emergency state funding for Minnesota's food shelves as the federal shutdown continues. [MPR News]   \n   For more on food assistance resources in Minnesota, head to MPR News.       Mississippi   Over 350,000 people in Mississippi participate in SNAP according to the USDA.The Mississippi Department of Human Services announced on Oct. 24 that benefits won't be issued in November because of the ongoing shutdown.Gov. Tate Reeves attacked Democrats in Congress for the shutdown, saying on X that his state is unable to cover the costs, \"There is sadly no simple way for state government to just step in and pay the hundreds of millions of dollars in harm that this shutdown by the Washington Democrats is causing.\"      Missouri   Roughly 650,000 Missourians will not receive SNAP benefits for the month of November due to the ongoing government shutdown. [St. Louis Public Radio]In a statement, Missouri's health services department said it will continue to \"accept and process SNAP applications, reported changes, and mid-certifications\" as normal. Once the shutdown is over, the department will work quickly to restore SNAP benefits, the statement said. [St. Louis Public Radio]      Montana   Over 80,000 people in Montana participate in SNAP, according to the USDA.The Montana Food Bank Network expects demand on local food banks to rise the longer the shutdown persists. [Montana Public Radio]      Nebraska   Over 150,000 people in Nebraska participate in SNAP, according to the USDA.Like other Republican governors, Nebraska's. Jim Pillen blamed Democrats for the shutdown on social media. The state agency responsible for handling SNAP benefits says more updates will come later but confirmed the program will likely be disrupted due to the government shutdown.       Nevada   Funding for Nevada's administration of the Supplemental Nutrition Assistance Program, which provides food assistance for roughly half a million Nevadans, is set to run out on Nov. 1 [Nevada Public Radio]Keeping the program running requires about $90 million a month, and Gov. Joe Lombardo's office argues that creating a state-funded mechanism would require legislative approval. State Treasurer Zach Conine warned that the loss of benefits could immediately reduce the state's economic output by $162 million. [Nevada Public Radio]      New Hampshire   The state is planning to provide support to the more than 75,000 state residents who rely on SNAP, according to the state Department of Health and Human Services. The department announced plans Thursday to partner with the New Hampshire Food Bank to make up for the delayed federal funds. [NHPR]The health department said it is unclear if EBT cards will work amid the shutdown in November and encouraged people to use their remaining benefits, which typically roll over each month, by Oct. 31. [NHPR]      New Jersey   Over 800,000 people in New Jersey participate in SNAP, according to the USDA.NJ SNAP said other programs like Work First New Jersey and the Child Care Assistance Program will not be impacted by the shutdown. Democratic Gov. Phil Murphy issued a statement blaming Republicans for the shutdown and urging them to use about $5 billion in SNAP contingency funds set aside for emergency circumstances. He said, \"These decisions are putting families across our state in impossible positions, forcing them to choose between feeding their children, affording life-saving medications, or paying rent. We see this for what it is – a clear abandonment of America's working- and middle-class families.\"      New Mexico   Nearly half a million people in New Mexico participate in SNAP, according to the USDA.U.S. Rep. Melanie Stansbury, a Democrat, said an \"emergency food plan\" is emerging that tasks charitable organizations and schools with counteracting the expected loss of $90 million in SNAP benefits for 250,000 New Mexico households. [KUNM]      Are you worried about your SNAP benefits? NPR wants to hear your story      New York   Nearly 3 million people in New York participate in SNAP, according to the USDA. According to state and city data, 1.8 million of those are in New York City. [Gothamist]Gov. Kathy Hochul said Monday that she's exploring whether the state can send schoolchildren home with meals as the ongoing federal shutdown threatens November's food assistance benefits. [Gothamist]Erie County First Deputy Commissioner of Social Services Dan Szewc said the Department of Social Services will contact SNAP households directly with emergency food resource information starting this week. [Buffalo Toronto Public Media]      North Carolina   Over 1.4 million people in North Carolina participate in SNAP, according to the USDA.The North Carolina Department of Health and Human Services says November SNAP benefits could be disrupted if the federal government shutdown continues. [WFAE]Jason Kanawati Stephany is vice president of the Food Bank of Central & Eastern North Carolina, which serves about 40% of the state's population. Earlier this year, Kanawati Stephany told WUNC that North Carolina's seven Feeding the Carolinas food banks distributed 250 million meals over the past year. But for every one they provided, Kanawati Stephany said, SNAP provides nine. [WUNC]The state's attorney general, Jeff Jackson, and 22 other state attorneys general issued a warning to the U.S. Department of Agriculture that refusing to use reserve funds set aside for this exact situation would be unlawful. [PRE]      Northern Mariana Islands   Gov. David M. Apatang has formally requested a $3.9 million emergency appropriation from the Commonwealth of the Northern Mariana Islands 2026 budget to sustain Nutritional Assistance Program (NAP) benefits for November 2025. [Isla Public Media]The region only adopted the EBT system for benefits earlier this month. The delay was due in part to the unique block grant arrangement with the U.S. Department of Agriculture, which provided flexibility but exempted the Commonwealth from federal mandates tied to EBT implementation [Isla Public Media]      North Dakota   Over 50,000 people in North Dakota participate in SNAP, according to the USDA.Gov. Kelly Armstrong says the state possesses the resources to respond to the shortfall — but not the infrastructure. \"We're still trying to get more guidance to figure out if there's a way we can lessen the impact.\" [Prairie Public]      Ohio   Over 1.4 million people in Ohio participate in SNAP, according to the USDA. Mike Cochran with the Mid-Ohio Food Collective said his agency has already been dealing with increased demand, serving about 5,000 families a day, 58% more than at the peak of COVID pandemic. [Ohio State News Bureau]One group who work with low-income Ohioans will be handing out boxes of macaroni and cheese and ramen noodles for families to take home at upcoming \"Trunk or Treat\" events in celebration of Halloween. [Ohio State News Bureau]U.S. Rep. Shontel Brown said she is working with fellow Rep. Emilia Sykes to create a bill that would ensure SNAP benefits are continued during any future federal government shutdowns. [Ideastream Public Media]   For more on alternative free resources in the Dayton region and how you can help neighbors experiencing food insecurity, head to WYSO.      Oklahoma   About 685,000 people in Oklahoma use SNAP to help buy groceries across the state, according to the Department of Human Services. [KOSU]Oklahoma officials encourage participants to lock their unused cards to protect against electronic theft of benefits. [KOSU]Oklahoma is one of the most food-insecure states in the nation, according to the U.S. Department of Agriculture. Tasha Mousseau, vice president of the Wichita and Affiliated Tribes, told KOSU there is existing food insecurity in rural communities and tribal nations, which intersects with the Wichita and Affiliated Tribes. Mousseau said feeding people is not only about providing sustenance but also an important part of tribal culture.    For more on how Oklahoma tribal nations are preparing to fill the gap, head to KOSU.      Oregon    Over 750,000 people in Oregon participate in SNAP, according to the USDA.     Gov. Tina Kotek announced last week that those enrolled in the program will not receive benefits after the end of the month due to the government shutdown. [OPB]In southwest Oregon's Josephine County, 1 in 5 residents participates in the SNAP program. Food pantry workers there are gearing up for longer lines, longer hours and the sudden pressure from people losing their federal food assistance. [OPB]More than 3,500 retailers statewide participate in SNAP, generating $1.50 to $1.80 in economic activity for every dollar spent, according to the Oregon State Treasury. [OPB]      Pennsylvania   Roughly 2 million people in Pennsylvania participate in SNAP, according to the USDA, nearly 472,000 of those in Philadelphia alone. The looming SNAP freeze would occur against the backdrop of the commonwealth's own budget impasse, which has stalled billions of dollars meant for schools and social services. [WHYY]Gov. Josh Shapiro is among the three Democratic governors and more than two dozen Democratic attorneys general suing the USDA over suspension of SNAP benefits.Food banks and the charitable food network \"are not designed to replace federal nutrition benefits,\" Colleen Young of the Greater Pittsburgh Community Food Bank told WESA.\"The Commonwealth cannot backfill these costs,\" Pennsylvania human services officials said in a statement announcing there would be no benefits paid in November. [WESA]   For more on alternative free resources in the Philadelphia region and how you can help neighbors experiencing food insecurity, head to WHYY. For more on alternative resources in the Greater Pittsburgh area, head to WESA.      Puerto Rico   Puerto Rico offers residents the Nutrition Assistance Program (or PAN in its Spanish acronym) in place of SNAP.  It is unclear what the government shutdown's potential impact will be on recipients of this program, but lawmakers say the well is running dry.Officials in the Puerto Rican government have provided conflicting information on how much PAN is funded for November, according to the San Juan Daily Star.      Are you worried about your SNAP benefits? NPR wants to hear your story      Rhode Island   Over 140,000 people in Rhode Island participate in SNAP according to the USDA.Gov. Dan McKee announced he is putting together a \"rapid response\" to fill the need for SNAP recipientsThe Providence Journal reports that Helena Foulkes, who is running to oust McKee in next year's Democratic gubernatorial primary, is calling for a \"state of emergency\" and for the National Guard to be called in to for logistics and food distribution assistance and to coordinate the state's \"response across state agencies, food banks, community organizations, municipalities, and federal partners.\"      South Carolina   Over 550,000 people in South Carolina participate in SNAP, according to the USDA.On Tuesday, Gov. Henry McMaster, food bank leaders and the Central Carolina Community Foundation announced the statewide funding drive. The One SC Fund has been activated for this purpose and will not use any funds from passed fundraising efforts (like Hurricane Helene relief.) [South Carolina Public Radio]Erinn Rowe, CEO of Harvest Hope, South Carolina's largest food bank, says the fast-moving pieces are a challenge for both SNAP beneficiaries and food banks. \"It's like any disaster we respond to,\" she said. \"Our goal is to make sure people have food.\" [South Carolina Public Radio]      South Dakota   Over 75,000 people in North Dakota participate in SNAP, according to the USDA.South Dakota's Department of Social Services  confirmed the potential disruption and urges recipients to prepare for possible benefits gaps, promote careful use of existing SNAP benefits and to look for food banks or pantries.       Tennessee   Roughly 700,000 people in Tennessee participate in SNAP, according to the USDA.In a statement Friday, Gov. Bill Lee told Tennessee SNAP participants to expect a lapse in benefits. The statement from the governor's office said the state could not use its own funds to support the program because it does \"not have a mechanism to load benefits onto customer cards.\"Timmeshia Fleming is a mother of three in Nashville who has used SNAP benefits off and on for years. She said interruptions and delays mean money has to go to food instead of other bills. She told WPLN, it's especially harrowing when it comes without ample warning. [WPLN]      Texas   SNAP provides food purchasing support to approximately 3.5 million Texans, including more than 1.7 million children. Those benefits amount to around $617 million per month. [KUT]According to the state's benefits website, \"SNAP benefits will not be issued if the federal government shutdown continues past Oct. 27.\"Sari Vatske, CEO of the Central Texas Food Bank, said more Texans will face food insecurity in the coming weeks if SNAP benefits are delayed, leading to greater demand at food banks. [KUT]      Utah   Over 170,000 people in Utah participate in SNAP, according to the USDA.Matt Whitaker, director of the Cache Community Food Pantry, said the pantry supplies food to roughly 1,600 families every month, and each family can visit twice a month. Whitaker said that the community tends to ramp up donations during the months leading up to the holiday season. [Utah Public Radio]Meanwhile a Heber City food pantry is already seeing an increased demand from people whose SNAP accounts are empty. [KPCW]      Vermont   If SNAP benefits run out at the end of the month, 63,000 Vermonters would lose their benefits. SNAP dollars fund the Vermont program 3SquaresVT. [Vermont Public]The Vermont Legislature passed a budget in May that set aside about $100 million to offset potential federal funding losses, but Vermont's Secretary of Human Services Jenney Samuelson told state lawmakers that the state might not be able to leverage those reserves. A contingency plan is expected to be presented to key lawmakers this week. [Vermont Public]      Virginia   Over 800,000 people in Virginia participate in SNAP, according to the USDA.On Oct. 23, Gov. Glenn Youngkin declared a state of emergency to provide hunger relief as SNAP benefits risk running out. The order allows the state to use emergency funds to support food assistance until federal funding resumes. [WHRO]Youngkin said Tuesday that backfilling the SNAP benefits will cost the state $37.5 million a week from the state surplus. Deposits will be made weekly starting Nov. 3 [WAMU]The city of Richmond recently released numbers indicating more than 54,000 people currently receive SNAP benefits, meaning more than 1 out of every 5 residents use the program. [VPM]      Virgin Islands   Over 20,000 people in the U.S. Virgin Islands participate in SNAP, according to the USDA.According to a press release from the governor's office, \"the Department of Human Services, in coordination with the Department of Finance, will issue a check to each SNAP household covering half of its November monthly allotment. Checks will be mailed to the mailing address on file for each household.\"      Washington   Nearly 900,000 people in Washington participate in SNAP, according to the USDA.Washington Attorney General Nick Brown was among the group of state attorneys general who signed a letter to the USDA asking for clarification on why reserve funds set aside for this purpose were not being used.       West Virginia   Nearly 280,000 people in West Virginia participate in SNAP, according to the USDA.Gov. Patrick Morrisey's office says West Virginia does not have the budget to cover the costs of the program. [WVPB] Food pantries in the region are already struggling to meet the needs of the community, with demand at one pantry almost doubling in a week. And Kelly Allen with the West Virginia Center on Budget & Policy, told West Virginia Public Broadcasting that local charities do not have the resources to meet the need that losing SNAP will create. [WVPB]       Wisconsin   According to the USDA, roughly 700,000 people in Wisconsin participate in FoodShare, Wisconsin's name for SNAP. In a press release Oct. 22, Gov. Tony Evers said the state's system will run out of money at the end of October. Evers encouraged people to contact their congressional representatives and ask for an end to the shutdown.   For more on alternative resources in Wisconsin, head to WUWM.       Wyoming   Roughly 30,000 people in Wyoming participate in SNAP, according to the USDA.The Wyoming Department of Family Services says it is monitoring the situation and will share information as it learns more. Recipients of SNAP benefits in Wyoming will not get those benefits starting Nov. 1       Are you worried about your SNAP benefits? NPR wants to hear your story      NPR's Jaclyn Diaz, Padma Rama, Carol Ritchie, Emily Alfin Johnson, Kristian Monroe and Jennifer Ludden edited this piece.\n\n\n   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNAP runs out of money Nov. 1. States are now figuring out how to feed millions of people",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+77/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F69%2F1c9cb034456cb4e3aab6e90cc907%2F251021-food-for-fed-workers-wamu-08.JPG"
      ],
      "datePublished": "2025-10-28T18:46:17.000Z",
      "dateModified": "2025-10-28T18:46:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]