[
  {
    "title": "Listen to NPR live coverage of the State of the Union",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5716161/trump-state-of-the-union-listen",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3200x1800+0+0/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2F69%2F8e28d7164465bf48786fb592a31a%2Flisten-live-npr.png",
    "tag": "Politics",
    "date": "2026-02-24T20:22:23.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        NPR\n    \n\n   \n   President Trump will give his State of t",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        NPR\n    \n\n   \n   President Trump will give his State of the Union address Tuesday night to highlight accomplishments and outline his vision and priorities for his administration's second year. NPR's live special coverage — which will also include the Democratic response to the speech — starts at 9 p.m. ET / 6 p.m. PT.   Here are ways to listen to NPR's live coverage:    Click the audio button above.Tune in on many public radio stations or listen in the NPR app.You can also tell your Alexa device to \"Ask NPR to play Special Coverage\" starting at 9 p.m. ET.Don't miss NPR's analysis of the night on the NPR Politics Podcast.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Listen to NPR live coverage of the State of the Union",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3200x1800+0+0/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fab%2F69%2F8e28d7164465bf48786fb592a31a%2Flisten-live-npr.png"
      ],
      "datePublished": "2026-02-24T20:22:23.000Z",
      "dateModified": "2026-02-24T20:22:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump set to deliver first State of the Union address of his second term",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5716163/trump-congress-state-union",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5849x3290+0+304/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F66%2F8a%2Fd756e7fa48a5b530531975c408f4%2Fgettyimages-2203349290.jpg",
    "tag": "Politics",
    "date": "2026-02-24T23:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump addresses a joint sessio",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump addresses a joint session of Congress at the U.S. Capitol on March 4, 2025.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   An embattled President Trump will deliver his State of the Union on Tuesday night, telling Americans a story of a successful presidency, even as many have grown skeptical of his agenda.   \n   The speech comes as the president faces negative approval ratings, including on immigration, the topic that twice helped propel him to the White House. It also comes just days after the Supreme Court delivered a blow to his tariff policy and weeks after federal agents the administration sent into Minneapolis shot and killed two U.S. citizens.   Amid those challenges, Trump will be celebrating his achievements, paying particular attention to the economy.   Watch the address live starting at 9 p.m. ET/6 p.m. PT:   \n   \"The president is, of course, going to tout his administration's record-setting accomplishments over the past year while laying out an ambitious agenda to continue making the American dream more attainable and affordable for working-class people across the country,\" press secretary Karoline Leavitt told Fox News on Tuesday morning.   She added that Trump will be \"making a few new policy announcements as well,\" aimed at the topic of affordability. The White House has told reporters, including NPR, that one proposal will be \"ratepayer protection pledges.\" These would require tech companies building data centers, which use massive amounts of energy, to pay more for electricity to mitigate price spikes for the communities where those centers are built.   The president, for his part, has promised the speech will be lengthy.   \"It's going to be a long speech because we have so much to talk about,\" he said at a Monday White House event honoring families of those killed by people in the country without legal status.   \n   As Tuesday night's speech approaches, more than half the country — 55% — thinks Trump is changing the nation \"for the worse,\" according to the latest NPR/PBS News/Marist poll. That's a marked increase from around this point in his first presidency, when 42% of Americans believed the same.   Recent polls also show the president has a deeply negative approval rating, including negative numbers on immigration and the economy. Those numbers are highly partisan — Republicans still overwhelmingly approve of the president, while Democrats overwhelmingly disapprove. Multiple polls show that a majority of independents disapprove of the job Trump is doing.   On economic issues, Trump has been making the case to Americans for months — especially since Democratic wins in November's elections — that he is working to ease the cost of living.   \n   However, at the same time, he has remained committed to his tariff policy, saying he will impose new ones after the Supreme Court last week declared many of his tariffs unlawful. Tariffs have increased prices for businesses and consumers, and a majority of Americans disapprove of his tariff increases, according to a recent Pew Research Center poll.   Leavitt said Trump has chosen guests to emphasize his economic programs, including a couple who has benefited from the One Big Beautiful Bill Act passed last year, which allows workers to deduct income from tips and overtime from their annual incomes.   \n   Trump will also be leaning into the administration's ongoing message that former President Joe Biden is to blame for any current cost-of-living problems — Leavitt told Fox that Trump's new policies will address \"the affordability crisis that Joe Biden created.\" However, more than one year into Trump's second term, this raises the question of how long the administration can blame economic problems on Biden.   \n   In addition to everyday Americans, Trump has invited the U.S. men's Olympic hockey team, which just days ago won the gold medal in the Winter Olympics.   Meanwhile, Democratic members of Congress are approaching the speech in different ways. Some will not be attending, in protest against the president, while others are bringing survivors of abuse at the hands of sex offender Jeffrey Epstein and his associates. An NPR investigation has found that in its release of Epstein investigation materials, the administration has removed documents related to allegations that Trump sexually abused a minor.      Follow for more coverage:📧 NPR Politics newsletter: Breaking down the big stories and why they matter🎧 The NPR Politics Podcast: Our experts provide insights into what's happening   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump set to deliver first State of the Union address of his second term",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5849x3290+0+304/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F66%2F8a%2Fd756e7fa48a5b530531975c408f4%2Fgettyimages-2203349290.jpg"
      ],
      "datePublished": "2026-02-24T23:00:00.000Z",
      "dateModified": "2026-02-24T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Democrats to investigate DOJ's handling of missing Epstein files related to Trump",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5724926/house-democrats-to-investigate-dojs-handling-of-missing-epstein-files-related-to-trump",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-24T21:09:08.000Z",
    "description": "\n      \n      House Democrats to investigate DOJ's handling of missing Epstein files related to Trump\n    \n        \n                Download\n         ",
    "body": "\n      \n      House Democrats to investigate DOJ's handling of missing Epstein files related to Trump\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5724926/nx-s1-9661900\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      An NPR investigation has found that the public database of Epstein files is missing dozens of pages related to sexual abuse accusations against President Trump.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Democrats to investigate DOJ's handling of missing Epstein files related to Trump",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-24T21:09:08.000Z",
      "dateModified": "2026-02-24T21:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump set to deliver State of the Union address amid economic and diplomatic tensions",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5723917/trump-set-to-deliver-state-of-the-union-address-amid-economic-and-diplomatic-tensions",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-24T12:09:05.000Z",
    "description": "\n      President Trump is set to deliver his first State of the Union address of his second term, as he faces a host of key issues from tariffs to Ira",
    "body": "\n      President Trump is set to deliver his first State of the Union address of his second term, as he faces a host of key issues from tariffs to Iran.   \n\n    STEVE INSKEEP, HOST:  President Trump speaks to Congress and the country tonight.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: It's going to be a long speech because I have - we have so much to talk about.LEILA FADEL, HOST:  The State of the Union address is any president's annual opportunity to set the national agenda or reset the agenda when it's not going well. Many Americans don't feel good about the state of the union. An NPR survey out this week finds that 60% of those responding - 6 out of 10 - say the country is worse off than a year ago. In a few moments, we'll discuss all this with a Republican analyst and speechwriter. First, let's preview the speech.INSKEEP: NPR White House correspondent Franco Ordoñez has an assessment. Franco, good morning.FRANCO ORDOÑEZ, BYLINE: Good morning, Steve.INSKEEP: What do you know about the president's approach?ORDOÑEZ: Well, I expect his team is finishing a speech that tries to do that - push the reset button - a speech that not only touts his accomplishments but sets the stage for the upcoming midterms, you know, focusing on how the administration plans to really tackle costs for everyday Americans. But I spoke with Ashley Koning, a pollster from Rutgers University, who told me that the administration faces an uphill battle.ASHLEY KONING: There is so much on the table right now with the president going into this speech between whether we're talking about the partial shutdown, the economy, immigration or Iran, and then clearly him seeing his worst poll numbers right now during his second term.ORDOÑEZ: You know, and the thing is, Steve, you really don't know what Trump is going to say. And the reality here is the president says a lot of things in public, but he hasn't really explained some of the policies in a way at least that many Americans would approve. So he has this opportunity to clarify those plans tonight.INSKEEP: Well, as you're saying that, I'm thinking he's talking to the nation right after the Supreme Court found his tariffs were illegal.ORDOÑEZ: Yeah. I mean, a huge blow to his agenda and a great example to what we're talking about. Trump's promising new tariffs under a different law, which really has some Republicans concerned because of the associated higher costs. Jon McHenry, a veteran Republican strategist, told me that Trump could take this moment to give his reasons for a policy many Americans don't agree with.JON MCHENRY: He has an opportunity to say, this is why I think these tariffs are important, and we are going to handle it in this manner because I'm trying to preserve manufacturing jobs, because I'm trying to preserve farming jobs, rather than just saying, I can't believe these people are against me. What losers and RINOs they are.INSKEEP: Got to note, when the court first ruled, the president took the latter course, Franco. He called the justices, quote, \"unpatriotic and disloyal,\" even though he appointed some of them.ORDOÑEZ: Yeah. And just think about this, Steve. Those justices are going to be in the room with Trump. And as always the case with this president, the optics are going to be a big part of the evening. So when Trump sees those justices, you know, walking in in their black robes, you know, is he going to be able to resist attacking them personally, as he did so aggressively last week?INSKEEP: So we'll watch for that and also watching this - what approach can the president take to the possible war against Iran?ORDOÑEZ: Yeah. I think a similar one. I mean, right now, there's a real concern, especially from his own party, that the U.S. can be dragged into a long-term conflict, you know, the kind of conflict Trump himself pledged to avoid. Again, Trump has not made the public case for why strikes may be necessary, as presidents have in the past. And this could be an opportunity for Trump to do that, to explain his reasoning. And if he does, at least people will have understood why he made that decision. But that's obviously not Trump's MO.INSKEEP: NPR White House correspondent Franco Ordoñez. Thanks for your insights, as always.ORDOÑEZ: Thanks, Steve.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump set to deliver State of the Union address amid economic and diplomatic tensions",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-24T12:09:05.000Z",
      "dateModified": "2026-02-24T12:09:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who will — and won't — be guests at the State of the Union address",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5723955/trump-congress-state-union-guests",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fad%2F23%2Fccd85a934fbda44bee41a794a402%2Fgettyimages-2261490350.jpg",
    "tag": "Politics",
    "date": "2026-02-25T00:24:06.000Z",
    "description": " Who’s on tonight’s State of the Union guest list?   Invitees at Tuesday night's address by President Trump include the gold-medalist men's U.S. hocke",
    "body": " Who’s on tonight’s State of the Union guest list?   Invitees at Tuesday night's address by President Trump include the gold-medalist men's U.S. hockey team, while Democratic lawmakers have invited several Epstein survivors.\n\n    \n        Politics\n    \n\n\n                  \n            February 24, 20267:24 PM ET\n\n      \n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump is seen during a visit to the Fort Bragg U.S. Army base earlier this month in Fort Bragg, N.C.\n                \n                    Nathan Howard/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nathan Howard/Getty Images\n    \n\n   \n   President Trump's guests for his State of the Union address on Tuesday night include a Virginia teen at the center of a legal case involving parental rights and schooling, the U.S. men's hockey team and Erika Kirk, the widow of activist Charlie Kirk.   While the White House kept Trump's full guest list under wraps for now, presidents traditionally extend invites to people who align with issues they support. First lady Melania Trump has picked her own attendees to highlight her platforms on AI education and foster care.   Republican House Speaker Mike Johnson, R-La., has invited the daughter of a Uyghur doctor who went missing in 2018. Several Democratic lawmakers are bringing survivors of alleged sexual abuse by Jeffrey Epstein.   \n   Traditionally, lawmakers from both sides of the aisle attend the address. However, this year at least five Democratic senators and 14 members of the House are choosing to skip over their opposition to Trump's agenda, and planning to attend an alternate event staged by MoveOn.org called \"The People's State of the Union.\"   Here's who will, and won't, be there.   Who's coming   Among Trump's guests is Saige Blair. Blair is at the center of a lawsuit involving allegations that Virginia school officials made decisions about Blair's well-being and gender identity without informing the then-14-year-old's parents. Erika Kirk will be there. She's the widow of Charlie Kirk and the new CEO and board chair of Turning Point USA, her late husband's right-wing youth organization. White House Press Secretary Karoline Leavitt said that, with Kirk in the chamber, Trump \"will call on Congress to 'firmly reject political violence against our fellow citizens.'\" Kirk was named to succeed her husband as CEO after he was assassinated in September.First lady Melania Trump is bringing Sierra Burns, a participant in the Melania Trump Foster Youth to Independence Program, and Everest Nevraumont, a 10-year-old public speaker and advocate of artificial intelligence education. \"Sierra and Everest embody my ongoing mission to uplift America's foster youth and expand opportunity for our next generation through education and technology,\" the first lady said. House Speaker Mike Johnson is bringing Ziba Murat. Murat is the daughter of Gulshan Abbas, a retired medical doctor who went missing in China in 2018, after her sister criticized the Chinese government's treatment of Uyghur people, the United States Commission on International Religious Freedom says.The U.S. men's hockey team, which brought home the gold medal after defeating Canada at this year's Winter Olympics, is expected to attend, House Speaker Johnson told CBS News.Democratic California Rep. Mark Takano will be attending with George Retes. Retes is a U.S. citizen who was on his way to work in Ventura, Calif., in July, when he said federal immigration agents pepper sprayed him, pulled him out of his car and detained him for three days with no explanation and no judicial hearing.Republican Rep. Pete Stauber of Minnesota is bringing conservative Youtuber Nick Shirley, according to The Minnesota Star Tribune. \"Nick played a significant role in showing the nation the crisis level of fraud and corruption happening in our own state government that's cost taxpayers $9 billion,\" Stauber said on X. Democratic Rep. Suhas Subramanyam of Virginia has invited the brother and sister-in-law of Virginia Roberts Giuffre, one of the most visible victims of abuse by late financier Jeffrey Epstein. Other Epstein survivors were also invited: Jess Michaels was invited by Rep. James Walkinshaw, D-Va., and Rep. Ro Khanna, D-Calif., invited Haley Robson.    \n   Who's not coming   The U.S. women's Olympic hockey team, also fresh off its Olympic gold-medal win, has reportedly declined President Trump's invitation due to scheduling conflicts. \"We are sincerely grateful for the invitation … and deeply appreciate the recognition of their extraordinary achievement,\" a USA Hockey spokesperson said, according to NBC News.    Democratic Sen. Chris Van Hollen, of Maryland, said he won't be at the State of the Union. His name appears on the flier for The People's State of the Union. \"Trump is marching America towards fascism, and I refuse to normalize his shredding of our Constitution & democracy,\" he said last week.Democratic Sen. Ed Markey of Massachusetts said in a statement he's also going to the alternative event. Democratic Sen. Adam Schiff of California said in a video that, for the first time, he's not attending the State of the Union. He said he'll be outside the Capitol at The People's State of the Union. \"I will not give him the audience he craves for the lies that he tells,\" he said. Democratic Rep. Ayanna Pressley of Massachusetts said she's missing the traditional address to attend the alternative event because she refuses \"to sit and listen to that man spew lies and hate.\"Other politicians expected to attend The People's State of the Union include Sens. Ruben Gallego, Tina Smith and Jeff Merkley; as well as House Reps. Yassamin Ansari, Becca Balint, Greg Casar, Teresa Leger Fernandez, Maxwell Frost, Robert Garcia, Jim Himes, Sara Jacobs, Pramila Jayapal, John Larson, Sydney Kamlager-Dove, Summer Lee, Chellie Pingree, Emily Randall, Mary Gay Scanlon, Delia Ramirez and Bonnie Watson Coleman, according to the event's organizers.   \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who will — and won't — be guests at the State of the Union address",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fad%2F23%2Fccd85a934fbda44bee41a794a402%2Fgettyimages-2261490350.jpg"
      ],
      "datePublished": "2026-02-25T00:24:06.000Z",
      "dateModified": "2026-02-25T00:24:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Read NPR's annotated fact check of President Trump's State of the Union",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5716277/trump-state-union-fact-check",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4668x2626+0+160/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2F76%2F645b974240c9af3c1077a909519a%2Fgettyimages-2202767925-2.jpg",
    "tag": "Politics",
    "date": "2026-02-24T23:06:41.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump gestures as he addresses",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump gestures as he addresses a joint session of Congress at the U.S. Capitol on March 4, 2025.\n                \n                    Mandel Ngan/Pool/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mandel Ngan/Pool/Getty Images\n    \n\n   \n   Stay up to date with our Politics newsletter, sent weekly.      President Trump is set to deliver the first official State of the Union address of his second term on Tuesday night. The speech, which is set to start at 9 p.m. ET, gives Trump the opportunity to tout accomplishments and outline his agenda for his administration's second year.    \n   It comes at at time when Americans are divided on whether Trump's first year has been a success. A new NPR/PBS News/Marist poll shows that six in 10 believe the country is worse off than last year and that a majority think the state of the union is not strong.   Reporters from across NPR's newsroom will fact check his speech and offer context — on topics like immigration, the economy, tariffs and trade and foreign policy.    Follow along here as the speech — which he teased is likely to be long — unfolds tonight.    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Read NPR's annotated fact check of President Trump's State of the Union",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4668x2626+0+160/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2F76%2F645b974240c9af3c1077a909519a%2Fgettyimages-2202767925-2.jpg"
      ],
      "datePublished": "2026-02-24T23:06:41.000Z",
      "dateModified": "2026-02-24T23:06:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Podcaster Michael Knowles to Trump: Remind people you 'represent normal'",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5724910/podcaster-michael-knowles-to-trump-remind-people-you-represent-normal",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-24T21:50:05.000Z",
    "description": "\n      \n      Podcaster Michael Knowles to Trump: Remind people you 'represent normal'\n    \n        \n                Download\n                \n       ",
    "body": "\n      \n      Podcaster Michael Knowles to Trump: Remind people you 'represent normal'\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5724910/nx-s1-9662038\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Mary Louise Kelly talks with conservative podcaster Michael Knowles, host of The Michael Knowles Show, about what he hopes to hear from President Trump tonight in the State of the Union.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Podcaster Michael Knowles to Trump: Remind people you 'represent normal'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-24T21:50:05.000Z",
      "dateModified": "2026-02-24T21:50:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GOP strategist on what he thinks Trump should focus on in State of the Union address",
    "url": "https://www.npr.org/2026/02/24/nx-s1-5723882/gop-strategist-on-what-he-thinks-trump-should-focus-on-in-state-of-the-union-address",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-24T12:08:57.000Z",
    "description": "\n      NPR's Leila Fadel speaks with GOP analyst and speechwriter Mike Ricci about Tuesday night's State of the Union address, and how the norms surro",
    "body": "\n      NPR's Leila Fadel speaks with GOP analyst and speechwriter Mike Ricci about Tuesday night's State of the Union address, and how the norms surrounding the speech have changed.   \n\n    LEILA FADEL, HOST:  Republican strategist Mike Ricci is with us now. He was a speechwriter for two former Republican House speakers - John Boehner and Paul Ryan. And who better to talk about the possible impact of the State of the Union address tonight than a speechwriter? Mike, good morning, and welcome back to the program.MIKE RICCI: Leila, great to be with you.FADEL: So how high are the stakes as the president goes into his speech with all that's going on, from tariffs to immigration to possible conflict with Iran?RICCI: It is, in my view, the most momentous speech he's given as president because the things that he has so personally identified with that you just mentioned - tariffs is his policy. He's been sitting at the Resolute desk adjusting these tariffs personally for the last year, seeking peace, making himself - you know, casting himself as the peace president on the eve of potential war with Iran. Immigration. These are not just policies of his party. These are things that he has so personally tied to himself and his legacy. So his ability to land those things tonight, especially with the Republicans in the chamber, at such a perilous moment, it really does raise the stakes for sure.FADEL: You know, we just heard some of the concerns voters have going into tonight's State of the Union address, including about the economy, immigration.RICCI: Yeah.FADEL: And two of those voters voted for Trump. Do you anticipate President Trump will use his State of the Union address to soothe worries like theirs tonight?RICCI: In a 51-49 country, it's hard to see, especially with this president, a, you know, 60-40, 70-30 speech that tries to speak to a broad swath of the country. I think it will try to get - again, get the Republicans in the chamber energized, get the base energized, especially if he goes into things like voter ID that have been in the news in recent weeks. I do think he will certainly try to, you know, as we say, hit a reset button. But I don't expect it to be, you know, a bigger picture, try to reach out broadly to independents kind of speech. That's just not been the White House's MO from the beginning.FADEL: So are you saying you don't expect, like, a unifying speech?RICCI: Well, I think the thing is, Leila, like, the backdrop is unifying, right? You have the 250th anniversary of the country. You're just coming off the Olympics. So you can certainly see a vision of the speech where it's about peace and prosperity and American greatness and our history. So you could hear some of the language of unity, but will it feel unifying, especially with Democrats in the chamber protesting and walking out? It's just harder to see that because the president always in these situations wants to create moments, as every president does. And those moments may not be as unifying, but there certainly is no shortage of material around which to build those themes. Absolutely.FADEL: Now, Trump is known for going off message during speeches, right? What would you...RICCI: Right.FADEL: ...Advise him to focus on tonight to win over persuadable voters? I mean, his...RICCI: Right.FADEL: ...Poll numbers are slipping as he goes into this address.RICCI: Well, I think his team is probably trying to sell him on, you know, these are the things that you need to land. Speak to the country in the second person. I'm fighting for you. I want to see a - you know, portray it. I want a level playing field for you after decades and decades of being taken advantage of. I want peace for your family. I want safer streets for you. There's certainly those moments. And, you know, you obviously go in expecting that he'll go off script, and who - you know, who knows what'll happen? But you're certainly trying to sell him on, you know, think about how people will receive - how well they'll receive this, how much it'll, you know, make Democrats' heads explode. You know, you're not so much trying to sell him on the words and the announcements as you are kind of the headline moments, the big picture. But, you know, definitely, obviously, trying to connect with the country and, again, tying it to all these, you know, patriotic themes going on around us.FADEL: The November midterms are just over eight months away. How does a State of the Union speech in February factor into election outcomes?RICCI: From a party perspective, it is an opportunity to try to road test some themes, especially if he gets into trying to reclaim health care as an issue, especially tying it to affordability. There's a lot of concern that this midterm will become, especially locally, more and more about data centers and AI. So maybe an opportunity to make some news and on an issue that Americans are not paying attention to maybe as broadly. So you're certainly trying to - and, you know, there's polls that the White House is probably working off of and focus groups. So you might see in there some kernels of things they're road testing, trying to sell their candidates on. But I think that when you see those laundry lists of economic proposals, I think that's where you start to see, you know, are these things that we can build a midterm campaign around and make a contrast with the Democrats in the chamber? And that's another huge important piece here.FADEL: Republican strategist and speechwriter Mike Ricci. Thank you so much for your time and your insights.RICCI: Thank you, Leila.(SOUNDBITE OF COASTAL SONG, \"NORTHERN\")\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GOP strategist on what he thinks Trump should focus on in State of the Union address",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-24T12:08:57.000Z",
      "dateModified": "2026-02-24T12:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]