[
  {
    "title": "Trump says 'we are going to run the country now' after removing Venezuela's president",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665677/trump-says-we-are-going-to-run-the-country-now-after-removing-venezuelas-president",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2026-01-03T17:45:43.000Z",
    "description": "Trump says 'we are going to run the country now' after removing Venezuela's president   \n\n\n         \n    \n        Politics\n    \n\n\n      \n             ",
    "body": "Trump says 'we are going to run the country now' after removing Venezuela's president   \n\n\n         \n    \n        Politics\n    \n\n\n      \n                  \n            January 3, 202612:45 PM ET\n\n      \n\n\n      \n      President Trump announces U.S. will run Venezuela after capture of President Maduro\n   \n            \n                \n                    \n                    \n                        \n                            Listen\n                        \n                        \n                            · \n                            9:19\n                        \n                    \n                \n            \n                  9:19\n        \n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5665677/nx-s1-9594233\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n\n   \n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'we are going to run the country now' after removing Venezuela's president",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2026-01-03T17:45:43.000Z",
      "dateModified": "2026-01-03T17:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. operation in Venezuela raises questions about congressional oversight",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665666/u-s-operation-in-venezuela-raises-questions-about-congressional-oversight",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2026-01-03T18:05:34.000Z",
    "description": "\n      NPR's Daniel Estrin discusses with Democratic Sen. Jeanne Shaheen.   \n\n    DANIEL ESTRIN, HOST:  Before last night's dramatic operations in Ven",
    "body": "\n      NPR's Daniel Estrin discusses with Democratic Sen. Jeanne Shaheen.   \n\n    DANIEL ESTRIN, HOST:  Before last night's dramatic operations in Venezuela, which saw U.S. forces capturing the country's president, Nicolas Maduro, and his wife, President Trump, as well as members of his cabinet, downplayed talk of regime change. However, that very possibility dominated the conversation, and for months, U.S. operations against Venezuela have been escalating without any congressional oversight.Senator Jeanne Shaheen is a ranking member of the Senate Foreign Relations Committee and a senior member of the Senate Armed Services Committee. She's a Democrat representing New Hampshire, and she joins us now. Good afternoon, Senator.JEANNE SHAHEEN: Good afternoon.ESTRIN: We've seen reports of some lawmakers being briefed on the overnight attack in Venezuela. We also heard the president say this morning that he was worried about Congress leaking it. The question is, were you briefed? And if so, were you informed of the plans?SHAHEEN: I was not informed. And my understanding is that no one else was informed in advance, either, both Republican and Democrat. And worse than that, what we have heard from the administration in response to direct questions from both Republicans and Democrats for months has been that their intent was not regime change. Now, of course, those of us who were watching the region understood that there had to be some reason for putting 15,000 U.S. troops in the Caribbean region and all of the firepower that we were bringing to that region. But the fact that they not only refused to brief Congress, but also did not tell us the truth about what the intentions were, and what the president and others acknowledged in this press conference was that they've been planning this operation for months.And there's no doubt that the military behaved brilliantly, but now they're talking about nation-building. And the president's press conference raised more questions than it answered because he said that the United States is going to run the country of Venezuela, but what we're hearing from the vice president, who he claims has been sworn in now as president, what we're hearing from the finance minister, what we're hearing from other quarters, is that there's going to be a battle for control of Venezuela. And there's no guarantee who's going to wind up in control there or to what extent the drug cartels are still going to have a role.ESTRIN: And since the attack this morning, have you or your colleagues been informed by U.S. officials on what's next?SHAHEEN: No. No. And again, the president was not at all clear in his press conference, as he has not been for months, about what the real goal is in Venezuela. He talked about the effort to prohibit drugs from coming into the United States, which I think all Americans support. But what they have done, while it's addressed drugs coming in by boat from Venezuela, hasn't addressed drugs coming in from other areas. And he also talked about oil, the need to get back oil for the United States. He talked about the activities from criminals who are - were being pushed into the United States by Maduro. But these are all contradictory statements, and he's still not clear about what the real motive here is in Venezuela and the threat that the country posed to the United States.ESTRIN: You know, the president also spoke about sending U.S. oil companies to Venezuela. Was that ever discussed? Because it seemed off the stated mission of fighting drug traffickers and restoring democracy.SHAHEEN: I have not had any conversations with anyone in the oil industry about what they might be willing to invest in Venezuela. And again, just as with nation-building, we have a very mixed record in terms of restoring the oil industry. That was the explanation for why the war in Iraq wasn't going to cost us anything, because they had such oil reserves, and we know that that didn't turn out to be true. So whether - the extent to which the United States is going to be able to take over the oil reserves of Venezuela, I think, still is not clear. And what we're seeing already is our adversaries coming to the defense of Maduro and Venezuela, and our allies not taking a firm stand on what the president is doing. So I don't think this has contributed to America's national security interests. And what we're seeing is Russia and China talking about continuing to support the interests in Venezuela that they've been supporting for years now.ESTRIN: Senator, Congress has been frankly unable to stop President Trump in the last several months from all of the military action that's been taken against Venezuela, from the deadly strikes on boats to now regime change. Do you think there will now be enough buy-in among your colleagues for a War Powers Resolution?SHAHEEN: Well, I think that remains to be seen. I hope that my colleagues on both sides of the aisle will raise questions about what's really going on here in Venezuela and why we're - you know, this is a president who said he was for America first, and yet what he's talking about is potentially another land war in Latin America. So I think - hopefully we will see...ESTRIN: OK.SHAHEEN: ...People be willing to question the president.ESTRIN: Senator Jeanne Shaheen, thank you so much.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. operation in Venezuela raises questions about congressional oversight",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2026-01-03T18:05:34.000Z",
      "dateModified": "2026-01-03T18:05:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democratic Sen. Tim Kaine on legal questions surrounding the Venezuela attack",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665638/democratic-sen-tim-kaine-on-legal-questions-surrounding-the-venezuela-attack",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2026-01-03T15:27:35.000Z",
    "description": "\n      \n      Democratic Sen. Tim Kaine on legal questions surrounding the Venezuela attack\n    \n            \n                \n                Transcr",
    "body": "\n      \n      Democratic Sen. Tim Kaine on legal questions surrounding the Venezuela attack\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5665638/nx-s1-9594133\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Kaine is among the lawmakers who have been critical of the Trump administration's stance toward Venezuela.   \n\n    DANIEL ESTRIN, HOST:  We have been following the extraordinary news out of Venezuela this morning. Overnight, U.S. forces targeted the country, capturing its president, Nicolás Maduro, and his wife. Some U.S. lawmakers have been criticizing the Trump administration's stance on Venezuela. Among them is Senator Tim Kaine. The Virginia Democrat is the ranking member of the Senate Foreign Relations Subcommittee on the Western Hemisphere. He's a member of the Senate Armed Services Committee as well, and he joins us now. Good morning, Senator.TIM KAINE: Daniel, good to be with you.ESTRIN: You were among the lawmakers who said the Trump administration's strikes on boats in the Caribbean were illegal. You were even discussing the possibility of those strikes constituting a war crime. So how do you see last night's operations?KAINE: Daniel, I think these strikes are clearly illegal. They have not been authorized by Congress, and the Constitution is clear that the U.S. doesn't engage in military action or war without a vote of Congress, except in cases of imminent self-defense. The Constitution is absolutely clear on that. And so the boat strikes in international waters are illegal. Murdering shipwrecked sailors clinging to wreckage in those waters is illegal. And a U.S. invasion of Venezuela to depose its president and arrest him is illegal. And I have a vote scheduled in the next few days when we get back to Congress on Monday to put all senators on the record as to whether we should be at war with Venezuela without a vote of Congress.ESTRIN: Senator, many Venezuelans do not support Maduro. Do you see anything positive from this development?KAINE: Maduro is a disaster, and he's been disastrous for the country. And we could say the same thing about a hundred and fifty leaders of countries around the world. But our Constitution is very, very clear that we don't order servicemen and women into harm's way, risking their lives, unless there is a congressional debate and vote about whether the war is in the national interest. Here, there was no real notification, no real Consultation, no real debate, and definitely not a vote. The president believes he can wage war on his own. And in the last weeks, you've seen him use the U.S. military to ostensibly protect Christians in Nigeria and threaten to use the U.S. military to protect Iranian protesters. He's threatened U.S. military force or suggested he's open to it to seize Panama, to seize Greenland. It's time for Congress to get off the couch and exercise the oversight over this president's desire to wage war on his own.ESTRIN: What do you think President Trump is actually getting at with this operation?KAINE: It's unclear because the president started these operations in international waters, saying it was about narco-trafficking. But now both he and other administration officials have said, we want our oil back, we want our assets back and we also want to change regimes. The U.S. has tried to stand for the proposition that the sovereignty of nations should be respected. That's why we've criticized Russia for its invasion of Ukraine. But we can't, with a straight face, make the argument that we support the sovereignty of nations if we're willing to engage in a unilateral presidentially declared war against Venezuela. And thus, he is really undercutting U.S.' moral and - stance for an international rule of law where nations can invade each other willy-nilly, just because a president decides it's a good idea to do so.ESTRIN: President Trump noted that there were some injuries on the U.S. side in the operation. He said they weren't serious. How do you see the U.S. getting involved in potentially a more protracted conflict in Venezuela, especially U.S. forces, with government troops or even non-state actors like drug cartels?KAINE: It's very troubling. I mean, use - to use an example, the U.S. invaded the tiny island nation of Grenada in the 1980s, and U.S. troops were killed in that invasion, and innocent civilians, folks who were patients in a mental hospital, were mistakenly bombed. Wars have consequences. So, yes, the U.S. troops who have been deployed by this president - and they always serve honorably when they're ordered to do so - in my view, this is an illegal war. They are at risk, and some were injured. We don't know the extent of the injuries. Obviously, we are hoping that they're minor. There's no such thing as a war without a human consequence, and that's why it ought to be debated and voted before we wage into it.ESTRIN: That's Senator Tim Kaine, Democrat of Virginia, calling the U.S. strikes in Venezuela an illegal war. Senator, thank you for speaking with us.KAINE: Absolutely.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democratic Sen. Tim Kaine on legal questions surrounding the Venezuela attack",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2026-01-03T15:27:35.000Z",
      "dateModified": "2026-01-03T15:27:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Joaquin Castro on Venezuela strikes, Trump's claim Maduro 'captured'",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665607/rep-joaquin-castro-on-venezuela-strikes-trumps-claim-maduro-captured",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2026-01-03T14:14:58.000Z",
    "description": "\n      The Democrat was among the lawmakers who in December introduced a War Powers Resolution to block President Trump from escalating operations in ",
    "body": "\n      The Democrat was among the lawmakers who in December introduced a War Powers Resolution to block President Trump from escalating operations in Venezuela. The House rejected the measure.   \n\n    DANIEL ESTRIN, HOST:  We turn now to Representative Joaquin Castro. He's a Democrat from Texas. Congressman, good morning.JOAQUIN CASTRO: Good morning. Good to be with you.ESTRIN: Thanks for being here. You are the ranking member of the House Foreign Affairs subcommittee on the Western Hemisphere. Were you informed of this operation in Venezuela, or were you involved in the planning of it?CASTRO: We got no notice at all from the White House or from anyone, which is remarkable because during the briefing that Secretary Rubio and others gave to us in the last week that we were in session before the Christmas break, he said that they would come before Congress to get an AUMF, an authorization for use of military force, for anything that required it. And at the time, we were - they were talking about a land invasion, which this clearly is. So the administration did this without coming before Congress, without allowing Congress to weigh in, and more than that, without notifying the whole Congress and even a big part of the folks on the Foreign Affairs Committee and on the intelligence committee, which is the other committee that I sit on.ESTRIN: OK, wow. So you were not informed. You were among the lawmakers who introduced a war powers resolution in December to block President Trump from escalating operations in Venezuela. That was rejected by the House. Were you expecting at all this kind of land operation?CASTRO: Well, we were concerned about that, and for years Congress has been on the sidelines of being part of decisions like this, and I believe that the American people send us to Washington to be part of big decisions like this for the country. And, you know, we've got to put this in some context here. The United States, for decades, had a history in Latin America of backing coups and regime change that destabilized many governments there. And I'm glad that there were no American service members that were hurt, that there were no American casualties. And Maduro was not a good guy to his people, but this is a case of regime change, and it hearkens back to the way that America operated in decades past. And what we could see is destabilization in the area in Venezuela in particular.Remember, this is a country where you've already had, over the last 20 years, millions of people flee the country. And there'll be a power vacuum. So we don't know exactly how this is going to turn out, whether you're going to get somebody better in that position than Nicolás Maduro or not at this point, or whether Donald Trump is going to install a leader that he likes. And the problem there is that Donald Trump and his administration and his family, quite honestly, have done and are doing a lot of things around the world for personal profit, in this case, oil and minerals, perhaps, and not in the best interests of the American people.ESTRIN: How do you think about how the U.S. might proceed with other potential conflicts now? I'm thinking of Iran, which President Trump threatened this week with more bombing.CASTRO: Well, I think that a lot of people are finding it very ironic and even hypocritical that this - as a candidate, Donald Trump pitched himself as a peace president, and now he's entering conflicts around the world and really destabilizing, at least in this case, Venezuela, I can't imagine, is not going to be destabilized, and just getting us involved in more wars around the world.ESTRIN: As you mentioned, Maduro has been a bad person to his people, as you said earlier. He's been criticized by rights groups for crackdowns. Many people in Venezuela are suffering. Are you concerned that this kind of regime change might have the opposite impact in Venezuela in terms of regional stability?CASTRO: Absolutely. Look, I wish the best for the Venezuelan people. I've said all along that the people of Venezuela, just like the people of the United States and our country, should be the ones to determine who their next leader is. But there's a real chance here that what appears to be a good thing, getting a guy who's acted like a dictator out of there, it could turn into a bad thing. I hope that's not the case, but again, there's a power vacuum here. This is a case of regime change. You're probably going to have an element in Venezuela, obviously, that's very upset about the United States or any country coming in there and doing it like this. And history has shown that there often and within nations, especially once the United States, if we're not going to have any role at all, then when there's no - there are no forces keeping peace, they usually start to fight with each other, and I think that's what you could see here.ESTRIN: Briefly, Congressman, how do you think this latest development in Venezuela - how might it change America's strategic priorities around the world?CASTRO: Well, I mean, I think that it's not going to gain us many friends. I think it's going to cost us friends because the world sees it as you went in there and you did regime change and you overthrew the leader of a country. And, you know, I think that in that region especially, more countries will run to the arms of Russia and China. Those leaders - they don't want to suffer the same fate.ESTRIN: We'll leave it there. That's Joaquin Castro. He represents Texas in the U.S. House. Congressman, thank you so much for speaking with us this morning.CASTRO: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Joaquin Castro on Venezuela strikes, Trump's claim Maduro 'captured'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2026-01-03T14:14:58.000Z",
      "dateModified": "2026-01-03T14:14:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is María Corina Machado, Venezuela's Nobel Peace Prize winning opposition leader?",
    "url": "https://www.npr.org/2026/01/03/g-s1-104412/venezuela-nicolas-maduro-maria-corina-machado-opposition",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8119x4567+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2F49%2F7cd293f1446f94bc91b2f138f989%2Fap25345338366448.jpg",
    "tag": "Politics",
    "date": "2026-01-04T01:19:53.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Nobel Peace Prize laureate María Corina ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Nobel Peace Prize laureate María Corina Machado speaks during a press conference at the government's representative facilities in Oslo, Norway, Thursday, Dec. 11, 2025.\n                \n                    Stian Lysberg Solum/Pool NTB Scanpix via AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stian Lysberg Solum/Pool NTB Scanpix via AP\n    \n\n   \n   After the overnight capture of Venezuelan President Nicolás Maduro and his wife in the capital city of Caracas, questions remain as to who will lead the country.   Venezuelan opposition leader María Corina Machado, who recently won the Nobel Peace Prize, has called for Edmundo González, to be recognized as the rightful leader of the nation. He was widely seen as the legitimate winner of the 2024 presidential election in the country.   \n   Who is Machado?   Machado rose to global prominence last year with her win of the prestigious Nobel Peace Prize.   She has been an outspoken critic of Maduro's party, the United Socialist Party of Venezuela (PSUV), since it first won power under founder Hugo Chávez in the presidential election of 1998. The Nobel committee recognized Machado for \"her struggle to achieve a just and peaceful transition from dictatorship to democracy.\"   Her full-throated criticisms of Maduro's authoritarian regime has earned her the moniker \"Iron Lady\" among her supporters.   \n   Machado has praised President Trump as his administration carries out deadly strikes in the Caribbean Sea against Venezuelan boats he has accused of trafficking drugs.   She dedicated her Nobel Prize to the American president and has repeatedly expressed her support for the United States' pressure campaign against Maduro, citing crumbling political and economic systems within Venezuela that have forced 20% of its residents to flee the country.   \n   Despite her popularity among many Venezuelans, Trump said on Saturday he had not been in contact with Machado since the military strikes in Caracas and that he did not see her as a viable candidate to steer the country.   \"I think it would be very tough for her to be the leader. She doesn't have the support within or the respect within the country,\" he told reporters during a press conference. \"She's a very nice woman, but she doesn't have the respect to be a leader.\"   Trump said the United States would \"run\" Venezuela until a \"proper transition can take place.\"   Machado on Saturday praised Maduro's capture, writing in a statement that he faces \"international justice for the atrocious crimes committed against Venezuelans and against citizens of many other nations.\"   \"Faced with his refusal to accept a negotiated exit, the United States government has fulfilled its promise to uphold the law,\" she wrote.   \n   Machado continued: \"We have fought for years, we have given everything, and it has been worth it. What had to happen is happening.\"   Venezuela held a closely watched presidential election in 2024. Machado was barred by the Maduro regime from running in the race, but she threw her backing behind fellow opposition member González.   International election watchdogs, including the United States, say Maduro manipulated the ballot results in order to steal a third term in office and continue his dictatorial reign.   \n   On Saturday, Machado called for Venezuelans to coalesce around González and recognize him as the legitimate president of the beleaguered nation.   \"Today we are prepared to enforce our mandate and take power. Let us remain vigilant, active, and organized until the Democratic Transition is finalized. A transition that needs ALL of us.\"   Though Machado has dedicated Venezuelan supporters, the former Venezuelan National Assembly legislator has been banned by Maduro's government from running for office and was forced into hiding until a recent escape — aided by U.S. military veterans — successfully extracted her to Europe.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is María Corina Machado, Venezuela's Nobel Peace Prize winning opposition leader?",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8119x4567+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2F49%2F7cd293f1446f94bc91b2f138f989%2Fap25345338366448.jpg"
      ],
      "datePublished": "2026-01-04T01:19:53.000Z",
      "dateModified": "2026-01-04T01:19:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maduro faces drug charges in U.S. even as Trump freed others convicted of trafficking",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665695/maduro-trump-drug-dealer-pardons",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6736x3789+0+481/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F42%2F6a%2F7d2d28d2428aac88320d1341905d%2Fgettyimages-2253891367-1.jpg",
    "tag": "Politics",
    "date": "2026-01-03T20:38:45.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, alongside (L/R) ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, alongside (L/R) Deputy Chief of Staff Stephen Miller, Secretary of State Marco Rubio, and US Secretary of Defense Pete Hegseth, speaks to the media following US military actions in Venezuela, at his Mar-a-Lago residence in Palm Beach, Florida, on Jan. 3.\n                \n                    JIM WATSON/AFP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        JIM WATSON/AFP\n    \n\n   \n   President Trump escalated the U.S. drug war in dramatic fashion early Saturday, ordering the invasion of Venezuela and removing that country's president Nicolás Maduro and his wife, Cilia Flores, who were quickly charged with narcotics trafficking by the U.S. Justice Department.      But the stunning military action comes at a time when Trump has also freed or pardoned other convicted drug dealers and people accused of ties to drug gangs and cartels - notably the former president of Honduras.     Targeting a 'campaign of deadly narco-terrorism'   Venezuela's Maduro and Flores face charges of \"drug trafficking and narco-terrorism conspiracies,\" according to an indictment made public by U.S. Attorney General Pam Bondi.  \"They will soon face the full wrath of American justice on American soil in American courts,\" Bondi said in a post on social media.   \n   The Justice Department charged Maduro in March 2020, during Trump's first administration, in connection with alleged narcoterrorism and drug smuggling into the United States.   That indictment alleged Maduro was the leader of the Cartel de los Soles, and that he and other defendants took part in a narco-terrorism conspiracy with the Colombian guerrilla group known as the Revolutionary Armed Forces of Colombia (FARC).   During a Saturday news conference, Trump acknowledged other motives that led him to order the attack, including his desire to seize control of Venezuela's oil fields.  But he pointed to drug trafficking as a key factor, accusing Maduro of a \"campaign of deadly narco-terrorism against the United States and its citizens.\"   \n            Nicolas Maduro and his wife, Cilia Flores, have been indicted in the Southern District of New York.  Nicolas Maduro has been charged with Narco-Terrorism Conspiracy, Cocaine Importation Conspiracy, Possession of Machineguns and Destructive Devices, and Conspiracy to Possess…— Attorney General Pamela Bondi (@AGPamBondi) January 3, 2026\n   \n   Since taking office, Trump has rapidly shifted the fight against drug overdose deaths in the U.S. from a public health response to aggressive interdiction efforts led in unprecedented ways by the U.S. military.     Trump has designated a growing number of drug cartels as terrorist organizations, ordered the U.S. Navy to target alleged drug boats in a series of deadly strikes, and designated the street opioid fentanyl as a weapon of mass destruction.     The shift, and Saturday's military action, has drawn praise from conservative supporters.     \n   \"[Maduro's capture]  is a massive improvement over what we've had, which is a narco-dictatorship, which has been weaponizing drugs and mass migration against the United States,\" said Andrés Martínez-Fernández, an expert on Latin America at the Heritage Foundation, in a statement posted on social media.   \n   But despite Trump's tough rhetoric and actions, he also has sparked controversy by some of his recent pardons.   'Using the drug war as an excuse'   Last month, Trump freed former Honduran President Juan Orlando Hernandez, who had been convicted in the U.S. of helping smuggle more than 400 tons of cocaine into the U.S.     Jeffrey Singer, a drug policy analyst at the libertarian Cato Institute, said given Trump's pattern of leniency for some alleged drug criminals, he's skeptical that narcotics interdiction was a serious goal of Saturday's operation in Venezuela.    \"If this is what's motivating [Trump], if it's stopping drug trafficking, why is he pardoning the Honduran president who was convicted of cocaine trafficking?  It's never been about that,\" he said.   According to Singer, it's dangerous for the U.S. government to use criminal drug charges as justification for the military invasion of another country, and seizure of a foreign leader, without first getting authorization from Congress. \"They're basically using the drug war as an excuse,\" he added.   \n   During his news conference on Saturday, Trump said his decision to pardon Honduras's former president reflected his belief that Hernandez was prosecuted unfairly by the Biden administration.    \"This was a man who was persecuted very unfairly,\" he said, without offering evidence.  \"That man was treated very badly and unfairly, that's why I gave him a pardon.\"   Tough talk, yet some drug criminals go free   But Hernandez isn't an isolated case.  During his second term, Trump has pardoned and released a significant number of other figures involved in drug trafficking, including Ross Ulbricht who was serving a life sentence for creating a \"dark web\" site known as Silk Road, used by drug traffickers.     \n   \"Ulbricht deliberately operated Silk Road as an online criminal marketplace intended to enable its users to buy and sell drugs and other illegal goods,\" said the DOJ in a 2015 statement.   Trump also granted clemency to Larry Hoover, 74, who was serving multiple life sentences in federal prison for crimes, including drug trafficking, linked to his role leading the Chicago-based Gangster Disciples.   In August, Democratic Rep. Robert Garcia raised \"serious concern\" after the Trump administration freed and deported to El Salvador a man named Cesar Humberto Lopez-Lario, accused by the DOJ of being \"a high-ranking leader\" of the drug gang MS-13.   \"Such a decision not only undercuts ongoing federal investigations but also threatens U.S. national security,\" Garcia wrote.   Previously, during his first term in the White House, Trump's administration also freed Gen. Salvador Cienfuegos Zepeda, Mexico's former Secretary of National Defense in 2020.  Cienfuegos faced accusations in the U.S. of partnering closely with drug cartels that funneled vast amounts of drugs into the U.S.     \"There's a lot of mixed messages and mixed signals [from the White House] which creates sort of chaos and uncertainty,\" said Singer at the Cato Institute, in a May interview with NPR. \"On the one hand you're threatening even tougher penalties on people who deal in drugs, while on the other hand you're releasing drug dealers from prisons.\"   -Portions of this developing story were published in a previous NPR news report on May 31, 2025.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maduro faces drug charges in U.S. even as Trump freed others convicted of trafficking",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6736x3789+0+481/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F42%2F6a%2F7d2d28d2428aac88320d1341905d%2Fgettyimages-2253891367-1.jpg"
      ],
      "datePublished": "2026-01-03T20:38:45.000Z",
      "dateModified": "2026-01-03T20:38:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top Republicans praise Venezuela operation as some lawmakers question legal authority",
    "url": "https://www.npr.org/2026/01/03/g-s1-104407/top-republicans-back-trump-venezuela",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7931x4461+0+474/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc0%2F62%2Fb74703aa48eab6cd544823ed7f7c%2Fgettyimages-2251023541-1.jpg",
    "tag": "Politics",
    "date": "2026-01-03T18:01:13.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Senate Majority Leader John Thune, R-S.D",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Senate Majority Leader John Thune, R-S.D., addressed reporters in December. Thune says he expects briefings this week on the strikes in Venezuela and arrest of Venezuelan president Nicolás Maduro.\n                \n                    Heather Diehl/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Heather Diehl/Getty Images North America\n    \n\n   \n   After months of growing concerns among some members of Congress about the Trump Administration's strikes on alleged drug boats in the Caribbean Sea, lawmakers return to Washington to an escalating conflict following U.S. strikes in Venezuela and the capture of President Nicolás Maduro.   President Trump announced early Saturday morning that Maduro and his wife Cilia Flores are on a U.S. Navy ship en route to New York, where they will face trial on drug, arms and conspiracy charges. Trump said the U.S. will \"run\" Venezuela until there is a \"safe, proper and judicious transition.\"   \n   The White House briefed some Congressional leadership after the operation began, Secretary of State Marco Rubio told reporters, adding that Congress could not be notified in advance because it would have endangered the mission.   \n   \"Congress has a tendency to leak,\" Trump told reporters on Saturday. \"This would not be good.\"   Trump is scheduled to meet with all House Republicans on Tuesday at the Kennedy Center, according to a source familiar with the planning who was not authorized to speak on the record. Lawmakers from both parties have called for broader meetings and briefings.   Top Congressional Republicans praised Trump, even as they said some say they still have questions about how the operation unfolded and what will happen next.   \"President Trump's decisive action to disrupt the unacceptable status quo and apprehend Maduro, through the execution of a valid Department of Justice warrant, is an important first step to bring him to justice for the drug crimes for which he has been indicted in the United States,\" Senate Majority Leader John Thune wrote in a statement.   \"I spoke to Secretary Rubio early this morning, and I look forward to receiving further briefings from the administration on this operation as part of its comprehensive counternarcotics strategy when the Senate returns to Washington next week,\" Thune wrote.   \n   Republicans respond   In recent months, some Congressional Republicans have expressed reservations about the Trump Administration's actions in Latin America. The Administration has carried out 35 strikes on alleged drug boats, killing at least 115 people since early September.   Rep. Don Bacon (R-Neb.), a member of the House Armed Services Committee, wrote in a statement that the operation will be positive for Venezuelans and the region.   \"My main concern now is that Russia will use this to justify their illegal and barbaric military actions against Ukraine, or China to justify an invasion of Taiwan,\" Bacon wrote. \"Freedom and rule of law were defended last night, but dictators will try to exploit this to rationalize their selfish objectives.\"   Early this morning, Sen. Mike Lee (R-Utah) initially expressed questions about the constitution justifications of acting without a declaration of war or authorization of force from Congress.   But Lee later said he spoke to Rubio who told him that, \"the kinetic action we saw tonight was deployed to protect and defend those executing the arrest warrant.\"   \"This action likely falls within the president's inherent authority under Article II of the Constitution to protect U.S. personnel from an actual or imminent attack,\" Lee wrote.   Democrats demand briefings and justification   But Congressional Democrats redoubled criticism of the Trump Administration's actions and questions about the legal authority to intervene without Congressional approval.   House Minority Leader Hakeem Jeffries, D-NY, released a statement on Saturday calling for the House and Senate to be briefed \"immediately\" with \"compelling evidence to explain and justify this unauthorized use of military force should be presented forthwith.\"   \n   Jeffries called Maduro \"a criminal and authoritarian dictator\" and said he \"is not the legitimate head of government\" but said Trump had a constitutional responsibility to follow the law and \"has not sought congressional authorization for the use of military force and has failed to properly notify Congress in advance of the operation in Venezuela.\"   \"Pursuant to the Constitution, the framers gave Congress the sole power to declare war as the branch of government closest to the American people,\" Jeffries said.   \n   Sen. Tim Kaine, D-Va., a member of the Senate Armed Services Committee, told NPR the strikes make clear that it is time for Congress to step in and exercise the branch's constitutional duties.   \"I think these strikes are clearly illegal,\" Kaine said Saturday in an interview on NPR's Weekend Edition. \"They have not been authorized by Congress. And the Constitution is clear that the U.S. doesn't engage in military action or war without a vote of Congress except in cases of imminent self-defense. The Constitution is absolutely clear on that.\"   Kaine also said he will call for a vote this week on his bipartisan resolution barring intervention in Venezuela without Congressional approval. A similar Senate resolution previously failed to attract enough Republican votes.   \"We can't, with a straight face, make the argument that we support the sovereignty of nations if we're willing to engage in a unilateral, presidentially declared war against Venezuela,\" Kaine said. \"And thus he is really undercutting US moral and stance for an international rule of law where nations can invade each other willy nilly just because a president decides it's a good idea to do so.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top Republicans praise Venezuela operation as some lawmakers question legal authority",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7931x4461+0+474/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc0%2F62%2Fb74703aa48eab6cd544823ed7f7c%2Fgettyimages-2251023541-1.jpg"
      ],
      "datePublished": "2026-01-03T18:01:13.000Z",
      "dateModified": "2026-01-03T18:01:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What are the charges against Venezuela's Nicolás Maduro?",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665617/venezuela-nicolas-maduro-charges",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3240x1823+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd3%2F58%2F991962d442baaf48bf576dcce809%2Fgettyimages-2167203758.jpg",
    "tag": "Politics",
    "date": "2026-01-03T16:23:39.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan President Nicolás Maduro in C",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan President Nicolás Maduro in Caracas, Venezuela, on Aug. 17, 2024.\n                \n                    Alfredo Lasry R/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alfredo Lasry R/Getty Images\n    \n\n   \n   Venezuela's Nicolás Maduro and his wife, Cilia Flores, face criminal charges in the United States following President Trump's announcement early Saturday that the U.S. attacked Caracas and took them into custody.   \n   A new indictment unsealed in federal court in New York charges Maduro with narco-terrorism conspiracy, cocaine-importation conspiracy and weapons charges. Flores and other senior Venezuelan officials, including Maduro's son, are also facing charges.    Attorney General Pam Bondi, in a post on X, wrote that Maduro and his wife \"will soon face the full wrath of American justice on American soil in American courts.\"    \n   \n            Nicolas Maduro and his wife, Cilia Flores, have been indicted in the Southern District of New York.  Nicolas Maduro has been charged with Narco-Terrorism Conspiracy, Cocaine Importation Conspiracy, Possession of Machineguns and Destructive Devices, and Conspiracy to Possess…— Attorney General Pamela Bondi (@AGPamBondi) January 3, 2026\n   \n   According to the indictment, for more than 25 years Venezuela's leaders \"have abused their positions of public trust and corrupted once-legitimate institutions to import tons of cocaine into the United States.\"   It alleges that starting as early as 1999, Maduro and his co-defendants have partnered with international drug trafficking organizations — including Mexico's Sinaloa Cartel and the Zetas, Colombian narco-terrorist groups and the Venezuelan gang Tren de Aragua — to ship illicit drugs into the U.S.    \n   Venezuela's political and military elite enriched themselves while providing protection and logistical support to the drug traffickers, according to the indictment.    It also details specific actions that Maduro allegedly took as part of the conspiracy. It says, for example, that between 2006 and 2008 when he served as foreign minister that Maduro sold Venezuelan diplomatic passports to known drug traffickers \"in order to assist traffickers seeking to move drug proceeds form Mexico to Venezuela under diplomatic cover.\"   He also allegedly facilitated the flights of private planes under diplomatic cover to bring drug proceeds back from Mexico to Venezuela.    Prosecutors allege that Maduro and Flores worked together for years to traffic cocaine that had previously been seized by Venezuelan law enforcement. They say the Maduros had their own state-sponsored gangs to protect their operation, and that they ordered \"kidnappings, beating and murders against those who owed them drug money or otherwise undermined their drug trafficking operation.\"   \n   The new indictment adds to charges against Maduro and other Venezuelan officials that were announced in March 2020 during the first Trump administration.    \n   Maduro denied those initial charges and called for dialogue with the U.S., before being captured.   The current Trump administration has ramped up the pressure on Maduro over the past year. The U.S. raised the bounty for Maduro's arrest to $50 million, and designated the Cartel de los Soles as a foreign terrorist organization.    Separately, the International Criminal Court has been investigating the Venezuelan government for alleged torture, sexual violence and arbitrary detentions.   This is a developing story, which may be updated.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What are the charges against Venezuela's Nicolás Maduro?",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3240x1823+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd3%2F58%2F991962d442baaf48bf576dcce809%2Fgettyimages-2167203758.jpg"
      ],
      "datePublished": "2026-01-03T16:23:39.000Z",
      "dateModified": "2026-01-03T16:23:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says U.S. will 'run' Venezuela and sell seized oil in remarks on the strikes",
    "url": "https://www.npr.org/2026/01/03/g-s1-104346/trump-venezuela-maduro-press-conference",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F95%2Fa9f4d8a147b1b9a9eabcb04b7774%2Fgettyimages-2254502804.jpg",
    "tag": "Politics",
    "date": "2026-01-03T15:14:30.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Secretary of State Marco Rubio and Secre",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Secretary of State Marco Rubio and Secretary of Defense Pete Hegseth listen as President Trump addresses the media during a news conference at his Mar-a-Lago club on Saturday in Palm Beach, Fla.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   President Trump said the U.S. will run Venezuela until a \"proper transition can take place,\" said he wasn't \"afraid of boots on the ground,\" and defended Saturday's military strikes that resulted in the capture of President Nicolás Maduro and his wife.   \"We're there now, but we're going to stay until such time as the proper transition can take place,\" Trump told reporters from Mar-a-Lago in Florida. \"So we're going to stay until such time as we're going to run it, essentially, until such time as a proper transition can take place.\"   Trump's remarks cap a dramatic few hours that began with reports of explosions in the Venezuelan capital, Caracas, the scale of which became apparent only when the president said Maduro and his wife had been captured. Maduro and his wife, Cilia Flores, are being brought by the USS Iwo Jima to New York where they'd stand trial.   \n   U.S. says it's in charge   Trump claimed that having the U.S. \"run\" Venezuela was in the U.S.' best interest.   \"We want to surround ourselves with good neighbors,\" he said. \"We want to surround ourselves with stability.\"   Trump said a group of people would step in to run Venezuela, including Secretary of State Rubio and Defense Secretary Pete Hegseth, and added U.S. oil companies would have military back up as they move into the region.   \"We're not afraid of boots on the ground,\" he said. \"And we have to have, we had boots on the ground last night at a very high level. Actually, we're not afraid of it, we're we don't mind saying it, but we're going to make sure that that country is run properly. We're not doing this in vain.\"   Trump's plan for the oil   The president made clear he expects the U.S. to sell seized oil assets and said he expects money will both go to Venezuela as well as the U.S.    \"We're going to be taking out a tremendous amount of wealth out of the ground, and that wealth is going to the people of Venezuela, and people from outside of Venezuela that used to be in Venezuela, and it goes also to the United States of America in the form of reimbursement for the damages caused us by that country,\" Trump said.   \n   Trump was vague on who would be running the country specifically, but said Rubio had spoken to the current vice president, Delcy Rodriguez.   \"We're designating various people, and we're going to let you know who those people are that would run Venezuela,\" he said. \"It's largely going to be for a period of time, the people that are standing right behind me. We're going to be running it.\"   He said U.S. oil companies would head to Venezuela to operate in their oil reserves, and the military is set to attack again if necessary to secure the effort.   \n   \"We're going to have our very large United States oil companies, the biggest anywhere in the world, go in, spend billions of dollars, fix the badly broken infrastructure, the oil infrastructure, and start making money for the country, and we are ready to stage a second and much larger attack if we need to do so,\" he said.   How it happened   Trump and other U.S. officials noted there were no fatalities in the operation.    Earlier Trump told Fox & Friends that he watched the \"extremely complex\" operation unfold \"like I was watching a television show.\"   \n   Trump defended the operation, telling the network, \"You know what, we did a great job with stopping drugs from coming into this country, and nobody's been able to do it until we came along. But they should say, 'great job.' They could say, 'Oh, gee, maybe it's not constitutional.' You know, the same old stuff that we've been hearing for years and years and years.\"   Rubio told reporters the mission wasn't the kind you could notify lawmakers in advance. \"It endangers the mission,\" he said.   Watch Trump's remarks on Saturday morning   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says U.S. will 'run' Venezuela and sell seized oil in remarks on the strikes",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F95%2Fa9f4d8a147b1b9a9eabcb04b7774%2Fgettyimages-2254502804.jpg"
      ],
      "datePublished": "2026-01-03T15:14:30.000Z",
      "dateModified": "2026-01-03T15:14:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maduro arrives in New York. What to know about the U.S. operation in Venezuela",
    "url": "https://www.npr.org/2026/01/03/nx-s1-5665670/venezuela-strikes-us-maduro",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+66/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F29%2F9a%2F4b5a93a54e6ebba3cc7b69b145b4%2Fgettyimages-2254463527.jpg",
    "tag": "Politics",
    "date": "2026-01-03T22:31:50.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Supporters of Venezuela's current and fo",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Supporters of Venezuela's current and former president, Nicolas Maduro and the late Hugo Chavez, hold posters with their images in Caracas on Saturday.\n                \n                    Jesus Vargas/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jesus Vargas/Getty Images\n    \n\n   \n   President Donald Trump said the U.S. would \"run\" Venezuela, following a stunning military operation on Caracas early Saturday in which the country's President, Nicolás Maduro, was captured by U.S. military forces.    On Saturday evening, a plane carrying Maduro landed at New York's Stewart Air National Guard Base. A video posted on X by the White House's rapid response account later appeared to show Maduro in the Drug Enforcement Administration headquarters in Manhattan. He was expected to be detained while awaiting trial at a federal jail in Brooklyn.   Attorney General Pam Bondi said in a statement that Maduro and his wife, Cilia Flores, whom she described as \"alleged international narco traffickers,\" had been indicted in the Southern District of New York.   \n   \"They will soon face the full wrath of American justice on American soil in American courts,\" she added.   \n   Meanwhile, Trump said Venezuela's Vice President, Delcy Rodríguez, was \"sworn in\" as president on Saturday afternoon. Rodríguez, whose location remains unknown, said Saturday that Maduro was her country's only president, adding Venezuela was ready to defend its natural resources.   Questions are swirling about the legality of the U.S.' actions in Venezuela and what it means for both countries.   Here's what we know so far.   The strikes happened in the middle of the night   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person walks near a burnt missile interceptor vehicle at La Carlota air base in Caracas on Saturday.\n                \n                    Juan Barreto/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Juan Barreto/AFP via Getty Images\n    \n\n   \n   A series of explosions went off in Venezuela around 2 a.m. local time (1 a.m. ET), according to Gen. Dan Caine, chairman of the Joint Chiefs of Staff.   Vanessa Silva, a journalist in Caracas, told NPR's Carrie Kahn that she woke up to two explosions at La Carlota military airbase near her home. Silva saw two fires on the runway that were quickly put out, and reported hearing similar detonations and planes flying low over Caracas for at least an hour.   The Venezuelan government says that military targets in the states of Miranda, Aragua and La Guaira were also hit.   Venezuela's Defense Minister Vladimir Padrino López said strikes also hit civilian neighborhoods, and that a tally of injuries and deaths was underway. Separately, Venezuela's vice president, Delcy Rodríguez, said both civilians and service members had been killed, but did not give a number.   \n   Trump told Fox and Friends on Saturday morning that there were some U.S. injuries suffered during the operation, but no fatalities. He also said the U.S. was prepared with a second wave of troops that was not ultimately needed.   Trump posted a picture on Truth Social that he said was Maduro aboard the U.S.S. Iwo Jima en route to New York. The photo shows Maduro in a grey tracksuit, handcuffed and blindfolded.   The Trump administration accuses Maduro of running a cartel, stealing U.S. oil   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Maduro greets supporters upon his arrival at a rally in Caracas on December 10.\n                \n                    Federico Parra/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Federico Parra/AFP via Getty Images\n    \n\n   \n   The U.S. is one of many Western countries who see Maduro's government as illegitimate, citing widespread fraud in the 2024 election.   \n   The Trump administration has long accused Maduro of running a criminal narco-trafficking organization called Cartel de los Soles, which experts say is shorthand for a system of corruption rather than a single hierarchical group. The U.S. declared it a foreign terrorist organization in November.   On Saturday, U.S. Attorney General Pam Bondi said Maduro, Flores, and senior Venezuelan face charges related to alleged \"drug trafficking and narco-terrorism conspiracies,\" according to an unsealed indictment Bondi posted on X.   The indictment alleges that, starting in 1999, Maduro and others partnered with international drug trafficking organizations to transport thousands of tons of cocaine into the United States.   Maduro has repeatedly denied accusations against him and pointed the finger at the U.S., accusing the country of attempting to remove him from power in order to gain access to Venezuela's vast oil reserves.   \"They invented an accusation that the United States knows is as false as that accusation of weapons of mass destruction, which led them to an eternal war,\" Maduro said in an interview that aired on state TV on Thursday, adding that he was open to U.S. talks on drug trafficking.   The Trump administration claims that Venezuela \"stole\" oil and assets from the U.S., after its government nationalized them in the late 1990s, which Maduro's government denies.   \n   Last month, Trump ordered a blockade against Venezuelan oil and sanctioned tankers. And on Saturday morning, Vice President JD Vance tweeted that Trump had been clear to Maduro: \"the drug trafficking must stop, and the stolen oil must be returned to the United States.\"   The U.S. has been ramping up pressure on Maduro's government in recent months, conducting military strikes on dozens of small boats in the Caribbean and Pacific that it claims were transporting drugs toward the U.S. And the U.S. — specifically the CIA— conducted a drone strike last week at a docking area believed to be used by Venezuelan drug cartels, marking its first direct operation on Venezuelan soil since the strikes began in September.   \n   U.S. oil companies are going to head to Venezuela and operate in their oil reserves, Trump said Saturday. The president did not say which oil companies and it is unclear if any U.S. oil companies have made plans to do so.   \"We're going to have our very large United States oil companies, the biggest anywhere in the world, go in, spend billions of dollars, fix the badly broken infrastructure, the oil infrastructure, and start making money for the country,\" Trump said.  \"The biggest beneficiary are going to be the people of Venezuela.\"   Who will lead Venezuela down the line?   Despite Trump's announcement that Vice President Rodríguez has been sworn in, it's unclear who will take over Maduro's duties long term.   \"I'm not sure there's going to be a power vacuum, because so many of his cronies apparently were left behind,\" Todd Robinson, former acting U.S. ambassador to Venezuela during President Trump's first term, told NPR.   \"There are a lot of questions about what exactly is left behind now, and what more the United States is willing to do to ensure that a potential legitimate person takes over,\" Robinson added.   \n   Trump on Saturday did not outline a clear plan on next steps but said that the U.S. will run Venezuela until a \"proper transition can take place.\"   \"We're going to run the country right. It's going to be run very  judiciously, very fairly,\" he said during Saturday's press conference after Maduro was captured.    It's also not clear whether Maduro loyalists will stay behind and try to defend the country, or similarly flee.   Other contenders include opposition leaders who are also living outside the country's borders for their safety.   \n   In a letter posted on social media, Venezuelan opposition leader María Corina Machado, who was recently awarded the Nobel Peace Price, said that Edmundo Gonzalez, who is widely regarded as the legitimate winner of the 2024 Venezuelan elections, should assume the presidency. Gonzalez is currently living in exile in Spain.   \"Venezuelans, the HOUR OF FREEDOM has arrived!\" she wrote on X, reacting to Maduro's removal.   As for Machado's own political ambitions, Trump said it would be \"very tough for her to be the leader.\"   \n   \"She doesn't have the support within or the respect within the country. She's a very nice woman, but she doesn't have the respect,\" he said during the press conference.   The president also said Rubio spoke with Rodríguez, who Trump said indicated to the US secretary of state that she is \"willing to do what we think is necessary to make Venezuela great again.\"   \"I think she was quite gracious, but she really doesn't have a choice,\" Trump said.   World reactions are mixed    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelans living in Chile celebrate Maduro's capture in Santiago on Saturday.\n                \n                    Javier Torres/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Javier Torres/AFP via Getty Images\n    \n\n   \n   Leaders — both in the U.S. and across the world — are alternately praising and denouncing the administration's actions in Venezuela.   Several Democrats in Congress are calling it illegal, saying Trump did not get Congressional authorization ahead of time.   \"The Constitution is clear that the U.S. doesn't engage in military action or war without a vote of Congress except in cases of imminent self-defense,\" Democratic Sen. Tim Kaine, D-Va, told NPR Sunday.   \"Maduro is a disaster and he's been disastrous for the country. And we could say the same thing, about 150 leaders of countries around the world. But our Constitution is very, very clear that we don't order servicemen and women into harm's way, risking their lives unless there is a congressional debate and vote about whether the war is in the national interest here.\"   \n   \"Trump rejected our Constitutionally required approval process for armed conflict because the Administration knows the American people overwhelmingly reject risks pulling our nation into another war,\" Sen. Andy Kim, D-N.J., wrote on X.   But many Congressional Republicans are praising Trump's actions, including Senate Majority Leader John Thune, R-S.D., who says he expects senators to be briefed when Congress returns from its two-week recess on Monday.   Many Latin American leaders have expressed concern about the attack and what it could mean for stability in the region — including those of Cuba, Chile, Mexico and Columbia, which is mobilizing troops to its border with Venezuela over concerns about an influx of refugees fleeing.   \n   But Argentina's President Javier Milei, a Trump ally, has publicly praised the operation.   Elsewhere, the reaction has been more cautious.   Kaja Kallas, the vice president of the European Commission, reiterated the EU's view that \"Maduro lacks legitimacy\" but also called for restraint and the respect of \"principles of international law.\" U.K. Prime Minister Keir Starmer said Britain was not involved and expressed his support for upholding international law.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maduro arrives in New York. What to know about the U.S. operation in Venezuela",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+66/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F29%2F9a%2F4b5a93a54e6ebba3cc7b69b145b4%2Fgettyimages-2254463527.jpg"
      ],
      "datePublished": "2026-01-03T22:31:50.000Z",
      "dateModified": "2026-01-03T22:31:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]