[
  {
    "title": "White House fires entire commission that reviews designs for federal buildings",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5589793/white-house-fired-arts-commission",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb6%2F1f%2F46cc87344cbfa7a2bdf14eb92b97%2Fgettyimages-2179476936.jpg",
    "tag": "Politics",
    "date": "2025-10-29T14:16:54.000Z",
    "description": "\n      \n      Fine Arts commission firings\n    \n        \n                Download\n                \n                \n                    \n             ",
    "body": "\n      \n      Fine Arts commission firings\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5589793/nx-s1-9511891\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Jefferson Memorial and US Capitol are seen alongside the Tidal Basin in an aerial photograph taken on approach to Ronald Reagan Washington National Airport near Washington, DC, on October 22, 2024.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   The White House has fired six members of the U.S. Commission of Fine Arts, the independent federal agency that advises the president and Congress on design plans for monuments, memorials, coins and federal buildings. The seven member commission is made up of experts in architecture, art, urban and landscape design. Since its creation in 1910, the commission has reviewed plans for everything from Arlington National Cemetery to Maya Lin's Vietnam Veterans Memorial.   As first reported by The Washington Post, the commissioners who were terminated are Bruce Redman Becker, Peter D. Cook, Lisa E. Delplace, William J. Lenihan, Justin Garrett Moore and vice chair Hazel Ruth Edwards. The chair position, now vacant, was held by Billie Tsien, one of the architects working on the Obama Presidential Center in Chicago. Lenihan confirmed in an email to NPR the six were terminated \"effective immediately.\"   \n   In an email to NPR, the White House said it is \"preparing to appoint a new slate of members to the commission that are more aligned with President Trump's America First Policies.\"   The commissioners would have advised President Trump on his anticipated White House ballroom and his plans for a monument similar to the Arc de Triomphe in Paris, which he says will celebrate the 250th anniversary of the adoption of the Declaration of Independence. In an email to NPR, architect Bruce Redman Becker, one of the commissioners who was fired, wrote that \"Neither project has been submitted for review yet.\"   President Trump has not yet announced who the new commissioners will be. During his first term, Justin Shubow, founder and president of the National Civic Art Society served as chair and White House ballroom architect James McCrery was one of its commissioners.   In 2021, President Biden fired four commissioners who'd been appointed by Trump in his first term, including Shubow. Like Trump, Shubow is a champion of traditional and classical architecture.   The White House has not yet responded to NPR's request for comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House fires entire commission that reviews designs for federal buildings",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb6%2F1f%2F46cc87344cbfa7a2bdf14eb92b97%2Fgettyimages-2179476936.jpg"
      ],
      "datePublished": "2025-10-29T14:16:54.000Z",
      "dateModified": "2025-10-29T14:16:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he's confident of a deal ahead of Xi meeting",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5589729/trump-xi-deal-south-korea-apec",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4436x2495+0+231/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F24%2F89%2F0754c3ba452e99ad0f424ecab152%2Fap25302162361546.jpg",
    "tag": "Politics",
    "date": "2025-10-29T10:02:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks at an Asia",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks at an Asia-Pacific Economic Cooperation CEO luncheon in Gyoeongju, South Korea, Wednesday, Oct. 29, 2025.\n                \n                    Mark Schiefelbein/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Schiefelbein/AP\n    \n\n   \n   GYEONGJU, SOUTH KOREA – President Trump on Wednesday confidently predicted striking a deal with China's leader in a bilateral meeting on the sidelines of the Asia Pacific Economic Forum, following a period of trade tensions that have threatened to escalate.   \n   \"I think we're going have a deal, I think it will be a good deal for both, and that's really a great result,\" Trump told a lunch meeting of APEC business executives in the southern city of Gyeongju.    \"That's better than fighting and going through all sorts of problems,\" he added ahead of the Thursday meeting with President Xi Jinping. \"No reason for it.\"   Trump said that he could reduce tariffs on Chinese goods in exchange for a commitment from Beijing to curb exports of chemicals used to make fentanyl.   \n   \"I expect to be lowering that because I believe that they're going to help us with the fentanyl situation,\" Trump told reporters en route to Gyeongju. \"They're going to be doing what they can do.\"   The U.S. currently imposes a 20% tariff on Chinese imports, in addition to other tariffs, because the U.S. government believes China has not done enough to restrict fentanyl precursor exports.   In response, Beijing imposed retaliatory tariffs on U.S. soybeans. U.S. and Chinese economic officials met over the weekend in Malaysia to build the framework of a trade deal that would include China resuming purchases of U.S. soybeans.   The deal would also include China delaying the imposition of export restrictions on rare earths, while the U.S. would hold off on raising tariffs by 100%.   Both Beijing and Washington are trading accusations that the other side's economic coercion is wreaking havoc on the global economy.   \"This is China versus the world,\" Treasury Secretary Scott Bessent said about China's rare earth export controls this month. \"They have pointed a bazooka at the supply chains and the industrial base of the entire free world, and we're not going to have it,\" he said.   \"The U.S. has raised tariffs so high that it's brought globalization to the verge of breakdown,\" says Zhu Feng, dean of the School of International Studies at Nanjing University in China.   \n   He notes that besides tariffs, the U.S. has raised port fees this month on Chinese-owned or operated ships docking at U.S. ports. It has suggested controls on U.S. exports of software to China.   And it has proposed barring Chinese air carriers headed to and from the U.S. from flying through Russian airspace. China's airlines have a cost advantage, because Russia allows Chinese carriers to transit their airspace, but not U.S. ones.   \"You can make China accept your rise in tariffs. But you can't keep overwhelmingly pounding on China so hard,\" he says. \"China's retaliation is to show China and the world that the U.S. can't just keep us cornered,\" Zhu adds.   Trump has also mentioned that he wants to discuss nuclear arms control with Xi, and possibly include China in U.S.-Russia nuclear arms control negotiations.   Despite speculation that Trump might try to revive nuclear negotiations with North Korean leader Kim Jong Un on this trip, that now seems off the table.   Trump told South Korean President Lee Jae Myung at the start of bilateral talks that talks with Xi were his main goal. \"We're looking forward to seeing him [Xi], and that was our focus, really, for this visit.\"   Trump told Lee he was aware that the two Koreas remain technically in a state of war, and assured Lee that \"we will see what we can do to get that straightened out. You know that I'll be working on this very hard.\"   As Trump was visiting South Korea, Pyongyang said it had conducted successful cruise missile tests.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he's confident of a deal ahead of Xi meeting",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4436x2495+0+231/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F24%2F89%2F0754c3ba452e99ad0f424ecab152%2Fap25302162361546.jpg"
      ],
      "datePublished": "2025-10-29T10:02:21.000Z",
      "dateModified": "2025-10-29T10:02:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Want to opt out of AI? State labeling laws might help",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5575748/some-states-want-labels-ai-opt-out",
    "image": "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg",
    "tag": "Politics",
    "date": "2025-10-28T20:07:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting d",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting details taped to a light pole on a city street in San Francisco, California on May 20, 2025.\n                \n                    Smith Collection/Gado/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Smith Collection/Gado/Getty Images\n    \n\n   \n   Utah and California have passed laws requiring entities to disclose when they use AI. More states are considering similar legislation. Proponents say labels make it easier for people who don't like AI to opt out of using it.   \"They just want to be able to know,\" says Utah Department of Commerce executive director Margaret Woolley Busse, who is implementing new state laws requiring state-regulated businesses to disclose when they use AI with their customers.   \"If that person wants to know if it's human or not, they can ask. And the chatbot has to say.\"   California passed a similar law regarding chatbots back in 2019. This year it expanded disclosure rules, requiring police departments to specify when they use AI products to help write incident reports.   \n   \"I think AI in general and police AI in specific really thrives in the shadows, and is most successful when people don't know that it's being used,\" says Matthew Guariglia, a senior policy analyst for the Electronic Frontier Foundation, which supported the new law. \"I think labeling and transparency is really the first step.\"   As an example, Guariglia points to San Francisco, which now requires all city departments to report publicly how and when they use AI.   Such localized regulations are the kind of thing the Trump Administration has tried to head off. White House \"AI Czar\" David Sacks has referred to a \"state regulatory frenzy that is damaging the startup ecosystem.\"   Daniel Castro, with the industry-supported think tank Information Technology & Innovation Foundation, says AI transparency can be good for markets and democracy, but it may also slow innovation.   \"You can think of an electrician that wants to use AI to help communicate with his or her customers ... to answer queries about when they're available,\" Castro says. If companies have to disclose the use of AI, he says, \"maybe that turns off the customers and they don't really want to use it anymore.\"   For Kara Quinn, a homeschool teacher in Bremerton, Wash., slowing down the spread of AI seems appealing.   \n   \"Part of the issue, I think, is not just the thing itself; it's how quickly our lives have changed,\" she says. \"There may be things that I would buy into if there were a lot more time for development and implementation.\"   At the moment, she's changing email addresses because her longtime provider recently started summarizing the contents of her messages with AI.   \"Who decided that I don't get to read what another human being wrote? Who decides that this summary is actually what I'm going to think of their email?\" Quinn says. \"I value my ability to think. I don't want to outsource it.\"   Quinn's attitude to AI caught the attention of her sister-in-law, Ann-Elise Quinn, a supply chain analyst who lives in Washington, D.C. She's been holding \"salons\" for friends and acquaintances who want to discuss the implications of AI, and Kara Quinn's objections to the technology inspired the theme of a recent session.   \"How do we opt out if we want to?\" she asks. \"Or maybe [people] don't want to opt out, but they want to be consulted, at the very least.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Want to opt out of AI? State labeling laws might help",
      "image": [
        "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg"
      ],
      "datePublished": "2025-10-28T20:07:40.000Z",
      "dateModified": "2025-10-28T20:07:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5588624/a-gop-led-house-committee-takes-aim-at-what-it-calls-bidens-autopen-presidency",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-28T20:20:31.000Z",
    "description": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Tra",
    "body": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5588624/nx-s1-9509951\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      NPR's Ailsa Chang speaks with University of St. Thomas law professor Mark Osler about the House Oversight Committee's call for an investigation into President Biden's executive actions signed by autopen.   \n\n    AILSA CHANG, HOST:  Hours before President Biden left office, he signed a number of preemptive pardons, and those pardons went to the House committee investigating January 6. These are preemptive pardons for people like Dr. Anthony Fauci, General Mark Milley. In a statement, Biden had said that he wanted to shield these people from, quote, \"unjustified and politically motivated prosecutions\" from the incoming Trump White House.Well, since entering office, President Trump has declared on social media that Biden's pardons are invalid, claiming without evidence that the Biden administration used a writing machine called an autopen to sign those pardons without Biden's knowledge. Trump's statement does not have the force of law, and Biden has repeatedly insisted that he was personally behind all the decisions made during his presidency. But today, the House Oversight Committee, chaired by Republican Congressman James Comer, asked the Justice Department to look into what they call the, quote, \"Biden autopen presidency.\" Attorney General Pam Bondi says her team is doing exactly that.To talk more about this, we're joined now by Mark Osler. He's a law professor at the University of St. Thomas, known for his work on clemency. Welcome.MARK OSLER: Thank you.CHANG: So this House Oversight Committee accuses the Biden White House of covering up Biden's cognitive decline. Let me just ask you, what does this report ultimately ask for?OSLER: Well, it's asking for a further investigation by the Department of Justice. I think they were frustrated because some of the witnesses pled the Fifth. And there's a political point being made as well.CHANG: OK. And just to remind everyone, this is a Republican-led committee. What do you make of the argument that they lay out in this report about Biden's cognitive decline and the permanence of these preemptive pardons?OSLER: Yeah. I'm not an expert on cognition, but I am an expert on clemency, and I can tell you that the Constitution doesn't make any requirement whatsoever as to how a pardon or a commutation is going to be put into writing or issued at all. And we've seen a variety of methods used over the years. You know, in 2005, the Office of Legal Counsel provided the president with advice that the president could use an autopen to sign bills - obviously one of the most important things the president is going to sign. And since then, presidents have used autopens for a wide variety of things...CHANG: Right.OSLER: ...Especially when there's a lot to be signed at once.CHANG: Well, what can the Department of Justice actually do in this situation? Like, can you think of anytime a pardon from a president has been reversed or declared null and void, as this House committee and President Trump would like to see happen here?OSLER: No, that hasn't happened. Once a president issues a pardon, it's been viewed as final. And so if something was to get overturned here, this would really be breaking new ground.CHANG: So are you telling me that a president's pardon power is absolute?OSLER: It's surprising, but that's what it says in the Constitution. It's almost absolute. It can't cover people who are under impeachment, and it's generally accepted that it can't pardon future crimes, those that haven't been committed yet. But yes. It's really rare in having so few checks and balances.CHANG: Well, then - OK - say you're a person who did receive a pardon from President Biden. What would you advise that person to do to protect themselves legally now from having that pardon reversed or somehow invalidated during the Trump administration?OSLER: Yeah. There's really not that much that they can do. Again, I think most people who have studied this would be shocked if a pardon was overturned. One of the things that I really fear that could happen with this investigation and some of the conclusions that they seem to want to reach is you have 37 people who received a commutation of their death sentence by President Biden. And I would really think it would cause a constitutional crisis if President Trump moved to execute those people despite that commutation of the death sentence. But going forward, I hope that pardons aren't undermined. They're under enough stress as they are.CHANG: Mark Osler, from the University of St. Thomas, thank you very much for being with us today.OSLER: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-28T20:20:31.000Z",
      "dateModified": "2025-10-28T20:20:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Wikipedia and Grokipedia are saying about each other",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5588695/wikipedia-grokipedia-comparison",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2144x1206+0+0/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F42%2F35%2F910e6d7c44919c5095a5ce8ff71b%2Fscreenshot-2025-10-29-at-3-11-06-pm.png",
    "tag": "Politics",
    "date": "2025-10-29T19:37:24.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A screengrab from Grokipedia shows its a",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A screengrab from Grokipedia shows its article about Wikipedia, the online encyclopedia that Grokipedia is challenging.\n                \n                    Grokipedia/ Screenshot by NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Grokipedia/ Screenshot by NPR\n    \n\n   \n   Elon Musk's Grokipedia encyclopedia is now online, challenging volunteer-edited Wikipedia with a new tool that incorporates Grok, the large language model chatbot developed by Musk's artificial intelligence company, xAI.   \n   Musk is positioning Grokipedia as an alternative to Wikipedia, which he called \"Wokepedia\" in an X post last December. Musk has lofty ambitions for the new encyclopedia: His stated goal is to create \"an open source, comprehensive collection of all knowledge.\"   Critics and pundits are busy comparing the two sites and how they present a range of controversial topics. But we can also learn about some of their differences by asking a simple question: What do Wikipedia and Grokipedia say about each other?   \n   Searching for each other   A search for \"Wikipedia\" on Grokipedia yielded 6,047 results early Wednesday, a number that reflects both the work that's gone into Grokipedia and the challenge of competing with an encyclopedia that's been growing for nearly 25 years.   On Wikipedia, a search for \"Grokipedia\" returned 13 results.   Meanwhile, two days after its Monday launch, a search for \"Grokipedia\" on Grokipedia did not return a dedicated entry. Instead, the eight search results ranged from a general entry about online encyclopedias to seven entries primarily about Wikipedia.   Typing \"grokipedia\" into Grokipedia's URL to see if the new encyclopedia might have an entry that's not yet searchable returns a message: \"This page doesn't exist ... yet.\"   Bias and imitation   On its page about Wikipedia, Grokipedia says the site is renowned for its \"unprecedented scale, accessibility, and role in democratizing information.\" But Grokipedia also says Wikipedia is the subject of \"persistent criticisms regarding factual reliability, susceptibility to vandalism and hoaxes, and systemic ideological biases — particularly a left-leaning slant in coverage of political figures and topics.\"   \n   The lengthy article uses forms of the word \"bias\" dozens of times. It alleges that Wikipedia suffers from \"ideological skew\" to the left, and states that the site's preference for a neutral point of view drawn from reliable sources can instead reinforce narratives that \"align with institutional biases in academia and media.\"   On its page about Grokipedia, Wikipedia says that Musk \"positioned Grokipedia as an alternative to Wikipedia that would 'purge out the propaganda.'\" It also notes that Wikipedia co-founder Larry Sanger, who has become a critic of the long-running encyclopedia, welcomed Grokipedia's arrival.   \n   The Wikipedia article about Grokipedia highlights criticisms of the new site, such as media reports that Grokipedia's article about Elon Musk omits mention of the controversy over a gesture he made earlier this year \"which many viewed as resembling a Nazi salute.\" It also says critics allege Grokipedia promotes right-leaning views and relies too much on AI tools.   \n   Wikipedia also notes that Grokipedia seems to have pulled text from Wikipedia, stating, \"Some articles are nearly identical to their Wikipedia entries.\"   In some cases, Grokipedia duplicates Wikipedia content, as noted by media outlets and Wikipedia users. Grokipedia's page on \"buttocks,\" for instance, is virtually a copy of the Wikipedia page (albeit without images).   In that and similar cases, the articles acknowledge that their \"content was adapted from Wikipedia.\"   Musk said at the All-In Podcast conference in September that Grok was working to evaluate information from sources such as Wikipedia pages and then \"rewrite the page to … remove the falsehoods, correct the half-truths and add the missing context.\"   Like Wikipedia, Grokipedia users can see an article's edit history. But while Wikipedia users can directly edit a story, Grokipedia offers tools to ask questions and submit a correction.   \n   \"Wikipedia's knowledge is — and always will be — human,\" the Wikimedia Foundation said in a statement to NPR. Noting the site's ethos of open collaboration and consensus, it added, \"This human-created knowledge is what AI companies rely on to generate content; even Grokipedia needs Wikipedia to exist.\"   Nuts and bolts   Numbers rule the internet, and these two sites are fairly accurate about their rival's size, with some caveats.   Wikipedia, for instance, says that Grokipedia had \"about 900,000 AI-generated articles\" as of Oct. 28. That same day, Grokipedia's site said it had 885,279 articles available -- a figure published on its landing page. The Wikipedia entry for Grokipedia didn't reference that precise number, and it cited an article from the Indian financial news site Moneycontrol instead of Grokipedia's data -- perhaps to capture a historical record of a figure that will be updated. An editor later updated the citation to point to an Axios article.   \n   Grokipedia accurately states that as of October 2025, Wikipedia had more than 7 million articles in English, in the main entry about its older rival. But further down that page, the entry muddies the water a bit by stating that Wikipedia had \"over 6.8 million articles in English alone by October 2025.\"   According to Wikipedia's running count on the Size of Wikipedia page, the English site had more than 6.9 million articles as of January 2025.   Disclosure: NPR CEO Katherine Maher is the former CEO of the Wikimedia Foundation.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Wikipedia and Grokipedia are saying about each other",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2144x1206+0+0/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F42%2F35%2F910e6d7c44919c5095a5ce8ff71b%2Fscreenshot-2025-10-29-at-3-11-06-pm.png"
      ],
      "datePublished": "2025-10-29T19:37:24.000Z",
      "dateModified": "2025-10-29T19:37:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5589180/trump-tariffs-senate-vote",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg",
    "tag": "Politics",
    "date": "2025-10-28T23:47:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping con",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping containers at the Port of Los Angeles on Sept. 26.\n                \n                    Mario Tama/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mario Tama/Getty Images\n    \n\n   \n   The Republican-led Senate on Tuesday delivered a rare bipartisan rebuke of President Trump in a vote to terminate the emergency powers he has used to set tariffs on Brazil, part of a larger push to rein in the administration's efforts to install trade barriers.   By a vote of 52 to 48, the Senate approved a measure that would roll back the 50% tariffs on Brazil imposed by President Trump in July. Five Republicans joined with Democrats to pass it: Susan Collins of Maine, Alaska's Lisa Murkowski, Thom Tillis of North Carolina and Kentucky's Mitch McConnell and Rand Paul.   \n   The success of the resolution, which needed just a simple majority to pass, may only prove symbolic. Speaker Mike Johnson, R-La., is unlikely to bring the measure up for a vote in the House, and even if he did President Trump would almost certainly veto it.   Still, the vote marked a test of support for the president's tariff policies among Republicans, reflecting unease inside the party about their impacts on the U.S. economy, and specifically the farming and manufacturing sectors. It came ahead of arguments at the Supreme Court this fall in a case challenging Trump's authority to put sweeping tariffs in place using emergency powers.   \n   Tuesday's vote was the first of three planned by Democrats and a handful of Republicans aimed at rolling back the president's tariff policies. Later this week, the Senate is expected to take up similar votes to reverse tariffs on Canada and other nations.   One of the lawmakers behind the push is Sen. Tim Kaine, D-Va., the lead sponsor of the measure approved Tuesday. Ahead of the vote, Kaine told reporters the effort highlights the tariffs' stark impacts on the U.S. economy in recent months.   \"They're about the economic destruction of tariffs, but they are also really about how much will we let a president get away with?\" Kaine asked. \"Do my colleagues have a gag reflex or not, in terms of powers that constitutionally are handed to Congress?\"   \n   The five Republicans who broke ranks did so despite a last minute lobbying push by Vice President JD Vance, who met with Senate Republicans on Capitol Hill on Tuesday and urged them to back the president's policies. Vance told reporters after the lunch meeting that the tariffs are critical leverage for Trump in international negotiations.   To block the president's emergency powers to set tariffs, \"is to strip that incredible leverage from the president of the United States,\" Vance told reporters outside the meeting room near the Senate chamber. \"I think it's a huge mistake, and I know most of the people in there agree with me.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President JD Vance talks with reporters after attending the weekly Senate Republican policy lunch on Tuesday. Vance told reporters that tariffs are a critical source of leverage for President Trump on the international stage.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   The vote took place as President Trump is in Asia for a multi-nation trip where trade talks are a top focus.   Sen. Josh Hawley, R-Mo., said Vance told Republicans that Trump is essentially on a trade mission.   \"It's successful, and it's bringing in a lot of revenue,\" Hawley said about the trip as he explained his opposition to the measure. \"I'm supportive of the president's tariff policy.\"   \n   Not all Republicans were convinced. Tillis said after the meeting he would vote to limit the tariffs.   \"I just don't think there's a rational basis for it,\" Tillis said. \"If you start allowing that … that creates a big uncertainty in the business community.\"   Trump triggered the Brazil tariffs this summer to pressure the country's government to end what he called a \"witch hunt\" against his ally, former far-right Brazilian President Jair Bolsonaro. Last month, Bolsonaro was sentenced to 27 years in prison for attempting a coup to stay in power following his 2022 election defeat.   The vote wasn't the first time Senate Republicans have broken with Trump on tariffs. In April, a measure to block tariffs on Canada drew a simple majority of the Republican-led Senate as a handful of G.O.P senators joined Democrats to push the measure across the finish line. Kaine and Paul co-sponsored the measure, and McConnell, Collins and Murkowski voted in favor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg"
      ],
      "datePublished": "2025-10-28T23:47:12.000Z",
      "dateModified": "2025-10-28T23:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump flirts with running for an unconstitutional third term — again",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5587822/president-trump-flirts-with-running-for-an-unconstitutional-third-term-again",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-29T08:40:37.000Z",
    "description": "\n      President Trump mentioned again this week the possibility of running for a third term. Doing so would be unconstitutional, so why does the pres",
    "body": "\n      President Trump mentioned again this week the possibility of running for a third term. Doing so would be unconstitutional, so why does the president keep floating the idea?   \n\n    MICHEL MARTIN, HOST:  President Trump keeps flirting with the idea of serving a third term in office. Here he is last night on Air Force One.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Based on what I read, I guess I'm not allowed to run. So we'll see what happens.MARTIN: The 22nd Amendment to the Constitution clearly states, no person shall be elected to the office of the president more than twice. So why is Trump talking about it again? NPR senior White House correspondent Tamara Keith digs in.TAMARA KEITH, BYLINE: This week's outbreak of Trump 2028 mania began when Trump ally and MAGA mastermind Steve Bannon sat down for an interview with The Economist.(SOUNDBITE OF ARCHIVED RECORDING)STEVE BANNON: Well, he's going to get a third term. So Trump '28. Trump is going to be president in '28, and people just ought to get accommodated with that.KEITH: Asked about the 22nd Amendment, he said there are many different alternatives, but he didn't detail them. Bannon said nearly the same thing back in April in an interview with MORNING EDITION host Steve Inskeep.(SOUNDBITE OF ARCHIVED NPR CONTENT)BANNON: We're working on some things that are well withinside the Constitution, and it'll be very - I think people will agree that'll be...STEVE INSKEEP: Give me an example.BANNON: ...Very smart workarounds.INSKEEP: Give me an example of one thing.BANNON: I don't want to whet your appetite. Let's get through...INSKEEP: (Laughter).BANNON: ...Let's get through the hundred days.INSKEEP: You've already whetted my appetite.BANNON: Let's get through - no, because it's exploding liberals' heads, progressive heads that Trump's going to be with them forever.KEITH: Now, it would be easy to chalk this up as Bannon stirring the pot, but President Trump himself has kept it going. Here he was on Air Force One, Monday morning.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: I would love to do it. I have my best numbers ever. It's very terrible. I have my best numbers. If you read it...UNIDENTIFIED REPORTER: You're not ruling out a third term?TRUMP: ...If you read it - am I not ruling it out? You'll have to tell me. All I can tell you is...KEITH: He did bat down the idea of running for vice president and then assuming the presidency. But just like Bannon, Trump leaves the possibility of a third term dangling out there. Here he was back in March, again, on Air Force One.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: I'm just telling you, I've had more people say, please run again. I said, we have a long way to go before we even think about that.KEITH: I followed up, asking, are you planning to leave office on January 20, 2029, or are you saying you might not? He looked directly at me and then looked over my head.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: Go ahead. Any other questions?KEITH: The president stocks red Trump 2028 hats on a bookcase of merch just outside the Oval Office. Last month, when Democratic leaders visited to talk about averting the government shutdown, the hats showed up on the president's desk, as House Minority Leader Hakeem Jeffries told CNN.(SOUNDBITE OF ARCHIVED RECORDING)HAKEEM JEFFRIES: It was the strangest thing ever. And I just looked at the hat, looked at JD Vance, who was seated to my left, and said, don't you got a problem with this? And he said, no comment.KEITH: Yesterday, House Speaker Mike Johnson said he didn't see a path to a third Trump term.(SOUNDBITE OF ARCHIVED RECORDING)MIKE JOHNSON: I think the president knows - and he and I have talked about the constrictions of the Constitution, as much as so many of the American people lament that - the Trump 2028 cap is one of the most popular that's ever been produced, and he has a good time with that.KEITH: So is it all just a troll? Brendan Nyhan is a professor of government at Dartmouth College.BRENDAN NYHAN: We're probably going to hear about this for the next three years because he enjoys it. It gets the kind of reaction he wants, and it serves his political purpose.KEITH: Trump is both making liberals' heads explode, as Bannon put it, and trying to delay becoming a lame duck president - less relevant than those competing to replace him. Again, Nyhan.NYHAN: It's profoundly destabilizing to call into question something as blatant as the 22nd Amendment, which explicitly rules out what Trump is, quote, \"joking\" about. And we've seen again and again him joking about things that he means to encourage or at least, you know, seem to give tacit approval to.KEITH: In his second term, Trump has massively expanded his executive power as Republicans in Congress either cheer or shrug. But Rick Hasen, an election law expert at UCLA, says, there's no nuance in the 22nd Amendment.RICK HASEN: Is it possible that he could try to suspend elections, suspend the Constitution, run for a third term? All of these things are possible, but that means we're no longer the American democracy that we've had, and then the country's in real trouble. But if you're asking about a legal path to a third term, it's just not there.KEITH: Plus, he asks, would President Trump really want to run against former President Barack Obama?Tamara Keith, NPR News.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump flirts with running for an unconstitutional third term — again",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-29T08:40:37.000Z",
      "dateModified": "2025-10-29T08:40:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'The helpers need help'. Food banks brace for impact as SNAP cliff looms.",
    "url": "https://www.npr.org/2025/10/29/g-s1-95401/the-helpers-need-help-food-banks-brace-for-impact-as-snap-cliff-looms",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+180/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2F18%2F700fab3f4f46a37c5cfed3d2b144%2Ffood-bank-2.jpg",
    "tag": "Politics",
    "date": "2025-10-29T19:02:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mary Ann Edwards takes stock of inventor",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mary Ann Edwards takes stock of inventory at the Llano Food Pantry in central Texas on October 23, 2025. She said the pantry has seen increased need because of rising costs of goods over the last year. With SNAP benefits set to halt barring Congressional intervention, she expects to see \"a bunch of new people coming in.\"\n                \n                    Barbara Sprunt/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Barbara Sprunt/NPR\n    \n\n   \n   Chris Jones and Mary Ann Edwards have been volunteering at the Llano Food Pantry in central Texas for several years. It's a tight-knit group, where food recipients gather early to chat outside, and community members contribute their own produce.   \"The ladies all come in and go, 'guess what I did with those plums I got last time?' We share recipes, we talk and it's like a big family,\" Edwards said.   Four years ago, the pantry was receiving 15-20 people each week. Now, they say, the number is about a hundred clients every week.   \"Right now — and we've been doing this for a while — we limit canned goods,\" said Jones. \"We didn't have to do that in the beginning because we didn't have that many people coming through.\"   \n   They said the past year has been tough for families, with rising food costs.   \"I think the telltale is that every time we're opening, we are getting new clients — maybe one, maybe two, maybe three,\" said Edwards. \"Just a steady increase. They come in, they're embarrassed — 'I never thought I would be in this position.' You know, a lot of people are in the same position you're in, and that's why we're here.\"   Their clientele is mainly young families, people with disabilities and the elderly. They said they don't see a lot of people who also receive Supplemental Nutrition Assistance Program benefits.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mary Ann Edwards (L) and Chris Jones (R) have been volunteering at the Llano food pantry in central Texas for years. They describe seeing an uptick from 15-20 people each week to over a hundred clients every week.\n                \n                    Barbara Sprunt/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Barbara Sprunt/NPR\n    \n\n   \n   \"That's not saying that when that goes away, we're not going to get a bunch of new people coming in,\" mused Edwards.   SNAP is a mandatory entitlement program that provides food aid to about 1 in 8 U.S. residents. It is the country's largest nutrition assistance program. Congressionally-approved appropriations provide the roughly $8 billion a month needed to fund the program. With the U.S. Senate repeatedly failing to get enough votes to fund the government and end the shutdown, nearly 42 million people are in danger of losing those benefits come Nov. 1.   Jones said they'll have to take it one week at a time.   \n   \"If we need to, we'll do a fundraiser,\" she said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Anthony Bryant, a volunteer with Feeding South Florida, prepares food items to give to government workers on October 28, 2025 in Dania Beach, Florida. As the government shutdown nears four weeks, Feeding America and its members have been launching food distribution sites for people affected by the government shutdown.\n                \n                    Joe Raedle/Getty Images/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images/Getty Images North America\n    \n\n   \n   'Catastrophic need for food'   The Llano pantry is part of the Central Texas Food Bank, which has been ramping up distributions in the midst of the government shutdown, including for active duty military personnel and civilian federal employees like TSA agents.   \"We've been saying that although the government has shut down, the Central Texas Food Bank is open and that means we will do everything we can to step up and meet the demand for increased need of our services,\" said CEO Sari Vatske.   But Vatske cautioned that food banks alone cannot make up for what would be lost for residents if SNAP were to disappear.   \"The average household that we see receives about $350 per month, which roughly translates to about $44 million worth of SNAP benefits that will be gone from families,\" she told NPR. \"There is no way that we alone can make up for a $44 million food budget shortfall.\"   She said shutdowns aren't like other food crises.   \"When you see natural disasters, they tend to be isolated, whether it's an ice storm or a flood. But the thing with the government shutdown is that it's manmade and we are all experiencing it,\" Vatske said. \"So in a situation during a natural disaster where we could rely on our sister food banks for support, with this government shutdown, we are all experiencing the same need. So we implore the government to reopen and we are asking the community to step up now more than ever.\"   Vatske said seeing the increasing demand and knowing benefits might be taken away adds to the toll food bank volunteers and staffers face.   \"The thing that motivates food bankers is knowing that we are a beacon of light in an otherwise dark place,\" she said. \"We're really at a point that the helpers need help.\"   \n   Jason Riggs, the director of advocacy and public policy at Roadrunner Food Bank of New Mexico, began working at the food bank during the Great Recession.   \"The absolute worst part of working at a food bank is when you gotta tell people, 'that's all we got today. We're out.' And you know you can't send them anywhere because they're going to be out, too,\" he said. \"Now, don't get me wrong, it's far worse for the people waiting in that line. But, I worry about my co-workers.\"   If SNAP benefits are gone for November, Riggs said it will be a \"public health crisis.\" He compared it to the recession 17 years ago and the start of the COVID-19 pandemic.   \"This is a huge increase in need, but that's where comparisons end,\" he told NPR. \"Those two previous national crises, when that happened, there was a robust SNAP program, with all its flaws, doing what it is designed to do. And that's the difference with what's happening right now — there will not be SNAP. There will just be the same kind of catastrophic need for food.\"   New Mexico has about 21 percent of its population participate in SNAP, the highest rate in the country, according to the U.S. Department of Agriculture's statistics from earlier this year.   \"It's very difficult. It's not like we were holding back before,\" Riggs said. \"Then this crisis comes in and it's very daunting. SNAP can provide nine times the amount of meals as the entire nationwide food bank network. There's no business in the country, no corporation that could grow nine times its size or capacity in one year, let alone by Nov. 1.\"   With the impasse on Capitol Hill growing seemingly deeper the longer the shutdown continues, individual states are investigating what they can offer to help bridge the food assistance gap.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Josh Hawley (R-MO) speaks to reporters during a vote at the Capitol on October 27. Hawley introduced a bill that would provide appropriations for the Department of Agriculture to provide SNAP benefits during any lapse because of the shutdown.\n                \n                    Anna Moneymaker/Getty Images/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images/Getty Images North America\n    \n\n   \n   Political fallout   Missouri Sen. Josh Hawley, a Republican, has introduced a bill that would provide appropriations for the Department of Agriculture to provide SNAP benefits during any lapse because of the shutdown. That bill currently has ten GOP co-sponsors and one Democratic co-sponsor, Peter Welch of Vermont. There's no commitment from leadership to bring it up for a vote, yet.   \n   Even if the government acts before Nov. 1, it will likely take at least a few days to get SNAP benefits distributed to states, and then onto debit-like cards that recipients use to purchase food.   In the meantime, more than two dozen Democratic attorneys general and three Democratic governors are suing the Trump administration over the suspension of food benefits.   As the shutdown drags on, both parties seem convinced they will receive less of the public blame.   But Rich Thau, president of Engagious, a firm specializing in public policy message testing, said what he's hearing from the public is \"a pox on both your houses.\"   As part of his swing voter project, Thau talks monthly with voters in key swing states who swung from former President Joe Biden to President Trump. In a recent focus group in Pennsylvania, Thau said nine of the 13 participants blamed both parties equally for the shutdown.   \"When I turn the news on, I hear, 'the Republicans are blaming the Democrats. The Democrats are blaming the Republicans,'\" said Brenda S., 60, a participant from Philadelphia, PA whose last name was not provided in the focus group setting, as is common practice for these surveys. \"It's both of their faults. They don't care about us.\"   The SNAP cliff represents one of the biggest impacts of the shutdown, which has been marked by the White House attempting to stave off some of the traditional shutdown pain points, like paychecks for servicemembers.   If SNAP benefits are delayed for the month of November, Thau said he does not know which party is more able to build a compelling narrative about why lawmakers couldn't reach a deal and fund the government.   \"Who's going to sound more persuasive to someone when it comes to who's to blame for this?\" he told NPR. \"If you're a member of Congress, you don't want your constituents starving because you can't reopen the government. But by the same token, if you think that this is a winnable fight and you're in no rush to reopen the government because somehow you think your side is winning — and if both sides feel that way — the inertia will continue.\"   \n   He added: \"I imagine each side has some strategy that causes them to think the other side is going to blink first. But they're playing with fire.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'The helpers need help'. Food banks brace for impact as SNAP cliff looms.",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+180/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa8%2F18%2F700fab3f4f46a37c5cfed3d2b144%2Ffood-bank-2.jpg"
      ],
      "datePublished": "2025-10-29T19:02:21.000Z",
      "dateModified": "2025-10-29T19:02:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5589702/north-korea-missile-tests-trump-south-korea",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+260/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2F22%2F547355c948dea28e8dbbf85daac5%2Fap25301821881000.jpg",
    "tag": "Politics",
    "date": "2025-10-29T05:45:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This photo provided by North Korean gove",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This photo provided by North Korean government shows what it says a test of a sea-to-surface cruise missile at an undisclosed place in North Korea, Tuesday, Oct. 28, 2025. Independent journalists were not given access to cover the event depicted in this image distributed by the North Korean government. The content of this image is as provided and cannot be independently verified. Korean language watermark on image as provided by source reads: \"KCNA\" which is the abbreviation for Korean Central News Agency.\n                \n                    KCNA via KNS/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        KCNA via KNS/AP\n    \n\n   \n   SEOUL, South Korea — North Korea said Wednesday its recent test-firings of sea-to-surface cruise missiles were successful, in another display of its growing military capabilities as U.S. President Donald Trump visits South Korea.   North Korea's official Korean Central News Agency said the missiles fired Tuesday flew for more than two hours before accurately striking targets in its western waters. It said the weapons would contribute to expanding the operational sphere of the country's nuclear-armed military.   \n   South Korea's Joint Chiefs of Staff said the military had detected the North Korean launch preparations and that the cruise missiles were fired in the North's northwestern waters at around 3 p.m. Tuesday. The joint chiefs said South Korea and the United States were analyzing the weapons and maintaining a combined defense readiness capable of a \"dominant response\" against any North Korean provocation.   The North Korean report came hours before an expected summit between Trump and South Korean President Lee Jae Myung in the city of Gyeongju, where South Korea is hosting this year's Asia-Pacific Economic Cooperation meetings.   Speaking with reporters aboard Air Force One en route from Japan to South Korea, Trump downplayed the North Korean launches.   \"He's been launching missiles for decades, right?\" he said, apparently referring to Kim Jong Un. Trump reiterated he still wants to meet with Kim, whom he met three times in 2018 and 2019 before their diplomacy derailed over disagreements on U.S.-led sanctions against the North.   \"We had a really good understanding of each other,\" Trump said.   \n   KCNA said the tests were attended by senior military official Pak Jong Chon, who also inspected training for sailors aboard North Korea's newly developed destroyers Choe Hyon and Kang Kon, which leader Kim Jong Un has described as key assets in his efforts to strengthen the navy.   North Korea's latest launches followed short-range ballistic missile tests last week that it said involved a new hypersonic system designed to strengthen its nuclear war deterrent.   During his South Korean visit, Trump is scheduled to meet with Chinese President Xi Jinping. However, South Korean officials have said a Trump–Kim meeting is unlikely.   \n   North Korea has shunned any form of talks with Washington and Seoul since Kim's high-stakes nuclear diplomacy with Trump fell apart in 2019 during the American president's first term.   Kim's top foreign policy priority is now Russia. In recent months, he has sent thousands of troops and large quantities of military equipment to help fuel President Vladimir Putin's war in Ukraine, while embracing the idea of a \"new Cold War\" and positions his country as part of a united front against the U.S.-led West.   Last month, Kim reiterated he wouldn't return to talks with the United States unless Washington drops its demand for North Korea's denuclearization, after Trump repeatedly expressed his hopes for new diplomacy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Korea touts missile tests as Trump visits South Korea",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+260/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2F22%2F547355c948dea28e8dbbf85daac5%2Fap25301821881000.jpg"
      ],
      "datePublished": "2025-10-29T05:45:40.000Z",
      "dateModified": "2025-10-29T05:45:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Camouflaging cars and swapping license plates: How agents make immigration arrests",
    "url": "https://www.npr.org/2025/10/29/g-s1-95373/immigration-arrests-license-plates-conceal-federal-agents",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5280x2970+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F88%2F76%2Faf13cb344ca49659939bd1dfaeb1%2Fdiptych-3.jpg",
    "tag": "Politics",
    "date": "2025-10-29T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Over the past year, many federal law enf",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Over the past year, many federal law enforcement agents conducting immigration arrests have been concealing their faces under masks and vehicles being used in what appear to be immigration-related arrests do not have license plates.\n                \n                    Getty Images, Tik tok, Eyes Up\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Getty Images, Tik tok, Eyes Up\n    \n\n   \n   In a video shared on TikTok in September, a masked man in a tactical vest runs across a street in Chicago toward a Ford SUV. More people in tactical police vests get inside the vehicle, as an angry crowd forms around it, yelling profanities.   \"You guys are separating families,\" one woman shouts at the car, which is flashing red and blue lights. \"And for what?\"   The woman tells others not to come near the area because \"la migra\" is there, which is how some Spanish speakers refer to U.S. immigration authorities. But there is little to reveal whether the Ford belongs to U.S. Immigration and Customs Enforcement (ICE), the U.S. Department of Homeland Security (DHS) agency that is leading President Trump's push for mass arrests and deportations of those suspected of being in the U.S. without legal status, or any other federal unit tasked with carrying out immigration-related arrests. The car has no license plates on the back and appears to have no words on the side that indicate it is government property.   \n   Over the past year, many federal law enforcement agents conducting immigration arrests have been concealing their faces under masks and gaiters when making arrests in public, in what DHS says is an effort to avoid doxing, or publishing agents' personal information online. Dozens of pending proposals across the country now seek to ban masking of federal policing authorities in public places.   \n   Less public attention has centered on the masking of agents' cars.   But some vehicles being used in what appear to be immigration-related arrests do not have license plates, or have traded license plates, NPR found in a review of videos shot by bystanders and reporters, and those circulating on social media. The videos appear to come from areas where the administration has focused its immigration enforcement across the country, including Illinois, California and Washington state.   Witnesses and activists have alleged similar behavior concerning license plates in court filings and in media reports, while the Illinois Secretary of State, a Democrat, has condemned the apparent trading of license plates as illegal in his state.   NPR sent several requests for comment to ICE citing the specific photos and videos that appear to show license plate removal or manipulation during immigration enforcement operations. The department did not respond to the specific examples.   \n   Immigration advocates say that as the agency increases its presence across the country thanks to an infusion of cash from Congress, untraceable vehicles may add to confusion over what tactics immigration officers can or should be using, and could prevent people from holding officers accountable.   \n   \"Most people are not used to interacting with federal law enforcement on our streets,\" said Bruno Huizar, policy manager at the California Immigrant Policy Center. Not knowing the identity of law enforcement – or not knowing if the enforcement is legitimate – exacerbates lack of trust in police, and makes it harder for people to defend their legal rights, he said.   Officers who appeared to be conducting immigration arrests in unmarked vehicles were captured on videos shot across the country and shared online on platforms like TikTok, Instagram and Eyes Up, an application that tracks where federal agents have arrested migrants. NPR reviewed all videos cited in this story and confirmed the dates of the videos and locations of law enforcement presence and bystanders when possible. When details couldn't be verified, NPR corroborated information with immigration experts, activists, and a developer for an app that documents confrontations with federal agents.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                File image from May 7, 2025 in Newark, N.J., shows a badge hanging over the uniform of an Immigration and Customs Enforcement (ICE) agent.\n                \n                    Timothy A. Clary/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Timothy A. Clary/AFP via Getty Images\n    \n\n   \n   In a video shared in June that takes place in Washington state, a federal agent in a police vest is seen driving a black Ford SUV with no license plate on the back of the vehicle.   And in another video posted on the Eyes Up app, labeled as shot in July in a Los Angeles suburb, a blue Nissan is seen with a placard on the back of the car that reads \"Lexus of Valencia\" in the space where a license plate is usually placed. The vehicle is seen parked near others that federal agents were seen using while detaining a person.   NPR asked ICE to confirm whether these vehicles and others like them belonged to federal employees working for the agency. The agency did not respond.   \n   In an earlier statement provided in response to questions about the vehicle with the \"Lexus of Valencia\" placard, ICE spokesperson Mike Alvarez told NPR in a statement that ICE officers and agents do not use personal or rental vehicles while conducting immigration enforcement operations.   \"Further, per federal code, federal law enforcement agency vehicles used primarily for investigative, law enforcement, intelligence, or security duties are exempt from displaying U.S. Government license plates or motor vehicle identification when such identification would interfere with these critical duties,\" Alvarez said.   \n   Appearing \"like a ghost\"   It used to be rare for ICE employees to drive cars without plates when conducting arrests, said Darius Reeves, a former Baltimore field office director for ICE Enforcement and Removal Operations. He left the agency this year.   \"The agency clearly wants to appear like a ghost,\" Reeves said. \"I have never experienced this.\"   The federal code, or regulation, that Alvarez cited requires that vehicles used by government employees display government license plates on the front and rear of the vehicle – except when identifying these cars would interfere with investigative, law enforcement, intelligence, or security duties.   Federal regulation also prohibits swapping license plates from one car to another.   But ICE guidelines for agents on managing vehicle fleets indicate that operating a vehicle without license plates is meant to be the exception, not the rule.   \"All ICE owned, or leased motor vehicles must display DHS or [General Services Administration] license plates, unless exempted,\" the guidelines state. To operate a vehicle without a federal license plate, someone must submit a request for a waiver to the unit that manages ICE's fleet, according to the guidelines.   \n   In August, NPR requested to review all license plate waivers submitted by ICE over the previous year. At the time of publication, ICE had not provided the documents to reporters, though according to the federal Freedom of Information Act, the agency should have provided them by September.   An automatic email message received this month stated all federal records offices would not communicate with reporters about records until the end of the \"funding hiatus,\" referring to the shutdown of the federal government that began on October 1.   \n   Alvarez, the ICE spokesperson, did not respond to a question from NPR about how many times employees had submitted waivers to operate vehicles without a license plate.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal agent, center, walks to his vehicle outside an ICE processing facility in the Chicago suburb of Broadview, Ill., on Oct. 21, 2025.\n                \n                    Nam Y. Huh/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nam Y. Huh/AP\n    \n\n   \n   Removing and swapping license plates   Some states prohibit swapping license plates on vehicles. But photos taken by activists and a video shared to social media suggest federal agents are doing this anyway in Illinois and California.   A video posted to a TikTok account in October shows a man dressed like a federal agent who said that changing license plates on vehicles was standard practice.   \"We change the plates out every day,\" says in the video, which was described by the poster as having taken place in Round Lake, Ill., as he walks around an otherwise unmarked black Jeep SUV with an Illinois license plate.   On Oct. 22, Illinois Secretary of State Alexi Giannoulias posted the video to X, stating that Illinois had \"zero tolerance for this type of illegal activity.\"   \"Flipping license plates or altering them in any way to avoid detection is strictly prohibited in Illinois,\" said Giannoulias in the video, urging residents to report similar violations to a hotline. \"No one, including a federal agent, is above the law.\"   Alvarez, the ICE spokesperson, identified the officers in that video as Border Patrol. A separate agency inside DHS that has been involved with immigration enforcement, Border Patrol has been among the agencies tasked with conducting immigration-related arrests, particularly in cities like Chicago in recent weeks. Customs and Border Protection, the branch of DHS it is housed within, did not respond to a request for comment from NPR asking about their practice of switching license plates.   \n   Activists for the Harbor Area Peace Patrol, a community group based in Los Angeles, Calif., have said they also noticed behavior that seems to contradict state guidelines about license plates.   Since June, the activists say, they have monitored federal agents almost every day as they leave Terminal Island, an artificial island in southern Los Angeles that has been used as a staging area for agents before they arrest migrants and conduct raids throughout the city. More than once, activists documented people on Terminal Island, a part of LA, removing plates from vehicles.   \n   \"We've seen that multiple times,\" said Elijah Chiland, an activist with the group.   Activists said they have additionally noticed that sometimes, federal agents left the staging area in the same car, but with different license plates on the vehicle than the car had on a previous day. And multiple times, the activists said, they noticed something else: Vehicles departing from Terminal Island were spotted with one license plate on the front and a different plate on the back.   \"I've seen seven or eight different times that a car had a license plate that it didn't originally have,\" said Victor Maldonado, another of the group's activists. ICE did not respond to NPR questions about the allegations of license plate-switching near Terminal Island.   Mexican markings in Washington and Illinois   Some videos shared online appear to show federal agents making arrests using vehicles marked with Mexican objects or icons.   In the video recorded in Spokane Valley, Wash., where a car without license plates was used, another vehicle drew attention from bystanders. In front of the car without plates, two masked federal agents in tactical vests are seen entering a white Jeep SUV with a back license plate from the Mexican state of Tamaulipas.   \"Tamaulipas on the license plate, can you believe this?\" says a bystander, who can be heard on the audio in the clip.   ICE did not respond to a request for comment asking if this was their vehicle or operation.   A similar tactic was observed in a video that appears to be recorded in Illinois and was shared on TikTok in September. In the video, a man in a tactical police vest marked with the words \"U.S. Border Patrol\" is seen entering a silver Ford Explorer with a large Mexican flag across the hood of the car. Mexican flag stickers are seen stuck to the car's back and side windows.   \n   \"ICE using Mexican flag to target immigrants!!\" read the words typed across the video, shared to TikTok, though it is unclear that anyone working for ICE is in the vehicle.   \n   Another video shared the same day showed multiple men in tactical vests loading into a vehicle with a similar Mexican flag splayed across the hood.   When asked about whether Border Patrol agents were using a vehicle with Mexican flag decals, DHS spokesperson Tricia McLaughlin stated the agency believes its employees are not camouflaging their identities, though she acknowledged agents do wear masks to protect themselves from harm. ICE did not respond.   \"DHS is not going to confirm our vehicles and put an even larger target on our officers' backs,\" McLaughlin said in an emailed statement. U.S. Customs and Border Protection did not respond to questions regarding current CBP policy for markings on cars including painted hoods and stickers.   Multiple agencies, few agency markings on cars   Involvement of other federal agencies in immigration activities further complicates the situation, said Reeves, the former ICE employee.   Employees of the Federal Bureau of Investigation, the Bureau of Alcohol, Tobacco, Firearms and Explosives, the Drug Enforcement Administration, the U.S. Marshals Service and the U.S. Park Police have been involved with arresting migrants. But during arrests, the officers' clothing hasn't appeared to always match the cars they drive, according to media reports and NPR's own reporting.   In one instance, after President Trump deployed the National Guard to patrol D.C. in early August, a group of officers detained two migrants. The officers' clothing indicated some of them worked for the FBI, ATF and U.S. Park Police, reporters observed. One person wore a tactical vest labeled \"police.\" Another wore a tactical vest with no description on it at all. A U.S. Park Police vehicle was the only car visible that was labeled with the name of a law enforcement agency.   \n   Making arrests while operating cars that aren't clearly identified can erode the public's trust in local police, said Daniel Hodges, a police officer with the Metropolitan Police Department of Washington D.C., which has also worked with ICE on immigration arrests in the city. Hodges was attacked during the riot at the U.S. Capitol on Jan. 6, 2021.   \"We've got to live with that destruction of trust after the feds go away,\" said Hodges. \"Ethically and in terms of long-term effectiveness of our police departments, it's only detrimental as far as I can see.\"   \n   David Bier, the director of immigration studies at the libertarian Cato Institute, said that removing or switching license plates can be detrimental for another reason: It helps federal agencies avoid further scrutiny.   \"It removes the opportunity for accountability if you don't know what officers were conducting an operation. There's no way to track back, 'This person was using this vehicle,'\" Bier said. \"It's unclear exactly how they track these actions. So it could genuinely be impossible to ever determine who was involved and in what operation.\"   Bier said not knowing which agency or people are involved in an arrest can make it difficult for Congress or lawyers to investigate specific claims if officers are accused of violating people's rights.   \"Of course, if you're being charged with a crime or being arrested or detained, you have a right to know who is leveling this charge against you, who's claiming that you violated the law,\" Bier said. \"These are all basic principles of liberal democracy that we've just taken for granted.\"   Nick McMillan contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Camouflaging cars and swapping license plates: How agents make immigration arrests",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5280x2970+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F88%2F76%2Faf13cb344ca49659939bd1dfaeb1%2Fdiptych-3.jpg"
      ],
      "datePublished": "2025-10-29T09:00:00.000Z",
      "dateModified": "2025-10-29T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]