[
  {
    "title": "Moulton introduces bill to block federal funds for military action against Venezuela",
    "url": "https://www.npr.org/2025/12/23/nx-s1-5651974/moulton-introduces-bill-to-block-federal-funds-for-military-action-against-venezuela",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-23T11:50:29.000Z",
    "description": "Moulton introduces bill to block federal funds for military action against Venezuela   NPR's Steve Inskeep speaks with Democratic Congressman Seth Mou",
    "body": "Moulton introduces bill to block federal funds for military action against Venezuela   NPR's Steve Inskeep speaks with Democratic Congressman Seth Moulton of Massachusetts, who is sponsoring legislation to prohibit President Trump from using federal dollars to wage war with Venezuela.\n\n\n    \n        Politics\n    \n\n\n                  \n            December 23, 20256:50 AM ET\n         \n      \n\n      \n      Moulton introduces bill to block federal funds for military action against Venezuela\n   \n        \n            Audio will be available later today.\n        \n\n\n\n\n\n      NPR's Steve Inskeep speaks with Democratic Congressman Seth Moulton of Massachusetts, who is sponsoring legislation to prohibit President Trump from using federal dollars to wage war with Venezuela.   \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Moulton introduces bill to block federal funds for military action against Venezuela",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-23T11:50:29.000Z",
      "dateModified": "2025-12-23T11:50:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. strikes another alleged drug-smuggling boat in eastern Pacific",
    "url": "https://www.npr.org/2025/12/23/g-s1-103420/u-s-strikes-another-alleged-drug-smuggling-boat",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3505x1972+0+183/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fff%2Fc3a9116f49f697b0ce9c9b3fab5e%2Fap25356812101411.jpg",
    "tag": "Politics",
    "date": "2025-12-23T07:02:29.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth speaks as",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth speaks as President Donald Trump looks on, at Trump's Mar-a-Lago club, Monday, Dec. 22, 2025, in Palm Beach, Fla.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — The U.S. military said Monday that it had conducted another strike against a boat it said was smuggling drugs in the eastern Pacific Ocean, killing one person.   \n   In a social media post, U.S. Southern Command said, \"Intelligence confirmed the low-profile vessel was transiting along known narco-trafficking routes in the Eastern Pacific and was engaged in narco-trafficking operations.\" Southern Command provided no evidence that the vessel was engaged in drug smuggling.   A video posted by U.S. Southern Command shows splashes of water near one side of the boat. After a second salvo, the rear of the boat catches fire. More splashes engulf the craft and the fire grows. In the final second of the video, the vessel can be seen adrift with a large patch of fire alongside it.   \n   Earlier videos of U.S. boat strikes showed vessels suddenly exploding, suggesting missile strikes. Some strike videos even had visible rocket-like projectiles coming down on the boats.   \n   The Trump administration has said the strikes were meant to stop the flow of drugs into the U.S. and increase pressure on Venezuelan President Nicolás Maduro.   At least 105 people have been killed in 29 known strikes since early September. The strikes have faced scrutiny from U.S. lawmakers and human rights activists, who say the administration has offered scant evidence that its targets are indeed drug smugglers and say the fatal strikes amount to extrajudicial killings.   Meanwhile, the U.S. Coast Guard has stepped up efforts to interdict oil tankers in the Caribbean Sea as part of the Trump administration's escalating campaign against Maduro.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. strikes another alleged drug-smuggling boat in eastern Pacific",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3505x1972+0+183/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fff%2Fc3a9116f49f697b0ce9c9b3fab5e%2Fap25356812101411.jpg"
      ],
      "datePublished": "2025-12-23T07:02:29.000Z",
      "dateModified": "2025-12-23T07:02:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federal judge says U.S. must give due process to deported Venezuelans",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5652187/alien-enemies-act-deportations-case",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5789x3256+0+301/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F32%2F74%2F2b998b3b408c972a527bd9330c77%2Fgettyimages-2253176450.jpg",
    "tag": "Politics",
    "date": "2025-12-22T23:18:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A prison guard mans an interior perimete",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A prison guard mans an interior perimeter at the CECOT (Counter Terrorism Confinement Center) on Dec.15, 2025 in Tecoluca, El Salvador. CECOT gained notoriety in 2025 when the Trump administration began its controversial policy of deporting people to El Salvador who they claimed were members of the Venezuelan gang Tren De Aragua.\n                \n                    John Moore/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        John Moore/Getty Images\n    \n\n   \n   A federal judge on Monday said the U.S. government denied due process to the Venezuelan men it deported to a prison in El Salvador in March after President Trump invoked the Alien Enemies Act.   The case over the Alien Enemies Act first brought into focus critiques about the Trump administration's lack of due process in its immigration policy.   The American Civil Liberties Union and Democracy Forward challenged the deportation of the Venezuelans, saying the Alien Enemies Act was invoked illegally and that the men should have been given the opportunity to argue against their removal.   \n   Chief Judge James Boasberg of the U.S. District Court for the District of Columbia in his order agreed that they deserved the right to a hearing — whether by bringing them back to the U.S. or allowing them to pursue legal remedies from abroad.   \n   \"On the merits, the Court concludes that this class was denied their due-process rights and will thus require the Government to facilitate their ability to obtain such hearing. Our law requires no less,\" Boasberg wrote in his opinion.   The Trump administration is likely to appeal.   President Trump around March 15 invoked the 1798 Alien Enemies Act to target members of Tren de Aragua, a Venezuelan prison gang he said was invading the United States. The government sent several planeloads of alleged gang members to El Salvador immediately after invoking the act, including 137 people under the statute, the White House said at the time. (The men have since been returned to Venezuela as part of a prisoner exchange.)    \n   Boasberg imposed a temporary restraining order barring deportations that same evening — but the planes still arrived in El Salvador. The Justice Department argued that the judge had overstepped his authority by inserting himself into questions of foreign policy.   \"This ruling makes clear the government can't just send people off to a brutal foreign prison with zero due process and simply walk away,\" said ACLU attorney Lee Gelernt, lead counsel in the case.   \"Meaningful opportunity\" to make their case   Boasberg in Monday's order said the U.S. maintained custody over the men while they were imprisoned at a notorious prison in El Salvador, so the court continued to have jurisdiction over their fate. He gave the administration until January 5 to either \"facilitate\" their return to the U.S., or \"to otherwise provide them with hearings that satisfy the requirements of due process.\"   \n   He said regardless of whether Trump was lawful in invoking the Alien Enemies Act, the men deserved to have a \"meaningful opportunity\" to prove they weren't gang members before being deported.   \"Otherwise, a finding of unlawful removal would be meaningless for Plaintiffs, who have already been sent back to Venezuela against their wishes and without due process,\" he said. \"Expedited removal cannot be allowed to render this relief toothless,\" Boasberg said, otherwise there would be nothing to stop the government from \"secretly spiriting\" people to a foreign country.   Boasberg also certified the group of people removed on March 15 as a class, meaning the Venezuelans who brought the case as plaintiffs could represent the entire group of men removed.   Separately, Boasberg had in July said there was \"probable cause\" to find the Trump administration in criminal contempt for violating his order to stop the planes going to El Salvador in the first place. An appeals court stepped in earlier this month to put a pause on that issue until at least the new year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federal judge says U.S. must give due process to deported Venezuelans",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5789x3256+0+301/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F32%2F74%2F2b998b3b408c972a527bd9330c77%2Fgettyimages-2253176450.jpg"
      ],
      "datePublished": "2025-12-22T23:18:12.000Z",
      "dateModified": "2025-12-22T23:18:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican strategist talks about the current state of the party",
    "url": "https://www.npr.org/2025/12/23/nx-s1-5652157/republican-strategist-talks-about-the-current-state-of-the-party",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-23T09:43:34.000Z",
    "description": "\n      \n      Republican strategist talks about the current state of the party\n    \n        \n                Download\n                \n               ",
    "body": "\n      \n      Republican strategist talks about the current state of the party\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5652157/nx-s1-9583226\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep speaks with veteran Republican strategist Marc Short about the current state of the GOP and its emerging leaders.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican strategist talks about the current state of the party",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-23T09:43:34.000Z",
      "dateModified": "2025-12-23T09:43:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Congress is in a coma': Former members sound alarm on health of the House",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5648858/congress-is-in-a-coma-former-members-sound-alarm-on-health-of-the-house",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-22T21:15:58.000Z",
    "description": "\n      Congress ends the year with a thin list of legislative accomplishments and a growing number of retirements. Former lawmakers say the problems n",
    "body": "\n      Congress ends the year with a thin list of legislative accomplishments and a growing number of retirements. Former lawmakers say the problems now plaguing Capitol Hill have been years in the making.   \n\n    JUANA SUMMERS, HOST:  A record number of lawmakers are calling it quits ahead of the midterm elections next year. More than 40 people in the House won't be running for reelection in their current seats, but more than a dozen former members from both parties told NPR congressional correspondent Barbara Sprunt that legislative stagnation and low morale aren't new. They've been building over time.BARBARA SPRUNT, BYLINE: Democrat Jim Cooper of Tennessee has seen Congress go through a lot. He was first elected during the Reagan administration and retired two years ago. And he has a pretty blunt diagnosis for the House.JIM COOPER: Congress is in a coma. It has a pulse but not many brain waves.SPRUNT: And the proof, he says, is a historic 43-day shutdown, where members of the House were sent back home. But Cooper says this is about more than just a shutdown.COOPER: The Constitution intended Congress to be the most important branch of the government. But now Congress is so functionless. It's taken itself out of the game.SPRUNT: He's not alone in that concern. Former members say Congress is not fulfilling its core constitutional duties, like declaring war, power of the purse and oversight of the executive branch. They say executive overreach has been happening over time, but it's gotten worse under President Trump who has gone further than past presidents to usurp congressional power.DANIEL LIPINSKI: I love Congress, and it pains me what has become of it.SPRUNT: That's Daniel Lipinski, an Illinois Democrat. He recently met with current members who said they're upset that the power in Congress is increasingly top down.LIPINSKI: The speaker's office will tell a committee chair this is what we want to see in this bill. This is what we don't want in this bill. And there's just a lot of frustration over that amongst members 'cause they know that's where they can have an impact. And if the committees aren't working, then they don't have an opportunity to be a legislator.SPRUNT: Wisconsin Republican Reid Ribble agrees.REID RIBBLE: Being a member of the House of Representatives today is more like an honorary position with no actual authority whatsoever.SPRUNT: Because of Senate budget rules, increasingly, the majority party tries to cram as much of its agenda into big bills. And if a measure isn't in it, it's hard for it to succeed later. And Ribble says, in the meantime, the House just votes on other bills they know have no real future.RIBBLE: I got tired of just voting on a bunch of messaging bills that were never going to be taken up by the Senate, that were all pretend.SPRUNT: Members say the job has a personal toll, too. Here's Fred Upton, a Michigan Republican.FRED UPTON: If you're in a district like mine, 650 miles away from D.C., you're gone half the time. So you're missing you know, birthdays, school events, you know, reading the paper or taking a walk with your spouse.SPRUNT: Michigan Democrat Dan Kildee says there's always been trade-offs.DAN KILDEE: Many of us were willing to do that because we saw a purpose. You know, you can actually feel like, at the end of a week or end of a month, you can look at what you did and see that you made a difference in somebody's life. And it was you making it happen, whereas now, it's much more difficult to see that.SPRUNT: Adding to this are rising threats against lawmakers. The Capitol Police estimates it investigated 14,000 threats against members this year alone. Here's Democrat Cheri Bustos of Illinois.CHERI BUSTOS: Look, my husband was a sheriff of our county. Every time we went out, he was armed. You know, so I had a level of security, at least when I was with my husband, that I didn't have to pay for. But those are the realities of what families have to live with, what elected officials have to live with. And you have to make a decision, you know, are you OK with that?SPRUNT: Democrat Anna Eshoo of California says the rise of threats has tracked with the rise of hyper partisanship, something she says makes the work of Congress even harder.ANNA ESHOO: I got to the point where I wanted to have a conversation with a Republican colleague. When I approached them, I want you to know that I don't view you as my enemy. I mean, isn't that something that I felt like I needed to say that?SPRUNT: Members say it's all of these things combined - the gridlock, the threats, the lack of bipartisanship - that creates an environment that leads to people leaving. But Cooper, the longtime Tennessee Democrat, says despite all these challenges, he still encourages people to run for Congress.COOPER: We need more good people to run, and it takes energy. It takes caring. It takes good ideas for how to fix problems. But our country is worth fixing.SPRUNT: Barbara Sprunt, NPR News.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Congress is in a coma': Former members sound alarm on health of the House",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-22T21:15:58.000Z",
      "dateModified": "2025-12-22T21:15:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump announces plans for new Navy 'battleship' as part of a 'Golden Fleet'",
    "url": "https://www.npr.org/2025/12/22/g-s1-103408/trump-navy-battleship-golden-fleet",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1740x979+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2Fcf%2F97e944104072878e02419a60bce9%2Fap25356849560501.jpg",
    "tag": "Politics",
    "date": "2025-12-23T01:53:28.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump departs after speaking a",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump departs after speaking at his Mar-a-Lago club on Monday in Palm Beach, Fla.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — President Trump has announced a bold plan for the Navy to build a new, large warship that he is calling a \"battleship\" as part of a larger vision to create a \"Golden Fleet.\"   \"They'll be the fastest, the biggest, and by far 100 times more powerful than any battleship ever built,\" Trump claimed during the announcement at his Mar-a-Lago resort in Florida.   According to Trump, the ship, the first of which will be named the USS Defiant, will be longer and larger than the World War II-era Iowa-class battleships and will be armed with hypersonic missiles, nuclear cruise missiles, rail guns, and high-powered lasers — all technologies that are in various stages of development by the Navy.   \n   The announcement comes just a month after the Navy scrapped its plans to build a new, small warship, citing growing delays and cost overruns, deciding instead to go with a modified version of a Coast Guard cutter that was being produced until recently. The sea service has also failed to build its other newly designed ships, like the new Ford-class aircraft carrier and Columbia-class submarines, on time and on budget.   Meanwhile, the Navy has struggled to field some of the technologies Trump says will be aboard the new ship.   The Navy spent hundreds of millions of dollars and more than 15 years trying to field a railgun aboard a ship before finally abandoning the effort in 2021.   Laser technology has seen more success in making its way onto Navy ships in recent years, but its employment is still limited. One system that is designed to blind or disable drone sensors is now aboard eight destroyers after spending eight years in development.   Developing nuclear cruise missile capabilities or deploying them on ships may also violate non-proliferation treaties that the U.S. has signed with Russia.   \n   A U.S. official, who spoke on condition of anonymity to discuss ongoing plans, told The Associated Press that design efforts are now underway for the new ship and construction is planned to begin in the early 2030s.   Both Trump and Navy Secretary John Phelan spoke about the new Trump-class warship as a spiritual successor to the battleships of the 20th century, but historically that term has referred to a very specific type of ship — a large, heavily armored vessel armed with massive guns designed to bombard other ships or targets ashore.   \n   This type of ship was at the height of prominence during World War II, and the largest of the U.S. battleships, the Iowa-class, were roughly 60,000 tons. But after World War II, the battleship's role in modern fleets diminished rapidly in favor of aircraft carriers and long-range missiles. The U.S. Navy did modernize four Iowa-class battleships in the 1980s by adding cruise missiles and anti-ship missiles, along with modern radars, but by the 1990s all four were decommissioned.   According to a newly created website for the \"Golden Fleet,\" this new \"guided missile battleship\" is set to be roughly the same size as Iowa-class battleships but only weigh about half as much, around 35,000 tons, and have far smaller crews — between 650 and 850 sailors.   Its primary weapons will also be missiles, not large naval guns.   \n   Trump has long held strong opinions on specific aspects of the Navy's fleet, sometimes with a view toward keeping older technology instead of modernizing.   During his first term, he unsuccessfully called for the return to steam-powered catapults to launch jets from the Navy's newest aircraft carriers instead of the more modern electromagnetic system.   He has also complained to Phelan about the look of the Navy's destroyers and decried Navy ships being covered in rust.   Phelan told senators at his confirmation hearing that Trump \"has texted me numerous times very late at night, sometimes after one (o'clock) in the morning\" about \"rusty ships or ships in a yard, asking me what am I doing about it.\"   \n   On a visit to a shipyard that was working on the now-canceled Constellation-class frigate in 2020, Trump said he personally changed the design of the ship.   \"I looked at it, I said, 'That's a terrible-looking ship, let's make it beautiful,'\" Trump said at the time.   He said Monday he will have a direct role in designing this new warship as well.   \"The U.S. Navy will lead the design of these ships along with me, because I'm a very aesthetic person,\" Trump said.   \n   Phelan said the new USS Defiant \"will inspire awe and reverence for the American flag whenever it pulls into a foreign port.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump announces plans for new Navy 'battleship' as part of a 'Golden Fleet'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1740x979+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2Fcf%2F97e944104072878e02419a60bce9%2Fap25356849560501.jpg"
      ],
      "datePublished": "2025-12-23T01:53:28.000Z",
      "dateModified": "2025-12-23T01:53:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Immigrants now have fewer legal options to stay in the U.S. under Trump",
    "url": "https://www.npr.org/2025/12/23/g-s1-103001/trump-immigration-deportation-migration-legal-status",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+113/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F76%2F037a4d0f43be87ad56a77a6d58b3%2Fgettyimages-2195125932.jpg",
    "tag": "Politics",
    "date": "2025-12-23T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An immigrant from Venezuela tries in vai",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An immigrant from Venezuela tries in vain to access the CBP One app a day after the second inauguration of President Trump on Jan. 21, 2025, in Nogales, Mexico. The incoming administration shut down the app, which was created by the Biden administration to allow migrants to schedule appointments to gain entry into the United States.\n                \n                    John Moore/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        John Moore/Getty Images\n    \n\n   \n   More than 1.6 million immigrants have lost their legal status in the first 11 months of President Trump's presidency. The staggering number includes people who applied for and were accepted to come to the country on a wide variety of immigration parole, visa, asylum and temporary protected status programs. That number exceeds Philadelphia's entire population.   This is the largest effort to take away deportation protections for migrants who are in the country legally. Immigration advocates say it's very likely an undercount.   \"These were legal pathways. People did the thing the government asked them to do, and this government went and preemptively revoked that status,\" said Todd Schulte, president of FWD.us, an immigration advocacy organization that has been tracking the efforts to delegalize immigrants.   \n   \"There's nothing close to this. Like there's no president of either party who has said, 'Central to my effort is revoking the work authorization and legal status for millions of people.'\"   \n   Many of the immigrants who lost legal status have been in the country for years. Now, they fear what could happen should their immigration cases not process quickly enough. The administration has encouraged immigrants to leave the country as it gets rid of their legal authorization.   \"The American taxpayer will no longer bear the financial burden of unlawfully present aliens,\" U.S. Citizenship and Immigration Services spokesperson Matthew Tragesser said, in response to a request for comment about concerns that the administration is making more people deportable.    In another effort to eliminate existing legal pathways, Homeland Security Secretary Kristi Noem announced last week that the Trump administration would be pausing the diversity visa lottery program. In a post on X, she said the man accused of carrying out a deadly shooting at Brown University — and of killing an MIT professor — came to the U.S. through the program in 2017 and was granted a green card. While the cancellation doesn't impact those already in the country, the lottery program faces an uncertain future going forward.   \n   The White House says scrapping prior legal pathways and protections is part of its goal.   \"The Trump administration has done more to limit migration, both illegal and legal, than any administration in history,\" Karoline Leavitt, the White House press secretary, said during a press conference this fall. She touted all the ways the administration has cut off these avenues, including by pausing and revoking visas.   \"Having a visa in the United States is not a right. It is a privilege and the secretary of state — if you are deemed contrary to our country's foreign national interests — has the right to revoke that privilege.\"   A look at canceled programs and permissions   Hours after being inaugurated, Trump signed an executive order slashing a program created by the Biden administration to temporarily allow the entrance of 530,000 migrants from Cuba, Haiti, Nicaragua and Venezuela. The decision to end the program was later upheld by the Supreme Court — paving the way for individuals to be eligible for deportation.   Most of the people who entered the U.S. under this humanitarian parole hail from Haiti. Migrants under the program have pushed against the narrative that they are abusing the system.   \n   Temporary protected status, or TPS, provides deportation protection and grants work permits to people from specific countries affected by war, natural disasters, political instability, or any other condition that makes the country unsafe for its nationals to return to. Each country's designation can last six to 18 months at the discretion of the secretary of homeland security.   Since January, the Homeland Security Department has ended TPS for 10 countries. Here is the breakdown, according to DHS, of how many people were affected:   Loading...\n   The agency moved forward with ending TPS for about 3,800 Syrians, though that effort is currently stalled in court. Lawsuits have also impacted the termination of Venezuela's TPS designation. While the program has been terminated, certain beneficiaries will keep their TPS through October 2026.   The Trump administration argues that parole programs like TPS are meant to be only temporary. But immigration advocates said that while the government can, and has, ended country-specific designations in the past, it typically must prove that conditions in the country have improved.   \n   Schulte, from FWD.us, points to recent comments from Trump denigrating the situation in countries like Afghanistan and Haiti, and actions against Venezuela, as evidence that the U.S. does not consider these countries particularly improved or stable.   With each cancellation, DHS has offered monetary incentives and a 60 days' notice to leave the country. DHS did not respond to questions about how many people have taken them up on the offer of a $1,000 cash payment.   There are several pending lawsuits challenging the terminations of their TPS, and some people may be able to apply for other avenues for protection against deportation.   \n   Eliminating CBP One, others   Another program that the Trump administration ended earlier this year is CBP One, a mobile app that allowed migrants to make appointments to seek asylum from inside the U.S.   From 2023 to January 2025, more than 936,000 people were allowed in the country. It's unknown exactly how many people entered the U.S. through the app and were still waiting on legal permissions when it was canceled.   In the spring, thousands of migrants who had entered the U.S. through the app and awaited asylum appointments received messages to leave. Many who entered with the app ended up getting detained in courthouses or in their neighborhoods.   \n   Grebi Suárez, a Venezuelan barber who entered the U.S. through CBP One in January right before Trump was inaugurated, told NPR that last week he finally received his work permit and Social Security number.   \"But I'm anxious and scared because some of my friends have received emails from the government telling them to self-deport,\" said Suárez, who was featured on an NPR story last year about his attempts to get to the U.S.   \n   The State Department has also assisted the administration's goals of canceling permissions to be in the U.S. This year, 85,000 visas of all categories, including more than 8,000 student visas, have been revoked, according to a State Department official. That is more than double the number the year before.   DUIs, assaults and theft are some of the top reasons why visas were revoked, together accounting for almost half of the revocations in the past year, the official said in a statement.   \"These are people who pose a direct threat to our communities' safety, and we do not want to have them in our country,\" the official said.   Earlier this month, the administration also moved forward with canceling the Family Reunification Parole of 14,000 people, mostly Central and South Americans. The program sought to make it easier for people with family-based petitions to be permitted to be in the U.S. while their immigration processes played out.   \n   Migrants brace for more cancellations in 2026   Several thousand more migrants are at risk of their programs ending next year.   Other TPS permissions that expire next year are for El Salvador, Lebanon, Somalia, Sudan and Yemen. If their programs, along with Ukraine's, get canceled, the U.S. may have no one residing under such a temporary status for the first time since the program was created in 1990.   Ukrainians who came under the Uniting for Ukraine parole program have been concerned their program could be next in line for cancellation. TPS for Ukrainians, which allowed about 100,000 people to enter the U.S., also is set to expire next year unless the administration renews it.   \n   The Trump administration earlier this year paused the Uniting for Ukraine program and later resumed it. The pause affected thousands of Ukrainians, including Viktoriia Panova.   Her work permit expired in February, adding to the anxiety and uncertainty she's felt since the Russian invasion of Ukraine in 2022.   \"Ukrainians, we cannot create any plans for our lives because of this situation,\" Panova told NPR earlier this year. \"We cannot live a full life.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Immigrants now have fewer legal options to stay in the U.S. under Trump",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+113/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F76%2F037a4d0f43be87ad56a77a6d58b3%2Fgettyimages-2195125932.jpg"
      ],
      "datePublished": "2025-12-23T10:00:00.000Z",
      "dateModified": "2025-12-23T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nearly two dozen states sue the Trump administration over funding for CFPB",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5652043/cfpb-trump-russell-vought-lawsuit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8010x4506+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff8%2Fb1%2F8a5049ad435896e922e97eb0f994%2Fgettyimages-2198219205-1.jpg",
    "tag": "Politics",
    "date": "2025-12-22T21:52:45.000Z",
    "description": "\n      \n      22 attorneys general have sued the Trump administration over CFPB funding\n    \n            \n                \n                Transcript\n",
    "body": "\n      \n      22 attorneys general have sued the Trump administration over CFPB funding\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5652043/nx-s1-9582815\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A view of the Consumer Financial Protection Bureau headquarters building in Washington, D.C., on Feb. 10, 2025.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   A coalition of 21 states along with the District of Columbia sued the Trump administration on Monday to prevent it from defunding the Consumer Financial Protection Bureau, which says it will run out of money in a few weeks.   \n   The consumer watchdog agency is funded by the Federal Reserve — unlike many other federal agencies — to insulate it from political whims. But under Acting Director Russell Vought, the CFPB is refusing to accept money from the Fed.    The CFPB argues that the law that established the agency says it must get funding from the Fed's \"combined earnings,\" or profits made by the Fed.  But the Fed doesn't have those earnings, the Trump administration says, because it's paying out more money than it's taking in, or operating at a loss.    \n   The attorneys general suing the administration — and some Democratic lawmakers — reject that argument. They say the CFPB is narrowly defining \"combined earnings\" as profits, whereas lawmakers had intended the term to mean the wider funds — or proceeds — coming into the Fed.   In their suit, filed in the U.S. District Court in Oregon,  the states argue Vought and CFPB are using \"an unreasonable and unlawful interpretation of 'combined earnings.'\" The agency's stance puts the \"CFPB at risk of losing all of its funding as early as January 2026,\" the states argue.   Such a loss of funding would hurt their residents, the attorney generals argue.   In a statement, New York Attorney General Letitia James — who is leading the coalition of states — argues that the CFPB is legally required to \"collect and process consumer complaints and share that complaint data with states,\" which the agency can't do if it isn't funded.    \"Defunding the Consumer Financial Protection Bureau will make it harder to stop predatory lenders, scammers, and other bad actors from taking advantage of New Yorkers,\" James said in the statement.     \"My office and attorneys general across the country rely on the CFPB for consumer complaints and other data to get justice for consumers,\" she added.    \n   Under the Trump administration, much of the CFPB has been gutted, with the agency preventing many of its staff from doing their work. The administration also has tried to fire most of the CFPB's staff, though those attempts have been blocked by the courts.   Since its creation in the aftermath of the 2008 financial crisis, the CFPB has been the target of many conservatives. They argue the agency is too aggressive when it comes to enforcement and that it's not accountable enough to Congress.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nearly two dozen states sue the Trump administration over funding for CFPB",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8010x4506+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff8%2Fb1%2F8a5049ad435896e922e97eb0f994%2Fgettyimages-2198219205-1.jpg"
      ],
      "datePublished": "2025-12-22T21:52:45.000Z",
      "dateModified": "2025-12-22T21:52:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's second term marks a significant departure from his first term, analysts say",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5640005/trumps-second-term-marks-a-significant-departure-from-his-first-term-analysts-say",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-22T22:16:36.000Z",
    "description": "\n      President Trump's first year of foreign policy in his second term surprised many — for a lot of different reasons.   \n\n    JUANA SUMMERS, HOST:",
    "body": "\n      President Trump's first year of foreign policy in his second term surprised many — for a lot of different reasons.   \n\n    JUANA SUMMERS, HOST:  From the first days of his second term, it was clear President Trump had an aggressive approach to how he would wield American power abroad. He's used tariffs as a weapon against allies, secured the release of hostages from Gaza, cozied up to Russian President Vladimir Putin and launched a pressure campaign against the Venezuelan government of Nicolas Maduro. NPR White House correspondent Franco Ordoñez has more on Trump's busy year and how he's reshaped U.S. foreign policy.(SOUNDBITE OF ARCHIVED RECORDING)UNIDENTIFIED PERSON: Ladies and gentlemen, the president-elect of the United States, the Honorable Donald John Trump.FRANCO ORDOÑEZ, BYLINE: On his first days in office, President Trump threatened to take back control of the Panama Canal, seize Greenland and turn Canada into the 51st state - reflections of his fascination with expansionism and foreshadowing his determination to carve up the world between the three major powers.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: America will reclaim its rightful place as the greatest, most powerful, most respected nation on Earth, inspiring the awe and admiration of the entire world. A short time from now, we are going to be changing the name of the Gulf of Mexico to the Gulf of America.ORDOÑEZ: Unlike those who came before him, Trump rarely speaks about America's responsibilities of global leadership. He disdains alliances and paints European allies as weak. Stewart Patrick served in the George W. Bush State Department and is now at the Carnegie Endowment for International Peace. He says Trump's taken aim at the global systems that he's long complained were unfair to the U.S. taxpayer.STEWART PATRICK: Trump's second term in office has represented a significant departure from Trump 1.0. It's far more of a revolutionary approach to international order, and the upheaval that he's created is just monumental.ORDOÑEZ: Those shifts have stunned Western partners who have struggled to balance maintaining transatlantic ties while defending their own interests. Ursula von der Leyen, the president of the European Commission, has complained that, quote, \"the West as we know it no longer exists.\"(SOUNDBITE OF ARCHIVED RECORDING)URSULA VON DER LEYEN: Europe did not start this confrontation. We think it is wrong.ORDOÑEZ: Trump has also had to push back against domestic allies who have accused him of spending too much time abroad and straying from his America First priorities. The White House told me Trump's acting on his campaign promises to advance American interests, delivering fair trade deals, pushing allies to increase defense spending, killing narco terrorists - those are their words - while also ending global conflicts to make the world safer.LORI ESPOSITO MURRAY: I think it is really clear that the perceptions of America First as isolationist at the beginning of his administration was clearly wrong.ORDOÑEZ: Lori Esposito Murray is a veteran in diplomatic circles who has advised both Republican and Democratic leaders. She says the main goal of America First is not to withdraw but to engage, to use American economic power to reshape global trade to press partners to carry their own weight. It's also about using American military power.MURRAY: He's not hesitating to use force, but they're really carefully calculated situations - Iran, enabling Ukraine for long-range strikes into Russia, bombing the Houthis - they're carefully calculated use of force but definitely not hesitating to use U.S. military force to achieve his goals.ORDOÑEZ: And perhaps nowhere is the link between Trump's domestic goals and foreign policy as intertwined as it is in the Western Hemisphere, where Trump has positioned a historic level of military acid.BENJAMIN GEDAN: President Trump views the world in spheres of influence, this old-fashioned idea that's become in style again, that you divide up the globe amongst major powers, and for the United States, we're the major power in the Western Hemisphere. And he's really acted on that.ORDOÑEZ: Benjamin Gedan led the Venezuela portfolio in the Obama White House. He says it's clear that the U.S. seeks to reassert its dominance in the region over other actors who have gained influence, such as Russia and China.GEDAN: One thing that's notable is that China became a competitor to the United States and Latin America not by moving an aircraft carrier into the region, but through trade and investment in infrastructure and being an appealing partner for all these countries.ORDOÑEZ: He says the U.S. should be working to be the partner of choice and not the partner who is feared.Franco Ordoñez.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's second term marks a significant departure from his first term, analysts say",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-22T22:16:36.000Z",
      "dateModified": "2025-12-22T22:16:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federal student loans are changing. Here's what to expect in 2026",
    "url": "https://www.npr.org/2025/12/23/nx-s1-5630504/2026-federal-loans-student-changes-save-plan",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+156/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd9%2F3673c56b4a81b3f3e8bc9a693bb8%2Facapossela-npr-student-loan-roundup2.jpg",
    "tag": "Politics",
    "date": "2025-12-23T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        Annelise Capossela for NPR\n    \n\n   \n   Borrowers have sp",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        Annelise Capossela for NPR\n    \n\n   \n   Borrowers have spent much of 2025 trying to keep up with dizzying changes to the federal student loan system.   The Trump administration and Congress are in the process of overhauling everything from how much Americans can borrow to how quickly they have to pay it back.   Here's what to know as we head into a new year:   President Biden's SAVE Plan is ending   The U.S. Department of Education announced in early December that it had reached a proposed settlement agreement to end the popular, yet controversial Biden-era student loan repayment plan known as SAVE.   \n   The Saving on a Valuable Education Plan \"was the most affordable, generous and flexible plan for millions of student loan borrowers,\" says Persis Yu of the liberal advocacy group Protect Borrowers.   But it was so affordable, generous and flexible – with its fast-tracked loan forgiveness and monthly payments as low as $0 for low-income borrowers – that Republican state attorneys general sued the Biden administration for exceeding its authority.   Legal challenges put SAVE borrowers in limbo for months, during which they were not required to make payments on their loans. Interest began accruing in August.   This new agreement, pending court approval, would end the long legal battle by ending SAVE itself.   \"The law is clear: if you take out a loan, you must pay it back,\" Under Secretary of Education Nicholas Kent said in a statement announcing the proposed agreement. \"American taxpayers can now rest assured they will no longer be forced to serve as collateral for illegal and irresponsible student loan policies.\"   Under the agreement, the Education Department would commit to moving the roughly 7 million borrowers still enrolled in SAVE into other repayment plans – though some of those plans are also in flux.   Whether you blame Biden or Republicans for SAVE's downfall, Betsy Mayotte, founder of the Institute of Student Loan Advisors (TISLA), says it puts borrowers in a real bind.   \n   \"People that made other financial decisions based on what they thought their payment was gonna be on the SAVE plan – they're in trouble,\" Mayotte says. \"A payment plan has never been challenged in court and has never been pulled out from existing borrowers.\"   Now, Mayotte says, those roughly 7 million SAVE borrowers will have to change plans and find a way to afford what will likely be higher monthly payments.   Complications for borrowers working toward Public Service Loan Forgiveness   Liz Kilty, an oncology nurse in Portland, Ore., has been on the SAVE plan from the start.   \"As soon as SAVE was an option, I signed up for it,\" says Kilty, who works in a public hospital and wanted to keep her monthly payments reasonably low on her way toward Public Service Loan Forgiveness (PSLF).   Since 2007, PSLF has offered a path for borrowers who work in public service – including teaching, nursing and policing – to have their loan balances erased after 10 years on the job.   \n   Kilty has $36,000 in debt remaining, and 15 payments to go before she can qualify for loan forgiveness.   But SAVE's legal troubles have slowed her down: Since her payments were frozen, so too was any progress she could make toward forgiveness. \"I was like, 'Are you kidding me?' Like, 'This is the year I'm going to be done, and this is the year that they're going to screw things up?' I've been waiting a decade [for forgiveness] and now things could go awry, and you're just helpless.\"   Earlier this month, Kilty applied for the PSLF Buyback, to make her remaining 15 payments in one lump sum and finally qualify to have the remainder forgiven.   One reason PSLF is still an option for Kilty and other borrowers is because it was created by Congress.   The Trump administration doesn't have the authority to stop PSLF – but it has worked to change the rules. Effective July 1, 2026, the department says it will deny loan forgiveness to workers whose government or nonprofit employers engage in activities with a \"substantial illegal purpose.\" The job of defining \"substantial illegal purpose\" will fall not to the courts but to the education secretary.   \n   In November, the cities of Boston, Chicago, San Francisco and Albuquerque, N.M., sued the Trump administration over those PSLF changes.   The complaint argued that a city or county government's resistance to the administration's immigration actions, for example, could lead the secretary to exclude that government's public workers – including a local nurse, like Kilty – from loan forgiveness.   Repayment plans are changing    SAVE aside, trying to change repayment plans in 2026 is about to get weird.   \n   That's because, in the One Big Beautiful Bill Act (OBBBA), Republicans also decided to gradually shut down two other popular, more affordable plans: Income-Contingent Repayment (ICR) and Pay As You Earn (PAYE). Both base payments on a borrower's income, and both will end in mid-2028.   Current borrowers can still, technically, enroll in these plans – for now. Another income-adjusted plan to consider – one that's not going anywhere – is Income-Based Repayment (IBR).   You can find a handy list of all of these plans and compare your monthly payments on the Education Department's Loan Simulator.   Congress also used the OBBBA to create two new repayment plans, beginning on July 1, 2026, that, for new borrowers, will replace all of the current options.   1. The standard plan   Under this new standard plan, new borrowers would agree to a repayment window between 10 and 25 years, depending on the size of their debt, with what they owe being divided up, along with interest, into equal monthly payments, like a home mortgage.   Under this plan, borrowers with larger debts would qualify for a longer repayment period.   2. The Repayment Assistance Plan (RAP)    For borrowers worried they don't earn enough to cover the standard plan's rigid monthly payments, Republicans created the RAP for future and current borrowers alike.   Payments would, for the most part, be based on borrowers' total adjusted gross income (AGI), and the department will waive any interest that is left after a borrower makes their monthly payment. The result: Borrowers in good standing will no longer see their loans grow.   \n   In fact, Republicans want to make sure borrowers see their balances go down every month. For those whose monthly payments are less than $50, the government would match whatever they do pay and apply it toward the principal.   While other plans offer forgiveness of remaining debts after 20 or 25 years, the RAP would delay that to 30 years. That's a big difference, says Preston Cooper, who studies student loan policy at the conservative-leaning American Enterprise Institute (AEI).   Borrowers with typical levels of debt \"and typical incomes for their degree level are almost always gonna pay off well before they hit that 30-year mark,\" Cooper says. \"So if you're going into RAP, I wouldn't be thinking about forgiveness because you're probably gonna pay it off.\"   Beginning July 1, 2026, new loans will be subject to new borrowing limits   We've covered big changes to repayment, but there are also big changes to how much graduate students can borrow in the first place. (Undergraduates won't see any changes.)   New limits will make it harder for lower- and middle-income borrowers to attend pricier graduate schools. Republicans are shutting down the current grad PLUS program, which allows students to borrow up to the cost of their degree.   \"Colleges could simply raise the price, pass the cost on to students, and the federal government would be required to write a check through the federal student loan program, \" Cooper says. \"That system was completely untenable, and I very much understand why Congress elected to end it.\"    After July 1, grad students' borrowing will be capped at $20,500 a year. Ideally, Cooper says, this will push some schools to lower their prices.   Until they do, though, Persis Yu, with Protect Borrowers, says many students will face a serious funding gap between their federal loans and the actual cost of graduate school.   \"Students are gonna have to make up that gap with some other type of funding,\" Yu says, \"and many students are gonna have to turn to the private student loan market.\"   \n   Mayotte, at TISLA, says she thinks some schools will abandon certain degree programs.   \"I got a bad feeling in the pit of my stomach when this law went through because I don't think it's gonna lower the cost of education like members of Congress think that it might,\" Mayotte says.   Borrowers working toward a professional graduate degree (think medicine or law) will have their borrowing capped at $50,000 a year.   Parents and caregivers who use parent PLUS loans to help students pay for college will also see new loan limits. They will be capped at $65,000 per child.   \"The precipice of a default cliff\"   Amidst all this change, data shows that millions of borrowers are struggling to keep up with their payments.   Preston Cooper at AEI recently published an analysis of the latest federal student loan data, and the results were sobering: 5.5 million borrowers in default, another 3.7 million more than 270 days late on their payments and 2.7 million in the early stages of delinquency.   \"We've got about 12 million borrowers right now who are either delinquent on their loans or in default,\" Cooper says.   That's more than 1 in 4 federal student loan borrowers – a crisis raising bipartisan alarm.   Persis Yu, of Protect Borrowers, warns America is at \"the precipice of a default cliff.\"   Mayotte adds, \"I really do think we're headed for historic default rates, for a while.\"   And so, heading into 2026, the big question hanging over the Trump administration and Congressional Republicans is: Can all the changes they've made help bring these borrowers back into good standing? Or will the default numbers snowball into an avalanche?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federal student loans are changing. Here's what to expect in 2026",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+156/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd9%2F3673c56b4a81b3f3e8bc9a693bb8%2Facapossela-npr-student-loan-roundup2.jpg"
      ],
      "datePublished": "2025-12-23T10:00:00.000Z",
      "dateModified": "2025-12-23T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]