[
  {
    "title": "NATO chief wishes 'good luck' to those who think Europe can defend itself without U.S. help",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5689791/nato-chief-europe-defense-us",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6099x3431+0+318/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff4%2Fef%2F88fc045c489d831f0f0f8b7e4c20%2Fap26026537516671.jpg",
    "tag": "Politics",
    "date": "2026-01-27T06:32:19.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                NATO Secretary-General Mark Rutte (cente",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                NATO Secretary-General Mark Rutte (center) greets the audience prior to his address during the Security and Defence Committee at the European Parliament in Brussels on Monday.\n                \n                    Virginia Mayo/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Virginia Mayo/AP\n    \n\n   \n   BRUSSELS — NATO Secretary-General Mark Rutte insisted Monday that Europe is incapable of defending itself without U.S. military support and would have to more than double current military spending targets to be able to do so.   \"If anyone thinks here … that the European Union or Europe as a whole can defend itself without the U.S., keep on dreaming. You can't,\" Rutte told EU lawmakers in Brussels. Europe and the United States \"need each other,\" he said.   \n   Tensions are festering within NATO over U.S. President Donald Trump's renewed threats in recent weeks to annex Greenland, which is a semiautonomous territory of NATO ally Denmark.   Trump also said that he was slapping new tariffs on Greenland's European backers, but later dropped his threats after a \"framework\" for a deal over the mineral-rich island was reached, with Rutte's help. Few details of the agreement have emerged.   The 32-nation military organization is bound together by a mutual defense clause, Article 5 of NATO's founding Washington treaty, which commits every country to come to the defense of an ally whose territory is under threat.   At NATO's summit in The Hague in July, European allies — with the exception of Spain — plus Canada agreed to Trump's demand that they invest the same percentage of their economic output on defense as the United States within a decade.   \n   They pledged to spend 3.5% of gross domestic product on core defense, and a further 1.5% on security-related infrastructure – a total of 5% of GDP – by 2035.   \"If you really want to go it alone,\" Rutte said, \"forget that you can ever get there with 5%. It will be 10%. You have to build up your own nuclear capability. That costs billions and billions of euros.\"   France has led calls for Europe to build its \"strategic autonomy,\" and support for its stance has grown since the Trump administration warned last year that its security priorities lie elsewhere and that the Europeans would have to fend for themselves.   \n   Rutte told the lawmakers that without the United States, Europe \"would lose the ultimate guarantor of our freedom, which is the U.S. nuclear umbrella. So, hey, good luck!\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NATO chief wishes 'good luck' to those who think Europe can defend itself without U.S. help",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6099x3431+0+318/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff4%2Fef%2F88fc045c489d831f0f0f8b7e4c20%2Fap26026537516671.jpg"
      ],
      "datePublished": "2026-01-27T06:32:19.000Z",
      "dateModified": "2026-01-27T06:32:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After rocky start, Bari Weiss to cut staff, add commentators at CBS News",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5689849/after-rocky-start-bari-weiss-to-cut-staff-add-commentators-at-cbs-news",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbc%2F90%2Fa18604f14f1dab26bafee04e978a%2Fgetty-cbs-news-shot.jpg",
    "tag": "Politics",
    "date": "2026-01-27T12:52:23.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                New CBS News Editor-in-Chief Bari Weiss ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                New CBS News Editor-in-Chief Bari Weiss arrived with a mandate to reshape the network's news coverage. Initial moves involving such mainstay shows as 60 Minutes and the CBS Evening news have sparked dissent inside the newsroom and drawn criticism from journalists outside it.\n                \n                    Spencer Platt/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Spencer Platt/Getty Images\n    \n\n   \n   CBS News Editor-in-Chief Bari Weiss has scheduled an all-staff meeting for late Tuesday morning at which she intends to announce the strategic path she wants the troubled news division to take.   Weiss is planning to tell her newsroom Tuesday that she intends to hire approximately 18 paid commentators and that she only wants top-flight performers committed to her approach to stick around.   Weiss is also expected to make significant cuts to the newsroom.    The details above are affirmed by three people inside CBS News with direct knowledge of the broad strokes of her plans. They spoke on condition of anonymity because they were not authorized to speak about internal network matters.   \n   Overall, this story draws on interviews with eight current and former CBS News journalists. All of those still at the network spoke on condition they not be named, citing professional repercussions. Several noted that Weiss has told staffers she welcomes internal debate but cannot abide public dissent.   In her brief tenure, Weiss has alienated much of the staff of 60 Minutes, the crown jewel of the news division, sought to reinvent the CBS Evening News, and questioned whether her own journalists have been fair or worthy of Americans' trust in the past.   Weiss has expressed exuberance about the task she confronts at the third-place news division and an eagerness to learn about broadcast news. She has said she wants to appeal to centrist Americans on the right and left.   While Weiss has been welcomed by some CBS journalists, including national legal correspondent Jan Crawford, others have taken issue with her style of leadership and the editorial choices that have followed her arrival.   In addition, liberal critics outside the network have blasted her, alleging that she is doing the handiwork of the networks' owners, who are allies of President Trump and are seeking his help in trying to take over Warner Bros. Discovery. Weiss has rejected that, though she declined to comment for this story through a spokesperson.   \n   Weiss brought in to reshape CBS News   A former conservative opinion writer and editor for the New York Times and the Wall Street Journal, Weiss was hired last fall by Paramount's new controlling owner, David Ellison, to shake up CBS's news division as it came under renewed attack from the Trump administration.   The previous owners of Paramount had paid $16 million to settle a lawsuit filed by Trump as a private individual over the editing of a fall 2024 60 Minutes interview with Kamala Harris. That helped clear the way for approval from Trump's chief broadcast regulator, who additionally secured promises from Ellison of an ombudsman to field complaints of ideological bias.   Paramount also acquired Weiss's center-right digital startup, the Free Press, for $150 million. The Substack views and news site has approximately 170,000 paying subscribers and is built on the proposition that most of the mainstream media is reflexively liberal, though it does sometimes offer coverage that is critical of Trump.   She has been personally involved in remapping the CBS Evening News.   Ahead of his debut as the new anchor of the Evening News, CBS's Tony Dokoupil said the press has too often missed the story.   \"Because we've taken into account the perspective of advocates and not the average American. Or we put too much weight in the analysis of academics or elites and not enough on you,\" he wrote in an online post on Jan. 1. \"At certain points, I have been you. I have felt this way too. I have felt like what I was seeing and hearing on the news didn't reflect what I was seeing and hearing in my own life.\"   On Instagram, Dokoupil wrote in response to a critic: \"I can promise you we'll be more accountable and more transparent than Cronkite or any one else of his era.\"   According to four people at the network's news division, It was taken as an affront by some of his colleagues: Walter Cronkite, the iconic CBS anchor who narrated the death of President John F. Kennedy, humanity's ascent to the Moon, and the resignation of President Richard M. Nixon for tens of millions of Americans, embodied the definition of the TV news anchor for the modern era.   \n   In December, less than two days before broadcast, Weiss decided to hold a 60 Minutes story on the alleged abuse of immigrants sent to an El Salvador detention center where the Trump administration sent hundreds of Venezuelan migrants last March.   She said the segment wasn't ready, though it had been reviewed and approved by CBS News lawyers and video excerpts had been released publicly to promote the segment. Weiss later said she would not be rushed into approving it for air.   The incident became public and sparked an enormous outcry, though it did not appreciably affect the story's content when it aired this month. (The initial version was available from a Canadian distributor which had mistakenly already loaded it for streaming subscribers.)   The story ended up running almost exactly as it had been prepared, with an extra element documenting the written comments of Trump administration officials and CBS's efforts to get them to come on camera for an interview.   Initial CBS Evening News coverage choices prove divisive    Less well known are some of the incidents involving the Evening News that inspired internal discomfort.   Weiss and top producers had drawn up plan to jet Dokoupil around the country to underscore his desire to talk to Americans outside elite circles in New York, Washington, D.C., and Los Angeles.   Yet since Dokoupil's debut in early January, CBS has taken an Evening News segment off the air called \"Eye On America,\" on since 2024, that had been doing just that.   On the first night, executives pulled Dokoupil back to New York City to cover the U.S. seizure of Venezuelan President Nicolás Maduro. The second night was Jan. 6 and Dokoupil was in Miami. Major news organizations including NPR and the New York Times offered new projects on the January 2021 siege of the U.S. Capitol about what had been learned in the intervening five years.   \n   Dokoupil offered this scant reference: \"President Trump today accused Democrats of failing to prevent the attack on the Capitol, while House Democratic Leader Hakeem Jeffries accused the president of 'whitewashing' it.\" The he-said, he-said formulation lasted about 15 seconds.   That prompted denunciations from outside critics. Sarah Longwell, the founder and publisher of the center-right, anti-Trump publication the Bulwark, wrote on X: \"Trump is getting exactly what his rich buddy paid for.\"   David Ellison's takeover of Paramount was financed by his father, Oracle co-founder Larry Ellison. The elder Ellison is a Trump adviser who encouraged his efforts to contest the 2020 race.   CBS Justice correspondent Scott MacFarlane took great exception to Dokoupil's Jan. 6 broadcast, according to two people inside the network who spoke on condition they not be named.   The reporter has spent the past five years covering the attack on the U.S. Congress, drawing upon evidence presented in court to document the effort to deny the formal certification of President Joe Biden's win in the 2020 race.   He did not appear on the air on CBS News this Jan. 6. Instead, as he posted on the social media platform X, MacFarlane appeared on the BBC. It lasted nearly four-and-a-half-minutes.   \"Here's my deep dive on the 5-year mark of Jan 6,\" MacFarlane wrote. \"The ongoing impact on victims, the lies... and the continued malignant corrosion of democracy[.] As aired on.... The BBC.\"   At the tail of that night's broadcast from Miami, Dokoupil hailed Secretary of State Marco Rubio as a prominent Floridian in a flippant segment at the end. The anchor noted his key role in the administration - including on Venezuela - and shared AI-generated social media memes envisioning Rubio in a variety of roles, including as a hunter, the Michelin Man, and the leader of Greenland.   \"Marco Rubio, we salute you,\" Dokoupil deadpanned. The light-hearted approach to the minute-long segment so close to the Venezuelan military action delighted the Trump White House and stirred backlash from journalists.   \n   A White House threat over Trump interview   Weiss has personally gotten involved to secure major interviews in her drive for the network to make and break news.   Dokoupil landed several big-name interviews including those of Pentagon chief Pete Hegseth and Trump. The Independent reported Hegseth said he only did the interview because Weiss asked. The New York Times posted audio showing that White House press secretary Karoline Leavitt threatened to sue CBS at the end of the interview with Trump if it was not run in full, unedited. Dokoupil said it would.   In a statement, CBS News said the network had already made \"the independent decision to air it unedited and in its entirety.\"   Several current and former CBS journalists pointed to another instance that appeared to pull a punch that could land hard on the Trump administration. Correspondent Nicole Sganga broke down video footage of the deadly shooting of Renee Good in Minneapolis by a federal immigration officer. A retired ICE agent who watched the footage frame by frame with CBS said the officer appeared to act improperly.   The segment streamed on the YouTube page of CBS Evening News. But it did not air on the flagship news program.   \"There are always growing pains when you start something new,\" says former CBS News President Andrew Heyward, citing the reinvention of CBS Evening News with Dokoupil as anchor. \"Those growing pains have been exacerbated by today's polarized political atmosphere and execution errors.\"   \"Now comes the hard slog of, day after day, drawing on CBS News's journalistic capacities to do original reporting that delivers real value to the existing audience and attracts new people without chasing away the people who like what they say,\" Heyward says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After rocky start, Bari Weiss to cut staff, add commentators at CBS News",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbc%2F90%2Fa18604f14f1dab26bafee04e978a%2Fgetty-cbs-news-shot.jpg"
      ],
      "datePublished": "2026-01-27T12:52:23.000Z",
      "dateModified": "2026-01-27T12:52:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican state representative on why he called for ICE surge in Minnesota to end",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5688930/republican-state-representative-on-why-he-called-for-ice-surge-in-minnesota-to-end",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-27T11:42:30.000Z",
    "description": "\n      \n      Republican state representative on why he called for ICE surge in Minnesota to end\n    \n        \n                Download\n              ",
    "body": "\n      \n      Republican state representative on why he called for ICE surge in Minnesota to end\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5688930/nx-s1-9624017\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep speaks with Republican Minnesota State Rep. Nolan West, who represents part of Minneapolis, about the reservations he's expressed on the federal show of force in the state.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican state representative on why he called for ICE surge in Minnesota to end",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-27T11:42:30.000Z",
      "dateModified": "2026-01-27T11:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5688705/trump-iowa-2026-midterm-elections",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7962x4479+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F7b%2F4c89ad40485b81dbe0dbbbd069ff%2Fgettyimages-2222712828.jpg",
    "tag": "Politics",
    "date": "2026-01-27T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump steps onstage to deliver",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump steps onstage to deliver remarks at the Salute to America celebration at the Iowa State Fairgrounds in Des Moines on July 3, 2025.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   President Trump will hold a rally in Iowa on Tuesday to preview the administration's campaign message ahead of the midterm elections. It comes as polls show that voters are unhappy with many elements of his messaging so far.   Tuesday's speech in Clive, Iowa, is expected to focus on energy and the economy — two areas where Trump's policy changes in the last year have negatively impacted the state.   Trump was last in Iowa on the eve of July 4, 2025, where he kicked off a yearlong celebration of America's 250th birthday and touted Congress' passage of the One Big Beautiful Bill Act, which enacted sweeping cuts to taxes and social safety net programs.   \n   As the tax season starts, voters will begin to see the impact of the law's signature policies, like no tax on tips and overtime and an expanded child tax credit. Later this week, the Treasury Department will hold a summit to release more details about the \"Trump Accounts\" created by the law, which will be seeded with a $1,000 government contribution for babies born between 2025 and 2028 and which will serve as investment accounts for newborns.   Much has changed in those six months, though, as polling data suggests the American public has soured on the Trump administration's overhaul of the country's foreign and domestic agenda. That includes an aggressive immigration enforcement crackdown in Minnesota where federal agents shot and killed two people in two different incidents this month.   Last week, Trump told reporters aboard Air Force One that his message for Iowa was \"straight to the farmers,\" touting the billions of dollars the administration made available as bridge payments to farmers negatively affected by the president's tariff policies.   \"You know, the farmers like Trump, and I like the farmers,\" Trump said. \"The farmers have been very special to me. Very successful.\"   The speech also comes as farming industry groups have expressed frustration that the Republican-led House failed to include a measure allowing higher-ethanol E15 fuel to be sold year-round in its spending plan that passed last week.   \n   Ahead of Friday's deadline to avoid a partial government shutdown, Senate Democrats say they will not vote to fund the Department of Homeland Security without additional guardrails for immigration enforcement after the latest shooting of a U.S. citizen by federal immigration agents.   Trump's visit to Iowa also highlights the political gravity that Republicans must overcome in an environment where voters are already primed to express displeasure with the party in power. The president earned 55% of the vote statewide in 2024 and Democrats hold only one statewide office, but that Democrat, auditor Rob Sand, has drastically outraised his opponents in the race for governor.   Control of Congress could hinge on Iowa, too: Three of its four House districts could be competitive, and national Democrats see the retirement of Republican Sen. Joni Ernst as an opportunity as Trump's popularity continues to plummet.   Recent surveys of Trump's approval rating find the president struggling with key demographics that swung toward Republicans in 2024 and also losing support on issues like immigration and the economy. At the state level, Iowa often gives Trump a lower approval rating than any other Republican-led state.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to hold de facto midterm kickoff in Iowa focused on the economy, energy prices",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7962x4479+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F7b%2F4c89ad40485b81dbe0dbbbd069ff%2Fgettyimages-2222712828.jpg"
      ],
      "datePublished": "2026-01-27T10:00:00.000Z",
      "dateModified": "2026-01-27T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 6,126 people killed in Iran's crackdown on nationwide protests, activists say",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5689793/6-126-iran-crackdown-protests-death-toll",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5807x3266+0+367/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F52%2F6a%2Fdafddd54487d9d4a3531900691c0%2Fap26025620496935.jpg",
    "tag": "Politics",
    "date": "2026-01-27T06:49:24.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People walk in front a billboard with gr",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People walk in front a billboard with graphic showing a U.S aircraft carrier with damaged fighter jets on its deck, and sign reading in Farsi and English: \"If you sow the wind, you'll reap whirlwind,\" at the Enqelab-e-Eslami (Islamic Revolution) square, in Tehran, Iran, Sunday, Jan. 25, 2026.\n                \n                    Vahid Salemi/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Vahid Salemi/AP\n    \n\n   \n   DUBAI, United Arab Emirates — Iran's bloody crackdown on nationwide protests killed at least 6,126 people while many others still are feared dead, activists said Tuesday, as a U.S. aircraft carrier group arrived in the Mideast to lead any American military response to the crisis.   The arrival of the USS Abraham Lincoln aircraft carrier and guided missile destroyers accompanying it provide the U.S. the ability to strike Iran, particularly as Gulf Arab states have signaled they want to stay out of any attack despite hosting American military personnel.   \n   Two Iranian-backed militias in the Mideast have signaled their willingness to launch new attacks, likely trying to back Iran after U.S. President Donald Trump threatened military action over the killing of peaceful protesters or Tehran launching mass executions in the wake of the demonstrations.   Iran has repeatedly threatened to drag the entire Mideast into a war, though its air defenses and military are still reeling after the June war launched by Israel against the country.   \n   Both the Houthis and Kataib Hezbollah sat out from Israel's 12-day war on Iran that saw the United States bomb Iranian nuclear sites. The hesitancy to get involved shows the disarray still affecting Iran's self-described \"Axis of Resistance\" after facing attacks from Israel during its war on Hamas in the Gaza Strip.   Activists offer new death toll   The new figures Tuesday came from the U.S.-based Human Rights Activists News Agency, which has been accurate in multiple rounds of unrest in Iran. The group verifies each death with a network of activists on the ground in Iran.   It identified the dead as including at least 5,777 protesters, 214 government-affiliated forces, 86 children and 49 civilians who weren't demonstrating. The crackdown has seen over 41,800 arrests, it added.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Hezbollah supporter waves an Iranian flag during a rally to show their solidarity with the Iranian government, in the southern suburb of Beirut, Lebanon, Monday, Jan. 26, 2026.\n                \n                    Hussein Malla/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Hussein Malla/AP\n    \n\n   \n   The Associated Press has been unable to independently assess the death toll given authorities cutting off the internet and disrupting calls into the Islamic Republic.   \n   Iran's government has put the death toll at a far lower 3,117, saying 2,427 were civilians and security forces, and labeled the rest \"terrorists.\" In the past, Iran's theocracy has undercounted or not reported fatalities from unrest.   That death toll exceeds that of any other round of protest or unrest there in decades, and recalls the chaos surrounding Iran's 1979 Islamic Revolution.   The protests in Iran began on Dec. 28, sparked by the fall of the Iranian currency, the rial, and quickly spread across the country. They were met by a violent crackdown by Iran's theocracy, the scale of which is only starting to become clear as the country has faced more than two weeks of internet blackout — the most comprehensive in its history.   Iran's U.N. ambassador told a U.N. Security Council meeting late Monday that Trump's repeated threats to use military force against the country \"are neither ambiguous nor misinterpreted.\" Amir Saeid Iravani also repeated allegations that the U.S. leader incited violence by \"armed terrorist groups\" supported by the United States and Israel, but gave no evidence to support his claims.   Iranian state media has tried to accuse forces abroad for the protests as the theocracy remains broadly unable to address the country's ailing economy, which is still squeezed by international sanctions, particularly over its nuclear program.   Some Iranian-backed militias suggest willingness to fight   Iran projected its power across the Mideast through the \"Axis of Resistance,\" a network of proxy militant groups in Gaza, Lebanon, Yemen, Syria and Iraq, and other places. It was also seen as a defensive buffer, intended to keep conflict away from Iranian borders. But it has collapsed after Israel targeted Hamas, Hezbollah in Lebanon and others during the Gaza war. Meanwhile, rebels in 2024 overthrew Syria's Bashar Assad after a yearslong, bloody war in which Iran backed his rule.   \n   Yemen's Houthi rebels, backed by Iran, have repeatedly warned they could resume fire if needed on shipping in the Red Sea, releasing old footage of a previous attack Monday. Ahmad \"Abu Hussein\" al-Hamidawi, the leader of Iraq's Kataib Hezbollah militia, warned \"the enemies that the war on the (Islamic) Republic will not be a picnic; rather, you will taste the bitterest forms of death, and nothing will remain of you in our region.\"   The Lebanese militant group Hezbollah, one of Iran's staunchest allies, refused to say how it planned to react in the case of a possible attack.   \"During the past two months, several parties have asked me a clear and frank question: If Israel and America go to war against Iran, will Hezbollah intervene or not?\" Hezbollah leader Sheikh Naim Kassem said in a video address.   He said the group is preparing for \"possible aggression and is determined to defend\" against it. But as to how it would act, he said, \"these details will be determined by the battle and we will determine them according to the interests that are present.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 6,126 people killed in Iran's crackdown on nationwide protests, activists say",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5807x3266+0+367/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F52%2F6a%2Fdafddd54487d9d4a3531900691c0%2Fap26025620496935.jpg"
      ],
      "datePublished": "2026-01-27T06:49:24.000Z",
      "dateModified": "2026-01-27T06:49:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump heads to Iowa hoping to refocus attention from shootings to the economy",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5688944/trump-iowa-refocus-attention-shootings-economy",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5844x3287+0+304/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2Fcc%2F5cb32c6647c19106e8f6e81cf6b1%2Fap23215686573445.jpg",
    "tag": "Politics",
    "date": "2026-01-27T10:00:00.000Z",
    "description": "\n      \n      Trump heads to Iowa hoping to refocus attention from shootings to the economy\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      Trump heads to Iowa hoping to refocus attention from shootings to the economy\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5688944/nx-s1-9623757\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump arrives at Reagan Washington National Airport.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   President Trump is heading on Tuesday to Iowa, where he's looking to change the subject to his economic agenda as his administration faces growing backlash over his immigration crackdown in Minnesota.   More Republicans are calling for an investigation after a second U.S. citizen was shot by a federal agent in Minneapolis.   The president is expected to tour a local business and give a speech on energy and the economy.   His chief of staff, Susie Wiles, says the trip is the beginning of what will eventually be weekly travel across the U.S. in support of Republican candidates ahead of the midterm elections. But Trump is unlikely to escape the controversy surrounding his administration's immigration tactics in Minneapolis.   \n   \"The primary news story at the moment isn't just the ICE-related shooting. It's the response to the ICE-related shooting,\" said Ryan Williams, a veteran Republican strategist who helped lead Mitt Romney's presidential campaign. \"That's what's going to be the focus. And the president can attempt to focus on the economy, on what he views are successes of his administration on the economic front. But he's going to be stuck talking about this issue for a significant period of time.\"   \n   The Republican Party has struggled with how to respond to Saturday's fatal shooting of Alex Pretti, a 37-year-old intensive care nurse at a VA hospital.   The shooting happened just weeks after another Minneapolis protester, Renee Macklin Good, was killed by an Immigration and Customs Enforcement officer.   A number of Republican lawmakers are pushing for more details about the second shooting, including Rep. Michael McCaul of Texas and Sens. Thom Tillis of North Carolina and Bill Cassidy of Louisiana.   This weekend, Republican Gov. Kevin Stitt of Oklahoma questioned Trump's broader goals.   \"Americans are asking themselves, 'What is the endgame? What is the solution?'\" said Stitt. \"And we believe in federalism and state rights. And nobody likes feds coming into their state. And so what's the goal right now? Is it to deport every single non-U.S. citizen? I don't think that's what Americans want. We have to stop politicizing this.\"   \n   After his top officials rushed to declare the U.S. citizen killed by federal agents a \"domestic terrorist,\" Trump is now trying to strike a softer tone   Trump spoke with Minnesota Gov. Tim Walz on Monday. Trump said in a social media post that Walz requested that they \"work together.\"   \"It was a very good call, and we, actually, seemed to be on a similar wavelength,\" Trump wrote.   But soon after the call, Trump's team was attacking Walz and Minneapolis Mayor Jacob Frey again.   Press secretary Karoline Leavitt blamed the local Democratic leaders for the tragedies, saying it was a result of their \"deliberate and hostile resistance.\"   She called on the city and state leaders to turn over \"criminal illegal aliens currently incarcerated in their prisons and jails and assist federal law enforcement in apprehending illegal immigrants wanted for crimes.   \"In Minnesota, ICE and local law enforcement can peacefully work together as they are effectively doing in so many other states and jurisdictions,\" she said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump heads to Iowa hoping to refocus attention from shootings to the economy",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5844x3287+0+304/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2Fcc%2F5cb32c6647c19106e8f6e81cf6b1%2Fap23215686573445.jpg"
      ],
      "datePublished": "2026-01-27T10:00:00.000Z",
      "dateModified": "2026-01-27T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Families of killed men file first U.S. federal lawsuit over drug boat strikes",
    "url": "https://www.npr.org/2026/01/27/g-s1-107510/drug-boat-strikes-lawsuit-families",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5798x3261+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2Fb0%2Fb4e6c1244878a1621241e0fad026%2Fgettyimages-2249610440.jpg",
    "tag": "Politics",
    "date": "2026-01-27T15:03:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as U.S. Secretary",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as U.S. Secretary of War Pete Hegseth looks on during a meeting of his Cabinet in the Cabinet Room of the White House in December 2025.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   Relatives of two Trinidadian men killed in an air strike last October are suing the U.S. government for wrongful death and for carrying out extrajudicial killings.   The case, filed in Massachusetts, is the first lawsuit over the strikes to land in a U.S. federal court since the Trump administration launched a campaign to target vessels off the coast of Venezuela. The American government has carried out three dozen such strikes since September, killing more than 100 people.   \n   Among them are Chad Joseph, 26, and Rishi Samaroo, 41, who relatives say died in what President Trump described as \"a lethal kinetic strike\" on Oct. 14, 2025. The president posted a short video that day on social media that shows a missile targeting a ship, which erupts in flame.   \"This is killing for sport, it's killing for theater and it's utterly lawless,\" said Baher Azmy, legal director of the Center for Constitutional Rights. \"We need a court of law to rein in this administration and provide some accountability to the families.\"   The White House and Pentagon justify the strikes as part of a broader push to stop the flow of illegal drugs into the U.S.   But the new lawsuit described Joseph and Samaroo as fishermen doing farm work in Venezuela, with no ties to the drug trade. Court papers said they were headed home to family members when the strike occurred and now are presumed dead.   \n   Neither man \"presented a concrete, specific, and imminent threat of death or serious physical injury to the United States or anyone at all, and means other than lethal force could have reasonably been employed to neutralize any lesser threat,\" according to the lawsuit.   Lenore Burnley, the mother of Chad Joseph, and Sallycar Korasingh, the sister of Rishi Samaroo, are the plaintiffs in the case.   Their court papers allege violations of the Death on the High Seas Act, a 1920 law that makes the U.S. government liable if its agents engage in negligence that results in wrongful death more than three miles off American shores. A second claim alleges violations of the Alien Tort Statute, which allows foreign citizens to sue over human rights violations such as deaths that occurred outside an armed conflict, with no judicial process.   \n   The American Civil Liberties Union, the Center for Constitutional Rights, and Jonathan Hafetz at Seton Hall University School of Law are representing the plaintiffs.   \"In seeking justice for the senseless killing of their loved ones, our clients are bravely demanding accountability for their devastating losses and standing up against the administration's assault on the rule of law,\" said Brett Max Kaufman, senior counsel at the ACLU.   U.S. lawmakers have raised questions about the legal basis for the strikes for months but the administration has persisted.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Families of killed men file first U.S. federal lawsuit over drug boat strikes",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5798x3261+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2Fb0%2Fb4e6c1244878a1621241e0fad026%2Fgettyimages-2249610440.jpg"
      ],
      "datePublished": "2026-01-27T15:03:40.000Z",
      "dateModified": "2026-01-27T15:03:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Political consultant discusses what voters think about ICE operations in Minnesota",
    "url": "https://www.npr.org/2026/01/27/nx-s1-5688870/political-consultant-discusses-what-voters-think-about-ice-operations-in-minnesota",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-27T09:44:04.000Z",
    "description": "\n      \n      Political consultant discusses what voters think about ICE operations in Minnesota\n    \n        \n                Download\n              ",
    "body": "\n      \n      Political consultant discusses what voters think about ICE operations in Minnesota\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5688870/nx-s1-9623760\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep asks conservative political consultant and pollster Sarah Longwell how voters are reacting to ICE operation in Minnesota.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Political consultant discusses what voters think about ICE operations in Minnesota",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-27T09:44:04.000Z",
      "dateModified": "2026-01-27T09:44:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fight over DHS funding has the government on track for a partial shutdown",
    "url": "https://www.npr.org/2026/01/26/nx-s1-5688894/fight-over-dhs-funding-has-the-government-on-track-for-a-partial-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-26T22:07:17.000Z",
    "description": "Fight over DHS funding has the government on track for a partial shutdown   Efforts in Congress to avoid a partial government shutdown have been scram",
    "body": "Fight over DHS funding has the government on track for a partial shutdown   Efforts in Congress to avoid a partial government shutdown have been scrambled by two fatal shootings in Minneapolis this month involving ICE officers.\n\n    \n        Politics\n    \n\n\n                  \n            January 26, 20265:07 PM ET\n         \n      \n\n      \n      Fight over DHS funding has the government on track for a partial shutdown\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5688894/nx-s1-9623471\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      Efforts in Congress to avoid a partial government shutdown have been scrambled by two fatal shootings in Minneapolis this month involving ICE officers.   \n\n\n    SCOTT DETROW, HOST:  The shooting and killing of Alex Pretti by federal agents in Minneapolis this weekend may have a big effect on Congress. Funding for several federal agencies expires midnight Friday. Senate Democrats have now mobilized to block funding for the Department of Homeland Security in response to Pretti's death. And if lawmakers are unable to break the impasse, that could lead to a partial government shutdown at the end of the week. Joining us now to discuss all of this is NPR congressional correspondent Claudia Grisales. Hey, Claudia.CLAUDIA GRISALES, BYLINE: Hey, Scott.DETROW: So the Senate was on track to pass this final round of funding bills, with bipartisan support. How has the death of Alex Pretti changed that?GRISALES: Right. And to recap, the House passed this $1.3 trillion spending package to fund big areas of the federal government past Friday night, and it would include funding for the departments of Defense and Health and Human Services and others, and it did draw bipartisan votes. But Senate Democrats, on their end, had signaled this would be easily passed in their chamber this week. However, with the death of Pretti, we saw a 180. Senate Minority Leader Chuck Schumer says Democrats will block this entire funding package unless the DHS funding is split off from it. And Schumer said that the legislation, as written, is, quote, \"woefully inadequate to rein in the abuses of ICE,\" end quote.DETROW: Now, let's turn our head back to the last shutdown. There was that split among Democrats about holding out for health care subsidies. Are you seeing similar tension, similar splits in the caucus when it comes to what to do with Homeland Security funding?GRISALES: No, this is very different, even as Republicans push back on Democrats' plans to block this entire funding package if DHS is not pulled out of it. One aide told me that when we saw the killing of Renee Good earlier this month, that some said this was a one-off. But they argue that with the death of Alex Pretti, this is now part of a disturbing and alarming trend. And for Democrats, the intensity of the resolve is higher this time. And the Democrats we saw defect last time to end the government shutdown, such as Nevada Senator Catherine Cortez Masto, have already said they're nos this time. And so far, we've just seen one Democrat say he'll vote for the package. That's John Fetterman of Pennsylvania. He says he doesn't vote for shutdowns. So he may be on an island for his party this time around.DETROW: What are Republicans saying?GRISALES: Well, most Republicans are standing by the administration's policy in general, but we're seeing more and more call for answers. That includes Pennsylvania Senator Dave McCormick, who said he agreed with a statement issued by the NRA that there needs to be a full investigation. The NRA had taken issue with comments from Trump officials saying that Pretti was armed, so his killing may have been justified. We also know that the chair of House Homeland Security, New York's Andrew Garbarino, is also calling for an oversight hearing with DHS officials. We know DHS Secretary Kristi Noem will go before the Senate Judiciary Committee in March, but that is not soon enough for many.As for leadership, we're hearing Senate Majority Leader John Thune applaud Trump's decision to send Tom Homan to Minneapolis. He is hoping that will cool down temperatures there. And a spokesman for Thune said Monday, Republicans do not plan to separate the DHS funding bill out. So at this rate, we could be headed for a partial shutdown come this weekend.DETROW: That is NPR congressional correspondent Claudia Grisales. Claudia, thanks so much.GRISALES: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fight over DHS funding has the government on track for a partial shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-26T22:07:17.000Z",
      "dateModified": "2026-01-26T22:07:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump and Walz strike conciliatory tone in wake of second Minnesota killing",
    "url": "https://www.npr.org/2026/01/26/nx-s1-5688947/trump-and-walz-strike-conciliatory-tone-in-wake-of-second-minnesota-killing",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-26T22:11:01.000Z",
    "description": "\n      The Trump administration is working to reframe the narrative in Minneapolis on enforcing the law after outrage over killings continues.   \n\n   ",
    "body": "\n      The Trump administration is working to reframe the narrative in Minneapolis on enforcing the law after outrage over killings continues.   \n\n    SCOTT DETROW, HOST:  President Trump spoke to Minnesota Democratic Governor Tim Walz today about the federal immigration agents that have now killed two people in Minnesota this month, including 37-year-old nurse Alex Pretti over the weekend. The Trump administration has been trying to explain how those killings happened. It has now announced that border czar Tom Homan will take over running on-the-ground immigration enforcement operations in Minnesota. NPR White House correspondent Danielle Kurtzleben joins me now with more. Hi, Danielle.DANIELLE KURTZLEBEN, BYLINE: Hey, Scott.DETROW: What do we know about what happened in this call?KURTZLEBEN: Well, President Trump and Governor Walz each put out a summary of the call. Now, Walz has given much more detail of the two - first of all, in a statement calling the conversation productive, which he then elaborated on in an interview with Minnesota Public Radio's Clay Masters. And here's what he said.(SOUNDBITE OF ARCHIVED NPR CONTENT)TIM WALZ: Whatever has happened here, there is a definite change of tone. There is definitely a more collaborative tone. I want to make sure that I'm not jeopardizing that, that I'm going to take them for their word right now that they're going to reduce this force.KURTZLEBEN: So that's notable. Walz says that Trump said he's willing to reduce the force in Minneapolis. Walz also added that with Homan coming in, his understanding is that Greg Bovino, who had been heading operations in Minneapolis, is leaving and that DHS Secretary Kristi Noem will no longer be there. Trump meanwhile posted on social media about the call and he made it sound friendly. He said he and Walz were on a similar wavelength, as he put it. He also characterized Walz as, quote, \"happy that Tom Homan was going to Minnesota.\" Now, Walz and Trump both really seem to be emphasizing that they want to work together in the wake of these two killings.DETROW: I mean, how does this square with how the administration had previously talked about Walz?KURTZLEBEN: Well, there's a big contradiction, and it was apparent at the White House press briefing today, where press secretary Karoline Leavitt, she blamed Walz along with Minneapolis Mayor Jacob Frey for the Saturday shooting.(SOUNDBITE OF ARCHIVED RECORDING)KAROLINE LEAVITT: But let's be clear about the circumstances which led to that moment on Saturday. This tragedy occurred as a result of a deliberate and hostile resistance by Democrat leaders in Minnesota. For weeks, Governor Walz and the mayor, Jacob Frey, and other elected Democrats were spreading lies about federal law enforcement officers.KURTZLEBEN: So you have Trump emphasizing cooperation, and then you have the White House blaming Walz. It really seems like they're trying to have it both ways here, to put out this red meat of slamming Democratic leaders as these irresponsible extremists while also trying to put out this message of, don't worry - we're trying to work together to improve things.DETROW: So that's their statements. Let's talk about their actions for a moment. The administration says it's sending border czar Tom Homan to Minnesota. What does this change mean? Why is this significant?KURTZLEBEN: Well, it seems clear this administration recognizes they need to change something in Minneapolis, which is something Walz also noted. Now, the whole world at this point has seen these two horrifying shootings on video. In that last one, you saw a man pepper-sprayed, wrestled to the ground by federal agents, one of whom shot him several times. So thus far, DHS Secretary Noem and Bovino, they've been the face of the immigration enforcement surge there. Homan, meanwhile, he is no moderate on immigration, but he did also serve under Obama. And Trump really seemed to emphasize this changing of the guard today. In announcing this, he went out of his way to say Homan hasn't been involved in Minneapolis and that he will be reporting directly to Trump.DETROW: Still though, Danielle, Stephen Miller and Kristi Noem have both called Pretti a domestic terrorist, a would-be assassin. It really seems hard to walk back that rhetoric.KURTZLEBEN: Very much, but they are trying. Today, when Leavitt was asked about that, she said she's never heard Trump characterize Pretti that way. And this is meaningful because Trump, as you know, has no problem being inflammatory. So backing away from this shows they're trying not to repeat that message.DETROW: That is NPR White House correspondent Danielle Kurtzleben. Thank you so much, Danielle.KURTZLEBEN: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump and Walz strike conciliatory tone in wake of second Minnesota killing",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-26T22:11:01.000Z",
      "dateModified": "2026-01-26T22:11:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]