[
  {
    "title": "Economic promises helped Trump get elected. Now he has an affordability problem",
    "url": "https://www.npr.org/2025/11/14/nx-s1-5608348/trump-economy-affordability",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+15/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff9%2Fac%2Fa173987a49fd83577fa5d4f3e3a9%2Fgettyimages-2245898416.jpg",
    "tag": "Politics",
    "date": "2025-11-14T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President  Trump speaks to members of th",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President  Trump speaks to members of the press after exiting Air Force One on Nov. 9 at Joint Base Andrews, Md.\n                \n                    Tasos Katopodis/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tasos Katopodis/Getty Images\n    \n\n   \n   President Trump says he is going to \"make America affordable again.\" It's a pledge he made frequently during the campaign. And now, after dropping it from his lexicon for more than eight months, he's saying it again as polls show voters rank the economy and cost of living as their top concern and blame Trump's policies for making things worse.   A senior administration official tells NPR Trump will soon travel around the country with a message that while some things have improved, there is more work to do to help people feeling economic strain. The official, who was not authorized to speak on the record, added that when it comes to affordability, \"there's no finish line.\"   \n   Thus far, Trump has spent far more time boasting about how great the economy and stock market are doing than acknowledging any economic anxiety.   \"Record high, record high, record high,\" Trump said of the stock market last week at a business event in Florida.   \"Costs are way down,\" Trump said at a late night signing ceremony in the Oval Office Wednesday. \"My administration and our partners in Congress will continue our work to lower the cost of living, restore public safety, grow our economy and make America affordable again for all Americans.\"   \n   Trump's affordability challenge marks a dramatic reversal of fortune for a president who returned to office on a promise to bring costs down and whose greatest political strength was on the economy. Now his approval rating on the economy is severely underwater.   After sweeping wins by Democrats in last week's elections where the cost-of-living was a key issue, Trump suddenly had a lot to say about \"affordability.\" But he has frequently come across as dismissive and defensive.   \"The affordability is much better with the Republicans,\" Trump said last week. \"The only problem is the Republicans don't talk about it, and Republicans should start talking about it and use their heads.\"   \n   But earlier this week when Fox News' Laura Ingraham pressed Trump on rising costs of things like coffee and ground beef, he called it a \"con job by the Democrats.\"   Asked why people are anxious about the economy, Trump responded by questioning whether people really are saying that.   \"I think polls are fake,\" Trump said. \"We have the greatest economy we've ever had.\"   \n   To support his positive outlook, Trump points to the booming stock market, his tariff policy and pledges by companies and countries to invest in the U.S.   Inflation this year has been persistent but not dramatic, at about 3%. Eggs have gotten cheaper since Trump took office, but other staples like ground beef and coffee are up. According to Gas Buddy, the average price of gasoline in the U.S. is $3.09 per gallon, slightly higher than this time last year.   \"Consumer confidence is the lowest it's ever been,\" said Jason Furman, a professor of economics at Harvard. \"People are really negative about inflation.\"   It's a political truth — and a pitfall for presidents — that people don't want to hear that everything is awesome if they are struggling.   \n   Furman, who served in the Obama administration, says the messaging team in that White House was very cautious not to brag about the economy, as the nation emerged from the Great Recession.   \"Because they thought anything we said positive about the economy risked people thinking President Obama was out of touch,\" said Furman. \"I didn't see that type of reserve when Biden was president. He bragged about it quite a lot, and I think that [rang] hollow with a lot of people. And President Trump is even less reserved about his bragging.\"   Trump's insistence that the economy is great earned him a rebuke from Republican Rep. Marjorie Taylor Greene of Georgia. Appearing on the Sean Spicer Show on YouTube, Greene said she gives Trump credit for holding inflation steady.   \n   \"But that doesn't bring prices down,\" said Greene. \"And so gaslighting the people and trying to tell them that prices have come down is not helping. It's actually infuriating people because people know what they are paying at the grocery store, they know what they're paying for their kid's clothes and school supplies. They know what they're paying for their electricity bills.\"   She called for compassion rather than lecturing.   \n   Former Trump economic adviser Stephen Moore says there are three major cost issues that have to be addressed: grocery prices, home prices and health care costs.   \"It is true factually that the average family has more purchasing power today than they did when Biden left office,\" said Moore. \"And yet people don't feel it. You know, they're not feeling the love. And I can't explain why that is except that people tend to focus on things where their prices are rising.\"   In fact, purchasing power also grew during the Biden administration, because wages rose faster than costs. But voters didn't want to hear it then, and they are in no mood to hear it now.   \"People are kind of in a crabby mood right now when it comes to the economy,\" said Moore.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Economic promises helped Trump get elected. Now he has an affordability problem",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+15/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff9%2Fac%2Fa173987a49fd83577fa5d4f3e3a9%2Fgettyimages-2245898416.jpg"
      ],
      "datePublished": "2025-11-14T10:00:00.000Z",
      "dateModified": "2025-11-14T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Comey and James seek case dismissal, arguing prosecutor was illegally appointed",
    "url": "https://www.npr.org/2025/11/14/nx-s1-5608894/comey-james-case-dismissal",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2784x1566+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2F1e%2F3a3fefa24ee3aac6a00abfd9b71c%2Fap25316748762069.jpg",
    "tag": "Politics",
    "date": "2025-11-14T06:42:07.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - Lindsey Halligan, outside of the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - Lindsey Halligan, outside of the White House, Aug. 20, 2025, in Washington.\n                \n                    Jacquelyn Martin/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jacquelyn Martin/AP\n    \n\n   \n   ALEXANDRIA, Va. — Lawyers for former FBI Director James Comey and New York Attorney General Letitia James asked a judge Thursday to dismiss the cases against them, saying the prosecutor who secured the indictments was illegally installed in the role.   \n   U.S. District Judge Cameron McGowan Currie said she expects to decide by Thanksgiving on challenges to Lindsey Halligan's appointment as interim U.S. attorney for the Eastern District of Virginia. That decision could help determine the fate of the politically charged cases, which were both shepherded by the hastily installed Halligan and together have amplified concerns that the Justice Department is being used as a weapon to target President Donald Trump's perceived adversaries.   Halligan was installed in the job at Trump's urging by Attorney General Pam Bondi in September, just days before Comey was indicted, in what defense lawyers say was an end-run around the constitutional and statutory rules governing the appointment of U.S. attorneys. They say the maneuver was designed to ensure indictments against the president's political opponents after the prosecutor who had been overseeing the two investigations, but had not brought charges, was effectively forced out.   \n   \"Ms. Halligan was the sole prosecutor in the grand jury room, and when the sole prosecutor lacks the authority,\" said Ephraim McDowell, one of Comey's defense lawyers, \"that's not going to be a harmless error.\"   \n   U.S. attorneys, top federal prosecutors who oversee regional Justice Department outposts across the country, are typically nominated by the president and then confirmed by the Senate. Attorneys general do have the authority to name an interim U.S. attorney who can serve for 120 days, but lawyers for Comey and James argued that once that period expires, the law gives federal judges the exclusive say of who gets to fill the vacancy.   The interim US attorney resigned under pressure   After then-interim U.S. attorney Erik Siebert resigned in September while facing Trump administration pressure to bring charges against Comey and James, Bondi installed Halligan, a White House aide with no prior prosecutorial experience. The appointment followed a Trump post on Truth Social in which he complained to Bondi about the lack of prosecutorial action against his political enemies and said, \"JUSTICE MUST BE SERVED, NOW!!!\"   Siebert had been appointed by Bondi in January to serve as interim U.S. attorney. Trump in May announced his intention to nominate him, and judges in the Eastern District unanimously agreed after his 120-day period expired that he should be retained in the role.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former FBI Director James Comey's attorney Abbe Lowell talks to reporters as he leaves the federal courthouse in Alexandria, Va., Thursday, Nov. 13, 2025.\n                \n                    Jose Luis Magana/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jose Luis Magana/AP\n    \n\n   \n   But after the Trump administration effectively pushed him out in September, the Justice Department again opted to make an interim appointment in place of the courts, something defense lawyers say it was not empowered under the law to do.   \n   \"If the government were to prevail here,\" McDowell said, then it \"would never need to go through Senate confirmation again for U.S. attorneys.\" He said any dismissal of the indictment must be permanent, with no opportunity to bring the case again, to avoid rewarding the government for a violation.   The Justice Department defends Halligan's appointment   The Justice Department maintains that the law does not explicitly prohibit successive appointments of interim U.S. attorneys by the attorney general. Henry Whitaker, a lawyer for the department, argued that the indictment was properly returned by a grand jury and should not be dismissed over what he described as at most a paperwork or clerical error.   \n   \"The grand jury made a decision based on the facts and the law, and they followed their oath,\" Whitaker said.   He also said that even if there were questions about Halligan's appointment, they were resolved by the fact that Bondi had personally ratified the indictment and reviewed the grand jury proceedings. But Currie, the judge, questioned whether that was possible given that a section of the grand jury proceedings that were produced to her was, for unexplained reasons, missing a section.   A Justice Department spokesperson later said that there was no missing time and that the time period in question concerns when the grand jury was deliberating, which \"would not be included in a transcription.\"   Comey has pleaded not guilty to charges of making a false statement and obstructing Congress, and James, a Democrat, has pleaded not guilty to mortgage fraud allegations. The challenges to Halligan's appointment are part of a multiprong effort to get the prosecutions tossed before trial. Their lawyers have separately argued that the prosecutions are improperly vindictive and motivated by the president's personal animus toward their clients and should therefore be dismissed.   Trump's history with Comey and James   Comey, as FBI director in the early months of Trump's first term, infuriated the president through his oversight of an investigation into potential ties between Russia and Trump's 2016 campaign. Trump fired Comey in May 2017. The two have been open adversaries since, with Comey labeling Trump \"unethical\" and comparing him to a Mafia boss and Trump branding Comey an \"untruthful slime ball\" and calling for him to be punished because of the Russia investigation.   \n   James has been a frequent target of Trump's ire, especially since she won a staggering judgment against him and the Trump Organization in a lawsuit alleging he defrauded banks by overstating the value of his real estate holdings on financial statements. An appeals court overturned the fine, which had ballooned to more than $500 million with interest, but upheld a lower court's finding that Trump had committed fraud.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Comey and James seek case dismissal, arguing prosecutor was illegally appointed",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2784x1566+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2F1e%2F3a3fefa24ee3aac6a00abfd9b71c%2Fap25316748762069.jpg"
      ],
      "datePublished": "2025-11-14T06:42:07.000Z",
      "dateModified": "2025-11-14T06:42:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to address the affordability issue. And, Border Patrol heading to Charlotte",
    "url": "https://www.npr.org/2025/11/14/g-s1-97813/up-first-newsletter-white-house-epstein-charlotte-federal-agents-trump-economy",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2F7b%2F0252b6414f5ead599d03ccbfce4d%2Fgettyimages-2246563717.jpg",
    "tag": "Politics",
    "date": "2025-11-14T12:11:52.000Z",
    "description": "\n      \n      Epstein Files Fallout, Charlotte Immigration Patrols, Economic Impact Of Shutdown \n    \n        \n                Download\n              ",
    "body": "\n      \n      Epstein Files Fallout, Charlotte Immigration Patrols, Economic Impact Of Shutdown \n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/g-s1-97813/nx-s1-mx-5806772\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.   Today's top stories   The White House says newly released Jeffrey Epstein documents don't prove any wrongdoing by President Trump. Within the more than 1,000 mentions of Trump in the documents, an email says Trump spent hours at the convicted sex offender's home with a victim. Republican strategist Alex Conant says the documents may not necessarily change people's minds for the next election, but it makes for a not-so-good week for the president.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump arrives for the signing ceremony for the \"Fostering the Future\" executive order in the East Room of the White House on Nov. 13, 2025.\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   🎧 Conant says that the White House should have handled the Epstein story differently by releasing all the information they had. The White House claims it has been transparent about the situation, but at the same time, Trump doesn't want to answer questions about Epstein, NPR's Deepa Shivaram tells Up First. Conant points out that Trump's strategy is to deflect, attack and then change the story, but due to the slow drip of the Epstein story, it has been harder for the president to overcome this scandal.   The Trump administration has selected Charlotte, N.C., as the next city for its immigration crackdown, according to Mecklenburg County Sheriff Garry McFadden. The sheriff said yesterday that federal officials contacted him and could arrive as early as tomorrow. The development comes as some Border Patrol agents are leaving Chicago, after weeks of aggressive raids there.    \n   🎧 Charlotte drew national attention this fall following the fatal stabbing of a Ukrainian woman on public transit, says Nick de la Canal with NPR network station WFAE. The suspect was not an immigrant, but Republicans and the White House criticized the city's Democratic mayor for the crime. Violent crime is down 20% over the last year, according to de la Canal, but there have still been calls for the National Guard to deploy to the area. It is currently unknown how many agents are expected to arrive in the city, and the community has been reacting with fear to the news, despite advocacy groups urging calm.   Trump will soon travel across the U.S. to address the economic hardship Americans are feeling, a senior administration official told NPR. Trump's message will be that, while some things have improved, there is still more work to be done. This comes as the president revives the talking point of making America affordable again — a pledge that helped him win the White House again but that has not been much of a focus the past eight months. Currently, voters rank the economy and cost of living as their top concerns in polls, and many blame Trump's policies for exacerbating these issues.   \n   Today's listen   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Why exercise is on the rise.\n                \n                    J_art/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        J_art/Getty Images\n    \n\n   \n   Exercise appears to be more popular than ever in the U.S., from fitness influencers sharing gym tips on social media to fitness being a focus in our politics. Data also shows more Americans are exercising. But what caused this shift? It's Been A Minute's Brittany Luse uncovers the answer to that question and more with guests Jonquilyn Hill, host of Vox's Explain it to Me podcast, and Shelly McKenzie, author of Getting Physical: the Rise of Fitness Culture in America. Listen to the discussion or read the transcript here.   Weekend picks   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Michael Shannon plays President James Garfield and Betty Gilpin is First Lady Crete Garfield in Death By Lightning.\n                \n                    Larry Horricks/Netflix\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Larry Horricks/Netflix\n    \n\n   \n   Check out what NPR is watching, reading and listening to this weekend:   🍿 Movies: Nuremberg explores the relationship between Nazi Germany's number two, Hermann Göring, and Douglas Kelley, the psychiatrist assigned to monitor him. Morning Edition host Leila Fadel spoke with writer-director James Vanderbilt about what makes the story so relevant now.   📺 TV: If you like The West Wing, you might like Death by Lightning. The four-part miniseries pits President James Garfield against Charles Guiteau, the disgruntled would-be political operative who assassinated him.   📚 Books: Sen. John Fetterman, a Democrat from Pennsylvania, spoke with All Things Considered about his new memoir, Unfettered, which recounts his 2022 Senate campaign during which he suffered a stroke and battled deep depression. Plus, five more new releases from this week.   🎵 Music: With the end of 2025 nearing, All Songs Considered has updated its running playlists of this year's best songs.   ❓ Quiz: A decent score of 7/10, I know I could have done better, but luckily I have you to avenge me. Good luck!   3 things to know before you go   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In an earnings call on Nov. 13, Disney CEO Bob Iger hinted at working with AI companies to create user-generated content on Disney+ to increase engagement with subscribers.\n                \n                    Charley Gallay/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Charley Gallay/Getty Images North America\n    \n\n   \n   Disney CEO Bob Iger indicated yesterday that the entertainment conglomerate is in talks with AI companies to develop tools Disney+ subscribers could use to generate their own content on the platform.Michael Jackson's \"Thriller\" climbed up Billboard's Hot 100 during spooky season, marking the sixth consecutive decade in which he has achieved at least one top 10 hit. This sets an all-time chart record.This week's NPR Far-Flung Postcard series takes you aboard the CCGS Louis S. St-Laurent, a Canadian Coast Guard icebreaker ship, where you can see a polar bear.   \n   This newsletter was edited by Obed Manuel.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to address the affordability issue. And, Border Patrol heading to Charlotte",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2F7b%2F0252b6414f5ead599d03ccbfce4d%2Fgettyimages-2246563717.jpg"
      ],
      "datePublished": "2025-11-14T12:11:52.000Z",
      "dateModified": "2025-11-14T12:11:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The government shutdown is over, but not everything is back to normal",
    "url": "https://www.npr.org/2025/11/13/nx-s1-5607812/government-shutdown-ends-updates",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6091x3426+0+559/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F76%2F44%2F2504cd06448c880e6dd6887b1f77%2Fgettyimages-2245928654.jpg",
    "tag": "Politics",
    "date": "2025-11-13T15:03:52.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A tour guide leads a group through the U",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A tour guide leads a group through the U.S. Capitol in Washington, D.C. on November 13, 2025, a day after the U.S. government reopened.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   The longest government shutdown in U.S. history is officially over after President Trump signed a bill passed by Congress on Wednesday night.   The federal government is reopening. But after 43 days on pause, things may not return to business as usual right away. For instance, federal workers are still awaiting backpay and air travel disruptions are expected to linger.   \n   And some impacts could continue much longer than six weeks, whether that's national parks trying to make up for lost visitor revenue or taxpayers waiting longer for refunds from a backlogged Internal Revenue Service (IRS).   There's also the looming threat of another potential shutdown in the not-too-distant future, since this bill only funds the government through Jan. 30.   Here's a look at where things stand for now.   Keep scrolling for updates, and jump by category here:   Federal workers | SNAP| Smithsonian | Air travel | National parks | Taxes | Economic data   \n   Federal employees return to work, awaiting back pay    Roughly 1.4 million federal workers have gone without pay for six weeks. Roughly half of them were required to keep working without paychecks, while hundreds of thousands of others were furloughed.   Russ Vought, director of the Office of Management and Budget, told agency heads to direct furloughed employees to return to work Thursday.   \"Agencies should take all necessary steps to ensure that offices reopen in a prompt and orderly manner\" on Thursday, Vought wrote in a Wednesday memo.   \n   The timing of backpay is a different question.   After the government shutdown ending in January 2019 — then the longest in history — Congress passed a law ensuring back pay for federal workers \"at the earliest date possible after the lapse in appropriations ends, regardless of scheduled pay dates.\"   But Trump appeared to suggest otherwise in public comments last month, leaving many feds worried.   \n   The bill that Congress passed to end the shutdown guarantees back pay. It also reverses several agencies' attempted staffing reductions during the shutdown, which were paused by a federal judge, and prevents additional layoffs of federal employees through January.   Shaun Southworth, a federal employment attorney, said in an Instagram video that the timing of backpay will vary by agency based on their payroll providers, but most employees should start seeing deposits within days.   \"Many employees historically saw deposits within the first business days after reopening,\" he says of the last shutdown. \"A minority may roll to the next cycle if the system needs extra processing.\"   \n   SNAP is back    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Daytona Beach residents wait in their cars during a free food distribution for SNAP recipients organized by the Volusia County Sheriff's Office and The Jewish Federation at the Daytona International Speedway last week.\n                \n                    Miguel J. Rodriguez Carrillo/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Miguel J. Rodriguez Carrillo/AFP via Getty Images\n    \n\n   \n   The bill Congress passed to reopen the government funds the Supplemental Nutrition Assistance Program (SNAP) through September 2026.   The program, which some 42 million Americans rely on for food assistance, has been the subject of much uncertainty — and an escalating legal battle — in recent weeks. The Trump administration said last month that it would suspend SNAP funding in November due to the shutdown, prompting a wide outcry and a series of legal challenges.   \n   While the administration initially said it would comply with two rulings requiring it to provide at least partial funding for SNAP in November, it balked — and ultimately appealed to the Supreme Court — after one of those judges said it must fund the program fully for the month. The Supreme Court paused that order (and extended that pause again on Tuesday, with the end of the shutdown in sight).   At this point, beneficiaries in some states have gotten their full monthly allocations, while others have gotten partial payments or nothing at all. Reopening the government means restarting SNAP, but it's not clear how quickly full payments will resume, since that varies by state. And, as NPR has reported, many who rely on the program are worried that benefits could be cut again.   Smithsonian institutions will reopen on a rolling basis   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Smithsonian National Museum of African American History, closed during the government shutdown, is expected to reopen Friday.\n                \n                    Stefani Reynolds/Bloomberg via Getty Images\n                hide caption\n            \n            toggle caption\n    \n    \n        Stefani Reynolds/Bloomberg via Getty Images\n\n   \n   The Smithsonian, which encompasses 21 museums and the National Zoo, says its reopening will be gradual.   Its website says the National Museum of American History, as well as the National Air and Space Museum and its Virginia annex, the Steven F. Udvar-Hazy Center, will open their doors on Friday.   All other museums and the zoo — including its beloved live animal cams — will reopen to the public \"on a rolling basis\" by Monday.   Air travel won't bounce back overnight   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A passenger waits for his flight at Los Angeles International Airport on Friday, as flight reductions began at major U.S. airports.\n                \n                    Sarah Reingewirtz/Los Angeles Daily News/SCNG\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sarah Reingewirtz/Los Angeles Daily News/SCNG\n    \n\n   \n   The shutdown snarled air travel in a tangle that experts say is beyond a quick fix.   \n   Escalating shortages of air traffic controllers — who have been required to work without pay — caused delays and disruptions at airports nationwide since early October. Then, last week, the Federal Aviation Administration ordered airlines to reduce air traffic at 40 of the country's busiest airports, starting by 4% and ramping up to 10% by this Friday.   \n   The FAA announced Wednesday that it would freeze flight reductions at the current 6% level, citing a rapid improvement in controller staffing. Transportation Secretary Sean Duffy said air traffic controllers will get a lump sum payment equal to 70% of their back pay within 48 hours of the shutdown ending.   The agency says it will continue to assess \"whether the system can gradually return to normal operations.\"   Airlines and aviation regulators have warned that flight disruptions are likely to continue once the government reopens. Airlines had to adjust their schedules to reduce flights, and those changes can take time to reverse.   \"It's going to take a bit to unwind, and the responsibility is not going to fall completely on the air traffic control operation,\" former FAA administrator Randy Babbitt told NPR's All Things Considered on Tuesday. \"A good deal of responsibility will be the carriers getting their schedules and the aircraft and personnel back in the right positions to resume normal flying.\"   Air travel experts have told NPR that even after the shutdown, lingering impacts could potentially complicate Thanksgiving travel — which is always a hectic time to fly.   National Parks start to \"pick up the pieces\"       \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A sign posted by the National Park Service warns of closures at the Benjamin Rush Gardens in Philadelphia during the government shutdown earlier this month.\n                \n                    Matthew Hatcher/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Matthew Hatcher/Getty Images\n    \n\n   \n   Most national parks stayed at least partially open during the shutdown, but with significantly reduced staffing (since thousands of National Park Service employees were furloughed) and limited services like visitor centers and trash pickup.   The National Parks Conservation Association (NPCA), a nonprofit that advocates for national parks, said in a statement that it could take months for returning staff to address the damage.   \n   \"For 43 days, many national parks were left open, vulnerable and unprotected,\" said Kristen Brengel, senior vice president of government affairs at NPCA. \"The National Park Service, already pushed to its breaking point after losing 25% of permanent staff, is left to pick up the pieces.\"   \n   National parks were already feeling the strain before the shutdown, forced by federal funding cuts to cancel ranger programs, close visitors centers and pause maintenance and research.   During the shutdown, parks were unable to collect millions of dollars in entrance and recreational fees, which Brengel says could delay construction projects and other visitor services. And nonprofits which diverted resources to help parks stay operational have depleted their budgets in the process, Brengel says, leaving them \"unsure if they will ever fully recover those funds.\"   Congress' bill funds the National Park Service through January. But Brengel calls it \"only a short-term reprieve,\" warning that another government shutdown could dampen the busy season by affecting the hiring of seasonal rangers for next spring and summer.   The IRS is looking ahead to tax filing season   The IRS furloughed nearly half of its approximately 74,000 workers and tried to lay off roughly 1,400 others — though those cuts were reversed as a result of the bill reopening the government.   The agency's operations were limited during the shutdown. It generally did not pay tax refunds during this period, scaled back its live telephone customer service supports, closed walk-in Taxpayer Assistance Centers and cancelled appointments related to cases with the Independent Office of Appeals and Taxpayer Advocate Service — which it says will be rescheduled once the government reopens.   Tax deadlines and laws remain in effect, and the IRS says it has continued critical operations related to next year's tax-filing season.   \n   But some experts worry that the effects of the shutdown — on top of thousands of IRS job cuts enacted earlier this year — could make for a messy 2026 tax season.   In an October letter to Treasury Secretary Scott Bessent, the American Institute of CPAs (AICPA) urged the IRS to take steps like pausing notice and collection activities during the shutdown. It wrote that since taxpayers can only respond to those by mail, the understaffed agency may not see their letters in time to fix errors or address issues — and will have to deal with an unwieldy backlog when the government reopens.   \n   \"This burden has the real potential to delay the 2026 filing season due to the increased stresses to our entire tax system,\" the accountants wrote.   Such disruptions have happened before.   The 2018-2019 shutdown left the IRS with over 5 million pieces of unprocessed mail, 80,000 unaddressed responses to Fiscal Year 2018 Earned Income Tax Credit audits and 87,000 amended returns waiting to be processed, according to a report by the National Taxpayer Advocate (an independent agency within the IRS).   And years earlier, the 16-day government shutdown in October 2013 delayed billions of dollars of tax refunds and created a backlog of 1.2 million income and Social Security number verification requests, according to the Committee for a Responsible Budget.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A 'We're Hiring' sign is taped to the window of a business in Miami, Florida.  Federal jobs reports were delayed by the government shutdown.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   Delayed economic reports may never be released   The shutdown could leave permanent gaps in economic data.   The Labor Department's Bureau of Labor Statistics typically releases employment reports on the first Friday of each month, a practice that was paused in October and November. Even with the government reopening, their future is uncertain.   White House press secretary Karoline Leavitt told reporters on Wednesday that October's inflation and jobs reports will \"likely never [be] released and all of that economic data released will be permanently impaired.\" She blamed Democrats for the shutdown, which she said \"may have permanently damaged the federal statistical system.\"   The Bureau of Labor Statistics has not commented publicly on the status of the reports or updated its calendar of upcoming release dates. Economists expect the bureau to release its September jobs report (which was nearly ready when the government shut down on Oct. 1) first, and say it's an open question when — or whether — any October reports will be published.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The government shutdown is over, but not everything is back to normal",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6091x3426+0+559/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F76%2F44%2F2504cd06448c880e6dd6887b1f77%2Fgettyimages-2245928654.jpg"
      ],
      "datePublished": "2025-11-13T15:03:52.000Z",
      "dateModified": "2025-11-13T15:03:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We were gone far too long.' House members reflect on longest shutdown",
    "url": "https://www.npr.org/2025/11/13/g-s1-97700/we-were-gone-far-too-long-house-members-reflect-on-longest-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3151x1772+0+164/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2F79%2F71ee98914059862b304483fc68e3%2Fgettyimages-2245863973.jpg",
    "tag": "Politics",
    "date": "2025-11-13T18:53:44.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Speaker of the House Mike Johnson (R) an",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Speaker of the House Mike Johnson (R) and House Majority Leader Steve Scalise chat while on their way to talk with reporters after the vote to re-open the government on Nov. 12. Johnson sent members home after they voted on a continuing resolution to fund the government in mid-September.\n                \n                    Alex Wroblewski/AFP via Getty Images/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Wroblewski/AFP via Getty Images/Getty Images\n    \n\n   \n   After narrowly approving a stopgap funding bill to end the government shutdown last night, the House of Representatives adjourned for the remainder of the week – marking one full day in session after being out for 54 days.   The Wednesday vote was the first time House members voted since House Speaker Mike Johnson, R-La., sent members home after the chamber passed its initial version of a continuing resolution in mid-September.   \n   \"The House did its job,\" Johnson said on the third day of the shutdown when asked why he wasn't having members stay in town. \"The House will come back into session and do its work as soon as [Senate Minority Leader] Chuck Schumer allows us to reopen the government.\"   He kept his word but tensions were high when members returned this week.   \"Long time, no see. I hardly recognize you guys,\" said House Rules Committee ranking member Jim McGovern, D-Mass., at a meeting. \"Where the hell have you been?\"   \n   After repeated comments from Democrats about Republicans being on vacation during the shutdown, Chairwoman Virginia Foxx, R-N.C., stepped in.   \"I am sick and tired of hearing you all say we had an eight-week vacation. I worked every day,\" she said. \"I don't want to hear another soul say that.\"   Although House leadership in both parties held press conferences every day during the shutdown, there was no legislative business of the House for over seven weeks.   \"The halls have been pretty, pretty lonely,\" said California Republican Kevin Kiley on Wednesday. Unlike Republicans, rank and file House Democrats were instructed by their leaders to come to D.C. regularly for caucus meetings.    But Kiley kept showing up to his Capitol office throughout the shutdown.   \n   \"This has not been the finest hour for the United States Congress, having the House of Representatives cancel its sessions while so many people across the country were suffering,\" he told NPR. \"I don't think that either party comes out of this thing in the best light.\"   Kiley said he used the time to work with a colleague on the other side of the aisle to address an extension of Affordable Care Act subsidies that are set to expire at the end of the year – the crux of the shutdown itself.   \n   \"That was, I guess, one advantage of being here – that I have had some constructive conversations like that,\" he said. \"But of course, if the entire House was here, then we could have been having the sort of consensus building process that you need to pass legislation like this.\"   Other GOP members, like Missouri Rep. Mark Alford, said the time back home was useful.   \"In a way, this time away working in the district has been very, very helpful,\" he told NPR. \"I got more done in my district than I think in the three years that I've been [in Congress]. We went to farms, we went to businesses, we visited 14 of our 18 rural hospitals in our district, and it gave us a real clear picture of where America stands right now and what we can do to help.\"   Meanwhile, Democrats are still fuming that the chamber was sent home in the first place.   \"I think that the speaker really has exhibited some poor judgment. I think it was disrespectful to the body,\" said Rep. Julie Johnson, D-Texas.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Adelita Grijalva, D-Ariz., and Speaker of the House Mike Johnson, R-La., speak to the press after Grijalva was sworn in at the Capitol on Nov. 12. 2025.\n                \n                    SAUL LOEB/AFP via Getty Images/AFP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        SAUL LOEB/AFP via Getty Images/AFP\n    \n\n   \n   She called it \"poor form\" for the speaker not to swear in fellow Democrat Adelita Grijalva, who won an Arizona special election in mid-September and was waiting to be sworn in during the shutdown.   Grijalva told NPR's All Things Considered she thinks her support of the effort to release the Jeffrey Epstein files played a role in her wait to get seated.   \n   \"I really like this lady. She's going to be an excellent member of Congress,\" Speaker Johnson said after he swore Grijalva in. \"We followed the custom of the House on the timetable and we've had a little, as we say in the deep South, some intense fellowship about that. But she's here now and I promised that we would have the oath administered before we began legislative business so she hasn't missed a vote.\"   Rep. Melanie Stansbury, D-N.M., said swearing in Grijalva during the shutdown is just one of the business items of the chamber that should have been done last month.   \n   \"For the last 54 days, the House has been completely closed and locked out, and there is all manner of legislative business that could have been going on,\" she told NPR. \"People are angry about the lack of accountability.\"   Stansbury added: \"We should have been here for the entire time.\"   Rep. Steve Womack, R-Ark., agreed with that.   \"We were gone far too long,\" he told NPR. \"I didn't want to go home in August [for recess]. So to be gone for those five or six weeks and then turn around and do it again in October was just – that's just more than Americans should have to put up with.\"   Womack, a longtime appropriator, said he has his eye on the end of January — when Congress has to finish the rest of its spending bills.   \"We're going to be putting Congress on the clock again in another 78, 79 days,\" he said. \"We're going to be right back where we were. I just hope we don't put America back through the same nut roll.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We were gone far too long.' House members reflect on longest shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3151x1772+0+164/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F21%2F79%2F71ee98914059862b304483fc68e3%2Fgettyimages-2245863973.jpg"
      ],
      "datePublished": "2025-11-13T18:53:44.000Z",
      "dateModified": "2025-11-13T18:53:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House dismisses release of Epstein documents as a distraction from Democrats",
    "url": "https://www.npr.org/2025/11/14/nx-s1-5608204/white-house-dismisses-release-of-epstein-documents-as-a-distraction-from-democrats",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-14T12:17:07.000Z",
    "description": "\n      \n      White House dismisses release of Epstein documents as a distraction from Democrats\n    \n        \n                Download\n              ",
    "body": "\n      \n      White House dismisses release of Epstein documents as a distraction from Democrats\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5608204/nx-s1-9533319\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      The White House dismissed the release of new Jeffrey Epstein documents as a distraction by Democrats and maintained President Trump has done nothing wrong, but it's been a tough issue to shake.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House dismisses release of Epstein documents as a distraction from Democrats",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-14T12:17:07.000Z",
      "dateModified": "2025-11-14T12:17:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Congressional candidate on why she opposed her mother's shutdown deal vote",
    "url": "https://www.npr.org/2025/11/14/nx-s1-5608179/congressional-candidate-on-why-she-opposed-her-mothers-shutdown-deal-vote",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-14T09:53:21.000Z",
    "description": "\n      \n      Congressional candidate on why she opposed her mother's shutdown deal vote\n    \n        \n                Download\n                \n     ",
    "body": "\n      \n      Congressional candidate on why she opposed her mother's shutdown deal vote\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5608179/nx-s1-9533297\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Democratic Sen. Jeanne Shaheen voted to end the shutdown without healthcare stipulations. Her daughter, congressional candidate Stefany Shaheen, shares why she disagrees with her mother's decision.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Congressional candidate on why she opposed her mother's shutdown deal vote",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-14T09:53:21.000Z",
      "dateModified": "2025-11-14T09:53:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The House is back. How do members feel?",
    "url": "https://www.npr.org/2025/11/13/nx-s1-5607066/the-house-is-back-how-do-members-feel",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-13T21:53:06.000Z",
    "description": "\n      The House was out of session for the entire government shutdown. Members returned Wednesday with a lot of frustration.   \n\n    SCOTT DETROW, HO",
    "body": "\n      The House was out of session for the entire government shutdown. Members returned Wednesday with a lot of frustration.   \n\n    SCOTT DETROW, HOST:  The House of Representatives came back for one day this week after being gone for more than 50. During the government shutdown, the House was officially out of session. Some members did town halls back in their districts. Others came to the Capitol anyway. But as NPR's Barbara Sprunt reports, there was angst on all sides when everyone reassembled.BARBARA SPRUNT, BYLINE: The House Rules Committee met earlier this week ahead of the full House coming back into session on Wednesday. And let's just say things were tense. Here's Jim McGovern, the top Democrat on the panel.(SOUNDBITE OF ARCHIVED RECORDING)JIM MCGOVERN: Long time no see. I hardly recognize you guys. Where the hell have you been?SPRUNT: After repeated comments from Democrats about Republicans being on vacation during the shutdown, Chairwoman Virginia Foxx stepped in.(SOUNDBITE OF ARCHIVED RECORDING)VIRGINIA FOXX: I am sick and tired of hearing you all say we had an eight-week vacation.YASSAMIN ANSARI: That's exactly what happened.FOXX: I worked every day. I don't know about you.ANSARI: I worked every single day as well.FOXX: But I don't want to hear another soul say that.ANSARI: We all worked every single...SPRUNT: The House passed its version of a stopgap funding bill in mid-September. House Speaker Mike Johnson then sent lawmakers home. He was asked on the third day of the shutdown, why not stay?(SOUNDBITE OF ARCHIVED RECORDING)MIKE JOHNSON: My quick answer's very simple. The House did its job.SPRUNT: Then he blamed Democratic leaders in the Senate for not doing theirs. Leadership on both sides of the aisle held press conferences almost every day of the shutdown, but there were no votes, no committee hearings. Wednesday was the first official day back in 54 days.KEVIN KILEY: It's a lot more crowded here. You know, the halls have been pretty lonely.SPRUNT: That's California Republican Kevin Kiley. He kept showing up to his Capitol office throughout the shutdown.KILEY: To be honest with you, this has not been the finest hour for the United States Congress, having the House of Representatives cancel its sessions while so many people across the country were suffering.SPRUNT: He said he used the time to work with a colleague on the other side of the aisle to address an extension of Affordable Care Act subsidies that are set to expire at the end of the year. Those subsidies were central to the shutdown.KILEY: That was, I guess, one advantage of being here is that we - I have had some constructive conversations like that. But of course, if the entire House was here, then we could have been having this sort of consensus-building process that you need to pass legislation like this.SPRUNT: Fellow Republican Mark Alford of Missouri said the time back home was useful.MARK ALFORD: Look, I've been here for three years. I got more done in my district than I think in the three years that I've been there. I've been able to visit farms. We went to businesses. We visited 14 of 18 rural hospitals in our district. And it gave us a real clear picture where America stands right now and what we can do to help.SPRUNT: Meanwhile, Democrats are still fuming that the House was even sent home at all.JULIE JOHNSON: This was a ridiculous thing.SPRUNT: That's Julie Johnson, a freshman Democrat from Texas.J JOHNSON: I think that the speaker really has exhibited some poor judgment, and it was disrespectful to the body. And then the speaker refusing to swear in a dully elected, that was poor form.SPRUNT: She's referring to Arizona Democrat Adelita Grijalva, who won a special election in mid-September but wasn't sworn in until yesterday before any votes. The common refrain from Democrats, like New Mexico's Melanie Stansbury, is this.MELANIE STANSBURY: The House has been completely closed and locked out, and there is all manner of legislative business that could have been going on, and we should have been here the entire time.SPRUNT: Republican Steve Womack of Arkansas says he agrees with that.STEVE WOMACK: Listen, I didn't want to go home in August. So to be gone for those five or six weeks and then turn around and do it again in October was just - that's just more than America should have to put up with.SPRUNT: He's a senior appropriator, and he's now looking down the road at what lies ahead.WOMACK: We're going to be putting Congress on the clock again in another 78, 79 days. We're going to be right back where we were. I just hope we don't put America back through the same nut roll.SPRUNT: Funding for much of the government will run out again January 30.Barbara Sprunt, NPR News, the Capital.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The House is back. How do members feel?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-13T21:53:06.000Z",
      "dateModified": "2025-11-13T21:53:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What comes next as lawmakers push for the release of documents from Epstein's estate",
    "url": "https://www.npr.org/2025/11/13/nx-s1-5607056/what-comes-next-as-lawmakers-push-for-the-release-of-documents-from-epsteins-estate",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-13T11:41:09.000Z",
    "description": "\n      NPR's A Martinez speaks with Rep. Ro Khanna, D-Calif., about the next steps in the push to release thousands of pages of documents from Jeffrey",
    "body": "\n      NPR's A Martinez speaks with Rep. Ro Khanna, D-Calif., about the next steps in the push to release thousands of pages of documents from Jeffrey Epstein's estate.   \n\n    A MARTÍNEZ, HOST:  California Congressman Ro Khanna joins us now. He's a Democrat on the House Oversight Committee, which released thousands of documents from the Epstein estate. Congressman, so we just heard about that vote that House Speaker Mike Johnson is going to hold next week on that measure forcing the DOJ to release the Epstein files. Now, that's actually very early, earlier than he's required. Why do you think he's choosing to accelerate that timeline?RO KHANNA: Well, this is Thomas Massie and my bill. We've been fighting for it for five months. He realizes now when we got to 218 signatures yesterday that 40 to 50 Republicans in his caucus will vote for the release. This will be the largest vote of MAGA base against Donald Trump since Donald Trump walked down the escalator. And I think Johnson is just bowing to reality. He knows that he's going to have to have this vote, so why not get it over with soon?MARTÍNEZ: Yeah, 'cause he could've waited until December. But that also means that everyone has until December to discuss and kind of go over it.KHANNA: Exactly. And every day that's passing, there are more Republicans who are joining our effort. Look, this is a case of rich and powerful men who abused young girls. There are over 1,000 victims. This is not really a partisan issue. And the entire Epstein class needs to go in our politics. We need to restore our politics for working people and ordinary people. And I don't care whether there were Republicans or Democrats implicated, that class needs to leave. And the left and right actually is coming together on this.MARTÍNEZ: I want to talk about, though, the substance of the newly released documents. So Democrats released a few specific emails where Epstein mentioned Trump. And that's out of the 20,000 emails that the committee had in its possession. What do you think those particular emails that your party decided to highlight, what do they say about Trump's relationship with Epstein?KHANNA: Well, those emails clearly show that he had a significant relationship. The emails suggest that he at the very least knew that Epstein was engaged in illegal conduct. And the question is raised, well, why didn't he say anything? And how much did he know? And the question is also raised, who else knew? I mean, from talking to the victims' lawyers who've seen these files, they believe that there are hundreds of men who either knew about Epstein's abuse and kept quiet or who actually participated in a farm system where Epstein gave them women to abuse.MARTÍNEZ: So, Congressman, are you saying that there could be criminal guilt by association here?KHANNA: No, I would not go that far. And this effort has never been actually just about Donald Trump. What I will say is that there have been a lot of people who have acted with moral guilt. There are some people who may have criminal guilt. But the point is these rich and powerful men should not have university buildings named after them. They should not have scholarships named after them. They should not be lionized in society. And so far, they've been shielded. And what Thomas Massie and I are trying to do is expose all of this, have a lead accountability and make it clear that there was a lot of abuse and corruption in our government. And the focus needs to be on these women and survivors.MARTÍNEZ: Do you think that we will ever kind of get past this? I mean, everyone, I'm talking from Congress to all of us who cover this, is this going to be just something we'll always have in the back of our minds?KHANNA: I do believe we can get past this. This vote next week is going to be historic. It's the first time that Congress is going to go on record to say the Epstein files should be released. I hope it'll push the Senate to vote, especially if we get big numbers. And then I hope that within the next six months, the files are released.But the reason this has resonated with the American public is there's a feeling that the American dream is dead. There's a feeling that rich and powerful people have too much money controlling our government, that they get away with things ordinary Americans can't and that they need to be held accountable, if not criminally, at least morally, at least politically. And that we need to restore a sense of standing up for survivors, protecting America's kids and having a politics where billionaires can't just buy off politicians and avoid the rules.MARTÍNEZ: Quickly, even though if it would pass the Senate, the president would need to sign it into law, which is unlikely. Then what's the point of holding this vote at all? Just a few seconds, Congressman.KHANNA: First of all, we may get a veto-proof vote in the House. You could get that in the Senate, and it will put such incredible pressure for the MAGA base to be voting against the president. That has never happened in his first term or second term.MARTÍNEZ: That's Democratic Representative Ro Khanna of California. Thank you very much.KHANNA: Thank you.MARTÍNEZ: Now, we've also invited Republican lawmakers to speak with us on this and other news. Those invitations remain open.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What comes next as lawmakers push for the release of documents from Epstein's estate",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-13T11:41:09.000Z",
      "dateModified": "2025-11-13T11:41:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What new Epstein emails say. And, ACA subsidies in limbo",
    "url": "https://www.npr.org/2025/11/13/g-s1-97674/up-first-newsletter-jeffrey-epstein-trump-government-reopens-aca",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7798x4386+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F40%2Ff6%2F63447a144754889ae857d2d6e163%2Fgettyimages-2245832638.jpg",
    "tag": "Politics",
    "date": "2025-11-13T11:58:39.000Z",
    "description": "\n      \n      Epstein Documents Dump, Government Reopens, Affordable Care Act Limbo\n    \n            \n                \n                Transcript\n    ",
    "body": "\n      \n      Epstein Documents Dump, Government Reopens, Affordable Care Act Limbo\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/g-s1-97674/nx-s1-mx-5805006\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.   Today's top stories   The House Oversight Committee yesterday released over 20,000 documents turned over to Congress from Jeffrey Epstein's estate. Among the documents were new emails from the convicted sex offender that mention President Trump, often expressing displeasure with him and his presidency. Democrats and Republicans have differing views on what the documents say about Epstein.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester holds a sign related to the release of the Jeffrey Epstein case files outside the U.S. Capitol in Washington, D.C., on Nov. 12, 2025. Democrats released emails Wednesday in which Jeffrey Epstein suggested Donald Trump was aware of the disgraced financier's sexual abuse and had \"spent hours\" with one of his victims at his house.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   🎧 The majority of the emails were obsessively tracking Trump's ascent to the presidency from 2015 to 2018. Epstein mocked Trump and even wrote a note saying there isn't one decent cell in Trump's body to former Treasury Secretary Lawrence Summers, NPR's Stephen Fowler tells Up First. White House press secretary Karoline Leavitt said the release of the emails proves nothing. House Speaker Mike Johnson has been opposed to the effort from some Republicans and Democrats to release all unclassified files held by the Justice Department around the life and death of Epstein, who died by suicide while awaiting trial in 2019. Arizona Rep. Adelita Grijalva was sworn into Congress yesterday, meaning the bipartisan push now has enough support to force a House floor vote on the Epstein files bill.   \n   The longest government shutdown in U.S. history is now over after Trump signed a bill to fund it last night. The bill includes measures that reverse the layoffs imposed by the Trump administration during the shutdown, provide back pay for federal employees, and fund some agencies through the end of next September. The bill does not extend enhanced Affordable Care Act subsidies, which expire at the end of the year.    🎧 NPR's Barbara Sprunt says she is watching how Democrats will craft a bill that could appeal to Republicans, addressing the expiring subsidies during the promised December vote in the Senate on the issue. If they are successful, Democrats will be able to begin the new year with a policy victory. If Republicans oppose the bill, Democrats will have what they see as a winning issue to campaign on: the high cost of health care.🎧 There are signals that a one-year extension of the federal subsidies could be possible, but there is no concrete deal at this point, says NPR's Selena Simmons-Duffin. Republicans say that the subsidies don't address the rising health costs and that they were supposed to be a temporary pandemic policy. Meanwhile, Democrats want to maintain the generous subsidies that have kept the monthly premium costs down.   \n   Israel deported 154 Palestinian prisoners last month as part of the exchange for Hamas freeing its final group of Israeli hostages. The prisoners were sent into exile in Cairo, never to return to their homes in the Palestinian territories. Israeli security experts say the deportation policy aims to prevent released prisoners from re-engaging in militant activities, but past incidents indicate that this practice can have unintended long-term consequences for Israeli security.   Living better   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Experts recommend starting hormone therapy before the age of 60 or within ten years of the start of menopause.\n                \n                    MStudioImages/E+/Getty images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        MStudioImages/E+/Getty images\n    \n\n   \n   Living Better is a special series about what it takes to stay healthy in America.   The FDA plans to remove warning labels from estrogen-based hormone therapy used to treat menopause symptoms. These warnings originated from the early 2000s when a Women's Health Initiative study found this type of therapy increased the risk of heart attacks, strokes, blood clots and breast cancer. However, experts now believe that more is known about safe and effective combinations of therapy when it is started earlier than the age of the women in the study, which was 63. Here are some things to consider when talking to your healthcare provider about the therapy:    👩‍⚕️ Experts recommend starting the therapy before the age of 60 or within the first 10 years of menopause onset.👩‍⚕️ Have a discussion about how long you should be on the therapy. In general, women stay on it for three to five years, but that isn't a hard rule.👩‍⚕️ For those who prefer not to undergo hormone therapy, there are alternatives available. The FDA has approved two non-hormonal medications for treating severe hot flashes during menopause.   Picture show   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Aurora Borealis lights up the night sky over Monroe, Wisconsin on Tuesday night.\n                \n                    Ross Harried/NurPhoto via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Ross Harried/NurPhoto via Getty Images\n    \n\n   \n   Colorful northern lights painted the skies with vibrant hues of green and pink on Tuesday night due to strong geomagnetic storms. The aurora borealis was spotted in a large swath of states, including Tennessee, New York, New Mexico and Idaho. The northern lights could be seen as far south as parts of Florida and Alabama, a relatively rare occurrence highlighting the severity of this week's storms. Auroras are becoming more frequent in the U.S. as the sun approaches the peak of its 11-year solar cycle. This trend is expected to continue for several months. See photos of this week's natural light display and read how to photograph them.   \n   3 things to know before you go   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In a ceremonial event in Philadelphia Wednesday, the U.S. Mint produced its last penny. The one-cent coin, introduced 232 years ago, is being phased out because each one cost nearly 4 cents to produce.\n                \n                    Justin Sullivan/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Justin Sullivan/Getty Images North America\n    \n\n   \n   In a penny-pinching move by the federal government, the final one-cent coin was minted in Philadelphia yesterday.NPR's Word of the Week is \"nostalgia,\" which originated as a medical diagnosis, but has evolved into a complex emotion that can also be a money-maker.When Stacia was 21, she was struggling with severe depression. After leaving a hospital where she was under close supervision, Stacia walked to a nearby road and stuck her thumb out for a ride. A woman, her unsung hero, stopped for her, asking a simple question that helped Stacia shape her life.   This newsletter was edited by Obed Manuel.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What new Epstein emails say. And, ACA subsidies in limbo",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7798x4386+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F40%2Ff6%2F63447a144754889ae857d2d6e163%2Fgettyimages-2245832638.jpg"
      ],
      "datePublished": "2025-11-13T11:58:39.000Z",
      "dateModified": "2025-11-13T11:58:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]