[
  {
    "title": "'I'm not going to be intimidated': Rep. Crow responds to Trump's sedition threat",
    "url": "https://www.npr.org/2025/11/21/nx-s1-5615204/im-not-going-to-be-intimidated-rep-crow-responds-to-trumps-sedition-threat",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-21T11:48:50.000Z",
    "description": "'I'm not going to be intimidated': Rep. Crow responds to Trump's sedition threat   NPR's Leila Fadel asks Democratic Congressman and former Army Range",
    "body": "'I'm not going to be intimidated': Rep. Crow responds to Trump's sedition threat   NPR's Leila Fadel asks Democratic Congressman and former Army Ranger Jason Crow for his response to President Trump after Crow participated in a video urging U.S. troops to refuse illegal orders.\n\n\n    \n        Politics\n    \n\n\n                  \n            November 21, 20256:48 AM ET\n         \n      \n\n      \n      'I'm not going to be intimidated': Rep. Crow responds to Trump's sedition threat\n   \n        \n            Audio will be available later today.\n        \n\n\n\n\n\n      NPR's Leila Fadel asks Democratic Congressman and former Army Ranger Jason Crow for his response to President Trump after Crow participated in a video urging U.S. troops to refuse illegal orders.   \n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'I'm not going to be intimidated': Rep. Crow responds to Trump's sedition threat",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-21T11:48:50.000Z",
      "dateModified": "2025-11-21T11:48:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump calls lawmakers' message to military to refuse illegal orders 'seditious'",
    "url": "https://www.npr.org/2025/11/21/nx-s1-5612519/trump-calls-lawmakers-message-to-military-to-refuse-illegal-orders-seditious",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-21T11:48:55.000Z",
    "description": "\n      \n      Trump calls lawmakers' message to military to refuse illegal orders 'seditious'\n   \n        \n            Audio will be available later t",
    "body": "\n      \n      Trump calls lawmakers' message to military to refuse illegal orders 'seditious'\n   \n        \n            Audio will be available later today.\n        \n\n\n\n\n      Six Democratic lawmakers, who also served in the military, released a video this week reminding U.S. troops to refuse \"illegal orders,\" drawing the ire of President Trump and his supporters.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump calls lawmakers' message to military to refuse illegal orders 'seditious'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-21T11:48:55.000Z",
      "dateModified": "2025-11-21T11:48:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After calling him a 'communist,' Trump will meet Mamdani in the Oval Office Friday",
    "url": "https://www.npr.org/2025/11/21/nx-s1-5615169/trump-mamdani-oval-office-communist-socialist",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+600/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fee%2Fce%2F123541214356aa4e923f4dce1bb0%2Fgettyimages-2246989708.jpg",
    "tag": "Politics",
    "date": "2025-11-21T10:00:00.000Z",
    "description": "\n      \n      After calling him a 'communist,' Trump will meet Mamdani in the Oval Office Friday\n   \n        \n            Audio will be available late",
    "body": "\n      \n      After calling him a 'communist,' Trump will meet Mamdani in the Oval Office Friday\n   \n        \n            Audio will be available later today.\n        \n\n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This combination of pictures created on Nov. 19, 2025, shows President Trump on Oct. 24, 2025,(L) and New York City Mayor-elect Zohran Mamdani in New York City, on Nov. 12, 2025.\n                \n                    Andrew Caballero-Reynolds/Charly Triballeau/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/Charly Triballeau/AFP via Getty Images\n    \n\n   \n   President Trump will meet with New York Mayor-elect Zohran Mamdani at the White House on Friday afternoon in the Oval Office, marking the first time the two will be face-to-face.   While previous incoming New York City mayors have met with sitting presidents, Mamdani and Trump have already clashed prior to this meeting. Trump has repeatedly sought to paint Mamdani, a 34-year-old Democratic socialist, as too radical and extreme for the city that the president long called home. In the president's announcement of the meeting on Truth Social, Trump called Mamdani a \"communist.\"   It's a narrative that Mamdani has firmly pushed back on, vowing to carry out his agenda focused on lowering the cost of living.   \n   \"My team reached out to the White House to set up this meeting because I will work with anyone to make life more affordable for the more than eight and a half million people who call this city home,\" Mamdani told reporters on Thursday. \"I have many disagreements with the president, and I believe that we should be relentless and pursue all avenues and all meetings that could make our city affordable for every single New Yorker.\"   Trump has been a vocal opponent of Mamdani since his upset win in June's Democratic primary, saying he would arrest Mamdani if he disrupted ICE operations in the city and threatening to pull the city's federal funding should he win in November.   \"Look, we don't need a communist in this country, but if we have one, I'm going to be watching over him very carefully on behalf of the nation,\" Trump told reporters over the summer, shortly after Mamdani's primary win. Mamdani responded directly to Trump in his victory speech on election night. \"Donald Trump, since I know you're watching, I have four words for you: Turn the volume up,\" he said, adding, \"to get to any of us, you will have to get through all of us.\"   \n   Over the course of just months, Mamdani's candidacy for mayor turned from a long-shot bid to a national movement, sparking interest far beyond New York in his progressive ideas, including freezing rent in rent-stabilized units, making city buses free and opening city-run grocery stores; and skepticism about how the new mayor will find the money to pay for it all.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After calling him a 'communist,' Trump will meet Mamdani in the Oval Office Friday",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+600/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fee%2Fce%2F123541214356aa4e923f4dce1bb0%2Fgettyimages-2246989708.jpg"
      ],
      "datePublished": "2025-11-21T10:00:00.000Z",
      "dateModified": "2025-11-21T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pras Michel of the Fugees sentenced to 14 years over illegal campaign donations",
    "url": "https://www.npr.org/2025/11/21/g-s1-98692/pras-michel-fugees-sentenced-14-years",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4510x2537+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5d%2F66%2F2433c9bd410fbfe4c2c6b6b1eea6%2Fap25324780985712.jpg",
    "tag": "Politics",
    "date": "2025-11-21T08:37:03.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Prakazrel \"Pras\" Michel, a member of the",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Prakazrel \"Pras\" Michel, a member of the 1990s hip-hop group the Fugees, accompanied by defense lawyer David Kenner, right, arrives at federal court April 3, 2023, in Washington.\n                \n                    Andrew Harnik/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/AP\n    \n\n   \n   WASHINGTON — Grammy-winning rapper Prakazrel \"Pras\" Michel of the Fugees was sentenced on Thursday to 14 years in prison for a case in which he was convicted of illegally funneling millions of dollars in foreign contributions to former President Barack Obama's 2012 reelection campaign.   \n   Michel, 52, declined to address the court before U.S. District Judge Colleen Kollar-Kotelly sentenced him.   In April 2023, a federal jury convicted Michel of 10 counts, including conspiracy and acting as an unregistered agent of a foreign government. The trial in Washington, D.C., included testimony from actor Leonardo DiCaprio and former Attorney General Jeff Sessions.   Justice Department prosecutors said federal sentencing guidelines recommended a life sentence for Michel, whom they said \"betrayed his country for money\" and \"lied unapologetically and unrelentingly to carry out his schemes.\"   \n   \"His sentence should reflect the breadth and depth of his crimes, his indifference to the risks to his country, and the magnitude of his greed,\" they wrote.   Defense attorney Peter Zeidenberg said his client's 14-year sentence is \"completely disproportionate to the offense.\" Michel will appeal his conviction and sentence, according to his lawyer.   Zeidenberg had recommended a three-year prison sentence. A life sentence would be an \"absurdly high\" punishment for Michel given that it is typically reserved for deadly terrorists and drug cartel leaders, Michel's attorneys said in a court filing.   \"The Government's position is one that would cause Inspector Javert to recoil and, if anything, simply illustrates just how easily the Guidelines can be manipulated to produce absurd results, and how poorly equipped they are, at least on this occasion, to determine a fair and just sentence,\" they wrote.   \n   Michel, a Brooklyn native whose parents immigrated to the U.S. from Haiti, was a founding member of the Fugees along with childhood friends Lauryn Hill and Wyclef Jean. Their hip-hop band won two Grammy Awards and sold tens of millions of albums.   Michel obtained over $120 million from Malaysian billionaire Low Taek Jho — also known as Jho Low — and steered some of that money through straw donors to Obama's campaign.   Michel also tried to end a Justice Department investigation of Low, tampered with two witnesses and perjured himself at trial, prosecutors said.   \n   Low, who has lived in China, was one of the primary financiers of \"The Wolf of Wall Street,\" a movie starring DiCaprio. Low is a fugitive but has maintained his innocence.   \"Low's motivation for giving Mr. Michel money to donate was not so that he could achieve some policy objective. Instead, Low simply wanted to obtain a photograph with himself and then-President Obama,\" Michel's attorneys wrote.   In August 2024, the judge rejected Michel's request for a new trial based in part on his defense attorney's use of a generative AI program during his closing of the trial's arguments. The judges said that and other trial errors didn't amount to a serious miscarriage of justice.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pras Michel of the Fugees sentenced to 14 years over illegal campaign donations",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4510x2537+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5d%2F66%2F2433c9bd410fbfe4c2c6b6b1eea6%2Fap25324780985712.jpg"
      ],
      "datePublished": "2025-11-21T08:37:03.000Z",
      "dateModified": "2025-11-21T08:37:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House condemns Democratic lawmakers' video but backs off Trump's posts",
    "url": "https://www.npr.org/2025/11/20/nx-s1-5615190/trump-democrats-military-video-seditious",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4326x2433+0+224/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F25%2Fb4f8f97b4550adf3b9fe4c882b71%2Fgettyimages-2246817024.jpg",
    "tag": "Politics",
    "date": "2025-11-20T18:23:08.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump steps out to welcome the",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump steps out to welcome the Crown Prince of Saudi Arabia Mohammed bin Salman prior to a state dinner at the White House on Tuesday.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   White House press secretary Karoline Leavitt said Thursday President Trump does not actually want to see members of Congress executed despite his social media post earlier in the day, calling a video by some members \"seditious behavior, punishable by DEATH!\"   Trump made a pair of posts on his site, Truth Social, in response to a video posted by Reps. Jason Crow, D-Colo., Chris DeLuzio, D-Pa, Maggie Goodlander, D-N.H., and Chrissy Houlahan, D-Pa., and Sens. Mark Kelly, D-Ariz., and Elissa Slotkin, D-Mich., where the lawmakers address members of the military and intelligence communities and said, \"You can refuse illegal orders,\" repeating the phrase several times before saying, \"You must refuse illegal orders.\"   \n   The lawmakers, all of whom come from military backgrounds, said, \"This administration is pitting our uniformed military and intelligence community professionals against American citizens.\" The video, posted to Facebook, also says \"right now the threats of our Constitution aren't just coming from abroad but right here at home.\"   Asked during the daily White House briefing if he wanted execute members of Congress, Leavitt said: \"No.\"   \"The sanctity of our military rests on the chain of command, and if that chain of command is broken, it can lead to people getting killed. It can lead to chaos, and that's what these members of Congress who swore an oath to abide by the Constitution are essentially encouraging,\" Leavitt said.   The president also reposted a series of comments from users on Truth Social, including posts that said the Democrats should be hanged, the actions were an insurrection and they should all be indicted because of the video.   In the video Democrats didn't call out any specific actions that military or intelligence officials have been told to carry out, but they said that the Trump administration is \"pitting our uniformed military and intelligence community professionals against American citizens.\" They added that military and intelligence personnel swore an oath to protect and defend the Constitution.   \n   \"Right now the threats to our Constitution aren't just coming from abroad, but right here at home,\" they said. \"No one has to carry out orders that violate the law or our Constitution.\"   They ended the video by telling those in the military and intelligence officials, \"Don't give up the ship,\" referring to the famous last words of James Lawrence, a Navy Captain during the war of 1812, to keep fighting and not surrender.   Members of the military do swear an oath to the Constitution and are trained that \"following orders\" is not a defense for illegal acts.   The lawmakers issued a joint statement to Trump's response, saying in part, \"We are veterans and national security professionals who love this country and swore an oath to protect and defend the Constitution of the United States. That oath lasts a lifetime, and we intend to keep it. No threat, intimidation, or call for violence will deter us from that sacred obligation.\"   \"Every American must unite and condemn the President's calls for our murder and political violence. This is a time for moral clarity,\" they said.   House Democratic leadership — House Minority Leader Hakeem Jeffries, of New York, whip Katherine Clark of Massachusetts and Caucus Chair Pete Aguilar of California — called for Trump to remove the posts and for Republicans to condemn them.   \"We unequivocally condemn Donald Trump's disgusting and dangerous death threats against Members of Congress and call on House Republicans to forcefully do the same,\" they wrote.   \"We have been in contact with the House Sergeant at Arms and the United States Capitol Police to ensure the safety of these Members and their families,\" the statement adds. \"Donald Trump must immediately delete these unhinged social media posts and recant his violent rhetoric before he gets someone killed.\"   Trump hasn't deleted the social media posts. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House condemns Democratic lawmakers' video but backs off Trump's posts",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4326x2433+0+224/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F25%2Fb4f8f97b4550adf3b9fe4c882b71%2Fgettyimages-2246817024.jpg"
      ],
      "datePublished": "2025-11-20T18:23:08.000Z",
      "dateModified": "2025-11-20T18:23:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump and Marjorie Taylor Greene had a falling out over Epstein. What changed?",
    "url": "https://www.npr.org/2025/11/20/nx-s1-5612438/trump-and-marjorie-taylor-greene-had-a-falling-out-over-epstein-what-changed",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-20T20:54:05.000Z",
    "description": "\n      Marjorie Taylor Greene rose to prominence as one of President Trump's most outspoken allies. But in recent months she's begun to criticize him.",
    "body": "\n      Marjorie Taylor Greene rose to prominence as one of President Trump's most outspoken allies. But in recent months she's begun to criticize him. What is driving the shift?   \n\n    AILSA CHANG, HOST:  Congresswoman Marjorie Taylor Greene became a household name as one of President Trump's most outspoken allies. But now the Georgia Republican is making headlines for a very different reason - her criticisms of the president. And that has led to a very public break between the two of them, including a new nickname from Trump just this week.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Marjorie traitor Greene.CHANG: NPR congressional reporter Sam Gringlas explains what's behind Greene's shift.SAM GRINGLAS, BYLINE: On a brisk morning this week, Congresswoman Marjorie Taylor Greene stood outside the Capitol with some of the women abused by convicted sex offender Jeffrey Epstein. For months, Greene had been publicly pressing President Trump and top Republicans in Congress to release the case files from two federal investigations into Epstein. Trump called Greene a traitor.(SOUNDBITE OF ARCHIVED RECORDING)MARJORIE TAYLOR GREENE: I've never owed him anything, but I fought for him and for America First. And he called me a traitor for standing with these women.GRINGLAS: The cracks had been growing over the last year, as Greene increasingly pointed out where she saw the president falling short on the war in Gaza, on expiring health subsidies. And she was doing it not just on social media or in right-wing outlets, but on programs like ABC's \"The View.\"(SOUNDBITE OF TV SHOW, \"THE VIEW\")WHOOPI GOLDBERG: Someone you might be surprised to see here.JOY BEHAR: (Laughter).GOLDBERG: Please welcome Congresswoman Marjorie Taylor Greene.(APPLAUSE)NATHAN PRICE: I was thinking if this was the first time I've ever seen this person, it sounds like a normal congressperson from \"Schoolhouse Rock!\"GRINGLAS: That's University of North Georgia Professor Nathan Price, who says this new persona may be hard to square with the Greene many Americans first got to know, the congresswoman who had embraced QAnon conspiracy theories, liked a post that called for violence against former House Speaker Nancy Pelosi and heckled a school shooting survivor in 2020.(SOUNDBITE OF ARCHIVED RECORDING)GREENE: ...Using your lobby and the money behind it and try to take away my Second Amendment rights. You don't have anything to say for yourself?GRINGLAS: Even Trump has been publicly musing, what happened to Marjorie? Georgia Republican strategist Brian Robinson says it's a fair question.BRIAN ROBINSON: I am open to the idea that she's had a road to Damascus moment, a conversion, that she sees the errors of the toxicity and wants something that's better.GRINGLAS: Robinson says this could be a natural evolution for the former suburban CrossFit gym owner.ROBINSON: You know, we love to elect outsiders to Congress. They go to Congress with very little idea of how it works. And if at some point, you're like, I want to do substantive things that make America better, then I got to do this a little bit different.GRINGLAS: Or she may be trying to broaden her appeal for higher office. Trump said last week he showed Greene polling earlier this year suggesting she would flounder in a race for governor or Senate.ROBINSON: Is she intentionally signaling to women the good old boys club ignores us? I understand your struggles?GRINGLAS: Both Robinson and Price say Greene's evolution is more about style than substance. She's disavowed some of her more controversial views, but the anti-interventionist, anti-elite principles that propelled her to Congress are still core to her identity.RICKY HESS: What she's responding to is believing that the president has shifted on these issues.GRINGLAS: Ricky Hess, who chairs the Paulding County Republican Party, spends a lot of time talking with voters in the 14th Congressional District.HESS: The issues that they want to talk about involve high property taxes, high health care costs, whether or not their kids will be able to buy a house when they graduate.GRINGLAS: Hess says Greene's America First world view resonates in this heavily working-class and rural district.HESS: I believe that she's pretty tapped into what her constituents are wanting, and I have to believe that most of her actions are in service to that.GRINGLAS: Hess says voters see Trump and Greene as fighters on the same team. But Martha Zoller, who hosts a political talk radio show that airs across North Georgia, says not everyone's mind is made up.MARTHA ZOLLER: People are kind of reeling, if you want to know the truth. We haven't had a lot of listeners discussing it because I think they're waiting to see what happens.GRINGLAS: Zoller says the conflict is about more than just two big personalities falling out on the national stage.ZOLLER: I think that the big discussion we're going to be having as Republicans over the next three years is, what is the Republican movement once it's not Trump?GRINGLAS: Zoller says it looks like Greene wants to be a part of that discussion.Sam Gringlas, NPR News, Washington.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump and Marjorie Taylor Greene had a falling out over Epstein. What changed?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-20T20:54:05.000Z",
      "dateModified": "2025-11-20T20:54:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In Miami Beach, the New York City mayoral election is an opportunity",
    "url": "https://www.npr.org/2025/11/21/nx-s1-5612255/miami-beach-new-york-mamdani-times-square-billboards",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1080x608+0+457/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F71%2Fbf%2Fc67f346340f39c3c50bea7db0bbe%2F582093804-18163711639387561-6150205341472954023-n.jpg",
    "tag": "Politics",
    "date": "2025-11-21T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Florida developer Russell Galbutt believ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Florida developer Russell Galbutt believes the election of a Democratic Socialist as mayor, Zohran Mamdani, in New York City is an opportunity to lure wealthy residents and their businesses to Miami Beach.\n                \n                    Steven Meiner/Facebook\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Steven Meiner/Facebook\n    \n\n   \n   MIAMI — People in New York's Times Square recently may have noticed, among the many electronic billboards, images of a beach, blue water and a caption, \"Miami Beach is open for business.\"   The ads are being paid for by a Florida developer who believes the election of Democratic Socialist Zohran Mamdani as mayor of New York City is an opportunity to lure wealthy residents and their businesses south.   \n   \"We have yet to see how the new mayor is going to do. But there's no question that there's a lot of surprise and shock,\" said Russell Galbutt, one of Miami Beach's biggest developers.    Galbutt's ad campaign builds on messaging from Miami Beach Mayor Steven Meiner on social media, which was directed at city residents unhappy with the election results.   \"We're just highlighting, 'Hey, if you're looking for a law and order city with sunshine, with no state income tax, there's a lot of positives for why you should be here,'\" Meiner told NPR. \"The mayor-elect is a self-described socialist and I think there's a concern about the freedom of businesses to act as capitalist businesses need to. But there's also a concern by Jewish residents and businesses.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Miami Beach Mayor Steven Meiner says the city's beaches, sunshine and no state income tax should be a lure for New Yorkers ready to leave the city.\n                \n                    Greg Allen/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Greg Allen/NPR\n    \n\n   \n   Mamdani alarmed some Jewish voters because of his support for Palestinian rights and critical views of Israel. Exit polls showed Mamdani received about a third of the Jewish vote in this month's election. His office did not return a request for comment on the billboard campaign.   \n   Galbutt decided to fund an ad campaign out of frustration over what he views as economic stagnation at one of Florida's most popular resort destinations. After years of violence during spring break, which included some shootings, Miami Beach adopted tough measures two years ago that have been effective. But a decline in sales tax revenue and business closures since then show something else is needed, the developer said.    \"Miami Beach went into an entire campaign to tell people that we didn't want spring breakers in Miami Beach any longer,\" Galbutt said. \"But we never spent five cents or $5 on a campaign saying who we do want.\"    Meiner is more upbeat about the business climate in Miami Beach,  pointing to a $30 million revitalization project underway to boost its Lincoln Road business district.    \"We have Lamborghini ... opening up a showroom in Miami Beach. A Swiss watchmaker is coming here,\" he said. \"There's a lot of investment coming here. And we're just highlighting for people who maybe hadn't thought of Miami Beach, that they should be.\"   Meiner said he's received mostly positive comments from residents about his push to attract more New Yorkers to Miami Beach. But he acknowledged he did get some pushback on social media.    \n   \"The negatives,\" he said, \"were really directed like, 'Why are you trying to bring more residents here? We already have a lot of traffic.'\"    \n   Among Miami Beach residents, an informal survey found mostly support for a campaign to bring more New Yorkers to the city. Asked if Miami Beach needs more New Yorkers, retiree Neil Kahanovitz said, \"Well, having come from New York, I wouldn't mind a few more.\"   Kahanovitz came to Miami Beach because he got tired of \"the cold, the crowds, the crime and the high taxes.\" As for whether the election of a Democratic Socialist mayor would encourage more people to leave the city? \"It's certainly not going to encourage them to stay,\" he said.   Michael Sprotzer, another Miami Beach resident, is skeptical that a wave of New Yorkers and their businesses will soon be heading south. Sprotzer, who works in real estate, noted some of the investment firms who during COVID moved their offices to South Florida, have since moved back to New York.   \"I think maybe some people who are thinking about coming to South Florida, it will be a good impetus for them to do so,\" he said. \"But I don't think people who love New York are all of a sudden going to move down here.\"       \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In Miami Beach, the New York City mayoral election is an opportunity",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1080x608+0+457/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F71%2Fbf%2Fc67f346340f39c3c50bea7db0bbe%2F582093804-18163711639387561-6150205341472954023-n.jpg"
      ],
      "datePublished": "2025-11-21T10:00:00.000Z",
      "dateModified": "2025-11-21T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How could Trump interfere in the midterms? Here's what voting officials are watching",
    "url": "https://www.npr.org/2025/11/21/nx-s1-5599934/2026-trump-midterm-election-ballots-voting-national-guard",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8332x4687+0+449/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2F05%2Fe329fb31435b851429e3a3c302f5%2Fgettyimages-2244493791.jpg",
    "tag": "Politics",
    "date": "2025-11-21T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Voters fill out their ballots at a polli",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Voters fill out their ballots at a polling place on Election Day, Nov. 4, in Minneapolis, Minn.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   Less than a year from the midterm elections, state and local voting officials from both major political parties are actively preparing for the possibility of interference by a federal government helmed by President Trump.   The problem is, no one knows what might be coming.   Steve Simon, the Democratic secretary of state of Minnesota, likened it to planning for natural disasters.   \"You have to use your imagination to consider and plan for the most extreme scenario,\" Simon said.   Carly Koppes, the Republican clerk of Weld County in Colorado, said officials in her state are shoring up their relationships with local law enforcement and county and state attorney's offices, to make sure any effort to interfere with voting is \"met with a pretty good force of resistance.\"   \n   \"We have to plan for the worst and hope we get the best,\" Koppes said. \"I think we're all kind of conditioned at this point to expect anything and everything, and our bingo cards keep getting bigger and bigger with things that we would have never have had on them.\"   \n   Trump, who continues to spread false claims about voting in America, issued an executive order in the spring that sought to mandate major changes to the elections system. That order has so far mostly been blocked by the courts, but he's teased other executive action as well. And his administration is still investigating his loss five years ago, while pardoning people associated with his efforts to try to overturn that defeat.   All of that has made it clear to those in the elections community that Trump plans to have a heavy hand in their processes next year. Here are a few things voting officials are watching for.   More executive action to take control of voting   The Constitution is clear: States control their own election processes, with Congress able to set guidelines for federal races. The president has virtually no authority when it comes to voting.   But Trump is testing that, and those in his circle have pushed fringe theories for how he can change how ballots are cast and counted.   \n   Earlier this month, press secretary Karoline Leavitt said the White House is working on a new executive order that will seemingly target mail voting. Trump also said earlier this year that he wanted to ban some voting machines, though it's unclear exactly what he was referring to.   \n   Election officials agree he does not have the legal authority to do either of those things. But recently, Trump ally and attorney Cleta Mitchell, who advised Trump in 2020, broached a bolder strategy to enact election changes: declaring a national emergency.   \"The president's authority is limited in his role with regard to elections except where there is a threat to the national sovereignty of the United States — as I think that we can establish with the porous system that we have,\" Mitchell said on a podcast appearance in September.   It would be keeping with one of Trump's broader policy strategies: This year he's invoked presidential emergency powers more frequently than any other modern president.   Election experts say there's no legal basis for Mitchell's theory, but numerous voting officials told NPR it's something that's come up in conversations about next year.   U.S. Sen. Alex Padilla, D-Calif., who previously oversaw voting in California as secretary of state, also brought up the scenario recently on the Senate floor.   \"If the Trump White House tried to declare some fake national emergency to create a pretense for federal intervention, I will force a vote here in the Senate to stop it,\" Padilla said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Attorney General Pam Bondi listens as President Trump speaks in the Oval Office of the White House on Oct. 15.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   Troops on the ground   Washington Secretary of State Steve Hobbs, a Democrat, says six months ago he wouldn't have taken the premise of federal troops at polling places seriously.   But seeing how the National Guard was deployed — and justified — this summer changed his thinking.   \"You have National Guard deploying to cities to supposedly quell these 'demonstrations' — basically people in frog suits and riding their bikes naked is the biggest threat,\" Hobbs said. \"And yeah, I start thinking that maybe it could be possible.\"   \n   Ahead of the 2020 election, Trump spoke of a desire to have federal law enforcement patrol voting locations, and this year, his former adviser Steve Bannon said on his War Room podcast that he hopes Immigration and Customs Enforcement agents are patrolling polling places in the midterms.   Legal experts say such intervention is clearly illegal, but until the federal government disavows such actions clearly, Simon said voting officials have to game out how to respond.   \"One thing that would help is if someone at the federal government would come out and categorically say, 'No, no, no, stop the presses, stop everything. You'll never have to worry about that. That's not something we would ever consider doing,'\" Simon said. \"That would go a long way.\"   \n   In response to questions about forces outside polling places, and other scenarios mentioned in this story, White House spokesperson Abigail Jackson characterized them as \"baseless conspiracy theories and Democrat talking points\" but did not directly answer whether the White House would commit not to send agents to voting locations. She reiterated that the president is permitted to send federal personnel to localities to help quell violent crime.   Who is a trusted source?   For the last decade, as voting officials have fought to dam up a tsunami of false information about their work, they've begged people in their communities to go to \"trusted sources\" for election information.   In 2026, figuring out who is a trusted source may be more difficult than ever.   Along with Trump himself, his administration has elevated to prominent government roles numerous people who have a history of spreading false information about elections, and local officials worry their message may be drowned out by those with much bigger megaphones.   One of the hires alarming voting officials interviewed by NPR works at the Department of Homeland Security. Heather Honey, who's now deputy assistant secretary for elections integrity, worked alongside Mitchell for the past few years to help spread election conspiracy theories, including one about votes in Pennsylvania that Trump mentioned in his speech on Jan. 6, 2021, shortly before a mob stormed the Capitol.   \n   \"I equate this to having a moon landing conspiracy theorist and flat earther being offered a job at NASA,\" Hobbs said.   DHS did not respond to NPR's request for comment.   Numerous officials at the Department of Justice also have a history of election denial.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A poll worker holds \"I Voted\" stickers as people cast ballots on Nov. 4 in  the Brooklyn borough of New York City.\n                \n                    Michael M. Santiago/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Michael M. Santiago/Getty Images\n    \n\n   \n   Unprecedented demands   The insistence to relitigate 2020 also has voting officials worried about what sort of actions administration officials plan to take. Already this year, DOJ has made unprecedented requests to investigate voting machines, access old ballots, and accumulate mass amounts of voter data.   This summer, a consultant in Colorado contacted Koppes and other clerks in that state, in some cases saying he was associated with the White House and asking about accessing their voting machines.   The White House denied to CNN and other outlets authorizing the requests, but separately, in Missouri, a Department of Justice official reached out to clerks there asking basically the same thing.   In each instance, they were told no.   \"Since 2020, people in the elections world have become even more knowledgeable of the responsibilities of the different levels of government [when it comes to voting equipment],\" Koppes said.   A similar push and pull is playing out with elections data. The Trump administration has quickly built what is essentially a searchable national citizenship database, and is trying to entice states to run their voting records through it to root out noncitizens on voter rolls. While many Republican election officials have eagerly embraced the system, other GOP officials and their Democratic counterparts have been hesitant to engage with the tool, as there are questions about how well it works, what happens to the voting data once it's been run through the system and, in many states, whether even using the tool is legal under state law.   Still, the administration is intent to investigate voter rolls as it continues to push false narratives about widespread noncitizen voting. The DOJ recently sued eight states (all states Trump lost in 2020) in an effort to compel them to turn over their rolls.   \n   \"It's really not a red state or blue state thing,\" said Al Schmidt, the Republican secretary of state of Pennsylvania, in an interview with PBS News Hour about the data demands. \"It is a — in my view, a concerning attempt, a concerning effort to consolidate and overreach at the federal level. In the United States of America, it's the states who run elections, not the federal government.\"   Vulnerable targets   Since Trump took office, the federal government has pulled back on virtually all of its work related to cybersecurity and elections. The Department of Homeland Security laid off employees focused on election security, and stopped funding a partnership that helped local elections offices share threat information.   Wesley Wilcox, a Republican election supervisor in Marion County, Fla., said smaller counties especially will be more vulnerable to cyberattacks due to the cuts, and Russia, China or any other U.S. adversary may see an opportunity.   \"That's what I would do,\" Wilcox said. \"I mean, if I were on that side of the fence, I'm like, 'OK, they're cutting this stuff out. Let's go get them.' You know, 'cause the defenses are down.\"   Secretary Hobbs, of Washington, told NPR that two years ago he was notified by DHS about a hack in one of his counties. The state responded immediately to make sure the breach wouldn't impact the voter registration database.   Now, Hobbs said, \"I don't even know if I would have gotten that phone call, to tell you the truth.\"   In Arizona, Secretary of State Adrian Fontes, a Democrat, said he didn't even contact DHS' cyber agency after an online candidate portal was hacked this summer because he didn't have confidence in the agency's \"capacity to collaborate in good faith or to prioritize national security over political theater.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How could Trump interfere in the midterms? Here's what voting officials are watching",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8332x4687+0+449/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2F05%2Fe329fb31435b851429e3a3c302f5%2Fgettyimages-2244493791.jpg"
      ],
      "datePublished": "2025-11-21T10:00:00.000Z",
      "dateModified": "2025-11-21T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These families' health care costs will balloon if Congress doesn't act on the ACA",
    "url": "https://www.npr.org/2025/11/20/nx-s1-5614949/aca-subsidies-health-insurance-costs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2000x1125+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1a%2F12%2Ffb2072814ec289b795c2410963e0%2Fnpr-callout-aca.jpg",
    "tag": "Politics",
    "date": "2025-11-20T17:13:15.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Health insurance costs for those on ACA ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Health insurance costs for those on ACA plans are skyrocketing in 2026, unless Congress steps in. The increases are breaking family's budget and forcing them to make tough choices. Clockwise from left: Chris O'Donnell, Robert Bixon and his wife, Genna Boatright, Ezra McKay and Kristine Weidner.\n                \n                    Chris O'Donnell, Bixon family, Genna Boatright, Ezra McKay and Kristine Weidner\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chris O'Donnell, Bixon family, Genna Boatright, Ezra McKay and Kristine Weidner\n    \n\n   \n   The government shutdown has ended without resolving a fight over health insurance. Congress failed to extend enhanced tax credits that have helped millions of Americans on Affordable Care Act plans cover their plan costs since 2021.   Senate Republicans have promised a vote on the enhanced subsidies before the end of the year. But open enrollment for these plans is already underway and consumers are facing sky-high prices and little certainty about whether they'll get relief.   And making matters worse, insurers have raised prices on these plans because they predict that without the tax credits, healthier people may not sign up in 2026, leaving them a sicker, costlier pool of customers. Premiums on the marketplaces are rising by an average of 26% next year, according to health policy organization KFF. That's the largest rate increase since 2018.   \n   There's less than a month to go before the Dec. 15 deadline to sign up for a plan that begins Jan. 1. If Congress doesn't act before then, some people may have to choose between paying far more than they're comfortable with or forgoing insurance altogether.   Here are their stories:   She \"can't swing\" an extra $1,000 a month   Amy Jackson, Butler, Mo.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Amy Jackson\n                \n                    Amy Jackson\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Amy Jackson\n    \n\n   \n   Amy Jackson, 56, works in medical billing at an independent urgent care center. She buys coverage on the ACA marketplace because her employer is too small to have health benefits. She says her current premiums are affordable for her at $275 a month but will go to $1,250 in 2026 without the tax credit.   Going without insurance is really not an option for her. In October, she was diagnosed with breast cancer. So she's rushing to get in as much treatment as she can before the year ends, but she'll still need coverage for follow-up appointments next year.   Since she works in the medical field, she says she knows the insurance industry is part of the problem here. But she says people like her need help now, and lawmakers need to understand that.   \"For them, a thousand bucks is probably nothing. It's probably what they blow on dinner. But for me, that's half of my wage,\" she says. \"I just can't swing that.\"   \n   \"A very daunting amount of money\" for a retiree   Robert Bixon, Boynton Beach, Fla.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Robert Bixon\n                \n                    Bixon family\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Bixon family\n    \n\n   \n   A 61-year-old retiree, Robert Bixon, faces 2026 premiums of $4,500 a month to cover himself, his wife, and one of his sons. That's $54,000 a year, plus potentially spending up to $15,000 for their out-of-pocket maximum.   Bixon says he knew he'd have to pay for health care out of pocket after retiring from his career as a small business owner. \"But,\" he says, \"in my wildest dreams, I never thought a number close to $70,000 a year would be the cost that I'd be facing.\"   \"It's a very daunting amount of money,\" he says.   What scares Bixon even more is that prices could keep going up: \"Twelve months from now, we could be having the same conversation and I could be looking at another 20% or 30% increase.\"   \"I wonder if I'm going to be able to live out my days and enjoy my retirement and not run out of money,\" he says.   Still, Bixon isn't willing to risk living without insurance before becoming eligible for Medicare at 65. He has spent his entire adult life saving and investing for retirement and says he \"can't risk getting wiped out by long-term hospitalization.\"   \"I just don't understand how the leadership in this country can find that acceptable for working-class Americans — people who started businesses, helped employ other people, paid taxes — now [are] looking at these kinds of health care costs,\" he says.   Fears losing access to treatment for his bipolar disorder   Ezra McKay, Memphis, Tenn.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Ezra McKay\n                \n                    Ezra McKay\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Ezra McKay\n    \n\n   \n   Ezra McKay, 26, works part-time as a bookseller. He was kicked off his mother's plan, and his employer won't give him enough hours to get on the employer plan. So he buys his own insurance on the ACA marketplace.   He has bipolar disorder and the insurance, which covers his doctors' visits and prescriptions, has been a game changer for his health.   \n   Having that covered, he says \"has been such a relief. It's just made me feel important and valid, like I deserve to exist or something like that.\"   But without the subsidy, his premium for next year will go from $15 per month to $550, which is nearly half his monthly income.   Without insurance to cover his medication, McKay says, \"I would be in an extremely bad situation of having difficulty maintaining my job, maintaining my house, maybe even having a life-threatening situation, if I were to have a mental health crisis.\"   He says he is considering moving to California or Washington state, where state programs offer more secure coverage.   \"Where along the lines did I not do the right thing?\"   Catriona Johnson, Chapel Hill, N.C.   Before the ACA, 44-year-old Catriona Johnson had to live without health insurance for several years because she had a pre-existing condition. She was born with a congenital abnormality that required multiple surgeries in her abdomen and still requires her to use a catheter every day.   She says that the preventative care she got access to through ACA has increased her quality of health enough for her to earn her Master of Social Work degree.   Currently, she pays $442 a month for her premium with the tax credit, but that is set to go up to $666 next year. Her deductible will jump by $1,000.   Insurance is critical for her as she requires ongoing medical care.   \"I have no idea what I am going to do if I cannot afford care. Just go day by day, keep trying,\" she says.   Johnson says she's always tried to do things right. Despite her serious health problems, she went to college and grad school and has a job. Still, she lives paycheck to paycheck as a contract social worker in private practice, with most of her credit card bills being medical-related — medical supplies, medications, doctors' appointments.    \n   She wonders, \"Where along the lines did I not do the right thing?\"   She worries that the rise in costs for her health insurance will affect her credit, which already happened in her 20s because of medical debt. \"Everything I can't pay — on to the credit card, to worry about another day.\"   To cover an extra $1,300 a month, he'll stop contributing to retirement   Chris O'Donnell, Richmond, Va.    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Chris O'Donnell\n                \n                    Chris O'Donnell\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chris O'Donnell\n    \n\n   \n   After he got laid off from his job this summer, Chris O'Donnell, 58, started a freelance business. He gets his health insurance through Virginia's ACA marketplace.    He and his wife currently pay $837 a month for their plan. Without subsidies, the 2026 cost will be $2155 — that's $1,300 more per month.   O'Donnell says he plans to redirect the money he would have saved for retirement to cover the added premium costs. \"This is not the time to be zeroing out my retirement contributions, but what choice do I have?\"   His wife has diabetes and is a cancer survivor, so \"not having insurance is just completely out of the question,\" he says. \"Even if I wanted to go without health insurance, just the supplies for her insulin pump would cost $25,000 a year anyway, so I wouldn't actually be saving anything.\"   He and his wife are seriously considering retirement in a country where health care costs are more stable.   \"If this is the new normal and then you figure, health insurance is going to go up 20% every year, then I don't know that long-term staying in this country is going to be sustainable for us,\" he says.   With the cost more than doubling, she might forgo health insurance   Celeste Jameson, North Port, Fla.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Celeste Jameson\n                \n                    Celeste Jameson\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Celeste Jameson\n    \n\n   \n   For paralegal Celeste Jameson, 41, her monthly insurance premiums will more than double next year, from $266 to $593.   \"I can't afford $593 a month. I just can't, on top of all of my other living expenses,\" Jameson told WUSF.   \n   As a young adult, she suffered from severe abdominal and pelvic pain that went undiagnosed until just over 10 years ago, when she was finally able to get reliable health insurance through the ACA marketplace.   \"I was in and out of hospitals with severe pain, ovarian contusions and everything, with no insurance,\" she said.   The bills piled up. She got into medical debt.   In 2014, after being rushed to the emergency room in \"probably the worst pain I'd ever had,\" a doctor diagnosed her with endometriosis, a condition where tissue similar to the lining of the uterus grows in other parts of the body.   Once she felt better, she was able to take on regular work as a paralegal. She credits her health insurance with finally helping her get the diagnosis that led to her improved health.   She has not yet renewed her insurance for next year.   \"It scares me to know or to even imagine that I could be back where I was before 2014,\" she said.   \"I'd rather eat nothing but PB&Js than give up my health insurance.\"   Kelly Badeau, Tucson, Ariz.   Kelly Badeau is facing monthly insurance costs of nearly nine times what she is paying now. She currently pays $94 per month for a silver ACA plan after the tax credits, and her 2026 plan will cost an estimated $900.   Before becoming self-employed 10years ago, she had \"bare bones\" insurance with a high deductible through an employer. Her current ACA silver plan \"is the best insurance I've ever had,\" she says.   It has allowed her to take a proactive approach to her health, including annual primary care visits, screenings like mammograms and a colonoscopy, and seeing an audiologist. \"With the ACA, I'm healthier both mentally and physically,\" she says.   She says she doesn't want to drop her current plan. \"I'd rather eat nothing but PB&Js than give up my health insurance,\" she says.   \n   She sold her home last year and says she'll have to use some of that money to pay for health care.   \"I will dip into my savings to make my payments next year,\" she says. \"I don't want this administration to think they can tank the ACA by making us suffer.\"   But Badeau worries that she might have to start cutting corners in her health if she has too many medical expenses and can't afford the co-pays. Her husband may need treatment for prostate cancer soon, and she's on hormone therapy for menopause and blood pressure drugs.   \"I'm just trying to keep my head above water until I can get Medicare, but that's still many years from now,\" she says.   She worries she'll become disabled without health care   Genna Boatright, Siren, Wis.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Genna Boatright\n                \n                    Genna Boatright\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Genna Boatright\n    \n\n   \n   Genna Boatright, 40, has an aggressive case of rheumatoid arthritis and relies on medication to control it.   She is currently only paying $12 a month for her insurance premium because the enhanced subsidy covers most of her cost. But she says without the tax credit, her new premium costs will be $700, based on the numbers she's seeing in the marketplace.   \"And that I absolutely cannot afford,\" she says.   She says her income changed this year, and when she went onto the marketplace to shop for plans, she was pushed to apply for Medicaid. But she was denied Medicaid coverage. So she's continuing to see what is possible and waiting to see if anything changes with the prices.   \"The flood of overwhelm has been real,\" she says. She worries about how she will get coverage she can afford and is \"trying to make it through the days.\"   \"I do worry that without insurance and specialty care and the medication that I'm on, how quickly I will become disabled,\" she says. \"And that's an absolutely terrifying prospect.\"   \n   As a self-employed therapist, her ACA plan is her only option for insurance   Kristine Weidner, Branford, Conn.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Kristine Weidner\n                \n                    Kristine Weidner\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kristine Weidner\n    \n\n   \n   Self-employed as a psychotherapist, Kristine Weidner, 62, says the cost of the plan she buys on the ACA marketplace will nearly triple in 2026. Her current high-deductible plan costs $589 a month, not including dental, and a comparable plan for 2026 will cost $1691 a month.   She's really worried about the cost and about meeting the deductible. \"If I include dental, it will cost more than my housing,\" she says.   And she has \"no other option\" for health care. Going without insurance, she says, isn't a wise choice at her age.   She's also worried the rising costs may impact volume in her business as some clients may forgo insurance and not be able to afford her services.    \"I may need to consider closing my business and returning to the public sector and employer-based insurance.\"   NPR's Margaux Bauerlein and Selena Simmons-Duffin and WUSF's Kerry Sheridan contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These families' health care costs will balloon if Congress doesn't act on the ACA",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2000x1125+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1a%2F12%2Ffb2072814ec289b795c2410963e0%2Fnpr-callout-aca.jpg"
      ],
      "datePublished": "2025-11-20T17:13:15.000Z",
      "dateModified": "2025-11-20T17:13:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who are Afrikaners, the group at the center of Trump's dispute with South Africa?",
    "url": "https://www.npr.org/2025/11/20/nx-s1-5606922/afrikaners-trump-south-africa-history-explainer-g20",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4200x2363+0+219/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9d%2F84%2F84e85f5f400da106264c70db03a6%2Fgettyimages-2153937704.jpg",
    "tag": "Politics",
    "date": "2025-11-20T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bronze busts of past Afrikaner leaders a",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bronze busts of past Afrikaner leaders are seen on a hill in Orania, South Africa, in 2024.\n                \n                    Marco Longari/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Marco Longari/AFP via Getty Images\n    \n\n   \n   When the G20 meeting kicks off in South Africa this weekend, one member country will be conspicuously absent: the United States.   President Trump has decided that the U.S. will completely boycott the conference over what he considers the discriminatory treatment of Afrikaners by the South African government. They are the largest subset of the country's white minority, and Afrikaners ran South Africa's government for much of the 20th century and famously oversaw the racist system of apartheid until 1994.   Trump has repeated false claims that the South African government is stealing land from white farmers and that there is an ongoing \"white genocide\" and \"extermination\" of Afrikaners, even taking the unprecedented step of offering refugee status to Afrikaners who want to flee. The first 59 Afrikaner refugees arrived in the U.S. in May.   \n   South African officials — including President Cyril Ramaphosa — have said Trump's claims are untrue and point to official government data showing that attacks against rural Afrikaners are rare, and that the country's Black majority bear the brunt of South Africa's rampant crime.   \n   Lindie Koorts, a historian at the University of Pretoria, said the false narrative has strained some of the progress made in post-apartheid South Africa, as Afrikaners whose ancestors perpetrated apartheid adjust to being a political minority.   \"This is a minority that used to be protected by apartheid laws\" who now don't have the same job security and other economic benefits, said Koorts, who is an Afrikaner. \"It turns into something of existential dread, and that is very, very easily manipulated by the right wing.\"   Here's what to know about the history of the Afrikaners.   Who are Afrikaners?   Afrikaners descend from colonists of mostly Dutch but also German and French origin who landed on the tip of Africa in the 17th century. Many passed through the resupply station established by the Dutch East India Company in present-day Cape Town, an ideal midpoint along the sea routes between Europe and Asia.   Some Afrikaners later moved inland to form large farming colonies as their population grew on the continent. They also became known as Boers, which translates to \"farmers.\"   \n   Disputes between British colonists and the Boer settlers who spoke Afrikaans led to the Boer War, which occurred at the turn of the century. The British forces won, but Afrikaners remained the majority of South Africa's white population after the war and gained control of South Africa's government in the early 20th century.   In 1948, the Afrikaner-led government began to implement apartheid, a system of institutionalized racial segregation that benefited whites. Black people and other non-white South Africans were displaced and dispossessed. Apartheid ended in 1994 with the formation of a new, democratic government led by anti-apartheid activist and Nobel Peace Prize winner Nelson Mandela.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In a joint 1990 press conference, former South African President F.W. de Klerk shakes hands with anti-apartheid leader Nelson Mandela, who would become the first democratically elected South African president after apartheid.\n                \n                    Rashid Lombard/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rashid Lombard/AFP via Getty Images\n    \n\n   \n   Apartheid helped consolidate wealth among several generations of South Africa's white minority, but its fall stripped them of their political power and has shifted race relations in the country, said Daniel Magaziner, a professor of African history at Yale University.   \"Afrikaners — as white people — do quite well since 1994, but they do lose their political privileges, and so there is a rise in a sense of grievance and nostalgia for what has been lost since they lost their political control over the territory,\" he said.   Magaziner said there remains in South Africa a strong cultural association of Afrikaners with farming, even though most Afrikaners now live in the suburbs or urban areas.   \"But this idea that they're being targeted on farms is something that has a very big afterlife and is one of the reasons the Trump administration claims that these are people worthy — uniquely worthy — of being granted refugee status,\" he said.   Some Afrikaners say they're facing discrimination   Some Afrikaners say they are at risk of having their land stripped away or even facing physical violence and death because they are white, a claim that's been widely disputed by other Afrikaners, South African officials and Ramaphosa.   Right-wing South African groups such as AfriForum have attacked a new federal land expropriation law, which replaces another law from the apartheid era. Critics say the new law lets the government take land from private citizens without compensation.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Afrikaner refugees from South Africa arrive at Dulles International Airport in Virginia on May 12.\n                \n                    Julia Demaree Nikhinson/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Julia Demaree Nikhinson/AP\n    \n\n   \n   Under the law, the government can only seize land without paying for it in limited circumstances, such as if the land is not in use. The government must also first attempt to strike a deal with the owner. Most commercial farmland in South Africa is still owned by the country's white minority, who make up about 8% of the population.   \n   AfriForum has also claimed there are widespread murders of white Afrikaner farmers, which it says law enforcement is doing too little to combat, though South Africa's government denies this. And the group has slammed politicians who've continued to sing the apartheid-era song, \"Kill the Boer,\" something Ramaphosa said does not represent the policy of the government.   AfriForum CEO Kallie Kriel told Newzroom Afrika that he wanted the South African government to condemn the song and recognize \"that we are seeing tortures that accompany these murders and declare it a priority crime.\"   \n   The claims have been boosted by some of Trump's allies in the U.S., including Elon Musk, who is from South Africa. In a dramatic Oval Office meeting in May, Trump surprised Ramaphosa with a video montage and news clippings showing what Trump claimed was widespread violence and discrimination against white farmers.   \"You do allow them to take land — when they take the land, they kill the white farmer, and when they kill the white farmer, nothing happens to them,\" Trump said to Ramaphosa, who immediately disputed it.   \n   This year the Trump administration began offering refugee status to Afrikaners, even as the administration cut the total number of refugees it would admit to an all-time low.   How South Africa is responding to claims of discrimination against whites   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump holds up a news article as he discusses what he claims is the widespread killing of white Afrikaners in South Africa, during an Oval Office meeting with South African President Cyril Ramaphosa in May. South African officials say the claims are false.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   Ramaphosa and other South African officials say attacks on farming communities are rare. National police data shows that there were six murders on farms in South Africa during the first three months of this year.   Most crime victims in South Africa are Black — not white — officials say. Of the six farm murders from January to March, five of the victims were Black and one was white. South Africa's police minister said earlier this year that farm murders have a history of being \"distorted and reported in an unbalanced way.\"   Many Afrikaners have also disputed the idea that they're being persecuted. A number of Afrikaner journalists, professors and others signed a public petition, saying they rejected the idea that Afrikaners were \"victims of racial persecution in post-apartheid South Africa\" and didn't want to be \"pawns\" for American politicians.   \n   The group said South Africans of all races were facing a slew of problems. \"To cherry-pick white suffering and elevate it above others is dishonest and harmful,\" the petition reads. \"It feeds extremist ideologies that perpetuate division and have inspired real-world violence, including mass shootings.\"   Koorts, one of the signatories, said the allegations of a \"white genocide\" are not true and that Afrikaners have had to do a lot of work to reckon with the violent and racist history of apartheid.   \"What we now see is our story being taken out of context, being twisted for an American audience to make Americans fearful of multiculturalism, of multiracialism, of making Americans fearful of essentially becoming a white minority,\" she said. \"Don't. Please don't. That is not our story. That is a twisted version of our story.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who are Afrikaners, the group at the center of Trump's dispute with South Africa?",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4200x2363+0+219/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9d%2F84%2F84e85f5f400da106264c70db03a6%2Fgettyimages-2153937704.jpg"
      ],
      "datePublished": "2025-11-20T10:00:00.000Z",
      "dateModified": "2025-11-20T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]