[
  {
    "title": "Minnesota and federal officials are no longer cooperating on ICE shooting investigation",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5671187/minnesota-and-federal-officials-are-no-longer-cooperating-in-ice-shooting-investigation",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3500x1969+0+182/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2F8b%2Fe53358af46bb9438ad85e9a71e60%2Fap26008601965012.jpg",
    "tag": "Politics",
    "date": "2026-01-08T20:09:08.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A makeshift memorial honoring Renee Good",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A makeshift memorial honoring Renee Good, who was fatally shot by an Immigration and Customs Enforcement agent, is taped to a post near the site of the previous day's shooting in Minneapolis.\n                \n                    Mike Householder/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mike Householder/AP\n    \n\n   \n   In two different press conferences on Thursday, the White House and Minnesota Gov. Tim Walz disagreed on the details of Wednesday's fatal shooting in Minneapolis and how to investigate it.   Walz on Thursday told the federal government to \"leave Minnesota alone\" and allow state officials to conduct the investigation into the shooting by an Immigration and Customs Enforcement agent that left one woman dead and Minneapolis residents on edge.   Walz repeatedly expressed concerns about the federal government leading the investigation without Minnesota officials.   \"It feels very, very difficult that we will get a fair outcome, and I say that only because people in positions of power have already passed judgment, from the president, to the vice president, to [Secretary of Homeland Security] Kristi Noem,\" Walz said.   \n   Officials within the Trump administration quickly defended the ICE agent's actions as justifiable use of force, after civilian footage taken at the scene seemed to show Renee Good's SUV attempting to drive away from masked ICE agents, one of whom subsequently fired three shots into the driver's window, killing the 37-year-old wife and mother.   During Thursday's White House press conference, Vice President Vance said, \"I don't care what Tim Walz says\" and added that the ICE agent's life was in danger during the incident.   \"You have a woman who was trying to obstruct a legitimate law enforcement operation. … You have a woman who aimed her car at a law enforcement officer and pressed on the accelerator,\" Vance said.   At the core of each press conference was a different understanding of the facts.   Walz called the federal law enforcement presence in Minnesota \"a reckless ICE mobilization\" that \"is not keeping us safe\" and encouraged Minnesotans to support Good's family.   At the White House, Vance said, \"This is absolutely a tragedy, but it's a tragedy of the making of the far left. They have radicalized a very small segment of the population, taught them that ICE agents are engaging in wide-scale violation of people's rights.\"   \n   To get a better understanding of what happened, both men said an investigation would be necessary.   Walz said that Minnesota has the experience required to handle high-profile investigations such as this, pointing to the 2020 murder of George Floyd at the hands of former police officer Derek Chauvin.   \"The only way we find the answers is a thorough investigation by nonpartisan professionals,\" Walz said. \"We've delivered that. We've been able to do it.\"   The state's Bureau of Criminal Apprehension, which was initially tapped to conduct a joint investigation with the FBI, released a statement on Thursday stating that the agency had been kicked off the search in favor of allowing the federal government to conduct the operation on its own.   Vance said the federal government is better suited to handle the investigation. \"The Department of Justice is already investigating this. The Department of Homeland Security is already investigating this,\" Vance said.   He added, \"But the simple fact is, what you see is what you get in this case.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota and federal officials are no longer cooperating on ICE shooting investigation",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3500x1969+0+182/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2F8b%2Fe53358af46bb9438ad85e9a71e60%2Fap26008601965012.jpg"
      ],
      "datePublished": "2026-01-08T20:09:08.000Z",
      "dateModified": "2026-01-08T20:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mamdani says New York child care expansion a real step to fulfilling campaign pledge",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5671045/nyc-mayor-mamdani-discusses-new-york-state-expansion-of-childcare-funding",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3171x1784+0+165/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2Ff1%2Ff32b1d5648e8bd2a9c8d943d3b38%2Fap26008460650263.jpg",
    "tag": "Politics",
    "date": "2026-01-08T21:17:23.000Z",
    "description": "\n      \n      NYC Mayor Mamdani discusses New York state expansion of childcare funding\n    \n        \n                Download\n                \n      ",
    "body": "\n      \n      NYC Mayor Mamdani discusses New York state expansion of childcare funding\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5671045/nx-s1-9600933\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - New York Governor Kathy Hochul speaks during a press conference with New York Mayor Zohran Mamdani Tuesday, Jan. 6 in New York.\n                \n                    Yuki Iwamura/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Yuki Iwamura/AP\n    \n\n   \n   New York City Mayor Zohran Mamdani's ambitious campaign pledge to offer universal child care took a significant step forward Thursday.   Appearing together, Mamdani and New York Gov. Kathy Hochul announced a plan to increase spending on child care starting this year with the goal of eventually providing universal child care throughout the state for kids under 5.   In an interview with All Things Considered, Mamdani said the announcement means the state will commit $1.21 billion for New York City \"to take the first steps towards universal child care.\"   The city will be able to fund fixes to make universal care for 3-year-olds \"a reality\" and work toward enrolling about 2,000 kids aged 2 this fall, Mamdani added. He also praised Hochul for her partnership and for her commitment to fund the plan over the next two years.   \n   Unfulfilled promises have turned New Yorkers away from politics, Mamdani said, adding that \"if we want people to believe in our democracy, we have to show them that our democracy can actually deliver for them.\"   Speaking to NPR's Juana Summers, Mamdani discussed how the city and state will pay for and manage the expanded childcare program, the challenges posed by the Trump administration's freeze on national childcare assistance funding and immigration enforcement.   Listen to the full interview by hitting the blue play button above.   The web copy was written by Obed Manuel.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mamdani says New York child care expansion a real step to fulfilling campaign pledge",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3171x1784+0+165/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2Ff1%2Ff32b1d5648e8bd2a9c8d943d3b38%2Fap26008460650263.jpg"
      ],
      "datePublished": "2026-01-08T21:17:23.000Z",
      "dateModified": "2026-01-08T21:17:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump cites numbers a lot. Sometimes they're mathematically impossible",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5668447/trump-cites-numbers-a-lot-sometimes-theyre-mathematically-impossible",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-08T09:43:28.000Z",
    "description": "\n      President Trump loves to use figures and percentages even when they are sometimes mathematically impossible.   \n\n    LEILA FADEL, HOST:  Presid",
    "body": "\n      President Trump loves to use figures and percentages even when they are sometimes mathematically impossible.   \n\n    LEILA FADEL, HOST:  President Trump uses a lot of numbers. When he rallied Republican members of the House earlier this week, he used the word percent more than 30 times. And as NPR senior White House correspondent Tamara Keith reports, some of his numbers are mathematically impossible.TAMARA KEITH, BYLINE: President Trump regularly boasts about the success of airstrikes on accused drug boats near Venezuela, but his numbers have changed repeatedly. Here he is in chronological order over the past month.(SOUNDBITE OF MONTAGE)PRESIDENT DONALD TRUMP: Ninety-two or 94% down in drugs coming in by the sea.We've cut it down 96%. Think of that.Ninety-two percent.Ninety-six percent.Ninety-four percent.Ninety-six point two percent coming into the United States - 92.6 by sea.You know, it's 97%. I'm trying to figure out who are the other 3%.KEITH: He always makes that same joke, too. The White House declined to cite the source or offer an explanation for these shifting numbers. Glenn Kessler led The Fact Checker project at The Washington Post for 15 years.GLENN KESSLER: We often will just make stuff up. I mean, it's a consistent pattern.KEITH: In Trump's first term, Kessler documented more than 30,000 false or misleading statements by the president, and many of them involved numbers.KESSLER: You always want to have a statistic.KEITH: Trump also loves to talk about bringing down the cost of prescription drugs.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: Some prescription drug and pharmaceutical prices will be reduced almost immediately by 50 to 80 to 90%.KEITH: That was in May. Since then, the claims have ballooned.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: And we're not talking about a 25% cut or 50, we're talking about a 1,500% cut.KEITH: Fifteen hundred percent. But math can sometimes be tricky. So I dialed up a math teacher. Kirk Weiler taught high school mathematics and became internet-famous with his more than 400 instructional videos. He said what Trump is claiming doesn't make sense when you're talking about the cost of a product.KIRK WEILER: If you had a drug that went down from a hundred dollars by 200%, then the drug would have to cost negative $100, implying, of course, that the drug companies were paying people to take the drug, which would be awesome.KEITH: Awesome, but that isn't what's happening. And in remarks earlier this week, Trump let on that he knew there might be an issue with his numbers.(SOUNDBITE OF ARCHIVED RECORDING)TRUMP: Depending on the way you calculate it, it could be thousands of percent down. It could also be 90% and 80%. You know, there's two ways of calculate. I don't know if you know. They said, Donald Trump exaggerate - no, there are two ways of calculating it.KEITH: I played that clip for Weiler.WEILER: Wow (laughter).KEITH: And he said there really is only one way to calculate percentage decrease.WEILER: Of all the things that are debatable, this is just simply not one of them.KEITH: Responding to questions, White House spokesman Kush Desai didn't explain the president's math, but did say, quote, \"President Trump has correctly identified how Americans pay several times more for the exact same drugs as their peers in other wealthy nations.\" (ph) Kessler, the fact-checker, says other presidents were more precise about their language and the numbers they cited because what a president says matters.Tamara Keith, NPR News.(SOUNDBITE OF MUSIC)\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump cites numbers a lot. Sometimes they're mathematically impossible",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-08T09:43:28.000Z",
      "dateModified": "2026-01-08T09:43:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Senate Republicans deal Trump a rare rebuke with Venezuela war powers vote",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5670473/senate-republicans-deal-trump-a-rare-rebuke-with-venezuela-war-powers-vote",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-08T21:14:34.000Z",
    "description": "\n      \n      Senate Republicans deal Trump a rare rebuke with Venezuela war powers vote\n    \n        \n                Download\n                \n     ",
    "body": "\n      \n      Senate Republicans deal Trump a rare rebuke with Venezuela war powers vote\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5670473/nx-s1-9600872\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      In a rare rebuke to President Trump, five Republicans joined with Democrats on Thursday to advance a measure that would require congressional authorization for future military action in Venezuela.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Senate Republicans deal Trump a rare rebuke with Venezuela war powers vote",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-08T21:14:34.000Z",
      "dateModified": "2026-01-08T21:14:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's second term has included a much more muscular foreign policy than his first",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5668208/trumps-second-term-has-included-a-much-more-muscular-foreign-policy-than-his-first",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-08T22:26:21.000Z",
    "description": "\n      \n      Trump’s second term has included a much more muscular foreign policy than his first\n    \n        \n                Download\n             ",
    "body": "\n      \n      Trump’s second term has included a much more muscular foreign policy than his first\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5668208/nx-s1-9600974\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      President Trump ran as the Peace President, but since taking office has been on a military spree with strikes on Iran, Yemen, Nigeria, Syria and Venezuela — and threats against others.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's second term has included a much more muscular foreign policy than his first",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-08T22:26:21.000Z",
      "dateModified": "2026-01-08T22:26:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House says 'all options' are on the table for Greenland, including diplomacy",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5670072/white-house-says-all-options-are-on-the-table-for-greenland-including-diplomacy",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-08T09:43:43.000Z",
    "description": "\n      The White House says \"all options\" are on the table when it comes to the U.S. potentially acquiring Greenland, including diplomacy. Several Eur",
    "body": "\n      The White House says \"all options\" are on the table when it comes to the U.S. potentially acquiring Greenland, including diplomacy. Several European leaders have fervently pushed back.   \n\n    LEILA FADEL, HOST:  The Trump administration is amping up its rhetoric about taking Greenland, insisting all options are on the table, including the use of the military. Press secretary Karoline Leavitt on Wednesday echoed President Trump's assertions that the U.S. needs Greenland for national security purposes and appeared to warn Denmark not to dismiss the president's words.(SOUNDBITE OF ARCHIVED RECORDING)KAROLINE LEAVITT: The president's first option always has been diplomacy. Again, look at Venezuela. He tried ardently to strike a good deal with Nicolás Maduro, and he told him, I will use the United States military, and you will not like it if you don't take such a deal. And look at what happened.FADEL: NPR White House correspondent Franco Ordoñez is with us. Good morning.FRANCO ORDOÑEZ, BYLINE: Good morning, Leila.FADEL: OK. So that sounded like quite a threat from Karoline Leavitt. Is that how Denmark is taking it?ORDOÑEZ: Yeah. I mean, I'll say leaders in Denmark are taking this very, very seriously. I mean, it caught a lot of global leaders' attention, showing what the president is potentially capable of. And Secretary of State Marco Rubio, he was on the Hill yesterday briefing members of Congress on Venezuela. Well, he was also asked about Greenland, and he, too, echoed the press secretary's comments about the use of force.(SOUNDBITE OF ARCHIVED RECORDING)MARCO RUBIO: If the president identifies a threat to the national security of the United States, every president retains the option to address it through military means. As a diplomat, which is what I am now and what we work on, we always prefer to settle it in different ways - that included in Venezuela.ORDOÑEZ: Now, U.S. officials argue that Russia and China are making a play for control of the Arctic, making Greenland essentially a strategic asset for the U.S. Rubio says the preference has always been to purchase Greenland and added that he is meeting with Danish officials next week. But he also would not give any details about that meeting.FADEL: OK. So is this all a ploy to scare Denmark into selling Greenland to the United States?ORDOÑEZ: I mean, Danish officials say Greenland belongs to its people, and it's up to them to determine their fate. And the prime minister, he warns that a U.S. invasion would essentially end the NATO military alliance. Denmark is, of course, a NATO ally. And I'll just say that GOP leaders, like House Speaker Mike Johnson, are dismissing the idea of a military action. And foreign policy hands think this is all a negotiating tactic. Mark Feierstein, who advised both the Obama and Biden administrations, says the U.S. is unlikely to do anything remotely similar to Greenland as they did in Venezuela.MARK FEIERSTEIN: I think what the administration wants to do now is give the impression that Trump means what he says. And they want to be able to use the action in Venezuela as a way to encourage other countries, to get them to bend their will to U.S. means. Basically, it's a form of intimidation, a form of threats. And it might work.ORDOÑEZ: Feierstein says there's a big difference between going after a drug-trafficking dictator and going after Greenland, which is part of Denmark - again, a NATO ally - where the U.S. already has a military base. It's just not the same. But this Trump administration has been even more bold than the first.FADEL: Yeah. And Trump never had much love for NATO. And speaking of multilateral organizations he doesn't like, he says he's pulling the U.S. from dozens of international organizations.ORDOÑEZ: Yeah. That's right. I should note that NATO is not one of them. The White House listed the dozens of organizations which it said promote, quote, \"radical climate policies, global governance and ideological programs\" that the administration says are contrary to U.S. interests. Many are U.N.-related agencies and commissions, like the U.N. population agency. A non-U.N. organization on the list is the International Institute for Democracy. It's really just the latest example of the U.S. pulling away from global cooperation.FADEL: White House correspondent Franco Ordoñez. Thank you so much, Franco.ORDOÑEZ: Thank you, Leila.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House says 'all options' are on the table for Greenland, including diplomacy",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-08T09:43:43.000Z",
      "dateModified": "2026-01-08T09:43:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What we know one day after the killing of Renee Good by an ICE agent in Minneapolis",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5671061/minneapolis-ice-shooting-noem",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7496x4217+0+392/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F06%2F32%2Fe7da77dd416f8d0822d45e65a75f%2Fgettyimages-2254640480.jpg",
    "tag": "Politics",
    "date": "2026-01-08T20:09:29.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People gather at a makeshift memorial fo",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People gather at a makeshift memorial for Renee Nicole Good, 37, who was shot and killed on Wednesday by an ICE officer in Minneapolis.\n                \n                    Charly Triballeau/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Charly Triballeau/AFP via Getty Images\n    \n\n   \n   The killing of Renee Nicole Good by an Immigration and Customs Enforcement officer inspired a vigil Wednesday night, and it's sparking protests in Minneapolis and elsewhere on Thursday. Reactions to the shooting reflect outrage over Good's death and a deep divide in how it's portrayed — as either a tragic abuse of power or an officer acting in self-defense.   NPR identified the ICE agent who fired the gun as Jonathan Ross by cross-referencing court records with details about the officer released by Homeland Security Secretary Kristi Noem at a Wednesday news conference. Noem — without naming the officer — said he had been in a previous confrontation with a protester.   \n   \"The very same officer who was attacked today had previously been dragged by an anti-ICE rioter who had rammed him with a car and [dragged] him back in June. He sustained injuries at that time, as well,\" she said.   The description of the incident matches a court case against a Mexican national, Roberto Carlos Munoz-Guatemala, who was found guilty in December of assaulting a federal officer in Bloomington, Ind. DHS confirmed to NPR that is the court case that Noem referenced. Ross' name is mentioned in the court documents for the case. According to court records, federal officers attempting to arrest Munoz-Guatemala, who had been convicted of sexual abuse, pulled him over in his car. Munoz-Guatemala sped away after Ross had reached inside the vehicle, trapping the agent's arm and causing him to sustain injuries to his arm and hand.   \n   Noem said that Wednesday's shooting occurred after protesters in Minneapolis harassed and impeded ICE agents and that the officer acted to protect himself and fellow officers. She alleged that Good's actions amounted to \"an act of domestic terrorism.\"   Minnesota Attorney General Keith Ellison told NPR's Morning Edition that he disagrees with Noem's characterization of Good as a domestic terrorist.   \"She was a compassionate neighbor trying to be a legal observer on behalf of her immigrant neighbors,\" Ellison said. \"That's what she was doing at the moment of her death. And she was a poet. She was a mom. She was a daughter. And I am deeply saddened by what happened to her and her family.\"   \n   Competing narratives quickly emerge   Minneapolis Mayor Jacob Frey and other local officials have dismissed Noem's version of events as political spin. At a news conference on Wednesday, Frey said of the self-defense explanation, \"Having seen the video myself, I want to tell everybody that is bull****. \"   \"This was a federal agent recklessly using power that resulted in somebody dying,\" Frey said, adding that he wants ICE units to leave Minneapolis.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A woman and other demonstrators confront federal officers outside the Bishop Henry Whipple Federal Building in Minneapolis on Thursday, one day after a federal agent fatally shot a woman in her car in south Minneapolis.\n                \n                    Scott Olson/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Scott Olson/Getty Images\n    \n\n   \n   Minnesota Gov. Tim Walz said he was angered by the killing, which he linked to President Trump's policy of sending ICE and other federal agents surging into cities such as Minneapolis.   \"What we're seeing is the consequences of governance designed to generate fear, headlines and conflict,\" Walz said on Wednesday. \"It's governing by reality TV and today that recklessness cost someone their life.\"   Noem said on Wednesday that she had spoken with Walz about the killing, but added that they don't agree on whether it was justified: \"We have two very different viewpoints on what happened.\"   Hours after the shooting, Noem defended the ICE officer who shot Good, saying the woman had blocked federal officers with her SUV and disobeyed orders to get out of her vehicle.   \"It's clearly established law that a vehicle driven by a person and used to harm someone is a deadly weapon,\" she said, as NPR reported. \"Deadly force is perfectly lawful when a threat is faced by a weapon, so I do believe that this officer used his training in this situation.\"   When Noem was asked on Thursday whether the officer remains on field duty, Noem said he had gone to a hospital for treatment, but was then released \"and is spending time with his family now.\"   Noem also said the federal surge in Minneapolis will continue, and could even grow.   \"We've got thousands of officers there,\" she said, \"and I'm not opposed to sending more if necessary to keep people safe.\"   \n   Key details of a controversial shooting   Here is a brief overview of what we know so far about the events leading to Good's death:   When: Police officers responded to reports of shots fired just after 9:30 a.m. on Wednesday, according to a timeline published by the city of Minneapolis.   \"Minneapolis firefighters then removed the 37-year-old victim from the vehicle and immediately began lifesaving measures until paramedics could respond,\" the city's account states. \"She was transported to Hennepin County Medical Center, where she later died.\"   Where: Good was shot in her car on Portland Avenue, near East 34th Street, in a residential area a few blocks north of where police killed George Floyd in May 2020.   ICE agents at the scene were trying to deal with a vehicle that had gotten stuck in the snow, Noem said on Wednesday. As other ICE vehicles arrived, so did protesters, a witness named Caitlin Callenson told member station MPR.   How: Callenson, who recorded a video of the incident, told MPR that agents gave Good conflicting orders: One agent told her to drive away while another told her to get out of her SUV, Callenson said.   (Warning: The video at the following link includes violent actions and profanity.)   Video footage from the scene shows Good's Honda Pilot SUV sitting sideways on a snowy street, with her driver's side window down. Two uniformed officers approach the vehicle from the left. As one officer grabs at her door handle, a third officer who had circled to the front of the SUV from the opposite side draws his gun. As Good begins to drive away, the officer fires into her car.   \"The preliminary information that we have indicates that this woman was in her vehicle and was blocking the roadway,\" Minneapolis Police Chief Brian O'Hara said at a news conference Wednesday. \"At some point, a federal law enforcement officer approached her on foot and the vehicle began to drive off. At least two shots were fired. The vehicle then crashed on the side of the roadway.\"   \n   What's next: On Wednesday, O'Hara said the FBI and Minnesota's state agency, the Bureau of Criminal Apprehension, would jointly investigate the fatal shooting.   But in a statement Thursday, the BCA said that the U.S. Attorney's Office reversed course at the federal level, and the FBI alone would lead the investigation, as MPR reports. The BCA said it \"has reluctantly withdrawn\" from the process, because it would no longer have access to case materials and evidence.   Ellison, Minnesota's attorney general, said that he believes the FBI should not be involved in the inquiry.   \"I know that ICE and FBI are different agencies,\" Ellison said, \"but I think in order for public confidence to be at its best, there is some legitimate question as to what the role the FBI should be playing.\"   NPR's Ximena Bustillo contributed reporting. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What we know one day after the killing of Renee Good by an ICE agent in Minneapolis",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7496x4217+0+392/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F06%2F32%2Fe7da77dd416f8d0822d45e65a75f%2Fgettyimages-2254640480.jpg"
      ],
      "datePublished": "2026-01-08T20:09:29.000Z",
      "dateModified": "2026-01-08T20:09:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Supreme Court ruling could bring historic drop in Black representation in Congress",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5646525/supreme-court-voting-rights-congressional-black-caucus",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2999x1687+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F34%2Ff5%2Fada07ba6467ca2a20a605f53a00b%2Fap25288696335626.jpg",
    "tag": "Politics",
    "date": "2026-01-08T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the Congressional Black Caucu",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the Congressional Black Caucus speak outside the U.S. Capitol in October after the Supreme Court heard arguments about the Voting Rights Act.\n                \n                    Matt Brown/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Matt Brown/AP\n    \n\n   \n   The United States could be headed toward the largest-ever decline in representation by Black members of Congress, depending on how the Supreme Court rules in a closely watched redistricting case about the Voting Rights Act.   For decades, the landmark law that came out of the Civil Rights Movement has protected the collective voting power of racial minorities when political maps are redrawn. Its provisions have also boosted the number of seats in the House of Representatives filled by Black lawmakers.   That's largely because in many Southern states — where voting is often polarized between a Republican-supporting white majority and a Democratic-supporting Black minority — political mapmakers have drawn a certain kind of district to get in line with the Voting Rights Act's Section 2 provisions. In these districts, racial-minority voters make up a population large enough to have a realistic opportunity of electing their preferred candidates.   \n   But at an October hearing last year for the redistricting case about Louisiana's congressional map, the Supreme Court's conservative majority appeared inclined to issue this year another in a series of decisions that have weakened the Voting Rights Act — this time its Section 2 protections in redistricting.   That kind of ruling could put at risk at least 15 House districts currently represented by a Black member of Congress, an NPR analysis has found. Each of those districts has a sizable racial-minority population, is in a state where Republican lawmakers control redistricting and, for now at least, is likely protected by Section 2. Factoring in newly redrawn districts in Missouri and Texas, which were not included in NPR's analysis, could raise the tally of at-risk districts higher.   Loading...\n   If Republican-led states no longer have to follow current redistricting provisions under Section 2, it's unclear how many Democratic-represented districts could be eliminated, because GOP-led legislatures may see a partisan advantage in preserving some of those districts. The timing of such moves is also unclear, as state lawmakers await the Supreme Court ruling.   Still, the loss of even a handful of those at-risk districts could fuel a record drop in the number of Black representatives. The current record drop was set by the 45th Congress, which began in 1877 and had four fewer House districts represented by Black lawmakers than the previous session.   How Black representation in Congress has grown after the Civil War   The post-Civil War Reconstruction era brought the start of Black representation on Capitol Hill in 1870, around the time when Black men gained the right to vote. The rise of racist poll taxes, literacy tests and threats of violence, however, whittled away the rights of Black voters until the passing of the Voting Rights Act of 1965.   \n   For a century after the Civil War, the number of Black-represented House districts in each Congress stayed in the single digits or at zero. That continued until 1969, when the number began gradually increasing through today to 63 districts, or about 14% of the current House.   Loading...\n   What the Supreme Court decides in the Louisiana case will set the stage for where that trend line goes.   At the center of the case is one of the state's two majority-Black congressional districts. Louisiana's Republican-controlled legislature drew it after a related Section 2 lawsuit led by Press Robinson, a Black voter and civil rights activist in Baton Rouge.   Robinson says he fears that without Section 2's protections, Black representation in Congress and at other levels of government will be diminished to \"a very minor scale.\"   \"And that is not where we should be in 2026,\" adds Robinson, who became the first Black elected member of the East Baton Rouge Parish School Board in 1980 after filing a federal lawsuit over the board's use of an election system that he argued diluted the power of Black voters.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Press Robinson, a civil rights activist, sits at his desk in his home in Baton Rouge, La., on Aug. 24, 2022. Louisiana's Republican-controlled legislature drew a second majority-Black congressional district after Robinson and other Black voters in the state sued.\n                \n                    Gerald Herbert/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Gerald Herbert/AP\n    \n\n   \n   Robinson's concerns about Section 2's future have been echoed by current members of Congress.   \"For so many of us here today, Section 2 is why we stand before you as members of the Congressional Black Caucus,\" said Democratic Rep. Terri Sewell of Alabama at a press conference, after the Supreme Court's October hearing for the Louisiana case. \"If this court strikes down these critical provisions, it would not only reverse decades of precedent, but it would also take us back to a dark time in our nation's history, a time when discrimination against minority voters went unchecked.\"   Opponents of those Section 2 provisions claim, however, that they violate the Constitution.   In the Supreme Court case, Louisiana's Republican state officials say race should play no role \"in any form\" when redrawing voting maps. A group of self-described \"non-African American\" voters from the state argue that the court should put an end to race-based redistricting under Section 2 now that it has ruled against race-based affirmative action at colleges and universities. Similarly, the Justice Department under the Trump administration has criticized the use of Section 2 provisions in redistricting as \"a form of electoral race-based affirmative action to undo a State's constitutional pursuit of political ends.\"   \n   A weakening of Section 2 could also reduce Latino representation   Additional restrictions on how race can be factored into redistricting could give political mapmakers more leeway to neutralize the collective power of minority voters and lead to fewer representatives of color getting elected, says Katherine Tate, a professor of political science at Brown University.   \"Minority members of Congress are more likely to sponsor bills that talk about minority interests, even controlling for political party. So diversity really is important in terms of fair representation, equal representation of American voters,\" explains Tate, who has written books about Black representation in Congress.   \n   Any weakening of Section 2's current redistricting provisions also puts at risk representation by other racial and ethnic minorities and at lower levels of government.   As much as 11% of the Congressional Hispanic Caucus could be lost, and close to 200 Democratic-held state legislative seats, mostly representing majority-Black districts in the South, could be eliminated, according to estimates by the voting rights advocacy groups Fair Fight Action and Black Voters Matter Fund.   Those changes may play out over years, says Lauren Groh-Wargo, Fair Fight Action's CEO.   \"We could see a very rapid, effective dismantling of Black representation at the congressional level and possibly at the state legislative level in a couple of states. I think other states may hold off and wait to do their gerrymandering\" until the current wave of mid-decade congressional redistricting is over, Groh-Wargo adds.   It's \"always a fight\"   Tate, the political scientist at Brown University, sees the Louisiana redistricting case returning the Supreme Court to a role from more than 150 years ago.   Tate recalls the series of court decisions beginning in the 1870s that eroded the civil rights gains of the Reconstruction era for Black citizens, including millions of formerly enslaved people. Now, the court is weighing the fate of a key remaining section of the Voting Rights Act — a legacy of the Civil Rights Movement that historians consider a second Reconstruction.   \n   \"It'll be like the first Reconstruction, why that failed — because of the Supreme Court rulings,\" Tate says. \"The end of the second Reconstruction will be because of the Supreme Court.\"   For Robinson of Baton Rouge, it's all a reminder that the struggle for fair representation never ends.   \"When it comes to voting rights and other rights for people of color, it's always a fight,\" Robinson says. \"There's never a time that we get what we deserve and that we should have without having to fight for it.\"   \n   Edited by Benjamin Swasey\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Supreme Court ruling could bring historic drop in Black representation in Congress",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2999x1687+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F34%2Ff5%2Fada07ba6467ca2a20a605f53a00b%2Fap25288696335626.jpg"
      ],
      "datePublished": "2026-01-08T10:00:00.000Z",
      "dateModified": "2026-01-08T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House votes to renew ACA subsidies, as Senate Republicans rebuke Trump on Venezuela",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5662625/house-vote-affordable-care-act-subsidies",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7705x4334+0+401/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F57%2F60%2F6d50fd40461b8a711239375ecb41%2Fgettyimages-2254209087.jpg",
    "tag": "Politics",
    "date": "2026-01-08T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is seen on Jan. 5. The ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is seen on Jan. 5. The House is set to vote Thursday on a bill to renew enhanced health insurance subsidies.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   A group of 17 House Republicans joined with Democrats on Thursday, against the wishes of House Speaker Mike Johnson, to pass a measure to restore health insurance subsidies that lapsed at the end of last year.    That three-year extension passed by a vote of 230 to 196, but it is not likely to go far in the Senate, where a similar measure failed in December. A bipartisan group of senators, however, say they are getting close to a deal on a compromise bill.    While the debate over health care costs absorbed much of the oxygen in Congress in the final weeks of 2025, the rush to take action on the lapsed subsidies is now happening as members find themselves grappling with questions about the direction of U.S. foreign policy following President Trump's actions in Venezuela.    \n   On Thursday, the Senate took a procedural vote to begin debate on a resolution that would require the administration to seek authorization from Congress before taking further military action in the country. The measure advanced by a vote of 52 to 47, with five Republicans joining Democrats in support.    The vote was part of a whirlwind start to the new year for lawmakers. Adding to their to-do list is a fast-approaching Jan. 30 deadline to fund the government or risk a partial shutdown. House lawmakers made progress on that front Thursday, passing a trio of spending bills to fund the departments of Energy, Commerce, Interior and Justice. The bills also provide funding for the Environmental Protection Agency and federal water and science initiatives.    An end-run around the speaker on subsidies    Republican leadership for weeks refused to allow a vote on extending the subsidies.   Then just before the holiday recess, four swing-district Republicans joined with Democrats to force a vote on extending the subsidies for three years through what's known as a discharge petition. The once rare legislative tool allows 218 or more rank-and-file members to sidestep the speaker and force a vote.   \n   But even many backers acknowledge a clean three-year extension is unlikely to pass the Senate. The hope has been that success in the House would recharge bipartisan negotiations in the upper chamber, and there are signs that may be happening.   A small bipartisan group of senators have been negotiating this week, and several of them have told reporters they are nearing a deal.   \"We're in the red zone,\" said Sen. Bernie Moreno, R-Ohio, on Wednesday. \"But that does not mean a touchdown. It could mean a 95-yard fumble.\"   \n   Several of those senators met with a bipartisan group of House members on Thursday.    \"The Senators made it abundantly clear, that but for this action in the House, the discharge petition, that was incredibly important for them to breathe life back into this issue,\" Rep. Brian Fitzpatrick, R-Penn., told reporters after emerging from the meeting.    The path ahead in the Senate   Moreno says the emerging compromise centers on a two-year extension. In the second year, patients could opt to have the funds deposited in a Health Savings Account, instead of government subsidies going to the insurance company.   President Trump has pushed to give federal funding for health care costs directly to patients and has repeatedly decried the subsidies as government handouts to big insurance companies.   The plan would also include an income cap, among other changes Republicans have called for. Open enrollment would likely be extended so people who dropped their policies due to the premium spikes brought on by the expiration of subsidies can have an opportunity to sign up for coverage.   \n   There are still some sticking points to a bipartisan deal. Some Republicans want more specific language around the prohibition of federal funding being used for abortion.   Trump told House Republicans this week that they may need to be \"flexible on this.\"   And there are also many Republicans deeply opposed to the enhanced subsidies at all, so even if the bipartisan group reaches a compromise, their ultimate fate remains unclear.   \"It would be unfathomable if something came out of the Senate and it was not given a floor vote,\" Fitzpatrick said, not ruling out another House discharge petition. \"It will be given a floor vote one way or another.\"   A busy start to 2026 with Venezuela in focus   As lawmakers look for consensus on the subsidies, questions about the future of the U.S. role in Venezuela have also taken on new urgency.    \n   While most Republicans have voiced support for the military operation that resulted in the capture of Nicolas Maduro, some in the party have signaled unease with what happens next. On Thursday, five Republican Senators joined with Democrats in voting to begin debate on a bill to require congressional approval for any further military action in Venezuela: Susan Collins of Maine, Josh Hawley of Missouri, Lisa Murkowski of Alaska, Rand Paul of Kentucky and Indiana's Todd Young.    The vote represented a rebuke for the president, but may ultimately prove symbolic. Even if the measure wins final passage in the Senate, it would face a steep climb in the GOP-controlled House and a likely veto from Trump.    Nonetheless, the GOP defections spurred a blistering critique from President Trump.    \"Republicans should be ashamed of the Senators that just voted with Democrats in attempting to take away our Powers to fight and defend the United States of America,\" Trump wrote in a statement posted to Truth Social.     \n   In addition to votes on health care and Venezuela, lawmakers are also facing pressure on funding the government by a deadline of Jan. 30.    Congress has already signed off on full-year funding for some federal agencies, but the record-long government shutdown last fall ended with a continuing resolution that got funding flowing again for most departments only into the first month of the year.   Several of those appropriations bills are slated to come up for votes in the coming days, but appropriators are still working out the details for bills that cover more contentious areas — like the Department of Defense and the Department of Health and Human Services.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House votes to renew ACA subsidies, as Senate Republicans rebuke Trump on Venezuela",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7705x4334+0+401/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F57%2F60%2F6d50fd40461b8a711239375ecb41%2Fgettyimages-2254209087.jpg"
      ],
      "datePublished": "2026-01-08T10:00:00.000Z",
      "dateModified": "2026-01-08T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lawmakers briefed on Trump administration's 3-pronged plan for Venezuela",
    "url": "https://www.npr.org/2026/01/08/nx-s1-5669666/lawmakers-briefed-on-trump-administrations-3-pronged-plan-for-venezuela",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-08T11:49:36.000Z",
    "description": "\n      \n      Lawmakers briefed on Trump administration's 3-pronged plan for Venezuela\n    \n            \n                \n                Transcript\n ",
    "body": "\n      \n      Lawmakers briefed on Trump administration's 3-pronged plan for Venezuela\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5669666/nx-s1-9600003\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Secretary of State Marco Rubio and Secretary of Defense Pete Hegseth briefed lawmakers Wednesday on the Trump administration's plans for Venezuela.   \n\n    MICHEL MARTIN, HOST:  Now to the other major story we're following - the Trump administration's plans for Venezuela. The administration has unveiled a three-pronged plan for the country. It starts with a U.S. quarantine that includes Washington's control of Venezuelan oil sales. The details emerge from a closed-door briefing that Secretary of State Marco Rubio and Defense Secretary Pete Hegseth gave lawmakers after the weekend military operation that led to the capture of Venezuelan president Nicolás Maduro. Congress was not told about it in advance. NPR congressional correspondent Barbara Sprunt reports on what lawmakers learned yesterday.BARBARA SPRUNT, BYLINE: These were the first comprehensive briefings for rank-and-file members who've been waiting for days to hear directly from the administration about the operation that led to Maduro's capture.(SOUNDBITE OF ARCHIVED RECORDING)MIKE JOHNSON: We had, I believe, a full house. I think almost every member of the House, Republican and Democrat, were present today.SPRUNT: That's House Speaker Mike Johnson, one of the many top Republicans who support President Trump's actions. Rubio told lawmakers that main next goals are stabilization of Venezuela, economic recovery for the country and transition. He did not elaborate on what that transition would look like. As for U.S. involvement going forward, Johnson added the White House's goal is not to have U.S. boots on the ground.(SOUNDBITE OF ARCHIVED RECORDING)JOHNSON: That is not the administration's objective, that is not their expectation.SPRUNT: As lawmakers emerge from the classified meeting, the partisan divide was on full display. Republicans praised the operation. Oklahoma Senator Markwayne Mullin even said it was one of the best briefings he's ever received in Congress.(SOUNDBITE OF ARCHIVED RECORDING)MARKWAYNE MULLIN: What we want to do is give the best opportunity for the Venezuelan people to take back their country and put it back in the democracy that they lost 25 years ago, and there was a full plan, full effort.SPRUNT: But Democrats said the exact opposite - that they didn't hear a full plan.(SOUNDBITE OF ARCHIVED RECORDING)SETH MOULTON: There are a lot of questions from both Democrats and Republicans about what comes next, what the timeline is. And they basically refused to answer any of those questions.SPRUNT: That's Massachusetts Congressman Seth Moulton.(SOUNDBITE OF ARCHIVED RECORDING)MOULTON: I think the military clearly had a plan, but I think this administration is completely winging it.SPRUNT: Here's how Secretary of State Marco Rubio responded to that exact critique.(SOUNDBITE OF ARCHIVED RECORDING)MARCO RUBIO: I used to be a senator, too. That's what you always say when it's the other party. The bottom line is, we've gone into great detail with him about the planning. We've described it to him.SPRUNT: But Senate Minority Leader Chuck Schumer said he wants more. And not in classified briefings, he wants public hearings.(SOUNDBITE OF ARCHIVED RECORDING)CHUCK SCHUMER: We need answers to these questions, and we need them made publicly.SPRUNT: Schumer's repeatedly cited concern about the administration taking similar actions in other countries and said he's dissatisfied with the answers given to him by administration officials. Barbara Sprunt, NPR News, the Capital.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lawmakers briefed on Trump administration's 3-pronged plan for Venezuela",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-08T11:49:36.000Z",
      "dateModified": "2026-01-08T11:49:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]