[
  {
    "title": "Trump says he's confident of a deal ahead of Xi meeting",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5589729/trump-xi-deal-south-korea-apec",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4436x2495+0+231/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F24%2F89%2F0754c3ba452e99ad0f424ecab152%2Fap25302162361546.jpg",
    "tag": "Politics",
    "date": "2025-10-29T10:02:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks at an Asia",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks at an Asia-Pacific Economic Cooperation CEO luncheon in Gyoeongju, South Korea, Wednesday, Oct. 29, 2025.\n                \n                    Mark Schiefelbein/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Schiefelbein/AP\n    \n\n   \n   GYEONGJU, SOUTH KOREA – President Trump on Wednesday confidently predicted striking a deal with China's leader in a bilateral meeting on the sidelines of the Asia Pacific Economic Forum, following a period of trade tensions that have threatened to escalate.   \n   \"I think we're going have a deal, I think it will be a good deal for both, and that's really a great result,\" Trump told a lunch meeting of APEC business executives in the southern city of Gyeongju.    \"That's better than fighting and going through all sorts of problems,\" he added ahead of the Thursday meeting with President Xi Jinping. \"No reason for it.\"   Trump said that he could reduce tariffs on Chinese goods in exchange for a commitment from Beijing to curb exports of chemicals used to make fentanyl.   \n   \"I expect to be lowering that because I believe that they're going to help us with the fentanyl situation,\" Trump told reporters en route to Gyeongju. \"They're going to be doing what they can do.\"   The U.S. currently imposes a 20% tariff on Chinese imports, in addition to other tariffs, because the U.S. government believes China has not done enough to restrict fentanyl precursor exports.   In response, Beijing imposed retaliatory tariffs on U.S. soybeans. U.S. and Chinese economic officials met over the weekend in Malaysia to build the framework of a trade deal that would include China resuming purchases of U.S. soybeans.   The deal would also include China delaying the imposition of export restrictions on rare earths, while the U.S. would hold off on raising tariffs by 100%.   Both Beijing and Washington are trading accusations that the other side's economic coercion is wreaking havoc on the global economy.   \"This is China versus the world,\" Treasury Secretary Scott Bessent said about China's rare earth export controls this month. \"They have pointed a bazooka at the supply chains and the industrial base of the entire free world, and we're not going to have it,\" he said.   \"The U.S. has raised tariffs so high that it's brought globalization to the verge of breakdown,\" says Zhu Feng, dean of the School of International Studies at Nanjing University in China.   \n   He notes that besides tariffs, the U.S. has raised port fees this month on Chinese-owned or operated ships docking at U.S. ports. It has suggested controls on U.S. exports of software to China.   And it has proposed barring Chinese air carriers headed to and from the U.S. from flying through Russian airspace. China's airlines have a cost advantage, because Russia allows Chinese carriers to transit their airspace, but not U.S. ones.   \"You can make China accept your rise in tariffs. But you can't keep overwhelmingly pounding on China so hard,\" he says. \"China's retaliation is to show China and the world that the U.S. can't just keep us cornered,\" Zhu adds.   Trump has also mentioned that he wants to discuss nuclear arms control with Xi, and possibly include China in U.S.-Russia nuclear arms control negotiations.   Despite speculation that Trump might try to revive nuclear negotiations with North Korean leader Kim Jong Un on this trip, that now seems off the table.   Trump told South Korean President Lee Jae Myung at the start of bilateral talks that talks with Xi were his main goal. \"We're looking forward to seeing him [Xi], and that was our focus, really, for this visit.\"   Trump told Lee he was aware that the two Koreas remain technically in a state of war, and assured Lee that \"we will see what we can do to get that straightened out. You know that I'll be working on this very hard.\"   As Trump was visiting South Korea, Pyongyang said it had conducted successful cruise missile tests.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he's confident of a deal ahead of Xi meeting",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4436x2495+0+231/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F24%2F89%2F0754c3ba452e99ad0f424ecab152%2Fap25302162361546.jpg"
      ],
      "datePublished": "2025-10-29T10:02:21.000Z",
      "dateModified": "2025-10-29T10:02:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Korea touts missile tests as Trump visits South Korea",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5589702/north-korea-missile-tests-trump-south-korea",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+260/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2F22%2F547355c948dea28e8dbbf85daac5%2Fap25301821881000.jpg",
    "tag": "Politics",
    "date": "2025-10-29T05:45:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This photo provided by North Korean gove",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This photo provided by North Korean government shows what it says a test of a sea-to-surface cruise missile at an undisclosed place in North Korea, Tuesday, Oct. 28, 2025. Independent journalists were not given access to cover the event depicted in this image distributed by the North Korean government. The content of this image is as provided and cannot be independently verified. Korean language watermark on image as provided by source reads: \"KCNA\" which is the abbreviation for Korean Central News Agency.\n                \n                    KCNA via KNS/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        KCNA via KNS/AP\n    \n\n   \n   SEOUL, South Korea — North Korea said Wednesday its recent test-firings of sea-to-surface cruise missiles were successful, in another display of its growing military capabilities as U.S. President Donald Trump visits South Korea.   North Korea's official Korean Central News Agency said the missiles fired Tuesday flew for more than two hours before accurately striking targets in its western waters. It said the weapons would contribute to expanding the operational sphere of the country's nuclear-armed military.   \n   South Korea's Joint Chiefs of Staff said the military had detected the North Korean launch preparations and that the cruise missiles were fired in the North's northwestern waters at around 3 p.m. Tuesday. The joint chiefs said South Korea and the United States were analyzing the weapons and maintaining a combined defense readiness capable of a \"dominant response\" against any North Korean provocation.   The North Korean report came hours before an expected summit between Trump and South Korean President Lee Jae Myung in the city of Gyeongju, where South Korea is hosting this year's Asia-Pacific Economic Cooperation meetings.   Speaking with reporters aboard Air Force One en route from Japan to South Korea, Trump downplayed the North Korean launches.   \"He's been launching missiles for decades, right?\" he said, apparently referring to Kim Jong Un. Trump reiterated he still wants to meet with Kim, whom he met three times in 2018 and 2019 before their diplomacy derailed over disagreements on U.S.-led sanctions against the North.   \"We had a really good understanding of each other,\" Trump said.   \n   KCNA said the tests were attended by senior military official Pak Jong Chon, who also inspected training for sailors aboard North Korea's newly developed destroyers Choe Hyon and Kang Kon, which leader Kim Jong Un has described as key assets in his efforts to strengthen the navy.   North Korea's latest launches followed short-range ballistic missile tests last week that it said involved a new hypersonic system designed to strengthen its nuclear war deterrent.   During his South Korean visit, Trump is scheduled to meet with Chinese President Xi Jinping. However, South Korean officials have said a Trump–Kim meeting is unlikely.   \n   North Korea has shunned any form of talks with Washington and Seoul since Kim's high-stakes nuclear diplomacy with Trump fell apart in 2019 during the American president's first term.   Kim's top foreign policy priority is now Russia. In recent months, he has sent thousands of troops and large quantities of military equipment to help fuel President Vladimir Putin's war in Ukraine, while embracing the idea of a \"new Cold War\" and positions his country as part of a united front against the U.S.-led West.   Last month, Kim reiterated he wouldn't return to talks with the United States unless Washington drops its demand for North Korea's denuclearization, after Trump repeatedly expressed his hopes for new diplomacy.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Korea touts missile tests as Trump visits South Korea",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5000x2813+0+260/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2f%2F22%2F547355c948dea28e8dbbf85daac5%2Fap25301821881000.jpg"
      ],
      "datePublished": "2025-10-29T05:45:40.000Z",
      "dateModified": "2025-10-29T05:45:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump flirts with running for an unconstitutional third term — again",
    "url": "https://www.npr.org/2025/10/29/nx-s1-5587822/president-trump-flirts-with-running-for-an-unconstitutional-third-term-again",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-29T08:40:37.000Z",
    "description": "\n      \n      President Trump flirts with running for an unconstitutional third term -- again\n    \n        \n                Download\n                \n",
    "body": "\n      \n      President Trump flirts with running for an unconstitutional third term -- again\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5587822/nx-s1-9510724\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      President Trump mentioned again this week the possibility of running for a third term. Doing so would be unconstitutional, so why does the president keep floating the idea?   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump flirts with running for an unconstitutional third term — again",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-29T08:40:37.000Z",
      "dateModified": "2025-10-29T08:40:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5589180/trump-tariffs-senate-vote",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg",
    "tag": "Politics",
    "date": "2025-10-28T23:47:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping con",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An American flag flies near shipping containers at the Port of Los Angeles on Sept. 26.\n                \n                    Mario Tama/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mario Tama/Getty Images\n    \n\n   \n   The Republican-led Senate on Tuesday delivered a rare bipartisan rebuke of President Trump in a vote to terminate the emergency powers he has used to set tariffs on Brazil, part of a larger push to rein in the administration's efforts to install trade barriers.   By a vote of 52 to 48, the Senate approved a measure that would roll back the 50% tariffs on Brazil imposed by President Trump in July. Five Republicans joined with Democrats to pass it: Susan Collins of Maine, Alaska's Lisa Murkowski, Thom Tillis of North Carolina and Kentucky's Mitch McConnell and Rand Paul.   \n   The success of the resolution, which needed just a simple majority to pass, may only prove symbolic. Speaker Mike Johnson, R-La., is unlikely to bring the measure up for a vote in the House, and even if he did President Trump would almost certainly veto it.   Still, the vote marked a test of support for the president's tariff policies among Republicans, reflecting unease inside the party about their impacts on the U.S. economy, and specifically the farming and manufacturing sectors. It came ahead of arguments at the Supreme Court this fall in a case challenging Trump's authority to put sweeping tariffs in place using emergency powers.   \n   Tuesday's vote was the first of three planned by Democrats and a handful of Republicans aimed at rolling back the president's tariff policies. Later this week, the Senate is expected to take up similar votes to reverse tariffs on Canada and other nations.   One of the lawmakers behind the push is Sen. Tim Kaine, D-Va., the lead sponsor of the measure approved Tuesday. Ahead of the vote, Kaine told reporters the effort highlights the tariffs' stark impacts on the U.S. economy in recent months.   \"They're about the economic destruction of tariffs, but they are also really about how much will we let a president get away with?\" Kaine asked. \"Do my colleagues have a gag reflex or not, in terms of powers that constitutionally are handed to Congress?\"   \n   The five Republicans who broke ranks did so despite a last minute lobbying push by Vice President JD Vance, who met with Senate Republicans on Capitol Hill on Tuesday and urged them to back the president's policies. Vance told reporters after the lunch meeting that the tariffs are critical leverage for Trump in international negotiations.   To block the president's emergency powers to set tariffs, \"is to strip that incredible leverage from the president of the United States,\" Vance told reporters outside the meeting room near the Senate chamber. \"I think it's a huge mistake, and I know most of the people in there agree with me.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President JD Vance talks with reporters after attending the weekly Senate Republican policy lunch on Tuesday. Vance told reporters that tariffs are a critical source of leverage for President Trump on the international stage.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   The vote took place as President Trump is in Asia for a multi-nation trip where trade talks are a top focus.   Sen. Josh Hawley, R-Mo., said Vance told Republicans that Trump is essentially on a trade mission.   \"It's successful, and it's bringing in a lot of revenue,\" Hawley said about the trip as he explained his opposition to the measure. \"I'm supportive of the president's tariff policy.\"   \n   Not all Republicans were convinced. Tillis said after the meeting he would vote to limit the tariffs.   \"I just don't think there's a rational basis for it,\" Tillis said. \"If you start allowing that … that creates a big uncertainty in the business community.\"   Trump triggered the Brazil tariffs this summer to pressure the country's government to end what he called a \"witch hunt\" against his ally, former far-right Brazilian President Jair Bolsonaro. Last month, Bolsonaro was sentenced to 27 years in prison for attempting a coup to stay in power following his 2022 election defeat.   The vote wasn't the first time Senate Republicans have broken with Trump on tariffs. In April, a measure to block tariffs on Canada drew a simple majority of the Republican-led Senate as a handful of G.O.P senators joined Democrats to push the measure across the finish line. Kaine and Paul co-sponsored the measure, and McConnell, Collins and Murkowski voted in favor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Senate Republicans deal Trump a rare rebuke on trade with vote against Brazil tariffs",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6865x3862+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F77%2Fc3%2Fb9c6a6a04dd099fa3c3c5244d96e%2Fgettyimages-2237627719.jpg"
      ],
      "datePublished": "2025-10-28T23:47:12.000Z",
      "dateModified": "2025-10-28T23:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Camouflaging cars and swapping license plates: How agents make immigration arrests",
    "url": "https://www.npr.org/2025/10/29/g-s1-95373/immigration-arrests-license-plates-conceal-federal-agents",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6780x3814+0+12/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F92%2F2e7dd0304ffa933ff1ef6b23ce46%2Fap25294634981269.jpg",
    "tag": "Politics",
    "date": "2025-10-29T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal agent, center, walks to his ve",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal agent, center, walks to his vehicle outside an ICE processing facility in the Chicago suburb of Broadview, Ill., on Oct. 21, 2025.\n                \n                    Nam Y. Huh/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nam Y. Huh/AP\n    \n\n   \n   In a video shared on TikTok in September, a masked man in a tactical vest runs across a street in Chicago toward a Ford SUV. More people in tactical police vests get inside the vehicle, as an angry crowd forms around it, yelling profanities.   \"You guys are separating families,\" one woman shouts at the car, which is flashing red and blue lights. \"And for what?\"   The woman tells others not to come near the area because \"la migra\" is there, which is how some Spanish speakers refer to U.S. immigration authorities. But there is little to reveal whether the Ford belongs to U.S. Immigration and Customs Enforcement (ICE), the U.S. Department of Homeland Security (DHS) agency that is leading President Trump's push for mass arrests and deportations of those suspected of being in the U.S. without legal status, or any other federal unit tasked with carrying out immigration-related arrests. The car has no license plates on the back and appears to have no words on the side that indicate it is government property.   \n   Over the past year, many federal law enforcement agents conducting immigration arrests have been concealing their faces under masks and gaiters when making arrests in public, in what DHS says is an effort to avoid doxing, or publishing agents' personal information online. Dozens of pending proposals across the country now seek to ban masking of federal policing authorities in public places.   \n   Less public attention has centered on the masking of agents' cars.   But some vehicles being used in what appear to be immigration-related arrests do not have license plates, or have traded license plates, NPR found in a review of videos shot by bystanders and reporters, and those circulating on social media. The videos appear to come from areas where the administration has focused its immigration enforcement across the country, including Illinois, California and Washington state.   Witnesses and activists have alleged similar behavior concerning license plates in court filings and in media reports, while the Illinois Secretary of State, a Democrat, has condemned the apparent trading of license plates as illegal in his state.   NPR sent several requests for comment to ICE citing the specific photos and videos that appear to show license plate removal or manipulation during immigration enforcement operations. The department did not respond to the specific examples.   \n   Immigration advocates say that as the agency increases its presence across the country thanks to an infusion of cash from Congress, untraceable vehicles may add to confusion over what tactics immigration officers can or should be using, and could prevent people from holding officers accountable.   \n   \"Most people are not used to interacting with federal law enforcement on our streets,\" said Bruno Huizar, policy manager at the California Immigrant Policy Center. Not knowing the identity of law enforcement – or not knowing if the enforcement is legitimate – exacerbates lack of trust in police, and makes it harder for people to defend their legal rights, he said.   Officers who appeared to be conducting immigration arrests in unmarked vehicles were captured on videos shot across the country and shared online on platforms like TikTok, Instagram and Eyes Up, an application that tracks where federal agents have arrested migrants. NPR reviewed all videos cited in this story and confirmed the dates of the videos and locations of law enforcement presence and bystanders when possible. When details couldn't be verified, NPR corroborated information with immigration experts, activists, and a developer for an app that documents confrontations with federal agents.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                File image from May 7, 2025 in Newark, N.J., shows a badge hanging over the uniform of an Immigration and Customs Enforcement (ICE) agent.\n                \n                    Timothy A. Clary/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Timothy A. Clary/AFP via Getty Images\n    \n\n   \n   In a video shared in June that takes place in Washington state, a federal agent in a police vest is seen driving a black Ford SUV with no license plate on the back of the vehicle.   And in another video posted on the Eyes Up app, labeled as shot in July in a Los Angeles suburb, a blue Nissan is seen with a placard on the back of the car that reads \"Lexus of Valencia\" in the space where a license plate is usually placed. The vehicle is seen parked near others that federal agents were seen using while detaining a person.   NPR asked ICE to confirm whether these vehicles and others like them belonged to federal employees working for the agency. The agency did not respond.   \n   In an earlier statement provided in response to questions about the vehicle with the \"Lexus of Valencia\" placard, ICE spokesperson Mike Alvarez told NPR in a statement that ICE officers and agents do not use personal or rental vehicles while conducting immigration enforcement operations.   \"Further, per federal code, federal law enforcement agency vehicles used primarily for investigative, law enforcement, intelligence, or security duties are exempt from displaying U.S. Government license plates or motor vehicle identification when such identification would interfere with these critical duties,\" Alvarez said.   \n   Appearing \"like a ghost\"   It used to be rare for ICE employees to drive cars without plates when conducting arrests, said Darius Reeves, a former Baltimore field office director for ICE Enforcement and Removal Operations. He left the agency this year.   \"The agency clearly wants to appear like a ghost,\" Reeves said. \"I have never experienced this.\"   The federal code, or regulation, that Alvarez cited requires that vehicles used by government employees display government license plates on the front and rear of the vehicle – except when identifying these cars would interfere with investigative, law enforcement, intelligence, or security duties.   Federal regulation also prohibits swapping license plates from one car to another.   But ICE guidelines for agents on managing vehicle fleets indicate that operating a vehicle without license plates is meant to be the exception, not the rule.   \"All ICE owned, or leased motor vehicles must display DHS or [General Services Administration] license plates, unless exempted,\" the guidelines state. To operate a vehicle without a federal license plate, someone must submit a request for a waiver to the unit that manages ICE's fleet, according to the guidelines.   \n   In August, NPR requested to review all license plate waivers submitted by ICE over the previous year. At the time of publication, ICE had not provided the documents to reporters, though according to the federal Freedom of Information Act, the agency should have provided them by September.   An automatic email message received this month stated all federal records offices would not communicate with reporters about records until the end of the \"funding hiatus,\" referring to the shutdown of the federal government that began on October 1.   \n   Alvarez, the ICE spokesperson, did not respond to a question from NPR about how many times employees had submitted waivers to operate vehicles without a license plate.   Removing and swapping license plates   Some states prohibit swapping license plates on vehicles. But photos taken by activists and a video shared to social media suggest federal agents are doing this anyway in Illinois and California.   A video posted to a TikTok account in October shows a man dressed like a federal agent who said that changing license plates on vehicles was standard practice.   \"We change the plates out every day,\" says in the video, which was described by the poster as having taken place in Round Lake, Ill., as he walks around an otherwise unmarked black Jeep SUV with an Illinois license plate.   On Oct. 22, Illinois Secretary of State Alexi Giannoulias posted the video to X, stating that Illinois had \"zero tolerance for this type of illegal activity.\"   \"Flipping license plates or altering them in any way to avoid detection is strictly prohibited in Illinois,\" said Giannoulias in the video, urging residents to report similar violations to a hotline. \"No one, including a federal agent, is above the law.\"   Alvarez, the ICE spokesperson, identified the officers in that video as Border Patrol. A separate agency inside DHS that has been involved with immigration enforcement, Border Patrol has been among the agencies tasked with conducting immigration-related arrests, particularly in cities like Chicago in recent weeks. Customs and Border Protection, the branch of DHS it is housed within, did not respond to a request for comment from NPR asking about their practice of switching license plates.   \n   Activists for the Harbor Area Peace Patrol, a community group based in Los Angeles, Calif., have said they also noticed behavior that seems to contradict state guidelines about license plates.   Since June, the activists say, they have monitored federal agents almost every day as they leave Terminal Island, an artificial island in southern Los Angeles that has been used as a staging area for agents before they arrest migrants and conduct raids throughout the city. More than once, activists documented people on Terminal Island, a part of LA, removing plates from vehicles.   \n   \"We've seen that multiple times,\" said Elijah Chiland, an activist with the group.   Activists said they have additionally noticed that sometimes, federal agents left the staging area in the same car, but with different license plates on the vehicle than the car had on a previous day. And multiple times, the activists said, they noticed something else: Vehicles departing from Terminal Island were spotted with one license plate on the front and a different plate on the back.   \"I've seen seven or eight different times that a car had a license plate that it didn't originally have,\" said Victor Maldonado, another of the group's activists. ICE did not respond to NPR questions about the allegations of license plate-switching near Terminal Island.   Mexican markings in Washington and Illinois   Some videos shared online appear to show federal agents making arrests using vehicles marked with Mexican objects or icons.   In the video recorded in Spokane Valley, Wash., where a car without license plates was used, another vehicle drew attention from bystanders. In front of the car without plates, two masked federal agents in tactical vests are seen entering a white Jeep SUV with a back license plate from the Mexican state of Tamaulipas.   \"Tamaulipas on the license plate, can you believe this?\" says a bystander, who can be heard on the audio in the clip.   ICE did not respond to a request for comment asking if this was their vehicle or operation.   A similar tactic was observed in a video that appears to be recorded in Illinois and was shared on TikTok in September. In the video, a man in a tactical police vest marked with the words \"U.S. Border Patrol\" is seen entering a silver Ford Explorer with a large Mexican flag across the hood of the car. Mexican flag stickers are seen stuck to the car's back and side windows.   \n   \"ICE using Mexican flag to target immigrants!!\" read the words typed across the video, shared to TikTok, though it is unclear that anyone working for ICE is in the vehicle.   \n   Another video shared the same day showed multiple men in tactical vests loading into a vehicle with a similar Mexican flag splayed across the hood.   When asked about whether Border Patrol agents were using a vehicle with Mexican flag decals, DHS spokesperson Tricia McLaughlin stated the agency believes its employees are not camouflaging their identities, though she acknowledged agents do wear masks to protect themselves from harm. ICE did not respond.   \"DHS is not going to confirm our vehicles and put an even larger target on our officers' backs,\" McLaughlin said in an emailed statement. U.S. Customs and Border Protection did not respond to questions regarding current CBP policy for markings on cars including painted hoods and stickers.   Multiple agencies, few agency markings on cars   Involvement of other federal agencies in immigration activities further complicates the situation, said Reeves, the former ICE employee.   Employees of the Federal Bureau of Investigation, the Bureau of Alcohol, Tobacco, Firearms and Explosives, the Drug Enforcement Administration, the U.S. Marshals Service and the U.S. Park Police have been involved with arresting migrants. But during arrests, the officers' clothing hasn't appeared to always match the cars they drive, according to media reports and NPR's own reporting.   In one instance, after President Trump deployed the National Guard to patrol D.C. in early August, a group of officers detained two migrants. The officers' clothing indicated some of them worked for the FBI, ATF and U.S. Park Police, reporters observed. One person wore a tactical vest labeled \"police.\" Another wore a tactical vest with no description on it at all. A U.S. Park Police vehicle was the only car visible that was labeled with the name of a law enforcement agency.   \n   Making arrests while operating cars that aren't clearly identified can erode the public's trust in local police, said Daniel Hodges, a police officer with the Metropolitan Police Department of Washington D.C., which has also worked with ICE on immigration arrests in the city. Hodges was attacked during the riot at the U.S. Capitol on Jan. 6, 2021.   \"We've got to live with that destruction of trust after the feds go away,\" said Hodges. \"Ethically and in terms of long-term effectiveness of our police departments, it's only detrimental as far as I can see.\"   \n   David Bier, the director of immigration studies at the libertarian Cato Institute, said that removing or switching license plates can be detrimental for another reason: It helps federal agencies avoid further scrutiny.   \"It removes the opportunity for accountability if you don't know what officers were conducting an operation. There's no way to track back, 'This person was using this vehicle,'\" Bier said. \"It's unclear exactly how they track these actions. So it could genuinely be impossible to ever determine who was involved and in what operation.\"   Bier said not knowing which agency or people are involved in an arrest can make it difficult for Congress or lawyers to investigate specific claims if officers are accused of violating people's rights.   \"Of course, if you're being charged with a crime or being arrested or detained, you have a right to know who is leveling this charge against you, who's claiming that you violated the law,\" Bier said. \"These are all basic principles of liberal democracy that we've just taken for granted.\"   Nick McMillan contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Camouflaging cars and swapping license plates: How agents make immigration arrests",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6780x3814+0+12/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F92%2F2e7dd0304ffa933ff1ef6b23ce46%2Fap25294634981269.jpg"
      ],
      "datePublished": "2025-10-29T09:00:00.000Z",
      "dateModified": "2025-10-29T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Are you worried about your SNAP benefits? NPR wants to hear your story",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5587760/snap-benefits-callout",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7820x4399+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F71%2Ffecf7a174a12a81c2974da4f6e18%2Fap25289506125167.jpg",
    "tag": "Politics",
    "date": "2025-10-28T19:02:09.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A California SNAP benefits shopper pushe",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A California SNAP benefits shopper pushes a cart through a supermarket.\n                \n                    Allison Dinner/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Allison Dinner/AP\n    \n\n   \n   As the federal government shutdown drags on, tens of millions of people are at risk of losing food and nutrition aid as a result. This includes the 42 million people who rely on the Supplemental Nutrition Assistance Program (SNAP), previously known as food stamps.   The NPR Network wants to hear from you about the potential loss or delay of these food benefits. Has the uncertainty already changed your plans around food? What other local resources are you turning to?   Fill out the form below and tell us your story. If you would be open to an NPR or member station producer contacting you for a story, please indicate that in the appropriate field. We will not use your submission in our story until we have communicated with you and obtained your consent to use the details that will be published.   \n   Your submission will be governed by our general Terms of Use and Privacy Policy. As the Privacy Policy says, we want you to be aware that there may be circumstances in which the exemptions provided under law for journalistic activities or freedom of expression may override privacy rights you might otherwise have.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Are you worried about your SNAP benefits? NPR wants to hear your story",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7820x4399+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F71%2Ffecf7a174a12a81c2974da4f6e18%2Fap25289506125167.jpg"
      ],
      "datePublished": "2025-10-28T19:02:09.000Z",
      "dateModified": "2025-10-28T19:02:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNAP runs out of money Nov. 1. States are now figuring out how to feed millions of people",
    "url": "https://www.npr.org/2025/10/28/g-s1-95189/snap-food-stamps-government-shutdown-november",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+77/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F69%2F1c9cb034456cb4e3aab6e90cc907%2F251021-food-for-fed-workers-wamu-08.JPG",
    "tag": "Politics",
    "date": "2025-10-28T18:46:17.000Z",
    "description": "SNAP runs out of money Nov. 1. Here's what that means in your state   As November looms, states are trying to sort what options they can offer benefic",
    "body": "SNAP runs out of money Nov. 1. Here's what that means in your state   As November looms, states are trying to sort what options they can offer beneficiaries to fill the gap in food assistance. Reporters from the NPR Network are covering the impact of this potential lapse in states across the country.\n\n   \n\n                  \n            Updated October 28, 20254:15 PM ET\n                \n                    Originally published October 28, 20252:46 PM ET\n                \n                \n\n      \n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal worker moves through the food distribution line at an event giving food to federal workers affected by the shutdown in Hyattesville, Md., on Oct. 21, 2025.\n                \n                    Tyrone Turner/WAMU\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tyrone Turner/WAMU\n    \n\n   \n   The federal government shutdown continues without an end in sight. In just a few days, tens of millions of people are at risk of losing federal food and nutrition benefits as a result. This includes the nearly 42 million people who rely on the Supplemental Nutrition Assistance Program, or SNAP, previously known as food stamps.   The Trump administration has warned that the debit-like EBT cards will not be refilled and that the program will run out of money on Nov. 1.   SNAP, the country's largest anti-hunger program, dates back to the Great Depression and has never been disrupted this way. Most recipients are seniors, families with kids and people with disabilities.   \n   Individual states handle the distribution, while the federal government provides the funds and infrastructure that power the debit-like cards.   Are you worried about your SNAP benefits? NPR wants to hear your story   In a letter dated Oct. 10, the U.S. Department of Agriculture (USDA) told state agencies to hold off distributing November benefits \"until further notice\" because of insufficient funds. The left-leaning Center on Budget and Policy Priorities has called on the agency to shift money from its contingency fund and other places to keep SNAP at least partially funded. It contends the USDA has a legal obligation to do so since SNAP is an entitlement program. But the USDA rejects that argument, stating in a memo Friday that its contingency funds are \"not legally available\" to extend regular benefits and are meant only for \"natural disasters like hurricanes, tornadoes, and floods.\"   As NPR's Stephen Fowler reports, a coalition of more than two dozen Democratic state leaders are suing the Trump administration over its decision to suspend federal food benefits during the government shutdown.    Now, as November looms, states are trying to sort what options they can offer beneficiaries to fill the gap in food assistance.   — Jennifer Ludden, NPR    Reporters from the NPR Network are covering the impact of this potential lapse in states across the country.   \n   Here's what we know so far.      Alabama   Roughly 749,000 people participate in SNAP in Alabama, according to the USDA. Alabama's Department of Human Resources (DHR), the agency responsible for SNAP in the state, says on its website that individuals can still apply for SNAP benefits during the suspension and DHR will continue to process applications and determine eligibility. Benefits will not be issued until the suspension is lifted.Current SNAP recipients, however, \"must continue to recertify their benefits, report as they normally would, and submit all documentation that would normally be required for them to continue in the program,\" DHR says. This is necessary so that each SNAP recipient can more quickly use their November funds in the grocery stores.      Alaska   Roughly 66,000 people participate in SNAP in Alaska, according to the USDA. Alaskans will not receive SNAP benefits for November, according to the state Division of Public Assistance, unless the federal government shutdown ends before then. [Alaska Public Media]Officials say the division will continue adding SNAP beneficiaries during the shutdown and Alaskans who lost food because of Typhoon Halong in western Alaska can apply to get October SNAP benefits re-issued. Michelle DeWitt, executive director of Bethel Community Services Foundation, said the state's formal food security safety nets are already stretched thin in the wake of the early October storm. [Alaska Public Media]      Arizona   More than 887,000 people participate in SNAP in Arizona, according to the USDA. The Arizona Department of Economic Security, which administers SNAP in the state, is directing Arizona SNAP recipients to local food banks if they need immediate food assistance. Food banks in Arizona can be found through the Arizona Food Bank Network. [KJZZ]      Arkansas   Roughly 236,000 people participate in SNAP in Arkansas, according to the USDA. Arkansas' Department of Human Services says SNAP beneficiaries should prepare for a delay or disruption in November benefits, according to an Oct. 22 post on the agency website. The agency is awaiting further guidance from USDA.On X , Gov. Sarah Huckabee Sanders echoed Republican talking points, blaming Democrats for the shutdown and the impact on SNAP beneficiaries in her state.  She wrote Monday, \"SNAP doesn't just serve families - it helps small town grocery stores too. But 2,700 Arkansas retailers soon won't be able to serve SNAP-recipient customers because of the Democrat's shutdown. Democrats need to do their job and stop punishing families and small businesses.\"Arkansas' DHS is pushing SNAP recipients to find local food pantries, churches and other organizations for temporary food assistance and to check for eligibility of other food programs.    \n      California   Over 5.5 million people participate in CalFresh — the state's implementation of the federally funded SNAP program. Well over 1 million people in LA County. The other major SoCal counties — San Bernardino, Riverside and Orange — each have more than 300,000 people on CalFresh, according to state data. [LAist]Gov. Gavin Newsom announced Oct. 22 that he would deploy the California National Guard to support food banks across California as the federal government shutdown drags on. [KQED]   For more on alternative free resources in the San Francisco Bay Area, head to KQED.      Are you worried about your SNAP benefits? NPR wants to hear your story      Colorado   Gov. Jared Polis said 600,000 Coloradans, half of whom are children, won't get SNAP benefits on Nov. 1. Polis warned that state funding would not be nearly enough to offset the federal SNAP delay. [Colorado Public Radio]As the Nov. 1 date nears, food banks and county health services have been preparing for a delay in the federal program and increased crowds needing assistance. [Colorado Public Radio]Colorado is among the states suing the Trump administration over its decision to suspend federal food benefits during the government shutdown. [Colorado Public Radio]      Connecticut   SNAP serves an estimated 360,000 people in Connecticut per year, according to state officials. [CT Public]Connecticut will spend $3 million, which will stretch about two weeks, to partially supplement federal food aid benefits through the nonprofit Connecticut Foodshare. [WSHU]Shortly after the latest shutdown began, some Connecticut legislators asked if the state — which has enjoyed unprecedented budget surpluses averaging more than $1.8 billion since 2017 — could again pump some of its own resources into SNAP benefits. But if EBT cards are shut off that could prove ineffective. Officials say  they are exploring options to expand emergency aid to food pantries and banks and other nonprofit nutrition assistance services. [CT Public]      Delaware   Over 110,000 people in Delaware participate in SNAP according to the USDA.Gov. Matt Meyer confirmed on X that the government shutdown means Delaware will not be able to issue more than $20 million dollars in monthly SNAP food benefits to approximately 60,000 Delaware households. He wrote, \"We're a state of neighbors, and we'll get through this — together.\"   \n      District of Columbia   Over 130,000 people in the District of Columbia participate in SNAP according to the USDA.D.C. Attorney General Brian L. Schwalb was among a group of state attorneys general who signed on to a letter to the USDA asking for clarification on why reserve funds set aside for this purpose were not being used. The Capital Area Food Bank has seen some of its own federal funding slashed even as demand skyrockets. [WAMU]      Florida   Nearly 3 million people in Florida participate in SNAP, according to the USDA.State officials have warned SNAP recipients that benefits for the month of November \"will not be issued until federal funding is restored.\" [WLRN]U.S. Rep. Maxwell Alejandro Frost, a Democrat from Orlando, is calling on Republican Gov. Ron DeSantis and the Republican-majority Florida Legislature to convene a special session and pass legislation to fund SNAP, as a potential lapse in federal funding looms due to the federal government shutdown. [WLRN]In addition, earlier this month, Florida lawmakers learned that the state had a 15% administrative error rate in 2024, which will cost the state roughly $1 billion a year starting as early as 2027. [WUSF]      Are you worried about your SNAP benefits? NPR wants to hear your story      Georgia   SNAP serves 1.3 million people in Georgia, according to the USDA.At the same time, the state's SNAP administrators say they need more than $60 million from the state to maintain staffing in 2026 to make up for federal cuts. [WABE]Local reporting highlights the direct impact this loss of funding has on the state's economy and rural communities, especially. Fox5 Atlanta reports that SNAP \"injects more than $3 billion per year into Georgia's economy, supporting over 2,300 grocery stores, big box chains, specialty shops and farmers markets statewide.\" And 17% of rural Georgians rely on SNAP, compared to 11% in metro areas.    \n      Guam   Over 32,000 people in Guam participate in SNAP, according to the USDA.Gov. Lou Leon Guerrero signed a bill Monday that funds SNAP through November for the nearly 30% of Guam's population that receive the benefits. Pacific Daily News reports that the law means that $12.3 million will go to SNAP and $800,000 will go to the USDA's Special Supplemental Nutrition Program for Women, Infants, and Children, or WIC benefits.      Hawaii   Over 160,000 people in Hawaii participate in SNAP, according to the USDA.Hawaii is setting aside $100 million to help eligible families with housing and utility payments. [Hawai'i Public Radio]Earlier this month, Hawaii Foodbank Vice President Marielle Terbio told Hawai'i Public Radio that those in need should reach out for assistance. Updated lists of food distributions can be found at hawaiifoodbank.org/help, as well as resources for Maui at mauifoodbank.org. [Hawai'i Public Radio]   For more resources in Hawaii, head to Hawai'i Public Radio.       Idaho   Over 130,000 people in Idaho participate in SNAP, according to the USDA.The Idaho Department of Health and Welfare says it will not distribute food stamps in November. [Boise State Public Radio]The Idaho Foodbank, which serves about 216,000 people each month through 400 partners across the state, anticipates an increase in people accessing food pantries and soup kitchens as benefits run out at the end of the month. [Boise State Public Radio]      Illinois   Nearly 2 million people in Illinois participate in SNAP, according to the USDA.Food pantries in Chicago are urging families to prepare a \"plan B\" if federal benefits are paused for the nutritional program that helps low-income households. [WBEZ]      Indiana   Roughly 600,000 people in Indiana participate in SNAP, according to the USDA.A message on the Indiana Family and Social Services Administration website says the state can't issue November SNAP benefits until funding is restored. [Louisville Public Media]Nonprofits that serve lower-income families in Southern Indiana say they're worried about the shutdown exacerbating food insecurity in the area.  [Louisville Public Media]   \n      Iowa   Over 250,000 people in Iowa participate in SNAP according to the USDA.Gov. Kim Reynolds said Thursday she has directed the Iowa Department of Health and Human Services to hold regular calls with food banks and is reviewing the state's food insecurity response plan. [Iowa Public Radio]Kathy Underhill, CEO of the Des Moines Area Religious Council (DMARC), which runs a network of 14 food pantries, said this would hit low-income Iowans incredibly hard. \"November is always the busiest month in the food bank and food pantry world, and if SNAP benefits do not go out on time in November, the capacity of food banks and food pantries will be pushed to their very limits,\" Underhill said. [Iowa Public Radio]      Are you worried about your SNAP benefits? NPR wants to hear your story      Kansas   Over 186,000 people in Kansas participate in SNAP, according to the USDA.Gov. Laura Kelly joined a lawsuit by other Democratic governors and state attorneys general against the U.S. Department of Agriculture for refusing to fund the Supplemental Nutrition Assistance Program, or SNAP. [KCUR]Kelly said she will hold food drives on her statewide budget listening tour to benefit Kansans who have lost employment or welfare benefits due to the shutdown. [KCUR]      Kentucky   Over 550,000 people in Kentucky participate in SNAP, according to the USDA. Funding for food assistance benefits next month isn't coming, Gov. Andy Beshear said, due to the federal government shutdown. Funding for the Temporary Assistance for Needy Families program is also delayed. [LPM]Beshear is among the three Democratic governors and more than two dozen Democratic attorneys general suing the USDA over suspension of SNAP benefits.      Louisiana   Over 800,000 people in Louisiana participate in SNAP according to the USDA. Gov. Jeff Landry and the Louisiana Department of Health are notifying SNAP recipients they will not receive new benefits starting Nov. 1. Louisiana Department of Health Secretary Bruce Greenstein sent a letter this week announcing plans to furlough staff who work for SNAP as a result of the federal government shutdown. [WWNO/WRKF]   \n      Maine   Nearly 170,000 Mainers, or over 12% of the state's total population, could lose food assistance if SNAP benefits are not funded for November.  According to Maine Department of Health and Human Services, those who need additional resources are encouraged to call 211 for help. [Maine Public]      Maryland   Over 660,000 people in Maryland participate in SNAP, according to the USDA.Maryland Gov. Wes Moore said Friday that he will not tap into state cash reserves to pay for benefits. [WYPR]The Maryland Department of Aging is urging people to go to food banks if they are unable to afford food during the halt in benefits. [WYPR]In addition to the added demand, the Capital Area Food Bank has seen some of its own federal funding slashed even as demand skyrockets. [WAMU]      Massachusetts   Over 1 million people in Massachusetts participate in SNAP, according to the USDA. State officials and the United Way are partnering to help raise money to offset the potential lapse in federal food assistance. [GBH]Massachusetts receives about $240 million monthly from the federal government for the program, which officials say can't be covered by the state budget. [WBUR]      Michigan   Over 1.4 million people in Michigan participate in SNAP, according to the USDA.Michigan is suspending food assistance payments starting in November until further notice, according to the state health department. [Michigan Public]The Greater Lansing Food Bank, which covers seven counties through 300 food partners,  purchased additional food to account for an expected higher demand [Michigan Public]      Are you worried about your SNAP benefits? NPR wants to hear your story      Minnesota   Nearly half a million people in Minnesota participate in SNAP according to the USDA.The loss of federal funding leaves a $73 million void in Minnesota's nutritional safety net, and state officials say there isn't enough money to provide Minnesota participants with their November benefits. [MPR News]Gov. Tim Walz announced today $4 million in emergency state funding for Minnesota's food shelves as the federal shutdown continues. [MPR News]   \n   For more on food assistance resources in Minnesota, head to MPR News.       Mississippi   Over 350,000 people in Mississippi participate in SNAP according to the USDA.The Mississippi Department of Human Services announced on Oct. 24 that benefits won't be issued in November because of the ongoing shutdown.Gov. Tate Reeves attacked Democrats in Congress for the shutdown, saying on X that his state is unable to cover the costs, \"There is sadly no simple way for state government to just step in and pay the hundreds of millions of dollars in harm that this shutdown by the Washington Democrats is causing.\"      Missouri   Roughly 650,000 Missourians will not receive SNAP benefits for the month of November due to the ongoing government shutdown. [St. Louis Public Radio]In a statement, Missouri's health services department said it will continue to \"accept and process SNAP applications, reported changes, and mid-certifications\" as normal. Once the shutdown is over, the department will work quickly to restore SNAP benefits, the statement said. [St. Louis Public Radio]      Montana   Over 80,000 people in Montana participate in SNAP, according to the USDA.The Montana Food Bank Network expects demand on local food banks to rise the longer the shutdown persists. [Montana Public Radio]      Nebraska   Over 150,000 people in Nebraska participate in SNAP, according to the USDA.Like other Republican governors, Nebraska's. Jim Pillen blamed Democrats for the shutdown on social media. The state agency responsible for handling SNAP benefits says more updates will come later but confirmed the program will likely be disrupted due to the government shutdown.       Nevada   Funding for Nevada's administration of the Supplemental Nutrition Assistance Program, which provides food assistance for roughly half a million Nevadans, is set to run out on Nov. 1 [Nevada Public Radio]Keeping the program running requires about $90 million a month, and Gov. Joe Lombardo's office argues that creating a state-funded mechanism would require legislative approval. State Treasurer Zach Conine warned that the loss of benefits could immediately reduce the state's economic output by $162 million. [Nevada Public Radio]      New Hampshire   The state is planning to provide support to the more than 75,000 state residents who rely on SNAP, according to the state Department of Health and Human Services. The department announced plans Thursday to partner with the New Hampshire Food Bank to make up for the delayed federal funds. [NHPR]The health department said it is unclear if EBT cards will work amid the shutdown in November and encouraged people to use their remaining benefits, which typically roll over each month, by Oct. 31. [NHPR]      New Jersey   Over 800,000 people in New Jersey participate in SNAP, according to the USDA.NJ SNAP said other programs like Work First New Jersey and the Child Care Assistance Program will not be impacted by the shutdown. Democratic Gov. Phil Murphy issued a statement blaming Republicans for the shutdown and urging them to use about $5 billion in SNAP contingency funds set aside for emergency circumstances. He said, \"These decisions are putting families across our state in impossible positions, forcing them to choose between feeding their children, affording life-saving medications, or paying rent. We see this for what it is – a clear abandonment of America's working- and middle-class families.\"      New Mexico   Nearly half a million people in New Mexico participate in SNAP, according to the USDA.U.S. Rep. Melanie Stansbury, a Democrat, said an \"emergency food plan\" is emerging that tasks charitable organizations and schools with counteracting the expected loss of $90 million in SNAP benefits for 250,000 New Mexico households. [KUNM]      Are you worried about your SNAP benefits? NPR wants to hear your story      New York   Nearly 3 million people in New York participate in SNAP, according to the USDA. According to state and city data, 1.8 million of those are in New York City. [Gothamist]Gov. Kathy Hochul said Monday that she's exploring whether the state can send schoolchildren home with meals as the ongoing federal shutdown threatens November's food assistance benefits. [Gothamist]Erie County First Deputy Commissioner of Social Services Dan Szewc said the Department of Social Services will contact SNAP households directly with emergency food resource information starting this week. [Buffalo Toronto Public Media]      North Carolina   Over 1.4 million people in North Carolina participate in SNAP, according to the USDA.The North Carolina Department of Health and Human Services says November SNAP benefits could be disrupted if the federal government shutdown continues. [WFAE]Jason Kanawati Stephany is vice president of the Food Bank of Central & Eastern North Carolina, which serves about 40% of the state's population. Earlier this year, Kanawati Stephany told WUNC that North Carolina's seven Feeding the Carolinas food banks distributed 250 million meals over the past year. But for every one they provided, Kanawati Stephany said, SNAP provides nine. [WUNC]The state's attorney general, Jeff Jackson, and 22 other state attorneys general issued a warning to the U.S. Department of Agriculture that refusing to use reserve funds set aside for this exact situation would be unlawful. [PRE]      Northern Mariana Islands   Gov. David M. Apatang has formally requested a $3.9 million emergency appropriation from the Commonwealth of the Northern Mariana Islands 2026 budget to sustain Nutritional Assistance Program (NAP) benefits for November 2025. [Isla Public Media]The region only adopted the EBT system for benefits earlier this month. The delay was due in part to the unique block grant arrangement with the U.S. Department of Agriculture, which provided flexibility but exempted the Commonwealth from federal mandates tied to EBT implementation [Isla Public Media]      North Dakota   Over 50,000 people in North Dakota participate in SNAP, according to the USDA.Gov. Kelly Armstrong says the state possesses the resources to respond to the shortfall — but not the infrastructure. \"We're still trying to get more guidance to figure out if there's a way we can lessen the impact.\" [Prairie Public]      Ohio   Over 1.4 million people in Ohio participate in SNAP, according to the USDA. Mike Cochran with the Mid-Ohio Food Collective said his agency has already been dealing with increased demand, serving about 5,000 families a day, 58% more than at the peak of COVID pandemic. [Ohio State News Bureau]One group who work with low-income Ohioans will be handing out boxes of macaroni and cheese and ramen noodles for families to take home at upcoming \"Trunk or Treat\" events in celebration of Halloween. [Ohio State News Bureau]U.S. Rep. Shontel Brown said she is working with fellow Rep. Emilia Sykes to create a bill that would ensure SNAP benefits are continued during any future federal government shutdowns. [Ideastream Public Media]   For more on alternative free resources in the Dayton region and how you can help neighbors experiencing food insecurity, head to WYSO.      Oklahoma   About 685,000 people in Oklahoma use SNAP to help buy groceries across the state, according to the Department of Human Services. [KOSU]Oklahoma officials encourage participants to lock their unused cards to protect against electronic theft of benefits. [KOSU]Oklahoma is one of the most food-insecure states in the nation, according to the U.S. Department of Agriculture. Tasha Mousseau, vice president of the Wichita and Affiliated Tribes, told KOSU there is existing food insecurity in rural communities and tribal nations, which intersects with the Wichita and Affiliated Tribes. Mousseau said feeding people is not only about providing sustenance but also an important part of tribal culture.    For more on how Oklahoma tribal nations are preparing to fill the gap, head to KOSU.      Oregon    Over 750,000 people in Oregon participate in SNAP, according to the USDA.     Gov. Tina Kotek announced last week that those enrolled in the program will not receive benefits after the end of the month due to the government shutdown. [OPB]In southwest Oregon's Josephine County, 1 in 5 residents participates in the SNAP program. Food pantry workers there are gearing up for longer lines, longer hours and the sudden pressure from people losing their federal food assistance. [OPB]More than 3,500 retailers statewide participate in SNAP, generating $1.50 to $1.80 in economic activity for every dollar spent, according to the Oregon State Treasury. [OPB]      Pennsylvania   Roughly 2 million people in Pennsylvania participate in SNAP, according to the USDA, nearly 472,000 of those in Philadelphia alone. The looming SNAP freeze would occur against the backdrop of the commonwealth's own budget impasse, which has stalled billions of dollars meant for schools and social services. [WHYY]Gov. Josh Shapiro is among the three Democratic governors and more than two dozen Democratic attorneys general suing the USDA over suspension of SNAP benefits.Food banks and the charitable food network \"are not designed to replace federal nutrition benefits,\" Colleen Young of the Greater Pittsburgh Community Food Bank told WESA.\"The Commonwealth cannot backfill these costs,\" Pennsylvania human services officials said in a statement announcing there would be no benefits paid in November. [WESA]   For more on alternative free resources in the Philadelphia region and how you can help neighbors experiencing food insecurity, head to WHYY. For more on alternative resources in the Greater Pittsburgh area, head to WESA.      Puerto Rico   Puerto Rico offers residents the Nutrition Assistance Program (or PAN in its Spanish acronym) in place of SNAP.  It is unclear what the government shutdown's potential impact will be on recipients of this program, but lawmakers say the well is running dry.Officials in the Puerto Rican government have provided conflicting information on how much PAN is funded for November, according to the San Juan Daily Star.      Are you worried about your SNAP benefits? NPR wants to hear your story      Rhode Island   Over 140,000 people in Rhode Island participate in SNAP according to the USDA.Gov. Dan McKee announced he is putting together a \"rapid response\" to fill the need for SNAP recipientsThe Providence Journal reports that Helena Foulkes, who is running to oust McKee in next year's Democratic gubernatorial primary, is calling for a \"state of emergency\" and for the National Guard to be called in to for logistics and food distribution assistance and to coordinate the state's \"response across state agencies, food banks, community organizations, municipalities, and federal partners.\"      South Carolina   Over 550,000 people in South Carolina participate in SNAP, according to the USDA.On Tuesday, Gov. Henry McMaster, food bank leaders and the Central Carolina Community Foundation announced the statewide funding drive. The One SC Fund has been activated for this purpose and will not use any funds from passed fundraising efforts (like Hurricane Helene relief.) [South Carolina Public Radio]Erinn Rowe, CEO of Harvest Hope, South Carolina's largest food bank, says the fast-moving pieces are a challenge for both SNAP beneficiaries and food banks. \"It's like any disaster we respond to,\" she said. \"Our goal is to make sure people have food.\" [South Carolina Public Radio]      South Dakota   Over 75,000 people in North Dakota participate in SNAP, according to the USDA.South Dakota's Department of Social Services  confirmed the potential disruption and urges recipients to prepare for possible benefits gaps, promote careful use of existing SNAP benefits and to look for food banks or pantries.       Tennessee   Roughly 700,000 people in Tennessee participate in SNAP, according to the USDA.In a statement Friday, Gov. Bill Lee told Tennessee SNAP participants to expect a lapse in benefits. The statement from the governor's office said the state could not use its own funds to support the program because it does \"not have a mechanism to load benefits onto customer cards.\"Timmeshia Fleming is a mother of three in Nashville who has used SNAP benefits off and on for years. She said interruptions and delays mean money has to go to food instead of other bills. She told WPLN, it's especially harrowing when it comes without ample warning. [WPLN]      Texas   SNAP provides food purchasing support to approximately 3.5 million Texans, including more than 1.7 million children. Those benefits amount to around $617 million per month. [KUT]According to the state's benefits website, \"SNAP benefits will not be issued if the federal government shutdown continues past Oct. 27.\"Sari Vatske, CEO of the Central Texas Food Bank, said more Texans will face food insecurity in the coming weeks if SNAP benefits are delayed, leading to greater demand at food banks. [KUT]      Utah   Over 170,000 people in Utah participate in SNAP, according to the USDA.Matt Whitaker, director of the Cache Community Food Pantry, said the pantry supplies food to roughly 1,600 families every month, and each family can visit twice a month. Whitaker said that the community tends to ramp up donations during the months leading up to the holiday season. [Utah Public Radio]Meanwhile a Heber City food pantry is already seeing an increased demand from people whose SNAP accounts are empty. [KPCW]      Vermont   If SNAP benefits run out at the end of the month, 63,000 Vermonters would lose their benefits. SNAP dollars fund the Vermont program 3SquaresVT. [Vermont Public]The Vermont Legislature passed a budget in May that set aside about $100 million to offset potential federal funding losses, but Vermont's Secretary of Human Services Jenney Samuelson told state lawmakers that the state might not be able to leverage those reserves. A contingency plan is expected to be presented to key lawmakers this week. [Vermont Public]      Virginia   Over 800,000 people in Virginia participate in SNAP, according to the USDA.On Oct. 23, Gov. Glenn Youngkin declared a state of emergency to provide hunger relief as SNAP benefits risk running out. The order allows the state to use emergency funds to support food assistance until federal funding resumes. [WHRO]Youngkin said Tuesday that backfilling the SNAP benefits will cost the state $37.5 million a week from the state surplus. Deposits will be made weekly starting Nov. 3 [WAMU]The city of Richmond recently released numbers indicating more than 54,000 people currently receive SNAP benefits, meaning more than 1 out of every 5 residents use the program. [VPM]      Virgin Islands   Over 20,000 people in the U.S. Virgin Islands participate in SNAP, according to the USDA.According to a press release from the governor's office, \"the Department of Human Services, in coordination with the Department of Finance, will issue a check to each SNAP household covering half of its November monthly allotment. Checks will be mailed to the mailing address on file for each household.\"      Washington   Nearly 900,000 people in Washington participate in SNAP, according to the USDA.Washington Attorney General Nick Brown was among the group of state attorneys general who signed a letter to the USDA asking for clarification on why reserve funds set aside for this purpose were not being used.       West Virginia   Nearly 280,000 people in West Virginia participate in SNAP, according to the USDA.Gov. Patrick Morrisey's office says West Virginia does not have the budget to cover the costs of the program. [WVPB] Food pantries in the region are already struggling to meet the needs of the community, with demand at one pantry almost doubling in a week. And Kelly Allen with the West Virginia Center on Budget & Policy, told West Virginia Public Broadcasting that local charities do not have the resources to meet the need that losing SNAP will create. [WVPB]       Wisconsin   According to the USDA, roughly 700,000 people in Wisconsin participate in FoodShare, Wisconsin's name for SNAP. In a press release Oct. 22, Gov. Tony Evers said the state's system will run out of money at the end of October. Evers encouraged people to contact their congressional representatives and ask for an end to the shutdown.   For more on alternative resources in Wisconsin, head to WUWM.       Wyoming   Roughly 30,000 people in Wyoming participate in SNAP, according to the USDA.The Wyoming Department of Family Services says it is monitoring the situation and will share information as it learns more. Recipients of SNAP benefits in Wyoming will not get those benefits starting Nov. 1       Are you worried about your SNAP benefits? NPR wants to hear your story      NPR's Jaclyn Diaz, Padma Rama, Carol Ritchie, Emily Alfin Johnson, Kristian Monroe and Jennifer Ludden edited this piece.\n\n\n   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNAP runs out of money Nov. 1. States are now figuring out how to feed millions of people",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+77/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F69%2F1c9cb034456cb4e3aab6e90cc907%2F251021-food-for-fed-workers-wamu-08.JPG"
      ],
      "datePublished": "2025-10-28T18:46:17.000Z",
      "dateModified": "2025-10-28T18:46:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5588624/a-gop-led-house-committee-takes-aim-at-what-it-calls-bidens-autopen-presidency",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-28T20:20:31.000Z",
    "description": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Tra",
    "body": "\n      \n      A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5588624/nx-s1-9509951\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      NPR's Ailsa Chang speaks with University of St. Thomas law professor Mark Osler about the House Oversight Committee's call for an investigation into President Biden's executive actions signed by autopen.   \n\n    AILSA CHANG, HOST:  Hours before President Biden left office, he signed a number of preemptive pardons, and those pardons went to the House committee investigating January 6. These are preemptive pardons for people like Dr. Anthony Fauci, General Mark Milley. In a statement, Biden had said that he wanted to shield these people from, quote, \"unjustified and politically motivated prosecutions\" from the incoming Trump White House.Well, since entering office, President Trump has declared on social media that Biden's pardons are invalid, claiming without evidence that the Biden administration used a writing machine called an autopen to sign those pardons without Biden's knowledge. Trump's statement does not have the force of law, and Biden has repeatedly insisted that he was personally behind all the decisions made during his presidency. But today, the House Oversight Committee, chaired by Republican Congressman James Comer, asked the Justice Department to look into what they call the, quote, \"Biden autopen presidency.\" Attorney General Pam Bondi says her team is doing exactly that.To talk more about this, we're joined now by Mark Osler. He's a law professor at the University of St. Thomas, known for his work on clemency. Welcome.MARK OSLER: Thank you.CHANG: So this House Oversight Committee accuses the Biden White House of covering up Biden's cognitive decline. Let me just ask you, what does this report ultimately ask for?OSLER: Well, it's asking for a further investigation by the Department of Justice. I think they were frustrated because some of the witnesses pled the Fifth. And there's a political point being made as well.CHANG: OK. And just to remind everyone, this is a Republican-led committee. What do you make of the argument that they lay out in this report about Biden's cognitive decline and the permanence of these preemptive pardons?OSLER: Yeah. I'm not an expert on cognition, but I am an expert on clemency, and I can tell you that the Constitution doesn't make any requirement whatsoever as to how a pardon or a commutation is going to be put into writing or issued at all. And we've seen a variety of methods used over the years. You know, in 2005, the Office of Legal Counsel provided the president with advice that the president could use an autopen to sign bills - obviously one of the most important things the president is going to sign. And since then, presidents have used autopens for a wide variety of things...CHANG: Right.OSLER: ...Especially when there's a lot to be signed at once.CHANG: Well, what can the Department of Justice actually do in this situation? Like, can you think of anytime a pardon from a president has been reversed or declared null and void, as this House committee and President Trump would like to see happen here?OSLER: No, that hasn't happened. Once a president issues a pardon, it's been viewed as final. And so if something was to get overturned here, this would really be breaking new ground.CHANG: So are you telling me that a president's pardon power is absolute?OSLER: It's surprising, but that's what it says in the Constitution. It's almost absolute. It can't cover people who are under impeachment, and it's generally accepted that it can't pardon future crimes, those that haven't been committed yet. But yes. It's really rare in having so few checks and balances.CHANG: Well, then - OK - say you're a person who did receive a pardon from President Biden. What would you advise that person to do to protect themselves legally now from having that pardon reversed or somehow invalidated during the Trump administration?OSLER: Yeah. There's really not that much that they can do. Again, I think most people who have studied this would be shocked if a pardon was overturned. One of the things that I really fear that could happen with this investigation and some of the conclusions that they seem to want to reach is you have 37 people who received a commutation of their death sentence by President Biden. And I would really think it would cause a constitutional crisis if President Trump moved to execute those people despite that commutation of the death sentence. But going forward, I hope that pardons aren't undermined. They're under enough stress as they are.CHANG: Mark Osler, from the University of St. Thomas, thank you very much for being with us today.OSLER: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A GOP-led House committee takes aim at what it calls Biden's 'autopen presidency'",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-28T20:20:31.000Z",
      "dateModified": "2025-10-28T20:20:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Want to opt out of AI? State labeling laws might help",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5575748/some-states-want-labels-ai-opt-out",
    "image": "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg",
    "tag": "Politics",
    "date": "2025-10-28T20:07:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting d",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Red STOP AI protest flyer with meeting details taped to a light pole on a city street in San Francisco, California on May 20, 2025.\n                \n                    Smith Collection/Gado/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Smith Collection/Gado/Getty Images\n    \n\n   \n   Utah and California have passed laws requiring entities to disclose when they use AI. More states are considering similar legislation. Proponents say labels make it easier for people who don't like AI to opt out of using it.   \"They just want to be able to know,\" says Utah Department of Commerce executive director Margaret Woolley Busse, who is implementing new state laws requiring state-regulated businesses to disclose when they use AI with their customers.   \"If that person wants to know if it's human or not, they can ask. And the chatbot has to say.\"   California passed a similar law regarding chatbots back in 2019. This year it expanded disclosure rules, requiring police departments to specify when they use AI products to help write incident reports.   \n   \"I think AI in general and police AI in specific really thrives in the shadows, and is most successful when people don't know that it's being used,\" says Matthew Guariglia, a senior policy analyst for the Electronic Frontier Foundation, which supported the new law. \"I think labeling and transparency is really the first step.\"   As an example, Guariglia points to San Francisco, which now requires all city departments to report publicly how and when they use AI.   Such localized regulations are the kind of thing the Trump Administration has tried to head off. White House \"AI Czar\" David Sacks has referred to a \"state regulatory frenzy that is damaging the startup ecosystem.\"   Daniel Castro, with the industry-supported think tank Information Technology & Innovation Foundation, says AI transparency can be good for markets and democracy, but it may also slow innovation.   \"You can think of an electrician that wants to use AI to help communicate with his or her customers ... to answer queries about when they're available,\" Castro says. If companies have to disclose the use of AI, he says, \"maybe that turns off the customers and they don't really want to use it anymore.\"   For Kara Quinn, a homeschool teacher in Bremerton, Wash., slowing down the spread of AI seems appealing.   \n   \"Part of the issue, I think, is not just the thing itself; it's how quickly our lives have changed,\" she says. \"There may be things that I would buy into if there were a lot more time for development and implementation.\"   At the moment, she's changing email addresses because her longtime provider recently started summarizing the contents of her messages with AI.   \"Who decided that I don't get to read what another human being wrote? Who decides that this summary is actually what I'm going to think of their email?\" Quinn says. \"I value my ability to think. I don't want to outsource it.\"   Quinn's attitude to AI caught the attention of her sister-in-law, Ann-Elise Quinn, a supply chain analyst who lives in Washington, D.C. She's been holding \"salons\" for friends and acquaintances who want to discuss the implications of AI, and Kara Quinn's objections to the technology inspired the theme of a recent session.   \"How do we opt out if we want to?\" she asks. \"Or maybe [people] don't want to opt out, but they want to be consulted, at the very least.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Want to opt out of AI? State labeling laws might help",
      "image": [
        "https://media.npr.org/assets/img/2023/03/08/gettyimages-1281549030_wide-3405a9bbed4a952bc298ffcbdfb64664465fddd2.jpg?s=1400&c=100&f=jpeg"
      ],
      "datePublished": "2025-10-28T20:07:40.000Z",
      "dateModified": "2025-10-28T20:07:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "America's immigration crackdown is disrupting the global remittance market",
    "url": "https://www.npr.org/sections/planet-money/2025/10/28/g-s1-94960/americas-immigration-crackdown-is-disrupting-the-global-remittance-market",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg",
    "tag": "Politics",
    "date": "2025-10-28T10:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the Trump administration shut down USAID and slashed spending on international aid and development. Development advocates worried — and continue to worry — that this will hurt the economies of developing nations and have deadly consequences for some of the poorest people on Earth. That story generated tons of headlines earlier this year.   But Dean Yang, an economist at the University of Michigan, argues \"the anti-immigration actions of the Trump administration are likely to have an even bigger negative effect on the economic development of the world's poor countries\" — and that story has gotten much less attention.   \n   It's not just that migration is one of the best known mechanisms to lift people out of poverty. Studies suggest those who move from poor countries to work in rich nations like the United States often see a four-to-five fold increase in the amount they're able to earn, and sometimes way more.   What leads Yang to argue this is that immigrants in the United States send a jaw-dropping amount of money back home to their families. These remittances, as they're known, have dwarfed the size of official foreign aid that the U.S. spends on things like economic development, health, and humanitarian assistance.   In fact, the United States has far and away been the number one source of remittances in the world. According to the International Organization for Migration, which works with the United Nations, immigrants in the United States sent almost $80 billion to their origin countries in 2022 (the last available year of data).   In an upcoming episode of Planet Money, which will be released Oct. 29, we dive into the disruption of these large financial flows in an era of immigration restriction. While some countries, including Mexico, have already seen a large drop in remittances from the United States in recent months, others are seeing a rather surprising pattern: a record-breaking surge. Our episode focuses on the causes and consequences of this surge and dives into the economics of remittances.   \n   This recent surge of remittances, however, is likely only going to be a temporary blip. Remittances will likely drop in the near future, with the large decline of immigration to the U.S., and the large numbers of immigrants already here getting deported.   And that could have significant macroeconomic effects on a whole host of nations, especially in Central America. For countries like Honduras, Nicaragua, El Salvador, and Guatemala, remittances account for a staggering share of their economies, ranging from around 20% to 27% of each country's GDP. These nations are already politically and economically fragile, which is a big reason why so many of their citizens immigrated to the United States in the first place. It's one reason why Yang believes the immigration crackdown could have severe consequences in the developing world.   Stay tuned for our new episode of Planet Money that dives more into this story.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "America's immigration crackdown is disrupting the global remittance market",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg"
      ],
      "datePublished": "2025-10-28T10:30:00.000Z",
      "dateModified": "2025-10-28T10:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]