[
  {
    "title": "A breakdown of Indiana's vote against Trump's push to redraw congressional maps",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5642668/a-breakdown-of-indianas-vote-against-trumps-push-to-redraw-congressional-maps",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-12T22:10:10.000Z",
    "description": "\n      Indiana lawmakers rejected a push from President Trump to redraw congressional maps to favor Republicans. The vote is a significant rebuke for ",
    "body": "\n      Indiana lawmakers rejected a push from President Trump to redraw congressional maps to favor Republicans. The vote is a significant rebuke for Trump.   \n\n    SCOTT DETROW, HOST:  President Trump continues to pressure Republicans to redraw congressional maps and states across the country. But in Indiana, Republican lawmakers voted against a plan to do just that. Our friends at the NPR POLITICS PODCAST broke down what this all means. Here's senior political editor and correspondent Domenico Montanaro, senior White House correspondent Tamara Keith and political correspondent Sarah McCammon.(SOUNDBITE OF ARCHIVED NPR CONTENT)DOMENICO MONTANARO: I mean, it's probably the biggest pushback he's gotten within his party in the time that he's really been on the political stage, I would say, in many respects. There were many Indiana Republicans who were willing to go along with this plan to try to squeeze out two more seats from Indiana to try to help Republicans retain control of the house. That's what this was really all about. But voters in the state just didn't want it. They'd seen significant pushback. A lot of these lawmakers were receiving threats as well from the right and still rejected what was being proposed.TAMARA KEITH: People were doxed. People had pizza show up at their home. They had swatting. There were large protests organized by allies of President Trump at the state capitol. They were under intense pressure, and they didn't like it. State Senator Spencer Deere is among those who voted against it.(SOUNDBITE OF ARCHIVED RECORDING)SPENCER DEERY: And as long as I have breath, I will use my voice to resist a federal government that attempts to bully, direct and control this state or any state. Giving the federal government more power is not conservative.KEITH: And that's a federalism argument, right? It's saying, we're the state of Indiana. We should be able to decide what we want to do. And the president and the speaker of the House and the vice president and all of the people who are lobbying on this shouldn't tell us what to do.SARAH MCCAMMON: President Trump is in a vulnerable place. His poll numbers are down. He wants more Republicans in Congress for the rest of his term. And yet here was a group of Republicans who were willing to vote against it.MONTANARO: I do think that it's interesting nationally, considering this pushback that Trump has gotten, and maybe he wouldn't get that kind of pushback if he was more popular. The fact is, Trump is at the Nader of his popularity in the second term. He's in the 30s, according to a lot of polls. Recent AP-NORC poll, for example, had him at 36% approval rating, which was even lower than our poll was last month - the NPR/PBS News/Marist poll - and not by much, and he only had a 31% approval rating when it came to handling of the economy. So people are kind of, in some respects, looking past Trump, and I kind of wonder what this is going to mean more broadly when we see Trump off the national stage and sort of that, you know, big piece of the dam, the big brick in the dam is removed.KEITH: President Trump used the best leverage that he's had throughout his political career, which is to say, If you cross me, if you don't do the thing that I want you to do, then I'm going to primary you - I'm going to support someone else to run against you in the Republican primary, and I'm so all-powerful that you will lose your job. And 21 Senate Republicans in the state of Indiana said, all right, you can try. It has worked in the past. The question is whether that power, that ability to strike fear in members of his own party is waning because he is definitionally a lame duck.MCCAMMON: President Trump likes to win. This was a big loss for him. What is he saying about it?KEITH: Oh, he is saying the thing that he says when he loses, which is, oh, you know, I didn't really care that much.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Well, we won every other state. That's the only state - it's funny 'cause I won Indiana all three times by a landslide, and I wasn't working on it very hard. Would have been nice - I think we would have picked up two seats if we did that.KEITH: Oh, no, he was working on it very hard. The speaker of the House was working on it very hard. The vice president was working on it very hard. And President Trump has said, in no uncertain terms, that he believes the fate of his presidency, the fate of the country is on the line because if Republicans lose control of the House of Representatives, which seems entirely possible, then he's going to have a miserable last two years in office.MONTANARO: Republicans have a really, really narrow majority in the House, just a few seats more than Democrats. So every seat here is going to matter. So to say, I wasn't that focused on these two seats, that's just not the case.I mean, they want every single seat that they possibly can get to be able to have the advantage to build in some cushion because right now, Democrats have a significant advantage. The wind is completely at their backs. And they are also redistricting, doing this mid-decade redrawing, in places like California, potentially Virginia, which could offset a lot of these Republican-pushed changes.State like Louisiana and Florida, which are controlled by Republicans, are going to try to squeeze out some more seats on their own. But again, those could be offset by Virginia while California offsets Texas, and we're talking about all this work, millions of dollars spent, for nothing really.MCCAMMON: For a wash, potentially.MONTANARO: Right.KEITH: And let me just add the other factor here, which is, when you take a seat that is really super safe and you draw it to make two seats, neither of them are as super safe as before.DETROW: For more insights and analysis, you can listen to the NPR POLITICS PODCAST on the NPR app or wherever you get your podcasts.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A breakdown of Indiana's vote against Trump's push to redraw congressional maps",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-12T22:10:10.000Z",
      "dateModified": "2025-12-12T22:10:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dueling health care plans fail in the Senate as ACA premium deadline approaches",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5641002/dueling-health-care-plans-fail-in-the-senate-as-aca-premium-deadline-approaches",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-12T11:53:03.000Z",
    "description": "\n      \n      Dueling health care plans fail in the Senate as ACA premium deadline approaches\n    \n            \n                \n                Trans",
    "body": "\n      \n      Dueling health care plans fail in the Senate as ACA premium deadline approaches\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5641002/nx-s1-9568794\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Competing health care plans failed to meet the 60-vote threshold in the Senate Thursday. With federal ACA subsidies set to expire, health insurance costs are expected to surge in the new year.   \n\n    MICHEL MARTIN, HOST:  Millions of Americans who buy health insurance on the Affordable Care Act marketplace will soon have to pay a lot more unless Congress clinches a last-minute deal. Here's NPR's Saige Miller.SAIGE MILLER, BYLINE: As the calendar inches closer to January 1, Congress is at a stalemate on how to address health care costs. Senate Republicans and Democrats both put forth competing health care plans, but neither met the 60-vote threshold needed to advance.(SOUNDBITE OF ARCHIVED RECORDING)UNIDENTIFIED PERSON: On this vote, the yeas are 51, the nays are 48. Three-fifths of the senators duly chosen and sworn not having voted in the affirmative, the motion is not agreed to.MILLER: The outcome was expected. Democrats want a straight three-year extension of the Obamacare subsidies, but Republicans aren't on board. Senate Majority Leader John Thune says a simple extension would not deal with fraud or taxpayers sending money to insurance companies through the subsidies.(SOUNDBITE OF ARCHIVED RECORDING)JOHN THUNE: The way that we think this ought to work is you ought to come up with a way in which you can deliver the benefit to the patients and not to the insurance companies.MILLER: The GOP alternative would put some money into health savings accounts for Americans on certain Obamacare plans. But it doesn't extend the subsidies, and the money can't be used to pay for health care premiums. Chuck Schumer, the top Democrat in the Senate, says the bill was a nonstarter because it doesn't address rising health care costs on the ACA exchanges.(SOUNDBITE OF ARCHIVED RECORDING)CHUCK SCHUMER: When families open their health insurance bills in January and see the sky-high premiums staring back at them, the American people will know that Democrats fought to stop these hikes, but Republicans fought to guarantee that they happen.MILLER: The White House responded to the failed votes on Thursday. Press secretary Karoline Leavitt told reporters Republicans aren't done with the issue.(SOUNDBITE OF ARCHIVED RECORDING)KAROLINE LEAVITT: The president and Republicans will continue to unveil creative ideas and solutions to the health care crisis that was created by Democrats.MILLER: The battle on the Hill isn't over either. House Majority Leader Steve Scalise says the chamber is set to vote on other health care plans that address the entire system and not just the exchanges.(SOUNDBITE OF ARCHIVED RECORDING)STEVE SCALISE: Starting next week, voting in the House on bills that will focus on lowering premiums for 100% of Americans.MILLER: Republicans have not said what will be in those bills. But one thing is clear - if Congress doesn't come to a consensus on health care by year's end, premiums are set to skyrocket.Saige Miller, NPR News.(SOUNDBITE OF ROB FORD EXPLORER'S \"PHOENICIA\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dueling health care plans fail in the Senate as ACA premium deadline approaches",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-12T11:53:03.000Z",
      "dateModified": "2025-12-12T11:53:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the Indiana redistricting defeat could shape the 2026 midterms",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5642514/how-the-indiana-redistricting-defeat-could-shape-the-2026-midterms",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-12T14:11:32.000Z",
    "description": "\n      \n      How the Indiana redistricting defeat could shape the 2026 midterms\n    \n        \n                Download\n                \n             ",
    "body": "\n      \n      How the Indiana redistricting defeat could shape the 2026 midterms\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5642514/nx-s1-9568875\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR'S Steve Inskeep speaks with Cook Political Report elections analyst David Wasserman about Indiana Republicans' rejection of a redistricting bid backed by the White House.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the Indiana redistricting defeat could shape the 2026 midterms",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-12T14:11:32.000Z",
      "dateModified": "2025-12-12T14:11:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana lawmakers reject Trump-backed redistricting plan",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5640867/indiana-lawmakers-reject-trump-backed-redistricting-plan",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-12T09:49:51.000Z",
    "description": "\n      \n      Indiana lawmakers reject Trump-backed redistricting plan\n    \n            \n                \n                Transcript\n            \n    ",
    "body": "\n      \n      Indiana lawmakers reject Trump-backed redistricting plan\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5640867/nx-s1-9569040\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      The Indiana Senate voted against the congressional redistricting plan called for by President Trump in his attempt to help Republicans win the 2026 midterm elections.   \n\n    MICHEL MARTIN, HOST:  President Trump's nationwide effort to reshape the midterm elections in favor of Republicans has succeeded in Texas, Missouri, North Carolina but not in Indiana.STEVE INSKEEP, HOST:  Yeah, Republicans in those other states obeyed the president's order to skew the elections in Republicans' favor. Republican state senators in my home state decided otherwise. The president and his allies threatened consequences for Indiana if they did not submit. After enough lawmakers ignored him, Trump minimized his defeat.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: Well, we won every other state. That's the only state. It's funny 'cause I won the - I won Indiana all three times by a landslide, and I wasn't working on it very hard. Would have been nice. I think we would have picked up two seats if we did that.MARTIN: For more on this, we're joined by Ben Thorp of WFYI in Indianapolis. Good morning, Ben.BEN THORP, BYLINE: Good morning.MARTIN: Thanks for getting up early because you were there in the State Capitol pretty late. So tell us about the vote.THORP: Yeah. It was very suspenseful. There were protesters against redistricting in the Capitol, and you could kind of hear them as senators debated for over three hours. The outcome, I think, was really unknown, and in the end, the redistricting bill failed by a vote of only 19 in favor and 31 opposed. It's important to mention that the Indiana Senate is heavily Republican. So of those 31 opposed, 21 were Republicans. Here's one of them. This is state Senator Spencer Deery, who said that redistricting just to get political gain went against his conservative values.(SOUNDBITE OF ARCHIVED RECORDING)SPENCER DEERY: I see no justification that outweighs the harms it would inflict upon the people's faith in the integrity of our elections and our system of government.THORP: He said he'd fight with, quote, his last \"breath\" to prevent the federal government from bullying a state. Others just said their constituents did not want this.MARTIN: So that state senator called it bullying. The Trump administration probably called it trying to be persuasive. So what did they do to try to steer this the president's way?THORP: Yeah. So it started months ago. Indiana lawmakers were brought to the White House. Vice President Vance went to Indiana. In fact, during the debate, Vance tweeted that Senate President Pro Tem Rodric Bray was being dishonest in trying to defeat this bill, and Bray did ultimately vote against it. Trump and Republican Governor Mike Braun here threatened to back primary challenges against senators who didn't get on board. And the president's son, Donald Trump Jr., tweeted yesterday that he would come campaign here against them. You heard some of what Trump said there at the top. He also said he'd support someone to run against Bray. For his part, the governor, Braun, warned that, quote, \"decisions like this\" are going to \"carry political consequences.\"MARTIN: And what would this redistricting have done?THORP: Yeah, the state has seven Republican members of the House and two Democrats now. This would have redrawn the lines to help flip those last two seats. Supporters said it was legal, even though redistricting is normally done after the census at the start of the decade. They said Democratic-led states have gerrymandered like that in the past, but opponents said it would have divided up minority voters here in Indianapolis and put them in districts where their votes would be outnumbered by suburban and rural voters, basically diluting their vote.MARTIN: So where does President Trump's redistricting effort stand now?THORP: So far, Republicans have been able to tilt a couple more seats their way than Democrats. Texas redistricted to help the GOP win maybe five seats there. Missouri and North Carolina each did one seat. California Democrats have countered by tilting five seats their way. But the question now is whether Republicans in other states where this is being considered, like Florida and Kansas, will go ahead with redistricting.MARTIN: That is Ben Thorp in Indianapolis. Ben, thank you.THORP: Thank you so much.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana lawmakers reject Trump-backed redistricting plan",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-12T09:49:51.000Z",
      "dateModified": "2025-12-12T09:49:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. military members fear personal legal blowback tied to boat strikes",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5629164/boat-strikes-service-members-legal-risk",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/10638x5984+0+554/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2Fbb%2F95b453894054a1a0f59bed4c4985%2Fap25273503469596.jpg",
    "tag": "Politics",
    "date": "2025-12-12T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth, center, ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth, center, sitting with other senior military leaders, listen as President Trump speaks at Marine Corps Base Quantico in September 2025.\n                \n                    Evan Vucci/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Evan Vucci/AP\n    \n\n   \n   U.S. service members — including staff officers and at least one drone pilot — are seeking advice from outside groups, fearing they could face legal consequences for any involvement in the Trump administration's lethal strikes on suspected drug boats.   Over the past three months, the U.S. has blown up more than 20 vessels in the Caribbean and Eastern Pacific that the administration says were running illicit narcotics. More than 80 people have been killed in the strikes.   The administration says it is taking action to stop the flow of drugs into the U.S. It says the strikes are legal and are being conducted under the laws of war, and that President Trump ordered them under his Article II powers as commander-in-chief and in self-defense.   \n   Many legal experts, however, including former military lawyers, contend the strikes against the alleged civilian narcotraffickers are unlawful and amount to murder.   The vast gulf between those two legal views has left some members of the U.S. military in the lurch, worried about potential legal blowback for themselves for taking part in the campaign.   \"It's hard to be a soldier and make determinations in any situation, but it's especially hard in a situation like this — where most people don't see an imminent threat — to be sent to do something that you're really worried about, could I go to prison for this?\" said Steve Woolford, a resource counselor with Quaker House in North Carolina and the GI Rights Hotline.    \n   His organization — one of several that make up the GI Rights Hotline, which provides confidential counseling and information for members of the American military — has received calls from service members since the administration began blasting suspected narcotrafficking boats in September.   Quaker House has been contacted so far by two service members who Woolford said were \"very concerned\" about their own involvement in the campaign.   \"Their calls were both about the legality of what they were participating in and what that might mean for them in terms of being subject to punishment for doing something that they weren't supposed to do and were supposed to know better than to do,\" he said. \"Both of them also had moral concerns because they are people who are willing to be part of defense but they don't want to be part of doing something illegal, or I don't think they feel right killing people outside of the laws of war.\"   \n   Woolford, who is not an attorney, said in both instances the service members were put in touch with lawyers who could provide more guidance on the legal issues.   \"A lot more calls\"   Military personnel have also reached out to attorneys at the Orders Project, which is a nonpartisan group that serves as a reference for service members who have questions about lawful and unlawful orders.   \"We're receiving a lot more calls in the last three months than we did before,\" said Frank Rosenblatt, a former military lawyer with the Orders Project.   He declined to provide numbers, but he said some of the individuals are staff officers with legal, intelligence or targeting expertise.   \n   \"What we're finding out is that they're being told that there are these political appointees who really want to be able to talk about this and ... say everybody in the military who looked at this said it was 'green light, A-OK, good to go,'\" said Rosenblatt, who is a former lieutenant colonel in the U.S. Army Judge Advocate General Corps.   Pressure from above   When some of those career officers don't sign off, instead indicating 'non-concur,' they are coming under pressure from higher-ups, he said.   \"So much pressure, in some cases, that they're giving us a call to say, 'What are my options? I want to do the right thing but I also don't want to torpedo my career unnecessarily.'\"   The Orders Project's attorneys who speak with service members are not giving \"grand decrees\" about whether an order is lawful or unlawful, Rosenblatt said. Instead, the guidance they provide is focused on what's in the caller's best interest.   \n   \"Generically, the advice that we might give might vary from how you can document the pressure you are receiving, to what kind of questions you can ask or clarification you can seek,\" he added.   Rosenblatt said his group has received calls from at least one drone pilot, but both he and Woolford at Quaker House said generally the service members who are reaching out are not the people pulling the trigger. Instead, they say, the callers are more on the operational planning side.   \n   While the number of callers may not be large at this point, the fact that service members are reaching out at all reflects the confusion and worry some of them feel about what they are being ordered to do.   \n   Woolford said that many people have voiced a concern that any future consequences for service members should be based on the law but they worry it may end up being driven by politics instead.    \"And then it just becomes this complicated guessing game of who's going to be in charge and what are they going to say is right as opposed to maybe the more solid foundation of 'we have accepted rules we can just go by,'\" he said. \"So that's just a really hard thing for people in the military to try to be guessing.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. military members fear personal legal blowback tied to boat strikes",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/10638x5984+0+554/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2Fbb%2F95b453894054a1a0f59bed4c4985%2Fap25273503469596.jpg"
      ],
      "datePublished": "2025-12-12T10:00:00.000Z",
      "dateModified": "2025-12-12T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thai and Cambodian leaders renew a ceasefire after deadly clashes, Trump says",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5642491/thailand-parliament-dissolved-new-elections-2026",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+84/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff5%2F4e%2F3b339b80469097b0c7d6ca5165ff%2Fap25345147610508.jpg",
    "tag": "Politics",
    "date": "2025-12-12T10:40:23.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Thai police officer splashes water to ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A Thai police officer splashes water to control fire Thursday at a house in Surin Province, which Thai local security forces say was damaged by a Cambodian artillery strike.\n                \n                    Wason Wanichakorn/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Wason Wanichakorn/AP\n    \n\n   \n   WASHINGTON — President Donald Trump said Friday that Thai and Cambodian leaders have agreed to renew a truce after days of deadly clashes had threatened to undo a ceasefire the U.S. administration had helped broker earlier this year.   Trump announced the agreement to restart the ceasefire in a social media posting following calls with Thai Prime Minister Anutin Charnvirakul and Cambodian Prime Minister Hun Manet.   \"They have agreed to CEASE all shooting effective this evening, and go back to the original Peace Accord made with me, and them, with the help of the Great Prime Minister of Malaysia, Anwar Ibrahim,\" Trump said in his Truth Social posting.   \n   Trump, a Republican, said that Malaysian Prime Minister Anwar Ibrahim played an important role in helping him push Thailand and Cambodia to once again agree to cease fighting.   \"It is my Honor to work with Anutin and Hun in resolving what could have evolved into a major War between two otherwise wonderful and prosperous Countries!\" Trump added.   The original ceasefire in July was brokered by Malaysia and pushed through by pressure from Trump, who threatened to withhold trade privileges unless Thailand and Cambodia agreed. It was formalized in more detail in October at a regional meeting in Malaysia that Trump attended.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People prepare breakfast as they take refuge at Wat Chroy Neangoun's Buddhist pagoda in Siem Reap province, Cambodia Friday, Dec. 12, 2025, after fleeing from home following fighting between Thailand and Cambodia over territorial claims.\n                \n                    Heng Sinith/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Heng Sinith/AP\n    \n\n   \n   Despite the deal, the two countries carried on a bitter propaganda war and minor cross-border violence continued.   The roots of the Thai-Cambodian border conflict lie in a history of enmity over competing territorial claims. These claims largely stem from a 1907 map created while Cambodia was under French colonial rule, which Thailand maintains is inaccurate. Tensions were exacerbated by a 1962 International Court of Justice ruling that awarded sovereignty to Cambodia, which still riles many Thais.   Thailand has deployed jet fighters to carry out airstrikes on what it says are military targets. Cambodia has deployed BM-21 rocket launchers with a range of 30-40 kilometers (19-25 miles).   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Thailand's Prime Minister Anutin Charnvirakul gestures as he attends an event at the government house in Bangkok, Thailand, Friday, Dec. 12, 2025.\n                \n                    Arnun Chonmahatrakool/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Arnun Chonmahatrakool/AP\n    \n\n   \n   According to data collected by public broadcaster ThaiPBS, at least six of the Thai soldiers who were killed were hit by rocket shrapnel.   \n   The Thai army's northeastern regional command said Thursday that some residential areas and homes near the border were damaged by BM-21 rocket launchers from Cambodian forces.   The Thai army also said it destroyed a tall crane atop a hill held by Cambodia where the centuries-old Preah Vihear temple is located, because it allegedly held electronic and optical devices used for military command and control purposes.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thai and Cambodian leaders renew a ceasefire after deadly clashes, Trump says",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+84/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff5%2F4e%2F3b339b80469097b0c7d6ca5165ff%2Fap25345147610508.jpg"
      ],
      "datePublished": "2025-12-12T10:40:23.000Z",
      "dateModified": "2025-12-12T10:40:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump struggles to find his economic messaging amid voter skepticism",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5639903/trump-economic-messaging",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Faa%2F941413664676bfe38b44c3276134%2Fgettyimages-2251064103.jpg",
    "tag": "Politics",
    "date": "2025-12-12T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump delivers remarks during ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump delivers remarks during an event at Mount Airy Casino Resort on Tuesday in Mount Pocono, Pa. Trump discussed his administration's economic agenda and its efforts to lower the cost of living.\n                \n                    Alex Wong/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Wong/Getty Images\n    \n\n   \n   President Trump spent the week making a bold case about a booming U.S. economy with even better times ahead, as his economic policies kick in. The problem for Trump is that polls show a wide swath of Americans aren't feeling that optimism yet — and in his initial attempts at addressing the cost of living, he called the affordability issue a Democratic \"hoax.\"   Hoping to tackle the messaging disconnect, the White House rolled out a $12 billion farmer aid package and sent Trump to Pennsylvania this week to make his case.   Trump has frequently shown himself a strong economic messenger — winning reelection in 2024 by lambasting Joe Biden's economy. But one year into his presidency, Trump is struggling to convince Americans that the economic pain they see in their cost-of-living expenses isn't real.   \n   In part, the president's whiplash messaging could stem from his struggle to portray his own economy as less than perfect.   \"You know, they always have a hoax. The new word is affordability. So they look at the camera and they say, 'this election is all about affordability,' \" he said Tuesday in Pennsylvania, referring to Democrats in the wake of the most recent November elections who won handily by focusing on kitchen table issues.   Out of touch   The dismissive tone goes beyond the president; last weekend, on CBS's Face the Nation, Margaret Brennan asked Treasury Secretary Scott Bessent to respond to polls showing a majority of Americans think Trump makes prices and inflation seem better than they really are.   \"I think the president is frustrated by the media coverage of what's going on. This is polling of average Americans …average Americans are hearing about it from media coverage,\" he said.   By some metrics the economy isn't doing badly — the White House has been pointing to falling gas prices and the fact that wages have been outstripping inflation.   But that's likely falling on deaf ears, says Michael Strain, an economist at the right-leaning American Enterprise Institute. He added that President Biden tried the same thing.   \n   \"I think it is strange to see President Trump and before him President Biden try to engage in an argument with the American people about the American people's view of their economic circumstances,\" he said.   Even while some economic indicators look good, several others are inflicting pain on voters. For example, inflation is elevated — boosted by tariffs.   Amid all of this came more emphatic denials from Trump that anything is wrong. Asked by Politico's Dasha Burns in an interview this week what grade he would give his economy, he replied: \"A +++++ .\"   And that denial extends to how the administration talks about its policies. Whether it's talking about farm aid or grocery costs, the administration has been deeply reluctant to acknowledge that its trade policy has made life harder for many Americans.   Adding to the at-times tone-deaf messaging has been Trump's focus on multimillion-dollar White House renovations and a ballroom, a Cabinet featuring multiple billionaires and the president's regular weekend trips to his ritzy Mar-a-Lago club.   Who to blame   And when administration officials do acknowledge economic pain, they often pin the blame on Biden.   \"What we're not gonna do is say Americans don't know what they're feeling,\" Bessent said. \"We've got this embedded inflation from the Biden years.\"   That Biden-economy hangover is real, said Federal Reserve Chairman Jerome Powell this week.   \"We hear loud and clear how people are experiencing costs, really high costs. And a lot of that is not the current rate of inflation. A lot of that is just embedded higher cost due to higher inflation in 2022 and '23,\" he said.   Importantly, Powell wasn't blaming Biden for the inflation, which had complex causes. But no matter what, 11 months into the Trump administration, Americans may not want a scapegoat so much as a fix. And some obvious ways to address the affordability issue may be politically and ideologically off the table for Trump.   \n   Justin Wolfers, an economist at the University of Michigan, says the president could help by finding a way to mitigate the Obamacare premiums set to spike in the new year or by removing tariffs he implemented earlier this year.   \"Is there a way that a president could fix the affordability problem? And the answer in this case is definitely yes,\" he said.   But so far, the White House says it's sticking to their policies and banking on Americans' coming around.   \"As the President said, much work remains to fully put Biden's inflation crisis behind us, but the Administration's tax cuts, deregulation, energy abundance, historic drug pricing deals, and trade deals continue to pay off – as these policies did during President Trump's first term – with real wages increasing and growth rebounding,\" White House spokesman Kush Desai told NPR.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump struggles to find his economic messaging amid voter skepticism",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Faa%2F941413664676bfe38b44c3276134%2Fgettyimages-2251064103.jpg"
      ],
      "datePublished": "2025-12-12T10:00:00.000Z",
      "dateModified": "2025-12-12T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kilmar Abrego Garcia released from ICE custody. And, Indiana rejects redistricting",
    "url": "https://www.npr.org/2025/12/12/g-s1-101843/up-first-newsletter-ukraine-russia-peace-promises-kilmar-abrego-garcia-indiana-redistricting",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7183x4040+0+73/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Fba%2F7012ca564bc5982b7058ebc48461%2Fgettyimages-2231286193.jpg",
    "tag": "Politics",
    "date": "2025-12-12T11:54:28.000Z",
    "description": "\n      \n      Zelenskyy and Peace Promises, Abrego Garcia Release, Indiana Rejects Redistricting\n    \n            \n                \n                Tr",
    "body": "\n      \n      Zelenskyy and Peace Promises, Abrego Garcia Release, Indiana Rejects Redistricting\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/g-s1-101843/nx-s1-mx-5642493-1\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.   Today's top stories   A federal judge freed Kilmar Abrego Garcia from immigration detention yesterday. Abrego Garcia was deported to El Salvador in March due to what Immigration and Customs Enforcement called an \"administrative error.\" He was eventually brought back and detained in the U.S. A federal judge ruled that the government failed to produce a lawful order for his removal from the U.S. This decision came just as lawmakers were questioning Homeland Security Secretary Kristi Noem about President Trump's compliance with court orders.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Kilmar Abrego Garcia (R) and his wife Jennifer Vasquez look on as his supporters address the press as he arrives at a US Immigration and Customs Enforcement (ICE) field office in Baltimore, Maryland, on Aug. 25, 2025.\n                \n                    Roberto Schmidt/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Roberto Schmidt/AFP via Getty Images\n    \n\n   \n   🎧 The White House says it will appeal this decision, according to NPR's Ximena Bustillo. Abrego Garcia's lawyers say the ruling is an extraordinary victory, not only for their client, but also for due process. Democrats invited family members of people who were deported or put in detention to the hearing as examples of the impact of immigration enforcement. Noem said she believes immigrants who entered the U.S. under former President Biden pose the biggest threat to national security. Noem's department is reopening the cases of refugees admitted under the Biden administration and is calling for a review of asylum applications.   \n   Ukrainian President Volodymyr Zelenskyy says the Ukrainian people would need to speak through a referendum for his country to surrender territory, which the U.S. wants Ukraine to do as part of a peace deal with Russia. Zelenskyy and other Europeans are working to offer answers and alternatives to pressure from Trump's bid to end the war.    🎧 Zelenskyy is engaging with the Trump administration's most painful proposals to show that Ukraine is negotiating in good faith, NPR's Joanna Kakissis tells Up First. Giving up territory has been a red line for Ukrainians. Zelenskyy says he is examining the possibility of elections over the next 90 days or a referendum on giving up parts of eastern Ukraine to help end the war. Ukraine has not held elections because the country is under martial law due to the Russian invasion, and the constitution forbids elections during wartime, Kakissis says. Public opinion polls show that most Ukrainians think holding elections now is a terrible idea.   The Indiana Senate voted 31 to 19 yesterday against the congressional redistricting that the president called for to help Republicans win next year's midterm elections. The defeat comes in a state where 40 of the 50 members of the Senate are Republicans. It marks the first time members of Trump's own party voted against his redistricting campaign. The nationwide effort to reshape the midterm elections in the GOP's favor has succeeded in Texas, Missouri, and North Carolina.    \n   🎧 Indiana State Sen. Spencer Deery said redistricting for political gain opposed his conservative values, and he would fight to prevent the federal government from bullying a state. Other state lawmakers said their constituents didn't want the new map. Ben Thorp of the NPR network station WFYI says Republicans still appear to have \"tilted a couple more seats their way than Democrats.\" Texas helped the GOP possibly win five more seats; Missouri and North Carolina's efforts created one more seat each. California Democrats have countered by tilting five seats their way. The question now is whether Republicans in other states will follow suit on Trump's wishes for redistricting, Thorp says.   Life advice   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vern Yip is an interior designer and the author of the book, Color Pattern Texture: The Foundation to Make Your Home Your Own.\n                \n                    Kameron Jennings\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kameron Jennings\n    \n\n   \n   As the new year approaches, you may be considering ways to refresh your home. Interior designer Vern Yip advises getting offline and finding design inspiration in the real world. In his latest book, Color Pattern Texture: The Foundation to Make Your Home Your Own, he encourages readers to take a more hands-on approach to build a room that not only looks good but also feels good.    🏡 Online decorating trends like peel-and-stick options may look good in photos, but won't match the feel of real materials. Consider using a great rug or similar option until you can afford a proper redo of the desired area.🏡 Need temporary pieces while you save? Try yard sales and thrift stores for secondhand items that may be less expensive and of higher quality.🏡 When looking for new colors for your walls, make sure to consider your skin tone. Sometimes the light that bounces off certain colors can result in a washed-out appearance.   For tips on how to decorate your home without the help of social media, listen to this episode of NPR's Life Kit. Subscribe to the Life Kit newsletter for expert advice on love, money, relationships and more.   Weekend picks   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Gillian Anderson as Constance Van Ness in The Abandons.\n                \n                    Netflix\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Netflix\n    \n\n   \n   Check out what NPR is watching, reading and listening to this weekend:   🍿 Movies: In Jay Kelly, George Clooney plays an aging movie star who travels through Europe while his manager and publicist struggle to manage him. Plus, if you want to head to theaters, check out this roundup of offerings that arrive this week.   \n   📺 TV: The Abandons follows two steely matriarchs who face off on the American frontier in the Western series that's truly a sudsy nighttime soap, according to the hosts of Pop Culture Happy Hour.   📚 Books: With 2025 coming to a close, NPR's Colin Dwyer has gathered some final noteworthy titles publishing this year, including The Sea Captain's Wife and The Rest of Our Lives.   🎵 Music: It's been another great year for mind-bending creativity in Spanish-language music. Here are six artists who caught Alt.Latino's attention. Check out more of NPR Music's coverage of 2025's best music.   🍽️ Food: Whether you want to expand your palate or are looking for a great gift for a foodie in your life, here's a selection of 10 cookbooks from 2025.   ❓ Quiz: With a score like 10/11, it feels like Christmas came early. Now it is your turn to test your knowledge from this week.   3 things to know before you go   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Zootopia is one of the properties included in Disney's billion-dollar licensing deal with OpenAI.\n                \n                    Disney\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Disney\n    \n\n   \n   The Walt Disney Company has reached a three-year licensing agreement with OpenAI, to bring Disney characters and images to Sora, enabling video creation and sharing.Archaeologists in Britain claim to have discovered the earliest evidence of humans making fires anywhere in the world. The finding suggests that early humans created fire more than 350,000 years earlier than previously known.The day after Gillian Kline's breast cancer diagnosis, she had one day left to decide on a new health insurance plan. She reached out to her company's human resources team and informed Alex Mackey of the situation. Mackey not only took care of everything but also supported her beyond insurance logistics. Kline says her unsung hero helped her understand the meaning of true kindness.   This newsletter was edited by Suzanne Nuyen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kilmar Abrego Garcia released from ICE custody. And, Indiana rejects redistricting",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7183x4040+0+73/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Fba%2F7012ca564bc5982b7058ebc48461%2Fgettyimages-2231286193.jpg"
      ],
      "datePublished": "2025-12-12T11:54:28.000Z",
      "dateModified": "2025-12-12T11:54:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Justice Department has now sued 18 states in an effort to access voter data",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5642610/doj-voter-data-lawsuits-colorado-hawaii-massachusetts-nevada",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5568x3132+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3f%2F9d%2F2b27ab8d40128a0b673bc48f3b05%2Fgettyimages-2182499009.jpg",
    "tag": "Politics",
    "date": "2025-12-12T18:43:56.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A voter carries his son as he walks into",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A voter carries his son as he walks into the Oak Creek Town Hall to drop off his ballot on Election Day, Nov. 5, 2024, in Oak Creek, Colo.\n                \n                    Jason Connolly/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jason Connolly/AFP via Getty Images\n    \n\n   \n   The Department of Justice has filed lawsuits against four more states as part of the Trump administration's attempt to access sensitive voter data. The DOJ is also suing one Georgia county, seeking records from the 2020 election.   The department has now filed suit against 18 states — mostly Democratic-led, and all states that President Trump lost in the 2020 election — as part of its far-reaching litigation.   For months, the Justice Department has been demanding certain states turn over complete, unredacted copies of their voter registration lists, including any driver's license numbers and parts of voters' Social Security numbers.   In court filings, the DOJ says it wants this personal information to check if states are following federal law on keeping accurate voter rolls.   \n   But most states have refused, citing privacy restrictions.   The latest states to be sued are Colorado, Hawaii, Massachusetts and Nevada, the Justice Department announced Friday.   \"At this Department of Justice, we will not permit states to jeopardize the integrity and effectiveness of elections by refusing to abide by our federal elections laws,\" Assistant Attorney General for Civil Rights Harmeet Dhillon said in a statement. \"If states will not fulfill their duty to protect the integrity of the ballot, we will.\"   \n   In recent days, Dhillon has additionally touted the number of voter records run through a citizenship lookup tool housed within the Department of Homeland Security.   The Justice Department has also filed a lawsuit against Georgia's Fulton County. The administration is trying to force local election officials to turn over all ballots and other records from the 2020 election that Trump lost.     Fulton County has been at the center of baseless claims by Trump and allies that the 2020 election was rigged against him.    The DOJ legal action against Fulton County follows the dismissal last month of the high-profile election interference case against Trump and his allies that was originally brought by county prosecutors.   \n   Officials in Colorado are among those pushing back on the administration's pursuit of voter data.   \"We will not hand over Coloradans' sensitive voting information to Donald Trump. He does not have a legal right to the information,\" Secretary of State Jena Griswold, a Democrat who's running for attorney general, said in a statement. \"I will continue to protect our elections and democracy, and look forward to winning this case.\"   The Justice Department's lawsuit against Colorado comes as Trump on Thursday announced on social media he was pardoning Tina Peters, a former Colorado county clerk who's serving a nine-year sentence after a conviction for granting unauthorized access to voting equipment, as part of an effort to investigate the 2020 election.   \n   Trump's pardon seems to be primarily symbolic, as Peters was convicted on state, not federal, charges. The power to issue a pardon for state crimes rests with Colorado's governor.   The Department of Justice in recent days also announced a review of Colorado's prisons.   With reporting by NPR's Hansi Lo Wang and Benjamin Swasey.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Justice Department has now sued 18 states in an effort to access voter data",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5568x3132+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3f%2F9d%2F2b27ab8d40128a0b673bc48f3b05%2Fgettyimages-2182499009.jpg"
      ],
      "datePublished": "2025-12-12T18:43:56.000Z",
      "dateModified": "2025-12-12T18:43:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he's 'pardoned' a Colorado clerk convicted of election tampering. Can he?",
    "url": "https://www.npr.org/2025/12/12/nx-s1-5641984/trump-says-hes-pardoned-a-colorado-clerk-convicted-of-election-tampering-can-he",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-12T09:49:45.000Z",
    "description": "Trump says he's 'pardoned' a Colorado clerk convicted of election tampering. Can he?   President Trump says he's pardoning a former Colorado county cl",
    "body": "Trump says he's 'pardoned' a Colorado clerk convicted of election tampering. Can he?   President Trump says he's pardoning a former Colorado county clerk who was convicted of tampering with voting equipment to prove false voter fraud claims. But his powers don't extend to state crimes.\n\n    \n        Politics\n    \n\n\n      \n            \n                  \n            December 12, 20254:49 AM ET\n         \n      \n       From\n   \n   \n                                                            ,                \n            \n\n\n      \n      Trump says he's 'pardoned' a Colorado clerk convicted of election tampering. Can he?\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5641984/nx-s1-9568879\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      President Trump says he's pardoning a former Colorado county clerk who was convicted of tampering with voting equipment to prove false voter fraud claims. But his powers don't extend to state crimes.   \n\n\n    STEVE INSKEEP, HOST:  President Trump says he is pardoning one of the most ardent election deniers still serving time. That's what he says. Tina Peters, a former Colorado elections clerk, has been serving a nine-year sentence relating to tampering with election equipment. Bente Birkeland of Colorado Public Radio is covering this story. Good morning.BENTE BIRKELAND, BYLINE: Good morning.INSKEEP: He says he's pardoning Tina Peters. Can the president pardon Tina Peters?BIRKELAND: No, he cannot pardon Peters. Peters was convicted in 2024 in state court, so the only person who could pardon Tina Peters is Colorado's Democratic Governor Jared Polis. In a statement, Polis reiterated that President Trump has no jurisdiction over state law and state crimes and said it was a matter for the courts to decide. Colorado's secretary of state, Democrat Jena Griswold, called Trump's social media post a lawless intrusion on states' rights.JENA GRISWOLD: Tina Peters compromised her own voting equipment trying to prove Trump's lie. She was convicted by a jury of her peers of several felonies in a conservative Colorado county. And she is now serving her time. She is not a political prisoner. She's a criminal.INSKEEP: This is really interesting, Bente, because we had this entire controversy during the 2020 election that Trump lost where there were all kinds of stories, never validated, about alleged fiddling with voting equipment. And it turned out somebody fiddled with the equipment for Trump. What were the details of her case?BIRKELAND: So Peters is 70 years old. And she was a Republican county clerk in Mesa County. And this is in western Colorado. And what occurred happened months after the 2020 presidential election. And this was after all the false claims were circulating that the election was stolen. Peters allowed an unauthorized person to access the county's Dominion voting machines. She says she was in search of voter fraud. She was convicted of multiple felonies and misdemeanors last year. And Trump and his allies have hailed her as a patriot.INSKEEP: What was her defense?BIRKELAND: Peters argued that she was just preserving election records and that everything she did was well within her authority as the county clerk. Peters' attorneys say the state court failed to consider a number of federal laws and violated the First Amendment. Her attorney is Peter Ticktin. And he's an ally of President Trump's. They actually went to high school together. I talked to him about the case recently. And he says the government has been weaponized against Trump supporters like Peters.PETER TICKTIN: Tina Peters is a proud American. And she's not embarrassed or ashamed of it in any way. She's proud of what she's done because she's not a criminal. She's just a good person.INSKEEP: Wait a minute. So she had a First Amendment right to allow unauthorized access to a Dominion voting machine?BIRKELAND: The First Amendment right is really centered on the length of her sentence and also, you know, her appeal process.INSKEEP: OK. So what is next for Peters?BIRKELAND: Well, this appeal of her state conviction and oral arguments in that case are scheduled for January. The U.S. Department of Justice also asked Colorado to move Peters to federal custody, citing security concerns. The state denied that request.INSKEEP: OK, so just bottom line then, President Trump says I pardon this person. Nothing has actually happened because she's in state custody, right?BIRKELAND: Yes, that's right.INSKEEP: OK. Bente Birkeland of Colorado Public Radio, thanks so much for the insights. Really appreciate it.BIRKELAND: Thank you.(SOUNDBITE OF LOWERCASE NOISES' \"THE HUNGRY YEARS\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he's 'pardoned' a Colorado clerk convicted of election tampering. Can he?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-12T09:49:45.000Z",
      "dateModified": "2025-12-12T09:49:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]