[
  {
    "title": "As Trump pushes for Venezuela's oil, here's what to know about the U.S. and Iraq's oil",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5672744/trump-oil-venezuela-iraq-chevron-rubio-vitol",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2368x1332+0+261/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8f%2Fc9%2F2ff886464f4bb32761877fb9f181%2Fgettyimages-1258960735.jpg",
    "tag": "Politics",
    "date": "2026-02-04T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Oil analysts who lived in Iraq after the",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Oil analysts who lived in Iraq after the invasion say the way the Trump administration is seizing Venezuelan oil is very different from how the U.S. dealt with Iraqi oil.\n                \n                    Qassem Zein/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Qassem Zein/AFP via Getty Images\n    \n\n   \n   Since the U.S. ousted Venezuelan leader Nicolás Maduro last month, oil analysts have been remembering the U.S. removal of another foreign leader more than twenty years ago. In 2003, the U.S. removed Iraqi President Saddam Hussein and occupied the country until 2011.   \"A fairly rapid change of a head of state prompted by U.S. military forces is always going to bring back memories of Iraq in one way or another,\" says Raad Alkadiri, a managing partner at 3TEN32 Associates, a political risk consultancy, who lived in Iraq from 2003 to 2007.   But Alkadiri says there's a key difference, and that's the way the Trump administration is taking control of Venezuela's oil. It's a process that, so far, has been marked by opacity and questions over whether what the U.S. is doing is legal, oil lawyers and oil analysts tell NPR.   \n   After the invasion of Iraq, the U.S. and the United Nations set up a system for managing Iraq's oil revenue. There was also an independent auditor to track the money. While the handling of Iraq's oil revenues involved the United Nations and independent oversight, that isn't the case with Venezuela's oil.   To date, the U.S. military has seized seven Venezuelan oil tankers. And the U.S. is selling Venezuelan oil through two Swiss oil trading firms, both of which have pled guilty to paying bribes in the past.   \n   At a Senate hearing last week, Secretary of State Marco Rubio said that this is a short-term fix for Venezuela. \"The long-term plan is not those two trading companies,\" Rubio said. \"The long-term plan is for them to have a normal energy program that sells directly into the market.\"   \"This was a historic deal President Trump brokered with the Venezuelan interim authorities that benefits both the American people and the Venezuelan people,\" wrote White House spokesperson Taylor Rogers in an email to NPR.   Here are four things to know about Iraq's oil history and what it can teach us about what could happen to Venezuela's oil.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In January, President Trump gathered oil traders and oil executives in the White House to talk about Venezuelan oil. He later told the press he didn't like what ExxonMobil CEO Darren Woods, fourth from the right, said.\n                \n                    Chip Somodevilla/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images North America\n    \n\n   \n   Most big U.S. oil companies didn't invest in Iraq post invasion   U.S. oil companies helped develop Venezuela's oil fields. But around 2007, some U.S. oil companies, including ExxonMobil, left after then-President Hugo Chávez renegotiated contracts with worse financial terms for the companies. Right now, Chevron is the only major U.S. oil and gas corporation working in Venezuela.   \n   Trump has made it clear he wants U.S. oil companies to increase investments and operations in Venezuela. In January, Trump gathered a group of oil executives in the White House and told them they would go into Venezuela and \"increase oil production to levels never ever seen before.\"   But at that meeting, ExxonMobil CEO Darren Woods told Trump that his company could invest in Venezuela again, but only if there were new investment protections and legal structures. Until then, Woods told Trump the country is \"uninvestable.\" Not long after that meeting, Trump said, \"I didn't like Exxon's response.\"   The disconnect between what the U.S. government wants and what U.S. oil executives say is feasible has echoes of Iraq, says Ben Van Heuvelen, editor in chief of Iraq Oil Report.   \n   After the invasion of Iraq in 2003, when the U.S. temporarily controlled the country, some in the Bush administration wanted to privatize Iraq's national oil companies. The U.S. installed former CEO of Shell Oil, Philip Carroll, as advisor for the Iraqi Oil Ministry. But Carroll said no to privatization. As Carroll told the BBC program Newsnight in 2005, \"I was very clear that there was to be no privatization of Iraqi oil resources or facilities while I was involved.\"   Iraq put some of the largest oil fields in the world up for auction in 2009. But many U.S. oil companies chose not to participate. When weighed against a violent war, decrepit infrastructure, and general lack of political and economic stability, most major U.S. oil companies found the financial rewards weren't worth it, Alkadiri says.   The same may be true in Venezuela, says Fareed Mohamedi, managing director at SIA-Energy International, an oil and gas consultancy.   \" Last time in Iraq, this time in Venezuela, [oil companies] are saying 'Show me whether you can create a stable level playing field that we can really do business in,'\" Mohamedi says.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Vice President Dick Cheney took to the stage in 2008 to deliver remarks to U.S. troops in Iraq. Cheney had previously been CEO of Halliburton, an oil services company that made billions of dollars in Iraq.\n                \n                    Paul J. Richards/AFP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Paul J. Richards/AFP\n    \n\n   \n   ExxonMobil played the long game in Iraq   Many U.S. big oil companies did not sign contracts in Iraq in 2009, but one U.S. oil giant did: ExxonMobil. \" They had a theory of getting in on the ground floor,\" Van Heuvelen says.   \n   In Venezuela, Chevron stayed when ExxonMobil and ConocoPhillips left. \"They played the long game,\" Kepes says.   Chevron is currently in talks with the U.S. and Venezuela about boosting Venezuela's oil output. In an email to NPR, Chevron spokesperson Bill Turenne wrote, \"Our focus remains on the safety of our people, and the integrity of our assets in strict compliance with all laws and regulations applicable to its business, as well as the sanctions frameworks provided for by the U.S. government.\"   Van Heuvelen says it will be interesting to see what happens with Chevron in Venezuela. In Iraq, ExxonMobil's long game \"kind of didn't pay off,\" Van Heuvelen says. \" Profit margins remained suppressed and it was pretty hard to do business there and so they walked away from the project.\"   ExxonMobil left Iraq in January 2024. ExxonMobil did not respond to requests for comment.   \n   Alkadiri says the main American companies that reaped big rewards in post-invasion Iraq were oil services companies. Those companies, including U.S. oil services company Halliburton, provided equipment and technical support to the oil sector.   The former CEO of Halliburton was Vice President Dick Cheney. Halliburton's subsidiary, KBR, came under scrutiny for multi-billion dollar contracts in Iraq.   Kepes says smaller independent oil companies that can take on more risk than big ones may have success in Venezuela, but they will not be able to make a big boost in oil output on their own.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Secretary of State Marco Rubio testifies during a Senate  Committee on Foreign Relations hearing on January 28, 2026. He said the use of two Swiss oil trading companies to facilitate Venezuelan oil sales was a \"short-term mechanism.\"\n                \n                    Chip Somodevilla/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images North America\n    \n\n   \n   U.N. involved with Iraq's oil revenues   After toppling Saddam, the U.S. began controlling Iraqi oil and gas revenue in a system set up through a 2003 U.N. security council resolution. It was overseen by an independent auditor. The idea was that Iraq's oil money would go to a bank account in the Federal Reserve Bank of New York, which it still does to this day. Then a small portion of the oil money would pay off debts racked up during the Saddam regime—they were paid off four years ago— and the rest would pay for the reconstruction of Iraq.   \n   Unlike with Iraqi oil, there is currently no independent monitoring of U.S.-facilitated sales of Venezuelan oil. The U.S. brokered a deal so that Venezuelan oil would be sold through Swiss oil trading firms, Vitol and Trafigura. The U.S. says the oil sold for $500 million. Venezuela says it's received $300 million. In the Senate hearing, Secretary Rubio said the remaining $200 million is in a bank account in Qatar.   Both Vitol and Trafigura have pled guilty to bribery and recently settled cases with the Department of Justice. Vitol did not respond to requests for comment. Trafigura directed NPR to statements on its website, including one that states that the past incidents do not reflect Trafigura's values and that they are investing in compliance.   \n   As for Venezuela's oil, Trafigura directed NPR to a statement on their website that reads, \"At the request of the US government, Trafigura and Vitol are providing logistical and marketing services to facilitate the sale of Venezuelan oil... Trafigura operates in full compliance with applicable sanctions.\"   Rubio said multiple times in the Senate hearing that the use of the oil traders was a \"short-term mechanism.\" White House spokesperson Rogers wrote in an email, \"President Trump always does what is in the best interest of the American people, such as brokering this historic energy deal with Venezuela.\"   Alkadiri says there's not enough oversight of Venezuelan oil revenues. That worries him in a way Iraqi oil revenues didn't. \" In the immediate term,\" he asks, \"what's there to protect the Venezuelans?\"   A long road back for Iraqi oil production   Around the time of the invasion of Iraq, senior Bush administration officials announced that Iraqi oil production would rebound—and soon.   That didn't happen. After the 2003 invasion, Iraqi oil production plummeted and it took four years for the country to get back to pre-war levels. It wasn't until 2011 that the country surpassed 2.6 million barrels a day, the production highs of Saddam's regime after the Gulf War.   \n   Loading...\n   Venezuela's oil sector is starting from a weak place, battered by years of sanctions, decreased investment, and the flight of oil professionals under Chávez's administration. Venezuela's oil sector produces a third less than it did in the 1970s, 1990s, and early 2000s.   \n   Today, many parts of Venezuela are controlled by armed gangs known as \"colectivos.\" Trump may want to boost Venezuelan oil production, but to do that, the country has to address security risks and a lack of institutional capacity, says Gerald Kepes, president of Competitive Energy Strategies, an energy consultancy.   \"Until they do, most of this is sheer fantasy,\" Kepes says.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As Trump pushes for Venezuela's oil, here's what to know about the U.S. and Iraq's oil",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2368x1332+0+261/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8f%2Fc9%2F2ff886464f4bb32761877fb9f181%2Fgettyimages-1258960735.jpg"
      ],
      "datePublished": "2026-02-04T10:00:00.000Z",
      "dateModified": "2026-02-04T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says GOP should nationalize elections in another attempt to influence elections",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698237/trump-says-gop-should-nationalize-elections-in-another-attempt-to-influence-elections",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-04T09:44:41.000Z",
    "description": "\n      \n      Trump says GOP should nationalize elections in another attempt to influence elections\n    \n        \n                Download\n           ",
    "body": "\n      \n      Trump says GOP should nationalize elections in another attempt to influence elections\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5698237/nx-s1-9634339\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      President Trump's statements that the GOP should nationalize elections was accompanied by false claims about election integrity. Trump's efforts to change voting rules have mostly been blocked so far.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says GOP should nationalize elections in another attempt to influence elections",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-04T09:44:41.000Z",
      "dateModified": "2026-02-04T09:44:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Witkoff is brokering an end to the war in Ukraine. How his efforts are going",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698181/steve-witkoff-is-brokering-an-end-to-the-war-in-ukraine-how-his-efforts-are-going",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-04T09:44:54.000Z",
    "description": "\n      \n      Steve Witkoff is brokering an end to the war in Ukraine. How his efforts are going\n    \n        \n                Download\n              ",
    "body": "\n      \n      Steve Witkoff is brokering an end to the war in Ukraine. How his efforts are going\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5698181/nx-s1-9634327\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep talks to Dan Baer of the Carnegie Endowment for International Peace about U.S. Envoy Steve Witkoff's approach to foreign conflicts.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Witkoff is brokering an end to the war in Ukraine. How his efforts are going",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-04T09:44:54.000Z",
      "dateModified": "2026-02-04T09:44:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leaders of Gateway train tunnel project sue Trump administration over withheld money",
    "url": "https://www.npr.org/2026/02/03/nx-s1-5697995/leaders-of-gateway-train-tunnel-project-sue-trump-administration-over-withheld-money",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-03T22:09:25.000Z",
    "description": "\n      A massive tunnel project that would link New York and New Jersey could run out of money by the end of the week. Developers are suing the Trump ",
    "body": "\n      A massive tunnel project that would link New York and New Jersey could run out of money by the end of the week. Developers are suing the Trump administration in an effort go get the funding flowing.   \n\n    SCOTT DETROW, HOST:  The Trump administration is withholding money for one of the largest public works projects in the country. It's a train tunnel between New York and New Jersey known as Gateway, and construction could halt this week as the project is expected to run out of money. Now leaders of it are suing the Trump administration. From member station WNYC in New York, Stephen Nessen reports.STEPHEN NESSEN, BYLINE: For the past three years, construction crews in both states have been working on a new train tunnel that will run under the Hudson River. The current one used by Amtrak and New Jersey Transit was damaged in Superstorm Sandy, and plans to replace it have been discussed since the storm happened in 2012. Now, with massive holes in the ground and nearly $2 billion spent on early construction, all that progress could be lost.(SOUNDBITE OF ARCHIVED RECORDING)CHUCK SCHUMER: It is insane.NESSEN: That's New York Senator Chuck Schumer speaking last week at a board meeting for the Gateway Development Commission in charge of the $16 billion project. Schumer worked with President Biden to fund 70% of the project through federal grants and loans.(SOUNDBITE OF ARCHIVED RECORDING)SCHUMER: This makes absolutely no sense. Yet here we are. There is only one person who terminated Gateway, and there is only one person who could get it back on track, and that is President Trump.NESSEN: Last October, President Trump announced he was suspending funds for the project. At the time, the Fed said they were reviewing the DEI policies of transportation projects that received federal funds.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: The project in Manhattan, the project in New York, it's billions and billions of dollars that Schumer has worked 20 years to get. It's terminated. Tell them it's terminated.NESSEN: The Gateway Development Commission filed a lawsuit in federal claims court Tuesday, seeking $205 million in overdue congressionally approved funding dating back to October. In their lawsuit, Gateway officials say they complied with every request from the federal government regarding its contracts and policies. Last week, White House spokesperson Kush Desai appeared to blame Chuck Schumer and the Democrats for the stalled project, saying they were, quote, \"refusing to negotiate with the administration\" in an apparent reference to negotiations over funding for the Department of Homeland Security. Desai said, quote, \"there is nothing stopping Democrats from prioritizing the interests of Americans over illegal aliens and getting this project back on track.\"The lawsuit also notes that over 1,000 union workers could lose their job starting Friday if the project doesn't get the federal money. Many of those workers showed up at last week's board meeting, wearing construction vests and work gear. Some of them voted for Trump and came with a message for the president.(SOUNDBITE OF ARCHIVED RECORDING)RONALD SIROIS: This is not you, Mr. Trump. This is not you. This is not what you're about. I know that.NESSEN: Ronald Sirois, an ironworker for 34 years.(SOUNDBITE OF ARCHIVED RECORDING)SIROIS: Leave the political stuff aside. Look at the hardworking people that this project will affect.NESSEN: Gateway officials expect 11,000 union workers employed on the job will be out of work if the funding dries up. Other laborers, like John Mooney, spoke to Trump using the president's own language.(SOUNDBITE OF ARCHIVED RECORDING)JOHN MOONEY: You said you want to make America great. Union workers go home and they can afford to make their communities better.NESSEN: And as if that wasn't convincing enough for the president.(SOUNDBITE OF ARCHIVED RECORDING)MOONEY: So money talks, [expletive] walks. All right? I know you know that one. So free up the money, get this tube flowing underneath the Hudson.NESSEN: Lawyers argue if the money isn't restored by Friday, crews will have to secure the jobsites and store the expensive heavy equipment. They say that alone could cost 15 to $20 million a month. For NPR News, I'm Stephen Nessen in New York.(SOUNDBITE OF MINUTEMEN'S \"COHESION\")\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leaders of Gateway train tunnel project sue Trump administration over withheld money",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-03T22:09:25.000Z",
      "dateModified": "2026-02-03T22:09:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Director of advocacy group talks about Trump's statements on nationalizing elections",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698182/director-of-advocacy-group-talks-about-trumps-statements-on-nationalizing-elections",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-04T09:43:42.000Z",
    "description": "\n      \n      Director of advocacy group talks about Trump's statements on nationalizing elections\n    \n        \n                Download\n            ",
    "body": "\n      \n      Director of advocacy group talks about Trump's statements on nationalizing elections\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5698182/nx-s1-9634340\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep asks David Becker of the Center for Election Innovation and Research for his response to President Trump's assertion that some elections should be nationalized.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Director of advocacy group talks about Trump's statements on nationalizing elections",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-04T09:43:42.000Z",
      "dateModified": "2026-02-04T09:43:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Partial government shutdown comes to an end, as negotiations over ICE funding begin",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698215/partial-government-shutdown-comes-to-an-end-as-negotiations-over-ice-funding-begin",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-04T11:45:39.000Z",
    "description": "Partial government shutdown comes to an end, as negotiations over ICE funding begin   The partial government shutdown has ended. Now, lawmakers come t",
    "body": "Partial government shutdown comes to an end, as negotiations over ICE funding begin   The partial government shutdown has ended. Now, lawmakers come to a more difficult task: how to find bipartisan agreement on changes to immigration enforcement.\n\n    \n        Politics\n    \n\n\n      \n                  \n            February 4, 20266:45 AM ET\n         \n      \n   \n                              By                               ,                \n            \n\n\n      \n      Partial government shutdown comes to an end, as negotiations over ICE funding begin\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5698215/nx-s1-9634368\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n\n      The partial government shutdown has ended. Now, lawmakers come to a more difficult task: how to find bipartisan agreement on changes to immigration enforcement.   \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Partial government shutdown comes to an end, as negotiations over ICE funding begin",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-04T11:45:39.000Z",
      "dateModified": "2026-02-04T11:45:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will calls to 'abolish ICE' sway voters in 2026? The strategy has Democrats split",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5690180/will-calls-to-abolish-ice-sway-voters-in-2026-the-strategy-has-democrats-split",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+208/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2F45%2Fd06c85124687a5acfe35e35a4f0f%2Fgettyimages-2256437066.jpg",
    "tag": "Politics",
    "date": "2026-02-04T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester with an anti-ICE sign, stand",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester with an anti-ICE sign, stands outside of the Henry Bishop Whipple Federal building on Jan. 18 in Minneapolis, Minn.\n                \n                    Jim Vondruska/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jim Vondruska/Getty Images\n    \n\n   \n   The killings of Alex Pretti and Renee Macklin Good in Minneapolis have renewed a long-running debate among Democrats over how best to address immigration enforcement, and whether advocating for \"abolishing ICE\" fits into a winning political playbook.   It is a debate that has taken on new urgency among Democrats against a backdrop of bipartisan backlash to the Trump administration's deportation efforts, led by Immigration and Customs Enforcement. Critics on both the left and the right say the fatal shootings of two U.S. citizens by federal officers last month show the administration has gone too far.   \n   For Democrats, the events in Minneapolis have created an opening ahead of this year's midterm election to shift the conversation on immigration — a notable change after struggling to message on the issue in the 2024 election.   But internal divides over what to do about ICE could complicate the effort. Calls to \"abolish ICE\" have been particularly amplified by progressive candidates, especially among younger Democrats running for Congress and those challenging Democratic incumbents. On Capitol Hill, far fewer Democrats have re-upped support for abolishing the agency, despite many rallying around the issue during President Trump's first term.   Instead, many elected Democrats have called for reforms at ICE, wary of appearing out of step with voters who want strong enforcement of immigration laws but who disagree with the administration's tactics.   \n   \"There is no question that the dynamic from '24 has flipped, [during] which immigration was a sure strength for Trump and a profound weakness for Democrats,\" said Jonathan Cowan, president and co-founder of the centrist think tank Third Way. But, he cautioned, if the party wants to be successful in November, they should keep the focus on the administration's missteps.   \"The divide in the Democratic Party is not over rage, disgust and anger,\" Cowan said. \"The divide is what are you going to do about it? How do you channel that rage in a way that actually changes policy? Both short and long run.\"   \n   He warns the \"abolish ICE\" slogan may not be universally embraced among voters across the country. Democrats hoping to flip districts or win over swing voters, Cowan said, should lean into different language, such as calling for a \"reform\" or \"overhaul\" of ICE.   He likens the debate to when many Democrats coalesced around the \"defund the police\" movement in 2020, a decision that Cowan argues created an opening for Trump to paint Democrats as soft on crime.   \"People embraced an emotionally satisfying slogan that in the long run proved to be politically toxic and a barrier to getting serious police reform in the country,\" Cowan said. \"We are in grave danger of the same problem happening for those who are embracing abolish ICE.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protester carries a sign that reads \"Defund The Police\" during a July 3, 2020 march in Richmond, Va. Many Democrats have been wary of calls to \"abolish ICE,\" and point to how calls to \"defund the police\" hurt the party with voters in 2020 and 2024.\n                \n                    Eze Amos/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Eze Amos/Getty Images\n    \n\n   \n   That may already be happening. In response to calls to abolish the agency, many Republicans have attempted to link the movement with \"defund the police.\" White House Press Secretary Karoline Leavitt echoed that in a post on X last week, asking, \"Why do Democrats keep attacking the law enforcement agencies that hunt down criminals and protect innocent American citizens?\"   Loudest calls come from progressives and new candidates   The debate is poised to be especially salient in Democratic primaries and in states that have faced increased enforcement, such as Minnesota, Illinois, California and New York. Democratic candidates have already faced off on the debate stage in Illinois with competing pitches to abolish and reform ICE and the Department of Homeland Security. In Minnesota, immigration enforcement has become a key issue in the race to succeed retiring Democratic Sen. Tina Smith.   Some of the loudest calls to abolish ICE have come from Gen Z and millennial candidates, many of whom have sought to frame their bids around a larger rejection of Democratic Party norms.   \n   Darializa Avila Chevalier has embraced that message. The 32-year-old progressive organizer and Ph.D. student is running a primary challenge against Rep. Adriano Espaillat, 71, in New York's 13th congressional district, which includes upper Manhattan and part of the Bronx.   \"From the very beginning, I've been adamant that I wanted the abolition of ICE to be central to what we're talking about,\" said Avila Chevalier.   \"It's an institution that should have never existed to begin with,\" she added. \"It's an institution that is younger than I am. And so I've lived in a world where ICE didn't exist, and we can all go back to a world where ICE doesn't exist and never exists again.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                ICE agents look for someone at a home on Jan. 28 in Circle Pines, Minn. Protests continue around the Twin Cities area after the Trump administration sent thousands of immigration agents to the region to search for undocumented immigrants.\n                \n                    Scott Olson/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Scott Olson/Getty Images\n    \n\n   \n   Avila Chevalier says Democratic candidates need \"to be bold\" in their solutions to issues affecting voters right now, and that includes on immigration.   \n   \"If I could trust that the leadership we have was reflecting our values, was actually meeting this moment,\" she said, \"I wouldn't be running.\"   Avila Chevalier is one of 10 candidates currently backed by Justice Democrats. The political group has supported a handful of progressives who have gone on to win seats in Congress, including Rep. Alexandria Ocasio-Cortez, D-N.Y., who delivered an upset primary win in 2018 and ran on a platform that included abolishing ICE, a stance she's reaffirmed in recent weeks.   For nearly a decade, Justice Democrats has rallied around anti-establishment candidates of all ages who often draw contrast to the Democrats they're challenging by rejecting donations from corporate PACs or pro-Israel lobbying groups. But in the wake of the fatal shootings in Minnesota, candidates the group supports are also drawing a line in the sand on immigration — pledging to abolish ICE.   \"Every single one of these communities has an ICE story of their own. And it's up to us to listen to those communities … and show people what an opposition party, if in power, would actually do,\" said Justice Democrats spokesperson Usamah Andrabi. \"That's what our slate of candidates exists to be.\"   Andrabi disagrees with the idea that \"abolish ICE\" creates more party divides than flips voters.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Protesters stage a march calling for an end to taxpayer spending on ICE and demanding a moratorium on evictions on Jan. 31 in Minneapolis.\n                \n                    John Moore/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        John Moore/Getty Images\n    \n\n   \n   \"The slogan is not the problem. ICE is the problem,\" he said.   Recent polling indicates there is some support for the issue among voters, though not overwhelming. A plurality of Americans, 46%, strongly support or somewhat support abolishing ICE, according to a YouGov poll conducted after the shootings in Minneapolis. Americans under 30 were most likely to oppose Trump's immigration agenda, according to the poll, and nearly 7 in 10 voice some level of support for getting rid of the agency.   It's a generational sentiment that may add important context when looking at the influx of younger candidates voicing support for the issue.   \n   \"I think that they are furious. They see it all over their news feeds. They see it in their communities. They also, I think, are less beholden to this idea of tradition or the way things have been done,\" said Amanda Litman, the founder of Run for Something, an organization that recruits and supports young people running for local office.   \"I think that sense of the crisis and of the urgency of this moment … is something that young leaders really bring with them into their positions of power,\" she added. \"And it is both their super strength and often their weakness because they're a little more radical in some ways.\"   Divides on Democratic messaging   Immigration enforcement has become a central issue in funding negotiations on Capitol Hill, where Democrats are lobbying for changes to the tactics used by immigration officers. Democrats want to narrow the type of warrants immigration officers can use to enter homes, require them to wear body cameras and prohibit the use of face masks.   While Democrats in Congress are united in what they see as the bare minimum needed to reform immigration enforcement, there is less consensus on how far to take the rhetoric. Though Sen. Ed Markey, D-Mass., is pushing to \"defund and abolish ICE,\" as are some House lawmakers, other Democrats have taken a different approach.   \n   Sen. Elizabeth Warren, D–Mass., would not directly answer whether she supports calls to abolish ICE, telling NPR it needs to be \"totally reorganized\" and \"torn down to the studs and rebuilt.\" She declined to say whether campaigning on abolishing ICE would benefit Democrats.   It's a debate that's also playing out in competitive midterm matchups, including in the Senate Democratic primary in Maine, where the state's governor, Janet Mills, and first-time progressive candidate Graham Platner are running to unseat Republican Sen. Susan Collins.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Graham Platner is running against Gov. Janet Mills for the Democratic nomination for Senate in Maine. Platner has called for ICE to be \"dismantled,\" characterizing it as \"the moderate position.\"\n                \n                    Sophie Park/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sophie Park/Getty Images\n    \n\n   \n   Mills has advocated for ICE reforms, calling for \"measures\" that would \"prohibit ICE's lawless, dangerous conduct and their abuses of power.\" Platner has called for the agency to be \"dismantled,\" characterizing it as \"the moderate position\" in a post on X.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Maine Gov. Janet Mills has not called for abolishing ICE, instead advocating for reforms at the agency.\n                \n                    Joseph Prezioso/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joseph Prezioso/AFP via Getty Images\n    \n\n   \n   The degree to which candidates choose to embrace — or reject — calls to abolish ICE could prove particularly decisive in swing districts.   \n   Though many voters want the current situation to change, calls to abolish ICE may mean different things to different people, argues Cowan of Third Way.   \"You can take the literal word, slogan, abolish ICE, and it will get a certain level of support,\" he said. \"But the moment you start asking people specifically what they actually support, the concept of abolishing interior immigration enforcement is not popular.\"   Though nearly half of Americans say they have some support for abolishing ICE, according to the latest YouGov poll, far fewer, less than a third, support abolishing the U.S. Border Patrol. When respondents were asked if they support Trump moving forward with a smaller enforcement effort, \"aimed at criminals, not at hotel maids and gardeners,\" 55% strongly or somewhat approved.   \n   The lack of Democratic consensus on the issue isn't stopping some progressive congressional hopefuls from standing by the policy they believe is right.   Mai Vang was in high school in 2003 when ICE was created. Now, more than two decades later, the 40-year-old Sacramento City councilmember is campaigning on abolishing the agency as she challenges 81-year-old Democrat Doris Matsui in California's 7th Congressional District.   \"What we've seen is this agency has inflicted harm on our communities, and you can't reform it. There is not enough training or even body cameras that would justify what they are doing,\" she said in an interview.   When asked if she considered shying away from using the slogan, Vang pushed back.   \"Not really because people are being killed and murdered by ICE,\" she said. \"It's not a radical position to say we don't want an entity harming our families and loved ones. I don't think it's radical to want to dismantle an agency that is killing citizens.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will calls to 'abolish ICE' sway voters in 2026? The strategy has Democrats split",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+208/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2F45%2Fd06c85124687a5acfe35e35a4f0f%2Fgettyimages-2256437066.jpg"
      ],
      "datePublished": "2026-02-04T10:00:00.000Z",
      "dateModified": "2026-02-04T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Rosa DeLauro talks about what's ahead as Congress negotiates DHS funding",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698189/rep-rosa-delauro-talks-about-whats-ahead-as-congress-negotiates-dhs-funding",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-04T11:45:31.000Z",
    "description": "\n      \n      Rep. Rosa DeLauro talks about what's ahead as Congress negotiates DHS funding\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      Rep. Rosa DeLauro talks about what's ahead as Congress negotiates DHS funding\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5698189/nx-s1-9634372\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Lawmakers have a little over a week to negotiate changes to federal immigration enforcement. Rep. Rosa DeLauro, D-Conn., talks about what's next and what Democrats are looking to accomplish.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Rosa DeLauro talks about what's ahead as Congress negotiates DHS funding",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-04T11:45:31.000Z",
      "dateModified": "2026-02-04T11:45:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel strikes Gaza, killing 19, mostly women and children, after saying Hamas violated deal",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5699274/israel-strikes-gaza-killing-19-mostly-women-and-children-after-saying-hamas-violated-deal",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2F65%2F0b82aac34b1badb3bd19a83958a3%2Fap26035301958442.jpg",
    "tag": "Politics",
    "date": "2026-02-04T10:53:31.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Palestinians mourn over the dead who wer",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Palestinians mourn over the dead who were killed in an Israeli military strike, at Shifa Hospital in Gaza City, Wednesday, Feb. 4, 2026.\n                \n                    Jehad Alshrafi/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jehad Alshrafi/AP\n    \n\n   \n   DEIR AL-BALAH, Gaza Strip — Israeli strikes in Gaza killed at least 19 Palestinians, most of them women and children, by midday Wednesday, according to hospital officials. Israel pledged to continue strikes, saying that it was responding to a militant attack on Israeli soldiers that seriously wounded one.   \n   Among the Palestinians killed were five children, including a 5-month-old and a baby just 10 days old; seven women; and a paramedic, said hospital officials. They are the latest Palestinians in Gaza to die since a ceasefire deal, which has been punctuated by deadly Israeli strikes, came into effect on Oct. 10, 2025. More than 530 Palestinians have been killed by Israeli in that time, according to Gaza's health ministry.   The escalating Palestinian death toll has rocked the U.S.-backed truce and caused Palestinians in the strip to say it does not feel like the war has ended.   \n   \"The genocidal war against our people in the Gaza Strip continues,\" said Dr. Mohamed Abu Selmiya, director of Gaza City's Shifa Hospital, in a Facebook post. \"Where is the ceasefire? Where are the mediators?\"   \n   An Israeli military official, speaking on the condition of anonymity in line with military policy, told The Associated Press that Israel would continue striking the strip. Since the ceasefire took hold, Israel's military has defended deadly strikes by saying it is responding to Hamas violations or militant attacks on its soldiers. The military says four soldiers have been killed since the ceasefire took hold.   Mediators have condemned the attacks and Hamas has called them violations of the deal.   Early Wednesday, Israeli troops fired on a building in the Tuffah neighborhood in north Gaza, killing at least 11 people, most from the same family, said Shifa Hospital, which received the bodies. The dead included two parents, their 10-day-old girl, her 5-month-old cousin and their grandmother.   \n   Israel's military said its aircraft and armored units had returned fire after militants started shooting at troops, badly wounding a reservist soldier who was evacuated to a hospital. Israel called the militant attack a violation of the deal.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Palestinian Raed al-Khabba carries his 3-month-old daughter Mira al-Khabbaz, who was killed in an Israeli military strike, at Shifa Hospital in Gaza City, Wednesday, Feb. 4, 2026.\n                \n                    Jehad Alshrafi/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jehad Alshrafi/AP\n    \n\n   \n   After the Tuffah strike, Israeli fire continued across the strip, said hospital officials. An Israeli strike on a family's tent in the southern city of Khan Younis killed three people including a 12-year-old boy, said Nasser hospital, which received the bodies. Tank shelling in Gaza City's eastern neighborhood of Zaytoun killed another three Palestinians, according to Shifa Hospital, including a husband and his wife.   \n   A strike on a tent in the Muwasi area of Khan Younis killed at least two people and wounded five others, according to a field hospital run by the Palestinian Red Crescent in the area. The dead included Hussein Hassan Hussein al-Semieri, a paramedic for the Palestinian Red Crescent who was on duty at the time, said the hospital.   Over 71,800 Palestinians have been killed since the start of the war, according to the Gaza health ministry, which does not say how many were fighters or civilians. The ministry, which is part of the Hamas-led government, maintains detailed casualty records that are seen as generally reliable by U.N. agencies and independent experts.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel strikes Gaza, killing 19, mostly women and children, after saying Hamas violated deal",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+450/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2F65%2F0b82aac34b1badb3bd19a83958a3%2Fap26035301958442.jpg"
      ],
      "datePublished": "2026-02-04T10:53:31.000Z",
      "dateModified": "2026-02-04T10:53:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump grants tariff breaks to 'politically connected' companies, Senate Dems say",
    "url": "https://www.npr.org/2026/02/04/nx-s1-5698264/trump-wyden-van-hollen-tariffs-politically-connected-companies",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6983x3928+0+364/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Fd2%2Fd44dbf68439e9e971f96433139ee%2Fgettyimages-2243768507-2.jpg",
    "tag": "Politics",
    "date": "2026-02-04T11:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump shakes hands with Apple ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump shakes hands with Apple CEO Tim Cook during a meeting with business leaders in Tokyo in October. Cook is among the CEOs who have personally courted Trump in the past year and whose companies' products have escaped the worst of Trump's tariffs.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   Two top-ranking Democrats are blasting the Trump administration for playing favorites with tariffs — by giving trade relief to the big companies whose CEOs are cozying up to the president.   In a letter to the White House made public Wednesday morning, Sen. Ron Wyden, D-Ore., and Sen. Chris Van Hollen, D-Md., criticized the administration for relaxing some tariffs \"through an opaque process that appears to favor the politically connected\" and that \"has opened the door to corruption and economic harm.\"    \n   Wyden is the top-ranking Democrat on the Senate Finance Committee; Van Hollen sits on the Senate Appropriations Committee, and is the top-ranking Democrat on its commerce subcommittee.    Now they're raising \"significant concerns that the Trump Administration appears to have created a closed-door tariff exclusion process allowing relief largely for those with political connections,\" according to the letter addressed to U.S. Trade Representative Jamieson Greer and Commerce Secretary Howard Lutnick.   The tariff exemption process \"has lacked transparency and procedural fairness for American stakeholders, especially small businesses and family farms,\" Wyden and Van Hollen added in the letter. An advance copy of the letter was seen by NPR.   \n   The letter comes at a time when President Trump is visibly favoring some companies and investors, some of whom have publicly courted him with personal gifts — like the gold-plated desk clock recently presented by Rolex's CEO — and donations to his controversial plans to build a White House ballroom.   This blurring of the lines between business and government has led political commentators and business leaders across the political spectrum to warn that the United States is tipping into \"crony capitalism.\"   A White House spokesperson did not immediately respond to a request for comment, but the administration has previously dismissed claims of crony capitalism and defended the tariffs. A White House official recently speaking to NPR on condition of anonymity defended Trump's policies as \"the traditional free-market policymaking that you would expect coming out of a Republican administration.\" The official also said that there are U.S. companies benefiting from Trump's policies \"whether or not they have a good relationship with the administration.\"   \n   Since the beginning of his second term, Trump has imposed sweeping tariffs on many U.S. imports through executive orders, in a stop-and-start process that continues today. The Supreme Court is now set to rule on a court case challenging his authority to do so — but the tariffs are already being paid by millions of businesses.   Adding to the chaos, Trump has also reversed course on various tariffs, including for pharmaceutical companies and on beef, coffee and other agricultural products. The senators' letter takes issue with the administration's \"opaque\" and seemingly \"ad hoc\" process for making these exemptions, through amendments to Trump's executive orders.   Wyden and Van Hollen do not name specific companies. But they do note that, for example, smartphones are among the imports that the Trump administration added to an April list of goods that are exempt from the tariffs.   Smartphone maker Apple is among the companies whose CEOs have personally courted Trump in the past year. CEO Tim Cook last summer presented Trump with a glass-and-gold plaque as his company promised to invest $600 billion in the United States.   Wyden and Van Hollen wrote that the administration's apparent process for granting exemptions benefits companies that \"find themselves in favor with the White House.\"   \"The Administration has considered and granted tariff exclusions behind closed doors, through an opaque and unaccountable process,\" they wrote.   Wyden and Van Hollen asked Greer and Lutnick to answer several questions about the administration's process for exempting imports from tariffs and how it will engage with small businesses and other U.S. companies \"that lack a presence in Washington, D.C. or an existing relationship with your agencies.\" They have asked for a response by March 4.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump grants tariff breaks to 'politically connected' companies, Senate Dems say",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6983x3928+0+364/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Fd2%2Fd44dbf68439e9e971f96433139ee%2Fgettyimages-2243768507-2.jpg"
      ],
      "datePublished": "2026-02-04T11:00:00.000Z",
      "dateModified": "2026-02-04T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]