[
  {
    "title": "US carries out new strike in Caribbean, killing 3 alleged drug smugglers",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5594753/us-strike-caribbean-kills-3-drug-smugglers",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5552x3123+0+289/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe6%2F78%2F3cb860be448e96d3659e441c4e82%2Fap25296747788564.jpg",
    "tag": "Politics",
    "date": "2025-11-02T05:45:07.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump answers questions",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump answers questions from reporters during a roundtable on criminal cartels in the State Dining Room of the White House, Thursday, Oct. 23, 2025, in Washington, as Defense Secretary Pete Hegseth listens.\n                \n                    Evan Vucci/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Evan Vucci/AP\n    \n\n   \n   WEST PALM BEACH, Fla. — The U.S. military has carried out another lethal strike on alleged drug smugglers in the Caribbean Sea, Defense Secretary Pete Hegseth announced Saturday.   Hegseth in a social media posting said the vessel was operated by a U.S.-designated terrorist organization but did not name which group was targeted. He said three people were killed in the strike.   \n   It's at least the 15th such strike carried out by the U.S. military in the Caribbean or eastern Pacific since early September.   \"This vessel—like EVERY OTHER—was known by our intelligence to be involved in illicit narcotics smuggling, was transiting along a known narco-trafficking route, and carrying narcotics,\" Hegseth said in a posting on X.   The U.S. military has now killed at least 64 people in the strikes.   Trump has justified the attacks as a necessary escalation to stem the flow of drugs into the United States. He has asserted the U.S. is engaged in an \"armed conflict\" with drug cartels, relying on the same legal authority used by the Bush administration when it declared a war on terrorism after the Sept. 11, 2001, attacks.   \n   U.S. lawmakers have been repeatedly rebuffed by the White House in their demand that the administration release more information about the legal justification for the strikes as well as greater details about which cartels have been targeted and the individuals killed.   \n   Hegseth in his Saturday posting announcing the latest strike said \"narco-terrorists are bringing drugs to our shores to poison Americans at home\" and the Defense Department \"will treat them EXACTLY how we treated Al-Qaeda.\"   Senate Democrats renewed their request for more information about the strikes in a letter on Friday to Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and Hegseth.   \"We also request that you provide all legal opinions related to these strikes and a list of the groups or other entities the President has deemed targetable,\" the senators wrote.   Among those signing the letter were Senate Minority Leader Chuck Schumer as well as Sens. Jack Reed, Jeanne Shaheen, Mark Warner, Chris Coons, Patty Murray and Brian Schatz.   The letter says that thus far the administration \"has selectively shared what has at times been contradictory information\" with some members, \"while excluding others.\"   Earlier Friday, the Republican chairman and ranking Democrat on the Senate Armed Services Committee released a pair of letters sent to Hegseth written in late September and early October requesting the department's legal rationale for the strikes and the list of drug cartels that the Trump administration has designated as terrorist organizations in its justification for the use of military force.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US carries out new strike in Caribbean, killing 3 alleged drug smugglers",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5552x3123+0+289/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe6%2F78%2F3cb860be448e96d3659e441c4e82%2Fap25296747788564.jpg"
      ],
      "datePublished": "2025-11-02T05:45:07.000Z",
      "dateModified": "2025-11-02T05:45:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "California voters weigh in on redrawing the state's Congressional map",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5589241/california-voters-weigh-in-on-redrawing-the-states-congressional-map",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-02T13:53:00.000Z",
    "description": "\n      Voters in California are weighing whether to allow Democratic state leaders to redraw the state's Congressional map to offset Republicans' redr",
    "body": "\n      Voters in California are weighing whether to allow Democratic state leaders to redraw the state's Congressional map to offset Republicans' redraw in Texas.   \n\n    AYESHA RASCOE, HOST:  A big election concludes Tuesday in California. Voters there are weighing whether to allow Democratic state leaders to redraw congressional lines before next year's midterm elections. A new map would make five House seats more favorable to Democrats, offsetting new Republican districts in Texas. NPR's Ashley Lopez asked voters in Southern California what they make of the plan.ASHLEY LOPEZ, BYLINE: There is only one item on the ballot for this election - Proposition 50. The measure directly calls out Texas and asks voters to allow state leaders to temporarily bypass an independent redistricting commission that voters approved about 15 years ago. And while this puts voters in the weird position of undermining something they approved, many voters say they don't remember how they voted back then.ADELAIDE STONE VAN GESSEL: I do not really remember voting for it, but I - I'm pretty sure I did.KATHY BREWER: I don't remember. You know, we dive in when it's time to vote on something, and then other stuff comes up, right?JIM LIND: I have trouble with yesterday.LOPEZ: That was Adelaide Stone Van Gessel, Kathy Brewer and Jim Lind. Lind lives in Irvine and voted in favor of the new measure Prop 50, but he says he does have mixed feelings about allowing the state to gerrymander the congressional map to help one party.LIND: I wish we didn't have to get to this point, but we need to do something in this country to counteract some of the stuff that's being done in the White House.LOPEZ: A lot of yes-voters use this same language. They said their main objective is to counteract efforts in Republican states like Texas to redraw congressional districts. This is an effort, by the way, that was prompted by President Trump.About 30 minutes east of Irvine, surrounded by mountains is Santa Rancho Margarita. Though the city is one of Orange County's conservative strongholds, many Democrats showed up to the public library to vote yes for Prop 50. Eva Hernandez was one of those voters.EVA HERNANDEZ: I'm like, well, you know, we got to do something. You can't just sit back, let things roll like they've been rolling. So it's disturbing, you know? But California's got to do it. We're a blue state. We got to do what we got to do to counteract that.LOPEZ: Polling shows that Prop 50 is likely to pass in California. None of the opposition's arguments against it is truly landing in a state that is overwhelmingly Democratic. Kathy Brewer did, however, vote no. She lives in Rancho Santa Margarita and thinks this election and redraw are unnecessary.BREWER: Off the top of my head, I'm going to say it's a waste of money, of good California money that we need.LOPEZ: Betty Roth is another no vote. She says that as a Republican, she already feels pretty powerless in the state. Out of the 52 seats California has in the U.S. House, only nine are held by Republicans. Roth says she doesn't want the GOP to lose what little representation they have.BETTY ROTH: They're trying to take away the vote from a good portion of the American people by, you know, gerrymandering.LOPEZ: But a lot of Democratic voters don't feel much sympathy for this argument. Aaron Leal, who lives in this conservative enclave, says Republicans are trying to rig the midterms in their favor because they aren't sure they can win on policy. He says the party is practically forcing Democrats to react.AARON LEAL: If one side is going full force pushing their agenda, we cannot bring, as they say, like, a knife to a gun fight.LOPEZ: Leal says he also likes that the measure is temporary.LEAL: In 2030, it's going to go back to the original independent commission. If Texas had not passed their map, this would not have happened here.LOPEZ: Besides giving Democrats a better shot during the midterms, this special election in California has also provided the party an opportunity to assert the little power they have to directly combat President Trump. Polling shows the Democratic base has been frustrated with their leaders, mostly because they haven't been able to do much. David Checel is one of those voters. He lives in Culver City in the Los Angeles area.DAVID CHECEL: The Democrats haven't really fought back and done anything to combat what's going on with the Republican party and Trump. Yeah. I don't know what you're supposed to do in this, and I'm glad I'm not a politician.LOPEZ: Checel says he wasn't thrilled about Prop 50, but he voted in favor of it because it's better than doing nothing, he says. Back in Irvine, Jim Lind says he agrees with this sentiment, but he says he's also pretty sad that this is what politics has become.LIND: I guess it's unfortunate that any party, whatever it may be, has to stoop to a lower level to get things done. All my life, I've probably been more idealistic as far as the honesty of people, and it's just not working out.LOPEZ: And this is partly why over and over voters said what they actually want is for no state to be able to gerrymander districts to favor one party. Many said Congress should pass a ban on the practice altogether.Ashley Lopez, NPR News.(SOUNDBITE OF CHARLES ATLAS' \"THE SNOW BEFORE US\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California voters weigh in on redrawing the state's Congressional map",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-02T13:53:00.000Z",
      "dateModified": "2025-11-02T13:53:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How this week's elections in Virginia became about ... everything",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5589774/virginia-races-trump-redistricting-spanberger-earle-sears",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5440x3060+0+42/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F8a%2Fc5336c424c50a2a291b5c2566208%2F20251101-elex-dems-obama-sa1-6667.jpg",
    "tag": "Politics",
    "date": "2025-11-02T19:21:28.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Attendees listen as former President Oba",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Attendees listen as former President Obama joins former congresswoman and current Democratic gubernatorial candidate Abigail Spanberger at a rally on Nov. 1 at Chartway Arena in Norfolk.\n                \n                    Shaban Athuman/VPM News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Shaban Athuman/VPM News\n    \n\n   \n   Several late-breaking surprises have shaken up what political watchers thought would be a quiet race in Virginia.   The commonwealth's gubernatorial race — one of just two held the year after presidential elections — is often seen as a temperature check on how voters feel about leaders in Washington.   Abigail Spanberger, the Democratic nominee and former congresswoman, has maintained a lead in polls since very early in the race over Republican nominee Lt. Gov. Winsome Earle-Sears.   But this year, while voters' top concerns are energy prices, housing affordability and jobs, the rest of the race has become a referendum on everything from political violence to redistricting.   \n   Here, public media journalists across Virginia take us into each issue.   DOGE and the federal government shutdown   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former President Barack Obama joins former Congresswoman and Virginia Democratic candidate for governor Abigail Spanberger at a rally on Nov. 1 at Chartway Arena in Norfolk.\n                \n                    Shaban Athuman/VPM News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Shaban Athuman/VPM News\n    \n\n   \n   The challenges facing Virginia's 320,000 federal workers and hundreds of thousands of federal contractors came long before the Oct. 1 government shutdown. Earlier this year, during Elon Musk's DOGE efforts, thousands of Virginians were laid off.   Democrats in the commonwealth hope that voter anger over the firings and furloughs will carry them to victory on Tuesday night. On the campaign trail, Spanberger talks about sticking up for federal workers in the face of the \"chaos from Washington.\" At a campaign event Thursday, Spanberger put it this way: \"The stakes of this election are serious.\"   As furloughs stretch into a second month, Virginia Republicans have also seen a political opening in the shutdown. \"My opponent, all summer long, has been playing political football with federal workers by trying to say that she loves them more than anyone else,\" Earle-Sears said on the debate stage, and then criticized Spanberger for encouraging Democrats in Congress to resist any funding deal that doesn't include continuing health care subsidies.   But Earle-Sears hasn't shied away from the Trump administration's cuts to the federal workforce. She has said she believes claims of \"waste, fraud, and abuse\" and argues that the impact of layoffs in Virginia will be minimal due to the economic strength she and Republican Gov. Glenn Youngkin have stewarded over the previous four years.   \n   Political violence   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former Del. Jay Jones, Democratic nominee for attorney general, is photographed on Sept. 12 at the Virginia Museum of History and Culture in Richmond.\n                \n                    Shaban Athuman/VPM News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Shaban Athuman/VPM News\n    \n\n   \n   A scandal in the race for attorney general has reverberated up the ticket. Early last month, text messages from 2022 show Jay Jones, the Democratic nominee for attorney general and a former member of the Virginia legislature, describing hypothetical violence against a political opponent.   Earle-Sears and other Republican candidates have tried to tie the text messages to the assassination of Charlie Kirk, painting Democrats as politically violent.   Spanberger condemned the messages and political violence generally, but didn't withdraw or double down on her endorsement of Jones. \"It is up to voters to make an individual choice based on this information,\" she said in the gubernatorial debate.   Jones' Republican opponent, Virginia Attorney General Jason Miyares, is appealing to Spanberger voters to split their tickets.   Redistricting    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Lt. Gov. Winsome Earle-Sears, Republican candidate for governor, chats with the clerks and minority and majority leadership as they attempt to override her ruling during a special session of the Virginia General Assembly on Wednesday, Oct. 29, at the Capitol in Richmond.\n                \n                    Shaban Athuman/VPM News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Shaban Athuman/VPM News\n    \n\n   \n   Democrats in the Virginia legislature threw another wrench into the campaign last week by calling a surprise series of meetings after North Carolina became another state to redraw its congressional map to favor the GOP at the behest of President Trump.   On Friday, the Virginia legislature proposed a constitutional amendment that would allow redistricting ahead of the 2026 midterms. Because it needs to be approved by legislators again next year before voters can finalize the amendment next spring, its success depends on Spanberger winning her race and Democrats maintaining control of the House of Delegates.   How much the redistricting plan changes voters' minds is up for debate. Close to a million voters cast their ballots before the Democrats announced their plan, while the redistricting session took delegates off the trail during the final full week of campaigning.   Earle-Sears, who presides over the state Senate in her role as lieutenant governor, was also called back to Richmond. She still managed to hold events around the state, and a press conference on the steps of the Virginia Capitol, while a small crowd held \"Winsome For Governor\" signs.   \n   Spanberger has made few public comments about redistricting, beyond signalling her general support.   Transgender youth   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Republican Lt. Gov. candidate John Reid points to Republican gubernatorial candidate Lt. Gov. Winsome Earle-Sears during a press conference before a special session of the Virginia General Assembly on Oct. 27 at the Capitol in Richmond.\n                \n                    Shaban Athuman/VPM News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Shaban Athuman/VPM News\n    \n\n   \n   Republicans up and down the ballot have made Virginia's transgender youth a major campaign issue.   The argument over transgender athletes and bathrooms in Virginia schools really took off when Republican Glenn Youngkin made it a focus of his 2021 campaign for governor. Arguably, it helped him become the first GOP governor elected in more than a decade.   But, despite Republicans spending millions on ads around transgender students in 2025, recent polling shows it's a top concern for 3 percent of voters. The economy and countering Trump's policies are at the forefront of most voters' minds.   Spanberger has said she likely leads on the subject because Republicans have been \"villainizing kids.\"   \"Particularly efforts to heavily politicize a group of kids who need a bit of grace, and the adults around them to show thoughtfulness,\" the former congresswoman said.   \"I'm not taking a stand because it's the easy thing to do. Of course, it's not easy. I'm being abused for it,\" Earle-Sears said, comparing her support for cisgender students to the civil rights movement.      Jahd Khalil covers Virginia state politics for VPM News, Margaret Barthel covers Northern Virginia for WAMU, and Brad Kutner is the Richmond bureau chief for Radio IQ.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How this week's elections in Virginia became about ... everything",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5440x3060+0+42/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F8a%2Fc5336c424c50a2a291b5c2566208%2F20251101-elex-dems-obama-sa1-6667.jpg"
      ],
      "datePublished": "2025-11-02T19:21:28.000Z",
      "dateModified": "2025-11-02T19:21:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration faces Monday deadline on use of contingency funds for SNAP",
    "url": "https://www.npr.org/2025/11/03/g-s1-96296/trump-deadline-contingency-funds-snap",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8070x4539+0+420/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F82%2F7b%2F166cfd664584a5035649b4b81700%2Fap25304719118315.jpg",
    "tag": "Politics",
    "date": "2025-11-03T06:17:45.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Dairy products, which are covered by the",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Dairy products, which are covered by the USDA Supplemental Nutrition Assistance Program (SNAP), is displayed for sale at a grocery store Friday, Oct. 31, 2025, in Nashville, Tenn.\n                \n                    George Walker IV/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        George Walker IV/AP\n    \n\n   \n   President Donald Trump's administration faces deadlines on Monday to tell two federal judges whether it will comply with court orders that it continue to fund SNAP, the nation's biggest food aid program, using contingency funds during the government shutdown.   \n   The U.S. Department of Agriculture planned to freeze payments to the Supplemental Nutrition Assistance Program starting Nov. 1 because it said it could no longer keep funding it due to the shutdown. The program serves about 1 in 8 Americans and is a major piece of the nation's social safety net — and it costs about $8 billion per month nationally.   The situation leaves millions with uncertainty about how they will feed themselves. Benefits will be delayed in November regardless of the outcome of the court cases because many beneficiaries have their cards recharged early in the month and the process of loading cards can take a week or more in many states.   \n   Democratic state attorneys general or governors from 25 states, as well as the District of Columbia, challenged the plan to pause the program, contending that the administration has a legal obligation to keep it running in their jurisdictions. Cities and nonprofits also filed a lawsuit.   On Friday, judges in Rhode Island and Massachusetts ruled separately that the administration must continue to pay for SNAP. They both gave the administration leeway on whether to fund the program partially or in full for November.   The USDA has a $5 billion contingency fund for the program, but the Trump administration reversed an earlier agency plan to use that money to keep SNAP running. Democratic officials argue that the administration could also use a separate fund of about $23 billion.   U.S. District Judge John J. McConnell in Providence, Rhode Island, said SNAP must be funded using at least contingency funds, and he asked for an update on progress by Monday.   \n   He said all previous work requirement waivers must continue to be honored. During the shutdown, the USDA has terminated existing waivers that exempted work requirements for older adults, veterans and others.   In Boston, U.S. District Judge Indira Talwani ruled the suspension was unlawful and said USDA has to pay for SNAP. Talwani ordered the federal government to advise by Monday whether they will use emergency reserve funds to provide reduced SNAP benefits for November or fully fund the program using both contingency funds and additional available funds.   \n   Advocates and beneficiaries say halting the food aid would force people to choose between buying groceries and paying other bills. The majority of states have announced more or expedited funding for food banks or novel ways to load at least some benefits onto the SNAP debit cards.   To qualify for SNAP in 2025, a family of four's net income after certain expenses can't exceed the federal poverty line, which is about $32,000 per year. Last year, SNAP assisted nearly 42 million people, about two-thirds of whom were families with children.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration faces Monday deadline on use of contingency funds for SNAP",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8070x4539+0+420/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F82%2F7b%2F166cfd664584a5035649b4b81700%2Fap25304719118315.jpg"
      ],
      "datePublished": "2025-11-03T06:17:45.000Z",
      "dateModified": "2025-11-03T06:17:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Politics chat: Election Day in Texas, California, New Jersey and New York City",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5592900/politics-chat-election-day-in-texas-california-new-jersey-and-new-york-city",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-02T13:13:40.000Z",
    "description": "\n      Off-year elections are happening Tuesday in a number of states, with headline races in Virginia, New Jersey, and California.   \n\n    AYESHA RAS",
    "body": "\n      Off-year elections are happening Tuesday in a number of states, with headline races in Virginia, New Jersey, and California.   \n\n    AYESHA RASCOE, HOST:  We're entering the second month of the federal shutdown, and there have yet to be any meaningful moves to end it. They may come, though, after Tuesday. NPR senior political editor and correspondent Domenico Montanaro joins us now to explain. Good morning, Domenico.DOMENICO MONTANARO, BYLINE: Hey, Ayesha.RASCOE: So Tuesday is Election Day, and there are off-year races in a number of states. What would those results have to look like to change the dynamic as it relates to the shutdown?MONTANARO: Well, I mean, these elections are really the first major chance for people to side with one party or the other at the ballot box this year. And if we see significant or definitive results in one or the other direction, I mean, that could shake up leaders in Washington to want to make some kind of move or feel some pressure to negotiate because so far, all we've seen is a stalemate. That's largely because, I mean, polling has not pointed the finger for blame in either direction, really definitively. That's unlike five years ago, when we had the longest shutdown in history. This one looks like it's careening well past that. Back then, Trump got a more significant majority of the blame. Though I will say the amount of people blaming Republicans has gone up slightly since this shutdown began, so Democrats feel good that they have a solid issue that they're talking about in health care, and these subsidies that expire at the end of the year that could mean tens of millions of people see their health care prices go way up.RASCOE: President Trump isn't on the ballot, but he kind of is. Is he a boost for Republican candidates or a drag?MONTANARO: Well, I mean, off-year and midterm elections are usually not kind to the president's party, and that's even worse when the president's below 50% in their approval ratings, and that's certainly the case for Trump and Republicans. His approval rating has been somewhere 39 and 41% - really come down since he started the second term. People are unhappy with the cost of living and prices, and, you know, they think this administration has gone too far with things like mass deportations. Republicans don't think so, but certainly large majorities of independents and Democrats do. And independents, we know, are key in these important swing districts and swing states. Trump's certainly unpopular in Virginia and New Jersey, where we have these two big governors' races on Tuesday, and those states lean left. So we've seen Democrats talk a lot about Trump, put them in their ads. Republicans, on the other hand, have been trying to steer clear of him, make these elections more local, if that tells you anything.RASCOE: The only House seat on Tuesday's ballot - on Tuesday's ballots is one in Texas being filled in a special election, so we won't see any real changes in the balance of power in that chamber, but there is Proposition 50 in California.MONTANARO: Yeah. And this might be the most important election on Tuesday. Not often we say that about a ballot initiative, but it may be true this time because it could have real consequences for control of the House. You know, the issue here is that California mandates its redistricting by independent commission, but California Governor Gavin Newsom, who's a Democrat, is trying to counterbalance President Trump's demand to Republicans in places like Texas and other red states to squeeze out more Republican districts in rare mid-decade redistricting. This ballot initiative, Proposition 50, would temporarily overturn that requirement and give state Democrats the opportunity to try and create more Democratic districts. So this is all about this arms race we're seeing in redistricting for 2026 in next year's midterm elections and who controls the House. And every seat is important right now because there's only a three-seat majority with Republicans in control, and we're just in such a volatile time with narrower and narrower margins than we've ever really seen in our history.RASCOE: You're watching New Jersey for signs of the GOP's relationship with Latino voters. Has it changed since the election? That's what you're going to be trying to see?MONTANARO: I mean, really interesting here, because Trump lost New Jersey in the 2024 presidential election, but it was a lot closer than four years earlier. And a big reason for that was how much Latinos swung towards Trump. That's particularly evident in a lot of counties in North Jersey that have significant Latino populations. Take a place like Passaic County, where Paterson is, where I used to teach, by the way. The county is almost half Latino, according to the census, and Trump was the first Republican to win that county since 1992. And by the way, he got blown out there in 2016 when he first ran and lost it in 2020 also.So this may be a first good test of Trump's support with Latinos and whether they're continuing to back him and the Republican Party because polling has shown Trump and the party nosediving with Hispanics, not just because of mass deportations, where the administration has gone after way more than just hardened criminals, as they said they would, but also because of prices. That's the big reason why so many people crossed over and voted for Trump in the first place because he promised to bring them down, and we've seen anything but a real focus on that from Trump.RASCOE: And what about Democrats? What are you seeing and hearing as we go into Tuesday?MONTANARO: Yeah. I mean, we have a real difference in style for the kinds of Democrats who are running in some of these races. Take a place like New York, where there's this big mayor's race, and you have someone like Zohran Mamdani who's really captured progressives' imagination with his focus on affordability and housing. His message has really broken through with younger voters, but Republicans have also turned him into a lightning rod, calling him extremist and radical for views on Israel and past comments on defunding the police, something he's disavowed, says safety is a top priority. But contrast that with how someone like Abigail Spanberger's running for governor of Virginia, and, you know, in much more reserved style. And I think whether - not just whether Mamdani wins, but how he governs if he does win, is going to really determine just how far Democrats run with his message next year, or if they move more toward someone like Spanberger.RASCOE: That's NPR's Domenico Montanaro. Domenico, thanks so much.MONTANARO: Hey, you got it.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Politics chat: Election Day in Texas, California, New Jersey and New York City",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-02T13:13:40.000Z",
      "dateModified": "2025-11-02T13:13:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former President Obama is rallying support for Democrats in local races",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5590178/former-president-obama-is-rallying-support-for-democrats-in-local-races",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-02T13:13:31.000Z",
    "description": "\n      Former President Barack Obama is using his continued popularity in the party to rally support for Democrats in advance of Tuesday's elections. ",
    "body": "\n      Former President Barack Obama is using his continued popularity in the party to rally support for Democrats in advance of Tuesday's elections.   \n\n    AYESHA RASCOE, HOST:  Democrats don't control the Senate, House or White House, which raises the stakes for the party in this week's state and local elections. Voters in Virginia and New Jersey go to the polls to choose new governors and decide which party controls the statehouse, which are both currently majority Democrat, and former President Barack Obama wants to keep it that way. He's using his continued popularity this weekend to rally support for Democrats in both those states, as NPR's Sarah McCammon reports from Virginia.SARAH MCCAMMON, BYLINE: As former President Obama took the stage in Norfolk, he used the moment to call out several of President Trump's recent actions. He said Trump is replacing career prosecutors with loyalists and targeting his enemies with investigations and prosecutions.(SOUNDBITE OF ARCHIVED RECORDING)BARACK OBAMA: We got a president who thinks it's OK to use the Justice Department to go after his political opponents.(BOOING)OBAMA: Hey. Wait, wait, don't boo.UNIDENTIFIED CROWD: Vote.OBAMA: Vote. They don't hear boos. They hear votes.(CHEERING)MCCAMMON: Obama campaigned on the campus of Old Dominion University, alongside former Congresswoman Abigail Spanberger, the Democratic nominee for Virginia governor. At a time when Republicans and their allies control all three branches of the federal government, Obama's message to Democrats was that their votes can still make a difference in the off-year elections taking place this week.(SOUNDBITE OF ARCHIVED RECORDING)OBAMA: We all have more power than we think. We just have to use it.MCCAMMON: Even as many of Trump's actions have been unpopular with voters, the Democratic Party has struggled in recent months with historically low approval ratings. An NPR/PBS News/Marist poll in September found that congressional Democrats were less popular than their Republican counterparts, and all of them were less popular than Trump. Obama acknowledged that some voters, worried about the state of the economy and the country, had decided to give Trump a chance at another term.(SOUNDBITE OF ARCHIVED RECORDING)OBAMA: Now, nine months later, you got to ask yourself, has any of that gotten better?UNIDENTIFIED CROWD: No.RASCOE: La'Shon Jordan (ph), who came to the rally from nearby Virginia Beach, said she'd voted for Trump the first time in her 55 years that she'd ever voted for a Republican. She says she felt the country was failing, and she hoped Trump would turn it around.LA'SHON JORDAN: He talked things that he thought we wanted to hear. You know, we needed to hear those things, but we needed to hear them from a Democratic candidate. And a lot of us were bamboozled - you know? - is a good word.MCCAMMON: Jordan works as a family engagement specialist at a public school in Norfolk. She says the federal government shutdown has been hard on some of the low-income families she serves. Jordan blames Trump and the Republicans for the impact of the shutdown, including uncertainty around food stamp benefits.JORDAN: And now he's taking those things away or his party is - I don't know, I feel like he's taking those things away. And our kids and our families are suffering from that.MCCAMMON: Jordan says she hopes voters will elect Democratic candidates like Abigail Spanberger in Virginia to push back on some of Trump's policies. As the shutdown continues, Democrats are trying to press Republicans to extend COVID-era tax subsidies for health care under the Affordable Care Act.Tammy Nelms (ph) from Chesapeake, Virginia, is a registered nurse, and she says Democrats face a tough choice right now.TAMMY NELMS: If they give in to say, OK, we're going to open the government. And then the price of health care is going to rise and hurt millions of people. So, you know, it seems like it's either way. It's just not a good choice.MCCAMMON: Her husband, Wade Nelms, says he supports Democrats, but he thinks the party overall is struggling to find its way forward.WADE NELMS: Even though if you don't like the Republican leader, they've got a direction. They've got a very clear direction. It may not be the direction that we like. Ours just seems to be kind of fractioned. Nationally, I just don't see a big leader step up and say, here's what we're going to do. Here's how we're going to combat all the bad things that are happening right now, and someone that we can follow and join.MCCAMMON: The Democratic Party will face one of its first major tests of Trump's second term when voters in Virginia and a handful of other places wrap up voting on Tuesday.Sarah McCammon, NPR News, Norfolk, Virginia.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former President Obama is rallying support for Democrats in local races",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-02T13:13:31.000Z",
      "dateModified": "2025-11-02T13:13:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mamdani's youth support goes beyond New York. For many, he's now a national leader",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5531004/zohran-mamdani-new-york-young-voters",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5747x3233+0+299/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2F65%2Fe7ad479147e5af02fdf4191b9f4c%2Fgettyimages-2243206439.jpg",
    "tag": "Politics",
    "date": "2025-11-02T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                New York City mayoral candidate Zohran M",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                New York City mayoral candidate Zohran Mamdani waves during a campaign rally at Forest Hills Stadium in New York City.\n                \n                    Angela Weiss/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Angela Weiss/AFP via Getty Images\n    \n\n   \n   It's been years since Democratic voter Lea Ash felt hopeful about a politician, but that changed recently.   \"He's been really the only bright spot for me this year,\" she said. \"[He] wants to listen to the people he's seeking to govern.\"   The 26-year-old is referring to Zohran Mamdani, the Democratic nominee for mayor of New York, who has centered his campaign on affordability concerns. For that reason, he easily has Ash's vote — if only she lived in the city he was running in. Instead, she lives more than 1,200 miles away.   \"I would like to believe one day there could be a Zohran Mamdani for Gulfport, Miss., but I don't think that's ever going to happen, at least not in my lifetime,\" Ash said, acknowledging her state's deep conservative roots. \"But it gives me hope that it can happen in other places across the country.\"   \n   In just a few months, Mamdani, a 34-year-old state assemblyman and Democratic Socialist, has gone from a long-shot fringe candidate to a national figure — securing an upset win in the June primary, where voters 18-29 had the highest turnout of any age group.    \n   Now, on the cusp of Election Day — where polls show him the clear frontrunner over his closest rival, former New York Gov. Andrew Cuomo — Mamdani is counting on that youth coalition to show up again. But his pledge to address rising costs appears to be resonating with young people far outside of the five boroughs. It's a message that many Gen Z and millennials say speaks to their most pressing concerns at a time when many feel hopeless about their leaders and yearn for new voices willing to break with political norms.   \"When a candidate is able to speak to the concerns of the populace and validate those concerns … I think that that has a big impact, especially when it comes to young people,\" said Ruby Belle Booth, who studies young voters for the nonpartisan research organization CIRCLE.   \"They really feel heard and like they're being respected,\" she added. \"I think any candidate can do that and have success. But right now it's Mamdani and maybe before that, it was [President] Trump.\"   \n   A local movement for Mamdani has gone national   Despite living in ruby red Mississippi, Ash says she's always voted for Democrats. However, in recent years, she's grown frustrated and ignored by political leaders.   It's a feeling exacerbated by her own economic situation. The pandemic cut her college experience short, and she struggled to find work, forcing her to move back home. Now, years later, even with a job, she's unable to afford her own place.   \n   Giving up on that goal, she says, was a hard pill to swallow.   \"When [my mom] was in her twenties, she was married, and she and my dad owned a house by this point, and I can't even afford to rent in a city in Mississippi,\" she said, adding that she's seen housing prices increase despite the state having one of the highest poverty rates in the country. \"It's a little demoralizing.\"   But Ash hopes, if Mamdani wins, it'll send a message to Democrats in other cities around the country to take issues like housing affordability more seriously.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Zohran Mamdani sits with attendees to watch \"The Cost of Living Classic\" soccer tournament on October 19, 2025 in New York City.\n                \n                    Angela Weiss/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Angela Weiss/AFP via Getty Images\n    \n\n   \n   A focus on the economy and breaking the status quo    Mamdani has campaigned on a slew of promises, particularly around housing — notably, he's vowing to freeze the rent for rent-stabilized units and build 200,000 new apartments for low and middle-income New Yorkers. Those proposals are part of his larger, ambitious platform aimed at cutting prices, ranging from creating city-run grocery stores to making city buses and childcare free.   His critics on the left say these ideas are unrealistic — even in a liberal bastion like New York City. Among conservatives, including Trump, Mamdani's views have been characterized as extreme or dangerous.   Those warnings, however, don't seem to be fazing many young Americans, who appear most drawn to his message over any political label from either Democrats or the GOP.   \n   \"Mamdani is this candidate who is actively challenging the status quo in a lot of ways rather than representing it,\" said Booth.   She points to a CIRCLE survey from this spring that found that just 16% of those under 30 believe Democracy is working for them, which Booth argues isn't indicative that these voters are thrilled by politics as usual.   Although they hold vastly different ideologies, Booth argues Trump tapped into a similar anti-establishment mentality last year. Economic concerns were the top issue for those 18-29 last fall, and voters who prioritized the economy were also more likely to vote for the president, according to a CIRCLE analysis of 2024 AP VoteCast data.   \"I think that young people, we've seen, are not really thinking about politics in terms of those two parties and are evaluating it more in terms of the issues that they really care about,\" Booth said.   \n   Affordability concerns should cross party lines, argues 26-year-old Democrat Emily Wilson. Based in St. Petersburg, Fla., she's also supporting Mamdani from afar, and says she often talks politics with her colleagues at the spa where they work.   \"Grocery prices and bus prices and rent prices, these are issues affecting both Democrats and Republicans,\" Wilson said.   Though she acknowledges that some people could see Mamdani's candidacy as too radical outside of New York, she argues that a similar economic message could be effective when delivered by a candidate who knows the community.   \"I think if a Floridian or a Texan were to talk about the same issues that Zohran [is talking about], I think he would have the same appeal,\" she said.   Up north in a small town near Ann Arbor, Mich., Daisy Lupa, 25, feels similarly. As someone who has begrudgingly backed national Democrats in recent years, she says Mamdani's campaign is refreshing, and believes many of his proposals could help communities like hers.   \n   \"I think that a lot of stuff that he is trying to push forward in New York … are things that we need even more in rural areas and even more in the Midwest because we don't have it at all,\" she said.   \"It's flawed in New York,\" she added. \"It's absent here.\"   Cautious optimism   Of course, a central question for those who actually can vote in the New York mayor's race is whether Mamdani can truly solve the affordability crisis.   \n   For Dillon Robertson, 32, money is a constant worry. He commutes to college in Connecticut and will graduate with close to $250,000 in student loans. He's supporting Mamdani and says many of his cost-saving proposals could make his life easier, but at the same time, he worries if it's all possible.   \"A lot of the stuff he says sounds nice. But I both wonder, can he do it? Can he pull it off?\" he said. \"Or [is] it just kind of like a Band-Aid on a leaky ship?\"   Still, he admits, if the options are to keep plodding along or try something new, he's ready to give it a shot.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mamdani's youth support goes beyond New York. For many, he's now a national leader",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5747x3233+0+299/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2F65%2Fe7ad479147e5af02fdf4191b9f4c%2Fgettyimages-2243206439.jpg"
      ],
      "datePublished": "2025-11-02T09:00:00.000Z",
      "dateModified": "2025-11-02T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens military action in Nigeria over Christian persecution claims",
    "url": "https://www.npr.org/2025/11/01/g-s1-96215/trump-nigeria-christian-persecution-claims",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3538x1990+0+184/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fed%2F8d%2F53e77d2143afbec7410ca45891c3%2Fap25305652778762.jpg",
    "tag": "Politics",
    "date": "2025-11-02T00:39:33.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Nigerian President Bola Ahmed Tinubu att",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Nigerian President Bola Ahmed Tinubu attends an ECOWAS meeting in Abuja, Nigeria, on June 22, 2025.\n                \n                    Olamikan Gbemiga/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Olamikan Gbemiga/AP\n    \n\n   \n   ABUJA, Nigeria — U.S. President Donald Trump on Saturday said he's ordered the Pentagon to begin planning for potential military action in Nigeria as he stepped up his allegations that the government is failing to rein in the persecution of Christians in the West African country.   The president also warned that he \"will immediately stop all aid and assistance to Nigeria.\"   \"If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, 'guns-a-blazing,' to completely wipe out the Islamic Terrorists who are committing these horrible atrocities,\" Trump posted on social media. \"I am hereby instructing our Department of War to prepare for possible action. If we attack, it will be fast, vicious, and sweet, just like the terrorist thugs attack our CHERISHED Christians!\"   \n   The warning came after Nigeria's President Bola Ahmed Tinubu earlier on Saturday pushed back on Trump announcing a day earlier that he was designating the West African country \"a country of particular concern\" for allegedly failing to rein in the persecution of Christians.   In a social media statement on Saturday, Tinubu said that the characterization of Nigeria as a religiously intolerant country does not reflect the national reality.   \"Religious freedom and tolerance have been a core tenet of our collective identity and shall always remain so,\" Tinubu said. \"Nigeria opposes religious persecution and does not encourage it. Nigeria is a country with constitutional guarantees to protect citizens of all faiths.\"   Trump on Friday said \"Christianity is facing an existential threat in Nigeria\" and \"radical Islamists are responsible for this mass slaughter.\"   Trump's comment came weeks after U.S. Sen. Ted Cruz urged Congress to designate Africa's most populous country as a violator of religious freedom with claims of \"Christian mass murder.\"   Nigeria's population of 220 million is split almost equally between Christians and Muslims. The country has long faced insecurity from various fronts including the Boko Haram extremist group, which seeks to establish its radical interpretation of Islamic law and has also targeted Muslims it deems not Muslim enough.   \n   Attacks in Nigeria have varying motives. There are religiously motivated ones targeting both Christians and Muslims, clashes between farmers and herders over dwindling resources, communal rivalries, secessionist groups and ethnic clashes.   While Christians are among those targeted, analysts say the majority of victims of armed groups are Muslims in Nigeria's Muslim-majority north, where most attacks occur.   Kimiebi Ebienfa, a spokesperson for the Ministry of Foreign Affairs, reiterated the commitment of Nigeria to protect citizens of all religions.   \"The Federal Government of Nigeria will continue to defend all citizens, irrespective of race, creed, or religion,\" Ebienfa said in a statement on Saturday. \"Like America, Nigeria has no option but to celebrate the diversity that is our greatest strength.\"   Nigeria was placed on the country of particular concern list by the U.S. for the first time in 2020 over what the State Department called \"systematic violations of religious freedom.\" The designation, which did not single out attacks on Christians, was lifted in 2023 in what observers saw as a way to improve ties between the countries ahead of then-Secretary of State Antony Blinken's visit.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens military action in Nigeria over Christian persecution claims",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3538x1990+0+184/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fed%2F8d%2F53e77d2143afbec7410ca45891c3%2Fap25305652778762.jpg"
      ],
      "datePublished": "2025-11-02T00:39:33.000Z",
      "dateModified": "2025-11-02T00:39:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Jersey and Virginia's races will be powered by the soaring cost of electricity",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5591133/new-jersey-and-virginias-races-will-be-powered-by-the-soaring-cost-of-electricity",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-02T13:53:20.000Z",
    "description": "\n      \n      New Jersey and Virginia's races will be powered by the soaring cost of electricity\n    \n            \n                \n                Tr",
    "body": "\n      \n      New Jersey and Virginia's races will be powered by the soaring cost of electricity\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5591133/nx-s1-9516058\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      New Jersey and Virginia have seen double-digit electricity rate hikes in the last year as voters in those states prepare to choose new governors.   \n\n    AYESHA RASCOE, HOST:  Voters in New Jersey and Virginia go to the polls this week to choose new governors. One of the issues that's electrified those contests is the soaring cost of electricity. Both states have seen double-digit power price increases in the last year, and voters are frustrated. NPR's Scott Horsley joins us now to tell us more.SCOTT HORSLEY, BYLINE: Good morning, Ayesha.RASCOE: So how did electricity become such a hot-button issue on the campaign trail this year?HORSLEY: Well, around the country, we have seen power prices climbing faster than the overall cost of living, and that is a problem that politicians ignore at their peril. You know, I lived in California a quarter century ago when anger about both the cost and availability of electricity drove Governor Gray Davis out of office and opened the door for a governor named Arnold Schwarzenegger. So the price hikes in Virginia and especially New Jersey have been particularly large. You know, the cost of electricity for residential customers in New Jersey has jumped about 21% in the last year. Dan Cassino, who runs a political poll at Fairleigh Dickinson University in New Jersey, says that just adds to perennial concerns about the high cost of living in that state.DAN CASSINO: Sometimes, in affordability, we're talking about property taxes. Sometimes we're talking about housing prices. Sometimes we're talking about groceries. But we're always talking about affordability, and electricity is just now the new way to talk about affordability.HORSLEY: Now, electricity is still a relatively small part of a typical family's budget - about 2.5% on average. But when so many other things are also getting more expensive, a big power bill can really be a pain.RASCOE: What's driving these price increases?HORSLEY: Well, as usual, it's a mix of supply and demand. Both New Jersey and Virginia are part of a mid-Atlantic power grid that has retired some of its old fossil fuel power plants and has been slower than some other parts of the country to add new clean energy sources. At the same time, we have seen a burst of new demand for electricity in those states from all the new data centers that have sprung up as part of the artificial intelligence boom. So it's a complicated puzzle. Cassino says it can be kind of a Rorschach test for voters who are just angry about their rising power bills.CASSINO: The problem is voters don't understand why this is happening. They just blame whoever it is that they don't like. So Democrats say, oh, it's Donald Trump, or they blame greedy electric companies. Republicans say, well, it's the Democrats. So everyone's just blaming whoever they don't like for it.HORSLEY: In New Jersey, the incumbent governor is a Democrat. In Virginia, the incumbent is a Republican. Neither of them is on the ballot, but the candidates from both parties who hope to replace them are being asked how they plan to tackle this problem.RASCOE: These off-year governors' races are often seen as a dress rehearsal for issues that later go national. Are electricity prices going to be a factor in other parts of the country in next year's elections?HORSLEY: They could be. You know, other states are wrestling with some of these same challenges, although most parts of the country are not seeing double-digit price hikes like New Jersey and Virginia are. Nationally, demand for electricity is growing faster now than it did for most of the last two decades. At the same time, the Trump administration has taken steps to limit new solar and wind generation. And natural gas, which is the No. 1 source of electric power generation in the country, is getting more expensive, partly because we are exporting more of our natural gas. Now, Cassino says voters may or may not sift through all those details. But if they're unhappy about their electric bills and the overall cost of living, that could be a factor in the voting booth next year.CASSINO: People feel helpless. It almost doesn't matter if the helplessness comes from the electricity rates or from the rent going up or from inflation. When voters feel helpless, they're going to blame somebody. And if you are that somebody, it is a bad time to be an incumbent.HORSLEY: We saw that around the world last year when politicians on the left and the right were punished because people were unhappy with the high cost of living.RASCOE: That's NPR's Scott Horsley. Thank you so much for joining us.HORSLEY: Good to be with you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Jersey and Virginia's races will be powered by the soaring cost of electricity",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-02T13:53:20.000Z",
      "dateModified": "2025-11-02T13:53:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump is leaning into his crackdown on city crime. The GOP sees it as a winning issue",
    "url": "https://www.npr.org/2025/11/02/nx-s1-5588904/trump-national-guard",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7279x4094+0+379/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc9%2Ff2%2Fbbc7c70f489c9d6bbd30220df6a3%2Fgettyimages-2239319384-1.jpg",
    "tag": "Politics",
    "date": "2025-11-02T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the National Guard walk past ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the National Guard walk past the Department of Agriculture headquarters building on Oct. 7 in Washington, D.C.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   President Trump threatened to deploy more troops to U.S. cities this week — and not just the National Guard — as part of what he describes as his national crackdown on crime.   Speaking to U.S. troops aboard an aircraft carrier in Japan, Trump said he planned to expand his crime and immigration offensive because \"we have cities in trouble.\"   \"We're sending in our National Guard, and if we need more than the National Guard, we'll send more than the National Guard, because we're going to have safe cities,\" Trump said, aboard the USS George Washington at the Yokosuka Naval Base. \"We're not going to have people killed in our cities. And whether people like that or not, that's what we're doing.\"   \n   The White House has transformed what started as a focused effort, purportedly meant to address crime in Washington, D.C. into a nationwide campaign to portray Trump and the Republicans as unabashed crime fighters while painting Democrats as coddlers of crime. Violent crime in the city was at a 30-year low prior to the Guard's arrival.   Trump has also deployed troops to Los Angeles, Chicago, Memphis, Tenn., and Portland, Ore, which has triggered protests and lawsuits.   Democratic leaders have accused the White House of exaggerating the challenges in order to launch an illegal military occupation. But Trump is banking on the moves helping him and Republicans in next year's midterms.   At a cabinet meeting in August, Trump called crime a stronger issue for Republicans to run on than transgender athletes in school sports and possibly even immigration.   \"Crime is probably the issue that he fares best on, certainly better than handling inflation or trade or even international relations, despite some of the successes that he's had recently,\" said Jon McHenry, a Republican pollster with North Star Opinion Research.   Political data points to a clear opportunity for Trump and the Republicans.   Though FBI data show that violent crime decreased by 4.5 percent last year, a new Gallup poll released Thursday shows almost half of Americans — 49 percent — feel that crime has risen from last year — while about a third — or 33 percent — feel crime has gone down.   \n   The Gallup poll also reveals some political risks for Trump. More Americans oppose using federal troops to combat domestic crime than support the move — but the divide is largely along political lines, as Republicans overwhelmingly support the use of troops while Democrats are opposed.   \n   Crime shouldn't be looked at through a partisan lens, but Trump has tapped into one of the most basic quality of life issues, said Jillian Snider, a member of the Council on Criminal Justice and retired New York police officer.   She said most people do not look online to see if crime is up or down. They instead walk down the street.   \"That is the real problem here, that general community members, they don't care as much to be schooled by what the stats show us,\" said Snider, who also teaches at John Jay College of Criminal Justice. \"They just care about how they feel in their communities.\"   Republicans have long leaned into law and order, but veteran political strategist Alex Conant says Trump embraces the issue in an unprecedented way when you look at troops in cities.   \"He told his base he was going to get crime in American cities under control. And now, when you turn on the TV at night, U.S. troops are trying to do exactly that,\" Conant said. \"Now, obviously, there's going to be a lot of opposition to it, especially amongst Democrats, people who live in some of those neighborhoods. But this is what he told his base he would do, and now he's delivering it. And, he's proud of it.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump is leaning into his crackdown on city crime. The GOP sees it as a winning issue",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7279x4094+0+379/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc9%2Ff2%2Fbbc7c70f489c9d6bbd30220df6a3%2Fgettyimages-2239319384-1.jpg"
      ],
      "datePublished": "2025-11-02T09:00:00.000Z",
      "dateModified": "2025-11-02T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]