[
  {
    "title": "Available to download Friday, some Epstein files no longer there Saturday afternoon",
    "url": "https://www.npr.org/2025/12/20/nx-s1-5650758/epstein-files-doj-trump-photo",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F37%2F5c%2F54f58a864e8695b0c2aef5362549%2Fgettyimages-2252049747.jpg",
    "tag": "Politics",
    "date": "2025-12-20T19:57:48.000Z",
    "description": "\n      \n      Epstein Library files disappear from DOJ site after initial release\n    \n        \n                Download\n                \n            ",
    "body": "\n      \n      Epstein Library files disappear from DOJ site after initial release\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5650758/nx-s1-9580929\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Robert F. Kennedy Department of Justice Building on Dec. 19, 2025 in Washington, DC.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   The Department of Justice started releasing files related to the life, death and criminal investigations of convicted sex offender Jeffrey Epstein Friday. Files continued to be posted on its \"Epstein Library\" website on Saturday.    But NPR identified more than a dozen files released by the DOJ on Friday that are no longer available Saturday afternoon, including one that shows President Trump's photo on a desk among several other photographs. The removed files also show various works of art, including those containing nudity.    On its website, the Justice Department directs people to report any files that should not have been posted by notifying the agency using a dedicated email address. A statement at the top of each page of the website said: \"In view of the Congressional deadline, all reasonable efforts have been made to review and redact personal information pertaining to victims, other private individuals, and protect sensitive materials from disclosure.\"   \n   The DOJ acknowledged, though, \"because of the volume of information involved, this website may nevertheless contain information that inadvertently includes non-public personally identifiable information or other sensitive content, to include matters of a sexual nature.\"   The DOJ did not immediately respond to a request for comment on why the files were no longer available.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This photo illustration taken in Washington, DC, on Dec. 19, 2025 shows a court document after the Justice Department began releasing the long-awaited records from the investigation into the politically explosive case of convicted sex offender Jeffrey Epstein.\n                \n                    Mandel Ngan/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mandel Ngan/AFP via Getty Images\n    \n\n   \n   After the initial release of files, some members of Congress raised concerns about what was missing from the data sets.   \"There are powerful men, bankers, politicians who we know from survivors - they've told us this — who were at these parties where there were many young women, and a few were under age, and these powerful men knew about it, and they didn't say anything,\" Rep. Ro Khanna, D-Calif., told NPR. They need to be at least publicly held accountable.\"   Rep. Thomas Massie, R-Ky., who cosponsored the Epstein Transparency Act in the House along with Khanna, criticized the redactions.    Posting on X, he said the release \"grossly fails to comply with both the spirit and the letter of the law.\" He also warned \"a future DOJ could convict the current [Attorney General] and others\" for not properly releasing all files the law mandated be made public.   \n   Apart from the photo that is no longer available to download, Trump's name and image appears rarely in the new documents available. There are a few pictures of him with women and a framed photo of Epstein and a redacted woman with a $22,500 oversized check signed by Trump.   While Trump wasn't mentioned much this time around, he was a frequent subject of emails and text messages in another Epstein file tranche released by the House Democratic Oversight Committee — with well over a thousand different mentions — though mainly as the subject of Epstein's near-obsession with his presidency, as the latter positioned himself as a Trump whisperer of sorts to his powerful associates.   NPR's Rahul Mukherjee and Stephen Fowler contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Available to download Friday, some Epstein files no longer there Saturday afternoon",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F37%2F5c%2F54f58a864e8695b0c2aef5362549%2Fgettyimages-2252049747.jpg"
      ],
      "datePublished": "2025-12-20T19:57:48.000Z",
      "dateModified": "2025-12-20T19:57:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Carolina's Lumbee Tribe receives full federal recognition after 137-year effort",
    "url": "https://www.npr.org/2025/12/20/g-s1-103223/lumbee-tribe-federal-recognition-137-years",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5542x3117+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc3%2Fb1%2Fbcc35d944cd3947874c7e8be49a5%2Flumbee-recognition.jpg",
    "tag": "Politics",
    "date": "2025-12-20T20:57:24.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                John Lowery, chairman of the Lumbee Trib",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                John Lowery, chairman of the Lumbee Tribe of North Carolina and a state representative (center) is comforted, as he cries tears of joy. Lowery and other members of the tribe gathered in Washington, D.C., to mark the passage of a bill granting full federal recognition on Wednesday.\n                \n                    Jacquelyn Martin/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jacquelyn Martin/AP\n    \n\n   \n   After a 137-year struggle, the Lumbee Tribe of North Carolina has finally received full federal recognition from the U.S. government.    Members of the Native American tribe shed tears as it reached the historic milestone in Washington, D.C., this week. Tribal Chairman John L. Lowery witnessed President Trump sign the bill that extended acknowledgment to the tribe at the White House on Thursday.   \"I'm so thankful today for everyone who has helped us along this way — everyone from our ancestors from the late 1880s all the way up to present day. So many people have been a part of this fight,\" Lowery said in a video posted to the tribe's social media accounts.   \n   Federal lawmakers included the Lumbee Fairness Act in the $900 billion annual military spending package.   The Lumbee Tribe of North Carolina has 55,000 members. The tribal territory is located in the southeastern part of the state in Robeson, Hoke, Cumberland, and Scotland Counties.   Federal recognition opens the door to an expanse of federal resources for tribes. Federally recognized tribes are eligible to receive federal funding from the Bureau of Indian Affairs (BIA). Benefits include support for housing, education and health care.   \"I do believe that the biggest benefit we're going to receive as a tribe is Indian Health Services,\" Lowery said during a press conference Friday. \"For our people who do not have health care insurance, or our people who have high health care insurance, they will be able to work through Indian Health Services to get services provided to them.\"   \n   In 2022, after the measure was introduced in the House, the Congressional Budget Office estimated the federal government would spend nearly $250 million in providing health benefits to Lumbee Tribe members over four years through the Indian Health Service.   Federally recognized tribes hold certain rights to self-governance. The designation expands tribal control over economic development by authorizing the BIA to take land into trust for the benefit of the tribe.   The Lumbee first petitioned Congress for federal recognition in 1888. The tribe then only received partial recognition in 1956.   \n   North Carolina Gov. Josh Stein applauded this week's milestone. \"The state has long recognized the Lumbee Tribe,\" he said in a news release. \"Full federal recognition will allow members access to the federal health care, education, housing, child care, and disaster relief benefits afforded other federally recognized tribes. These benefits will in turn create economic opportunities for the Tribe and the surrounding community.\"   Sen. Thom Tillis, R-N.C., sponsored the bipartisan Lumbee Fairness Act in the upper chamber. He credited Trump in a statement, calling the designation long overdue for the Lumbee people.   \n   He said \"a historic injustice has been corrected, and the Lumbee people can finally access the full federal benefits they have long earned and deserve.\"   Trump issued a memo in January directing the Interior Department to develop a plan to assist the tribe in obtaining full federal recognition.   The Eastern Band of Cherokee Indians opposed the recognition. Tribal leaders said the Lumbee circumvented proper federal eligibility procedures that require historical evidence of Native heritage. The Eastern Band of Cherokee Indians had been the only federally recognized Native American tribe in North Carolina. The Lumbee is now the 575th federally recognized tribe in the United States.   \"I know with every fiber of my being that our ancestors are smiling down on us today,\" Lowery said in a statement as the bill was headed to Trump's desk. \"After decades of waiting, praying, and fighting, our Tribe has finally crossed a barrier that once seemed impossible to overcome.\"   \n   More than a dozen tribes from several states are listed online as petitioning the Interior Department for federal acknowledgment. The Office of Federal Acknowledgement website says decisions are based on factors that include anthropological, genealogical, and historical research.   The Department has denied petitions that it deems fail to meet its seven-part criteria that define an Indian tribe under federal law. The requirements include that \"the petitioner comprises a distinct community and demonstrates that it existed as a community from 1900 until the present.\"   \n   Petitioners may wait decades for a resolution.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Carolina's Lumbee Tribe receives full federal recognition after 137-year effort",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5542x3117+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc3%2Fb1%2Fbcc35d944cd3947874c7e8be49a5%2Flumbee-recognition.jpg"
      ],
      "datePublished": "2025-12-20T20:57:24.000Z",
      "dateModified": "2025-12-20T20:57:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple, Google tell workers on visas to avoid leaving the U.S. amid Trump immigration crackdown",
    "url": "https://www.npr.org/2025/12/20/nx-s1-5650775/apple-google-visa-immigration-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5412x3044+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5e%2Fcd%2F481e64bb45a084e74be333ac5273%2Fgettyimages-2226698940-2.jpg",
    "tag": "Politics",
    "date": "2025-12-21T00:03:04.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                With reported months-long consulate and ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                With reported months-long consulate and embassy delays, Google and Apple say employees on H-1B visas should stay put in the U.S. right now to avoid the risk of getting stranded abroad. The latter tech company's headquarters campus is seen in Mountain View, Calif.\n                \n                    Justin Sullivan/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Justin Sullivan/Getty Images\n    \n\n   \n   Apple and Google are warning some U.S-based employees on visas against traveling outside of the country to avoid the risk of getting stuck coming back, as the Trump administration toughens vetting of visa applicants, according to recent internal memos from the tech companies that were reviewed by NPR.   U.S. consulates and embassies have been reporting lengthy, sometimes months-long delays, for visa appointments following new rules from the Department of Homeland Security requiring travelers to undergo a screening of up to five years' of their social media history — a move criticized by free speech advocates as a privacy invasion.   \n   For Apple and Google, which together employ more than 300,000 employees and rely heavily on highly-skilled foreign workers, the increased vetting and reports of extended delays were enough for the companies to tell some of their staff to stay in the U.S. if they are able to avoid foreign travel.   \"We recommend avoiding international travel at this time as you risk an extended stay outside of the U.S.,\" Berry Appleman & Leiden, a law firm that works with Google, wrote to employees.   \n   The law firm Fragomen, which works with Apple, wrote a similar message: \"Given the recent updates and the possibility of unpredictable, extended delays when returning to the U.S., we strongly recommend that employees without a valid H-1B visa stamp avoid international travel for now,\" the memo read. \"If travel cannot be postponed, employees should connect with Apple Immigration and Fragomen in advance to discuss the risks.\"   Apple and Google declined to comment on the advisories, which were first reported by Business Insider.   \n   It's the latest sign of how the Trump administration's aggressive immigration policies are affecting the foreign-born workforce in the U.S.   Earlier this year, the White House announced that companies will be subjected to a $100,000 fee for all new H-1B visas, a type of visa popular among tech companies eager to hire highly skilled workers from abroad.   H-1Bs typically last three years, and applicants have to return to an embassy or consulate in their home country for a renewal, but reports suggest such a routine trip could lead to people being stranded for months as a result of the Trump administration's new policies.   \n   On Friday, The Washington Post reported that hundreds of visa holders who traveled to India to renew their H-1Bs had their appointments postponed with the State Department explaining that officials needed more time to ensure that no applicants \"pose a threat to U.S. national security or public safety.\"   At Google, the Alphabet Workers' Union has been campaigning for additional protections for workers on H-1B visas. Those workers would be particularly vulnerable in the event Google carried out layoffs, since losing employer sponsorship could jeopardize their legal status, said Google software engineer Parul Koul, who leads the union.   The need to support H-1B holders at Google, she said, has \"only become more urgent with all the scrutiny and heightened vetting by the Trump administration around the H1B program, and how the administration is coming for all other types of immigrant workers.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple, Google tell workers on visas to avoid leaving the U.S. amid Trump immigration crackdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5412x3044+0+353/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5e%2Fcd%2F481e64bb45a084e74be333ac5273%2Fgettyimages-2226698940-2.jpg"
      ],
      "datePublished": "2025-12-21T00:03:04.000Z",
      "dateModified": "2025-12-21T00:03:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ releases Epstein files and the first batch is short on new information",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5615152/epstein-files-release-trump-pam-bondi-democrats",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1d%2Fa4%2F3b45080d4eebbe1e5183d165aa81%2Fgettyimages-590696434.jpg",
    "tag": "Politics",
    "date": "2025-12-19T21:04:15.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein and Ghislaine Maxwell in",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein and Ghislaine Maxwell in 2005.\n                \n                    Joe Schildhorn/Patrick McMullan/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Schildhorn/Patrick McMullan/Getty Images\n    \n\n   \n   The Justice Department has released a trove of documents related to the life, death and criminal investigation of convicted sex offender Jeffrey Epstein, including many that have already been made public from prior disclosures. Others are filled with heavy redactions.    Among the new, previously unseen files released Friday were several photos of former President Bill Clinton, including one of him in a hot tub with a person whose face has been redacted. Another shows Clinton standing next to Epstein. Clinton is also pictured at an event with rock star Mick Jagger and a female whose face has been redacted.    \n   Some of the most sought after information was redacted, including 119 pages of New York grand jury testimony. Rep. Ro Khanna, D-Calif., who co-sponsored the Epstein Files Transparency Act,  which legally required the files be released, expressed disappointment with the contents during an NPR interview with Mary Louise Kelly on All Things Considered Friday.   Khanna said the drop didn't contain the files he was looking for, stating the release \"seems at very best incomplete.\"   \"There's a draft indictment of the first Jeffrey Epstein case that really implicates other rich and powerful men who knew about the abuse or participated in it. That indictment should be released,\" Khanna said when Mary Louise Kelly asked what he still needed to see. \"There are witness interviews between the FBI and other people who were accused of being at Jeffrey Epstein's rape island or going to parties where there were 16 and 17-year-old girls being paraded around, those witness memorandums need to be released.\"   \n   On Friday morning, Deputy Attorney General Todd Blanche suggested in an interview with Fox News that \"several hundred thousand\" pages would be released on Friday, with more to follow.    Khanna said he would like an explanation from Blanche about where the missing documents are and what the DOJ's timeline is to make them public.    Politics at play   The release of the Epstein files is the latest development in a political saga that has dogged President Trump's second term in office and caused bipartisan backlash against Trump's conflicting and shifting commentary on the subject.   \n   Trump amplified conspiracy theories about the files relating to his onetime friend Epstein on the campaign trail, vowing to publicize information about the financier's crimes and ties to powerful people that he alleged was being covered up by the government.   \n   After he returned to the White House, Trump fought efforts by lawmakers and his supporters to release those files, calling Republicans who demanded transparency \"stupid\" and blaming Democrats for pushing a \"hoax\" before ultimately signing a law that was passed with near unanimous support.   The Epstein Files Transparency Act gave Attorney General Pam Bondi 30 days to publish \"all unclassified records, documents, communications, and investigative materials\" about Epstein available in a searchable and downloadable format.    The law also directed the Justice Department to share documents related to Epstein's accomplice Ghislaine Maxwell and \"individuals named or referenced in connection with Epstein's criminal activities,\" information regarding plea deals and decisions not to charge Epstein for other alleged crimes, as well as records pertaining to his 2019 death by suicide in federal custody.   Over the summer, the FBI put out a memo that said their files include \"a significant amount of material, including more than 300 gigabytes of data and physical evidence.\"   Some of that includes photos and videos of Epstein's accusers, including minors, and disturbing material that will not be made public. The bill from Congress also says anything \"that would jeopardize an active federal investigation or ongoing prosecution\" can be withheld or redacted, too.   \n   Trump called on the Justice Department to investigate some Democrats and institutions he said were complicit in Epstein's crimes or mentioned in other documents made public, including tens of thousands of emails and private files turned over to the House Oversight committee under subpoena, FBI records and numerous court cases over the years.   \"I will be asking A.G. Pam Bondi, and the Department of Justice, together with our great patriots at the FBI, to investigate Jeffrey Epstein's involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase, and many other people and institutions, to determine what was going on with them, and him,\" Trump wrote on Truth Social in November.   \n   In a separate Truth Social post announcing his signing of the Epstein Files Transparency Act, Trump said Democrats were using the issue to distract from what he says are victories for his administration.   \"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he posted.   The president had the authority to release the files without congressional action.   Thousands of pages are already public   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jeffrey Epstein in Cambridge, Mass. in September 2004.\n                \n                    Rick Friedman/Corbis/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rick Friedman/Corbis/Getty Images\n    \n\n   \n   Friday's release of Justice Department files joins tens of thousands of other records made public over the years, including court cases, government document dumps and subpoenas from Congress.   Spread throughout roughly 23,000 documents released by the House Oversight Committee in early November, emails and texts revealed a list of powerful people in politics, academia and business that sought his counsel and friendship in the years after he pleaded guilty to state charges of solicitation of prostitution and of solicitation of prostitution with a minor under the age of 18 in 2008.   The people who consulted with Epstein in those documents rarely acknowledged the severity of the crimes that required him to register as a sex offender, though simply corresponding with Epstein does not implicate individuals in his criminal activities, convicted or accused.   \n   There's an apparent letter of recommendation for Epstein from linguist Noam Chomsky, calling him a \"highly valued friend,\" that recalled how Epstein connected him with former Israeli Prime Minister Ehud Barak — another frequent Epstein correspondent.   \"Jeffrey constantly raises searching questions and puts forth provocative ideas, which have repeatedly led me to rethink crucial issues,\" the letter reads.   There's advice Epstein gave to Steve Bannon, Trump's former strategist, about ways to build a far-right political movement overseas.   \"If you are going to play here, you'll have to spend time, [E]urope by remote doesn't work,\" Epstein wrote in 2018. \"Lots and lots of face time and hand holding. Europe can be a wife not a mistress.\"   \n   Former Harvard University president and onetime Treasury Secretary Larry Summers is documented numerous times having intimate personal chats with Epstein, including asking for romantic advice and joking about women's intelligence.   \"I yipped about inclusion,\" wrote Summers in 2017. \"I observed that half the IQ [in the] world was possessed by women without mentioning they are more than 51 percent of population....\"   In the weeks since the latest Epstein emails release, he has resigned from the board of OpenAI and abruptly left his teaching role at Harvard, as the university announced a probe of \"information concerning individuals at Harvard included in the newly released Jeffrey Epstein documents to evaluate what actions may be warranted.\"   Summers isn't the only high-profile Democrat who found himself in Epstein's orbit. Kathryn Ruemmler, former White House counsel in the Obama administration and current chief legal officer for Goldman Sachs, messaged with Epstein before and during Trump's first term.   \"Trump is living proof of the adage that it is better to be lucky than smart,\" she wrote in August 2015.   \"I regret ever knowing Jeffrey Epstein,\" Ruemmler told the Wall Street Journal in 2023.   Trump's name appears repeatedly   Trump's name is virtually non-existent in the recent batch of files. There are a few pictures of him with women and the framed photo of Epstein and a redacted woman with a $22,500 oversized check signed by Trump.   While Trump wasn't mentioned much this time around, he was a frequent subject of emails and text messages in another Epstein file tranche released by the House Democratic Oversight Committee — well over a thousand different mentions — though mainly the subject of Epstein's near-obsession with his presidency, as the latter positioned himself as a Trump whisperer of sorts to his powerful associates.   In one 2015 email between Epstein and author Michael Wolff, the pair discuss a potential question from an upcoming CNN appearance about Trump and Epstein's personal ties.   \n   \"I think you should let him hang himself,\" Wolff wrote. \"If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.\"   Another email Epstein sent in 2011 to Ghislaine Maxwell, his associate who has been convicted on trafficking charges, called Trump the \"dog that hasn't barked\" and says Trump spent \"hours at my house\" with one of the alleged sex trafficking victims.   Still another is a 2019 message between Epstein and Wolff in which the disgraced financier wrote that \"of course [Trump] knew about the girls as he asked Ghislaine to stop.\" The email does not elaborate any further.   \"I have met some very bad people, none as bad as Trump,\" Epstein wrote in 2017 to Summers. \"Not one decent cell in his body.\"   In September, House Democrats released more than 200 pages of a birthday book for Epstein created more than two decades ago that includes a lewd drawing and letter that appears to be signed by Trump.   The president, who has consistently denied any meaningful connection to Epstein, called the drawing and signature \"fake.\"   In July, Trump told reporters that he and Epstein fell out because Epstein hired away young female employees who worked at the spa at Mar-a-Lago.   Anusha Mathur contributed to this reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ releases Epstein files and the first batch is short on new information",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1d%2Fa4%2F3b45080d4eebbe1e5183d165aa81%2Fgettyimages-590696434.jpg"
      ],
      "datePublished": "2025-12-19T21:04:15.000Z",
      "dateModified": "2025-12-19T21:04:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Special elections ordered for Mississippi Supreme Court after voting rights violation",
    "url": "https://www.npr.org/2025/12/20/nx-s1-5650747/mississippi-supreme-court-special-election-ordered-voting-rights",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3617x2035+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2F4d%2F1172212f4c3981ffd938ffbc5989%2Fap25353723928913.jpg",
    "tag": "Politics",
    "date": "2025-12-20T14:58:03.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mississippi Supreme Court justices liste",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mississippi Supreme Court justices listen to arguments in Jackson, Miss., on July 6, 2023. On Friday, a judge ordered special elections for the court after earlier finding that the electoral map used to select justices violates the Voting Rights Act.\n                \n                    Rogelio V. Solis/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rogelio V. Solis/AP\n    \n\n   \n   JACKSON, Miss. — A judge on Friday ordered special elections for the Mississippi Supreme Court after earlier finding that the electoral map used to select justices violates Section 2 of the Voting Rights Act.   U.S. District Judge Sharion Aycock in August ordered Mississippi to redraw the map, which was enacted in 1987, concluding the current configuration dilutes the power of Black voters. The Friday ruling gives the Mississippi Legislature until the end of its 2026 regular session to redraw the map.   \n   Section 2, which is the primary way plaintiffs can push back against racially discriminatory election practices, is currently being challenged at the U.S. Supreme Court.   Once the legislature approves a new map, Aycock wrote that she will move quickly to meet any deadlines necessary to hold the special elections in November 2026.   Aycock also wrote that she will defer deciding which seats will be subject to a special election until after the new map has been adopted.   The order follows a 2022 lawsuit by the American Civil Liberties Union, which argued the current map cuts Mississippi's Delta region — a historically Black area — in half, diminishing the Black vote in the Central District.   \n   \"Mississippi is nearly 40% Black, but has never had more than one Black Justice on the nine-member Court,\" Ari Savitzky, a senior staff attorney with the ACLU's Voting Rights Project, wrote in a statement. \"We couldn't be happier to see justice on the horizon.\"   In her August ruling, Aycock noted only four Black people have served on Mississippi's Supreme Court. All of them held the same seat in the Central District and were first appointed to the position by a sitting governor.   The Mississippi Secretary of State's Office is appealing Aycock's August ruling. The Fifth U.S. Circuit Court of Appeals has stayed its proceedings pending the outcomes of the SCOTUS case and other related cases.   \n   The Mississippi Secretary of State and Attorney General's offices did not immediately respond to requests for comment.   In December, two Mississippi Supreme Court justices were appointed to federal judgeships. Gov. Tate Reeves will appoint replacements to serve until new justices can be elected.   In Mississippi, Supreme Court elections are nonpartisan.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Special elections ordered for Mississippi Supreme Court after voting rights violation",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3617x2035+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F11%2F4d%2F1172212f4c3981ffd938ffbc5989%2Fap25353723928913.jpg"
      ],
      "datePublished": "2025-12-20T14:58:03.000Z",
      "dateModified": "2025-12-20T14:58:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge blocks HUD homelessness overhaul, rebukes agency for causing 'chaos'",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649501/judge-blocks-hud-homelessness-funding-overhaul",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+31/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd4%2Fee%2Feaa54ada4e9c9ee64d0765dfdc46%2Fgettyimages-2223538078-594x594.jpg",
    "tag": "Politics",
    "date": "2025-12-19T20:37:51.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Department of Housing and Urban",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Department of Housing and Urban Development faces legal challenges over proposed major changes to homelessness funding.\n                \n                    Kent Nishimura/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kent Nishimura/Getty Images\n    \n\n   \n   The U.S. Department of Housing and Urban Development cannot impose dramatically different conditions for homelessness programs for now, according to an oral ruling Friday by U.S. District Judge Mary McElroy in Rhode Island.   \n   McElroy granted a preliminary injunction to a group of states, cities and nonprofits who said a last minute overhaul of how to spend $4 billion on homelessness programs was unlawful. She also agreed with their argument that it likely would push many people back onto the streets in the middle of winter, causing irreparable harm.    \"Continuity of housing and stability for vulnerable populations is clearly in the public interest,\" said McElroy, ordering HUD to maintain its previous funding formula.   The National Alliance to End Homelessness, one of the plaintiffs, said in a statement the order \"means that more than 170,000 people – families, seniors, veterans, and people with disabilities – have respite from the government's assault.\"   \n   HUD has sought to dramatically slash funding for permanent housing and encourage more transitional housing that mandates work and treatment for addiction or mental illness. The overhaul – announced last month – also would allow the agency to deny money to local groups that don't comply with the Trump administration's agenda on things like DEI, the restriction of transgender rights and immigration enforcement.   \"HUD will continue working to provide homelessness assistance funding to grantees nationwide,\" said HUD spokeswoman Kasey Lovett in a statement to NPR. \"The Department remains committed to program reforms intended to assist our nation's most vulnerable citizens and will continue to do so in accordance with the law.\"   'Chaos seems to be the point'   McElroy expressed frustration with a series of HUD actions in recent weeks. Just hours before a Dec. 8 hearing, the agency withdrew its new funding notice, saying it would make changes to address critics' concerns. But on Friday, HUD's attorney said the new version would not be ready until the end of the day.   \n   \"The timing seems to be strategic,\" McElroy said, asserting there was no reason the document could not have been ready before the hearing. \"The constant churn and chaos seems to be the point.\"   In defending the agency, attorney John Bailey said HUD was simply trying to change its policies to reflect President Trump's executive orders, which he called \"legal directives.\" The judge interjected repeatedly to explain that he was conflating things, noting Congress – not the president – makes laws.   'It's kind of shocking'   HUD's changes were announced in November with little notice and only weeks before local homeless service providers must apply for new funding.   \n   \"Our agencies are just scrambling right now to try to respond,\" said Pam Johnson with Minnesota Community Action Partnership, whose members provide housing and other services for homeless people. \"It also just reverses 40 years of bipartisan work on proven solutions to homelessness. So it's really, it's kind of shocking.\"   For decades, U.S. policy favored permanent housing with optional treatment for addiction or mental illness Years of research has found the strategy is effective at keeping people off the streets.   But many conservatives argue it's failed to stop record rates of homelessness.   \"What is the root cause of homelessness? Mental illness, drug addiction, drug abuse,\" HUD Secretary Scottt Turner said recently on Fox Business Network. \"During the Biden administration, it was just warehousing. It was a homeless industrial complex.\"   Turner and others who support the changes say the goal is to push people towards self-sufficiency.   But local advocates say mental health and substance abuse are not the main factors driving homelessness.   \"It's poverty. Poverty, low income and significant lack of affordable housing,\" says Julie Embree, who heads the Toledo Lucas County Homelessness Board in Ohio.   Many in permanent housing have disabilities that make it hard to work full time, she said. Embree agrees with Trump administration goals like efficiency and saving money, but says pushing people back into homelessness, where they're more likely to land in jail, the courts or a hospital, is not cost-effective.   \"One emergency room visit is just as expensive as a month of sustaining this [permanent housing] program,\" she said.   In Los Angeles, Stephanie Klasky-Gamer with LA Family Housing said there is a need for more transitional housing, but not at the expense of long-term housing. And the idea that programs could simply switch from one to the other is not only unrealistic, it's illegal.   \"You cannot take a building that has a 75-year deed restriction and just - ding! - call it interim housing,\" she said.   \n   Those challenging HUD say providers who own such properties – or states who've invested millions of dollars in permanent housing projects – face \"significant financial jeopardy\" if their funding is not renewed.   In addition to the legal challenges, members of Congress from both parties have questioned HUD's sudden shift on homelessness. Advocates have lobbied lawmakers to step in and, at the least, push for more time to prepare for such a massive overhaul.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks HUD homelessness overhaul, rebukes agency for causing 'chaos'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+31/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd4%2Fee%2Feaa54ada4e9c9ee64d0765dfdc46%2Fgettyimages-2223538078-594x594.jpg"
      ],
      "datePublished": "2025-12-19T20:37:51.000Z",
      "dateModified": "2025-12-19T20:37:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's year in Washington",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5646603/trumps-year-in-washington",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-19T21:57:34.000Z",
    "description": "\n      President Trump won re-election in 2024 on a promise to upend Washington. He pitched a presidency where he alone could solve America's problems",
    "body": "\n      President Trump won re-election in 2024 on a promise to upend Washington. He pitched a presidency where he alone could solve America's problems. Where does the current reality of these promises stand?   \n\n    SCOTT DETROW, HOST:  President Trump won reelection last year on a promise to upend Washington. He pitched a presidency where he alone could solve America's problems. Now, as we come to the close of 2025, we have asked senior White House correspondent Tamara Keith and senior political editor and correspondent Domenico Montanaro to join us to talk about the reality of those promises. Good to talk to both of you.TAMARA KEITH, BYLINE: Hey, Scott.DOMENICO MONTANARO, BYLINE: Hey, Scott.DETROW: So President Trump very clear during the 2024 campaign he was pitching a version of the federal government with him at the center of it. Did he follow through on that?MONTANARO: Yeah, he's done more to try and centralize power in the executive branch than any president we can remember, whether that was using DOGE - that informal Department of Government Efficiency that was run by Elon Musk - or putting himself in charge of things from dismantling quasi-independent agencies and demolishing the East Wing of the White House to build a ballroom without going through any of the usual protocols. He signed a record number of executive orders, used them to push back on the media, law firms - taking over the Kennedy Center, even - threatening grants as leverage against institutions of higher education. He's really pushed the limits and bent the guardrails of the presidency.KEITH: There's also been a lot of retribution and just going after his political enemies.DETROW: Let's talk more about that. A big part of how he executed this vision early on was DOGE. This was the big story of the first half of the year.KEITH: Yeah. It can be a little difficult to untangle Elon Musk's DOGE project from White House Budget Director Russell Vought's relentless focus on cutting government and driving out federal employees. But here's a short list of institutions that under Trump have been rapidly dismantled, starved or completely remade this year - the U.S. Agency for International Development, the Consumer Financial Protection Bureau, Voice of America, the Department of Education, the U.S. Institute of Peace - now the Donald Trump Institute of Peace. This week, the White House tweeted, quote, \"federal employment is now at the lowest level since 2014, down by 271,000 jobs since President Trump took office. Promises made, promises kept.\"DETROW: And we should say, as of this week, the Kennedy Center is now the Trump Kennedy Center. Changes all over the place. Let's talk about Congress for a minute, though. The flip side of a powerful presidency has been a Congress that's, is it fair to say, just standing aside and letting things happen?KEITH: Yeah. This Congress, controlled by Republicans in both the House and the Senate, basically only did the things that President Trump said they had to do. If he didn't put political capital on the line, they weren't doing it. So Trump demanded expensive policies, like nearly $4 trillion over 10 years to make his first-term tax cuts permanent, also adding promises he made during the campaign, like no taxes on tips, no taxes on overtime. And Republicans made that happen. He was lukewarm, though, on extending subsidies for health care through the Affordable Care Act, and as of the end of this year, Congress has failed to do anything to prevent those costs from skyrocketing.MONTANARO: The one exception on all of this with Republican pushback has been the release of the Epstein files and his administration's handling of that, which has really become a political liability, and to an extent with moderate Republicans on these health care subsidies wanting to see those extended.DETROW: So that's the legislative branch. What was the story of the judicial branch in 2025 as the Trump White House tried to seize so much power?MONTANARO: Yeah, I think this is a really crucial branch of government right now because Trump has really pushed to see how far the Supreme Court will let him go. Remember, he appointed three of the justices who sit on the high court and flipped the court to a 6-3 ideological conservative majority. And the court gave him huge powers before the second term, saying that he's immune from criminal consequences for any official acts.Given Republicans in Congress are greasing the wheels for Trump, the courts are really the last branch that can spell out what, if any, guardrails exist. You know, this applies on everything from the firings of federal workers, reducing or eliminating those federal agencies we were talking about, and just how far he's trying to go on deportations.KEITH: We are currently watching two major cases in the court that could determine how far the Supreme Court is willing to let the president go, including birthright citizenship and also a challenge to his tariffs policy. And I think tariffs are a great example of how President Trump has led unilaterally in an area that typically would require some congressional involvement. He's imposed these significant tariffs on goods imported to the United States. In some cases, he's actually walked a little bit of it back, like on coffee, where there's been a spike in the price of coffee, then he rolled some of those tariffs back, facing some political pushback on affordability. But just to go more broadly, if his first term was characterized by a man bristling against guardrails, this one is about blowing through them and surrounding himself with people who don't view it as their job to constrain him.DETROW: The thing is, he ran on doing exactly that. He was explicit in his promises. He took office, and he by and large followed through on those promises.KEITH: Yep.DETROW: And polls have showed that voters are not responding. They do not approve. What are we seeing? How should we think about public reaction over the course of the year?MONTANARO: Yeah. I mean, Trump is really at the lowest point in his presidency. Just 38% of people in the latest NPR/PBS News/Marist poll said that they approve of the job he's doing overall - just 36% on his handling of the economy. People are really struggling to make ends meet, and they're saying that Trump's policies have made things worse. And you could argue the economy and his promises to lower prices are really what got him put back into the White House, not all these other tactics to consolidate power. No matter how much he says loudly that he had a broad and sweeping mandate, it just wasn't the case. I mean, Latinos, for example, crossed over to vote for him. They were saying that the economy was most important. He won a record share of Latinos for a Republican. And now they're hotly disapproving of the job that he's doing.KEITH: And what we're seeing here with these approval ratings is really the answer to the question of what happens if you only govern for your base and yourself.DETROW: That is NPR's Tamara Keith and Domenico Montanaro. Always good to talk to you both. Thanks so much.KEITH: You're welcome.MONTANARO: Thanks, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's year in Washington",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-19T21:57:34.000Z",
      "dateModified": "2025-12-19T21:57:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week in Politics: MAGA activists in Phoenix; Trump's address; Democrats face 2024 loss",
    "url": "https://www.npr.org/2025/12/20/nx-s1-5648391/week-in-politics-maga-activists-in-phoenix-trumps-address-democrats-face-2024-loss",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-20T12:43:44.000Z",
    "description": "\n      \n      Week in Politics: MAGA activists in Phoenix; Trump's address; Democrats face 2024 loss\n    \n            \n                \n              ",
    "body": "\n      \n      Week in Politics: MAGA activists in Phoenix; Trump's address; Democrats face 2024 loss\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5648391/nx-s1-9580688\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      MAGA activists meet in Phoenix, President Trump addresses the nation and his fans, and Democrats grapple with how they lost in 2024.   \n\n    SCOTT SIMON, HOST:  Thousands of conservatives meet in Phoenix this weekend for a Turning Point USA conference. It is the group's largest assembly since its founder, Charlie Kirk, was assassinated in September, and the event has highlighted growing divisions in what's called the MAGA movement. NPR senior contributor Ron Elving joins us. Ron, thanks for being with us.RON ELVING, BYLINE: Good to be with you, Scott.SIMON: The podcaster Ben Shapiro took the podium and blasted other speakers to come as, quote, \"frauds and grifters.\" And later, Tucker Carlson said that Shapiro was pompous. Is this contention over what conservatism ought to be post-Trump?ELVING: There's a highly specific leadership vacuum here. Charlie Kirk is gone, and no one has begun to replace him. His wife, Erika, has taken a high-profile role after her husband's death, but she does not yet have the mobilizing power her husband had. Neither does anyone else, which is why we see this leadership struggle between the would-be champions of different elements in the MAGA movement. Charlie Kirk could reach most all of them and provide a point of connection for them. That includes those who are most supportive of Israel and those most suspicious of Israel. The danger for the movement is that this highly visible fighting brings down the big tent. It reduces the appeal for younger voters as well as some Hispanics and African Americans. A squabbling party is a less-inviting party.SIMON: Of course, all is not amity among Democrats. Reports this week that party leaders will not publicly release the autopsy of why they lost the 2024 presidential election. What are the divisions here?ELVING: The same need for unity applies to Democrats, and it has been historically elusive for Democrats. Tactically speaking, their 2024 was a disaster because when the incumbent Joe Biden pulled out of his own reelection bid, it was far too late for the primary process, and that could have made Kamala Harris a stronger candidate or found a candidate stronger than Kamala Harris. And yes, Democrats have their own policy divisions, especially on the Middle East. Historically, the Democrats have been strong supporters of Israel. But in recent years, younger Democrats and others in the party coalition have shown increasing sympathy for the plight of Palestinians.Strategically speaking, Democrats are as divided as ever as to whether to seek votes in the center of the American political spectrum or play to their own party's most passionate progressives. The trick is getting enough Democrats to unite the factions or to accept some sort of shared power so as to actually get some national power to share.SIMON: President Trump addressed the nation in a primetime speech this week, and last night he spoke to supporters in North Carolina. What have you noticed?ELVING: It's notable that he's trying to be both the incumbent and the anti-incumbent, acting as though Joe Biden were still president and responsible for the economy. That's a tough sell right there, but then Trump turns around and insists the economy is great. We did get a hopeful inflation number this past week, but it was somewhat suspect because the government shutdown affected the numbers - only gave us numbers for one month, not two. And whether inflation was 2.7 or actually higher, the most important measure is the way the voters are feeling. And right now, the most trusted measure that we have for consumer confidence shows that confidence is all the way down to where it was in 2009, the start of the Great Recession.SIMON: The Kennedy Center in Washington, D.C., was designated by Congress as a living memorial to President Kennedy in 1964, the year after he was assassinated, of course. Yesterday, President Trump put his name on the building too. Why?ELVING: Well, it shouldn't be a shock. We've known for some time that Trump likes seeing his name. Earlier this month, he put it on the U.S. Institute of Peace, now the Trump Institute of Peace. And now the president's hand-picked board members have tacked his name onto the Kennedy Center. We should add that there are still some questions about whether or not that's legal, and members of Congress and the Kennedy family still want to resist.SIMON: NPR's Ron Elving. Thanks so much for being with us. Talk to you soon.ELVING: Thank you, Scott.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week in Politics: MAGA activists in Phoenix; Trump's address; Democrats face 2024 loss",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-20T12:43:44.000Z",
      "dateModified": "2025-12-20T12:43:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about the Epstein files released by the Justice Department",
    "url": "https://www.npr.org/2025/12/20/nx-s1-5648774/what-to-know-about-the-epstein-files-released-by-the-justice-department",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-20T12:43:50.000Z",
    "description": "\n      \n      What to know about the Epstein files released by the Justice Department\n    \n            \n                \n                Transcript\n  ",
    "body": "\n      \n      What to know about the Epstein files released by the Justice Department\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5648774/nx-s1-9580565\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      The Department of Justice began releasing its files on Friday on the late pedophile Jeffrey Epstein. Many documents, which include interview transcripts and call logs, have been heavily redacted.   \n\n    SCOTT SIMON, HOST:  The Justice Department has released files relating to the life, death and criminal investigation into Jeffrey Epstein - well, at least some of them. The law signed by President Trump last month had directed the DOJ to turn over the documents by Friday. NPR's Stephen Fowler has been reviewing the files and joins us. Stephen, thanks for being with us.STEPHEN FOWLER, BYLINE: Good morning.SIMON: What exactly was released?FOWLER: Well, on the surface, it sure looked like a lot. Justice.gov/epstein went live around 4 p.m. And there was a queue you had to wait in before accessing the page. The Epstein library contained well over 100,000 pages of court records, Freedom of Information Act files, memoranda from the Justice Department and videos from outside Epstein's federal prison cell, where he died by suicide in 2019, and documents that the Epstein Files Transparency Act, signed into law last month, compelled the Justice Department to hand over.SIMON: Feels like there's more to the story.FOWLER: Well, yeah. It's not all the files. And in the grand scheme of what was released, there aren't that many things that are actually new, Scott. Notably, there aren't many mentions of the president in this latest release. He was a longtime friend of Epstein before they had a falling out and has appeared in previously released files. Eighty percent of it comes from public court records from more than 50 cases against Epstein, his accomplice Ghislaine Maxwell and others. There's about 4,000 files, 8,500 pages, that fall under this new Transparency Act. Most of those are photos of Epstein's estate and his travels with people like former President Bill Clinton, among others. And there's this previously undisclosed FBI report from 1996 - 30 years ago - that accused Epstein of child pornography crimes and allegedly threatened to burn the accuser's house down if she told anyone about it. Even then, there are hundreds of pages, just straight-up redacted black boxes all over things like grand jury information that do leave a lot of questions.SIMON: The law directed the Justice Department to release all of their files by yesterday. That apparently didn't happen. What did department officials say?FOWLER: The DOJ says its review of the files found more than 1,200 victims and families and wrote in a separate court filing Friday that redactions include people who may not actually be victims, as they err on the side of what they say might be viewed as an over-redaction, taking out more than may be required by law out of an abundance of caution. This could also explain why there will be more than one release of documents. On Friday night, there were more files that were uploaded.SIMON: What's been the reaction from members of Congress?FOWLER: Not all of them are happy. Remember, this was a near unanimous law that was passed through Congress. Democratic Representative Ro Khanna of California, who cosponsored the Epstein Files Transparency Act, told All Things Considered yesterday that the released files weren't what he expected or wanted. He says there's too many redactions and missing information altogether. Here's an example.RO KHANNA: There's a draft indictment of the first Jeffrey Epstein case that really implicates other rich and powerful men who knew about the abuse or participated in it. That indictment should be released.FOWLER: His Republican cosponsor, Thomas Massie of Kentucky, said that impeachment could be on the table for officials involved, though Congress is out of session for a while over the holidays.SIMON: Stephen, what can we expect to happen now?FOWLER: Like Khanna said, it's notable all of the things that aren't in the files that have been released and that some people think will never be. There's an FBI memo from over the summer that said about 300 gigabytes of evidence is in their possession. And the way President Trump has handled this by fanning flames of conspiracy on the campaign trail, then attacking his supporters for wanting to know more once he took office has basically made it where nobody is set to be satisfied with the information that is and could be put out there.SIMON: NPR's Stephen Fowler. Thanks so much.FOWLER: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about the Epstein files released by the Justice Department",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-20T12:43:50.000Z",
      "dateModified": "2025-12-20T12:43:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MAGA divisions over antisemitism on display at Turning Point",
    "url": "https://www.npr.org/2025/12/19/nx-s1-5649521/maga-divisions-over-antisemitism-on-display-at-turning-point",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-19T21:52:28.000Z",
    "description": "\n      MAGA infighting was underway as Turning Point USA opened its first national conference since the death of Charlie Kirk.   \n\n    JUANA SUMMERS, ",
    "body": "\n      MAGA infighting was underway as Turning Point USA opened its first national conference since the death of Charlie Kirk.   \n\n    JUANA SUMMERS, HOST:  High-profile supporters of President Trump are once again trading verbal attacks and debating the future of their movement. The fight stems from an ongoing debate about the elevation of antisemitic ideas by some right-wing leaders. That conflict came to a head again yesterday during an event hosted by the conservative group Turning Point USA. NPR political correspondent Sarah McCammon has been following this, and she's here now. Hi.SARAH MCCAMMON, BYLINE: Hey, Juana.SUMMERS: So, Sarah, I mean, this is not the first time these questions have come up about the boundaries of the conservative movement recently. So if you can, just start by reminding us how we got here.MCCAMMON: Right. You know, since the murder of the influential conservative activist Charlie Kirk in September, there's been an eruption of controversy around who belongs in the movement and where the movement should draw lines around things like antisemitic rhetoric and conspiracy theories. And so this came up again as Turning Point, which is the group Kirk founded, was kicking off its annual AmericaFest conference yesterday in Phoenix.Conservative commentator Ben Shapiro has sharply criticized several of his fellow conservatives for their friendliness toward people like the white nationalist streamer Nick Fuentes, who has, among other things, praised Hitler. And in his speech at Turning Point, Shapiro said that Charlie Kirk had, quote, \"despised\" Fuentes.(SOUNDBITE OF ARCHIVED RECORDING)BEN SHAPIRO: He knew that Nick Fuentes is an evil troll and that building him up is an act of moral imbecility. And that is precisely what Tucker Carlson did. He built Nick Fuentes up, and he ought to take responsibility for that.MCCAMMON: And Carlson, as you may remember, sparked an uproar for hosting a lengthy and rather friendly interview with Fuentes back in October. Now, Shapiro called out another prominent right-wing podcaster, Candace Owens, for promoting a variety of conspiracy theories, including the unsubstantiated claim that Turning Point was somehow covering up information about Kirk's death. Shapiro said that these high-profile conservatives have a responsibility to ask tough questions of the people they host on their platforms.SUMMERS: Sarah, what's the reaction been like?MCCAMMON: So Tucker Carlson also spoke, and he did not mention Shapiro by name, but he did criticize what he described as deplatforming and denouncing people. He suggested that Kirk would have wanted an open dialogue. It's worth pointing out here that Turning Point has actually banned Fuentes and his followers from some of their events in the past. But Carlson said he wanted to make one thing clear.(SOUNDBITE OF ARCHIVED RECORDING)TUCKER CARLSON: I'm not an antisemite because antisemitism is immoral. In my religion, it is immoral to hate people for how they were born. Period.MCCAMMON: And Carlson added that he believes that racism against white men is, quote, \"more widespread and so far much more damaging\" than antisemitism. We should say here, reports of antisemitic violence are on the rise. And of course, just last weekend, 15 people were murdered at a Hanukkah celebration in Australia in what officials there said appears to be an ISIS-inspired attack.SUMMERS: Sounds to me like there are some real divides emerging within Trump's coalition. What could this mean for the future of the party?MCCAMMON: Well, Republicans are facing a tough climb in the midterm, so these divisions are not helpful right now. Charlie Kirk's widow, Erika Kirk, who's now leading Turning Point, told the crowd they would be hearing ideas they may not agree with, but that's OK. She said Turning Point is working to ensure that Republicans will retain control of Congress, and she's looking ahead to 2028. She announced her support for Vice President JD Vance, who's widely expected to run for president and is speaking at Turning Point this weekend. So these questions about the future of the conservative movement will continue to loom large.SUMMERS: NPR political correspondent Sarah McCammon, thanks.MCCAMMON: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MAGA divisions over antisemitism on display at Turning Point",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-19T21:52:28.000Z",
      "dateModified": "2025-12-19T21:52:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]