[
  {
    "title": "Iran's foreign minister says the nation is no longer enriching uranium at any site in the country",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5610372/irans-foreign-minister-uranium",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8417x4735+0+439/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2Fde%2F6f18ed8a473fb189789e825d7736%2Fap25320378709095.jpg",
    "tag": "Politics",
    "date": "2025-11-16T11:00:38.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Iranian Foreign Minister Abbas Araghchi,",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Iranian Foreign Minister Abbas Araghchi, center, attends a conference titled \"International Law Under Assault: Aggression and Self-Defense,\" in Tehran, Iran, Sunday, Nov. 16, 2025.\n                \n                    Vahid Salemi/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Vahid Salemi/AP\n    \n\n   \n   TEHRAN, Iran — Iran's foreign minister on Sunday said that Tehran is no longer enriching uranium at any site in the country.   Answering a question from an Associated Press journalist visiting Iran, Foreign Minister Abbas Araghchi offered the most direct response yet from the Iranian government regarding its nuclear program following Israel and the United States' bombing its enrichment sites in June.   \"There is no undeclared nuclear enrichment in Iran. All of our facilities are under the safeguards and monitoring\" of the International Atomic Energy Agency, Araghchi said. \"There is no enrichment right now because our facilities — our enrichment facilities — have been attacked.\"   \n   Asked what it would take for Iran to continue negotiations with the U.S. and others, Araghchi said that Iran's message on its nuclear program remains \"clear.\"   \"Iran's right for enrichment, for peaceful use of nuclear technology, including enrichment, is undeniable,\" the foreign minister continued. \"We have this right and we continue to exercise that and we hope that the international community, including the United States, recognize our rights and understand that this is an inalienable right of Iran and we would never give up our rights.\"   Iran's government issued a three-day visa for the AP reporter to attend a summit alongside other journalists from major British outlets and other media.   Iran's Institute for Political and International Studies, affiliated with the country's Foreign Ministry, hosted the summit. Titled \"International Law Under Assault: Aggression and Self-Defense,\" the conference included papers by Iranian political analysts offering Tehran's view of the 12-day war in June, many seizing on comments from German Chancellor Friedrich Merz praising Israel for having done the \"dirty work\" in launching its attack.   \"Iran's defensive response was remarkable, inspiring, historic and above all, pure,\" wrote Mohammad Kazem Sajjadpour, an international relations professor. \"How can one possibly compare Israel's dirty deeds to the noble and clean actions of the Iranian nation?\"   \n   Images of children killed by Israel during the war lined the walkway outside the summit, held inside the Martyr General Qassem Soleimani Building, named for the Revolutionary Guard expeditionary leader killed by a U.S. drone strike in 2020.   But Iran finds itself in a difficult moment after the war. Israel decimated the country's air defense systems, potentially leaving the door open to further airstrikes as tensions remain high over Tehran's nuclear program. Meanwhile, economic pressures and societal change continues to challenge Iran's Shiite theocracy, which so far has held off on making decisions on whether to enforce its mandatory hijab laws or raise the price of government-subsidized gasoline, both of which have sparked nationwide protests in the past.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran's foreign minister says the nation is no longer enriching uranium at any site in the country",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8417x4735+0+439/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2Fde%2F6f18ed8a473fb189789e825d7736%2Fap25320378709095.jpg"
      ],
      "datePublished": "2025-11-16T11:00:38.000Z",
      "dateModified": "2025-11-16T11:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene says Trump policies are 'not America first' in fight over MAGA",
    "url": "https://www.npr.org/2025/11/16/g-s1-98038/trump-mtg-maga-republicans",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3403x1913+1173+165/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F51%2F8b%2F25b5e83d4e30bc6160b84a3a3307%2Fap25064084688610.jpg",
    "tag": "Politics",
    "date": "2025-11-16T18:05:39.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump arrives after being gree",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump arrives after being greeted by Rep. Marjorie Taylor Greene, R-Ga., to address a joint session of Congress at the Capitol in Washington on March 4.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   Rep. Marjorie Taylor Greene, R-Ga., once one of President Trump's strongest supporters in Congress, called his foreign policies \"not America first positions\" and said his recent attacks against her can \"put my life in danger.\" Greene and Trump have traded barbs in last few days over the future of the Make America Great Again movement, raising new questions about the president's firm grip on the Republican Party.    On Friday, Trump withdrew his endorsement of the Georgia lawmaker calling her \"Wacky\" and claiming Greene's recent criticism of him was all about his refusal to support her future political ambitions. On Saturday, Trump called her a \"traitor\" in a social media post.      \n   \"He called me a traitor and that is so extremely wrong,\" Greene said during an interview on CNN's State of The Union with Dana Bash on Sunday. \"And those were the types of words used that can radicalize people against me and put my life in danger.\"   \n   When asked about her previous attacks against political opponents — such as in 2020 when she posted an image of a gun alongside a group of progressive Democratic congresswomen — Greene apologized.    \"I think that's fair criticism,\" Greene said. \"And I would like to say humbly I'm sorry for taking part and the toxic politics. It's very bad for our country.\"   During the extensive interview, Greene also criticized Trump's recent defense of the H-1B visa program — which lets companies sponsor foreign-born workers for skilled labor. During a Tuesday Fox News interview, Trump said the U.S. has \"to bring this talent\" and he said the country doesn't have enough of it.    \"Those are not America first positions,\" Greene said on Sunday before voicing displeasure at his frequent foreign trips. \"And continuing to really travel all over the world doesn't help Americans back at home. I really — and I said this to him and I will say it out loud — I would love to see Air Force One be parked and stay home.\"   \n   Despite her break with Trump, local GOP leadership in Georgia's 14th Congressional District are standing with Greene.    \"Recent national criticism directed at Congresswoman Greene does not change the fundamental truth that she serves at the direction of the people of this district,\" Chairman Jim Tully posted of Facebook Saturday. \"While the President of the United States represents the nation as a whole, Congresswoman Greene represents the people of Northwest Georgia, and she has done so with clarity, resolve, and integrity.\"   \n   This public rift between Greene and Trump marks a brewing fissure in the GOP. When asked what caused the break, Greene pointed to the battle over releasing documents tied to convicted sex offender Jeffrey Epstein.    \"Unfortunately, it has all come down to the Epstein files, and that is shocking,\" Greene said.    The Georgia lawmaker said she doesn't believe Trump is implicated in these files.   The House of Representatives is set to vote on the release of documents related to investigations of Epstein this week after enough members signed a discharge petition brought by Reps. Ro Khanna, D-Calif., and Thomas Massie, R-Ky.     On ABC News Sunday, Massie warned his fellow Republicans that voting against the release of the files would stain their long-term political futures — even if Trump attacks them in the short-term.     \"In 2030, he's not going to be the president, and you will have voted to protect pedophiles,\" Massie said. \"The record of this vote will last longer than Donald Trump's presidency.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene says Trump policies are 'not America first' in fight over MAGA",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3403x1913+1173+165/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F51%2F8b%2F25b5e83d4e30bc6160b84a3a3307%2Fap25064084688610.jpg"
      ],
      "datePublished": "2025-11-16T18:05:39.000Z",
      "dateModified": "2025-11-16T18:05:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump issues two pardons related to Jan. 6 investigation",
    "url": "https://www.npr.org/2025/11/15/nx-s1-5609943/trump-two-pardons-jan-6-investigation",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4887x2749+0+255/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F77%2Ff8ba37ff4a6cb55e3190e32254ae%2Fap25319604146333.jpg",
    "tag": "Politics",
    "date": "2025-11-16T01:26:43.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Violent insurrections loyal to President",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Violent insurrections loyal to President Donald Trump break through a police barrier at the Capitol in Washington on Jan. 6, 2021.\n                \n                    Julio Cortez/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Julio Cortez/AP\n    \n\n   \n   WASHINGTON — President Donald Trump has issued two pardons related to the investigation into the Jan. 6, 2021 riot, including for a woman convicted of threatening to shoot FBI agents who were investigating a tip that she may have been at the Capitol, officials said Saturday.   In a separate case, Trump issued a second pardon for a Jan. 6 defendant who had remained behind bars despite the sweeping grant of clemency for Capitol rioters because of a separate conviction for illegally possessing firearms.   It's the latest example of Trump's willingness to use his constitutional authority to help supporters who were scrutinized as part of the Biden administration's massive Jan. 6 investigation that led to charges against more than 1,500 defendants.   \n   Suzanne Ellen Kaye was released last year after serving an 18-month sentence in her threats case. After FBI contacted her in 2021 about a tip indicating she may have been at the Capitol on Jan. 6, she posted a video on social media citing her Second Amendment right to carry a gun and she threatened to shoot agents if they came to her house. In court papers, prosecutors said her words \"were part of the ubiquity of violent political rhetoric that causes serious harm to our communities.\"   An email seeking comment was sent to a lawyer for Kaye on Saturday. Kaye testified at trial that she didn't own any guns and didn't intend to threaten the FBI, according to court papers. She told authorities she was not at the Capitol on Jan. 6 and wasn't charged with any Capitol riot-related crimes.   A White House official said Kaye suffers from \"stress-induced seizures,\" and experienced one when the jury read its verdict. The White House said this is \"clearly a case of disfavored First Amendment political speech being prosecuted and an excessive sentence.\" The official requested anonymity because they weren't authorized to publicly discuss the case.   In a separate case, Trump pardoned Daniel Edwin Wilson of Louisville, Kentucky, who was under investigation for his role in the riot when authorities found six guns and roughly 4,800 rounds of ammunition in his home. Because of prior felony convictions, it was illegal for him to possess firearms.   \n   Wilson's case became part of a legal debate over whether Trump's sweeping pardons for Jan. 6 rioters in January applied to other crimes discovered during the sprawling federal dragnet that began after the attack on the Capitol. The Trump-appointed federal judge who oversaw Wilson's case criticized the Justice Department earlier this year for arguing that the president's Jan. 6 pardons applied to Wilson's gun offense.   Wilson, who had been scheduled to remain in prison until 2028, was released Friday evening following the pardon, his lawyer said on Saturday.   \"We are grateful that President Trump has recognized the injustice in my client's case and granted him this pardon,\" attorney George Pallas said in an email. \"Mr. Wilson can now reunite with his family and begin rebuilding his life.\"   The White House official said Saturday that \"because the search of Mr. Wilson's home was due to the events of January 6, and they should have never been there in the first place, President Trump is pardoning Mr. Wilson for the firearm issues.\"   \n   Wilson had been sentenced in 2024 to five years in prison after pleading guilty to conspiring to impede or injure police officers and illegally possessing firearms at his home.   Prosecutors had accused him of planning for the Jan. 6 riot for weeks and coming to Washington with the goal of stopping the peaceful transfer of power. Authorities said he communicated with members of the far-right Oath Keepers extremist group and adherents of the antigovernment Three Percenters movement as he marched to the Capitol.   Prosecutors cited messages they argued showed that Wilson's \"plans were for a broader American civil war.\" In one message on Nov. 9, 2020, he wrote: \"I'm willing to do whatever. Done made up my mind. I understand the tip of the spear will not be easy. I'm willing to sacrifice myself if necessary. Whether it means prison or death.\"   \n   Wilson said at his sentencing that he regretted entering the Capitol that day but \"got involved with good intentions.\"   The Justice Department had initially argued in February that Trump's pardons of the Jan. 6 rioters on his first day back in the White House didn't extend to Wilson's gun crime. The department later changed its position, saying it had received \"further clarity on the intent of the Presidential Pardon.\"   U.S. District Judge Dabney Friedrich, who was nominated to the bench by Trump, criticized the department's evolving position and said it was \"extraordinary\" that prosecutors were seeking to argue that Trump's Jan. 6 pardons extended to illegal \"contraband\" found by investigators during searches related to the Jan. 6 cases.   Politico first reported Wilson's pardon on Saturday. Megerian reported from West Palm Beach, Fla.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump issues two pardons related to Jan. 6 investigation",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4887x2749+0+255/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F77%2Ff8ba37ff4a6cb55e3190e32254ae%2Fap25319604146333.jpg"
      ],
      "datePublished": "2025-11-16T01:26:43.000Z",
      "dateModified": "2025-11-16T01:26:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justice Department official told prosecutors that U.S. should 'just sink' drug boats",
    "url": "https://www.npr.org/2025/11/17/g-s1-97836/venezuela-evidence-doj-strikes-sinking-suspected-drug-boats-assertations",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4052x2279+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2F4a%2F044cec2541d4a283d04c85dba3f7%2Fgettyimages-2222118827.jpg",
    "tag": "Politics",
    "date": "2025-11-17T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Emil Bove, then a Justice Department off",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Emil Bove, then a Justice Department official, testifies during his nomination hearing as U.S. Circuit Judge for the Third Circuit in June 2025 in Washington, D.C.\n                \n                    Kevin Dietsch/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch/Getty Images\n    \n\n   \n   At a Justice Department conference in February, then-acting Deputy Attorney General Emil Bove told the department's top drug prosecutors that the Trump administration wasn't interested in interdicting suspected drug vessels at sea anymore. Instead, he said, the U.S. should \"just sink the boats,\" according to three people present for the speech.   At the time of Bove's comments, President Trump had only been back in office for a month. The White House had made clear that combatting drug cartels and transnational criminal gangs was a priority, but few could envision that six months later the U.S. would be blowing up suspected drug boats in the Caribbean Sea and Eastern Pacific Ocean.   \n   Since the first deadly attack on what the government says was a narco-trafficking vessel off the Venezuelan coast on Sept. 2, the U.S. has conducted some 20 strikes in international waters, killing more than 75 people. The administration says the boats were carrying drugs and posed a direct threat to the United States, but it has not provided any public evidence to support those assertions.   Bove's remarks, which have not previously been publicly reported, suggest at least some members of the administration were considering this policy shift as early as six months before the boat strikes began.   \n   NPR spoke about the Trump administration's policies with nine current and former U.S. officials who worked to combat transnational crime. They described a dramatic policy shift, from interdicting suspected drug boats, seizing the drugs, detaining and often prosecuting the crew, as the U.S. has done for decades — to blasting them out of the water and killing those on board.   All of the individuals spoke to NPR on condition of anonymity for fear of retribution. They questioned the legality of the deadly strikes — many referred to them as murder — and expressed doubts that the new policy would be more effective at stemming the flow of illicit drugs into the United States. Several of them said it may ultimately prove counterproductive.   \n   \"There's an awful lot of frustration with the administration abandoning what has been one of the most effective ways of going after organized crime in favor of things that sound macho but get you nowhere,\" said one former DOJ official who worked on maritime interdictions. \"The most devastating thing is killing people on the high seas without any due process or evidence of violence. Just preemptive strikes.\"   In a statement, a Justice Department spokesperson said that the department \"along with the entire Trump Administration is committed to ending the illegal trafficking of deadly drugs into our country and leaks from disgruntled former employees will not distract us from our mission.\"   'Jaw-dropping' comments about sinking boats   More than six months before the strikes began, Bove addressed a conference for the Organized Crime Drug Enforcement Task Forces, known as OCDETF, at the Justice Department's National Advocacy Center on the University of South Carolina campus.    More than 100 people were in the audience for Bove's closing speech. Among them were the leaders of OCDETF's 19 strike forces, including the three that focus on intercepting drug shipments at sea. These task forces played the leading role in U.S. government efforts to combat transnational organized crime and illicit narcotics.   Speaking via video teleconference, Bove expressed skepticism about maritime interdictions and the value of prosecuting low-level drug runners caught at sea.    \"That's when he said that we're not going to worry so much about interdictions, we're just going to sink the boats,\" said one of the attendees.   \n   \"I looked around at others in that room when he said that, and jaws literally dropped,\" this person said. \"The way people interpreted that was not, 'We're going to interdict and process the folks in the boats.' People took that as, 'We're just going to blow up the boats with people in them.'\"   Two other attendees said that at the time it was unclear to them whether Bove meant to sink the boats after seizing the drugs and arresting the crew — as the U.S. Coast Guard traditionally does — or sinking them with the crew and drugs still on board.   \n   \"It seemed so outlandish I didn't take it seriously. It just didn't seem reasonable until they started blowing boats up, and then holy s—-, does this all go together?\" said one former senior DOJ official who was in the room. \"Now that you look back on it, I think you can infer he probably meant just sink the boats with the people on them.\"   A fourth person who was at the conference recalled Bove's comments about ending interdictions but did not remember his remarks about sinking drug boats.   \n   Bove declined to comment for this story.    It is unclear to what extent he was directly involved in administration discussions about military action against narcotraffickers, or the Justice Department's still-secret legal memo drafted over the summer justifying the strikes. Bove left the DOJ after being confirmed by the Senate to serve as a federal judge — a lifetime seat on the U.S. Court of Appeals for the Third Circuit — in late July, and he received his commission on Aug. 20.   Justice memo justifies strikes' legality   The Trump administration's first lethal strike on a suspected drug boat took place the first week of September in the Caribbean. It expanded strikes in October to the Eastern Pacific as well, and it now has carried out a total of some 20 strikes combined.   Administration officials say the goal of the lethal campaign is to stop the flow of illicit drugs into the United States, although the significant increase in U.S. military troops, ships and aircraft in the Caribbean has fueled speculation that White House's real aim is to topple Venezuelan leader Nicolas Maduro.   The recent arrival of the carrier USS Gerald Ford and its strike group in the Caribbean has significantly added to American firepower in the region and heightened expectations the U.S. could strike Venezuela.   \n   The Trump administration has yet to provide any evidence to the American public to support its assertions that the boats that have been blown up at sea are indeed carrying drugs or that the individuals on board are cartel members.   It also has not provided a full public accounting of its legal justification for hitting boats other than that the president is taking action in self-defense and under his Article II powers as commander-in-chief.   Early this month — after being pressed for weeks by lawmakers — administration officials provided select members of Congress a more detailed briefing on the legal rationale, including the Justice Department Office of Legal Counsel memo on the strikes, according to a person familiar with the matter who spoke on condition of anonymity because of the sensitivity of the matter.   \n   The memo concludes that the U.S. is in a non-international armed conflict with the cartels, and that the strikes are being conducted in line with the laws of war. The head of the OLC also told lawmakers the administration wasn't going to seek an extension of war powers because the administration has determined they don't apply, since the American personnel conducting the strikes aren't in danger.   \n   \"A self-licking ice cream cone\"   The administration's lethal approach marks a huge shift from the traditional maritime interdictions the U.S. has long done.    Those operations involve the U.S. Coast Guard intercepting a drug boat at sea, boarding the vessel, seizing the narcotics, arresting the crew and bringing them back to the U.S. to face prosecution.   The U.S. Coast Guard works off information gathered from U.S. law enforcement and intelligence community sources. The U.S. military, meanwhile, has a hand in detection, monitoring and coordination.   \"We used to call it a self-licking ice cream cone,\" said one former FBI official who worked transnational crime and maritime interdictions. \"You stop a boat, you get the bad guys, you use the leverage of prosecuting them to turn them into cooperators.\"   Investigators would use those cooperators to intercept more drug boats, arrest more low-level traffickers, leverage some of them into cooperators to get more intelligence. This way, over time, the former FBI official said, investigators have been able to work their way up to cartel leadership.   Even when the people detained on a boat didn't have information that helped in a prosecution, they often had tidbits that helped illuminate the cartel network, which American officials then use for intelligence purposes.   \"Forgetting the philosophy of whether killing people is right or wrong, when you kill them you can't talk to them. When you grab them, you can,\" one former senior DOJ official said.   \n   The information that leads to an interdiction comes from human sources as well as what's known as signals intelligence, or electronic surveillance. Current and former officials said in interviews that that information is generally accurate and reliable.   \n   It allows the Coast Guard, for example, to put a cutter at a precise location of a drug boat in the Eastern Pacific Ocean, which is roughly the size of the continental United States.   The current and former officials said the intelligence isn't always 100% accurate. Sometimes the vessel the Coast Guard intercepts is a resupply boat carrying food and fuel for the traffickers, not the actual drugs.   Still, the intelligence that allows the Coast Guard to be in the right place is often built upon a piece of information provided by a human source, which then allows the U.S. government to put its vast electronic spying powers to good use.   These officials said blowing up boats instead of interdicting them will have a compound effect over time on the quality of intelligence.   With the lethal strikes, the U.S. is no longer gathering phones and other electronics off of crew arrested on the high seas, nor is the U.S. questioning the low-level drug runners about who and what they know about the broader trafficking network.   \"You need something to tell you where to look,\" the former DOJ official said. \"If you're killing all these people, you just dried up the human intelligence.\"   \n   Limits to understanding cartels   As the intelligence dwindles, the U.S. government's understanding of the cartels, their money laundering networks, supply chains and business strategies will start to go dark.    In the past, the OCDETF-led interdiction model intercepted around 4% to 6% of known maritime cocaine shipments annually on non-commercial vessels. In fiscal year 2023, for example, the rate was 3.71%, according to a Department of Homeland Security watchdog report from February.   \n   This fall, the Trump administration shuttered OCDETF, and transferred its cases to new Homeland Security Task Forces jointly run by the FBI and Homeland Security Investigations.    For those who spent years working on combating drug cartels, there's deep skepticism that the Trump administration's new policy of military strikes will be prevent more drugs from reaching America.   \"All this strategy is doing is killing people and the same amount of drugs is getting into the U.S.,\" the former senior DOJ official said. \"You didn't save anybody or increase the number of people you're saving in the U.S. It's extraordinarily shortsighted and I don't think it gets you the goal you want.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justice Department official told prosecutors that U.S. should 'just sink' drug boats",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4052x2279+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2F4a%2F044cec2541d4a283d04c85dba3f7%2Fgettyimages-2222118827.jpg"
      ],
      "datePublished": "2025-11-17T10:00:00.000Z",
      "dateModified": "2025-11-17T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds of thousands rally in Manila against flood-control corruption scandal",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5610370/hundreds-of-thousands-rally-in-manila-against-flood-control-corruption-scandal",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8d%2F6b%2Fa0d1ca3447c3bdb17e3b8e557b8b%2Fap25320366484685.jpg",
    "tag": "Politics",
    "date": "2025-11-16T10:51:14.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the religious sect Iglesia Ni",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Members of the religious sect Iglesia Ni Cristo (Church of Christ) gather during a three-day anti-corruption rally at Manila's Rizal Park, Philippines on Sunday, Nov. 16, 2025.\n                \n                    Mark Cristino/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Cristino/AP\n    \n\n   \n   MANILA, Philippines  — Hundreds of thousands of Filipinos gathered Sunday in the capital in the largest rally so far to demand accountability for a flood-control corruption scandal that has implicated powerful members of Congress and top government officials.   Various groups have protested in recent months following the discovery that thousands of flood defense projects across one of the world's most typhoon-prone countries were substandard, incomplete or simply did not exist.   Government engineers, public works officials and construction company executives have testified under oath in hearings by the Senate and a fact-finding commission that members of Congress and officials at the Department of Public Works and Highways took kickbacks from construction companies to help them win lucrative contracts and avoid accountability. Most denied the allegations.   \n   Interior Secretary Jonvic Remulla said about 320,000 members of the Iglesia Ni Cristo, or Church of Christ, led the start of the three-day rally in Manila's Rizal Park, many wearing white and carrying anti-corruption placards. Hundreds, including retired generals, held a separate anti-corruption protest late Sunday at the \"People Power\" monument in suburban Quezon city.   Iglesia is an influential group that votes as a bloc and is courted by political candidates during elections.   The police, backed by the military, went on full alert and deployed thousands of personnel to secure the weekend rallies, although the government expects them to be peaceful, according to a confidential security assessment seen by The Associated Press.   During a Sept. 21 anti-corruption demonstration, a few hundred black-clad protesters threw rocks, bottles and firebombs at police near the presidential palace in Manila, injuring more than 100 officers. Criminal complaints have been filed against 97 protesters.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A member of the religious sect Iglesia Ni Cristo (Church of Christ) looks on during a three-day anti-corruption rally at Manila's Rizal Park, Philippines on Sunday, Nov. 16, 2025.\n                \n                    Mark Cristino/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Cristino/AP\n    \n\n   \n   The presidential palace went on security lockdown over the weekend, with major access roads barricaded by anti-riot police, cargo containers and barbed wires.   National police chief Lt. Gen. Jose Melencio Nartatez Jr. ordered law enforcement to exercise \"maximum tolerance\" in Sunday's rallies.   Marcos promises quick action as outrage over corruption grows   Flood control is an especially sensitive issue in the Philippines, one of Asian countries most prone to deadly typhoons, flooding and extreme weather. Two typhoons left at least 259 dead this month, mostly from flash floods and landslides, and affected millions of others.   \n   President Ferdinand Marcos Jr. has been trying to quell public outrage and street protests sparked by the scandal, saying on Thursday that many of the powerful senators, members of Congress and wealthy businesspeople who were implicated would be in jail by Christmas.   Marcos said an independent fact-finding commission he created has already filed criminal complaints for graft and corruption and plunder against 37 suspects. Criminal complaints have also been filed against 86 construction company executives and nine government officials for allegedly evading nearly 9 billion pesos ($152 million) in taxes.   Among those accused are lawmakers opposed to and allied with Marcos, including former House of Representatives Speaker Martin Romualdez, the president's cousin and a key ally; and former Senate President Chiz Escudero. Both have denied any wrongdoing.   Sen. Bong Go, a key ally of former President Rodrigo Duterte, has also been accused of involvement in corruption in flood control and other infrastructure projects. He has denied the allegations.   Duterte, a harsh Marcos critic, was detained by the International Criminal Court in the Netherlands in March for alleged crimes against humanity over his brutal anti-drugs crackdowns.   His daughter, the current vice president, said Marcos should also be held accountable and jailed for approving the 2025 national budget, which appropriated billions for flood control projects.   There have been isolated calls, including by some pro-Duterte supporters, for the military to withdraw support from Marcos, but Armed Forces of the Philippines chief of staff Gen. Romeo Brawner Jr. has repeatedly rejected those calls.   \"With full conviction, I assure the public that the armed forces will not engage in any action that violates the Constitution,\" Brawner said. \"Not today, not tomorrow and certainly not under my watch.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds of thousands rally in Manila against flood-control corruption scandal",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8d%2F6b%2Fa0d1ca3447c3bdb17e3b8e557b8b%2Fap25320366484685.jpg"
      ],
      "datePublished": "2025-11-16T10:51:14.000Z",
      "dateModified": "2025-11-16T10:51:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds of National Guard troops will leave Portland and Chicago",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5610485/national-guard-chicago-portland-texas-california",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2531+0+234/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3e%2F58%2F42cb81804f91a405b8dbcf4628de%2Fgettyimages-2242927216.jpg",
    "tag": "Politics",
    "date": "2025-11-17T00:13:47.000Z",
    "description": "\n      \n      Hundreds of National Guard troops to leave Portland and Chicago \n    \n            \n                \n                Transcript\n         ",
    "body": "\n      \n      Hundreds of National Guard troops to leave Portland and Chicago \n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5610485/nx-s1-9536374\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Protesters march against the use of ICE and other federal law enforcement in Chicago on Oct. 25.\n                \n                    Kamil Krzaczynski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kamil Krzaczynski/AFP via Getty Images\n    \n\n   \n   The Defense Department is scaling back the number of federalized National Guard troops in Chicago and Portland, Ore., as weekslong court battles have stalled their deployments.   A defense official, not authorized to speak publicly, confirmed to NPR that 200 California National Guard members in Oregon and 200 Texas National Guard members in Illinois will return to their home states in the coming days. The troop withdrawals were first reported by ABC News.   On Friday night, the military's Northern Command hinted on X that changes were to come in order to \"ensure a constant, enduring, and long-term presence in each city.\"   \n   \"Our troops in each city (and others) are trained and ready, and will be employed whenever needed to support law enforcement and keep our citizens safe,\" U.S. Northern Command added.   \n   The defense official told NPR that the holidays may have also played a role in the decision to withdraw out-of-state troops.   About 300 Illinois National Guard personnel will remain activated in Chicago, while the number of Oregon National Guard forces in Portland will be reduced from 200 to 100, the defense official said.   Over the past six months, President Trump has ramped up the use of the National Guard — justifying the move as necessary to address crime, handle protests or protect federal buildings and personnel.   \n   Local and state officials in Oregon and Illinois have condemned the troop deployments, calling them unnecessary and accusing the president of overstepping his authority.   Courts have repeatedly blocked troops from conducting operations in the streets of Chicago and Portland after state and local leaders sued.   On Nov. 7, a federal judge in Oregon permanently blocked troop deployments to Portland — which the Trump administration appealed on Friday, according to court records. Meanwhile, the Supreme Court is considering an emergency appeal brought by the Trump administration to allow the president to deploy troops to Chicago.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds of National Guard troops will leave Portland and Chicago",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2531+0+234/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3e%2F58%2F42cb81804f91a405b8dbcf4628de%2Fgettyimages-2242927216.jpg"
      ],
      "datePublished": "2025-11-17T00:13:47.000Z",
      "dateModified": "2025-11-17T00:13:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In a shift, Trump says House Republicans should vote to release Epstein files",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5610552/trump-house-republicans-epstein-files",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5429x3054+0+225/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fea%2F14%2F3fe6a8614f9cbfff78019bc3f4b6%2Fap25291737779476.jpg",
    "tag": "Politics",
    "date": "2025-11-17T03:29:15.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Demonstrators hold signs asking for the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Demonstrators hold signs asking for the release of the Epstein files during a \"No Kings\" protest in downtown Las Vegas on Oct. 18, 2025.\n                \n                    Steve Marcus/AP/Las Vegas Sun\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Steve Marcus/AP/Las Vegas Sun\n    \n\n   \n   President Trump now says that House Republicans should vote to release the Epstein files \"because we have nothing to hide.\"   In a Truth Social post Sunday evening, he again called the issue a \"Democrat Hoax\" intended to \"deflect from the Great Success of the Republican Party.\"   Trump noted in the lengthy post that the Justice Department now has an additional investigation focused on Democrats who knew the convicted sex offender, at his request.   Trump has faced pressure from his own party to follow through on a campaign promise to release investigative files related to Epstein, creating rare fissures in the GOP. Most notably, he has withdrawn his endorsement for Georgia Republican Rep. Marjorie Taylor Greene, who has been a vocal proponent of the vote.   \n   The administration has released thousands of private files to the House Oversight Committee, but the Justice Department still has documents that have not been made public, including witness interviews.   Members of the House, including some Republicans, have forced a vote to release unclassified files held by the government. That vote is expected on Tuesday, according to a source familiar with the House schedule but not authorized to share details publicly.   It's unclear whether the Senate would take up the issue, in light of Trump's apparent endorsement of the move in the House. Trump himself would have to sign off on the release if it does pass both chambers.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In a shift, Trump says House Republicans should vote to release Epstein files",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5429x3054+0+225/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fea%2F14%2F3fe6a8614f9cbfff78019bc3f4b6%2Fap25291737779476.jpg"
      ],
      "datePublished": "2025-11-17T03:29:15.000Z",
      "dateModified": "2025-11-17T03:29:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about names such as Operation Charlotte's Web",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5610440/operation-names-charlottes-web-southern-spear",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2F23%2Fa86dcca248fc8f30447dbf9531f4%2Fgettyimages-2244880522.jpg",
    "tag": "Politics",
    "date": "2025-11-17T01:23:10.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Defense Secretary Pete Hegseth salu",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Defense Secretary Pete Hegseth salutes as he inspect a guard of honor during a welcoming ceremony prior to the 57rd Security Consultative Meeting (SCM) on Nov. 4 in Seoul, South Korea.\n                \n                    Jeon Heon-Kyun/Pool/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jeon Heon-Kyun/Pool/Getty Images\n    \n\n   \n   Recent operations under the Trump administration have raised eyebrows and drawn criticism, not only because of their missions but also because of their names and the intent behind them.   Defense Secretary Pete Hegseth on Thursday announced Operation Southern Spear, aimed at what he calls \"narco-terrorists\" who are allegedly bringing illegal drugs into the country. The Department of Homeland Security (DHS) on Saturday also announced it was launching Operation Charlotte's Web — matching the name of the classic children's book — in Charlotte, N.C., to target undocumented immigrants.   \"There is no parent who has read Charlotte's Web to a child who cannot be outraged by this,\" Dan Shapiro, who served as U.S. Ambassador to Israel from 2011 to 2017, wrote on X.   \n   Asked about the inspiration for the operation name and the message the agency wants to send by using it, DHS responded to NPR with a press release about the operation that included a statement from Assistant Secretary Tricia McLaughlin.   \"We are surging DHS law enforcement to Charlotte to ensure Americans are safe and public safety threats are removed,\" McLaughlin said in the statement. \"There have been too many victims of criminal illegal aliens. President Trump and Secretary Noem will step up to protect Americans when sanctuary politicians won't.\"   NPR also reached out to the Defense Department for comment but has not received a response.   Here is what to know about military operation names.   \n   Naming military operations is not new. Neither is criticism of names   Code names for U.S. military operations date back to the World War II era and began for security reasons, according to Lt. Col. Gregory C. Sieminski in the article \"The Art of Naming Operations,\" in The US Army War College Quarterly: Parameters. The names were based on colors at first, such as Operation Indigo, but as World War II spread, military officials switched to a name-based system that included projects and locations.   After the Vietnam War, military officials started using a computer system to reconcile nicknames and code words, called the Code Word, Nickname, and Exercise Term System, or NICKA.   \n   Routine military exercises use the NICKA system for naming operations, according to Mark Cancian, a retired Marine colonel and a senior adviser at the Center for Strategic and International Studies. Highly visible operations generally get two-word names chosen outside the system, such as operations Just Cause in Panama, Iraqi Freedom, and Enduring Freedom in Afghanistan, Cancian told NPR.   \"The ones that are chosen are chosen for a reason to project a message,\" Cancian told NPR. \"So, going back to Iraqi Freedom and Enduring Freedom, the message is freedom. With the recent ones, Midnight Hammer and Southern Spear, the message is lethality.\"   \n   Although DHS is not considered part of the U.S. military, using the name \"Charlotte's Web\" could also have been chosen because \"you've got the spider's web that catches people,\" but it could also be the administration trying to be \"tongue in cheek,\" he continued.   And other military operations have received backlash and criticism in the past, including what is now known as Operation Enduring Freedom. It was first called Operation Infinite Justice, but was changed after backlash that it was offensive to Muslims.   \"The fact that these names get scrutiny is not unusual,\" Cancian said. \"Now, I think in this case, given the administration's aggressive rhetoric, I think that inspires maybe pushback, but it's not unusual that names get a lot of scrutiny.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about names such as Operation Charlotte's Web",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fae%2F23%2Fa86dcca248fc8f30447dbf9531f4%2Fgettyimages-2244880522.jpg"
      ],
      "datePublished": "2025-11-17T01:23:10.000Z",
      "dateModified": "2025-11-17T01:23:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Politics chat: Trump scraps tariffs under pressure, House to vote on Epstein files",
    "url": "https://www.npr.org/2025/11/16/nx-s1-5607206/politics-chat-trump-scraps-tariffs-under-pressure-house-to-vote-on-epstein-files",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-16T12:48:57.000Z",
    "description": "\n      We discuss President Trump's attempts to tackle affordability, and a possible House vote this week on releasing files related to the sex traffi",
    "body": "\n      We discuss President Trump's attempts to tackle affordability, and a possible House vote this week on releasing files related to the sex trafficking investigation into Jeffrey Epstein.   \n\n    AYESHA RASCOE, HOST:  The federal government is gearing up for its first full week of work following the end of the shutdown, but the president is facing pressure on a number of issues, one of them being affordability. Traveling on Air Force One, he explained his decision to lift tariffs on a number of items.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: We just did a little bit of a rollback on some foods, like coffee as an example, where the prices of coffee were a little bit high. Now they'll be on the low side in a very short period of time.RASCOE: So where does this leave the president's signature economic policy? Joining me now to discuss that and much more is NPR senior political correspondent Mara Liasson. Good morning, Mara.MARA LIASSON, BYLINE: Good morning, Ayesha.RASCOE: So President Trump's appeared, you know, I mean, maybe a little bit more defensive in the last few days. What's behind that?LIASSON: What's behind it is his dropping poll numbers and his party's poor performance in the off-year elections, and he is trying to address this affordability issue. He's throwing some of his tariffs overboard. He announced on Friday he's scrapping U.S. tariffs on beef and coffee, tomatoes, some fruit. And this is a big backpedal for him.He's not stopping at tariffs. He is floating the idea of sending Americans rebate checks of $2,000 to buy health care. He's floated the idea of a 50-year mortgage. He's started an investigation of meat-packing plants. Recently, he signed a deal with drug companies to lower the price of obesity drugs.So this is a very big turnaround for a president who, until recently, was saying polls that showed voters' concerns about the cost of living were fake. He said the economy has been great. It's booming. Inflation was down. Now he seems to be acknowledging that prices are up and that his own tariffs are making these prices higher. This is a big reversal.RASCOE: A lot of these economic issues kind of feel a little bit like deja vu, right?LIASSON: Well, they're very similar to the problem that President Biden faced. Affordability was one of the big reasons Democrats lost in 2024. Biden kept on saying, just like Trump was, inflation is down. The economy is good. But that's not how voters felt. They don't care about the rate of inflation. Voters care about prices, whether they're higher or lower, and mostly, they're higher. And voters who are struggling with affordability feel like politicians who tell them the economy is great is - are insulting them. And it certainly didn't work for Biden, and it's a big challenge for Trump because with affordability, you can't just post your way or tweet your way out of it. You actually have to deliver, and that's hard.RASCOE: The government has reopened, and many federal workers are, you know, breathing a sigh of relief. But politically, how do you think the shutdown played out for the two parties?LIASSON: Well, one thing it did for Democrats was unite them in anger and frustration at Chuck Schumer, the minority leader in the Senate, who couldn't keep his party together. Democrats are angry at the eight Democratic senators who broke ranks and voted with Republicans to end the shutdown. They feel it was too soon, particularly after their triumph in the off-year elections. But the funding bill only goes till the end of January, so we'll get to do this again in a couple of months.And the other thing Democrats feel is a silver lining for them is they did get a vote on health care next month. Republican senators will get the choice to join with Democrats and extend the affordable care, Obamacare tax credit subsidies or not. Democrats feel they are on the right side politically of this issue, and they think they're going to put some pressure on Republicans.RASCOE: And Jeffrey Epstein is the scandal that, you know, just refuses to go away. House Speaker Mike Johnson said he'd put forward a bill this week that would compel the Department of Justice to release the complete Jeffrey Epstein files. What does all of this mean for the president?LIASSON: It means that the issue that Trump would like to disappear is not going away, and the reason there's going to be a vote next week in the House is because four Republicans joined the Democrats to sign what's called a discharge petition, which is a way that the rank and file in the House can circumvent leadership and bring a bill to the floor even if the speaker doesn't want it on the floor.This week, the House Oversight Committee released more than 20,000 documents related to convicted sex offender Jeffrey Epstein, including some emails from Epstein mentioning President Trump, but none of those emails were more incriminating than showing that Trump might have known more about Epstein than he has said he did. Trump is now trying to turn the tables. He's ordered Attorney General Pam Bondi to investigate Jeffrey Epstein's ties to Democrats, including former President Bill Clinton.RASCOE: And finally, Mara, an official told NPR the table is being set for possible military action in Venezuela. What more do we know?LIASSON: What we know from NPR's reporting is that the world's largest aircraft carrier, the USS Gerald Ford, will arrive in the northern Caribbean today, and it remains unclear if President Trump will actually use military force against Venezuela. He told reporters on Air Force One, quote, \"I sort of made up my mind,\" unquote, about whether to launch an attack. But he also said, I can't tell you what I've decided. So that's something to watch.RASCOE: That's NPR senior national political correspondent Mara Liasson. Thank you so much, Mara.LIASSON: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Politics chat: Trump scraps tariffs under pressure, House to vote on Epstein files",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-16T12:48:57.000Z",
      "dateModified": "2025-11-16T12:48:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge indefinitely bars Trump from fining UC over alleged discrimination",
    "url": "https://www.npr.org/2025/11/15/nx-s1-5609876/uc-university-california-discrimination-fine-ruling",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5548x3121+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F05%2Ff7%2F344f4ed04f64912d928034ad140e%2Fap25319068075884.jpg",
    "tag": "Politics",
    "date": "2025-11-15T15:51:31.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Students walk past Royce Hall on the Uni",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Students walk past Royce Hall on the University of California, Los Angeles campus on Aug. 15, 2024.\n                \n                    Damian Dovarganes/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Damian Dovarganes/AP\n    \n\n   \n   The Trump administration cannot fine the University of California or summarily cut the school system's federal funding over claims it allows antisemitism or other forms of discrimination, a federal judge ruled late Friday in a sharply worded decision.   \n   U.S. District Judge Rita Lin in San Francisco issued a preliminary injunction barring the administration from cancelling funding to UC based on alleged discrimination without giving notice to affected faculty and conducting a hearing, among other requirements.   The administration over the summer demanded the University of California, Los Angeles pay $1.2 billion to restore frozen research funding and ensure eligibility for future funding after accusing the school of allowing antisemitism on campus. UCLA was the first public university to be targeted by the administration over allegations of civil rights violations.   \n   It has also frozen or paused federal funding over similar claims against private colleges, including Columbia University.   In her ruling, Lin said labor unions and other groups representing UC faculty, students and employees had provided \"overwhelming evidence\" that the Trump administration was \"engaged in a concerted campaign to purge 'woke,' 'left,' and 'socialist' viewpoints from our country's leading universities.\"   \"Agency officials, as well as the President and Vice President, have repeatedly and publicly announced a playbook of initiating civil rights investigations of preeminent universities to justify cutting off federal funding, with the goal of bringing universities to their knees and forcing them to change their ideological tune,\" Lin wrote.   She added, \"It is undisputed that this precise playbook is now being executed at the University of California.\"   At UC, which is facing a series of civil rights probes, she found the administration had engaged in \"coercive and retaliatory conduct in violation of the First Amendment and Tenth Amendment.\"   \n   Messages sent to the White House and the U.S. Department of Justice after hours Friday were not immediately returned. Lin's order will remain in effect indefinitely.   University of California President James B. Milliken has said the size of the UCLA fine would devastate the UC system, whose campuses are viewed as some of the top public colleges in the nation.   UC is in settlement talks with the administration and is not a party to the lawsuit before Lin, who was nominated to the bench by President Joe Biden, a Democrat. In a statement, the university system said it \"remains committed to protecting the mission, governance, and academic freedom of the University.\"   \n   The administration has demanded UCLA comply with its views on gender identity and establish a process to make sure foreign students are not admitted if they are likely to engage in anti-American, anti-Western or antisemitic \"disruptions or harassment,\" among other requirements outlined in a settlement proposal made public in October.   The administration has previously struck deals with Brown University for $50 million and Columbia University for $221 million.   Lin cited declarations by UC faculty and staff that the administration's moves were prompting them to stop teaching or researching topics they were \"afraid were too 'left' or 'woke.'\"   Her injunction also blocks the administration from \"conditioning the grant or continuance of federal funding on the UC's agreement to any measures that would violate the rights of Plaintiffs' members under the First Amendment.\"   \n   She cited efforts to force the UCs to screen international students based on \"'anti-Western\" or \"'anti-American'\" views, restrict research and teaching, or adopt specific definitions of \"male\" and \"female\" as examples of such measures.   President Donald Trump has decried elite colleges as overrun by liberalism and antisemitism.   His administration has launched investigations of dozens of universities, claiming they have failed to end the use of racial preferences in violation of civil rights law. The Republican administration says diversity, equity and inclusion efforts discriminate against white and Asian American students.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge indefinitely bars Trump from fining UC over alleged discrimination",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5548x3121+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F05%2Ff7%2F344f4ed04f64912d928034ad140e%2Fap25319068075884.jpg"
      ],
      "datePublished": "2025-11-15T15:51:31.000Z",
      "dateModified": "2025-11-15T15:51:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]