[
  {
    "title": "Politics chat: Government shutdown looms, Kash Patel questioned, Trump attacks media",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5544413/politics-chat-government-shutdown-looms-kash-patel-questioned-trump-attacks-media",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-09-21T12:14:45.000Z",
    "description": "We look at the potential of a government shutdown, as well as FBI Director Kash Patel being questioned on the Jeffrey Epstein files he refuses to release, and Trump's attacks on the media.",
    "body": "<div>\n      <p>We look at the potential of a government shutdown, as well as FBI Director Kash Patel being questioned on the Jeffrey Epstein files he refuses to release, and Trump's attacks on the media.</p>   \n</div><div>\n    <p>AYESHA RASCOE, HOST: </p><p> With a looming government shutdown, top congressional Democrats have requested a meeting with President Trump because they say Republican leaders are refusing to engage in bipartisan negotiations. We're joined now by NPR senior national political correspondent Mara Liasson. Good morning, Mara.</p><p>MARA LIASSON, BYLINE: Good morning.</p><p>RASCOE: So it looks like Senate Democrats and Republicans can't even agree on a short-term spending bill. So where does that leave us?</p><p>LIASSON: It leaves us looking at a looming - at a possible government shutdown because it doesn't look like the Senate has come to any agreement. They can't pass a spending bill without Democratic votes, and Democrats say they won't agree to a bill that doesn't include an extension of Obamacare subsidies and a rollback of some of those Medicaid cuts that were in the One Big Beautiful Bill. The president has said he - originally that he didn't want to negotiate with Democrats, but now he says he'd love to meet with them, but he doesn't think it will come to much.</p><p>RASCOE: Well, on Friday, U.S. Attorney Erik Siebert of the Eastern District of Virginia resigned. He didn't say why he stepped down, but President Trump wanted him out, right?</p><p>LIASSON: That's right. President Trump wanted him out because he had asked - wanted Siebert to go after New York Attorney General Letitia James for mortgage fraud. Letitia James successfully prosecuted Trump in New York. But Siebert's office, after months of investigation, didn't find enough evidence to file charges. So he was pressured to resign. Trump actually said, he didn't resign. I fired him.</p><p>But now, in an extraordinary post on Truth Social, Donald Trump has ordered Pam Bondi, his attorney general, to prosecute his political opponents, including James, but also former FBI Director James Comey and California Democratic Senator Adam Schiff. Trump claims they are all, quote, \"guilty as hell.\"</p><p>And this is an escalation of Trump's decision to use the Department of Justice as the instrument about - of his campaign of revenge and retaliation. He promised he'd do this. He campaigned on this. And he has overturned a long-standing norm that presidents shouldn't interfere in law enforcement investigations. His critics say this is an attack on the rule of law.</p><p>RASCOE: That is extraordinary. We have to say that. FBI Director Kash Patel faced questions from the House Judiciary Committee on things like the firing of dozens of FBI agents and the release of the Jeffrey Epstein files. Specifically, Democratic lawmakers kept reminding Patel of all the times he said the FBI should release all of the files. But now that he's FBI director, he's not doing that, right?</p><p>LIASSON: No, he's not doing that, and there have been a lot of top officials like Kash Patel or Tulsi Gabbard or Robert F. Kennedy Jr., who have been called on the carpet to various degrees by Congress in hearings like this. But I don't think it matters much as long as Trump has their back.</p><p>And the big question for me that came out of the Kash Patel hearings is - beyond Kash Patel's future, is the future of the Epstein story and how much staying power it has, and whether now with everything else that's going on, it will be pushed out of people's attention span.</p><p>RASCOE: Well, I mean, it has some staying power in the U.K. That - activists were projecting images and news clips linking Trump to Epstein onto Windsor Castle during Trump's visit there last week. But while the president can't control criticism of him overseas, he is trying to do that here in the U.S., isn't he?</p><p>LIASSON: He certainly is. He's using every power at his disposal and some powers that experts say the Constitution does not put at his disposal to dominate or destroy institutions he feels are his opponents, whether they're law firms or universities. This week, it was the media. On Air Force One, he told reporters that the television networks, quote, \"only give me bad publicity. I think maybe their licenses should be taken away.\" We saw Jimmy Kimmel's late-night comedy show get pulled hours after FCC chair Brendan Carr suggested that if ABC's affiliates didn't drop the show, they might lose their licenses.</p><p>We also see the Pentagon 2now prohibiting reporters from obtaining any information, including unclassified information, without prior Pentagon approval, or they'll lose their press credentials. So this kind of crackdown is getting criticism from Trump's own supporters like Tucker Carlson and Ted Cruz, who say it's an attack on the First Amendment that could backfire on Trump.</p><p>RASCOE: That's NPR's Mara Liasson. Thank you so much, Mara.</p><p>LIASSON: You're welcome.</p>\n    <p>Copyright © 2025 NPR.  All rights reserved.  Visit our website <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179876898/terms-of-use\">terms of use</a> and <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179881519/rights-and-permissions-information\">permissions</a> pages at <a target=\"_blank\" href=\"https://www.npr.org/\">www.npr.org</a> for further information.</p>\n    <p>\n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    </p>\n</div>"
  },
  {
    "title": "How religion shaped Charlie Kirk's politics and his legacy",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5545640/how-religion-shaped-charlie-kirks-politics-and-his-legacy",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-09-21T12:47:21.000Z",
    "description": "We look at conservative activist Charlie Kirk's faith, and how it helped form him political beliefs.       AYESHA RASCOE, HOST:  Charlie Kirk's Christian faith was central to his life and his political...",
    "body": "<div>\n      <p>We look at conservative activist Charlie Kirk's faith, and how it helped form him political beliefs.</p>   \n</div><div>\n    <p>AYESHA RASCOE, HOST: </p><p> Charlie Kirk's Christian faith was central to his life and his political views. NPR political correspondent Sarah McCammon has been listening to some of Kirk's own words about his views on religion and politics, and she joins me now. Good morning.</p><p>SARAH MCCAMMON, BYLINE: Good morning, Ayesha.</p><p>RASCOE: So what do we know about Charlie Kirk's religious beliefs?</p><p>MCCAMMON: Well, Charlie Kirk often talked about his Christian faith. He spoke publicly about growing up attending Christian school and, like many evangelicals, said he made a decision at a young age to give his life to Jesus. In an interview six years ago with David Brody of the Christian Broadcasting Network, Kirk said that his faith had deepened around the time he got out of high school and founded Turning Point USA, his organization for young conservatives.</p><p>(SOUNDBITE OF ARCHIVED RECORDING)</p><p>CHARLIE KIRK: I started to experience real adversity. I started to come in a much closer relationship with Jesus Christ and reading my Bible more and becoming more essentially unapologetic about my Christianity 'cause I was given a choice. I could try to descend more into this kind of secular world or reaffirm my faith. And, you know, that's exactly what I did.</p><p>MCCAMMON: Now, Turning Point USA is a political organization that describes itself as training young people to promote ideas like free markets and limited government. But later, Kirk founded a spin-off group called TPUSA Faith whose mission is to, quote, \"eliminate wokeism from the American pulpit.\" That was more focused on churches. And while Kirk had friendly relationships with like-minded people of other faith traditions - including some politically conservative Jews and Roman Catholics, among others - he was himself a Protestant and specifically an Evangelical.</p><p>RASCOE: And how did his beliefs show up in politics?</p><p>MCCAMMON: Well, Kirk often referenced his Christian faith when he talked about political issues. For example, his belief that when it comes to helping the needy, churches - not the government - should be responsible. He also cited his faith in connection with some of his most controversial ideas. He described DEI - diversity, equity and inclusion - as unbiblical. He argued against abortion by saying that an embryo is, quote, \"a baby made in the image of God deserving of protection.\" And he described being transgender as, quote, \"a throbbing middle finger to God.\"</p><p>RASCOE: Critics have described Charlie Kirk as promoting Christian nationalism, or the belief that the American system of government should be based on Christianity. How did he talk about the connection between religion and politics?</p><p>MCCAMMON: You know, this is interesting, Ayesha. Earlier in his career, he expressed the view that Christian conservatives had, at times, gone too far in trying to impose their religious beliefs on the rest of society through politics. Back in 2018, while talking with the conservative podcaster David Rubin, Kirk said that had been a big mistake.</p><p>(SOUNDBITE OF ARCHIVED RECORDING)</p><p>KIRK: Because it created this kind of counter revolution, which is, I don't want to have to live the way some Christian in Alabama wants me to live. Does that make sense?</p><p>DAVID RUBIN: Yeah, yeah.</p><p>KIRK: So it's the imposition of those values through legislation and government, which is something I don't necessarily support, right?</p><p>RUBIN: Yeah.</p><p>KIRK: So I try to always advocate for every one of my political positions through a secular world view.</p><p>MCCAMMON: And at that point, Kirk said he believed in the separation of church and state, but he later reversed that and described that idea as a fabrication. Here he is last year, arguing that the U.S. was set up by and for not just Christians, but specifically Protestant Christians. And Kirk said he did not think the country could function well any other way.</p><p>(SOUNDBITE OF ARCHIVED RECORDING)</p><p>KIRK: The body politic of America was so Christian and was so Protestant that our form and structure of government was built for the people that believed in Christ, our Lord. One of the reasons we're living through a constitutional crisis is that we no longer have a Christian nation, but we have a Christian form of government, and they're incompatible. So you cannot have liberty if you do not have a Christian population.</p><p>MCCAMMON: So clearly, he went through a shift in his thinking about the proper role of religion in politics.</p><p>RASCOE: How is Kirk's faith shaping the way he's remembered?</p><p>MCCAMMON: Well, he was a polarizing figure in life and in his death. Some of his supporters are describing him as a martyr for the Christian faith. Here's Cissie Graham Lynch - the granddaughter of the late Reverend Billy Graham - comparing Kirk to Stephen, who's recognized as Christianity's first martyr.</p><p>CISSIE GRAHAM LYNCH: Charlie was a modern-day Stephen. His life, and now his death, testify that the gospel is worth everything.</p><p>MCCAMMON: Now, others worry about this framing. I spoke recently with a scholar of Christian nationalism, Matthew Bodie, at the University of North Georgia, who warns that this kind of talk can lead to escalation of both rhetoric and sometimes of violence. And he said that can ultimately be dangerous for everyone.</p><p>RASCOE: That's NPR's Sarah McCammon. Thank you so much.</p><p>MCCAMMON: Thank you.</p>\n    <p>Copyright © 2025 NPR.  All rights reserved.  Visit our website <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179876898/terms-of-use\">terms of use</a> and <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179881519/rights-and-permissions-information\">permissions</a> pages at <a target=\"_blank\" href=\"https://www.npr.org/\">www.npr.org</a> for further information.</p>\n    <p>\n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    </p>\n</div>"
  },
  {
    "title": "Erika Kirk says she forgives the man accused of killing her husband",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5549416/erika-kirk-speech-charlie-memorial-trump-robinson",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1068+0+162/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg",
    "tag": "Politics",
    "date": "2025-09-22T01:14:32.000Z",
    "description": "Erika Kirk, Charlie Kirk's widow, speaks at the memorial service for the right-wing activist at State Farm Stadium in Glendale, Ariz., on Sunday.                                    Patrick T. Fallon/AFP via...",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1898x1265+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2f%2F1e65a0934b8ea50418ca6372b7ea%2Fgettyimages-2236152780.jpg\" alt=\"Erika Kirk, Charlie Kirk's widow, speaks at the memorial service for the right-wing activist at State Farm Stadium in Glendale, Ariz., on Sunday.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Erika Kirk, Charlie Kirk's widow, speaks at the memorial service for the right-wing activist at State Farm Stadium in Glendale, Ariz., on Sunday.\n                <b>\n                    Patrick T. Fallon/AFP via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Patrick T. Fallon/AFP via Getty Images\n    </span>\n</p></div>\n   </div>\n   <p>Erika Kirk, widow of conservative activist Charlie Kirk, said she forgives her husband's alleged killer.</p>   <p>\"That man, that young man … I forgive him,\" Kirk said, wiping away tears as the audience <a href=\"https://www.npr.org/2025/09/21/nx-s1-5545613/charlie-kirk-funeral\" target=\"_blank\">at Kirk's memorial</a> at State Farm Stadium in Glendale, Ariz., erupted in applause on Sunday.</p>   <p>\"I forgive him because it was what Christ did and is what Charlie would do,\" she said. \"The answer to hate is not hate. The answer we know from the gospel is love and always love. Love for our enemies and love for those who persecute us.\"</p>   <p>Last week prosecutors <a href=\"https://www.npr.org/2025/09/16/nx-s1-5542545/utah-files-murder-charges-against-tyler-robinson\" target=\"_blank\">filed murder charges</a> against <a href=\"https://www.npr.org/2025/09/18/nx-s1-5544446/charlie-kirk-suspect-shooter-motive\" target=\"_blank\">22-year-old Tyler Robinson</a>. Officials said Robinson had admitted to shooting Kirk to his roommate, saying in a text message, \"I had enough of his hatred.\"</p>   \n   <p>Erika Kirk, who is 36 and the mother of two young children, tearfully described the moment she saw her husband's body at the hospital in Utah, hours after he was shot in the neck while debating college students at Utah Valley University.</p>   <p>\"I saw the wound that ended his life … I felt shock, I felt horror and a level of heartache that I didn't even know existed,\" Kirk said. \"But even in death, I could see the man that I loved. I saw the single gray hair on the side of his head, which I never told him about. I also saw in his lips the faintest smile. It revealed to me a great mercy from God in this tragedy. When I saw that, it told me Charlie didn't suffer.\"</p>   <p>Speaking to tens of thousands of people at the stadium, Kirk said she had found comfort in prayer and also in the way people had responded to her husband's death.</p>   <p>\"We didn't see violence, we didn't see riots. We didn't see revolution. Instead we saw what my husband always prayed he would see in this country: We saw revival. We saw people open a Bible for the first time in a decade,\" she said, urging people to continue doing so.</p>   \n   <p>\"Pray again, read the Bible again, go to church next Sunday, and the Sunday after that and break free from the temptations and shackles of this world,\" Kirk said.</p>   \n   <p>Her remarks came in striking contrast to both <a href=\"https://www.npr.org/2025/09/21/nx-s1-5545613/charlie-kirk-funeral\" target=\"_blank\">the vice president and president</a>, who bookended her speech. Vice President Vance said that \"evil still walks among us\" and that society \"shouldn't ignore it for a fake kumbaya moment.\" President Trump said: \"I hate my opponents and I don't want the best for them.\"</p>   <h3>Emphasis on the family</h3>   <p>Kirk had another message for the crowd, saying that the \"greatest cause in Charlie's life was trying to revive the American family.\"</p>   <p>\"When he spoke to young people, he was always eager to tell them about God's vision for marriage and how if they could just dare to live it out, it would enrich every part of their life in the same way that it enriched ours,\" she said.</p>   <p>She told the men in the audience to follow her husband's example in a Christian marriage where they are the spiritual heads of the family, who love and lead their wives and protect their children.</p>   <p>\"Please be a leader worth following,\" Kirk said. \"Your wife is not your servant. Your wife is not your employee. Your wife is not your slave. She is your helper. You are not rivals. You are one flesh, working together for the glory of God.\"</p>   <p>Kirk compared her husband to a martyr who died doing the will of God. She said, while her husband had died far too early, \"he was ready to die, he left this world without regrets\" because he had done \"100% of what he wanted to do every day.\"</p>   <p>\"He died with incomplete work but not with unfinished business,\" Kirk said.</p>   <p>Last week, Kirk was named the new <a href=\"https://www.npr.org/2025/09/19/nx-s1-5546856/erika-kirk-ceo-turning-point-usa-charlie-kirk-death\" target=\"_blank\">CEO of Turning Point USA</a>, the right-wing youth organization that her late husband founded.</p>\n</div>"
  },
  {
    "title": "In Chicago, ICE actions are triggering a new wave of political activism",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5538428/in-chicago-ice-actions-are-triggering-a-new-wave-of-political-activism",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-09-21T12:14:49.000Z",
    "description": "Many protestors responding to \"Operation Midway Blitz,\" the stepped-up immigration enforcement in Chicago, are politically active for the first time in their lives.       AYESHA RASCOE, HOST:  Chicago has a...",
    "body": "<div>\n      <p>Many protestors responding to \"Operation Midway Blitz,\" the stepped-up immigration enforcement in Chicago, are politically active for the first time in their lives.</p>   \n</div><div>\n    <p>AYESHA RASCOE, HOST: </p><p> Chicago has a long, proud history of activism and is considered by many the birthplace of community organizing. So it's no surprise that there's fierce opposition in the city to increased immigration enforcement. On Friday, Immigration and Customs Enforcement - or ICE - said it made 400 arrests since it launched Operation Midway Blitz two weeks ago. Resistance in the city is attracting many who are becoming politically active for the first time, as Jessica Pupovac reports.</p><p>(SOUNDBITE OF ARCHIVED RECORDING)</p><p>UNIDENTIFIED PROTESTER: (Chanting) No more suspicion (ph)...</p><p>UNIDENTIFIED PROTESTERS: (Chanting) No more suspicion (ph)...</p><p>UNIDENTIFIED PROTESTER: ...(Chanting) From fascist politicians.</p><p>UNIDENTIFIED PROTESTERS: ...(Chanting) From fascist politicians.</p><p>JESSICA PUPOVAC: Outside an ICE processing facility in the Chicago suburb of Broadview, armed federal agents in tactical gear and gas masks recently stared down about 50 demonstrators. Jose Richter (ph) stood toward the front, wearing a pro-Second Amendment hat. He was in his work clothes, a black security guard uniform with an American flag on the sleeve.</p><p>JOSE RICHTER: I do security at Navy Pier.</p><p>PUPOVAC: Have you been to many protests?</p><p>RICHTER: No. This is my first one.</p><p>PUPOVAC: Richter is a U.S. Army veteran, born in Mexico and adopted by a U.S. family as a child. He has legal status but said he's standing up for those who don't.</p><p>RICHTER: I never seen this, how they discriminate if you're Latino and looking at you like a criminal. That's not right. My old friends, they got deported already. They went to court. Not even 10 minutes, they were out of the courthouse, sent back to Mexico. And it shouldn't be like that. We're not in Russia. They need to stop it.</p><p>PUPOVAC: The Trump administration's crackdown on illegal immigration has sparked a wave of new organizing here and inspired many first-time activists like Richter and Kevin Naglich. Naglich used to work in cybersecurity. Now he's devoting most of his time to resisting Trump's second-term agenda, including his call for mass deportations.</p><p>KEVIN NAGLICH: Right out of the gate, this time was, you know, attacking all these pillars of democracy. I was just like, OK, well, I can either sit around, feel bad and do nothing or try to make a difference, and I chose the latter.</p><p>PUPOVAC: So he got to work. In February, Naglich started a northwest Chicago chapter of the progressive pro-Democracy group Indivisible. He says it's already attracted more than 3,000 members, most of them brand new to activism. And he's not alone. Other groups are forming networks to support their immigrant neighbors, canvassing door to door, helping them get their IDs and guardianship paperwork in order and walking children of immigrant parents to school if they're afraid to leave their homes. Others are protesting almost daily - outside a suburban hotel where ICE agents are believed to be staying, at the naval base north of Chicago where they train and at this ICE processing facility just west of the city.</p><p>(SOUNDBITE OF ARCHIVED RECORDING)</p><p>RACHEL COHEN: And I am so proud to be a Chicagoan. I am so proud...</p><p>PUPOVAC: Attorney Rachel Cohen is another new activist.</p><p>COHEN: And I am so proud to be in a community that shows up and says absolutely not.</p><p>PUPOVAC: Earlier this year, Cohen was a corporate finance attorney at one of the country's largest firms. But then her former firm pledged $100 million in pro bono legal services to causes backed by Trump after the White House threatened sanctions. She said that capitulation kept her up at night, and eventually it changed her life. She publicly quit her job in March and has since devoted herself to resisting the president's agenda, plugging into local efforts and sharing what she learns with her growing TikTok following.</p><p>COHEN: When you get off your couch and you stop scrolling and you plug into the community, you realize that things are very bad. But there are so many people who also see that for what it is, and you're motivated to keep going and keep showing up.</p><p>PUPOVAC: ICE agents have continued making arrests in Chicago and the suburbs this week, though it is unclear exactly how many. A DHS spokesperson told NPR the number is in the hundreds across Illinois. DHS Assistant Secretary Tricia McLaughlin this week blasted what she called the demonization of ICE agents by the media and, quote, \"leftist groups and sanctuary politicians.\" She says it puts ICE agents at risk and undermines public safety and national security. But Cohen and other activists here say they have no intention of stopping.</p><p>For NPR News, I'm Jessica Pupovac in Chicago.</p><p>(SOUNDBITE OF SHOOK'S \"WIND ON THE WATER\")</p>\n    <p>Copyright © 2025 NPR.  All rights reserved.  Visit our website <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179876898/terms-of-use\">terms of use</a> and <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179881519/rights-and-permissions-information\">permissions</a> pages at <a target=\"_blank\" href=\"https://www.npr.org/\">www.npr.org</a> for further information.</p>\n    <p>\n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    </p>\n</div>"
  },
  {
    "title": "Trump nominates White House aide to be top U.S. prosecutor for office probing Letitia James",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5549086/trump-nominates-white-house-aide-top-us-prosecutor-probing-letitia-james",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x2958+0+274/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg",
    "tag": "Politics",
    "date": "2025-09-21T10:06:39.000Z",
    "description": "President Donald Trump said Saturday that he would be nominating senior White House aide Lindsey Halligan to serve as the top federal prosecutor for the Virginia office that was thrown into turmoil when its U.S. attorney was pushed out Friday.",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5258x3505+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Feb%2F21%2Fb81510fa482e8832f5f08295ecc6%2Fap25264063869898.jpg\" alt=\"FILE - Lindsey Halligan, special assistant to the president, speaks with a reporter outside of the White House, Wednesday, Aug. 20, 2025, in Washington.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                FILE - Lindsey Halligan, special assistant to the president, speaks with a reporter outside of the White House, Wednesday, Aug. 20, 2025, in Washington.\n                <b>\n                    Jacquelyn Martin/AP\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Jacquelyn Martin/AP\n    </span>\n</p></div>\n   </div>\n   <p>WASHINGTON — President Donald Trump said Saturday that he would be nominating senior White House aide Lindsey Halligan to serve as the top federal prosecutor for the Virginia office that was thrown into turmoil when its U.S. attorney was pushed out Friday.</p>   <p>In a social media post just after he departed the White House for an event at Mount Vernon, Trump wrote he was nominating Halligan as U.S. attorney for the Eastern District of Virginia, writing that she \"will be Fair, Smart, and will provide, desperately needed, JUSTICE FOR ALL!\"</p>   <p>The announcement came as Trump pressed Attorney General Pam Bondi to move forward with pursuing cases against some of his political opponents, part of a vow for retribution that has been a theme of his return to the White House.</p>   \n   <p>The nomination would place one of the president's legal defenders in charge of an office in tumult over political pressure by administration officials to criminally charge New York Attorney General Letitia James, a longtime foe of Trump, in a mortgage fraud investigation.</p>   \n   <p>Erik Siebert, who had been the office's top prosecutor, resigned amid a push by Trump administration officials to bring charges in the investigation, which stems from allegations of paperwork discrepancies on James' Brooklyn townhouse and a Virginia home.</p>   <p>The Justice Department has spent months investigating, and there's been no indication that prosecutors have managed to uncover any degree of incriminating evidence necessary to secure an indictment. James' lawyers have vigorously denied any allegations and characterized the investigation as an act of political revenge.</p>   <p>Halligan has been part of Trump's legal orbit for the last several years, including serving as one of his attorneys in the early days of the FBI's investigation into Trump's retention of classified documents at his Mar-a-Lago estate in Florida. She has more recently been enlisted in a White House effort to remove what the administration contends is \"improper ideology\" from Smithsonian properties.</p>   \n   <p>Earlier Saturday, Trump posted to social media what appeared to be somewhat of an open letter to Bondi, saying he had \"reviewed over 30 statements and posts\" that he characterized as criticizing his administration for a lack of action on investigations, including the one into James' dealings. Trump's message mentioned former FBI Director James Comey, Trump's longtime foil whom he fired during his first term amid the Russia election interference investigation.</p>   <p>The FBI acknowledged this summer that it was investigating Comey, who was interviewed by the Secret Service after an Instagram post that Republicans insisted was a call for violence against Trump. Comey has said he did not mean the post as a threat and removed it once he realized how it was being interpreted.</p>   \n   <p>Asked as he departed the White House if he was criticizing Bondi, Trump said he just wanted action.</p>   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5350x3567+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd1%2Fb4%2F291aacd5436ca17f25689ae5fd96%2Fap25262628693984.jpg\" alt=\"FILE - New York Attorney General Letitia James speaks, Feb. 16, 2024, in New York. (AP Photo/Bebeto Matthews, File)\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                FILE - New York Attorney General Letitia James speaks, Feb. 16, 2024, in New York. (AP Photo/Bebeto Matthews, File)\n                <b>\n                    Bebeto Matthews/AP\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Bebeto Matthews/AP\n    </span>\n</p></div>\n   </div>\n   <p>\"We have to act fast — one way or the other,\" Trump said. \"They're guilty, they're not guilty — we have to act fast. If they're not guilty, that's fine. If they are guilty or if they should be charged, they should be charged. And we have to do it now.\"</p>   <p>In announcing Halligan's nomination soon after on social media, Trump said that Bondi was \"doing a GREAT job.\"</p>   <p>The selection of Halligan came just hours after another conservative lawyer, Mary \"Maggie\" Cleary, said in an email to staff that she had been named acting U.S. attorney for the Eastern District of Virginia, according to a copy viewed by The Associated Press.</p>   <p>\"While this appointment was unexpected, I am humbled to be joining your ranks,\" Cleary, a conservative lawyer who has said she was falsely accused of being at the U.S. Capitol on Jan. 6, 2021, told employees in the email.</p>   <p>While Siebert said in an email to colleagues Friday evening that he had submitted his resignation, Trump said in a social media post: \"He didn't quit, I fired him!\" Trump noted he was backed by the state's two Democratic senators, Mark Warner and Tim Kaine, adding: \"Next time let him go in as a Democrat, not a Republican.\"<br /></p>\n</div>"
  },
  {
    "title": "Minnesota lawmakers from across the aisle discuss gun violence and the political climate",
    "url": "https://www.npr.org/2025/09/21/nx-s1-5545706/minnesota-lawmakers-from-across-the-aisle-discuss-gun-violence-and-the-political-climate",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-09-21T12:14:57.000Z",
    "description": "NPR's Ayesha Rascoe asks Minnesota lawmakers Lisa Demuth and Erin Murphy about prospects for gun violence legislation in a special session.       AYESHA RASCOE, HOST:  Students returned to classrooms at...",
    "body": "<div>\n      <p>NPR's Ayesha Rascoe asks Minnesota lawmakers Lisa Demuth and Erin Murphy about prospects for gun violence legislation in a special session.</p>   \n</div><div>\n    <p>AYESHA RASCOE, HOST: </p><p> Students returned to classrooms at Annunciation Catholic School in Minneapolis on Tuesday for the first time since a gunman killed two children and injured 21 other students and parishioners at a mass there. Tuesday was also the day voters filled the seat left vacant by the murder of Minnesota lawmaker Melissa Hortman. Speaker Emerita Hortman was shot in her home earlier this summer, the same night state Senator John Hoffman was also shot and injured in his home. Now Governor Tim Walz says he wants a special session of the legislature to address the state's gun laws. Republican Lisa Demuth is Minnesota's current House speaker, and she joins us now. Welcome.</p><p>LISA DEMUTH: Thank you, Ayesha. Good to talk with you.</p><p>RASCOE: And on the other side of the Capitol and the aisle is state Senator Erin Murphy, a Democrat. Welcome to you, as well.</p><p>ERIN MURPHY: It's good to be with you.</p><p>RASCOE: So for both of you, I mean, so much has happened in your state in the last few months, how are you both doing?</p><p>DEMUTH: In Minnesota, that is such a common question that we get, and I fail to come up with the correct answer. I don't know that there is a right answer, but I think as we continue to heal, we are resilient, but it is a very painful time.</p><p>RASCOE: And Senator Murphy?</p><p>MURPHY: I think the best answer I can give is I'm doing well enough today. And I'd served with Speaker Emerita Hortman for all of my career, and she was well known and deeply loved. The recovery for all of us is going to take some time.</p><p>RASCOE: Speaker Demuth, I know you had a special and a close relationship with Melissa Hortman, as well.</p><p>DEMUTH: I did. When I first came into the legislature in 2019, Speaker Emerita Hortman was the speaker then. She is the only one that I served under until we came back this year in the tie, and I became speaker of the House. But our working relationship really developed in 2023, when my party was in the minority. Speaker Hortman, at the time, they were in the full majority in the state. And yet as a new minority leader, she reached out to me and said, I want to meet weekly with you.</p><p>And she didn't need my votes, but it was important to her that we would develop a working relationship. Even though we didn't agree politically, we found common ground what could we get done or kind of where we were both at on issues, but also things outside of that. Her love for gardening. Her love for dogs. Common things - talking about just being parents. And so that relationship and the way she led as a leader has really formed the way I do my work as speaker of the House now.</p><p>RASCOE: Talking about working across the aisles, like, if Governor Walz does call a special session on gun violence, what realistically could be accomplished?</p><p>DEMUTH: The way that we are looking at it in the House, specifically House Republicans, is it's broader than that. We have to look at mental health. We also have to look at keeping our schools safe and then punishing criminals. There was a tragedy in my community, in my schools, in 2003, and I had children in the building. And so I don't just say this as an elected official or speaker of the House. It is a much broader issue of mental health and how we treat each other.</p><p>RASCOE: And just to follow up on that. So your own children were affected by a school shooting, and it was in Cold Spring, Minnesota, in 2003?</p><p>DEMUTH: That is correct. I had two high school students in the building at the time, and then I had two elementary students that were just across the parking lot. And so as a family and as a community, we've lived that. So I understand it from a little bit different perspective, and that's what I bring into the work that we do in the legislature also.</p><p>RASCOE: Did someone die in that shooting?</p><p>DEMUTH: There were two students that lost their lives. One that day and one just a short two weeks later.</p><p>RASCOE: Well, Senator Murphy, what do you think the approach should be?</p><p>MURPHY: I'm - my background, I'm a nurse and come to this discussion through a lens of prevention and well-being and health. And with Speaker Demuth and the governor, went to the funeral for Fletcher, one of the children killed in Annunciation. And then went to the funeral for Harper, a little girl who was killed in Annunciation. And feel the presence of their stories and their grief and their loss as I think about the work in front of us. We can't go into a special session and not talk about assault weapons. They are weapons of war, intended to harm, destroy and kill in rapid fire.</p><p>And what we saw happen at Annunciation to those families and to those kids was someone standing outside with a high-powered weapon, shoot and harm so many people in a short amount of time. And those children will tell you the story of what they knew. They knew because they'd been through drills that they needed to lay on top of the youngest kids to protect them. They knew what to do. And that by itself, to me, says our politics - something I believe so deeply in our ability in a self-governing America to solve our hard problems. Our politics are failing right now on this issue.</p><p>RASCOE: I do feel like what we're seeing in the conversation we're having right now is what happens, seems to happen over and over again after shootings. Republicans saying, harden the schools, focus on mental health. And then you have Democrats saying, focus on the type of weaponry. Like, how does anything get done?</p><p>MURPHY: We don't agree necessarily on this issue, but I do believe that it is possible for us to find a path forward. As we negotiated probably one of the hardest budgets that I ever have back in June, that was a hard-fought compromise, and we all gave things up. But we got our job done because we all agreed that we shouldn't fail Minnesota.</p><p>DEMUTH: In the House, right now, we are tied 67-67. And what that has done this year is it has required that we work together in a bipartisan fashion. And what that meant is we have co-chairs in every single one of our committees. So Democrats and Republicans have already proven this year that through deliberative legislative action, we can get things done. They're not fast conversations. They're not do this and hope it works but really, really deliberative.</p><p>RASCOE: I want to talk about the heated and divisive political climate we're in right now. I mean, each side is calling the other side evil. We have to be honest about that.</p><p>MURPHY: What I feel alarmed about, Ayesha, is the thing that I watched happen on the day that Melissa and Mark were assassinated and John was wounded. And again, on the day of the school shooting, and again, on the day that Charlie Kirk was killed. There were efforts in social media to drive a narrative and ascribe blame for what happened from a partisan perspective. And it feels like the extremism that is experienced around the world, it's finding its way into the day-to-day work of legislating.</p><p>A number of my colleagues, but one in particular, has experienced over the course of this last weekend a number of death threats coming not just from Minnesota but from other parts of the country, and they are crude and violent in writing threats. That doesn't serve Democratic governing at all. We can't lead in America if we are operating under that kind of fear. Yes, we disagree, and we should be able to say that. Yes, we have free speech rights, and we should speak what we believe. But we shouldn't turn it into such a personal attack that it becomes weaponized.</p><p>RASCOE: Speaker Demuth, do you feel that partisanship has blinded people to others' humanity?</p><p>DEMUTH: In Minnesota, with the hard things that have happened, one of the things that we have talked about with some of my colleagues is people express their grief differently, and we need to give grace in grief. As far as the partisanship of politics, we have to work together and get things done for the greater good. And it takes each one of us individually to try to tone down the way we speak or speak more with kindness, even while there's a strength in getting things done.</p><p>MURPHY: I think Americans need to start looking up and seeing each other again because the path forward for our country, every time we've been in a bad corner like this, is with each other. And I have faith that when we see each other for who we are as people, we will find our way forward.</p><p>RASCOE: That's state Senator Erin Murphy. Also, we heard from Lisa Demuth, speaker of the Minnesota House. Thanks to you both.</p><p>MURPHY: Thank you.</p><p>DEMUTH: Thank you.</p>\n    <p>Copyright © 2025 NPR.  All rights reserved.  Visit our website <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179876898/terms-of-use\">terms of use</a> and <a target=\"_blank\" href=\"https://www.npr.org/about-npr/179881519/rights-and-permissions-information\">permissions</a> pages at <a target=\"_blank\" href=\"https://www.npr.org/\">www.npr.org</a> for further information.</p>\n    <p>\n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    </p>\n</div>"
  },
  {
    "title": "The evangelical Christian faith on display at Kirk's memorial shaped his politics",
    "url": "https://www.npr.org/2025/09/22/nx-s1-5549402/charlie-kirk-evangelical-christian-worship-martyr",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+625/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg",
    "tag": "Politics",
    "date": "2025-09-22T09:00:00.000Z",
    "description": "Charlie Kirk's evangelical faith was on display at his memorial, where supporters remembered him as a \"martyr.\" Christianity shaped Kirk's politics and the two became more intertwined as he got older.",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2Fb5%2Fbcff0f8941b9a7045c2dfcae6571%2Fgettyimages-2236104957.jpg\" alt=\"Items are displayed in the makeshift memorial for Charlie Kirk outside the headquarters of Turning Point USA on Sept. 18, 2025, in Phoenix, Arizona.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Items are displayed in the makeshift memorial for Charlie Kirk outside the headquarters of Turning Point USA on Thursday in Phoenix.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <p>Charlie Kirk's evangelical faith was on display at his memorial service this weekend in Arizona.</p>   <p>The service, held on a Sunday morning, felt much like a <a href=\"https://www.npr.org/2025/09/21/nx-s1-5545613/charlie-kirk-funeral\" target=\"_blank\">worship service</a>, complete with prayers, songs and a call from <a href=\"https://www.npr.org/2025/09/19/nx-s1-5546856/erika-kirk-ceo-turning-point-usa-charlie-kirk-death\" target=\"_blank\">Kirk's widow</a> to \"forgive\" Kirk's alleged killer \"because it was what Christ did.\"</p>   <p>The event opened with performances of contemporary Christian worship music and Kirk's colleagues and friends referred to him as both a prophet and a martyr.</p>   <p>Vice President Vance said that he talked more about his faith in the two weeks since Kirk's assassination than he had in his entire public life. He thanked Kirk for championing his political career from the beginning, when he was still a long-shot candidate for one of Ohio's U.S. Senate seats.</p>   \n   <p>President Trump, who spoke last, described the event as an \"old-time revival.\" He called Kirk, a conservative activist, \"our greatest evangelist for American liberty\" and \"a martyr now for American freedom.\"</p>   <p>Kirk's faith was central both to his life and to his political views. He grew up attending Christian school and, like many evangelicals, said he <a href=\"https://www.youtube.com/watch?v=9OJe5sNHMsQ\" target=\"_blank\">made a decision</a> at a young age to give his life to Jesus.</p>   <p>In an interview six years ago with David Brody of the Christian Broadcasting Network, Kirk <a href=\"https://www.youtube.com/watch?v=Ic0NE11ao1I\" target=\"_blank\">said his faith</a> had deepened around the time he got out of high school and founded Turning Point USA.</p>   <p>\"I started to come in a much closer relationship with Jesus Christ and reading my Bible more and becoming more, essentially, unapologetic about my Christianity,\" Kirk said. \"I was given a choice; I could try to descend more into this kind of secular world, or reaffirm my faith, and that's exactly what I did.\"</p>   <p>After founding Turning Point USA, a political organization for young conservatives that describes itself as training young people to promote ideas like free markets and limited government, Kirk later founded the more explicitly religious TPUSA Faith, whose mission is to \"eliminate wokeism from the American pulpit.\"</p>   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3934+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F53%2F1d%2Fec5c0b214e56ae933594012a0ce3%2Fgettyimages-2236104805.jpg\" alt=\"A supporter prays at the makeshift memorial for Charlie Kirk outside of the headquarters of Turning Point USA on Sept. 18, 2025 in Phoenix, Arizona.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A supporter prays at the makeshift memorial for Charlie Kirk outside of the headquarters of Turning Point USA on Thursday in Phoenix.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <p>Kirk often referenced his Christian faith when he talked about political issues, such as his belief that when it comes to helping the needy, churches — <a href=\"https://www.youtube.com/watch?v=8rze5WSL-F4\" target=\"_blank\">not the government</a> — should be responsible.</p>   \n   <p>He cited his faith in connection with many of his most controversial ideas. He <a href=\"https://www.youtube.com/watch?v=yFFPgN_u6aY\" target=\"_blank\">described DEI</a>, or diversity equity and inclusion, as \"unbiblical.\" He argued <a href=\"https://www.youtube.com/watch?v=S0XT0sMZrBg\" target=\"_blank\">against abortion</a> by saying that an embryo is \"a baby made in the image of God deserving of protection.\" And he <a href=\"https://www.advocate.com/politics/charlie-kirk-anti-lgbtq-quotes?utm_campaign=trueanthem&utm_medium=social&utm_source=facebook\" target=\"_blank\">described being transgender</a> as \"a throbbing middle finger to God.\"</p>   <p>Kirk appeared to experience a shift in his thinking about the proper role of religion in politics over the course of his public life.</p>   <p>Earlier in his career, he expressed the view that Christian conservatives had at times gone too far in trying to impose their religious beliefs on the rest of society through politics. In 2018, while talking with the conservative podcaster David Rubin, he said he believed that was a mistake.</p>   <p>\"It's the imposition of those values through legislation and government which is something I don't necessarily support. So I try to always advocate for every one of my political positions through a secular worldview,\" Kirk said.</p>   <p>At that time, Kirk went on to say that he believed in the separation of church and state. But he later reversed that and described the idea as a \"fabrication.\"</p>   <p>More recently, Kirk argued that the U.S. was <a href=\"https://www.facebook.com/watch/?v=1654440391556075\" target=\"_blank\">set up by and for</a> not just Christians, but specifically Protestant Christians. Kirk said he didn't believe the country could function well any other way.</p>   <p>\"The body politic of America was so Christian and was so Protestant that our form and structure of government was built for the people that believed in Christ our Lord,\" Kirk said in 2024. \"One of the reasons we're living through a constitutional crisis is that we no longer have a Christian nation, but we have a Christian form of government, and they're incompatible. So you cannot have liberty if you do not have a Christian population.\"</p>   \n   <p>Soon after Kirk's death on Sept. 10, evangelical leaders were already labelling him a martyr. Cissie Graham Lynch, the granddaughter of the late evangelical leader, the Rev. Billy Graham, <a href=\"https://cissiegrahamlynch.com/reflecting-on-charlie-kirk-will-courage-and-faith-define-us/\" target=\"_blank\">compared Kirk to \"a modern-day Stephen</a>,\" referring to the man recognized as Christianity's first martyr.</p>   <p>Other observers <a href=\"https://www.washingtonpost.com/opinions/2025/09/18/charlie-kirk-evangelical-christian-martyr-politics/\" target=\"_blank\">are concerned</a> by this kind of framing. Matthew Boedy, an English professor at the University of North Georgia who studies Christian nationalism, warns that talk of martyrdom can lead to dangerous and sometimes violent escalation.</p>   <p>\"The reason that it's dangerous is because we can see throughout the history of the church, using 'martyrdom' often rallies people to go after their enemies and to commit crusades of different types,\" Boedy <a href=\"https://www.wbur.org/hereandnow/2025/09/12/charlie-kirk-higher-education\" target=\"_blank\">recently told</a> NPR and WBUR's <em>Here & Now.</em><br /></p>\n</div>"
  },
  {
    "title": "Wary of changes under Trump, 'citizen historians' are documenting the Smithsonian",
    "url": "https://www.npr.org/2025/09/22/nx-s1-5517973/smithsonian-document-citizen-historians",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x1701+0+908/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg",
    "tag": "Politics",
    "date": "2025-09-22T09:01:31.000Z",
    "description": "Historians and citizens who say they are concerned about the Trump administration's pressure on the Smithsonian are working to document exhibits, as they exist today, throughout the museum network.",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3024x2367+0+897/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F39%2F6759b630473d9b946142393ad18c%2Fimg-6228.jpg\" alt=\"Shelley Smith, a retired public health professional, is one of hundreds of volunteers documenting wall text, objects and images at the Smithsonian as part of an effort to document what's there now before any changes are made as a result of the Trump Administration's continued pressure on the institution.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Shelley Smith, a retired public health professional, is one of hundreds of volunteers taking part in an effort to document wall text, objects and images at the Smithsonian.\n                <b>\n                    Elizabeth Blair/NPR\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Elizabeth Blair/NPR\n    </span>\n</p></div>\n   </div>\n   <p>Early in his second term, President Trump issued an executive order that <a href=\"https://www.npr.org/2025/03/28/nx-s1-5343524/smithsonian-trump-executive-order\" target=\"_blank\">claimed</a> the Smithsonian Institution promotes \"narratives that portray American and Western values as inherently harmful and oppressive.\" And in mid-August, Trump administration officials sent Smithsonian Secretary Lonnie G. Bunch III a <a href=\"https://www.npr.org/2025/08/12/nx-s1-5500550/smithsonian-trump-review\" target=\"_blank\">letter</a> requiring a \"comprehensive internal review\" of eight Smithsonian museums including American History, American Art Museum, Natural History and Air & Space.</p>   <p>Now, historians and citizens concerned about the Trump administration's approach to, and involvement in, the Smithsonian have come together to document how the museums look today. Their goal is to produce a record before any changes that might be made.</p>   \n   <p>Two historians in particular put out the call for help. One, Georgetown University professor Jim Millward, said the Trump administration's pressure on the Smithsonian has him alarmed. \"I'm a historian of China, and so I'm really used to when governments are stepping in trying to whitewash history and censor history like that,\" he said. \"And it really upset me to see this being threatened in the United States as well.\"</p>   <p>Millward's colleague, historian Chandra Manning, was equally concerned, so the two of them got together to hatch a plan. \"As citizens, we wanted to find a way to step forward and steward this national treasure for now and for the future,\" said Manning.</p>   <p>Manning said they took inspiration from \"<a href=\"https://sites.google.com/umn.edu/save-our-signs/home\" target=\"_blank\">Save Our Signs</a>,\" which was created in response to the Trump administration's <a href=\"https://www.npr.org/2025/09/17/nx-s1-5540117/government-moves-to-national-scrub-park-sites-of-negative-history\" target=\"_blank\">call</a> for visitors to report signs in National Parks that are \"negative about either past or living Americans.\" Hundreds of visitors photographed signs to help create an archive of what the signs said before any changes were made.</p>   <p>\"<a href=\"https://www.citizenhistorians.org/\" target=\"_blank\">Citizen Historians</a>\" aims to do the same for the Smithsonian, said Millward.</p>   <p>\"So<strong> </strong>we came up with this idea to call for volunteers to go out and, in a systematic way, go exhibit by exhibit, room by room, hall by hall, museum by museum, and take pictures simply of what's up there now and what's being said now,\" he said.</p>   \n   <h3>A vast \"repository of human wisdom\"</h3>   <p>This is a massive undertaking. There are millions of artifacts, objects, specimens and artworks on view at the Smithsonian's 21 museums.</p>   \n   <p>\"The range is really quite breathtaking,\" said Manning, \"from Jackie Robinson's jersey to prehistoric skeletons to Ming vases. It really is a repository of human wisdom right here in Washington, D.C.\"</p>   <p>The historians sent their request for volunteers to friends, neighbors and colleagues. The only requirement was a smartphone and a desire \"to join us to help save our history,\" according to the letter, which was shared with NPR.</p>   <p>Millward said hundreds of people responded.</p>   <p>\"The volunteers run the gamut. Young and old people from all over D.C., Maryland and Virginia,\" he said. \"Some had worked at the Smithsonian before, maybe as docents or even as employees, but many had not. They'd simply visited the Smithsonian themselves over the years and had a real feeling of how important it was.\"</p>   <h3>\"Citizen historians\" with smartphones</h3>   <p>Volunteer Shelley Smith, a retired public health professional, was assigned the gallery \"Forces for Change: Mary McLeod Bethune and Black Women's Activism\" at National Museum of African American History and Culture</p>   \n   <p>In 1904, Bethune started a school for Black girls in Daytona Beach, Fla. She went on to become a prominent civil rights activist and the first African American to have a state-commissioned statue in the U.S. Capitol, of which a replica is in the gallery. Among the other influential Black women honored are Mamie Till-Mobley, Shirley Chisholm, Lena Horne, Oprah Winfrey and poet Amanda Gorman.</p>   <p>Smith photographed everything: a small diary Bethune kept when she visited Europe in 1927, the historic images, the wall text.</p>   <p>\"You see history in a different light,\" she said, \"They tell the story from a lot of different angles. And so it was just so important to document what the people that initiated this museum and project wanted to be out there and wanted to be said.\"</p>   \n   <p>Millward said he believes museums should change with the times based on scholarly research and historic oversights, not with political pressure.</p>   <p>\"We don't want a museum that doesn't deal with sensitive issues. We want one that's honest and can talk about the whole range of our history and culture,\" he said.</p>   <p>According to Millward, volunteers have so far uploaded more than 25,000 photographs and videos from Smithsonian museums to a temporary storage site. He and his colleagues are looking for a permanent home for the images. You can<a href=\"https://www.citizenhistorians.org/post/citizen-historians-newsletter-9-12-25\" target=\"_blank\"> follow their progress here</a>.</p>   \n</div>"
  },
  {
    "title": "After Charlie Kirk's murder, some Republicans talk revival as others seek retribution",
    "url": "https://www.npr.org/2025/09/22/nx-s1-5549407/charlie-kirk-memorial-republican-party-trump-revival-retribution",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x2854+0+264/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg",
    "tag": "Politics",
    "date": "2025-09-22T09:00:00.000Z",
    "description": "President Trump speaks during the memorial service for political activist Charlie Kirk at State Farm Stadium on Sunday in Glendale, Ariz.                                    Joe Raedle/Getty...",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/900/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1200/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/900/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 900w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1200/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1200w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg 1800w\" sizes=\"(min-width: 1025px) 650px, calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5073x3382+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2Fb3%2F73781656450cb703a2acb4f4dcb6%2Fgettyimages-2236633777.jpg\" alt=\"President Trump speaks during the memorial service for political activist Charlie Kirk at State Farm Stadium on September 21, 2025 in Glendale, Arizona.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                President Trump speaks during the memorial service for political activist Charlie Kirk at State Farm Stadium on Sunday in Glendale, Ariz.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <p>For prominent Republicans, the two main reactions to the assassination of Charlie Kirk have been a resolve to continue his conservative political organizing work and, for some, a push to blame — in the words of President Trump — \"radical-left lunatics.\"</p>   <p>The contrasting views were most notably on display at the close of<a href=\"https://www.npr.org/2025/09/21/nx-s1-5545613/charlie-kirk-funeral\" target=\"_blank\"> Kirk's memorial service</a> in a stadium filled to capacity in Arizona on Sunday, where Kirk's widow, Erika, gave an emotional remembrance grounded in the faith of her husband, who \"wanted to save young men, just like the one who took his life.\"</p>   <p>\"On the cross, our savior said: 'Father, forgive them, for they know not what they do,'\" Kirk said. \"That man — that young man — I forgive him. I forgive him because it's what Christ did. And it's what Charlie would do.\"</p>   \n   <p>Kirk went on to say that \"the answer to hate is not hate. The answer — we know from the Gospel — is love.\" </p>   <p>For most of the memorial, Kirk's friends, allies and supporters spoke about the growth of his conservative operation from an idea in 2012 into one of the most influential organizations in modern politics, emphasizing his personal character and a vision rooted in their shared faith for carrying on his work.</p>   <p>While President Trump described Kirk as a \"missionary with a noble spirit,\" he said he disagreed with his views on those with different opinions.</p>   <p>\"He did not hate his opponents, he wanted the best for them,\" Trump said. \"That's where I disagreed with Charlie. I hate my opponent. I don't want the best for them.\"</p>   <p>In the days since Kirk was shot and killed on the campus of Utah Valley University, Kirk's <a href=\"https://www.npr.org/2025/09/10/nx-s1-5537045/charlie-kirk-shot-utah\" target=\"_blank\">legacy as a youth organizer</a> and evangelizer of conservative politics and conservative Christianity has taken on a new life, with tens of thousands of new requests to create chapters of his Turning Point group on high school and college campuses, the organization says.</p>   <p>Erika Kirk is taking over as the leader of Turning Point, and prominent Republican figures like Vice President Vance and broadcaster Tucker Carlson have stepped in to host <em>The Charlie Kirk Show</em>, remembering their friend and vowing to advance his causes.</p>   \n   <h3>Some see Kirk's death as Democrats' fault</h3>   <p>Kirk's killing has also led to an escalation of rhetoric and action from the Trump administration and Republican lawmakers who have painted their ideological opponents as radical forces of evil who have harmed the country.</p>   <p>On Kirk's podcast last week, Vance said political violence is \"not a both-sides problem\" and blamed the \"incredibly destructive movement of left-wing extremism\" for the attack allegedly carried out by a lone shooter.</p>   <p>Deputy Chief of Staff Stephen Miller suggested that the federal government would \"identify, disrupt, dismantle and destroy\" left-wing networks that he blamed without evidence for fomenting violence, and Trump vowed to label the <a href=\"https://www.npr.org/2025/09/19/nx-s1-5545764/trump-says-he-plans-to-designate-antifa-as-a-terrorist-organization\" target=\"_blank\">nebulous left-wing \"antifa\" ideological movement</a> a \"major terrorist organization.\"</p>   \n   <p>On Sunday night, President Trump hailed Kirk as a \"martyr,\" which others like onetime Trump adviser Steve Bannon have echoed. Pro-Trump influencer Chaya Raichik, who runs the \"Libs of TikTok\" social media account, wrote \"THIS IS WAR.\" And lawmakers like Wisconsin GOP Rep. Derrick Van Orden compared Kirk's killing as a catalyst similar to Sept. 11 and that he would \"not allow these leftist scumbags to take my country.\" </p>   <p>Prominent <a href=\"https://www.npr.org/2025/09/13/nx-s1-5538476/charlie-kirk-jobs-target-social-media-critics-resign\" target=\"_blank\">online voices</a> on the right have called for people who have made social media posts criticizing Kirk or mocking his death to lose their jobs or face investigation, including the vice president telling people to \"call them out and, hell, call their employer.\"</p>   <p>The president and Federal Communications Chairman Brendan Carr are facing questions about freedom of speech protections after Carr threatened ABC over remarks made by late night host Jimmy Kimmel in a monologue last week about Kirk's killing. ABC took Kimmel's show off the air in a move some legal <a href=\"https://www.npr.org/2025/09/18/nx-s1-5545720/kimmel-abc-carr-fcc-jawboning\" target=\"_blank\">experts say is illegal \"jawboning,\"</a> when government officials pressure private companies to suppress speech. </p>   \n   <p>Beyond specific feelings of spiritual resolve or political retribution, Republicans have begun to sour on America's future.</p>   <p>A <a href=\"https://apnews.com/article/poll-republicans-direction-country-kirk-violence-economy-66e5a964a807a5a1412ef0596f37ec39\" target=\"_blank\">new poll</a> from The Associated Press-NORC Center for Public Affairs Research conducted Sept. 11-15 finds a sharp decline in Republican optimism in the direction of the country, especially among women and young conservatives.</p>   <p>Overall, only half of those in the GOP say the country is heading in the right direction, a seismic shift eight months into Trump's return to office, as concerns about political violence, immigration and the economy weigh over Republican-controlled Washington.</p>\n</div>"
  },
  {
    "title": "Photos: Tens of thousands of supporters attend memorial for Charlie Kirk in Arizona",
    "url": "https://www.npr.org/sections/the-picture-show/2025/09/21/g-s1-89830/charlie-kirk-funeral-photos-trump-memorial-service",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x2764+0+233/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg",
    "tag": "Politics",
    "date": "2025-09-21T21:44:09.000Z",
    "description": "Attendees await the start of the memorial service for political activist Charlie Kirk at State Farm Stadium on Sunday in Glendale, Ariz.                                    Joe Raedle/Getty...",
    "body": "<div>\n      <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4914x3276+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F4f%2Fd1a802814104bf02ea905da06818%2Fgettyimages-2236587094.jpg\" alt=\"Attendees await the start of the memorial service for political activist Charlie Kirk at State Farm Stadium on Sunday in Glendale, Ariz.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Attendees await the start of the memorial service for political activist Charlie Kirk at State Farm Stadium on Sunday in Glendale, Ariz.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <p>Early Sunday, people started lining up outside the State Farm Stadium in Glendale, Ariz., for the <a href=\"https://www.npr.org/2025/09/21/nx-s1-5545613/charlie-kirk-funeral\" target=\"_blank\">memorial for right-wing activist Charlie Kirk</a>. People wore \"I am Charlie Kirk\" hats and T-shirts, \"Make America Great Again\" baseball caps and carried American flags. The line extended for over a mile outside the stadium, according to Glendale Police. </p>   <p>The memorial service features <a href=\"https://www.npr.org/2025/09/19/nx-s1-5546856/erika-kirk-ceo-turning-point-usa-charlie-kirk-death\" target=\"_blank\">Kirk's widow, Erika Kirk</a>, who on Thursday was named the new CEO of Turning Point USA. Kirk founded the nonprofit in 2012 as a space for young conservatives. President Trump and Vice President Vance traveled for the service along with many other GOP leaders, who have praised Kirk for boosting support for Trump among young voters.</p>   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7568x5097+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F26%2F5e%2Fb52f7a3d492e8ac192b1e1abba4a%2Fgettyimages-2236079273.jpg\" alt=\"A man carries a US flag as people arrive for the public memorial service of right-wing activist Charlie Kirk at State Farm Stadium in Glendale, Arizona on September 21, 2025.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A man carries a U.S. flag as people arrive for the public memorial service of right-wing activist Charlie Kirk at State Farm Stadium in Glendale, Ariz., on Sunday.\n                <b>\n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Andrew Caballero-Reynolds/AFP via Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7642x5095+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb1%2F8a%2Fede80973495ca60e9c81e00fc19a%2Fgettyimages-2236077384.jpg\" alt=\"A person wears a hat reading \"I am Charlie Kirk\" as people arrive to attend the public memorial service of right-wing activist Charlie Kirk outside State Farm stadium in Glendale, Arizona, on September 21, 2025. \" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A person wears a hat reading \"I am Charlie Kirk\" as people arrive outside State Farm Stadium to attend Kirk's memorial.\n                <b>\n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Andrew Caballero-Reynolds/AFP via Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4518x3013+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa9%2F20%2Fcc34f8a44fcfb198f1d8779d0c0f%2Fgettyimages-2236587095.jpg\" alt=\"GLENDALE, ARIZONA - SEPTEMBER 21: Attendees await the start of the memorial service for political activist Charlie Kirk at State Farm Stadium on September 21, 2025 in Glendale, Arizona. Kirk, the CEO and co-founder of Turning Point USA, was shot and killed on September 10th while speaking at an event during his \"American Comeback Tour\" at Utah Valley University. (Photo by Joe Raedle/Getty Images)\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Attendees await the start of the memorial service.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5299x3533+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F32%2F507606b94c0fbcfcef1aceece798%2Fgettyimages-2236588882.jpg\" alt=\"GLENDALE, ARIZONA - SEPTEMBER 21: Attendees await the start of the memorial service for political activist Charlie Kirk at State Farm Stadium on September 21, 2025 in Glendale, Arizona.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Attendees filed into their seats early Sunday for the memorial.\n                <b>\n                    Eric Thayer/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Eric Thayer/Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5163x3443+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fe8%2Fa7202b2a40599c12dfdb4b7c4359%2Fgettyimages-2236092944.jpg\" alt=\"A large cross is wheeled in ahead of the public memorial service for right-wing activist Charlie Kirk at State Farm Stadium in Glendale, Arizona, on September 21, 2025. (Photo by Patrick T. Fallon / AFP) (Photo by PATRICK T. FALLON/AFP via Getty Images)\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A large cross is wheeled in ahead of the public memorial service for right-wing activist Charlie Kirk.\n                <b>\n                    Patrick T. Fallon/AFP/via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Patrick T. Fallon/AFP/via Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6282x4190+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb9%2F63%2Fc9452112432f8dcad6d8427f4275%2Fgettyimages-2236085187.jpg\" alt=\"People pray ahead of the public memorial service for right-wing activist Charlie Kirk at State Farm Stadium in Glendale, Arizona, on September 21, 2025. \" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                People pray before the start of the public memorial service for Charlie Kirk.\n                <b>\n                    Charly Triballeau/AFP via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Charly Triballeau/AFP via Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4617x3078+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F2e%2Fa3%2F9b0b74dd4873921afd12f3ae04c5%2Fgettyimages-2236580871.jpg\" alt=\"A man shows off pins as attendees gather in the stands ahead of the memorial service for political activist Charlie Kirk at State Farm Stadium on September 21, 2025 in Glendale, Arizona.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A man carries pins that read: \"In loving memory of Charlie Kirk.\"\n                <b>\n                    Eric Thayer/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Eric Thayer/Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4140x2608+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa0%2F0a%2F848bbf844cd79546a2ce0dce47d9%2Fap25264649583284.jpg\" alt=\"Supporters comfort each other prior to the start of the memorial.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Supporters comfort each other prior to the start of the memorial.\n                <b>\n                    Ross D. Franklin/AP\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Ross D. Franklin/AP\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x683+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F57%2F7655b7fd49408d5d83f79bb9d9ed%2Fgettyimages-2236106197-1.jpg\" alt=\"A poster shows Charlie Kirk and his wife Erika, who was named the new CEO of Turning Point USA.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                A banner shows Charlie Kirk and his wife Erika, who was named the new CEO of Turning Point USA.\n                <b>\n                    Charly Triballeau/AFP via Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Charly Triballeau/AFP via Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4922x3281+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F60%2Fb6%2F2f053d97438aa80d5417cc98c1ea%2Fgettyimages-2236597676.jpg\" alt=\"Attendees hold up religious signs at the memorial service for political activist Charlie Kirk.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Attendees hold up religious signs at the memorial service for political activist Charlie Kirk.\n                <b>\n                    Joe Raedle/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Joe Raedle/Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4416x2944+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F27%2F2c%2Fb72920f44cd89e96827a1709c0b0%2Fgettyimages-2236629912.jpg\" alt=\"Erika Kirk appears onstage during the memorial service for her husband, conservative political activist Charlie Kirk.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                Erika Kirk appears onstage during the memorial service for her husband, conservative political activist Charlie Kirk.\n                <b>\n                    Win McNamee/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Win McNamee/Getty Images\n    </span>\n</p></div>\n   </div>\n   <div>\n            <div>\n        <picture>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/400/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/800/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1300/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/2000/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/2600/quality/85/format/webp/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/webp\"></source>\n            <source srcset=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 400w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/800/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 800w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1300/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1300w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 1600w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/2000/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 2000w, https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/2600/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg 2600w\" sizes=\"(min-width: 1300px) 1238px, (min-width: 1025px) calc(100vw - 60px), (min-width: 768px) calc(100vw - 60px), calc(100vw - 30px)\" type=\"image/jpeg\"></source>\n            <img src=\"https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x4000+0+0/resize/1100/quality/50/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2Ff9%2F42f8026044b8b66e1dab443d90bb%2Fgettyimages-2236632420.jpg\" alt=\"President Donald Trump walks onstage during the memorial service for political activist Charlie Kirk.\" />\n        </picture>\n</div>\n<div>\n    <div>\n        <p>\n                President Donald Trump walks onstage during the memorial service for conservative political activist Charlie Kirk.\n                <b>\n                    Win McNamee/Getty Images\n                </b>\n                <b><b>hide caption</b></b>\n            </p>\n            <p><b><b>toggle caption</b></b>\n    </p></div>\n    <p><span>\n        Win McNamee/Getty Images\n    </span>\n</p></div>\n   </div>\n</div>"
  }
]