[
  {
    "title": "Trump calls meeting with China's president 'outstanding.' What actually happened?",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5590196/trump-calls-meeting-with-chinas-president-outstanding-what-actually-happened",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-30T20:08:15.000Z",
    "description": "\n      NPR's Mary Louise Kelly speaks with White House correspondent Deepa Shivaram and Pentagon correspondent Tom Bowman about President Trump's meet",
    "body": "\n      NPR's Mary Louise Kelly speaks with White House correspondent Deepa Shivaram and Pentagon correspondent Tom Bowman about President Trump's meeting with Chinese President Xi Jinping.   \n\n    MARY LOUISE KELLY, HOST:  Today, the two most powerful men in the world came face-to-face at a South Korean airport. We're talking about President Donald Trump and Chinese President Xi Jinping, their first meeting in six years. They talked tariffs, appeared to step back from the brink in what has amounted to Trump's economic war with China during his second term. NPR White House correspondent Deepa Shivaram has been traveling with the president. She's in South Korea today. Deepa joined me, along with NPR Pentagon correspondent Tom Bowman, on our national security podcast Sources & Methods. We talked through the summit, including the curveball that Trump delivered right before it got underway.(SOUNDBITE OF ARCHIVED NPR CONTENT)KELLY: On Truth Social, President Trump wrote, and I quote, \"because of other countries testing programs, I have instructed the Department of War to start testing our nuclear weapons on an equal basis.\" Deepa, I think I can sum up the collective reaction here in Washington as, wait, what? What was the reaction there in Asia?DEEPA SHIVARAM: It was sort of one of those things that went out and we were like, oh, very focused on a Trump-Xi summit. And then all of a sudden, you know, in a very Trumpesque (ph) way, this other thing, like, flies out of left field.KELLY: Did it come up in the actual summit?SHIVARAM: It didn't. And it sort of - or if it did, we don't know that they spoke about it. And to be honest, like, there hasn't really been much follow-up. Like, we don't really know a lot of detail. What does an instruction to the Department of War/Defense look like? Where would testing take place, and what would Trump even want that to look like? So there's just - it's sort of one of those things that Trump fired off, and we're sort of left asking a lot more questions.KELLY: Tom, any details from the Pentagon? Any reaction?TOM BOWMAN: Well, first of all, the Pentagon doesn't do testing. It's done by a division of the Department of Energy called the National Nuclear Security Administration, No. 1. No. 2 is the testing site is in the Nevada desert. So even if you want to do testing, setting it up with diagnostic equipment and figuring out where you wanted to do it and what you wanted to do would take many months, I'm told, if not years.KELLY: So do we know why this was on President Trump's mind as he's walking into a big summit with Xi?BOWMAN: Well, we think it was precisely because Russia has tested these delivery systems - again, not weapons, just how you would deliver a nuclear weapon. So everyone's speculating that's precisely why he's doing it, because of what Putin announced.KELLY: OK. So let's go to what actually did get discussed at this summit and what we were expecting to be the big headlines, which have to do with trade, have to do with tariffs. Deepa, give us the very quick rundown on where they landed.SHIVARAM: Yeah. I would say it comes down to, like, a big three on this - like, the takeaways from this meeting. One is basically that China agreed to pull back on some of the limits they had put on rare earths exports. The other element was that China would resume buying soybeans from the U.S. immediately, and that's, of course, been a major issue for American farmers since China halted those shipments. And then the other thing is that Trump said - this is the big number part - that tariffs on China would be lowered from 57% to 47%. And that 10% drop, Trump says, is because Xi committed to decrease the flow of fentanyl coming into the U.S. That is the reason that Trump said he would lower the tariff rate.KELLY: Yeah. The captain basic question, have we figured out what U.S. policy on China is, what the goal of all of the threats of tariffs and then walking back the threats of tariffs is?SHIVARAM: It's a really good question, and based on a lot of people I've talked to, there isn't exactly an answer. I did talk to Ryan Hass, who's the director of the China Center at Brookings, and he said that Trump policy is really different than his first term. But he said in the second term, it's essentially kind of like this.RYAN HASS: The China policy is the president's policy. He drives. He's in charge. And it's really not looked warmly upon if other people encroach upon his territory without his guidance or direction on how to do so.SHIVARAM: And think about how Trump does a lot of diplomacy, right? It's very personality oriented. It's very - you know, a lot of compliments, a lot of fanfare, and that is essentially how he's treated his relationship with Xi. Like, China is not a friend or ally to the United States. And he really, you know, kind of comes at this very big issue with sort of a personal diplomacy end to it. And of course, we know Xi does not really share that same level of diplomatic relations or diplomatic personality, I'll say.KELLY: NPR White House correspondent Deepa Shivaram and Pentagon correspondent Tom Bowman. You can hear more of our discussion on Sources & Methods wherever you get your podcasts.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump calls meeting with China's president 'outstanding.' What actually happened?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-30T20:08:15.000Z",
      "dateModified": "2025-10-30T20:08:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Senate should scrap the filibuster to end the government shutdown",
    "url": "https://www.npr.org/2025/10/31/nx-s1-5591978/trump-senate-scrap-filibuster-end-government-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5358x3014+0+279/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2F83%2F35bbab5e4755b02218c28c0f1a01%2Fap25301795904623.jpg",
    "tag": "Politics",
    "date": "2025-10-31T06:59:36.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                House Minority Leader Hakeem Jeffries, D",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                House Minority Leader Hakeem Jeffries, D-N.Y., speaks during a news conference at the Capitol, Tuesday, Oct. 28, 2025, in Washington.\n                \n                    Mariam Zuhaib/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mariam Zuhaib/AP\n    \n\n   \n   WASHINGTON — President Donald Trump is calling on the Senate to scrap the filibuster, so that the Republican majority can bypass Democrats and reopen the federal government.   \"THE CHOICE IS CLEAR — INITIATE THE 'NUCLEAR OPTION,' GET RID OF THE FILIBUSTER,\" Trump posted Thursday night on his social media site, Truth Social.   \n   The filibuster is a long-standing tactic in the Senate to delay or block votes on legislation by keeping the debate running. It requires 60 votes in a full Senate to overcome a filibuster, giving Democrats a check on the 53-seat Republican majority that led to the start of the Oct. 1 shutdown when the new fiscal year began.   Trump's call to terminate the filibuster could alter the ways the Senate and congressional dealmaking operate, with the president saying in his post that he gave a \"great deal\" of thought to the choice on his flight back from Asia on Thursday.   \n   Trump spent the past week with foreign leaders in Malaysia, Japan and South Korea, finishing his tour by meeting with Chinese leader Xi Jinping.   The president declared the trip a success because of a trade truce with China and foreign investment planned for American industries, but he said one question kept coming up during his time there about why did \"powerful Republicans allow\" the Democrats to shut down parts of the government.   His call to end the filibuster came at a moment when certain senators and House Speaker Mike Johnson believed it was time for the government shutdown to come to an end. It's unclear if lawmakers will follow Trump's lead, rather than finding ways to negotiate with Democrats.   \n   From coast to coast, fallout from the dysfunction of a shuttered federal government is hitting home: Alaskans are stockpiling moose, caribou and fish for winter, even before SNAP food aid is scheduled to shut off. Mainers are filling up their home-heating oil tanks, but waiting on the federal subsidies that are nowhere in sight.   Flights are being delayed with holiday travel around the corner. Workers are going without paychecks. And Americans are getting a first glimpse of the skyrocketing health care insurance costs that are at the center of the stalemate on Capitol Hill.   \n   \"People are stressing,\" said Sen. Lisa Murkowski of Alaska, as food options in her state grow scarce.   \"We are well past time to have this behind us.\"   While quiet talks are underway, particularly among bipartisan senators, the shutdown is not expected to end before Saturday's deadline when Americans' deep food insecurity — one in eight people depend on the government to have enough to eat — could become starkly apparent if federal SNAP funds run dry.   Money for military, but not food aid   The White House has moved money around to ensure the military is paid, but refuses to tap funds for food aid. In fact, Trump's \"big, beautiful bill\" signed into law this summer, delivered the most substantial cut ever to the Supplemental Nutrition Assistance Program, known as SNAP, projected to result in some 2.4 million people off the program.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President JD Vance speaks to the media alongside Sean O'Brien, President of the International Brotherhood of Teamsters, from left, Chris Sununu, president & CEO of Airlines for America, and Transportation Secretary Sean Duffy, and aviation industry representatives, about the impact of the government shutdown on the aviation industry, outside of the West Wing of the White House, Thursday, Oct. 30, 2025, in Washington.\n                \n                    Jacquelyn Martin/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jacquelyn Martin/AP\n    \n\n   \n   At the same time, many Americans who purchase their own health insurance through the federal and state marketplaces, with open enrollment also beginning Saturday, are experiencing sticker shock as premium prices jump.   \"We are holding food over the heads of poor people so that we can take away their health care,\" said Rev. Ryan Stoess, during a prayer with religious leaders at the U.S. Capitol.   \"God help us,\" he said, \"when the cruelty is the point.\"   Deadlines shift to next week   The House remains closed down under Johnson for the past month. Senators are preparing to depart Thursday for the long weekend. Trump returns late Thursday after a whirlwind tour of Asia.   That means the shutdown, in its 30th day, appears likely to stretch into another week if the filibuster remains. If the shutdown continues, it could become the longest in history, surpassing the 35-day lapse that ended in 2019, during Trump's first term, over his demands to build the U.S.-Mexico border wall.   \n   The next inflection point comes after Tuesday's off-year elections — the New York City mayor's race, as well as elections in Virginia and New Jersey that will determine those states' governors. Many expect that once those winners and losers are declared, and the Democrats and Republicans assess their political standing with the voters, they might be ready to hunker down for a deal.   \"I hope that it frees people up to move forward with opening the government,\" said Senate Majority Leader John Thune, R-S.D.   GOP cut SNAP in Trump's big bill   The Republicans, who have majority control of Congress, find themselves in an unusual position, defending the furloughed federal workers and shuttered programs they have long sought to cut — including most recently with nearly $1 trillion in reductions in Trump's big tax breaks and spending bill.   Medicaid, the health care program, and SNAP food aid, suffered sizable blows this summer, in part by imposing new work requirements. For SNAP recipients, many of whom were already required to work, the new requirements extend to older Americans up to age 64 and parents of older school-age children.   House Democratic Leader Hakeem Jeffries said Republicans now \"have the nerve\" to suggest it's a political strategy to withhold food aid.   \"We are trying to lift up the quality of life for the American people,\" Jeffries of New York said about his party.   \"The American people understand that there's a Republican health care crisis,\" he said. \"The American people understand Republicans enacted the largest cut to nutritional assistance in American history when they cut $186 billion from their one, big, ugly bill.\"   During the summer debate over Trump's big bill, Johnson and other Republicans railed against what they characterized as lazy Americans, riding what the House speaker calls the \"gravy train\" of government benefits.   The speaker spoke about able-bodied young men playing video games while receiving Medicaid health care benefits and insisted the new work requirements for the aid programs would weed out what they called \"waste, fraud and abuse.\"   \n   \"What we're talking about, again, is able-bodied workers, many of whom are refusing to work because they're gaming the system,\" Johnson said in spring on CBS' \"Face the Nation.\"   \"And when we make them work, it'll be better for everybody, a win-win-win for all,\" he said.   What remains out of reach, for now, is any relief from the new health care prices, posted this week, that are expected to put insurance out of reach for many Americans when federal subsidies that help offset those costs are set to expire at the end of the year.   Democrats have been holding out for negotiations with Trump and the Republicans to keep those subsidies in place. Republicans say they can address the issue later, once the government reopens.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Senate should scrap the filibuster to end the government shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5358x3014+0+279/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fda%2F83%2F35bbab5e4755b02218c28c0f1a01%2Fap25301795904623.jpg"
      ],
      "datePublished": "2025-10-31T06:59:36.000Z",
      "dateModified": "2025-10-31T06:59:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "4 GOP senators join Democrats to rebuke Trump on tariffs for a third time this week",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5591301/senate-trump-tariffs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5898x3318+0+307/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F13%2F15%2F105cb86b4042b1798fe4e330d283%2Fgettyimages-2207589702.jpg",
    "tag": "Politics",
    "date": "2025-10-30T19:31:56.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump announced sweeping tarif",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump announced sweeping tariffs on nations around the world during an event in the Rose Garden on April 2, 2025. A slim majority of the GOP-led Senate voted this week to roll back Trump's use of emergency powers to set tariffs on Canada, Brazil and other countries.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   In a series of three votes this week, a slim majority of the GOP-led Senate delivered a rare, bipartisan rebuke of President Trump's use of emergency powers to set tariffs on Canada, Brazil and other countries.   The last of these votes — a measure approved Thursday to roll back global tariffs announced by Trump in April — passed by a margin of 51 to 47. Democrats cleared the measure with support from four Republicans: Susan Collins of Maine, Alaska's Lisa Murkowski and Kentucky's Mitch McConnell and Rand Paul.   \"The way that the president has imposed the tariffs is leading to nothing but chaos,\" Sen. Tim Kaine, D-Va., the lead sponsor of the measure, said ahead of the vote. Kaine said the strategy behind Trump's tariff policy amounted to, \"Announce tariffs on everyone, then announce that they may be suspended or delayed while I work out one-on-one deals.\"   \n   Earlier this week, the same four Republican senators joined Democrats to approve resolutions to terminate tariffs on Brazil and Canada that were announced using emergency powers. Sen. Thom Tillis, R-N.C., joined Democrats to terminate the Brazil tariffs, which he argued specifically had no rational basis.   \n   The vast majority of Senate Republicans voted against the measures, with many saying that at this point they're counterproductive to the president's tariff program. Senate Finance Committee Chairman Mike Crapo, R-Idaho, said Trump's new plans to lower China's tariffs Thursday were a good reminder. Trump announced the plans after meeting in South Korea with Chinese leader Xi Jinping.    \"The president's negotiations are bearing fruit. President Trump already announced new trade deals,\" Crapo said on the Senate floor ahead of the vote. \"Other deals are, hopefully, forthcoming.\"   However, the success of this week's resolution votes, which only needed a simple majority to pass, may not go far. Speaker Mike Johnson, R-La., installed a special rule to block such votes in the House, so they're currently unlikely to reach the floor. Even if they were to somehow pass the House, President Trump would almost certainly veto them.   Still, the vote marked a test of support for the president's tariff policies among Republicans, reflecting unease inside the party about their impacts on the U.S. economy, and specifically the farming and manufacturing sectors. It came ahead of arguments at the Supreme Court this fall in a case challenging Trump's authority to put sweeping tariffs in place using emergency powers.   \n   Thursday's vote wasn't the first time Senate Republicans took up Trump's authority to set global tariffs. In April, a similar measure failed 49 to 49. That same month, a measure to block tariffs on Canada drew a simple majority in the Senate.   \"Since then our nation's trade policy has looked pretty much like a dog chasing a squirrel,\" Sen. Ron Wyden, D-Ore., a lead co-sponsor of the global tariffs resolution, said on the Senate floor on Thursday. \"More tariffs threatened, added, taken away, thousands of packages being destroyed because the customs service wasn't prepared, secretive deals to lift tariffs for certain companies and products that have influence at the White House.\"   \n   The Republicans who broke ranks did so despite a lobbying push by Vice President JD Vance, who met with Senate Republicans on Capitol Hill on Tuesday and urged them to back the president's policies. Vance told reporters after the lunch meeting that the tariffs are critical leverage for Trump in international negotiations.   But Tillis, for example, was one of those Republicans not convinced when it came at least to the Brazil tariffs.   \"I just don't think there's a rational basis for it,\" Tillis said.   Trump triggered the Brazil tariffs this summer to pressure the country's government to end what he called a \"witch hunt\" against his ally, former far-right Brazilian President Jair Bolsonaro. Last month, Bolsonaro was sentenced to 27 years in prison for attempting a coup to stay in power following his 2022 election defeat.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "4 GOP senators join Democrats to rebuke Trump on tariffs for a third time this week",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5898x3318+0+307/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F13%2F15%2F105cb86b4042b1798fe4e330d283%2Fgettyimages-2207589702.jpg"
      ],
      "datePublished": "2025-10-30T19:31:56.000Z",
      "dateModified": "2025-10-30T19:31:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration sets lowest-ever cap on refugee admissions to U.S.",
    "url": "https://www.npr.org/2025/10/30/g-s1-95823/trump-administration-sets-lowest-ever-cap-on-refugee-admissions",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F00%2F61%2F1d0efa9c410f802018d3c4e40555%2Fgettyimages-2236362748.jpg",
    "tag": "Politics",
    "date": "2025-10-30T18:49:46.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In this photograph taken on September 2,",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In this photograph taken on September 2, 2025, Afghan refugee girl Shayma is pictured during an interview with AFP at her residence in Islamabad. Her family had been scheduled to fly to the U.S. in February, before the Trump administration suspended most refugee admissions.\n                \n                    Farooq Naeem/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Farooq Naeem/AFP via Getty Images\n    \n\n   \n   The Trump administration is drastically cutting the number of refugees it will admit to the U.S., capping it at 7,500 for the current fiscal year. That's the lowest since the U.S. refugee program was established in 1980.   The U.S. wants to primarily admit Afrikaners from South Africa, according to a notification in the Federal Register filed on Thursday, and \"other victims of illegal or unjust discrimination in their respective homelands.\"   The administration has largely paused the U.S. refugee resettlement program so far this year, with the exception of a streamlined process of resettlement for white South Africans. Several hundred from the group have been resettled across the U.S. since March.   \n   In response, some resettlement groups have been quick to voice concern over the lack of resources and limits on admission of those from other countries. Others have shuttered their services, changing the landscape of the refugee resettlement process.   Thursday's notification, which covers the fiscal year that started October 1, does not provide a reason for the lower cap, beyond mentioning previous Trump administration policies on refugees, including pausing admissions overall and barring admissions from countries seen as threats to U.S. security and welfare.   \"The Trump administration has long expressed its intention to end Biden's abuse of the refugee program,\" a Trump administration official said in a statement. \"No refugees will be admitted in [fiscal year] 26 until the appropriate consultations with Congress are held, which are being delayed because certain members of Congress insisted on shutting down the government.\"   Christopher Landau, the deputy secretary of state, previously told reporters that criteria for bringing in refugees included making sure that they did not pose a national security challenge and could be easily assimilated.   \n   \"This decision doesn't just lower the refugee admissions ceiling. It lowers our moral standing,\" Krish O'Mara Vignarajah, president of Global Refuge, said in a statement. \"At a time of crisis in countries ranging from Afghanistan to Venezuela to Sudan and beyond, concentrating the vast majority of admissions on one group undermines the program's purpose as well as its credibility.\"   The Biden administration had set the refugee cap at 125,000 for fiscal year 2025.   Senate Democrats, including Sen. Jeanne Shaheen (D-N.H.), the top Democrat on the Senate Foreign Relations Committee, said the Trump administration disobeyed the law by not consulting with Congress on the refugee cap before imposing it.   \n   The administration's lack of consultation \"demonstrates its tacit acknowledgement that this decision is indefensible,\" they wrote in a statement. \"President Trump's move undermines the role that America has long played in the world as a beacon of stability and a refuge for those fleeing genocide, political persecution and war crimes.\"   Push for higher caps   Refugee advocates have spent the year pushing for a broader range of admissions beyond Afrikaners, including admitting people from other countries who had already been vetted to arrive in the U.S.   \"It is egregious to exclude refugees who completed years of rigorous security checks and are currently stuck in dangerous and precarious situations,\" said Sharif Aly, president of the International Refugee Assistance Project. He said that the number of those with confirmed travel plans to the U.S. is greater than the new refugee cap.   \n   The admission of Afrikaners to the U.S. has drawn scrutiny from resettlement agencies in the U.S., who have faced sharp budget, resource, and personnel cuts since President Trump took office.   Among his first executive actions, Trump paused the refugee resettlement program. Various agencies including the State Department have also paused disbursing funding for critical services for other refugees, such as the home, job and school assistance the Afrikaners are poised to receive.   The pause also sent the refugee resettlement agencies into turmoil as refugees already cleared to arrive in the U.S. received notice their flights had been cancelled.   \n   Among those left in limbo were Afghans who worked with the U.S. military, a move that some Republicans have criticized. A lower-court judge had ordered the government to at least resume the refugee program for those who had already been approved to travel, but an appeals court ruled in favor of the administration.   The notice in the Federal Register makes no mention of Afghans, despite past promises to help those who supported the U.S. in America's longest war.   \n   —NPR's Michele Kelemen contributed to this report.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration sets lowest-ever cap on refugee admissions to U.S.",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F00%2F61%2F1d0efa9c410f802018d3c4e40555%2Fgettyimages-2236362748.jpg"
      ],
      "datePublished": "2025-10-30T18:49:46.000Z",
      "dateModified": "2025-10-30T18:49:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge sets trial over whether CPB pulled back from NPR due to White House pressure",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5590945/npr-cpb-lawsuit-trial-political-pressure",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5203x2927+0+271/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2F8b%2F6696f2d448d0913c552df548757e%2Fnpr-brand2018-352.jpg",
    "tag": "Politics",
    "date": "2025-10-30T18:46:40.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                NPR headquarters in Washington, D.C., on",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                NPR headquarters in Washington, D.C., on November 8, 2018.\n                \n                    Allison Shelley/Allison Shelley/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Allison Shelley/Allison Shelley/NPR\n    \n\n   \n   NPR's lawsuit against its decades-long partner, the Corporation for Public Broadcasting, is headed for trial in December, a federal judge ruled Thursday. It is another marker of the Trump administration's disruptive force throughout the media.   NPR alleges that last spring, CPB unlawfully yanked away a planned three-year contract worth $36 million in the face of intense pressure from the White House to sever ties with the radio network.   As NPR presented evidence in court hearings on Tuesday and Thursday, U.S. District Court Judge Randolph Moss indicated a deep skepticism of CPB's argument that it sharply reversed course on the merits. The most plausible explanation, Moss said, was that CPB was hoping to survive.   \n   \"I am not sure I have received an answer at all to the question of what changed from April 2nd to April 4th, other than the fact that CPB was looking for ways to try and ingratiate itself with the administration and perhaps folks on the Hill in a desire to survive,\" Moss said at Thursday's court hearing, according to a transcript, \"and that it was perceived that the votes and the support that CPB needed would come from those who were hostile to the content of NPR's speech.\"   The CPB is the nonprofit that funneled federal dollars to public media until this month, as Congress and the president acted this summer to halt all $1.1 billion in planned future subsidies. Only a skeleton crew remains at the corporation.   President Trump had been in the White House barely two months when he began attacking NPR and its TV counterpart PBS on social media as \"radical left MONSTERS.\" On May 1, he followed up with an executive order to stop all federal dollars from going to them. In response, NPR and three member stations in Colorado sued both the Trump administration and CPB, alleging their First Amendment rights were being violated.   The portion of the lawsuit headed to trial does not involve the subsidies, but a separate contract to provide satellite and distribution services for public radio stations. NPR has operated it for four decades under a series of contracts with CPB. Moss said he had an open mind about the final merits of the two sides' arguments but ordered the trial because he thought NPR's argument was credible enough that he didn't want to take more time assessing its case. As the judge reiterated his skepticism of CPB's case, the corporation's trial attorney, Joseph Lipchitz, disclosed he had been negotiating a potential resolution of the lawsuit with NPR's legal team.   \n   A rush to get a deal, then a change of heart   In late March, CPB had heard rumors of the possibility of an executive order against public media but was uncertain what form it would take.   With that in mind, on April 2, CPB's board authorized its officials to work out the fine print of a fresh contract with NPR.   A top CPB official, Kathy Merritt, called NPR's executive overseeing the satellite and distribution system and told him not to trip up the negotiations over minor matters, citing the urgency to get the money approved. (Merritt affirmed this account during a sworn deposition last week.)   \n   The next day, at an in-person meeting, a top White House budget official told CPB's board chairperson and two senior executives of her \"intense dislike for NPR.\" Memoranda about the meeting reflect the White House official, Katie Sullivan, also said \"it would be a shame to throw the baby out with the bath water,\" according to legal documents NPR filed in court.   The day after that, April 4, CPB's board reversed itself, deciding that the radio satellite and distribution system had to be operated by an entity separate from NPR. CPB asked NPR to come up with plans to spin off the division, court filings show; NPR declined but bid for the project nonetheless.   Behind the scenes, CPB's chairperson, Ruby Calvert, was \"adamant that she doesn't want funding to go to NPR,\" according to an April 12 email from Merritt to a colleague brought to light in the litigation.   \"Something has been fundamentally missing\"   On April 13, CPB's chief of staff, Debra Sanchez, wrote that she wasn't sure how to explain the requirement that it spin off its satellite and distribution system, called PRSS, court documents show. \"Something has been fundamentally missing for me ... and it's the 'because' statement,\" she wrote to colleagues. \"In particular, the 'local stations would be better served by having PRSS as an independent entity' which begs the question... because?\"   \n   Newly hired Republican consultant Carl Forti advised CPB on key themes to embrace in dealing with the administration: \"CPB has taken proactive steps to rein in what it sees as bias at NPR and PBS,\" according to court filings.   The consultant stated that CPB should stress it had \"already taken steps to address the administration's concerns\" including by \"[w]ithholding interconnection funds from NPR.\" The word \"interconnection\" is a shorthand for the satellite and distribution system.   Forti's memo also stated that CPB should note it had stopped grants for specific NPR newsroom efforts. CPB had subsidized international reporting and, last year, after allegations of bias led Congressional Republicans to blast NPR, a new senior editorial review team.   Clayton Barsoum, CPB's chief lobbying executive, affirmed the memo in a note to Sanchez, writing, \"This looks good to me,\" court filings show.   CPB argues it is a bulwark against political pressure   In September, the corporation announced it was awarding a longer, bigger contract — $57 million over five years — to a new consortium that includes major public radio stations, a public radio distributor and an industry consulting firm. It said it was doing so to address long-standing concerns about NPR's performance.   CPB attorney Lipschitz argued in court that the corporation has acted as a resolute bulwark for public media, including NPR, against political pressure. He noted that CPB had separately sued Trump over his attempt to fire corporation board members.   \n   In his remarks at the hearings Tuesday and Thursday, Moss cast doubt on the credibility of that defense, repeatedly questioning the quick-twitch decision to demand that NPR no longer run the distribution system after such a longstanding arrangement.   \"All of a sudden there was this change. And so what happened to cause this change?\" the judge asked Tuesday. \"I have to say, the most plausible explanation for what's happening here, is that everything is not quite as linear as \"We're for or against it'.\"   \n   \"CPB is understandably trying to survive,\" Moss said. \"There are a lot of materials that are in the record here that say there are a lot of strategies going on: 'What do we do? One thing we do is distance ourselves from NPR, because they don't like NPR'.\"   \"A desire to earn some brownie points\"   On Thursday, Moss underscored his thinking. \"At this point, I am not convinced that there is any real explanation of what changed other than the political climate and desire to try and earn some brownie points with those who CPB saw as attacking it,\" Moss said.   In that April memo reproduced in court filings, CPB's consultant Forti came up with a message to convey to senators whom Trump was urging to pull all funding for public media:   \"a. We understand the new world.   \"b. We are responsive to the new world.   \"c. We are trying to limit funds direct to NPR and PBS for biased content.\"   Barsoum had endorsed the memo. Yet CPB officials felt they could not make that case publicly, evidence presented by NPR in court shows.   Behind the scenes, CPB officials were asking Forti how they could best present their decision, without referring to the political firestorm around them. \"I don't think we are comfortable with the approach to publicly state we cut funding to NPR, so the bland statement might be where we land,\" Sanchez, the CPB chief of staff, wrote, according to materials filed in court.   Moss ordered a brief expedited trial on this portion of the litigation and also ordered that CPB set aside $36 million, which it could not touch until the case was resolved. Assuming there is no settlement between the parties, Moss will assess it himself, instead of a jury, in what is called a bench trial. It is expected to last three to four days.   \n   Disclosure: This story was reported and written by NPR media correspondent David Folkenflik and edited by Deputy Business Editor Emily Kopp, Managing Editor Vickie Walton-James and Managing Editor Gerry Holmes. Under NPR's protocol for reporting on itself, no corporate official or news executive reviewed this story before it was posted publicly.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge sets trial over whether CPB pulled back from NPR due to White House pressure",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5203x2927+0+271/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2F8b%2F6696f2d448d0913c552df548757e%2Fnpr-brand2018-352.jpg"
      ],
      "datePublished": "2025-10-30T18:46:40.000Z",
      "dateModified": "2025-10-30T18:46:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "If SNAP food aid is cut off, small grocery stores also will feel the pain",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5587926/snap-food-aid-wic-shutdown-grocery-stores-walmart",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+95/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6b%2F92%2F96d364d44abe990ba9a7931a6b14%2F20251029-snap-smith-9596.jpg",
    "tag": "Politics",
    "date": "2025-10-30T17:00:08.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Store manager Jose Pajares says he's sla",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Store manager Jose Pajares says he's slashing prices and stocking less food since business has slowed down at the Save A Lot in Springfield, Mass. The bulk of their customers depend on SNAP benefits, and the store depends on their business. A lapse in funding would hurt everyone.\n                \n                    Tovia Smith/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tovia Smith/NPR\n    \n\n   \n   SPRINGFIELD, Mass. — Theresa Rios came to the grocery store this week with a shorter shopping list than usual. And she's also paying even more attention than usual to price.   Walking past a shelf of items labeled \"Real Bacon Bits\" next to packages of imitation bacon bits, Rios doesn't hesitate. \"This is $2.19 and this is $1.59,\" she says, \"so I'm going to buy this.\"   Rios is a regular at the Save A Lot store in Springfield. But since she started hearing that her federal food assistance might soon be cut off, she has been trying to put some of the money she receives aside, just in case. And, she's no longer giving all her business to Save A Lot.   \n   \"I'm at the point where I am shopping for deals at three different stores,\" she says. \"So I'll come here because this is cheaper than Stop & Shop, but some of the items at Price Rite are cheaper than here, and Walmart is [cheaper for] the cleaning stuff … I just shop around.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Like many worried about a possible cut off in SNAP food aid, Theresa Rios is reducing her spending and doing more of her shopping at retail giants like Walmart hoping to stretch her dollars. Some smaller grocery stores in low-income communities are already seeing their sales slump and bracing for it to get worse.\n                \n                    Tovia Smith/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tovia Smith/NPR\n    \n\n   \n   Rios says she's also forgoing some items altogether, as she has switched to new, cheaper meals for herself and her three young grandchildren, who she takes care of full time. Dinner is downgraded to rice and beans, and she is no longer buying the kids' favorite cereal.   \"They'll have to settle for what I can give them,\" she says.   Rios is hardly the only shopper forced to be more frugal. Some 42 million Americans rely on Supplemental Nutrition Assistance Program benefits, formerly known as food stamps, and as many of them worry about losing their food aid, some grocery businesses are increasingly concerned as well. There are 250,000 retailers authorized to accept SNAP benefits. Most would be able to absorb whatever loss that might come from a lapse in SNAP, but others, like the Springfield Save A Lot, are more vulnerable. SNAP purchases at this store make up a solid 65% of sales.   \n   Already, manager Jose Pajares says those sales have started to dry up.   \"It's scary,\" he says. \"I see less customers every day because they're afraid to spend all the money they have for the whole month.\"   As a result, Pajares says he's been ordering less stock for the store, and he's dropping prices to try to boost sales. But he still ends up with meat and produce languishing on the shelf until its expiration date.   \"If we don't sell we have to throw it out,\" he says. \"Every day, we throw things away.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The entrance door of the Save A Lot grocery store in Springfield, Mass., features a sign that notes that the store accepts benefits from the Special Supplemental Nutrition Program for Women, Infants, and Children, also known as WIC.\n                \n                    Tovia Smith/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tovia Smith/NPR\n    \n\n   \n   Even in the best of times, grocery profit margins are razor thin — usually just a penny or two on the dollar. And recent challenges around tariffs, for example, have sliced profits even thinner.   \n   Anthony Peña, who owns this store, also owns a few others that are less dependent on SNAP business. That means he's able to weather a dip in sales for a bit, he says, but not for long.   \n   \"After one, maybe two months, I'll start to think about the nuclear options, as we call it, having to think about closing the store,\" Peña says.   \"For small supermarket grocers, challenges like SNAP reductions can have a significant impact on profitability, which unfortunately can put some stores and lots of jobs in jeopardy,\" says Scott Moses, an investment banker with Solomon Partners who wrote the book A 'Grocery' Christmas Carol about the rapid and seismic changes in the grocery industry.    Loading... \n   He says a prolonged SNAP shutdown could mean more pressure on the already shrinking number of small independent supermarkets, which are being squeezed by grocery giants like Walmart. By itself, Walmart has almost as much market share as all the nation's 26,000 small supermarket grocers combined.   Now, Moses says, Walmart might well gain even more; if there is a cutoff of SNAP benefits, he says the superstore would likely draw in more new customers.   \"A significant amount of customers are going to trade down to what they perceive to be lower-priced operators, and net, net, Walmart will likely come out ahead,\" Moses says.   For the less fortunate stores, however, there is growing concern that any closures could have broad and serious repercussions.   \"There's a ripple effect that's going to happen here,\" says Jerome Bouyer, vice president of retail operations for Save A Lot. For starters, Save A Lot stores tend to be \"in places that are already 'food deserts' and have food insecurity. That just makes the problem that much worse.\"   There is also worry about the impact on local vendors, suppliers and distributors.   \n   \"For example, the bread guy or the guy who delivers eggs or milk to the store,\" Peña says. \"Instead of delivering 100 units, now he's going to deliver 25 units — 75 units less. So that's when things get a little bit more complicated.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Cashier Stephanie Hernández is bracing for what could be a double blow. If SNAP food assistance is cut off, business at Save A Lot could crater and she could be laid off. But she is also a SNAP recipient herself, so she could end up losing her food assistance as well as her job.\n                \n                    Tovia Smith/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tovia Smith/NPR\n    \n\n   \n   And of course, store employees are acutely aware that their jobs are also on the line. Already, there are cashiers just standing around during what is supposed to be the busiest shopping hour of the day.   \"I'm worried because if customers aren't coming because they don't get food stamps, our jobs are at risk,\" cashier Stephanie Hernández says in Spanish. She has an 11-year-old and twin 1-year-olds. \"If I don't work,\" she says, \"how will I pay my bills?\"   If the worst-case scenario does come to pass, it would be a double blow for Hernandez. She gets SNAP benefits herself. So if payments are allowed to lapse, she could end up losing her food assistance — and her job.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "If SNAP food aid is cut off, small grocery stores also will feel the pain",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+95/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6b%2F92%2F96d364d44abe990ba9a7931a6b14%2F20251029-snap-smith-9596.jpg"
      ],
      "datePublished": "2025-10-30T17:00:08.000Z",
      "dateModified": "2025-10-30T17:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he wants to resume nuclear testing. Here's what that would mean",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5590818/trump-nuclear-testing",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+433/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F39%2F0c%2F17ccb6a94330a8b861de5f5b6692%2Fap25303261782872.jpg",
    "tag": "Politics",
    "date": "2025-10-30T17:06:47.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A sub-surface atomic test is shown March",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A sub-surface atomic test is shown March 23, 1955 at the Nevada Test Site near Yucca Flats, Nev.\n                \n                    AP/U.S. Atomic Energy Commission\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        AP/U.S. Atomic Energy Commission\n    \n\n   \n   President Trump said on Thursday that the U.S. would begin testing nuclear weapons again for the first time in decades.   \n   \"We've halted many years ago, but with others doing testing I think it's appropriate to do so,\" the president told reporters aboard Air Force One.   Experts say that the resumption of testing would be a major escalation and could upend the nuclear balance of power.   \"I think a decision to resume nuclear testing would be extremely dangerous and would do more to benefit our adversaries than the United States,\" said Corey Hinderstein, vice president for studies at the Carnegie Endowment for Nuclear Peace.   \n   Here's what a test would involve, and why the president might be calling for one now.   There's currently only one place America could test a nuke — near Las Vegas, Nevada   The Nevada National Security Site, approximately 60 miles northwest of Las Vegas, is currently the only place where America could test a nuclear weapon, said Robert Peters, a senior research fellow for strategic deterrence at the Heritage Foundation.   \n   The Nevada site is around 1,300 square miles in size, larger than the state of Rhode Island. Starting in the 1950s, scientists conducted atmospheric nuclear tests at the site, but from 1962 to 1992, testing was done underground.   Today, testing would likely be done in \"a complex of deep underground mineshafts,\" Peters said.   Scientists dig a deep shaft either directly below ground or into the side of a mountain. They then put a nuclear device in a chamber at the end of the shaft and seal it up. The detonation is contained by the rock, reducing the risk of atmospheric fallout.   Although underground testing is far safer than atmospheric testing, it still carries risks, said Hinderstein. In the past, some radioactive fallout has leaked from test shafts. Additionally, the test could shake buildings as far away as Las Vegas, and Hinderstein said some of the newer buildings in Vegas could even be at risk of damage.   \n   \"All of these big high-rises — including Stratosphere, including the Trump Hotel,\" she said. \"They're not designed for massive, significant seismic activity.\"   America's last test in Nevada was over 30 years ago   At the end of the Cold War, the world's major nuclear powers declared a voluntary moratorium on nuclear testing. Russia, then the Soviet Union, tested its last nuclear weapon in 1990, the U.S. conducted its final test in 1992, and China conducted its last test in 1996.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. conducted hundreds of underground tests in Nevada. Each massive explosion created a subsidence crater visible at the surface.\n                \n                    NNSA/NNSS\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        NNSA/NNSS\n    \n\n   \n   The voluntary test moratorium has been in place as part of an effort to maintain nuclear stability. The U.S currently uses scientific experiments and supercomputer simulations to make sure its bombs still work.   Last year, NPR was one of a handful of organizations granted rare access to the top-secret underground tunnels where the tests take place. Scientists working in the tunnels said they were confident they could continue to ensure the safety of America's nuclear weapons without testing.   Although a full-scale nuclear detonation would be \"complementary\" to current experiments, \"our assessment is that there are no system questions that would be answered by a test, that would be worth the expense and the effort and the time,\" Don Haynes, a nuclear weapons scientist from Los Alamos National Laboratory told NPR as they walked through the tunnels.   Indeed Hinderstein says, preparing for a nuclear test is no small matter. While a basic demonstration test could be done in approximately 18 months. Conducting a test that would produce scientifically useful data would likely take years.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In this photo taken from video distributed by Russian Defense Ministry Press Service on Wednesday, Oct. 22, 2025, the crew of the Bryansk nuclear submarine of the Russian navy prepares to conduct a practice launch of an intercontinental ballistic missile during the drills of Russia's nuclear forces.\n                \n                    AP/Russian Defense Ministry Press S\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        AP/Russian Defense Ministry Press S\n    \n\n   \n   Trump's announcement is likely reacting to some recent tests by Russia   On Sunday, Russia announced it had conducted a successful test of a new nuclear-powered cruise missile. Then on Wednesday President Vladimir Putin announced the successful test of another doomsday weapon — a nuclear-powered underwater drone, which Russia says can be used to attack coastal cities.   \n   Trump never called out Russia by name, but he did suggest recent testing was behind the announcement. \"I see them testing,\" he said aboard Air Force One, \"and I say, 'Well if they're going to test I guess we have to test.'\"   \n   While testing nuclear-powered weapons is not the same as testing nuclear weapons themselves, Russia's tests are highly provocative. They come just months before the expiration of the last nuclear treaty between the U.S. and Russia, designed to put limits on their arsenals.   The back-and-forth has all the hallmarks of the start of an arms race, noted Jon Wolfsthal, the director of global risk at the Federation for American Scientists.   \"We saw this play out throughout the Cold War through nuclear testing, nuclear deployments, nuclear investments,\" he said.   Many experts warn that now is not the time to resume nuclear testing   Hinderstein, who served as a deputy administrator of the National Nuclear Security Administration, the agency responsible for America's nuclear weapons, from 2021 to 2024, said that a decision to resume testing would not be in America's interests.   By the end of the Cold War, the U.S. had conducted more than a thousand nuclear tests — far more than any other nation (China, by comparison, had conducted just 45).   \n   Other nations \"have more to gain by resuming nuclear testing than the United States does,\" she said.   Testing would likely be expensive, adds Paul Dean, vice president for global nuclear policy at the Nuclear Threat Initiative. \"The cost estimates I've seen have been at around, ballpark, $140 million per test,\" he said.   \"It's not necessary to conduct a nuclear explosive test right now,\" agreed Robert Peters of the Heritage Foundation. But he added, \"But there could very well be compelling reasons to test in the coming months and years. That's how bad things are getting.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he wants to resume nuclear testing. Here's what that would mean",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3600x2025+0+433/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F39%2F0c%2F17ccb6a94330a8b861de5f5b6692%2Fap25303261782872.jpg"
      ],
      "datePublished": "2025-10-30T17:06:47.000Z",
      "dateModified": "2025-10-30T17:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge sentences former Jan. 6 defendant for hoax threat near Obama's home",
    "url": "https://www.npr.org/2025/10/30/g-s1-95855/january-six-capitol-defendant-obama-threat",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4666x2625+0+365/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F2a%2Ff63f5ab9410f9756bc0e14edeabb%2Fgettyimages-1230455457.jpg",
    "tag": "Politics",
    "date": "2025-10-30T21:12:47.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Supporters of President Trump clash with",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Supporters of President Trump clash with police and security forces as they push barricades to storm the U.S. Capitol in Washington, D.C on January 6, 2021.\n                \n                    Roberto Schmidt/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Roberto Schmidt/AFP via Getty Images\n    \n\n   \n   A federal judge has sentenced a man to time served for making a hoax threat near the D.C. residence of former President Barack Obama two years ago, prompting a massive law enforcement response that included a bomb squad and sniffer dogs.   Taylor Taranto, of Pasco, Wash., spent 22 months in the troubled D.C. jail facility while he waited for trial on allegations that he suggested his van was rigged with explosives.  Authorities never found any such devices, though they did recover firearms and a machete.   \n   U.S. District Judge Carl Nichols noted that Taranto had no criminal history — partly because the Justice Department had previously moved to dismiss several charges related to Taranto's participation in the siege on the U.S. Capitol on Jan. 6, 2021.   President Trump granted clemency to Taranto and virtually every Jan. 6 defendant on the first day he returned to the White House this year.   But the storming of the Capitol and the Justice Department response to it continue to reverberate, especially within the U.S. Attorney's office in Washington.   Trump and his cabinet officials are trying to rewrite the history of that day, in part by firing or forcing out law enforcement officials who investigated cases related to the riot.    \n   This week the Justice Department sidelined two veteran prosecutors who had worked on the Taranto case and took the rare step of withdrawing a sentencing memo they had filed.   U.S. Attorney Jeanine Pirro declined to comment on any personnel decisions but in a statement said \"we want to make very clear that we take violence and threats of violence against law enforcement, current or former government officials extremely seriously.\"   \"We have and will continue to vigorously pursue justice against those who commit or threaten violence without regard to the political party of the offender or the target,\" Pirro said in the statement.   \n   Original sentencing memo sealed, replaced   The original sentencing memo in Taranto's case detailed how a \"mob of rioters\" attacked the seat of government as Congress met to certify the results of the 2020 election.   It also mentioned that Taranto headed in the direction of Obama's home after Trump reposted an address of a location on social media.   A replacement sentencing memo, filed by a new pair of DOJ lawyers, scrubbed both of those references. The electronic court docket last night listed the original memo as sealed.   Judge Nichols said it was \"not entirely clear\" how that memo had come to be sealed and that he intended to release it unless the DOJ could justify keeping it hidden.   \n   The judge did not press the new attorneys for details about the rare, last-minute personnel switch. But he went out of his way to praise the sidelined prosecutors, Carlos Valdivia and Samuel White.   \"I just want to express my view that they did a commendable and excellent job in this case,\" Judge Nichols said. \"They also held the highest standards of professionalism.\"   At a press conference on a D.C. crime issue, Pirro declined to answer whether she ordered the original sentencing memo in the Taranto case to be revoked.   \"I think the papers speak for themselves and what goes on in this office is not something I'm going to comment on to the press,\" Pirro said.   Valdivia and White listened on from the audience in the sixth floor courtroom, surrounded by some of the lawyers who had supervised hundreds of Capitol riot cases — only to be fired or forced out of the Justice Department this year.   \n   Taranto, a Navy veteran with two children, has since returned home to Washington state. He will be required to serve three years of supervised release, undergo a mental health assessment, and to avoid firearms and controlled substances.   \"There's nothing that he did, in fact, that was violent,\" said defense attorney Carmen Hernandez. \"The firearms were in a locked compartment in a van.\"   Taranto signaled he would appeal in the coming weeks. He used his brief time before the judge to address what he called \"deeply troubling issues concerning our founding, our history\" and \"election fraud for the 2020 election.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge sentences former Jan. 6 defendant for hoax threat near Obama's home",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4666x2625+0+365/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffc%2F2a%2Ff63f5ab9410f9756bc0e14edeabb%2Fgettyimages-1230455457.jpg"
      ],
      "datePublished": "2025-10-30T21:12:47.000Z",
      "dateModified": "2025-10-30T21:12:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who's the man behind President Trump's dismantling of the federal government?",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5590249/whos-the-man-behind-president-trumps-dismantling-of-the-federal-government",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-30T16:10:03.000Z",
    "description": "\n    TERRY GROSS, HOST:  This is FRESH AIR. I'm Terry Gross.Russell Vought has been called the shadow president, including by my guest, journalist And",
    "body": "\n    TERRY GROSS, HOST:  This is FRESH AIR. I'm Terry Gross.Russell Vought has been called the shadow president, including by my guest, journalist Andy Kroll. Vought is the director of the Office of Management and Budget - not the sexiest-sounding title, but he's the architect behind the Trump administration's dismantling of federal agencies, slashing foreign aid, pausing or canceling over $400 billion for infrastructure and clean energy projects in blue states, ending the Justice Department's independence from the president, stuffing so many budget cuts in the so-called One Big Beautiful Bill, and expanding the power of the president. He was also one of the people behind Project 2025, which was intended to be a blueprint for a second Trump term, and that's what it's become. Vought describes himself as a radical constitutionalist. Andy Kroll has been investigating how Vought has been using his power and what his goals are. Kroll covers the Justice Department and judiciary system for ProPublica, where he's written extensively about Vought. Kroll has an article in The New Yorker in collaboration with ProPublica titled \"Donald Trump's Deep-State Wrecking Ball.\" Kroll is also the journalist who first got access to and published the video of Vought saying this back in 2023.(SOUNDBITE OF ARCHIVED RECORDING)RUSSELL VOUGHT: We want the bureaucrats to be traumatically affected. We want - when they wake up in the morning, we want them to not want to go to work.(LAUGHTER)VOUGHT: Because they are increasingly viewed as the villains. We want their funding to be shut down so that the EPA can't do all of the rules against our energy industry because they have no bandwidth financially to do so. We want to put them in trauma.GROSS: OK, and there's one more Russell Vought clip I want to play for you that will give you more of a sense of Vought's goals and strategy. When he was on The Tucker Carlson Show in November 18, 2024, just 13 days after Trump was reelected, Carlson asked Vought about his priorities. This was on top of Vought's list.(SOUNDBITE OF ARCHIVED RECORDING)VOUGHT: So my belief, for anyone who wants to listen, is that you have to - the president has to move executively as fast and as aggressively as possible with a radical constitutional perspective to be able to dismantle that bureaucracy and their power centers. And I think there are a couple of ways to do it. Number one is going after the whole notion of independence. There are no independent agencies. Congress may have viewed them as such - SEC or the FCC, CFPB, the whole alphabet soup. But that is not something that the Constitution understands. So there may be different strategies with each one of them about how you dismantle them, but as an administration, the whole notion of an independent agency should be thrown out, particularly with the Department of Justice in which there's literally no law. All it is is precedent from the Watergate era, that the attorney general and those lawyers don't work for the president. And...TUCKER CARLSON: Well, who do they work for?VOUGHT: They think that they work for themselves. They think that they are...CARLSON: So they have the power to kill people just 'cause they awarded themselves that power?VOUGHT: They...CARLSON: The power to kill people. I mean...VOUGHT: They believe that they have the power for all of the prosecutions and that the president doesn't get a say in any of that. And that - we have to go at that as hard as we possibly can.GROSS: Well, Andy Kroll, welcome to FRESH AIR. We have a lot to talk about (laughter).ANDY KROLL: Yeah, we sure do. It's a real pleasure to be here.GROSS: Pleasure to have you. So let's get into what we just heard Russell Vought say. I'll start with federal agencies. Why are they such a big target for Vought?KROLL: Russ Vought believes that federal agencies are one of the chief reasons that, in his view, the American government has ceased to serve the American people and that it has become this rogue bureaucracy where there are civil servants who are unelected and who have their own agendas. They, in his belief, ignore the president and carry out this plan, these policies, these rules and regulations that, again, in Russ Vought's view, have become completely untethered from the will of the president and then the people who elected that president. And he wants to rip out as much of that bureaucracy as he possibly can. He calls it the deep state. He deeply believes that, as he put it in a different part of that Tucker Carlson interview, that the bureaucracy in the American government hates - to use his term - the American people and has to be eliminated.GROSS: OK. So he says that the agencies aren't mentioned in the Constitution and therefore, they don't necessarily even have a right to exist, if I'm hearing him correctly. What is mentioned in the Constitution is the separation of powers between the president, the judiciary and Congress. He thinks, according to the clip we just heard, that the president should be involved directly with the judiciary. Does that violate the Constitution?KROLL: It certainly would be a major break from how our three-part system of government has operated for quite a long time, and it would certainly be a break in terms of what the president is now doing as it relates to Congress from the plain text of the Constitution itself. What I'm talking about here is the Article 1 authority that Congress has, No. 1 job that Congress has, the power of the purse. Pass the laws with funding to implement those laws. Article 2, as anyone who has done a cursory read of the Constitution knows, says that the president must take care to implement those laws faithfully. Russ Vought has a very different theory of this case. As he and President Trump and this administration have shown in the almost 10 months they've been in office, they believe that the president has vastly more power to defy Congress' will, to block spending, to block programs approved by Congress, to essentially step on that Article 1 authority and really scramble the fundamental idea of separation of powers that, again, has governed this country for quite a long time.GROSS: Why is Congress allowing the president to limit the power of Congress? Why are Republican congressman standing for that?KROLL: It's a very good question. I think it speaks to the degree to which the Republican Party today is so controlled by one man, the president of the United States right now, Donald Trump. If you talk to members of Congress on both sides of the aisle, you come away with the impression that the overriding concern that most Republican members of the House and the Senate have in their day-to-day existence is winding up on the wrong side of President Trump, winding up on the wrong side of his most ardent followers. So when these confrontations have come up this year, when Russ Vought has acted in ways that have thwarted, again, Congress' fundamental power of the purse responsibilities, Congress has essentially said, oh, OK. You know, well, maybe we'll put out some strongly worded statements saying we disagree, maybe we'll grumble a little bit to the Capitol Hill Press Corp. But the Republicans who run Congress right now, to be clear, seem much more concerned about staying in the good graces of President Trump and his base than they do about asserting Congress' institutional authority, which, again, is really uncharted territory for how our government is supposed to function.GROSS: Russell Vought also wants the president to be able to fire federal workers who don't adhere to the president's agenda. And part of his rationale is that federal workers weren't elected, so the president should be able to fire them, like any boss can fire an employee. Vought wasn't elected either. So where does his power come from? Is he that powerful as the director of the Office of Management and Budget?KROLL: The power comes from a few places. Some of it is the nature of the Office of Management and Budget, or OMB, and I can get into that a little bit more. Some of it, though, is really an extension of this maximalist view of executive power. It's been referred to as the unitary executive theory - this notion that Article 2 of the Constitution gives the executive, gives the commander in chief vast powers, not just to dictate foreign policy or to shape the agenda of the various agencies that are in the executive branch, but to actually go in and fire people who are ostensibly protected by the kind of civil service safeguards, workplace protections, in some cases, actual collective bargaining agreements in place. That the president has this blanket authority to just say, no, those bargaining agreements are not valid. Those unions are not legitimate. I can go in and just say, you are fired at the Department of Education. You several thousand employees at the Department of Homeland Security, your positions are eliminated. So there's that kind of - almost a legalistic blanket approach that is just essentially pointing to Article 2 and saying, Article 2 stands for a lot more than people think it does.But then there is this little-known, not particularly sexy, as you put it, but incredibly powerful agency known as the Office of Management and Budget. And it sits at this critical juncture in the American government. Congress, as we talked about, passes the laws, appropriates the funds, sets the policy agenda. And I think a lot of Americans figure that, OK, Congress does that. The money goes to these agencies. The plans, the laws go to the agencies, and that's how our government works. But there is this office, OMB, that sits in between Congress and the agencies that in the hands of Russ Vought has become this choke point to cut off funding, to cut off the functioning of programs and to exert the president's will in a way that we honestly haven't seen since the Nixon administration.GROSS: OK. I want to talk with you a lot more about what Vought is doing to American government. But first, we have to take a short break. If you're just joining us, my guest is Andy Kroll, an investigative reporter for ProPublica covering the Justice Department and the judiciary. He has an article in The New Yorker in collaboration with ProPublica about Russell Vought titled \"Donald Trump's Deep-State Wrecking Ball.\" We'll be right back. This is FRESH AIR.(SOUNDBITE OF THE AMERICAN ANALOG SET SONG, \"IMMACULATE HEART II\")GROSS: This is FRESH AIR. Let's get back to the interview I recorded yesterday with Andy Kroll, an investigative journalist covering the Justice Department and the judiciary at ProPublica. He's been investigating Russell Vought, the person behind Trump's dismantling of federal agencies and expanding the power of the presidency. Vought is the director of the Office of Management and Budget and an architect of Project 2025. He's the subject of Kroll's article in The New Yorker, written in collaboration with ProPublica, titled \"Donald Trump's Deep-State Wrecking Ball.\"Does Vought, as the director of the Office of Management and Budget, get to veto, like, budgets that come across his desk? Does he have any kind of final say over how money is dispensed?KROLL: Not in a permanent, official kind of way. The director of the Office of Management and Budget can't put a veto on, say, a multibillion-dollar program to support clean energy or to build the Second Avenue subway in New York City. That is the role of Congress - again, writes the laws, appropriates the money. What OMB does in normal times is what I've kind of likened to a loving but cautious parent, who gives out an allowance to their kids at sort of regular intervals to try to make sure that those kids don't spend the money that's going to them in one fell swoop. So OMB apportions money - to use the wonky term - to federal agencies at a kind of regular cadence to basically make sure that, say, the EPA doesn't run out of money two months before the fiscal year is over. Agencies have some problems with controlling the spending if they don't have that sort of regulator in place, that cadence coming from OMB. So that's what OMB normally does.What it has done in a massive way, in an unprecedented way with Russ Vought in charge, is actually say, we're just not going to apportion that money, period. We've frozen money that is supposed to go from Congress to, say, the National Institutes of Health or the Environmental Protection Agency or the IRS. We're freezing it. And they give various reasons. They say, we're doing a review of this funding, but these reviews have no timetable. The agencies don't know how long or why this review is happening. Or Vought and his colleagues will say, this funding doesn't align with the president's priorities. It's part of the green new scam, a term that they've used, or it's part of, quote-unquote, \"transing our kids.\" And so they just hold the money back. And that has created this chaos across the federal government because the normal functioning of how laws get passed, money gets appropriated, and agencies do their work has been completely jammed up.GROSS: And after the money is frozen, does it expire at the end of Congress' term?KROLL: It depends on what kind of money we're talking about. Sometimes the money is over a multiyear period. Sometimes the money is called no-year funding, which means it doesn't have an expiration date. But by and large, this money does have an expiration date, often one fiscal year. And the money will expire at the end of the fiscal year if it hasn't been spent. And one budgetary gambit that Vought has used just, you know, several months ago was trying to freeze federal funding so close to the end of the fiscal year that it would just expire on its own without any support from Congress, without any attempt to get the legislative branch to sign off on that. And again, this is one of these maneuvers that Vought is using now to try to upend the normal functioning of our democratic system.GROSS: So in full disclosure, I should mention that Congress had voted funding for the Corporation for Public Broadcasting, which distributes federal funding to public radio and public TV. But then Vought had asked Congress to rescind that money, to claw it back, and they did. So is that kind of thing unprecedented? And also, there's something that's being called, not a pocket veto, but pocket rescission. Can you explain that?KROLL: Yeah. And we're getting into the budgetary weeds here. But these are really critical.GROSS: These are powerful tools.KROLL: Yeah, that's right. And they are very much the tools that Vought has been using to accomplish the very goal he talked about in that Tucker Carlson clip that you played earlier. In June, the White House sent what's called a rescission request down Pennsylvania Avenue to Congress. What that asked Congress to do, that request, was to rescind $9 billion that Congress had already appropriated by law. It had passed a law that accounted for this money to go to the Corporation for Public Broadcasting, to go to foreign aid programs. And now the White House said to Congress, we want you to take a vote on rescinding that money, zeroing it out.The thing that is striking to me is that Vought tried to do this in the first Trump administration when he had a similar role at the Office of Management and Budget. And ultimately, he was the director at the end of the first Trump administration. They sent a massive rescissions request in the first Trump administration to Congress, and Congress said no. Congress narrowly defeated this measure. And it was seen back then as the legislative branch exerting its will, kind of standing up for itself and saying, we write the laws, we appropriate the money. We don't support you, the White House, coming over here and telling us to undo work that we've already done, the negotiations, the compromises, the deal-making.Fast-forward to this summer, Vought goes back to the tool kit and sends another rescission request to Congress for Corporation for Public Broadcasting funding, for USAID foreign aid funding. And this time it passes. Congress votes to rescind this money. And the effects of that, of course, have been pretty devastating for the programs and agencies affected. But then a few months later, Vought takes an even more aggressive step in the same direction. He issues what he has called a pocket rescission.What that essentially means is it's a request that went to Congress and said, we want to rescind even more money. This time, it was about $5 billion, again, targeting foreign aid. But what Vought essentially told Congress was, I don't need your vote. I don't need you at all to rescind this money because the way the law works, Congress has a 45-day period to consider one of these rescission requests, to consider, again, whether to undo work it had already done.Vought sent this request down Pennsylvania Avenue so close to the end of the fiscal year for Congress that he said, I don't need your support - the clock is going to run out, and the money will go away. That is a maneuver that's largely seen as not legal. Republicans in Congress said as much to Vought. But by all indications, he was undaunted by this. And he sees this pocket recission - kind like a pocket veto, but again, specifically targeting funding at programs - as a way that he can erase government funding whether Congress likes it or not.GROSS: My guest is Andy Kroll, an investigative reporter for ProPublica covering the Justice Department and the judiciary. He has an article in The New Yorker in collaboration with ProPublica about Russell Vought titled \"Donald Trump's Deep-State Wrecking Ball.\" We'll be right back. I'm Terry Gross, and this is FRESH AIR.(SOUNDBITE OF TERENCE BLANCHARD'S \"AIN'T YO STUFF SAFE HERE\")GROSS: This is FRESH AIR. I'm Terry Gross. Let's get back to the interview I recorded yesterday with Andy Kroll, an investigative journalist covering the Justice Department and judiciary at ProPublica. He's been investigating Russell Vought, the person behind Trump's dismantling of federal agencies and expanding the power of the presidency. Vought is the director of the Office of Management and Budget and an architect of Project 2025. He's the subject of Kroll's article in The New Yorker in collaboration with ProPublica titled \"Donald Trump's Deep-State Wrecking Ball.\"It seems that one of the things that Russell Vought is doing is creating chaos - freezing funds with agencies not knowing, like, if those are going to be unfrozen or if they'll never get that funding back, creating chaos, in many ways, in agencies, creating some chaos in Congress. Because Trump has been telling Republicans in Congress what to do, and sometimes that's contradicting what they've already voted to do. Is chaos a goal of Russell Vought's?KROLL: I don't think you can take in the full sweep of what this administration has done in less than a year and not come away with thinking that chaos is a goal and certainly an outcome that serves Vought and his team's larger agenda of putting cracks in the federal government, shaking the stability of this typically rock-solid, steady institution that is the federal bureaucracy. I talked to dozens of people who have worked with Vought, who have observed him closely - talked with a lot of federal workers who have been affected by the funding freezes, affected by the mass layoffs, affected by all the different maneuvers that Vought has attempted so far. One thing that really stuck with me - and it came out of one of these conversations with a former civil servant - was how much this administration and really Vought's efforts have shattered this idea of public service, at least at the federal level, as a reliable, stable way to not just find employment, but to serve a greater good, to serve your country, to be a part of this larger mission, this larger ideal.You know, the people who work in the federal government aren't doing it because the pay is great. They're not toiling away at the Education Department or the FBI because it's going to make them famous or they're going to achieve viral influence or status. They do it because they believe in this larger mission, and they're willing to work under Democratic and Republican presidents. But there is this larger notion of public service, this ideal that drives them. That idea has really taken a beating in this administration to the point that former federal workers I talked to have said, things are so chaotic. Things are so uncertain. I don't know if I would want to work for the federal government again because I don't want to have to go through what I've already gone through this year.GROSS: I wonder if that's intentional. Like, if you want to destroy federal agencies and the so-called deep state, one way to do it is to discourage people from working in federal government, to make it seem like you're not going to have a reliable job. We might take it away from you at any point. If the president thinks you're disloyal and you're not following his agenda, he has the right to fire you. We can defund agencies. We can close the doors of agencies. So, like, you're asking for instability. You might be an idealist, but, you know, this might not be good for you.KROLL: I have to think that that is the intended outcome. And I think this comes back to the line of Vought's that set me down this path, this yearlong path of reporting, which were these comments about wanting to put civil servants in trauma. I went back and looked at his social media footprint. He doesn't have a major presence online. He is not a Pete Hegseth or a Kash Patel, who sees himself as this kind of public influencer-type figure. But Vought does chime in every once in a while, and he has over the years. And what I found, actually, was there was a New York Times article that came out when Joe Biden was president. But it talked about the lingering effects of the first Trump administration's chaos and the dysfunction and the aggressive policy changes at the top, specifically at the EPA. And there was someone in there - in The New York Times article - who said that this was a traumatic experience for the people who worked at the EPA. The first Trump administration there - we're talking about here. And Russ Vought shared this story online, and he shared it with a little message above that said, quote, \"straight into my veins,\" as in, I love what this story is conveying about federal workers feeling traumatized. And clearly, his goal was to try to replicate that on a much larger scale. And that is just something that has really stuck with me this entire time, is this psychological motivation that he has to want to traumatize people who have devoted their lives, their careers to public service.GROSS: Well, we need to take another break, so I'm going to reintroduce you. My guest is Andy Kroll, an investigative reporter for ProPublica covering the Justice Department and the judiciary. He has an article in The New Yorker in collaboration with ProPublica about Russell Vought titled \"Donald Trump's Deep-State Wrecking Ball.\" We'll be right back. This is FRESH AIR.(SOUNDBITE OF JULIAN LAGE GROUP'S \"IOWA TAKEN\")GROSS: This is FRESH AIR. Let's get back to the interview I recorded yesterday with Andy Kroll, an investigative journalist covering the Justice Department and judiciary at ProPublica. He's been investigating Russell Vought, the person behind Trump's dismantling of federal agencies and expanding the power of the presidency. Vought is the director of the Office of Management and Budget and an architect of Project 2025. He's the subject of Kroll's article in The New Yorker in collaboration with ProPublica titled \"Donald Trump's Deep-State Wrecking Ball.\"As part of your investigation into Russell Vought, you got access to court records. And you did interviews with people close to Vought. And you learned that DOGE was guided more than was previously known by Russell Vought. What did you learn about his role that we didn't know before?KROLL: I think the way to understand Vought and DOGE is this. Vought is a planner. He's a thinker. He's a student of not just history, but how the federal government works and where the levers are that he can pull to try to enact his agenda. DOGE with Musk at the head was like a battering ram, a blunt force instrument that swept through the federal government trying to get rid of as many employees, cancel as many programs as it could, as fast as it could.And so I think, while there may have been some particular programs, there may have been some specific offices that Russ Vought may not have wanted to get rid of or may not have had on his list of targets to be wound down and DOGE did go after those, DOGE kind of changed the calculus for Vought. But for a lot of Trump administration officials, they saw that if you moved fast and broke things, to use the Silicon Valley catchphrase, you could kind of get away with it.GROSS: Was Russell Vought the person behind DOGE? Was it his idea to start that?KROLL: From all the reporting I've done, people I've talked to who are close to DOGE, that was very much an Elon Musk idea, something that Musk pitched to the president and the president embraced. In some ways, I think DOGE kind of got in the way initially of Vought's plans that he had been crafting for years for a potential second Trump administration. But as things started to play out earlier this year, and as DOGE started to move so aggressively through the federal government, I think Vought saw an opportunity to take advantage of what DOGE showed was possible and to take even more drastic action. He did not choose to be in this situation, Russ Vought. But he saw a way that he could use it to his advantage, based on all of the interviews, all of the documents I've read, and he took that opening.GROSS: Yeah, they're opposite in terms of approaches. You know, Musk had the chainsaw, and Russell Vought is more of a technocrat. Like, he knows all the ins and outs of congressional rules. He drafts executive orders. He works to break the rules by knowing the rules. But, you know, one of the outcomes of DOGE is a lot of lawsuits. Can you talk more about that goal of creating lawsuits to see how far you can push things and still, you know, maybe violate law or push law and still be able to get away with it?KROLL: We're seeing this play out right now as we approach a month of a federal government shutdown here in Washington. Vought and OMB sent out this memo a few days before the shutdown telling agencies to put together plans to lay off workers en masse during the shutdown. Now, that is something that all the legal experts I talked to, the congressional staffers, people steeped in the law of how personnel actions work in the federal government, say you can't do. You can't use a shutdown as an opportunity to lay off tens of thousands of people. That is exactly what Vought told agencies to do. That's exactly what he has given interviews saying he wants to do.This is one of those examples of what you're talking about. It has teed up a legal fight that's playing out. A federal judge on the West Coast has, for now, temporarily halted Vought's actions, these agency actions, to lay off workers. But this seems like one of those moments where Vought is testing the limit. He's looking for ways to potentially get new precedent, change the law. And I think you see a number of those attempts across the board, freezing programs, laying off workers. That is very much a part of this strategy, looking for ways to get these questions in front of judges and try to change laws, find certain laws unconstitutional or just shift the line a little bit of what the executive power that a president has looks like.GROSS: And in terms of the shutdown that we're experiencing now, one of Vought's plans when he was drafting his plans for a second Trump term was to use shutdowns as a way to accomplish his political goals. So you gave us one example. Are there other political goals he wants to accomplish through shutdowns?KROLL: Vought sees shutdowns as these rare opportunities, though they're increasingly less rare lately, to achieve big policy outcomes that you can't get through the normal course of Congress or the normal course of the federal government's business. I quote him in the story in one of I think about 50 briefings that he gave that I got a recording of saying Republicans need to love shutdowns because shutdowns are the way you save the country. It's not just about using a shutdown as leverage to threaten or actually fire tens of thousands of federal workers. It's also the way that you try to achieve these really dramatic policy changes.Right now, this shutdown is all about these really critical subsidies for Obamacare. The next shutdown could be trying to get Democrats to concede to major policy changes, funding cuts on clean energy or infrastructure, unwinding, say, Joe Biden's Inflation Reduction Act. Vought sees these shutdowns as chances to get what you can't otherwise achieve, you can't otherwise get the opposing party to agree to, when Congress is normally in session. That's why he's so eager for them.GROSS: Russell Vought talks about the Constitution and democracy. But he supported Trump's false claim that Trump won the 2020 election. What does that say about Vought, do you think?KROLL: I think it says that his loyalty to President Trump is so central to how he believes he is going to enact this larger vision for radically changing the federal government here in the United States. If he had broken with the president over the 2020 election, like a lot of other senior officials in the administration did, he loses the ability to be a part of the MAGA movement, to harness the political support, the energy of Donald Trump, America First, toward really things that Vought has been trying to do since long before Donald Trump has been on the political scene. I'm talking 20, 30 years back in time. So he stays loyal to the president, and he spends those four years between the two Trump presidencies remaining close to the president, saying that the 2020 election was stolen. And that gives him the ability to come back in office this time and have far more influence and leeway to do what he wants to do than he did even the first time around.GROSS: You learned through previously unreported recordings of briefings by the think tank that he started during the Biden presidency, Citizens for Renewing America, that Vought had pressured members of the Freedom Caucus to ban critical race theory in schools. Where does that figure into his larger, like, political plan to expand the executive office?KROLL: Vought has spent nearly 30 years working in Washington and has toiled away as a staffer on Capitol Hill, as an activist for the Heritage Action group and then, of course, in the Trump administration to try to find ways to convince the public to rally behind - and then members of Congress to actually shrink the size of the federal government in a dramatic way. These were always arguments being had about the debt, the deficit, the specific dollar amount of these programs.What I learned in my reporting, largely drawing on these recordings that I obtained for this story, is that Vought comes to this realization that he has to link together the culture war and the fiscal wonky budgetary agenda if he's going to be successful. It's not enough to just talk about impoundment, to talk about how much this or that program costs. You need to come up with a way that makes that program feel wrong on a cultural level. He comes up with this phrase, woke and weaponized. Programs that have anything to do with diversity are too woke. The Justice Department and the FBI are weaponized. It becomes a very sticky talking point. And I think it's a real inflection point for him, where he brings together these two parts of his worldview and the larger MAGA agenda so that the public, or at least the president's followers, are along with him. They support, they understand why we're going after clean energy funding or why we're going after the community developmental financial institution - these wonky agencies that are now tagged as being too woke or they're being weaponized.GROSS: We have to take another break here, so let me reintroduce you. My guest is Andy Kroll, an investigative reporter for ProPublica covering the Justice Department and the judiciary. He has an article in The New Yorker in collaboration with ProPublica about Russell Vought titled \"Donald Trump's Deep-State Wrecking Ball.\" We'll be right back. This is FRESH AIR.(SOUNDBITE OF ANORAAK SONG, \"HERE YOU GO\")GROSS: This is FRESH AIR. Let's get back to the interview I recorded yesterday with Andy Kroll, an investigative journalist covering the Justice Department and the judiciary at ProPublica. He's been investigating Russell Vought, the person behind Trump's dismantling of federal agencies and expanding the power of the presidency. Vought is the director of the Office of Management and Budget and an architect of Project 2025. He's the subject of Kroll's article in The New Yorker in collaboration with ProPublica titled \"Donald Trump's Deep-State Wrecking Ball.\"Russell Vought describes himself as a Christian nationalist. And he says, of course I describe myself that way. I'm a Christian, and I'm a nationalist. But when you say Christian nationalist, the implication is - or the definition is usually that you want to define America as a Christian nation. So to what extent does Russell Vought want to define America as a Christian nation? Like, what is - does he have a vision of what a Christian nation would be?KROLL: He's talked about this in private settings - what that actually means that we are a Christian nation 'cause he very much believes that. He has said that repeatedly. He talks about it in a couple of ways. For instance, he has argued that if we are a Christian nation, then our immigration system should reflect that and there should be more vetting of people who want to come to this country legally, whether they believe Christianity or not. He has said, why would we let someone into this country who, for instance, believes in Sharia law? So that's one approach - you know, who do we even let into the country?He's also talked at great length about Judeo-Christian values and teachings informing the work of people in public office, people who make policies, people who work not only in Congress but also in the executive branch and in the bureaucracy. How do you get policies that flow from Judeo-Christian worldviews? How do you make the legislative process more influenced by a Judeo-Christian worldview? For him, to go by his own words, that would mean that things like same-sex marriage are not compatible with that Judeo-Christian worldview and shouldn't exist. Abortion rights, in any form, not compatible with that Judeo-Christian worldview value system is how he's put it. He uses this term actual truth. I think it's a - kind of a biblical truth notion when he talks about how do we more integrate this specific Judeo-Christian value system with the functioning of our American government? It's a longer-term idea, obviously, but it's something that I think is really central to his own worldview.GROSS: So Vought calls himself a radical constitutionalist. What does he mean by that?KROLL: He means that the president has dramatically more powers than presidents have traditionally used, that the executive branch has far greater authority to exert the president's will and to freeze or block the work of Congress and that these independent agencies that have for so long operated without presidential or political interference should, in fact, be very much under the control at the direction of the White House. That, in his view, is what the founders intended. Hence, the name radical constitutionalists. That, of course, is not what many legal scholars and many administrations before this one have believed in how they have acted.GROSS: What do you think are the permanent or at least the long-term changes that Vought will leave behind?KROLL: The feeling that working for the federal government, that public service is not a safe and stable way to create a career, to be part of this larger American project, I think is a really major consequence and impact of what he's done. I think he has pushed the legal bounds of what the president can do to exert his will, talking about the funding freezes, talking about checking Congress' power of the purse, using the executive branch to choke off funding or redirect it in other - to other places that are more in line with the president's agenda. Ultimately, I think the biggest consequences of Vought's actions are going to play out in front of the United States Supreme Court. So many of the changes, the policies, the executive powers that Vought has exercised in just this year alone are likely going to end up in legal battles before the conservative supermajority in the Supreme Court. How the high court rules in those cases could lead to quite a radically different looking executive branch and even a dramatic set of changes to how we understand our three-part Democratic government working.GROSS: Andy Kroll, thank you so much for your research, and thank you for being on our show. I appreciate it.KROLL: It's a real pleasure. Thank you.GROSS: Andy Kroll covers the Justice Department and the Judiciary for ProPublica. His article, \"Donald Trump's Deep-State Wrecking Ball\" is published in The New Yorker in collaboration with ProPublica. Our interview was recorded yesterday. If you'd like to catch up on FRESH AIR interviews you missed, like this week's interviews with film directors Judd Apatow, Cameron Crowe and Nia DaCosta, check out our podcast. You'll find lots of FRESH AIR interviews. And to find out what's happening behind the scenes of our show and get our producers' recommendations for what to watch, read and listen to, subscribe to our free newsletter at whyy.org/freshair.(SOUNDBITE OF ROBERTO MONTERO'S \"DE DUAS, UMA\")GROSS: FRESH AIR's executive producer is Danny Miller. Our technical director and engineer is Audrey Bentham. Our managing producer is Sam Briger. Our interviews and reviews are produced and edited by Phyllis Myers, Roberta Shorrock, Ann Marie Baldonado, Lauren Krenzel, Therese Madden, Monique Nazareth, Susan Nyakundi and Anna Bauman. Our digital media producer is Molly Seavy-Nesper. Our consulting visual producer is Hope Wilson. Thea Chaloner directed today's show. Our co-host is Tonya Mosley. I'm Terry Gross.(SOUNDBITE OF ROBERTO MONTERO'S \"DE DUAS, UMA\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who's the man behind President Trump's dismantling of the federal government?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-30T16:10:03.000Z",
      "dateModified": "2025-10-30T16:10:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The federal government is still shut down. Here's what that means across the country",
    "url": "https://www.npr.org/2025/10/30/nx-s1-5589849/government-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+209/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fde%2F14%2F86b69ee6457194503e937ebce511%2Fgettyimages-2243480407.jpg",
    "tag": "Politics",
    "date": "2025-10-30T21:22:06.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A furloughed federal worker arrives to p",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A furloughed federal worker arrives to pick up boxes of food items at a Capital Area Food Bank distribution site in Gaithersburg, Md. on Oct. 29.\n                \n                    Al Drago/Bloomberg via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Al Drago/Bloomberg via Getty Images\n    \n\n   \n   The federal government shutdown has dragged into another week, and Republicans and Democrats appear no closer to ending it.   Many federal workers have missed paychecks, including air traffic controllers, who are working unpaid.    The impacts of the shutdown could soon get worse. That's because a number of federal programs are set to run out of money on Nov. 1. If that happens, tens of millions of people would lose federal food and nutrition benefits like Supplemental Nutrition Assistance Program, or SNAP, previously known as food stamps.   Also set to run out of funding are some Head Start programs, early-learning centers for low-income families, that serve more than 65,000 children nationwide.    \n   Read more about how food banks are bracing for SNAP funding to lapse   The Agriculture Department says it will reopen about 2,100 county offices despite the government shutdown to help farmers get access to $3 billion of aid. At the same time many American farmers say the Trump administration's trade policies have them on the brink.   As the shutdown continues, here's the latest on what we know.      Jump to state-specific impacts.      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Speaker of the House Mike Johnson (R-La.) speaks during a news conference on the government shutdown at the U.S. Capitol on Oct. 22, 2025 in Washington, D.C. (L-R) Johnson was joined by Rep. Mike Simpson (R-Idaho), Rep. Bruce Westerman (R-Ark.), House Majority Conference Chair Lisa McClain (R-Mich.), Majority Leader Steve Scalise (R-La.), and House Majority Whip Tom Emmer (R-Minn.).\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   Why did the federal government shut down?   A partisan argument over if and when lawmakers need to act to extend subsidies for the Affordable Care Act (ACA) marketplaces led to the current shutdown. Some 24 million people — who don't have insurance through their jobs or a public program like Medicaid — use the system to buy health plans.    Prominent Republican lawmakers have claimed the Democrats are looking to provide tax dollars to help pay for the health care of undocumented immigrants. That is not true.   Democrats in the Senate refused to vote for the Republican short-term funding bill that passed the House but did not include an extension of the health care tax credits. Democrats are also hoping to repeal cuts to health care programs that were put in place as part of the GOP spending and tax bill that passed over the summer.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                House Minority Leader Hakeem Jeffries (D-N.Y.), joined by House Minority Whip Katherine Clark (D-Mass.) (L) and House Democratic Conference Chair Rep. Pete Aguilar (R), speaks at a news conference on Capitol Hill on Oct. 22, 2025 in Washington, D.C.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   NPR's Deirdre Walsh reports that some Democrats say Nov. 1 could be a key date in talks to loosen the current gridlock. That date marks the beginning of open enrollment for people getting coverage through the ACA, when subscribers could see big premium increases unless the subsidies that have been helping people pay for coverage since 2021 are extended.   \n   Read more about more about the health care fight behind the shutdown here.   Plus, why Democrats are casting the government shutdown as a health care showdown.   — Selena Simmons-Duffin, NPR      What about WIC and SNAP benefits?   Of those at risk of losing food and nutrition aid if the shutdown continues into November, 7 million receive benefits through the Supplemental Nutrition Program for Women, Infants and Children (WIC.) Nearly 42 million who rely on SNAP are also expected to lose their benefits. Their debit-like cards were funded a month in advance through October, but the Trump administration has warned the program will run out of money Nov. 1.    In a letter dated Oct. 10, the USDA told state agencies to hold off distributing November benefits \"until further notice\" because of insufficient funds. The left-leaning Center on Budget and Policy Priorities has called on the agency to shift money from its contingency fund and other places to keep SNAP at least partially funded.   As NPR's Stephen Fowler reports, a coalition of more than two dozen Democratic state leaders are suing the Trump administration over its decision to suspend federal food benefits during the government shutdown. A federal court decision in that case may come as soon as Thursday.   WIC was initially slated to lose funding after only a couple weeks. The Trump administration shifted $300 million in tariff revenue to keep it afloat, but the National WIC Association says that emergency funding will only last through October. It's calling for an additional $300 million to keep WIC operating for a couple more weeks. Some states could step in to help fill the gap, depending on their resources.   — Jennifer Ludden, NPR   Read more on the impact of this potential lapse across the country, here. — and you can read more here about how food banks are bracing for it       What about Head Start?   Beginning Nov. 1, more than 65,000 children will be at risk of losing access to Head Start, the federal early-learning program for low-income families. That's because federal funding for individual Head Start programs cannot be disbursed while the government is shut down.   \n   Among the states hit hardest by this Nov. 1 deadline: Florida, Georgia, Missouri and Ohio.   Nationally, Head Start serves roughly 750,000 infants, toddlers and preschool-age children, providing not just childcare and early learning but also free meals, health screenings and family support.   Local Head Start programs are funded annually, though at different times of the year. Some programs get their money on Oct. 1, others on Nov. 1 and so on. If the shutdown lasts until December, says Tommy Sheridan of the National Head Start Association, still more programs would see their funding run out.   Without federal funding, Sheridan says, some programs will have to close immediately. Others have the resources to stay open at least another week, in hopes that politicians in Washington can resolve their differences.   — Cory Turner and Kadin Mills, NPR      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People receive food for furloughed federal workers at No Limits Outreach Ministries on Oct. 21, 2025 in Hyattsville, Md. The U.S. government shutdown dragged into a third week, with Congress gridlocked in a clash over spending and no resolution in sight to a crisis that has already cost thousands of jobs.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   What the shutdown means for federal workers   Altogether, about 1.4 million civilian federal employees across the country are going without pay, according to the Bipartisan Policy Center, a think tank in Washington, D.C.   Of those, roughly half are furloughed, which means they are not working and not getting paid, but expect to return to work once the federal shutdown is over.   The other half have been deemed essential and so are continuing to work.   By law federal workers are supposed to get back pay once the shutdown ends, but the White House has tried to cast doubt on that.   The Senate has failed to advance a pair of competing measures to pay at least some federal employees during the government shutdown.    The Trump administration has managed to move money around to ensure that some people get paid, including active duty military and law enforcement officers with the Department of Homeland Security.   Many other federal workers are also still getting paid as usual during the shutdown. Salaries for some federal employees, including the vast majority of those at the Department of Veterans Affairs, do not come out of appropriations that Congress must approve every year.   \n   Are government workers being laid off during the shutdown?   The Trump administration has been following through on threats to further slash the size of government during the shutdown, seeking to layoff roughly 4,000 workers earlier this month.   Some unions that represent workers are fighting back in court;  the federal judge overseeing the case on Tuesday indefinitely halted the Trump administration's shutdown layoffs, noting human toll. The order applies to federal employees in programs or offices where the plaintiff unions have members or bargaining units.      How is the shutdown impacting active duty military?    The Trump administration earlier this month found unused research and development funds to pay active military members, according to a Pentagon official not authorized to speak publicly. So they didn't miss a full paycheck earlier this month, but it only covered one pay cycle. Many are expecting their next paycheck at the end of this month.   Military families are already seeking additional assistance from food banks and other groups to help with paying bills.      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A United States Postal Service (USPS) mail box stands in Manhattan on Aug. 5, 2020 in New York City. Mail services will not be affected by the government shutdown.\n                \n                    Spencer Platt/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Spencer Platt/Getty Images\n    \n\n   \n   USPS is 'open for business as usual'   \"U.S. Postal Service operations will not be interrupted,\" according to a statement by USPS. The postal service is primarily self-funded and doesn't depend on the appropriations process to continue running as usual.      IRS furloughs nearly half its staff   A contingency plan from the Treasury Department says that slightly more than half of the IRS' approximately 74,000 workers remain on the job and will continue to work for the foreseeable future. Some IRS employees were issued reduction in force, or RIF, notices on Friday and posted screenshots of those notices informing them of their last day, Dec. 9.   The contingency plan says nearly all of those employees who continue to work will be paid using sources other than annual appropriations, which are on hold during the shutdown. Tasks will include completing and testing systems to handle next year's tax-filing season, and maintaining computers to prevent the loss of data.   \n   — Scott Horsley, Andrea Hsu and Stephen Fowler, NPR      National Nuclear Security Administration furloughs 1,400 employees   On Oct. 20, the National Nuclear Security Administration, which oversees the nation's nuclear weapons, said it is furloughing approximately 1,400 employees. The agency is responsible for overseeing thousands of warheads that are not currently deployed on missiles, bombers and submarines.   According to an Energy Department spokesperson, the furloughs are due to the \"Democrat shutdown.\"   Roughly 400 employees remain on the job providing security and safety oversight. And the office responsible for moving nuclear weapons around the country remains funded until next week.   — Geoff Brumfiel, NPR   In addition, Nevada Public Radio is reporting more than 1,000 nuclear contractors in Nevada could receive notices by the end of the month, because their work relies on the federal government remaining open.      Teachers and schools won't be directly impacted, but federal education functions might   Eighty-seven percent of Department of Education employees have been temporary furloughed, as detailed in agency shutdown contingency plans.   At the same time, the administration is trying to use a new round of layoffs to gut multiple offices inside the department, including the Office for Civil Rights and the office responsible for overseeing special education, according to multiple sources within the department.   This latest reduction-in-force (RIF) cut at least 121 staffers responsible for overseeing roughly $15 billion in special education funding and for making sure states provide special education services to the nation's more than 7.5 million children with disabilities. The courts have halted those layoffs. If they're ultimately allowed to go through, multiple sources told NPR the special education office would be left with just a handful of top executives and support staff.   In addition, many Department of Education employees who were furloughed were surprised to see a message blaming Democrats for the government shutdown inserted into their out-of-office replies. A federal workers union is suing the Trump administration for inserting the language into employees' out-of-office email messages.   \n   — Shannon Bond and Cory Turner, NPR   The Free Application for Federal Student Aid (FAFSA) for 2026 went live as scheduled at the start of October. As WPR's Corrinne Hess reports, the U.S. Department of Education says that student financial aid programs will continue, despite the shutdown.      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Greg Freeman, a National Park Service ranger closes the entrance gate due to the government shutdown at the Everglades National Park Shark Valley on Oct. 1 in Florida. Shark Valley remains open to visitors who park outside the entrance gate and walk in, although with limited staffing.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   National Parks are a mixed bag   Across the country, the National Park Service (NPS) have brought their operations to a halt. That includes the National Zoo and other Smithsonian facilities. NPR's Alana Wise reports that the Smithsonian assured the public that animals would still be cared for during the zoo's closure. Animal cams are considered nonessential and will be turned off for the remainder of the shutdown.   As KQED's Sarah Wright and Carly Severn reported, a contingency plan for the NPS says that park roads, lookouts and trails \"will generally remain accessible to visitors\" for the duration of the shutdown, but other services such as regular road and trail condition updates would not be provided.   Concerns have also been raised about the safety and responsibility of keeping parks open without having a robust number of employees available to conduct critical services.   The Salem, Mass. visitor center will be open through Halloween thanks to community support   WBUR's Andrea Shea reports that local leaders in Salem, Mass., learned a National Park Service visitor center and its bathrooms would be closed during their busiest tourist season so they took action on a plan to keep them open.   Shea reports that NPS agreed to let Salem reopen the center if the community covered costs through Halloween weekend. Annie Harris — CEO of the non-profit Essex Heritage that helps staff and run the facility — sent out a flurry of emails including to the mayor. Within 48 hours businesses and non-profits raised $18,000 — keeping the center open until Nov. 2.      Medicare, Medicaid and Social Security benefits will continue   Social Security, VA and other benefits will continue.   \n   But employees at Social Security field offices earlier this month said the government shutdown has left them unable to carry out an important service for some recipients. As NPR's Ashley Lopez reports, workers say they are unable to provide benefit verification letters to people calling in to request them. These official letters act as a sort of income verification and are therefore key to obtaining aid like housing assistance, fuel assistance and help from nonprofits.   In an Oct. 21 email to users answering commonly asked questions about how shutdown impacts, SSA noted the online portal can still be used to access benefit verification letters.   Some furloughed employees at the Labor Department were brought back to work, in order to complete the September inflation report, which is a key ingredient used to calculate the cost of living adjustment that Social Security recipients will receive next year. Last week, the SSA said the payments to recipients will increase by 2.8% next year, or an increase of about $56 per month starting in January.   Read more on how a fight over health policy led to the government shutdown from NPR's Selena Simmons-Duffin.      ICE will mostly continue uninterrupted   Immigration cases and enforcement are proceeding as usual during the government shutdown, with a few small exceptions. Department of Homeland Security spokesperson Tricia McLaughlin confirmed that the employees in the Office of Detention Oversight, which inspects immigration detention centers, is currently not working. \"We hope Democrats will open up the government swiftly so that this office can resume its work,\" McLaughlin said.   According to DHS Secretary Kristi Noem, DHS law enforcement, including ICE agents, will be paid for work done during the shutdown.   \"More than 70,000 sworn law enforcement officers across DHS including those serving in CBP, ICE, Secret Service, TSA and other critical mission areas will be paid for all hours worked during the shutdown period,\" Noem posted on X last week. \"By Wednesday, October 22, law enforcement officers will receive a \"super check\" — which covers the 4 days lost, their overtime, and their next pay period.\"   \n   The U.S. Coast Guard, which is housed within DHS, will continue to be paid, according to Noem; funds will be appropriated in the reconciliation bill earlier this year.   — Ximena Bustillo, NPR      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An air traffic control tower at the Austin-Bergstrom International Airport on Oct. 1 in Austin, Texas is seen following the federal government shutdown.\n                \n                    Brandon Bell/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brandon Bell/Getty Images\n    \n\n   \n   If you're flying soon …   Air traffic controllers and most Transportation Security Administration employees are considered \"essential workers\" and have to stay on the job. This week they officially missed their first full paycheck since the shutdown began.    Travelers across the U.S. are beginning to feel the impacts of the government shutdown, as air traffic control staffing shortages disrupt flights across the country.   Air traffic controllers helped to end the last government shutdown, and could help end this one as well. According to NPR's Joel Rose, the Transportation Department says there has been an uptick in the number of controllers who are calling in sick.   The Transportation Department says that federal subsidies for rural air travel will continue through Nov. 18, reports Alaska Public Media's Eric Stone. The department previously said it had enough funding to continue the program through Sunday.   Read more on what a shortage of air traffic controllers could do to bring an end to the shutdown, here       \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Signage indicates that Muir Woods National Monument in Marin County, Calif. is closed as a consequence of the government shutdown on Oct. 1, 2025.\n                \n                    Martin do Nascimento/KQED\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Martin do Nascimento/KQED\n    \n\n   \n   The impact of the shutdown looks different in different parts of the country   Some states across the country are uniquely positioned to feel the impact of the government shutdown. Reporters from the NPR Network are digging into the ways the government shutdown is playing out in their region.   Here's what we know so far about how the shutdown is affecting specific communities across the country:      Alaska   The U.S. Transportation Department says it has secured funding to continue the Essential Air Service program, subsidizing routes to 65 Alaska communities and more than an additional 100 communities nationwide, through Nov. 2. [Alaska Public Media]About 15,000 federal employees live in Alaska, one of the highest percentages of federal employees when compared with other states. President Trump's threat that federal employees could receive termination notices increases the uncertainty around how this crucial workforce to Alaska's economy could be affected. [Alaska Public Media]   For more on the impact in Alaska, head to Alaska Public Media.      Arizona   Arizona Gov. Katie Hobbs said she would not spend state funds to keep Grand Canyon National Park open should the government shutdown. [KJZZ] Social services in Grand Canyon Village are gearing up to support non-essential employees at Grand Canyon National Park, including food pantry resources. [KNAU]Sen. Ruben Gallego said the shutdown would also not affect federal relief money to communities in the Miami-Globe area after torrential monsoon rains caused flash flooding in the region [KJZZ]Phoenix Sky Harbor Airport joined a handful of other airports across the country that have refused to display a video from Homeland Security Secretary Kristi Noem blaming Democrats for the government shutdown. [KJZZ]      California   Gov. Gavin Newsom announced Wednesday that he would deploy the California National Guard to support food banks across California as the federal government shutdown drags on, threatening to delay and stall food stamp benefits for millions of residents. [KQED]Well over 1 million people in L.A. County get food benefits from CalFresh — the state's implementation of the federally funded SNAP program. The other major SoCal counties — San Bernardino, Riverside and Orange — each have more than 300,000 people on CalFresh, according to state data. [LAist]The shutdown of the federal government has brought the full or partial closure of many National Park Service sites across California: Muir Woods is fully closed. Alcatraz Island is slated to stay open. Other sites like Point Reyes National Seashore and Fort Point have partial closures, with some parking lots blocked or bathrooms locked. Even some park staff said they didn't learn the plan until Sept. 30 — the afternoon before the government shut down. Yosemite is open, but with lots of changes for visitors. [KQED]      Colorado   Sites and lands in Colorado operated by the National Park Service are open, but \"some services may be limited or unavailable,\" according to the agency's website. [Colorado Public Radio]In Colorado, the federal government employs thousands of workers at climate or land-management agencies. An EPA spokesperson told CPR News that the agency is operating under its shutdown plan, which would furlough thousands of employees. [Colorado Public Radio]Court documents show almost 200 Colorado-based positions that the Interior Department wants to cut. [Colorado Public Radio]Unemployment claims from Colorado's federal workers are surging amid the U.S. government shutdown. Stephanie Rogers, a Colorado-based microbiologist with the Food and Drug Administration, told CPR she filed for unemployment the day after the shutdown started. [Colorado Public Radio] Several Colorado credit unions are already issuing Government Relief Loans to help workers make ends meet. These short-term loans charge no interest as long as they're paid off within six months. [Colorado Public Radio]    Coloradans: Been impacted by the federal government shutdown? Colorado Public Radio wants to hear from you.      Connecticut   Connecticut will continue federally funded food assistance programs for state residents during the government shutdown, Gov. Ned Lamont said on Wednesday. But he said the state's reserve money for SNAP, the food assistance program for low-income families, will run out by the end of the month. [WSHU]Connecticut has a $2.5 billion budget surplus this year — its second largest in history. Advocates are asking Lamont to consider using it to help offset the federal shortfall. Legislative leaders are considering appropriating the money during a special session next month. [WSHU]      Georgia   For federal workers living paycheck to paycheck, one option to get through being furloughed could be filing for unemployment insurance, Georgia Labor Commissioner Barbara Rivera Holmes said. The employees will have to pay the benefits back once the shutdown ends and they receive back pay, but the benefits can help them make ends meet while they are not being paid. [GPB]Georgia farmers could also face delays in block grant funding and commodity data they rely on during the time-sensitive season of planting and harvesting. [NPR]      Hawaii   University of Hawaiʻi is paying affected employees out of pocket during shutdown. Over 830 University of Hawaiʻi employees are at least partially paid through federal dollars, with thousands more in positions that are fully federally funded. UH has been able to pay them with internal funds, but it costs more than $20 million a pay period — every two weeks — for the system to match their salaries. [Hawaiʻi Public Radio]   For more on the impact in Hawai'i, head to Hawaiʻi Public Radio.      Illinois   Three workers who spoke with the Chicago Sun-Times said they haven't been furloughed, but they've dealt with uncertainties and fragmented coordination since the federal government shut down Oct. 1 on top of a year of uncertainty. [Chicago Public Media]      Indiana   An estimated 24,000 civilians in Indiana work for the federal government. Gleaners Food Bank set up food distribution systems to help federal workers in Indiana impacted by the shutdown. [WFYI]      Iowa   Over 60,000 Iowans participate in the Special Supplemental Nutrition Program for Women, Infants and Children. [IPR]      Kansas   If the federal government shutdown continues, the Mid-America Regional Council said it may need to temporarily close Head Start centers serving more than 2,300 Kansas City children beginning Nov. 1. [KCUR]During the last two shutdowns, the USDA did not publish its monthly crop reports. This comes at an inconvenient time as Midwest farmers are in harvest season. [KCUR]   For more on the impact in Kansas City, head to KCUR.      Kentucky   Funding for food assistance benefits next month isn't coming, Gov. Andy Beshear said, due to the federal government shutdown. Funding for the Temporary Assistance for Needy Families program is also delayed. [LPM]      Louisiana   The National Flood Insurance Program, or NFIP, is managed by FEMA and provides flood insurance to those who don't have a private option. It has grown in size as most homeowner's insurance policies across the U.S. have dropped flood damage entirely. It covers nearly half a million Louisianans. Policyholders with expiring contracts could lose coverage and funds to pay claims have dropped $30 billion due to the shutdown. [WWNO/WRKF]   For more on the impact in Louisiana, head to WWNO/WRKF.      Maine   Nearly 170,000 Mainers, or over 12% of the state's total population, could lose food assistance if SNAP benefits are not funded for November. [Maine Public]Even though much of the staff of Acadia National Park in Maine has been furloughed, it has still been busy at the park. [Maine Public]      Maryland   Prince George's County is home to more than 60,000 federal workers. The Capital Area Food Bank has been distributing food to federal workers affected by the shutdown. But the timing is a double burden: The Capital Area Food Bank has seen some of its own federal funding slashed even as demand skyrockets. [WAMU]      Massachusetts   While travelers across the U.S. are experiencing delays and cancellations as a result of the ongoing federal government shutdown, it's mostly business as usual at Boston's Logan International Airport. [GBH]      Michigan   In response to how the federal shutdown will affect rural flights in Michigan, airport officials said they are continuing with \"business as usual.\" At least, for now. Federal funding for the Essential Air Service (EAS) program is set to extend only through Nov. 2. [Michigan Public]      Minnesota   Thousands of Minnesotans might not receive federal food aid benefits if the government shutdown continues into November, as federal officials have told states that funding for SNAP benefits is running out. [MPR News]      Missouri   Roughly 650,000 Missourians will not receive SNAP benefits for the month of November due to the ongoing government shutdown. [St. Louis Public Radio]The Gateway Arch and Old Courthouse in downtown St. Louis are temporarily closed, with National Park Service work largely on hold. [St. Louis Public Radio]      New Hampshire   SNAP serves more than 75,000 people in New Hampshire. And while state officials say they've received extra money to keep WIC running into November, it's unclear if SNAP will also be funded. [NHPR]On Oct. 7, Sen. Jeanne Shaheen, D-N.H., the veteran appropriator who has helped broker past bipartisan deals, told NPR, she has been working behind the scenes with senators from both parties to \"find common ground.\" [NPR]   For more on the impact in New Hampshire, head to NHPR.      North Dakota   The state-owned Bank of North Dakota is partnering with local banks and credit unions to provide short-term low interest loans to federal government employees and members of the armed services stationed in North Dakota, if they experience financial hardship because of the federal government shutdown. [Prairie Public]   For more on the impact in North Dakota, head to Prairie Public.      Oklahoma   With the federal government shut down, National Park rangers are not present at the Oklahoma City National Memorial and Museum. Victims, family members and first responders are stepping in to educate visitors on the location's story.⁠ [KOSU]      Oregon   The federal government program used to subsidize commercial flights in Pendleton got a last-minute reprieve from grinding to a halt due to the partial government shutdown. But as of Wednesday, immediate answers on how that might affect Eastern Oregon's only commercial airport are in short supply. The municipally operated Eastern Oregon Regional Airport in Pendleton holds the only Essential Air Service (EAS) contract in the state, a federal program that helps rural airports operate. [OPB]      Pennsylvania   Tens of thousands of Pennsylvania-based federal workers furloughed during the government shutdown may be eligible for unemployment compensation through the state Department of Labor & Industry. [WITF]      Tennessee   On Oct. 7, the FAA notified local officials in Nashville that flights in and out of Nashville International Airport (BNA) would be reduced Tuesday afternoon due to a shortage of air traffic controllers during the government shutdown. Nashville's airport was back to normal by Wednesday morning. [WLPN]      Texas   The Supplemental Nutrition Assistance Program provides food purchasing support to approximately 3.5 million Texans, including more than 1.7 million children. Those benefits amount to around $617 million per month. [KUT]U.S. Customs and Border Protection employees who inspect cargo at the 32 other official ports of entry are among the essential federal workers who must remain on the job unpaid. The longer the shutdown lasts, the greater the risk of cargo backups at these Texas ports due to unpaid employees calling in sick. [Houston Public Media]      Utah   In Ogden, Utah, about 10 percent works for the IRS, and when federal workers stop getting paychecks, impacts are felt quickly and broadly. (KUER)      Vermont   If SNAP benefits run out at the end of the month, 63,000 Vermonters would lose their benefits. SNAP dollars fund the Vermont program 3SquaresVT. [Vermont Public]Though the Vermont Legislature passed a state budget in May that set aside about $100 million to offset potential federal funding losses, Secretary of Human Services Jenney Samuelson told lawmakers last week that the state might not be able to leverage those reserves. [Vermont Public]Meanwhile, Vermont is waiting on more than $22 million in federal funds for the Low Income Home Energy Assistance, or LIHEAP, which helps people who can't afford to fill their heating tanks this winter. [Vermont Public]   For more on the impact in Vermont, head to Vermont Public.      Washington   The Employment Security Department says the 80,000 federal workers in Washington State may qualify for unemployment benefits. [OPB]A Bremerton food bank has launched extra hours for federal employees working without pay [KUOW]      Wyoming   On Oct. 3, Gov. Mark Gordon said Wyoming will cover gaps in funding to federally funded state employees who are in the state budget \"in the short-term.\" [Wyoming Public Media]For more on the impact in Wyoming, head to Wyoming Public Media.      NPR's Padma Rama, Emily Alfin Johnson and Heidi Glenn edited this piece.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The federal government is still shut down. Here's what that means across the country",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+209/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fde%2F14%2F86b69ee6457194503e937ebce511%2Fgettyimages-2243480407.jpg"
      ],
      "datePublished": "2025-10-30T21:22:06.000Z",
      "dateModified": "2025-10-30T21:22:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]