[
  {
    "title": "A Nobel Prize for explaining when technology leads to growth",
    "url": "https://www.npr.org/2025/10/14/g-s1-93307/a-nobel-prize-for-explaining-when-technology-leads-to-growth",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4002x2251+0+8/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F46%2F99%2Fbac1ebde4c6ca13ae920d8bf8be1%2Fgettyimages-2240391556.jpg",
    "tag": "Politics",
    "date": "2025-10-14T11:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                From left: A screen shows photos of Amer",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                From left: A screen shows photos of American-Israeli Joel Mokyr, France's Philippe Aghion and Canada's Peter Howitt during the announcement of the 2025 Nobel Memorial Prize in Economic Sciences at the Royal Swedish Academy of Sciences in Stockholm on Monday.\n                \n                    Jonathan Nackstrand/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jonathan Nackstrand/AFP via Getty Images\n    \n\n   \n   If you graph the history of economic growth, it looks a lot like a hockey stick laid on the ground with its blade sticking up. That is, economic growth was pretty flat for millennia, and then, around 1800, it points upward toward the sky.   It's no secret that this inflection point — where the stick's handle and blade meet — was the Industrial Revolution. That was a crucial turning point in the history of humankind, when we left economic stagnation behind and began seeing monumental improvements in the economy and our standard of living.   But why around 1800? Why did economic growth continue propelling upward after that point? And why was Britain the first society to experience this revolutionary change?   \n   The economic historian Joel Mokyr, a professor at Northwestern University and Tel Aviv University, was co-awarded the 2025 Nobel Prize in economics this week for his decades of research trying to answer these questions. (The economists Philippe Aghion and Peter Howitt share the other half of the 2025 prize \"for the theory of sustained growth through creative destruction.\")   For Mokyr, a crucial reason why Britain became the epicenter of the Industrial Revolution in 1800 has to do with science and technology. True, many societies before Britain had seen scientific breakthroughs and technological progress. And sometimes, Mokyr finds, that led to some economic growth. However, no society saw its economy catapulted into a kind of sustained escape velocity away from stagnation before.   Mokyr centers his explanation on why Britain was different by highlighting how it embraced science, technology and disruptive change. He puts a lot of emphasis on the role of the Enlightenment, or the intellectual awakening in science, philosophy, politics and other realms that swept Europe during and around the 18th century. It was a movement that revolutionized intellectual and political life and helped speed up technological progress.   But that still doesn't explain why it was specifically Britain that became the epicenter of the Industrial Revolution. Other European nations, including especially France, also experienced the Enlightenment.   \n   Mokyr's research suggests that Britain was different because, essentially, the Brits operationalized the Enlightenment in the real economy more than other nations. It wasn't just that scientists, philosophers and other thinkers had big intellectual breakthroughs. In Britain, these scientific discoveries and a new way of thinking filtered down to a skilled class of mechanics and entrepreneurs and other \"tweakers and tinkerers\" who put new ideas to practical use in the economy. In this way, \"macro inventions\" — or big, paradigm-shifting scientific discoveries — fed a slew of practical \"micro inventions\" that practitioners used to incrementally reshape the economic machinery of society, boosting productivity and rocketing economic growth to the moon.   So, yeah, science and technology are super important for economic growth. But the crucial ingredient, according to Mokyr, was that there was also a skilled population of workers and entrepreneurs who were willing and able to put those advances into real use in the economy. Mokyr also emphasizes that British political institutions — in particular, its Parliament — were more open to the disruptive changes (or \"creative destruction\") these new technologies unleashed, which often challenged the power and prosperity of entrenched interest groups.   And here is where the other Nobel winners this year, Philippe Aghion and Peter Howitt, help color in more of the picture. They place creative destruction at the center of their popular mathematical model of economic growth.   Creative destruction is an idea that's associated with the late Austrian economist Joseph Schumpeter. It refers to the healthy process of new technologies, products and businesses replacing outdated ones in a market economy. This process of change involves older businesses shrinking or even dying and, often, workers losing their jobs. So, yeah, there are losers in the process, and, throughout history, elites and interest groups have sought to block creative destruction. But economists, including Aghion and Howitt, theorize it's a crucial process for economic growth.   \n   It's a lot to chew on as the globe grapples with the rise of a new wave of disruptive technologies, including artificial intelligence. But the Nobel winners' work suggests that embracing this technological disruption — and finding ways to operationalize these big breakthroughs in the real economy — will be crucial for the hockey stick's blade to keep pushing upward.   Anyways, we're happy to say that Joel Mokyr has been a guest on Planet Money before. Check out our episodes: When Luddites attack and Imagining a world without oil. Mokyr also provided inspiration for a fictional audio drama we made once, long ago called \"The Last Job.\"   And, if this history-of-ideas type story is the kind of reading you're into, may I encourage you to click here to preorder the Planet Money book. There's a whole chapter on what causes economic progress and the role of technology, among other things. It gets into more depth than we have space for here. It has some fun visuals, too. Planetmoneybook.com. Tell a friend.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Nobel Prize for explaining when technology leads to growth",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4002x2251+0+8/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F46%2F99%2Fbac1ebde4c6ca13ae920d8bf8be1%2Fgettyimages-2240391556.jpg"
      ],
      "datePublished": "2025-10-14T11:00:00.000Z",
      "dateModified": "2025-10-14T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump awards the Medal of Freedom posthumously to Charlie Kirk",
    "url": "https://www.npr.org/2025/10/14/nx-s1-5574210/trump-charlie-kirk-medal-of-freedom",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2Fd1%2Fd6cb2c664e2f84a2d86fe0fe333e%2Fgettyimages-2167287751.jpg",
    "tag": "Politics",
    "date": "2025-10-14T23:08:09.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Turning Point USA Founder Charlie Kirk s",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Turning Point USA Founder Charlie Kirk speaks during a campaign rally for now-President Trump in Glendale, Ariz., in August 2024.\n                \n                    Rebecca Noble/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rebecca Noble/Getty Images\n    \n\n   \n   President Trump posthumously awarded the Medal of Freedom to conservative activist Charlie Kirk at the White House on Tuesday, just over a month after he was shot and killed during an event in Orem, Utah.   Kirk, who died at the age of 31, was a prominent ally of the president and was seen as a leading force in mobilizing young Americans to vote for him. His death has become a rallying cry for many Republican leaders and activists, who have pledged to continue his work.   Trump, who was personally close to Kirk – as were his son Don Jr. and Vice President Vance – praised Kirk's political impact during a ceremony held in the Rose Garden at the White House on Tuesday afternoon.   \n   \"We're here to honor and remember a fearless warrior for liberty, beloved leader who galvanized the next generation like nobody I've ever seen before,\" Trump said, adding that the ceremony fell on what would have been Kirk's 32nd birthday.   \"Charlie is attaining a far more important milestone,\" he added. \"We're entering his name forever into the eternal roster of true American heroes.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks with Erika Kirk, Charlie Kirk's widow, during the Medal of Freedom Ceremony on Tuesday in the White House Rose Garden.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   The Presidential Medal of Freedom is considered the highest civilian honor given by the U.S. government. Previous recipients include members of Congress, activists, as well as scientific leaders and cultural icons.   Kirk's death has ignited a broader discussion around the causes of political violence, with many GOP leaders placing blame on \"far left\" groups for fueling such violence. Without naming specific groups, Trump echoed those claims in his remarks Tuesday.   \"We've watched legions of far-left radicals resort to desperate acts of violence and terror because they know that their ideas and arguments are persuading no one,\" Trump said. \"They know that they're failing. They have the devil's ideology and they're failing.\"   But as the threat of political violence grows, data show an increase in violence committed by people who have been influenced by a mix of different extremist ideologies.   \n   At the time of his death, Kirk had developed a following of millions online, espousing socially conservative Christian beliefs. Critics of Kirk decried much of his rhetoric as offensive, including his opposition to transgender rights and past comments that the 1964 Civil Rights Act was a \"mistake.\"   Kirk's supporters denounced those who raised criticism after his death, resulting in some losing their jobs, and comedian Jimmy Kimmel was temporarily pulled from the air for his comments.   Within the Turning Point movement, the late activist was both regarded as an influential political figure and a seasoned youth organizer.   \n   He founded Turning Point USA in 2012 at the age of 18 to engage college and high school students in conservative ideas. More than a decade later, the organization has grown into a national player in Republican politics, with hundreds of chapters around the country and a reported revenue of nearly $85 million – along with a slew of sister organizations, including its advocacy group Turning Point Action, which worked with the Trump campaign on voter turnout efforts last year.   \n   The award ceremony comes just weeks after tens of thousands of supporters gathered in Glendale, Ariz., for Kirk's public memorial, where he was repeatedly labeled a political \"martyr.\"   It's a characterization that Trump repeated on Tuesday, as did Kirk's widow, Erika Kirk, who held back tears as she accepted the award on her husband's behalf.   \"God began a mighty work through my husband and I intend to see it through,\" said Erika Kirk, who has since been named the new CEO of Turning Point. \"The torch is in our hands now.\"   The 36-year-old faith-based entrepreneur has played a key role in shaping the next phase of her husband's organization, pledging to continue many of his efforts, including the campus tour he had just begun when he was assassinated.   \n   Since Kirk's death, Turning Point has also reported receiving tens of thousands of inquiries to start new chapters at schools around the country.   Near the start of her remarks, Erika Kirk made a point to highlight the organization's student network, calling it \"the heartbeat of this future and of this movement.\"   \"Everything that Charlie built, you guys are the legacy holders of that,\" she added. \"You are living proof that his mission did not die with him. It lives through you.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump awards the Medal of Freedom posthumously to Charlie Kirk",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9a%2Fd1%2Fd6cb2c664e2f84a2d86fe0fe333e%2Fgettyimages-2167287751.jpg"
      ],
      "datePublished": "2025-10-14T23:08:09.000Z",
      "dateModified": "2025-10-14T23:08:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With new cuts at CDC, some fear there's 'nobody to answer the phone'",
    "url": "https://www.npr.org/2025/10/14/nx-s1-5574469/cdc-shutdown-federal-layoffs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F79%2F7d6847dc4ed0980d02f824ffa174%2Fgettyimages-2231836769.jpg",
    "tag": "Politics",
    "date": "2025-10-15T00:57:03.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Centers for Disease Control and Preventi",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Centers for Disease Control and Prevention staff and supporters protested cuts to the agency outside its headquarters in August. Over this past weekend, hundreds more employees were fired.\n                \n                    Dustin Chambers/Bloomberg/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Dustin Chambers/Bloomberg/Getty Images\n    \n\n   \n   Around 600 workers at the Centers for Disease Control and Prevention were cut over the long weekend, as part of a wider push by the Trump Administration to slash the size of the federal workforce during the government shutdown.   It was not a smooth process. On Friday, more than 1,300 CDC employees were notified that they had lost their jobs. Many of them were furloughed because of the shutdown, and found out only after Russell Vought, director of the Office of Management and Budget, posted on X that \"the RIFs have begun.\"   The next day, around 700 employees got emails revoking these reduction in force notices, according to numbers compiled by the National Public Health Coalition, a group of former CDC employees.   \n   Aryn Melton Backus, a health communication specialist with the CDC's Office on Smoking and Health who has been on administrative leave for months, was one of them. It was the third time this year she's received a termination notice.   \"We have no idea why certain programs were eliminated and others were saved,\" Backus said in a press conference held Tuesday by NPHC. \"At this point, it seems like the chaos and lack of transparency is the point.\"   In a Tuesday court filing, the Department of Health and Human Services attributed some of the firings and rapid rescindments to \"data discrepancies and processing errors.\"   When the dust settled, around 600 CDC staffers were cut over the weekend, according to the former CDC employee group and AFGE Local 2883, a union that represents CDC workers.   \n   Those fired include CDC staff who brief Congress, those working on health statistics and chronic disease. It also affected CDC support staff, such as those at the CDC library, those who provided mental health support after an attack at the CDC's main campus in August, and human resources staff who were called back from furlough to lay off colleagues and members of their own team.   HHS declined to confirm numbers or groups affected by this round of layoffs, but Andrew Nixon, director of communications, said staffers that were terminated were \"designated non-essential.\"    \n   The court filing states that, on October 10, a total of 982 employees were purposefully cut from HHS, which includes agencies such as the Substance Abuse and Mental Health Services Administration and the Administration for Strategic Preparedness and Response, in addition to CDC.   The national federal workers union is contesting the legality of these and other layoffs.   \"These illegal firings of our union members during a federal government shutdown is a callous attack on hardworking Americans and puts the livelihoods, health and safety of our members and communities at great risk,\" said Yolanda Jacobs, a health communications specialist at CDC and president of AFGE Local 2883, speaking at a union press conference on Tuesday.   The recent round of cuts add to the stream of workers leaving the CDC this year due to earlier rounds of firings, early retirements and resignations. The CDC has lost around 3,000 employees, or a quarter of its staff, since January according to the union.   The entire staff of the CDC's Washington office was eliminated in the recent cuts, upending a longstanding support system for Congressional representatives.   \"CDC has worked directly with Congress for decades to help constituents by providing data, expertise and insight when needed,\" said Dr. John Brooks, who retired last year as chief medical officer for the CDC's Division of HIV Prevention, at the NPHC press conference. \"These firings mean Congress no longer has a means of direct access to the agency it funds when it needs information or briefings.\"   Outside of the Washington office, CDC policy experts that help develop briefings and answer questions from Congress have also been eliminated, according to NPHC.   Overall, the cuts to CDC staff and budget under the Trump Administration undermine the nation's public health infrastructure, Brooks says. \"Many experts, including myself, are concerned that we are no longer well prepared for the next big outbreak or disaster because of the Trump administration's continued erosion of our nation's ability to respond to public health emergencies.\"   \n   State and local health departments are feeling the effects. When faced with problems such as outbreaks of food poisoning or hospital infections, they've traditionally reached out to the CDC for help.   \"Sometimes that help might be — we're going to send some people to help you investigate this. Sometimes that might be talking to somebody who's the world's expert on a specific type of infection or exposure,\" said Dr. Karen Remley, a former CDC official and former health commissioner for Virginia, at the NPHC press conference. \"Now, there's nobody to answer the phone.\"   In an email, Nixon of HHS described the federal health infrastructure as a \"bloated bureaucracy,\" and said: \"HHS continues to close wasteful and duplicative entities to streamline the agency for the American people.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With new cuts at CDC, some fear there's 'nobody to answer the phone'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F58%2F79%2F7d6847dc4ed0980d02f824ffa174%2Fgettyimages-2231836769.jpg"
      ],
      "datePublished": "2025-10-15T00:57:03.000Z",
      "dateModified": "2025-10-15T00:57:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Opinion: Why I'm handing in my Pentagon press pass",
    "url": "https://www.npr.org/2025/10/14/g-s1-93297/pentagon-reporter-opinion-press-policy",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2Fcf%2F6e351f0045efa4cb33f35d925782%2Fgettyimages-2221457199.jpg",
    "tag": "Politics",
    "date": "2025-10-14T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Defense Secretary Pete Hegseth (lef",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                U.S. Defense Secretary Pete Hegseth (left), accompanied by Chairman of the Joint Chiefs of Staff Air Force Gen. Dan Caine, speaks during a news conference at the Pentagon in June in Arlington, Va.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   Today, NPR will lose access to the Pentagon because we will not sign an unprecedented Defense Department document, which warns that journalists may lose their press credentials for \"soliciting\" even unclassified information from federal employees that has not been officially approved for release. That policy prevents us from doing our job. Signing that document would make us stenographers parroting press releases, not watchdogs holding government officials accountable. No reputable news organization signed the new rule — not mainstream outlets like NPR, The Washington Post, CNN, and The New York Times, nor the conservative Washington Times or the right-wing Newsmax, run by a noted ally of President Trump. Some 100 resident Pentagon press will be barred from the building if they don't sign by the end of business on Tuesday. I've held my Pentagon press pass for 28 years. For most of that time, when I wasn't overseas in combat zones embedding with troops, I walked the halls, talking to and getting to know officers from all over the globe, at times visiting them in their offices.   \n   Did I as a reporter solicit information? Of course. It's called journalism: finding out what's really going on behind the scenes and not accepting wholesale what any government or administration says.   I remember how then-Defense Secretary Donald Rumsfeld was ecstatic after the fall of Baghdad in 2003, insisting that it showed the success of the U.S. invasion. Not long after, I ran into an officer at the Pentagon who told me, \"No, Tom. It's not a success. Saddam Hussein's supporters are attacking our supply lines. Now, we have to send more troops back to guard them.\" That was because the United States, at Rumsfeld's insistence, never sent an adequate number of forces to Iraq to begin with — a fact another Army general warned me about, unsolicited — and I reported on, before the war even began. Instead of toeing the official line, that reporting helped people understand what U.S. troops were really facing. Far from being a success, the fall of Baghdad marked the beginning of an insurgency that stretched on for years.   \n   (Defense Department officials, by the way, have already restricted reporter movements in the Pentagon. They closed that particular hallway to reporters several months ago.) In 2009, when the Obama administration announced a  \"surge\" of State Department employees to Afghanistan to help the military keep the peace in restive, far-flung provinces, one Marine officer told me months later: \"If there was a surge, we never saw it.\" And when the administration touted an Afghan \"government in a box,\" to bring experienced Afghans to the provinces, it proved to be a failure. One general told me: \"Next time they tell you there's a government in a box, check the box.\" Again, I reported both stories. That's my job. Over the years, to be able to inform the public and hold the government to account for the wars being waged in Iraq and Afghanistan and the fight against the Islamic State in Syria, NPR reporters, producers, photographers and I have spent a lot of time in combat zones.   \n   We got to know soldiers and Marines over the years while embedding with them, talking with them and getting their perspective, which was often far different from what we were told officially at the Pentagon. Sometimes officials at the Pentagon would declare progress or success. Out in dusty combat outposts or on patrols, we would learn the truth was far more complicated. I'm still in touch with many of those soldiers and Marines we met long ago. I'm having a beer with one of them the end of this week. They want the truth to get out, too. In June 2016, U.S. officials were insisting that Afghan troops were making progress against the Taliban. I was part of a team of NPR reporters that embedded with Afghan forces to find out if that official line was indeed true, trying to get the ground truth about what had become America's longest war. We were travelling in an Afghan convoy in western Afghanistan when we were ambushed. I lost two friends and NPR lost two brave colleagues, photographer David Gilkey and translator Zabihullah Tamanna, that day. Producer and colleague Monika Evstatieva and I were in that convoy, took small arms fire, but were unharmed.  When we flew by helicopter to bring David and Zabi's bodies to a nearby American base, the U.S. general there ordered an honor cordon, a tribute that is usually reserved for fallen troops, not civilians from the United States and Afghanistan. Out of respect for two people who'd lost their lives in their line of duty, doing their jobs documenting the truth as journalists, U.S. soldiers lined up in the darkness on either side as David and Zabi were carried off the helicopter.  I fought hard not to weep at one of the most decent, humane, and heartfelt gestures I've ever seen.   \n   In NPR's lobby, there's a memorial to David and Zabi, including one of the cameras David was carrying that day, scorched and damaged. So yes, we've received solicited and unsolicited information on everything from failed policies and botched military operations that led to unnecessary military and civilian deaths, to wasteful government projects that both Democratic and Republicans administrations would rather stay in the shadows.  That's our job. Now, we're barely getting any information at all from the Pentagon. In the 10 months that the Trump administration has been in office, Defense Secretary Pete Hegseth has given just two briefings.   \n   And there have been virtually no background briefings, which were common in the past whenever there has been military action anywhere in the world, as there has been with the recent bombings of Iran's nuclear facilities and of boats off the coast of Venezuela alleged to be carrying illicit drugs. In previous administrations, Defense Department officials — including the acerbic Rumsfeld — would hold regular press briefings, often twice a week. They knew the American people deserved to know what was going on.   \n    Thomas Jefferson, no fan of the press himself, once wrote that our liberty depends on the freedom of the press, \"and that cannot be limited without being lost.\" He knew a free and fair press is an essential safeguard to a functioning democracy. So now, how will the American people find out what is being done at the Pentagon in their name, with their hard-earned tax dollars, and more importantly, the decisions that may put their sons and daughters in harm's way? With no reporters able to ask questions, it seems the Pentagon leadership will continue to rely on slick social media posts, carefully orchestrated short videos and interviews with partisan commentators and podcasters. No one should think that's good enough. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Opinion: Why I'm handing in my Pentagon press pass",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2Fcf%2F6e351f0045efa4cb33f35d925782%2Fgettyimages-2221457199.jpg"
      ],
      "datePublished": "2025-10-14T09:00:00.000Z",
      "dateModified": "2025-10-14T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GOP 'afraid to do anything' unless Trump approves, says Virginia Sen. Tim Kaine",
    "url": "https://www.npr.org/2025/10/14/nx-s1-5570840/tim-kaine-shutdown-federal-workers",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4608x2592+0+136/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F33%2F36718dba40cdadc2c0b00081e236%2Fgettyimages-2239027984-1.jpg",
    "tag": "Politics",
    "date": "2025-10-14T10:47:26.000Z",
    "description": "\n      \n      Virginia Sen. Tim Kaine on the shutdown's impact on federal workers in his state\n    \n            \n                \n                Tran",
    "body": "\n      \n      Virginia Sen. Tim Kaine on the shutdown's impact on federal workers in his state\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5570840/nx-s1-9490636\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Tim Kaine, D-Va., leaves a Senate Democratic meeting at the U.S. Capitol in Washington, Oct. 3.\n                \n                    Kevin Dietsch/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch/Getty Images\n    \n\n   \n   Shutdown negotiations can't move forward without President Trump getting more involved in them because \"Republicans are afraid to do anything unless the president blesses it,\" says Sen. Tim Kaine, a Democrat from Virginia.   The federal government has been shut down since Oct. 1. Congress has been unable to pass either of two dueling measures proposed by both major parties. Republicans want a clean spending resolution to fund the government for seven weeks. Democrats want to fund the government and extend Affordable Care Act (ACA) subsidies used by more than 20 million people, undo federal health spending cuts and limit Trump's power to withhold funds appropriated by Congress.   \n   Both sides have blamed each other for the shutdown. House Speaker Mike Johnson warned on Monday that the U.S. is \"barreling\" toward one of the longest shutdowns in U.S. history, \"unless Democrats drop their partisan demands and pass a clean, no-strings-attached budget to reopen the government and pay our federal workers.\"   In an interview with Morning Edition, Kaine said Democrats' funding plan is not a demand but an alternative to \"fix this health care mess\" created by Trump and the GOP. The impasse means that, for now, there is no end in sight to the shutdown,   As it stretches on, federal employees in Virginia may soon feel or already feel the pain of going without pay. More than 4% of the state's non-farm workers are employed by the federal government, according to the Labor of Bureau Statistics. The state also has the second largest number of active duty servicemembers, according to the Defense Department.   Kaine said that while Virginians are troubled by the federal shutdown, many have also been troubled by \"the layoffs, the clawbacks of federal public health funding, [and] the cancellation of economic development projects\" made since Trump returned to the White House.   The administration is following through on a plan by White House Office of Management and Budget Director Russell Vought to lay off more federal employees permanently. Last week, the government said in court documents that more than 4,000 workers began receiving reduction in force notices.   \n   \"This didn't start when the shutdown started,\" Kaine said. \"It started on Donald Trump's Inauguration Day.\"   Where Kaine shares common ground with Trump is on ensuring troops are paid during the shutdown. Trump directed the Pentagon to use some $8 billion of unused research and development funding to pay troops on their expected Oct. 15 pay date.   Kaine said \"Virginians would generally support the notion\" of available Pentagon dollars being spent on troop pay, noting that the executive move would make him nervous if money was being shifted away from other government priorities.   On getting the government to reopen, Kaine said his constituents want him to \"get a deal that the White House will honor,\" and called on Trump and Republicans to be part of productive talks.   \"If the president engages, we can solve this in 48 hours,\" Kaine said.   You can listen to the full interview by clicking play on the button at the top of this article.    The digital version of this interview was edited by Treye Green.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GOP 'afraid to do anything' unless Trump approves, says Virginia Sen. Tim Kaine",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4608x2592+0+136/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F33%2F36718dba40cdadc2c0b00081e236%2Fgettyimages-2239027984-1.jpg"
      ],
      "datePublished": "2025-10-14T10:47:26.000Z",
      "dateModified": "2025-10-14T10:47:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Move over James Bond: A new service lets anyone share secrets with Britain",
    "url": "https://www.npr.org/2025/10/14/nx-s1-5564056/security-mi-6-uk-secrets-foreign-intelligence-silent-courier",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7082x3984+0+263/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc0%2Fcd%2Fb625a1ee4a8d8f4b2c62345ba230%2Fap25077445928572.jpg",
    "tag": "Politics",
    "date": "2025-10-14T08:45:38.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A view of the headquarters of Britain's ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A view of the headquarters of Britain's Secret Intelligence Service, known as MI6, in London, Tuesday, March 18, 2025.\n                \n                    Kin Cheung/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kin Cheung/AP\n    \n\n   \n   The United Kingdom has a new way for people to share secrets with the country's foreign intelligence agency.   It's called Silent Courier, and it's being advertised online.   \n   The service can be found on the dark web, and allows potential spies to share classified information with the U.K.'s Secret Intelligence Service — better known as MI6 — securely. The nation's Foreign Office, which oversees MI6, says the portal is being launched as the U.K. tries to recruit \"potential new agents in Russia and around the world.\"   That makes sense to former MI6 intelligence officer Matthew Dunn. He told NPR that Silent Courier could be used by foreign officials who otherwise couldn't meet with an MI6 handler, or sneak into a British embassy.   \"MI6 has always had the facility for what we call walk-ins. Traditionally, that is embassy driven,\" he said. \"Sometimes, we have had gold dust intelligence as a result of defectors and the like.\"   Silent Courier is a less risky option, Dunn believes.   \"The potential for somebody to think 'thank goodness for that, I now have a mechanism to contact the organisation, [when] for various reasons I couldn't physically face to face present my credentials,' this enables that possibility,\" he added.   \n   Dunn also thinks it could be useful for getting information related to Russia's war in Ukraine from those involved in the conflict, especially if they're not being specifically targeted by MI6.   \"This is a complementary strategy that's taking place and one that is clearly reflective of the nature of the world as [it] is right now,\" Dunn said.   MI6 is home to the fictional character James Bond, but prospective double agents don't need to channel the skills of 007 to use Silent Courier.   A promotional video on YouTube explains how to access the service. The introduction is delivered by Sir Richard Moore, who served as MI6's chief under the codename \"C.\" Moore recently retired, paving the way for Blaise Metreweli, the first woman to lead the agency.   A security risk for the United States?    The ease with which people could contact MI6, even from inside the United States, has raised concerns among intelligence veterans.   \"I'm hopeful that there's been complete coordination between the U.K. and the U.S.,\" said Frank Figliuzzi, a former assistant director of the FBI for counter-intelligence, the part of the bureau responsible for catching spies operating inside the U.S.   \"It's the first time that I've seen the Brits do this as broadly as they appear to be doing it here, certainly using social media platforms and casting a wide net in their efforts to collect [intelligence],\" Figliuzzi told NPR.   \n   Both countries are members of the Five Eyes intelligence-sharing alliance, meaning that information gathered through Silent Courier could, in theory, be shared with Washington. Approached by NPR for comment, Britain's Foreign Office declined to comment on that specifically, but added \"the US is our closest ally, and we will continue to cooperate closely on defence, intelligence and security matters.\"   The fact that MI6's instructional videos are accessible inside the U.S. raised another issue, Figliuzzi said.   \"This question of coordination becomes even more interesting if indeed someone inside the United States has decided 'I think I'd rather deal with the Brits than with the Americans,' for whatever reason, political or otherwise.\"   Figliuzzi speculated that shifts in Washington could prompt that choice.   \"Have the Brits said, 'look, it's time for us to pick up any slack there,'\" he said. \"The question of whether the Brits would tell us that a person inside our borders has chosen to deal with them, I hope that that's the case. But in the dark world of cloak and dagger work, we may not know that ever, let alone in the short term.\"   With Silent Courier, MI6 might not need to send James Bond to handle it.   The radio version of this story was edited by Ashley Westerman, and the digital version was edited by Majd Al-Waheidi.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Move over James Bond: A new service lets anyone share secrets with Britain",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7082x3984+0+263/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc0%2Fcd%2Fb625a1ee4a8d8f4b2c62345ba230%2Fap25077445928572.jpg"
      ],
      "datePublished": "2025-10-14T08:45:38.000Z",
      "dateModified": "2025-10-14T08:45:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amid shutdown, Trump administration guts department overseeing special education",
    "url": "https://www.npr.org/2025/10/13/nx-s1-5572489/trump-special-education-department-funding-layoffs-disabilities",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7877x4431+0+410/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Faa%2F163f4ae54dd1970ccf9cb96be049%2Fgettyimages-2206055353.jpg",
    "tag": "Politics",
    "date": "2025-10-13T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person walks past the U.S. Department ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person walks past the U.S. Department of Education  in Washington, D.C.\n                \n                    Win McNamee/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Win McNamee/Getty Images\n    \n\n   \n   Sweeping layoffs announced Friday by the Trump administration landed another body blow to the U.S. Department of Education, this time gutting the office responsible for overseeing special education, according to multiple sources within the department.   The reduction-in-force, or RIF, affects the dozens of staff members responsible for roughly $15 billion in special education funding and for making sure states provide special education services to the nation's 7.5 million children with disabilities.   \n   \"This is decimating the office responsible for safeguarding the rights of infants, toddlers, children and youth with disabilities,\" said one department employee, who, like the others NPR spoke with, requested anonymity for fear of retribution.   According to sources, all staff in the Office of Special Education and Rehabilitative Services (OSERS), with the exception of a handful of top officials and support staff, were cut in Friday's RIF. The office is the central nervous system for programs that support students with disabilities, not only offering guidance to families but providing monitoring and oversight of states to make sure they're complying with the landmark Individuals with Disabilities Education Act (IDEA).   \n   The layoffs at the Education Department, 466 in total, were part of broader cuts — some 4,200 jobs — announced by government lawyers in a court filing on Friday as the shutdown continues.   At the Education Department, it's not clear precisely how many workers in the special education office were cut. Department officials did not respond to NPR's requests for clarity or comment.   \"Based on multiple reports from staff and their managers, we believe that all remaining staff in the Office of Special Education and Rehabilitative Services (OSERS), including the Office of Special Education Programs (OSEP) and the Rehabilitative Services Administration (RSA), have been illegally fired,\" said Rachel Gittleman, president of AFGE Local 252, a union that represents many Education Department employees.   \"The harm these cuts will cause for the 7.5 million students with disabilities across the country is only beginning,\" Gittleman added.   Employees who received a notice Friday were told they would remain employed until Dec. 9.   Protecting students with disabilities   NPR spoke with half-a-dozen federal workers who have been cut — all of them in the Office of Special Education and Rehabilitative Services, and also with former officials with close ties to the office of special education.   Employees in the office of special education described a host of key responsibilities that they worried might now go unmet, creating a painful void for states, school districts and families.   \n   The federal law known as IDEA, which turned 50 years old this year, guarantees all children with disabilities the right to a free and appropriate public education. Before the law was passed, those children were often refused admission to schools, including public schools, or warehoused in substandard facilities where they learned little and enjoyed few rights.   IDEA is considered a civil rights law first and foremost, requiring states to provide special education services for children from birth to age 21. It also helps fund those services.   As part of the law, every year states must submit student data to OSERS staff, to show they're following the requirements of the law. States must also submit annual plans and apply, each year, for the billions of dollars available through IDEA to help them pay for special education.   OSERS staff review those state plans, analyzing the data and ensuring they are in compliance with federal law. These staffers can initiate investigations into states if they believe they have intentionally or unintentionally fallen out of compliance. They also provide technical assistance to states.   Without these OSERS staff, one employee told NPR, \"there is no oversight to make sure all children with disabilities get the services they're entitled to.\"   OSERS staff also field calls directly from parents and families around the country seeking help understanding their child's rights under federal disability law and, in some cases, seeking help when they worry they're being unlawfully denied services.   \"I don't think people realize how many calls we get from parents and families every day,\" one affected worker told NPR. Now these calls will go unanswered.   Returning education to the states   President Trump has talked repeatedly about wanting to return education to the states and that dismantling the Education Department is part of that plan.   Eliminating these staff members does not, at this point, cut special education funding to states.   \n   But one state director of special education, who spoke with NPR on the condition of anonymity out of concern the government would retaliate against that state, said they worry about the implications for students and families.   \"I'm fearful. I think it's good for states to know there's federal oversight and that they'll be held accountable,\" the official said. \"The concept of leaving special education up to states sounds great, but it's scary. What happens if one state decides to interpret the law one way, but another state disagrees and interprets it differently?\"   Multiple sources also questioned the legality of the cuts to OSERS. Federal law requires that there be an Office of Special Education Programs — within the U.S. Department of Education — to manage and oversee special education funding and programs. As such, these sources said, effectively closing the office by firing its staff should require an act of Congress.   \"Now, the federal government is out of compliance with federal disability law,\" one OSERS employee told NPR. Another wondered: \"Who will families go to when there's nobody left?\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amid shutdown, Trump administration guts department overseeing special education",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7877x4431+0+410/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5c%2Faa%2F163f4ae54dd1970ccf9cb96be049%2Fgettyimages-2206055353.jpg"
      ],
      "datePublished": "2025-10-13T09:00:00.000Z",
      "dateModified": "2025-10-13T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maine Gov. Janet Mills enters crowded Democratic race to unseat Susan Collins",
    "url": "https://www.npr.org/2025/10/14/nx-s1-5570893/janet-mills-susan-collins-maine-senate",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5051x2841+0+263/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F81%2F3c%2F69d8cddb4d3d974d9c1c1438a40b%2Fap25254600003282.jpg",
    "tag": "Politics",
    "date": "2025-10-14T11:05:48.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Democratic Gov. Janet Mills delivers her",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Democratic Gov. Janet Mills delivers her State of the State address, Jan. 30, 2024, at the State House in Augusta, Maine. Mills has announced a run to unseat Susan Collins in the U.S. Senate.\n                \n                    Robert F. Bukaty/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Robert F. Bukaty/AP\n    \n\n   \n   Maine Gov. Janet Mills announced Tuesday that she'll enter the race to defeat Republican U.S. Sen. Susan Collins, a top target in national Democrats' bid to regain the Senate.   Mills was recruited by Democratic Senate leaders after her high-profile confrontation with President Trump in February over transgender athletes, a dispute that triggered a wave of retaliatory moves by his administration against the state. The exchange is featured in her launch ad.   \"My life's work has prepared me for this fight and I'm ready to win,\" Mills says in the video. \"This election will be a simple choice: Is Maine going to bow down or stand up? I know my answer.\"   \n   In an interview, Mills said the interaction was a \"jaw-dropping\" moment that showcased Trump's monarch-like aspirations. She said it also pushed her to consider running for a Senate seat that she previously hadn't wanted.   \"When I was a little girl growing up in Farmington, my father always said you have to stand up to bullies. You can't let them have their way or they'll never stop,\" she said. \"And I think that's what's going on in Congress right now ... Congress is not standing up to him. Susan Collins is not standing up to him.\"   She added, \"I don't think I could forgive myself if I didn't give everything I've got to change what's going on in a very dysfunctional government in Washington.\"   To defeat Collins, Mills will first have to navigate a potentially bruising primary. The contest already features more than half a dozen candidates, including two, Jordan Wood and Graham Platner, who are taking a more progressive tack. Platner is also channeling Democratic voters' disillusionment with party leaders and has framed Mills' candidacy as an example of their unwillingness to part ways with the \"same old, tired playbook.\"   Platner's candidacy, endorsed by independent U.S. Sen. Bernie Sanders of Vermont, is part of a national trend in which insurgent candidates are taking on Democratic incumbents or those favored by national party leaders. A few days before Mills' announcement, Sanders said in a social media post that \"it's disappointing that some Democratic leaders are urging Governor Mills to run. We need to focus on winning that seat & not waste millions on an unnecessary & divisive primary.\"   \n   Mills, who will be 78 in December, said she looked forward to the primary and is eager to contrast her accomplishments as governor against the other candidates. She highlighted her efforts to steer more of the state budget for local education, expanding Medicaid health coverage for low-income Mainers and providing free meals in public schools. She also noted her long history of standing up for abortion rights, expanding access to the procedure after the Supreme Court's Dobbs decision and making Maine a haven for women who live in states where it's restricted or outright banned.   \"I'm the only candidate in this race who has delivered on those things,\" she said.   Mills has proven a formidable statewide candidate in her two successful runs for governor. In 2022, she defeated conservative firebrand and former Gov. Paul LePage to win her second term, holding her own in Maine's conservative 2nd Congressional District.   A steep climb for Democrats   The U.S. Senate race will present a new and daunting challenge.   Democrats haven't won a U.S. Senate race in Maine since former Sen. George Mitchell won reelection in 1988. Collins has held her seat since 1996. Democrats' ballyhooed and famously expensive bid to unseat her in 2020 sputtered to an 8-point defeat in a state that President Joe Biden carried by 9 points.   Democrats believe Collins is more vulnerable now. The Maine Democratic Party has repeatedly sought to highlight what they see as her diminished influence as chairwoman of the Senate Appropriations Committee amid the Trump administration's bid to consolidate power in the executive branch.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Susan Collins, R-Maine, departs the U.S. Capitol on Sept. 30. Democrats say Collins has lost influence as an appropriator and have attacked her votes to confirm Trump's controversial cabinet picks.\n                \n                    Kent Nishimura/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kent Nishimura/Getty Images\n    \n\n   \n   Her potential ascension to the budget panel was repeatedly highlighted by her campaign in 2020 as a way to sway Maine's fickle — and often decisive — independent voting bloc.   Mills touched on that critique as well, saying Collins' climb to the budget committee was a \"big deal\" but that she hasn't used her position to push back against Trump's bid to wrest more spending authority from Congress.   \n   Democrats have also attacked her votes to confirm Trump's controversial Cabinet picks and to confirm judges they say are hostile to abortion rights.   Mills would be the oldest freshman elected to the upper chamber in modern history if she's able to topple Collins, who will be 73 in December. The governor acknowledged that age will be \"a consideration\" for some voters, but she thinks they'll side with her experience, especially in the Democratic primary.   \"I know I can take on this one last fight and get it done,\" she said.   A crowded primary field    The governor's entry in the race will likely discourage other Democratic hopefuls from running and it may force out already declared candidates.   Wood and Platner have vowed to stay in. Platner, asked recently about Mills' seemingly imminent candidacy, told Maine Public that his campaign won't change its approach much.   \"We're going to undertake the same project, no matter who gets in,\" he said, adding, \"This is a campaign to reshape the Democratic Party.\"   Platner, an oyster farmer and military veteran, has said that his campaign is about building a movement and a political infrastructure that will endure after next year's midterms. His campaign already claims 6,000 volunteers and his town hall appearances have drawn large crowds. It also claims to have raised more than $4 million in a little more than a month.   Wood, a former staffer for U.S. Rep. Katie Porter, D-Calif., claims his campaign has raised a similar amount over a longer period.   Mills, a former prosecutor, served two stints as Maine's attorney general. The second came between 2013 and 2018 while Republican LePage was governor. The two clashed frequently as LePage, often seen as a Trump prototype, pushed the bounds of executive branch power. Mills would later defeat him in her bid to secure a second term as governor.   \n   \"See you in court\"    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mills reacts after challenging President Trump over federal law on the issue of transgender athletes in sports as Trump addressed a meeting of governors at the White House on Feb. 21, 2025.\n                \n                    Win McNamee/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Win McNamee/Getty Images\n    \n\n   \n   Her fights with LePage set the stage for her February confrontation with Trump during a National Governors Association event at the White House. During the event, Trump called on Mills to obey his executive order banning transgender athletes from participating on girls' sports teams. Mills told him she would follow Maine law, which currently allows the practice. When he threatened to pull Maine's federal funding, Mills told him, \"See you in court.\"   The looming primary contest in Maine is part of a larger pattern of insurgent Democrats in congressional contests running on a brand of economic populism long championed by Sen. Bernie Sanders.   Platner has been particularly critical of national Democrats, including their recruitment of Mills.   \"Running candidates that are picked by D.C., running campaigns that are driven by D.C., I think that's a losing strategy,\" he said during a recent interview. \"I think, what we're doing — which is really trying to build a campaign of Mainers, for Mainers — that's the way we win the state of Maine.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maine Gov. Janet Mills enters crowded Democratic race to unseat Susan Collins",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5051x2841+0+263/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F81%2F3c%2F69d8cddb4d3d974d9c1c1438a40b%2Fap25254600003282.jpg"
      ],
      "datePublished": "2025-10-14T11:05:48.000Z",
      "dateModified": "2025-10-14T11:05:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "\"It feels terrible.\" Federal worker's family tightens their belts as shutdown drags on",
    "url": "https://www.npr.org/2025/10/11/nx-s1-5565232/government-shutdown-federal-workers-furlough-finances-bills",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4032x2268+0+210/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd8%2F13d4b89d4f1ba465c358d17eafd3%2Fimg-3308.jpg",
    "tag": "Politics",
    "date": "2025-10-12T13:07:14.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Stephanie Rogers at her mother's home ou",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Stephanie Rogers at her mother's home outside Denver, where she and her two young daughters now live. Rogers has dipped into her retirement to help the family get through the federal shutdown.\n                \n                    Tegan Wendland/CPR News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tegan Wendland/CPR News\n    \n\n   \n   In a way, Stephanie Rogers started preparing for the current moment months ago, when she and her two daughters moved in with her mother about half an hour south of Denver. High prices for everything was certainly one reason.   \"When you added up the numbers between both of our family households, it was going to be something that we could not keep going long term,\" says Rogers, who's 44 and divorced with no child support.   Rogers has been a microbiologist with the Food and Drug Administration for 16 years and is now among hundreds of thousands of federal employees not working. She is also a chapter president with the National Treasury Employees Union (NTEU).   \n   Another big motivation for living together? The uncertainty of a new administration focused on shrinking the government, plus Rogers' memory of the last federal shutdown, back in 2018.   \"And we're living in that reality now,\" she says. \"And so that is our decision, to just make sure all of us survive this process.\"   Her mother, Nina Chapman, says she loves having her granddaughters around. \"I was grateful we had a basement.  It was just a wonderful area to put everybody,\" she says.   Planning ahead for life without a paycheck   When the previous shutdown dragged on for 35 days, from late 2018 into 2019, Rogers says she was \"utterly unprepared.\" So she made sure to plan better this time.   In the weeks before this shutdown, as the deadline for the funding lapse approached, she rushed to squeeze in medical appointments. She requested early refills of the kids' medications in case she couldn't afford them without a paycheck.   Rogers also made a painful decision that will carry its own financial cost. \"I had to pull out of my retirement, which has some tax consequences for next year,\" she says.   \n   Rogers has asked for flexibility with her car payment and is thinking twice about extracurriculars for her girls, who are 10 and 12. They might have to skip field trips that cost extra or volleyball games that are a long drive away. And the plan has been to buy only essential food.   \"In fact, we just had our freezer go out,\" she says. \"We lost our meat, and that's just devastating to us because we were counting on that.\"   Rogers has also applied for state unemployment. Furloughed federal workers are generally eligible for that, though they must refund the money when the shutdown ends, and after they get any retroactive pay withheld during that time.   \n   \"We don't know what our future looks like\"   But President Trump has floated the idea that some workers might be denied backpay, despite a law he signed mandating it in 2019. He's also threatened mass firings during the shutdown, a process the administration said had begun Friday. And Trump has talked about permanently cutting \"Democrat programs,\" without saying specifically what that means. Rogers says all of this makes the current shutdown feel very different.   \"It feels terrible,\" she says. \"I don't know if I even have a job when I walk away from this, much less if I will get paid. Do I have health insurance if we don't get back pay? It's a really hard place to be in when you have children who rely on you.\"   Rogers believes she and other federal employees do essential work — such as food inspections — that the general public may only appreciate when they're gone.    But across the federal government, it's been stressful all year. Mass layoffs and funding cuts have left fewer people working longer hours, she says, only to be sent the message now that they're not really wanted.   \"My mother worries about [it] constantly. My daughter has woken up and said, 'Does mommy have a job today?' We don't know what our future looks like,\" she says.   So even though she's in her dream job, Rogers says she's started applying for other positions outside the federal government.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "\"It feels terrible.\" Federal worker's family tightens their belts as shutdown drags on",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4032x2268+0+210/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F64%2Fd8%2F13d4b89d4f1ba465c358d17eafd3%2Fimg-3308.jpg"
      ],
      "datePublished": "2025-10-12T13:07:14.000Z",
      "dateModified": "2025-10-12T13:07:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Media companies thought late night TV was irrelevant. Kimmel proved them wrong",
    "url": "https://www.npr.org/2025/10/13/nx-s1-5558154/jimmy-kimmel-late-night-history-colbert-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa3%2Fde%2Fbe5aecd7400ba36bc3067015e208%2F3116179-0319.jpg",
    "tag": "Politics",
    "date": "2025-10-13T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jimmy Kimmel appeared as a guest on The ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Jimmy Kimmel appeared as a guest on The Late Show with Stephen Colbert on Tuesday, September 30, a week after Kimmel's return to ABC.\n                \n                    Scott Kowalchyk/CBS\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Scott Kowalchyk/CBS\n    \n\n   \n   When Jimmy Kimmel returned to his late-night show on ABC after a near-weeklong suspension, some cheered it as a triumph of free speech over the oppressive reach of government censorship. But I saw something a little different.   I saw bold proof that, despite all the talk about late-night TV losing its relevance, there sure seemed to be a lot of people who still cared about what hosts like Kimmel had to say.   That feeling deepened after watching Kimmel hang with his fellow late night hosts in New York during a long-planned week in Brooklyn.   From the moment when Kimmel visited Stephen Colbert's Late Show to tell him he thought \"I'm never coming back on air\" after ABC's parent company Disney sidelined him to Kimmel, Colbert and Seth Meyers trolling President Trump with a photo at Jimmy Kimmel Live!, there seemed to be an energized spirit in these hosts joining forces to remind fans why the genre is so special.   \n   Honchos at Disney learned this surprising truth the hard way after they moved to suspend Kimmel last month for sardonic comments he made about supporters of Trump's MAGA movement trying to capitalize politically on the assassination of conservative activist Charlie Kirk.   Given that the suspension decision came after the head of the Federal Communications Commission threatened Disney, ABC and its affiliates, it sure looked like Kimmel was about to join CBS host Stephen Colbert as another Trump critic on late-night TV who would soon lose his job.   And then something amazing happened. People pushed back.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        Randy Holmes/Disney\n    \n\n   \n   The American Civil Liberties Union published a petition of protest with signatures from more than 400 artists, including names like Tom Hanks, Meryl Streep, Hasan Minhaj and Amber Ruffin. People began canceling their subscriptions to Disney-owned streaming services like Hulu and Disney+, urged on by celebrities like John Oliver and Howard Stern. Republican senator Ted Cruz called FCC chair Brendan Carr's threats \"dangerous,\" and podcaster Joe Rogan, who endorsed Trump ahead of the 2024 election, warned against government pressure on comedians. Even former President Barack Obama weighed in, calling the situation \"government coercion\" that media companies should resist.   And when Kimmel returned last month, it was with an emotional, passionate episode that drew nearly 6.3 million viewers to the network – despite the fact that local TV station owners Nexstar and Sinclair Broadcast Group preempted it on the ABC stations they operate, which cover 23% of U.S. households. It was the show's highest rated regularly scheduled episode in over 10 years, drawing another 26 million views on YouTube and social media, according to ABC.   \n   During the episode, Kimmel thanked his audience for standing up to \"make your voices heard so mine could be heard\" — and they did, pushing Disney, Nexstar and Sinclair to resume airing Jimmy Kimmel Live! in an outcome that seemed wholly unlikely just days earlier.   I'll go a step further and suggest that this episode was also a much-needed lesson for late-night TV itself, which has struggled in recent years to prove it can still matter for most viewers.   Just maybe, in saving Kimmel, late night TV can learn to save itself.   An institution once at the heart of pop culture needs revitalization   Amid all the headlines about falling ratings, production cutbacks and monetary losses, it's easy to forget that late-night TV programs have historically occupied a singular space in pop culture that viewers couldn't easily find anywhere else.   But in modern times, that hasn't seemed true. Cheaply made podcasts and video hits on social media offer the kinds of commentary, comedy bits and celebrity interviews still at the core of today's network TV late-night shows. And these new media platforms have an advantage: they can meet viewers where they are — catching them as they migrate from broadcast outlets and cable channels to the world of online streaming.   In the past, late-night TV stayed relevant by constantly evolving to offer experiences that were both familiar and unique. So, perhaps looking back at that history might offer clues for how today's programs can build a new future for the genre.   Because it needs one. Badly.   The first version: Late-night TV as a place where the cool kids hang out   The best place to start is with the longest-running program still airing: NBC's The Tonight Show, which began in 1954 with host Steve Allen — a pianist, composer, actor, comic and longtime TV personality seen as a savvy industry pioneer.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Steve Allen in June 1956.\n                \n                    Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Associated Press\n    \n\n   \n   Like a lot of shows at the dawn of network TV, Tonight Starring Steve Allen wasn't really sure what it initially wanted to be or quite how to use this new medium. And if you watch recordings of the first episode — still available on YouTube — you'll see how Allen's sardonically witty vibe feels an awful lot like the cheeky irreverence David Letterman would bring to late night decades later.   Still, despite the experimental vibe of the program, it featured a lot of elements we still see in the genre more than 70 years later: an opening monologue, celebrity interviews, a live band and a show presented before a studio audience with some comedy bits filmed outside.   \n   Based in Manhattan, Tonight was a transition from popular variety programs like The Ed Sullivan Show to something hipper — a way for viewers around the country to soak up a bit of show-business glamour at the end of the day. Big names from Broadway or the sports world could drop by to kibitz with Allen, making viewers feel like they were at the coolest after-hours party in the country.   The next version: Late-night TV as the center of showbiz establishment   After Allen left the show, Tonight's formula was refined through the late 1950s and early 1960s by hosts Jack Paar and his successor, Johnny Carson, the man often dubbed the \"King of Late Night.\" Raised in Iowa and Nebraska, Carson built his career as a host of variety and game shows with an approachable ease, developing a reserved charisma that helped fuel the rise of his show as a gigantically influential program with a massive audience.   The name of the game for network TV back then was material that offered the biggest tent possible — nothing too controversial or complicated to turn off the masses. So the nation's viewers grew used to Carson tucking them in bed, backed by a sprawling big band, with a monologue that gently poked fun at the day's news events and chummy interactions with celebrities.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Steve Martin appeared on The Tonight Show Starring Johnny Carson in July 1980, wearing fake jewelry to poke fun at his own success.\n                \n                    Lennox McLendon/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Lennox McLendon/Associated Press\n    \n\n   \n   For standup comics, an endorsement from Carson — getting waved over to sit next to him for a conversation after they delivered their best five minutes of jokes — was an honor that could make a comedian's career.   The list of performers who benefited from that nod included everyone from Bill Cosby to Drew Carey, Tim Allen, Roseanne Barr, Freddie Prinze and David Letterman. Viewers also knew: the standup comic who was making Carson laugh one night could be starring in TV's biggest sitcom soon after.   \n   Another version: Late night as a home for comedic innovation aimed at young viewers   By 1982, Carson had negotiated to take ownership of the time slot after his program, teaming with NBC to create a late-night show at 12:30 a.m. featuring Letterman. Dubbed Late Night With David Letterman, the show had a slimmed-down, modernized band and made fun of the TV institutions Carson's generation built.   Letterman wasn't a smoothly chummy figure like Carson was on screen. He picked real fights on air with some celebrities — Cher famously called Letterman an \"a**hole\" during an interview segment — and brought on younger upstart comics, like subversive comedy pioneer Bill Hicks and some leather-jacket wearing guy from Boston named Jay Leno. (Letterman later came in for some criticism after he moved his show to CBS and refused to air a set by Hicks, who joked about religion and abortion protesters.)   Letterman's antics appealed to college students and young media nerds — I still remember watching him lowered into a vat of water wearing a suit festooned with Alka-Seltzer tablets one minute and throwing watermelons off the roof of a New York skyscraper the next. Much of what he did was a nod to the pioneering early days of late night TV with a twist; for example, one \"celebrity\" he featured in fake ads, Larry \"Bud\" Melman, was a character played by file clerk-turned-actor Calvert DeForest.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Comedian Richard Pryor as a guest on Late Night With David Letterman in January 1987. Pryor was starring in the film Critical Condition.\n                \n                    Susan Ragan/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Susan Ragan/Associated Press\n    \n\n   \n   He struck a chord with viewers younger than the Carson generation who yearned for a voice on TV that felt more modern — reflecting their growing cynicism about show business while stretching the boundaries of the medium. That youthful connection continued through other hosts who took over NBC's Late Night franchise, from the serious silliness of Conan O'Brien to the hard-partying glad-handing of Jimmy Fallon.   When Carson retired in 1992, NBC snubbed Letterman to hand The Tonight Show to Leno. Letterman decamped for CBS, where he began hosting The Late Show, a glitzier, less subversive program, from the sprawling confines of the Ed Sullivan Theater in Manhattan. Like Carson, Letterman negotiated control of the time slot after his program to create The Late Late Show, where hosts ranging from Craig Ferguson to James Corden twisted the format to serve their tastes in ways Letterman had become too big to attempt.   \n   An alternative version: Late-night TV upstart succeeds by catering to audiences left out by the big players   Other hosts tried to challenge Carson's hold on the genre, but one of the few to find real success was comic Arsenio Hall, who offered a late-night show syndicated individually to TV stations across the country centered on Black culture and performers too small time for Carson's stage. Debuting in 1989, The Arsenio Hall Show had a funk and jazz fusion outfit as its house band. Its most buzzed-about guests were artists on the cutting edge of Black culture, like Prince, Bobby Brown and MC Hammer (before the mega-hit \"U Can't Touch This\" made him a household name).   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Magic Johnson, left, made his first public appearance on The Arsenio Hall Show after announcing he tested positive for HIV in Nov. 1991.\n                \n                    Nick Ut/Associated Press\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Nick Ut/Associated Press\n    \n\n   \n   There's a reason why a modern late-night program like Fallon's Tonight Show now has hip-hop pioneers The Roots as its house band. If networks include as many people as possible on their big TV shows, then they don't have to worry about a new version of Arsenio building an empire on performers excluded from the mainstream.   Today's version: The rise of the political crusaders   When Jon Stewart took over The Daily Show in 1999 and centered its humor on real headlines and actual news clips, he pushed an evolution nearly as seismic as Saturday Night Live's decision to use guest hosts every week or Carson's move to give Letterman his own show.   In addition to delivering a string of successful alumni to the comedy world – including Stephen Colbert, Steve Carell, Samantha Bee, John Oliver and Roy Wood Jr. – The Daily Show helped viewers process events by digging into the hypocrisies and absurdities of politics and media. In particular, Stewart highlighted what he saw as the shortcomings of traditional journalism, the toxicity of media outlets like CNN and the pandering of conservative platforms like the Fox News Channel — teaching audiences to decode this new type of messaging.   \n   In contrast, Fox News Channel's Gutfeld!, which airs at the earlier hour of 10 p.m. on a cable channel and has access to a larger potential audience, seems to benefit from being the most prominent effort to create a conservative-oriented version of late-night broadcast shows on traditional TV.   Politics have only gotten more partisan. So Stewart's approach has spread across late-night TV, led by Colbert's version of The Late Show on CBS, John Oliver's Last Week Tonight, Bill Maher's Real Time on HBO and Kimmel himself. In particular, hosts like Colbert, Kimmel and Seth Meyers have become passionate critics of Trump's policies, including his aggressive use of tariffs, his Kennedy Center takeover and his ties to Jeffrey Epstein — but that approach could also sometimes feel predictable and ineffective.   Until the attempt to muzzle Kimmel failed, giving satirists a new cause and fresh passion to pursue it.   Kimmel, in particular, has seemed like a good-natured everyguy who got pulled into becoming a political figure, speaking out against what he likely sees as Trump's growing extremism as president. Now that he and his fellow hosts are in the crosshairs, it's time to use this moment as fuel for fresh satire. Kimmel's bit, on the night of his return show, featuring Robert De Niro as a mafioso-style FCC commissioner was an excellent example — constantly reminding viewers how they can say things with a star power one guy with a podcast microphone can't equal.   Before Kimmel's moment, I thought figures like Conan O'Brien might offer an answer to the future of the late-night genre — which has always been more about a comedic attitude than the actual times the shows air. Since the end of his show on TBS, O'Brien has soared — freeing himself from the meddling of big media companies by building his own empire across several platforms, ranging from radio and podcasts for Sirius XM to travel specials on HBO Max and his own content leveraged across social media and YouTube.   \n   But now, seeing how energized Kimmel, The Daily Show and Colbert have become in recent weeks as big media companies and the Trump administration have threatened their existence, I'm wondering if there isn't another answer.   The allegiance last week among Kimmel, Colbert, Meyers and other late-night hosts — including Daily Show host Stewart, who crashed one of Kimmel's monologues — proved that these hosts and their insistence on speaking truth to power will likely only survive if they stick together.   United, they can create viral events that push through the media noise to draw attention – as when Kimmel ensured that his first post-suspension interview occurred on another late-night show that has been threatened by the president. And when these events go viral, they meet the audiences where they are, as late-night shows need to do more regularly.   And these hosts need one more thing: Their bosses, whose companies own America's most powerful media outlets, must support their employees when they speak out.   As a fan of the genre who has attended everything from an Arsenio Hall taping in 1990 to more recent shows by Colbert, Letterman, Meyers, Fallon, O'Brien and Stewart, I believe that late-night TV is an important cornerstone in America's comedy universe and that we'll all lose a lot if these shows largely go away.   Wouldn't it be fitting if the very attempts by Trump officials and power-hungry media executives to snuff out these hosts help endear their shows to an entirely new audience, eager to hear voices pushing back?\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Media companies thought late night TV was irrelevant. Kimmel proved them wrong",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa3%2Fde%2Fbe5aecd7400ba36bc3067015e208%2F3116179-0319.jpg"
      ],
      "datePublished": "2025-10-13T10:00:00.000Z",
      "dateModified": "2025-10-13T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]