[
  {
    "title": "Tim Walz says Trump administration wants to 'twist reality' in Minnesota",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5691909/tim-walz-immigration-trump-protests",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+0/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff2%2Fb5%2F7978a3c349249a3a5edf3f2e11ad%2Fatc-timwalz-thumbnail-jw.png",
    "tag": "Politics",
    "date": "2026-01-30T21:03:01.000Z",
    "description": "\n      \n      Why Gov. Tim Walz doesn't expect Trump admin to keep its word on ICE de-escalation\n    \n            \n                \n                Tr",
    "body": "\n      \n      Why Gov. Tim Walz doesn't expect Trump admin to keep its word on ICE de-escalation\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5691909/nx-s1-9629767\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n         Minnesota Gov. Tim Walz is skeptical about many things the Trump administration is saying about de-escalating its immigration crackdown in his state.   \"I know who I'm dealing with. I know that they're not going to keep their word,\" Walz tells NPR.   Walz, a Democrat, sat down with All Things Considered host Juana Summers on Friday following weeks of protests and the deadly shootings of Renee Macklin Good and Alex Pretti.   Walz says he still wants to \"find a way forward\"– with a caveat.   \"I'm not going to compromise on the First Amendment. I'm not going to allow [Trump administration border czar] Tom Homan to characterize what are constitutionally protected rights of peaceful expression of grievance against the government. It's foundational to our democracy.\"   \n   Listen to the full interview by clicking on the blue play button above. Or watch the full interview by clicking on the video above.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tim Walz says Trump administration wants to 'twist reality' in Minnesota",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+0/resize/1400/quality/85/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff2%2Fb5%2F7978a3c349249a3a5edf3f2e11ad%2Fatc-timwalz-thumbnail-jw.png"
      ],
      "datePublished": "2026-01-30T21:03:01.000Z",
      "dateModified": "2026-01-30T21:03:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Pretti shooting by federal agents in Minneapolis prompts DOJ civil rights probe",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5694313/alex-pretti-shooting-doj-civil-rights-investigation",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fca%2F6f339f21416ab04a15e17b064966%2Fgettyimages-2258779267-594x594.jpg",
    "tag": "Politics",
    "date": "2026-01-30T19:54:04.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People attend a candlelight vigil this w",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                People attend a candlelight vigil this week that was organized by health care workers and that took place at the site where Alex Pretti was killed in Minneapolis.\n                \n                    Scott Olson/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Scott Olson/Getty Images\n    \n\n   \n   One of two shooting deaths of U.S. citizens in Minneapolis by federal agents is the subject of a U.S. Department of Justice civil rights investigation.    \n   The Civil Rights Division is investigating the Saturday killing of Alex Pretti but not the shooting death earlier this month of Renee Macklin Good by federal agents in Minneapolis, Deputy Attorney General Todd Blanche said in Washington on Friday.   Pretti was shot multiple times Jan. 24 as Border Patrol officers tried to arrest him while he was recording immigration officers on his phone.   Blanche says the probe is separate from the Department of Homeland Security's shooting investigation of the incident.   \"It means talking to witnesses. It means looking at documentary evidence, sending subpoenas if you have to,\" Blanche told reporters at a news briefing Friday on multiple topics. \"And the Department of Justice, Civil Rights Division, has the best experts in the world at this.\"   \n   Blanche gave no investigation timetable, nor did he commit to the release of body camera footage of the agents. He said the department's investigation would encompass events of that day as well as the days and weeks that preceded the Pretti shooting.   In a statement, Steve Schleicher, the Pretti family attorney, said: \"The family's focus is on a fair and impartial investigation that examines the facts around his murder.\"    Under questioning, Blanche said the fatal shooting of Good isn't receiving similar Justice Department scrutiny.   \"There are thousands, unfortunately, of law enforcement events every year where somebody is shot,\" he said. \"The Civil Rights Division of the Department of Justice does not investigate every one of those shootings. There has to be circumstances or facts, or maybe unknown facts, but certainly circumstances that warrant an investigation.\"   Federal officials have excluded Minnesota investigators from assisting with reviews of both shootings, leading to a state lawsuit that seeks to require that evidence of the Pretti shooting be maintained. State authorities haven't ruled out bringing charges against federal officers after completing their own investigations.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Pretti shooting by federal agents in Minneapolis prompts DOJ civil rights probe",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/594x334+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3d%2Fca%2F6f339f21416ab04a15e17b064966%2Fgettyimages-2258779267-594x594.jpg"
      ],
      "datePublished": "2026-01-30T19:54:04.000Z",
      "dateModified": "2026-01-30T19:54:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ releases tranche of Epstein files, says it has met its legal obligations",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5693904/epstein-files-doj-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6048x3402+0+315/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F38%2F91%2Fca3ca5a64c528dede3d0a4fa01f1%2Fgettyimages-2258472236.jpg",
    "tag": "Politics",
    "date": "2026-01-30T17:05:26.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Deputy Attorney General Todd Blanche spe",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Deputy Attorney General Todd Blanche speaks during a press conference at the Department of Justice on Jan. 30, in Washington, D.C.\n                \n                    Alex Wroblewski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Wroblewski/AFP via Getty Images\n    \n\n   \n   The Department of Justice released more than 3 million pages, including more than 2,000 videos and 180,000 images, in its files tied to the death and criminal investigation of convicted sex offender Jeffrey Epstein.   NPR reporters are reviewing the files, which so far have included unredacted names and photographs of Epstein victims, communications with powerful figures like Elon Musk and former White House counsel in the Obama administration Kathryn Ruemmler and even more mentions of President Trump.   Being mentioned in the files, which include unvetted submissions made to the FBI, Epstein's private correspondence and court records, is not a sign of wrongdoing or association with Epstein's crimes.   \n   Deputy Attorney General Todd Blanche says Friday's release means the DOJ is now in compliance with the Epstein Files Transparency Act, which Congress passed last November and which legally required the DOJ to release all the files.   Members of Congress who passed the law had earlier complained that the DOJ had failed to meet its deadline of mid-December to release all the files and have questioned the extensive redactions made to photos and documents released so far.   NPR's initial review of the new files found Trump's face blacked out on a news article sent by onetime advisor Steve Bannon and a spreadsheet that contained unverified allegations of inappropriate conduct by Trump and others that was briefly offline.   A Justice Department spokeswoman said the document was down \"due to overload and is back online.\"   The Justice Department press release also said that the tranche of files may include \"fake or falsely submitted images, documents or videos, as everything that was sent to the FBI by the public was included in the production that is responsive to the Act.\"   \"Some of the documents contain untrue and sensationalist claims against President Trump that were submitted to the FBI right before the 2020 election,\" the release continues. \"To be clear, the claims are unfounded and false, and if they have a shred of credibility, they certainly would have been weaponized against President Trump already.\"      \n   Never miss a big story. Sign up for the NPR Politics newsletter, sent weekly      Blanche at a press conference on Friday morning said more than 500 lawyers and others worked through weekends and holidays to comply with the law, while making sure to protect victims' information. He said they had to review more than 6 million pages — \"two Eiffel Towers of pages\" — to decide what to release. They're continuing to withhold documents that depict violence or involve attorney-client privilege, he said. The department also said it discarded any duplicates or unrelated materials.   \"I take umbrage at the suggestion, which is totally false, that the attorney general or this department does not take child exploitation or sex trafficking seriously, or that we somehow do not want to protect victims,\" Blanche said.   He also said the DOJ wasn't seeking to protect President Trump while releasing the files, though some of the files contained sensational and false claims about the president and others.   \"Through the process, the Department provided clear instructions to reviewers that the redactions were to be limited to the protection of victims and their families,\" the DOJ said in a statement. \"Some pornographic images, whether commercial or not, were redacted, given the Department treated all women in those images as victims. Notable individuals and politicians were not redacted in the release of any files.\"   Epstein files political saga   The release of the Epstein files is the latest development in a political saga that has dogged Trump's second term in office and caused bipartisan backlash against Trump's conflicting and shifting commentary on the subject.   Trump amplified conspiracy theories about the files relating to his onetime friend Epstein on the campaign trail, vowing to publicize information about the financier's crimes and ties to powerful people that he alleged was being covered up by the government. But once he returned to the White House, Trump fought efforts by lawmakers and his supporters to release those files.   \n   \"There's this mantra out there that, oh, you know, the Department of Justice is supposed to protect Donald J. Trump,\" Blanche said on Friday. \"That's not true. That was never the case. We are always concerned about the victims.\" He said Trump has directed the DOJ to \"be as transparent as we can.\"   Separately, Blanche said the Department of Justice has opened a civil rights investigation into the death of Alex Pretti, a U.S. citizen who was shot by two immigration enforcement officers last weekend in Minneapolis. The investigation is being led by the FBI, but it is also coordinating with the DOJ's civil rights division, which is led by Harmeet Dhillon.   He also said the investigation was being done in coordination with the Department of Homeland Security.   \"I don't want the takeaway to be that there's some massive civil rights investigation that's happening; I would describe this as a standard investigation by the FBI, when there's circumstances like what we saw last Saturday,\" Blanche said.   This is a developing story and may be updated.   NPR's Ryan Lucas, Elena Moore, Saige Miller, Jaclyn Diaz, Carrie Johnson, Alana Wise and Danielle Kurtzleben contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ releases tranche of Epstein files, says it has met its legal obligations",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6048x3402+0+315/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F38%2F91%2Fca3ca5a64c528dede3d0a4fa01f1%2Fgettyimages-2258472236.jpg"
      ],
      "datePublished": "2026-01-30T17:05:26.000Z",
      "dateModified": "2026-01-30T17:05:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After a record-long shutdown last fall, why Democrats were willing to risk another",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5691547/after-a-record-long-shutdown-last-fall-why-democrats-were-willing-to-risk-another",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-30T21:27:59.000Z",
    "description": "\n      The government is set to shutdown at the end of the day Friday. Shutdowns have evolved in recent years from rare collapses of government functi",
    "body": "\n      The government is set to shutdown at the end of the day Friday. Shutdowns have evolved in recent years from rare collapses of government function to increasingly frequent political tools.   \n\n    AILSA CHANG, HOST:  All right, another shutdown is on the horizon. Major swaths of the federal government will run out of money at midnight tonight. Agencies from the Pentagon to the Departments of Transportation, Health and Human Services and Homeland Security - they will all run out of money. Senators approved a spending package to get things reopened, and we're assuming that the legislation will get approved in the House.But why are we even talking about a shutdown at all? - because remember, people, funding the government is a basic constitutional responsibility for Congress. But shutdowns have become an increasingly common political tool. NPR congressional reporter Sam Gringlas and senior political editor and correspondent Domenico Montanaro have been digging into the politics of shutdowns, and they join us now. Hello to both of you.DOMENICO MONTANARO, BYLINE: Hey there.SAM GRINGLAS, BYLINE: Hey, Ailsa.CHANG: All right, Sam, let's start with you. I want to start with a very basic question. What is behind this upcoming shutdown?GRINGLAS: Well, it's the immigration enforcement tactics of the Trump administration. You know, this final group of spending bills were on track to pass on time and with bipartisan support. But the second deadly shooting by a federal immigration officer in Minneapolis upended all of that, and Democrats pledged to withhold their votes for the funding to try to extract some guardrails that would rein in some of these aggressive tactics.CHANG: OK, and Domenico, explain. Why force a government shutdown in order to get to a policy goal?MONTANARO: Well, like we've said many times before, life in the minority stinks. You have very few tools to use as leverage to try and extract any compromises, and this is one of the only ones they have. You know, I think Democrats learned with the shutdown toward the end of last year that they could win the blame game. That one was about elevating health care, introducing the idea that Republicans weren't going to extend health care subsidies. It's something people weren't really talking about much before that. Now there's an issue that's right in front of everyone's eyes and dominating the news with majorities in polls saying they disagree with the Trump administration's deportation tactics, which is actually easier political ground to stand on for Democrats.CHANG: Exactly. And, Sam, I want to go a little deeper into that because we have had shutdowns in the past, but these two are coming so close together. Is there something about this specific moment that's different from previous shutdowns?GRINGLAS: Take the 35-day shutdown over border wall funding in 2018 to 2019.CHANG: Oh, I remember.GRINGLAS: I remember watching House Minority Leader Nancy Pelosi and Senate Minority Leader Chuck Schumer, you know, negotiating with President Trump in the Oval Office in front of the TV cameras. I asked Drew Hammill, a top Pelosi aide at the time, how that moment was different from now.DREW HAMMILL: From a debate about a distant wall to your own neighborhood, to your own backyard - yeah, that's a different scenario.GRINGLAS: Now we're talking about the presence of a federal force sparking violence in an American city or, in the fall, people's health insurance premiums doubling or even tripling. That's really personal. This is also a moment where Congress has ceded so much of its authority to the executive, and as Domenico said, Democrats have really limited options to do anything about that. And as Drew Hammill told me, voters want and expect a fight.CHANG: Yeah, maybe, but Domenico, is that the fight that they want - a fight over a government shutdown?MONTANARO: Well, maybe, maybe not, but Democrats have shown their ability here, again, with the last shutdown and now in this moment, to be able to capitalize on Trump's vulnerabilities. And whether the left is happy with Democratic leaders efforts or not, I think what we're seeing here is that the center has moved left on how to conduct immigration enforcement. You're seeing moderate Republicans loudly oppose ICE's actions and against these jumps to conclusions we've seen by people like Kristi Noem, the Department of Homeland Security secretary, and Stephen Miller, a Trump deputy chief of staff.CHANG: All right, well, Sam, are Democrats in Congress looking at this funding fight over ICE any differently than the one we last talked about over health care subsidies?GRINGLAS: Well, we know Democrats are more unified than last time. Last fall, six Democrats broke with their party to end the stalemate despite only getting the promise of a vote on extending the subsidies. They were worried about the risks of a shutdown - federal workers missing paychecks, food stamps running out. Now five of those six were willing to risk another shutdown, and I got to catch up with one of them, Jacky Rosen of Nevada. And I asked her, what changed?JACKY ROSEN: ICE is out of control. Donald Trump is out of control. His tyrannical government, his cruel cabinet - who the hell do they think they are? We have a Bill of Rights.GRINGLAS: Democrats feel emboldened because what's happening in Minnesota strikes at something more fundamental about the direction of the country in a way that maybe the health subsidies debate just didn't.CHANG: OK, well, that's how Democrats might be feeling. What about Republicans?GRINGLAS: Yeah, we're in an era when congressional Republicans rarely criticize the Trump administration, but the images coming out of Minneapolis have made even more Republicans uneasy. Republican Senator Thom Tillis of North Carolina told reporters this week why he thinks members of his caucus are spooked.(SOUNDBITE OF ARCHIVED RECORDING)THOM TILLIS: It's terrible. It's making the president look bad on policies that he won on. He won on a strong message about immigration. And now nobody's talking about that. They're talking about the incompetence of the leader of the Homeland Security. These people are amateurs. They got to de-escalate there and treat these communities with some respect.MONTANARO: Yeah, and this has become a major concern within Republican ranks, as you can hear there. You know, this is an issue that Republicans had owned, and now it's a liability talking about immigration. Take a Fox News poll that was out this week - 6 in 10 voters it surveyed said ICE has been, quote, \"too aggressive.\" That's jumped since last summer.And it's not just because of progressives with strong opposition. Whites without college degrees jumped 14 points. Independents are up 22. Even Trump voters and Republican women were up, too, and that's in a survey where more than half approved of Trump on border security. But clearly ICE's tactics have been weighing Trump and the GOP down and made the narrative less about immigrants not coming to the country illegally and more about the harsh tactics used in trying to deport them. These are major red flags for Republicans in an election year and why we're seeing a shift.GRINGLAS: Though, I should say, openness to sweeping policy changes is far from universal among Republican lawmakers who have blasted Democrats for holding up funding. This is Senator Markwayne Mullin, Republican of Oklahoma.MARKWAYNE MULLIN: We're not going to keep ICE from doing their job. The American people wanted the president to enforce law and order, and ICE is doing their job.CHANG: But, Sam, I mean, is what we're seeing right now just illustrating the power of the shutdown, the polarization of politics, or do you think we're seeing something else entirely?GRINGLAS: I mean, I think it's a little bit all of the above, but I put this question to Republican Capitol Hill veteran Antonia Ferrier. Her old boss was the former Senate Majority Leader Mitch McConnell. He used to describe shutdown standoffs as box canyons, these narrow gorges with no exit on the other end, where you're making demands, and there's no way out.ANTONIA FERRIER: What I think we're seeing right now is markedly different. You can see it viscerally across America but also in the halls of Capitol Hill. There is just so much public attention and outrage that Democrats are demanding - and many Republicans agree - there has to be some kind of changes made.GRINGLAS: Still, Ailsa, we have seen so many instances of Republicans expressing discomfort over something - like, say, Trump's actions in Venezuela - only to back off after some tepid reassurances. And even if Republicans are amenable to some changes here, like with the health subsidies, those talks can still crumble. So in the end, will the power - or, I guess, legacy - of these shutdowns be tangible policy changes or really just directing the public's attention ahead of the midterms?MONTANARO: And all this in addition to the fact that prices are what voters have been saying have been driving their decisions.CHANG: Yeah.MONTANARO: ...And now Democrats putting Republicans on their heels on health care and immigration.CHANG: That is NPR's Domenico Montanaro and Sam Gringlas. Thanks to both of you.MONTANARO: You're welcome.GRINGLAS: Thanks.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After a record-long shutdown last fall, why Democrats were willing to risk another",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-30T21:27:59.000Z",
      "dateModified": "2026-01-30T21:27:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Feds arrest Don Lemon, Minnesota journalist and 2 others over church protest",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5693756/don-lemon-arrest-cnn-minneapolis",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5616x3159+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F88%2Fc7%2F46d4988b45c2ad9db3e9674a4274%2Fgettyimages-2232793537.jpg",
    "tag": "Politics",
    "date": "2026-01-30T15:36:06.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Journalist Don Lemon interviews Rep. Al ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Journalist Don Lemon interviews Rep. Al Green, D-Texas, at a rally at Columbus Circle near Union Station in Washington, D.C., on Sept. 2, 2025.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   Former CNN anchor Don Lemon and an independent Minnesota journalist, Georgia Fort, were among four people arrested by federal agents in connection to an anti-ICE protest at a church in Minnesota.   Journalists, press advocates and Democratic lawmakers accused the Trump administration of attempting to intimidate journalists conducting independent accountability reporting.     A federal grand jury in Minnesota has indicted the four on charges related to the interruption of a religious service at the church, where a U.S. Immigration and Customs Enforcement official serves as a pastor.    Lemon had followed the protesters in as they demonstrated. In his livestreamed video, he says he is there as a journalist. He interviewed the pastor and others present, as well as protesters.    \n   Some of President Trump's supporters argued he had participated in the disruption.    In a statement posted on social media, Lemon's attorney, Abbe Lowell, called the arrest an \"unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration.\"   Amnesty International demanded the release of Lemon and Fort, calling their arrests \"a critical threat to our human rights.\"   \n   \"Reporting on protests isn't a crime — its protected by the First Amendment,\" said Jameel Jaffer, executive director of the Knight First Amendment Institute at Columbia University. \"The Justice Department should drop these prosecutions or they should be thrown out.\"    Media executives and press rights advocates have been on heightened alert over a series of actions taken by the Trump administration: formal investigations of most of the United States' leading broadcasters, including ABC, CBS, NBC, NPR and PBS; threats by Trump to hold up big corporate transactions involving media companies; Trump's personal lawsuits against major news outlets, including The New York Times and The Wall Street Journal; and, most recently, the FBI's seizure of computers and devices from Washington Post reporter Hannah Natanson without warning, said to be part of an investigation of the leak of national security documents. Typically prosecutors contact news organizations to give them a chance to identify relevant materials and to challenge the need to hand them over in court.   \n   Justice Department celebrates Lemon's arrest   On Friday morning, Justice Department officials celebrated the arrest of Lemon in California after failing twice to secure arrest warrants for him in Minnesota.    \n   U.S. Attorney General Pam Bondi took personal credit, posting on X that the arrests occurred at her direction \"in connection with the coordinated attack on Cities Church in St. Paul, Minnesota.\" The two other people arrested early Friday are local activists.    \"You have the right to worship freely and safely,\" she said in a video. \"And if I haven't been clear already, if you violate that sacred right, we are coming after you.\"   Bondi's spokesperson Gates McGavick posted a meme of the attorney general with laser beams emanating from her eyes.    U.S. Assistant Attorney General Harmeet Dhillon posted on X that the church was \"a space protected from exactly such acts by federal criminal and civil laws! Nor does the First Amendment protect your pseudo journalism of disrupting a prayer service. You are on notice.\" Dhillon, who oversees the civil rights division of the Justice Department, also reposted a tweet referring to Lemon as one of \"today's klansmen.\"   Three others were previously charged in connection with the church protest, accused of violating a law that prevents people from obstructing places of worship or abortion clinics.   A federal magistrate judge previously declined to approve Lemon's arrest, citing a lack of evidence. And the chief federal appeals court judge in Minnesota rejected a prosecutor's appeal of the decision, writing that there was \"no evidence\" of any criminal behavior in Lemon's work.     The Washington Post reviewed the videos of Lemon at the protest.    \"The footage shows that he was with activists before the protest and followed them to the church, where he spent approximately 45 minutes and spoke with four parishioners and five protesters,\" the Post wrote. \"In all but one instance, the exchanges appear to be calm. The footage does not show him participating in the chants that disrupted the service. A pastor at one point asks him to leave. Seven minutes later, he exits the church building.\"   \n   \"Pure authoritarian bile\"   Senate Minority Leader Chuck Schumer, D-N.Y., denounced the arrest on the Senate floor, saying it \"is a dark message to journalists everywhere: If you dare criticize this administration, watch your back.\"   \"That is not democracy,\" Schumer said. \"That is a police state, and that is pure authoritarian bile.\"   Friday morning, Fort posted a video on social media saying federal agents were at the door of her home in Minnesota. Fort said in the post that she was reporting when she filmed the church protest. She is a known quantity in Minnesota press circles. According to the National Association of Black Journalists chapter in Minnesota, Fort has won regional awards and served as an officer of the group.     Lemon, who now appears on YouTube, Substack and other social media platforms, left CNN in 2023 after 17 years at the cable network, amid criticism that he made sexist comments about women and aging.    CNN was among those outlets and institutions that weighed in against Lemon's arrest, saying it \"raises profoundly concerning questions about press freedom and the First Amendment.\"   \n   In the statement, shared with NPR by a spokesperson, the network said the Constitution protects \"journalists who bear witness to news and events as they unfold, ensuring they can report freely in the public interest, and the DOJ's attempts to violate those rights is unacceptable.\"   CNN's parent company, Warner Bros. Discovery, is in the process of trying to sell itself to Netflix, though CNN and other cable channels would be spun off. Antitrust regulators at the Justice Department will get to review the deal if it is approved by shareholders.  Trump has said he wants a say in who owns CNN next.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Feds arrest Don Lemon, Minnesota journalist and 2 others over church protest",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5616x3159+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F88%2Fc7%2F46d4988b45c2ad9db3e9674a4274%2Fgettyimages-2232793537.jpg"
      ],
      "datePublished": "2026-01-30T15:36:06.000Z",
      "dateModified": "2026-01-30T15:36:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week in politics: Final Epstein files, partial government shutdown, 'safer' ICE operations, new Fed chair",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5693068/week-in-politics-final-epstein-files-partial-government-shutdown-safer-ice-operations-new-fed-chair",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-31T13:05:27.000Z",
    "description": "\n      \n      Week in politics: Final Epstein files, funding compromise in Congress, 'safer' ICE operations, new Fed chair\n    \n            \n         ",
    "body": "\n      \n      Week in politics: Final Epstein files, funding compromise in Congress, 'safer' ICE operations, new Fed chair\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5693068/nx-s1-9629956\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Another batch of Epstein files and the continuing controversies involving the Department of Homeland Security are dominating the political conversation this weekend.   \n\n    SCOTT SIMON, HOST:  And NPR senior contributor Ron Elving joins us now. Ron, thanks for being with us.RON ELVING, BYLINE: Good to be with you, Scott.SIMON: So millions more pages from the Epstein files released - on a Friday, and 43 days after a law passed by Congress said that all the files should be made public. Where do we go from here?ELVING: Probably to a doctor for eye strain, Scott.SIMON: (Laughter) Sure.ELVING: All that much reading on top of everything else crowding our screens this weekend may be just too much. And mind you, we still don't know that this is all there is. The Friday night news-dump tactic is one we've seen back over the years from presidents and candidates in both parties. It works especially well in a week that's already loaded with big stories, like this one. Plus, Friday night's a time when most people want to start thinking about their weekends. And the sheer volume here has to be the ultimate in flood-the-zone strategy. We've talked about that before with regard to Epstein's stories and others. So the reading and digging have begun, and there will be much more to learn and argue over.SIMON: Now, let's turn to the funding compromise on Capitol Hill - just part of the government's operations. What are the details?ELVING: Fortunately, from the standpoint of people who depend on government services, this package of five funding bills left over from last fall will keep the government running until October, assuming that this latest deal gets through the House next week and the president signs it into law. Now, there's one big exception. That's the Department of Homeland Security, the home of ICE, which is only in for two weeks of funding. And that gives Senate Democrats time to negotiate reforms in ICE with President Trump.Now, the focus here is on the leadership. The Immigration and Customs Enforcement agency, ICE, is at the center of all this controversy this month in Minneapolis. All the Democratic senators and quite a few of their Republican colleagues got together last couple of weeks. And they stymied the DHS spending bill overall this week and broke it off - broke, that is, that one department off - for more negotiations on reforms to ICE. They are not prepared to go back to their constituents and say they voted to pay for more of the tactics that everyone's seeing on TV.SIMON: Justice Department says the Civil Rights Division is now investigating the shooting of Alex Pretti last week in Minneapolis. Course, there's been a visible change on the ground with the arrival of Tom Homan, who says ICE operations - this is a quote - will be \"safer, more efficient\" and \"by the book.\" But does that indicate any real change in the aggressive tactics of federal agents there?ELVING: We'll just have to see in the coming days. There hasn't been enough time yet to assess this change of leadership, and there is lots of room for ICE to demonstrate some kind of improvement. But if you're talking about the basic mission of these raids, that seems unlikely to change. Tom Homan is a different guy at the top, not the face we've been seeing for the last couple weeks, but the overall mission here is coming from the White House and from the president's chief of staff for domestic policy, Stephen Miller. He has made no secret of his desire for mass deportations or his willingness to use force and to risk sweeping up people who are legally present in the United States, including some who are U.S. citizens. Now, can that be changed from the top? Yes. Do the top decision-makers on this issue in this administration want it to change? Doubtful, but we will see.SIMON: And a new Fed chair is in the offing - Kevin Warsh, former governor of the Fed. What stands out to you about his selection?ELVING: Mostly that he is not Jerome Powell, the chairman Trump appointed in 2017 and President Biden reappointed. Powell is now finishing his term atop the Federal Reserve apparatus. That's what governs the money supply in the U.S. and thereby affects markets and whole economies around the world. Powell making it through his term was in and of itself a story because Trump has been pressuring him to resign for months, calling him names, sending investigators to look into the Federal Reserve's business.The entire idea behind having a Federal Reserve and a board of governors for it and a highly professional staff is to have an independent regulator for the money supply. Too much easy money juices higher inflation. We've all seen the results of that on household budgets and also on the political fortunes of incumbent presidents. Kevin Warsh has been on the board of governors before, knows the system well, knows the financial system well. And on first blush, he seems a conventional choice - someone, some claim, to distance from Trump - but that doesn't make his job any easier. But it may at least make it possible for him to do it.SIMON: Ron Elving, thanks so much.ELVING: Thank you, Scott.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week in politics: Final Epstein files, partial government shutdown, 'safer' ICE operations, new Fed chair",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-31T13:05:27.000Z",
      "dateModified": "2026-01-31T13:05:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ says it has met legal obligations with latest Epstein files release",
    "url": "https://www.npr.org/2026/01/30/nx-s1-5694006/doj-says-it-has-met-legal-obligations-with-latest-epstein-files-release",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-30T21:02:51.000Z",
    "description": "\n      The Justice Department says it has released more than 3 million pages of materials tied to convicted sex offender Jeffrey Epstein, to comply wi",
    "body": "\n      The Justice Department says it has released more than 3 million pages of materials tied to convicted sex offender Jeffrey Epstein, to comply with the law.   \n\n    AILSA CHANG, HOST:  All right, we turn now to news out of Washington, where the Justice Department says that it's releasing more than 3 million pages of materials tied to convicted sex offender Jeffrey Epstein. This is happening under the Epstein Files Transparency Act. Congress passed that law late last year, requiring the Justice Department to make all of the Epstein files public. NPR justice correspondent Ryan Lucas is covering this and joins us now. Hi, Ryan.RYAN LUCAS, BYLINE: Hi there.CHANG: OK, so it was the deputy attorney general, Todd Blanche, who made this announcement today, right? What did he have to say?LUCAS: Well, Blanche said that the department is producing 3 million pages of materials today. He says that brings the total amount the department has released under the Epstein law to around 3.5 million pages. Here's a bit of what Blanche said.(SOUNDBITE OF ARCHIVED RECORDING)TODD BLANCHE: Today's release marks the end of a very comprehensive document identification and review process to ensure transparency to the American people and compliance with the act.LUCAS: Now, he said more than 500 lawyers and other DOJ employees worked nights, weekends, also holidays to go through and review all of these materials. And there were a lot of files to review. Blanche said it was the equivalent of two Eiffel Towers' worth of pages if stacked up.CHANG: Wow.LUCAS: And NPR has a team of folks going through the latest files, looking for anything new or noteworthy.CHANG: That is a lot of files for the NPR team. OK, well, the Justice Department has gotten a lot of criticism for its handling of the Epstein files, like over its redactions that it has made throughout all of these files, failing to meet the deadline that was outlined under the law. Did Blanche respond to any of those criticisms?LUCAS: Yes. He spelled out, as the department has in the past, that redactions were made as the law allows for things like personally identifiable information of Epstein's victims or of pornographic material. Blanche said today that the department also redacted every woman who appears in any photo or any video, with the exception of Ghislaine Maxwell. She's Epstein's longtime confidant. She was convicted in 2021 of sex trafficking for helping Epstein abuse underage girls.Now, Blanche said that when the number of files is this big, mistakes are, as he put it, inevitable. The Justice Department has not yet provided a summary of the redactions that it made and the legal basis for them as the law requires. Blanche said that that will happen in due time.CHANG: OK. Well, the friendship between President Trump and Jeffrey Epstein has been a constant topic of conversation. They were friends for years before there was a falling out. Did Blanche address concerns that the Justice Department might be withholding embarrassing information about Trump in these files?LUCAS: Well, he was asked point-blank whether Trump was treated the same as everyone else who appears in the files and whether everything in there related to him is being released. It was a pertinent question, in part because Blanche himself previously served as Trump's personal defense attorney. Now, Blanche replied that the department complied with the law. He also denied that the DOJ protected Trump in any way. He also at one point said this.(SOUNDBITE OF ARCHIVED RECORDING)BLANCHE: There's this mantra out there that, oh, you know, the Department of Justice is supposed to protect Donald J. Trump and that's what we were telling - that's not true. That was never the case. And we are always concerned about the victims.LUCAS: He said there's a hunger for information out there that won't be satisfied by the release of these files. Now, some of that hunger, it has to be said, has been fueled by Trump and other top administration officials, including at the Justice Department, because of the conspiracy theories that they've pushed over the years about what could be in these files.CHANG: And before we go, Ryan, I want to turn quickly to something that Blanche said about Minnesota. He now says the Justice Department has opened a civil rights investigation into the killing of Alex Pretti, right? Isn't that a reversal?LUCAS: Right. Since Pretti was shot dead by federal immigration agents last weekend, administration officials had publicly said DHS was leading the Pretti investigation. There was no FBI civil rights probe. Now we have, as you said, a reversal. Blanche says the FBI is investigating. It's in coordination with the Justice Department Civil Rights Division. I will say that the attorney general - the deputy attorney general also brushed off questions about whether the FBI would conduct a similar investigation into the killing of Renee Macklin Good, the other U.S. citizen fatally shot in Minneapolis by federal agents this month. Blanche said cases are handled differently depending on the circumstances.CHANG: That is NPR's Ryan Lucas. Thank you so much, Ryan.LUCAS: Thank you.(SOUNDBITE OF EMOTIONAL ORANGES SONG, \"TALK ABOUT US\")\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ says it has met legal obligations with latest Epstein files release",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-30T21:02:51.000Z",
      "dateModified": "2026-01-30T21:02:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Partial government shutdown begins despite Senate approval of spending deal",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5694696/partial-government-shutdown-begins-despite-senate-approval-of-spending-deal",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-31T13:09:55.000Z",
    "description": "\n      The Senate voted Friday to approve a spending deal meant to keep the government running, but the measure still needs to be approved by the Hous",
    "body": "\n      The Senate voted Friday to approve a spending deal meant to keep the government running, but the measure still needs to be approved by the House, and the shutdown deadline has passed.   \n\n    SCOTT SIMON, HOST:  There's a federal government shutdown again today, but unlike the record-long shutdown last fall, this funding lapse does not affect the whole government and may last only a few days. This comes as Democrats press for additional guardrails to try to rein in federal immigration officers after the killings of two U.S. citizens in Minneapolis. We're joined now by NPR congressional reporter Sam Gringlas. Sam, thanks for being with us.SAM GRINGLAS, BYLINE: Hey, Scott. Good morning.SIMON: Will most Americans even notice the shutdown?GRINGLAS: Probably not. You know, the Senate voted last night to fund large parts of the federal government that ran out of money at midnight. But the House still needs to greenlight this final deal, and that will not happen until at least Monday. So if all goes smoothly, this could be really brief, you know, not enough time for most federal workers to miss paychecks, though some might be furloughed or have to work without pay, like TSA agents. And while some government services may be affected, other pinch points that we saw during the last shutdown, like food assistance, will not be impacted now because Congress managed to fund a few of these agencies through September since the last shutdown.SIMON: And Congress just got through that funding standoff in November. How did they get to the same brink just a few months later?GRINGLAS: Congress had been on track to avert a shutdown, but after that second deadly shooting in Minneapolis, Democrats pledged to oppose the Homeland Security funding bill, which includes funding for Immigration and Customs Enforcement. But the money for the Department of Homeland Security was tied together with more than a trillion dollars for other departments, including defense, health and housing. Republicans agreed to Democrats' demands to isolate DHS funding from the rest and only extend it for two weeks, giving them time to negotiate policy changes to restrain the actions of federal immigration agents. But, Scott, it's not clear that lawmakers can come up with an agreement on that.SIMON: What do Democrats want, and why have they been willing to risk another shutdown?GRINGLAS: Yeah. Democrats are demanding a suite of changes, like requiring judicial warrants for immigration raids, ensuring impartial investigations and accountability after incidents and mandating immigration officers wear body cameras and remove their masks. Democrats like Chris Murphy of Connecticut feel emboldened because they think the public agrees with them.(SOUNDBITE OF ARCHIVED RECORDING)CHRIS MURPHY: I think people want us to fight. People want us to act in an urgent way. So I think if we're fighting for these reforms, we're exactly where the American people want us to be.UNIDENTIFIED PERSON: Have you spoken...GRINGLAS: And even more than the last shutdown debate over those health subsidies last fall, what's unfolded in Minneapolis maybe speaks to something more fundamental about the country at this moment. Last fall, six Senate Democrats broke with their party to reopen the government, saying the consequences of the shutdown were just too much. This time, though, five of those six say that they were willing to risk another shutdown here.SIMON: And, Sam, what have you noticed in the Republican response this week?GRINGLAS: So we are in an era when congressional Republicans rarely criticize the Trump administration. But the images coming out of Minneapolis have made even many Republicans uneasy. Republican Senator Thom Tillis of North Carolina told reporters this week that immigration was an issue that helped Republicans win, and this was undercutting all of that.(SOUNDBITE OF ARCHIVED RECORDING)THOM TILLIS: It's making the president look bad on policies that he won on. He won on a strong message about immigration. And now nobody's talking about that. They're not talking about securing the border. They're talking about the incompetence of the leader of the Homeland Security. These people are amateurs.GRINGLAS: We also heard some Republicans calling not just for an investigation or hearings, but also saying they're open to policy changes. Though, this is far from universal. Many Republicans like Senator Markwayne Mullin, Republican of Oklahoma, have praised the work of ICE and called the Minneapolis shootings an anomaly.(SOUNDBITE OF ARCHIVED RECORDING)MARKWAYNE MULLIN: We're not going to keep ICE from doing their job. The American people wanted the president to enforce law and order, and ICE is doing their job.SIMON: And what happens if the two parties can't come to an agreement on ICE restrictions?GRINGLAS: OK. So I mentioned the House on Monday has to give this final green light, and that is not a foregone conclusion. House Democrats are saying they're still weighing this deal, thinking maybe their party should hold up funding further to maximize their ability to extract policy changes. And then if this deal does pass funding for Homeland Security, it's just temporary. Congress will have less than two weeks to coalesce around policy changes, and that is a really tall order here, especially for this Congress, where bipartisan agreement has often proved so elusive.SIMON: NPR congressional reporter Sam Gringlas. Thanks so much.GRINGLAS: Thanks, Scott.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Partial government shutdown begins despite Senate approval of spending deal",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-31T13:09:55.000Z",
      "dateModified": "2026-01-31T13:09:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about the partial government shutdown",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5694716/partial-government-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3391x1907+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4b%2Ff7%2F5c0c82f84015932f7231d16d8914%2Fap26027710705974.jpg",
    "tag": "Politics",
    "date": "2026-01-31T05:01:06.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is photographed on Jan.",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is photographed on Jan. 27, 2026.\n                \n                    Rahmat Gul/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rahmat Gul/AP\n    \n\n   \n   The U.S. government has entered a partial shutdown after Congress failed to meet a deadline of midnight on Friday to complete work on a spending package to prevent funding from running out across multiple federal departments.   While funding has technically expired, Congress appears within striking distance of breaking the impasse that has led funds to expire across large stretches of government, including the Department of Defense, the State Department and the Department of Health and Human Services.    On Friday, the Senate approved legislation to fund each of these remaining government agencies through the end of the fiscal year in September, while also agreeing to a two-week stopgap bill to fund the Department of Homeland Security. That two-week continuing resolution is designed to allow lawmakers to negotiate reforms at the agency after federal immigration officers in Minnesota killed two U.S. citizens this month.    \n   However, the legislation must now be approved by the House, which is on recess until Monday. President Trump has already endorsed the package, and lawmakers in the lower chamber are expected to vote on it soon after their return to Washington.   \n   Just a week ago, Congress appeared on track to approve nearly $1.3 trillion in spending for defense, health, transportation, housing and more in a single package before the deadline.   But the second deadly shooting of a U.S. citizen in Minneapolis by federal immigration officers upended those plans, as Democrats pledged to withhold support for the funding package without policy changes on immigration enforcement.   Now that the Senate has voted, the fate of the legislation moves to the House. Here's what to know:   House recess makes a short-term funding lapse inevitable   Under the Senate agreement, Senators voted on five appropriations bills — Defense; Labor, Health and Human Services, Education; Transportation, Housing and Urban Development; State; and Financial services and general government — to fund those agencies through September. They also approved a two-week extension of Homeland Security funding to give negotiators more time to consider potential reforms.   But the House, which had previously approved a package to fund all six departments, needs to vote again on the amended package.    \n   If lawmakers act quickly upon returning Monday, the effects of a shutdown could be extremely limited, as most federal offices are closed on the weekend.   But the package could face further hurdles in the House, where Speaker Mike Johnson, R-La., holds a razor thin majority. The conservative House Freedom Caucus voiced opposition to the plan earlier this week, and the measure will first need to advance through the Rules Committee, where Republican defections could prevent the package from getting to the floor.   What Democrats are asking for   Democrats are calling for broad changes to the way federal immigration officers carry out their work. This includes barring them from wearing masks, requiring body cameras and creating a uniform code of conduct and use-of-force rules.   Democrats are asking for rules on the kinds of warrants immigration officers can use to enter homes and an end to so-called \"roving patrols\" when officers conduct broad searches and stops of people they suspect of being in the country illegally.   They also want to make it easier to pursue legal action against immigration officers and \"independent investigations\" into misconduct by federal officers.    And, they also want to mandate that agents display clearer identification.    \n   Some of the recommendations could attract Republican support. In the wake of Pretti's death, several Republicans expressed discomfort with ICE enforcement tactics and called for hearings and an independent investigation.   But divides remain within the party: Sen. James Lankford, an Oklahoma Republican who sits on the homeland security committee, said he did not see a need for any further policy changes. He noted that the House has already approved additional funding for body cameras and oversight.   \"We're not going to keep ICE from doing their job,\" said Sen. Markwayne Mullin, R-Okla. \"The American people wanted the president to enforce law and order and ICE is doing their job.\"   \n   Barbara Sprunt, Ximena Bustillo and Sam Gringlas contributed to this report. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about the partial government shutdown",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3391x1907+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4b%2Ff7%2F5c0c82f84015932f7231d16d8914%2Fap26027710705974.jpg"
      ],
      "datePublished": "2026-01-31T05:01:06.000Z",
      "dateModified": "2026-01-31T05:01:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DHS keeps making false claims about people. It's part of a broader pattern",
    "url": "https://www.npr.org/2026/01/31/nx-s1-5690124/ice-alex-pretti-immigration-unproven-claims-dhs-enforcement-arrests",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3366x1893+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb4%2Fd8%2Fc50f7d6b4584a0067ecb1bf71df4%2Fgettyimages-2258012442.jpg",
    "tag": "Politics",
    "date": "2026-01-31T05:16:59.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A photograph of the pistol recovered by ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A photograph of the pistol recovered by immigration agents after a shooting in Minneapolis is shown on a screen behind U.S. Secretary of Homeland Security Kristi Noem as she speaks during a news conference in Washington, D.C., on Jan. 24. Federal immigration agents shot and killed Alex Pretti that day during operations in Minneapolis.\n                \n                    Al Drago/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Al Drago/Getty Images\n    \n\n   \n   On a Saturday in early October, Marimar Martinez, a 30-year-old teacher and American citizen, was driving her car when she noticed federal immigration agents in her Chicago neighborhood. She began following them, as did the driver of another car. She honked her horn and shouted \"la migra\" to warn her neighbors that immigration agents were nearby.   As she drove alongside a Chevy Tahoe driven by Border Patrol agents, the vehicles made contact — who swerved into whom is a point of dispute. Martinez then began to drive away. A Border Patrol agent fired at her five times.   \n   The Department of Homeland Security quickly alleged Martinez had \"rammed\" the Border Patrol vehicle. \"This woman — who, by the way, is a Montessori school teacher with no criminal history — she's now, all of a sudden, a 'domestic terrorist,'\" her attorney, Chris Parente, told NPR. \"This is before there's any investigation done.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Marimar Martinez (center) is greeted by her family after being released from the Metropolitan Correctional Center in Chicago on Oct. 6, 2025, after being shot by a Border Patrol agent. She was initially charged with assaulting federal officers but federal prosecutors later dropped all charges against her.\n                \n                    E. Jason Wambsgans/Chicago Tribune/ZUMA Press Wire via Reuters\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        E. Jason Wambsgans/Chicago Tribune/ZUMA Press Wire via Reuters\n    \n\n   \n   Federal prosecutors dropped all charges against Martinez, who survived the shooting. But a Department of Homeland Security press release with her name, mug shot and the accusation that she is a \"domestic terrorist\" is still online, as are a number of posts on X by high level Trump administration officials that paint her as a criminal who attacked law enforcement. One post with allegations about her was reshared by FBI Director Kash Patel and inaccurately links to video footage from a different incident she had nothing to do with.   \n            The @FBI just arrested two individuals who were allegedly driving these vehicles and attacking our federal law enforcement officers.They have been charged for assaulting federal officers with a deadly or dangerous weapon.Attack our law enforcement, and this FBI will find you… https://t.co/iQ9wDeAzQh— FBI Director Kash Patel (@FBIDirectorKash) October 6, 2025\n   \n   In recent weeks, the Trump administration swiftly attempted to justify the shootings of Renee Macklin Good and Alex Pretti by claiming they were carrying out acts of domestic terrorism in the moments before they were killed. They made these claims without waiting for investigations to unfold, and in spite of conflicting video evidence and witness accounts. As Martinez's case and others demonstrate, these statements are part of a much broader, months-long communication pattern by the administration on immigration related issues.   \n   Trump administration officials have repeatedly made unproven or incorrect claims when describing immigrants targeted for deportation, U.S. citizens arrested while protesting the administration's immigration crackdown and people who simply drove through areas where an immigration enforcement operation was going on.   On social media, the administration has accused people of violently attacking federal immigration agents or impeding operations. In many instances, criminal charges were quietly dropped or never filed.   \n   While it's not uncommon for law enforcement agencies to make allegations about suspects that wind up being disproven, many of DHS's accusations against private individuals stand out for their hyperbolic language.   \"It seems to me that they are not writing these statements with the intention of ever supporting them in court, but just to try and convince officers and their voter base,\" said Greg Jackson, an attorney in Southern California who has clients who were shot at by federal immigration agents.   Trump administration officials and their allies online frequently celebrate deporting the so-called \"worst of the worst.\" They used such language when referring to the alleged \"terrorists\" the administration sent to El Salvador's brutal CECOT prison last spring. But nearly half of the Venezuelan men sent to CECOT had no criminal history, according to an analysis by Human Rights Watch, and only eight men out of 252 had convictions for violent or potentially violent offenses.   The administration's mischaracterizations have also spilled over to courtrooms, where federal judges in dozens of cases have admonished federal officials for providing false, contradictory or unreliable statements in court.   \"There are armed masked men in the streets acting as paramilitary agents of the state being directed to grab people up on behalf of false claims, and the government is lying about what happens before, during and afterward,\" said Brendan Nyhan, a professor at Dartmouth College who studies political misinformation and misperceptions.   \n   \"Every American should be worried about that, because if they can lie about this, what else could they lie about? And if it's your family member who gets killed, what recourse do you have?\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Masked ICE agents leave a residence after knocking on the door in Minneapolis on Wednesday.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   In response to NPR's questions, an unnamed DHS spokesperson said in a statement, \"DHS law enforcement is prioritizing the arrest and removal of dangerous public safety threats. Under President Trump's and Secretary Noem's leadership, DHS has always been steadfast in targeting dangerous criminal illegal aliens, including murderers, rapists, pedophiles, drug traffickers, gang members, and terrorists.\"   A familiar pattern   In the wake of Border Patrol agents shooting 37-year-old Alex Pretti, an ICU nurse, in the street on Jan. 24, Trump's deputy chief of staff Stephen Miller called Pretti a \"would-be assassin\" in a post on X.   \n   In separate press conferences the day of the shooting, both Border Patrol Commander Greg Bovino and Homeland Security Secretary Kristi Noem said it appeared Pretti intended to do \"maximum damage\" and kill law enforcement. Noem referred to him \"brandishing\" a weapon, but video evidence showed he had a handgun but never took it out of its holster.   \n   The response also echoed the immediate aftermath of Renee Macklin Good's killing, when officials accused her of trying to run over and murder an ICE agent before he fatally shot her.   On Thursday night, Fox News host Sean Hannity asked Noem to address the pushback she received over her messaging around the shootings. \"People seem to be upset over the term domestic terrorism. Why do you believe that's appropriate?\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Border Patrol Commander Greg Bovino speaks during a news conference in Minneapolis on Sunday. The news conference comes after 37-year-old Alex Pretti was fatally shot by federal agents.\n                \n                    Brandon Bell/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brandon Bell/Getty Images\n    \n\n   \n   Noem answered, \"We're continuing to gather information,\" rather than defend the term.   A bystander video of Pretti has surfaced in recent days that shows a separate incident that occurred 11 days before he was killed by federal agents. The video shows Pretti spitting at an SUV full of agents then kicking the vehicle, breaking a rear tail light lens. A number of agents jumped out and wrestled him to the ground.   \n   \"Agitator and, perhaps, insurrectionist, Alex Pretti's stock has gone way down,\" Trump wrote on Truth Social early Friday.   Jackson, the attorney in Southern California, said the government's initial messaging about the Minnesota shootings sounded familiar to him, because of similarities with statements about the two men he represents who were both shot at by federal agents in their cars in two separate incidents over the summer.   He said, as in his clients' cases, the government's narrative around the Good and Pretti cases sought to \"make it as if their agents are the victims and the people who were actually shot or shot at are the offenders.\"   He said both his clients have suffered reputational harm by DHS statements and the allegations against them.   \"They were branded as these violent criminals,\" Jackson said. \"And neither of them has any criminal history whatsoever.\"   DHS has accused one of Jackson's clients, Francisco Longoria, of attempting to \"run over\" U.S. Customs and Border Protection officers and injuring them with his pickup truck after they surrounded the truck and smashed his windows. Surveillance video from across the street shows Longoria's pickup driving away and armed officers returning to their vehicles. There is no obvious sign any of the officers were injured.   \n   Ultimately, criminal charges against Longoria were dropped and Jackson is helping him sue to recover damages. Jackson's message to the public is to keep a distance and don't physically engage with officers — but record everything.   Chris Parente, who represents Martinez in Chicago, was in court Thursday asking the judge to unseal evidence, including bodycam footage, that shows what happened the day Martinez was shot.   Text messages written by Border Patrol agent Charles Exum were turned over in the case and have already been made public.   \"I fired 5 rounds and she had 7 holes. Put that in your book boys,\" Exum wrote in a Signal chat, after sharing a Guardian article that quoted Parente describing Martinez's injuries. In another text thread he wrote, \"Sweet. My 15 mins of fame. Lmao.\"   \n   When her case was initially dismissed, Martinez agreed for some of the evidence to remain sealed. But in the aftermath of the Good and Pretti shootings, Martinez wants the public and elected officials to see that material to understand how DHS responds to the shootings, Parente said.   And given that she continues to be accused in a government press release and X posts of being a \"domestic terrorist,\" Parente wrote in his motion that disclosing the evidence \"is paramount to Ms. Martinez's ability to combat the continuing harm being done to her reputation.\"   NPR asked DHS if the agency plans to take down or update their online statements given that charges against Martinez have been dropped. Instead, in a statement to NPR on Friday, DHS reiterated that accusation again.   \"Border Patrol law enforcement officers were ambushed by domestic terrorists that rammed federal agents with their vehicles. The woman, Marimar Martinez, driving one of the vehicles, was armed with a semi-automatic weapon and has a history of doxing federal agents,\" the statement reads.   In court testimony, Exum acknowledged that Martinez had not \"rammed\" him. Martinez has denied doxing federal agents, Parente said, and says the allegation is \"based entirely\" on Martinez resharing a Facebook post highlighting an ICE agent's public website for his DJ business. He said evidence photos in the court record show her handgun, for which she has a concealed carry license, was holstered at the bottom of her purse.   At Thursday's hearing about unsealing the evidence, after federal prosecutors indicated concerns, Judge Georgia Alexakis acknowledged such a move would be unusual.   \"I also think that we're finding ourselves in an unusual situation in which the government made exceedingly public statements about a criminal defendant, who under our American system of justice is presumed innocent, and have made no efforts to equally publicize the fact that they abandoned the opportunity to convict her, to try to convict her in a court of law, even though that's completely within their power to do that,\" Alexakis said.   \n   No charges, just accusations   DHS officials have continued to accuse George Retes, a U.S. citizen who was detained by federal immigration officers in July, of assaulting an officer even though no criminal charges against him have ever been filed.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Federal agents block a field and road during an ICE immigration raid at a nearby licensed cannabis farm near Camarillo, Calif., on July 10, 2025.\n                \n                    Mario Tama/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mario Tama/Getty Images\n    \n\n   \n   Retes was on his way to his job doing security at a cannabis farm in Southern California where protesters had gathered to demonstrate against federal immigration officers conducting a raid. An agent pepper sprayed him, smashed his window and dragged him out of the car, according to his account. He was held in detention for three days but was never criminally charged.   After he wrote about his experience for The San Francisco Chronicle in September, the DHS account on X wrote that Retes was not wrongfully arrested and said he \"became violent and refused to comply with law enforcement. He challenged agents and blocked their route by refusing to move his vehicle out of the road. CBP arrested Retes for assault.\"   The same post continued, \"These types of smears are designed to demonize and villainize our brave ICE law enforcement. This kind of garbage has led to a more than 1000% increase in the assaults on enforcement officers.\"   \n            As CBP and ICE agents were executing criminal search warrants on July 10 at the marijuana sites in Camarillo, CA, George Retes—a U.S. citizen—became violent and refused to comply with law enforcement. He challenged agents and blocked their route by refusing to move his vehicle… pic.twitter.com/aKS2voKU3j— Homeland Security (@DHSgov) September 17, 2025\n   \n   \"It's a complete lie. The proof is all there,\" Retes said in an interview with All Things Considered in October. \"There's helicopter footage. They never charged me. Even though they sent out a tweet telling everyone that I assaulted agents and they paint me as a criminal, they never pursued charges.\"   He said it felt like the government was trying to intimidate him from speaking out. \"Unfortunately for them, it's not going to work … people deserve the truth and deserve to know whether or not the government is lying or not.\"   After he wrote another piece in the Houston Chronicle in December, DHS posted on X repeating the accusation that he assaulted a law enforcement officer. In its statement to NPR, DHS again repeated the claim about Retes, who is preparing a civil lawsuit against the federal government to recover damages for his rights being violated.   \n   Such lawsuits are difficult to win, because unlike state or local officials, federal officials are protected by extra immunity in many cases. That fact is likely giving federal officials the confidence that they can make false accusations about people without being held accountable, said Anya Bidwell, a lawyer at the nonprofit Institute for Justice who is representing Retes in his pending suit.   \"And because they fully understand it, they have no problem going out there, being extremely aggressive, misrepresenting the facts, misrepresenting the record,\" Bidwell said. \"Fundamentally, they know that it's not going to be that often where they actually would have to show up in court and defend their statements.\"   Targets of deportation    The Trump administration has promoted its aggressive immigration enforcement tactics as necessary to rid the country of dangerous criminals. The administration has quadrupled deportations in the country's interior in part by massively increasing removals of immigrants without criminal records, a recent study by the Deportation Data Project found.   An NPR review of the DHS and ICE X accounts shows that in the first year of this administration, the two agencies posted about more than 2,000 foreign-born individuals targeted for immigration enforcement, an average of five posts a day. The posts contain similar elements: a photo, name, age, nationality and usually criminal charges. In over 1,300 cases, the people are described as some combination of \"criminal\" \"illegal\" and \"alien\". (The agencies also post about targets of law enforcement not related to immigration, but such posts do not typically include photos of the suspects.)   \"People are being told to fear violent criminals in their midst,\" said Nyhan of Dartmouth College. \"They're being shown seemingly scary pictures of criminals from vulnerable outgroups and told that they're being kept safe by dragging those people away. And that messaging is being used to obscure the fact that the majority of the people being grabbed have no record of violent conduct at all.\"   \n   The Trump administration has, on multiple occasions, misrepresented the gang affiliations of people they've arrested. Last fall, ICE raided a building in Chicago, saying it was a gathering place for the Venezuelan gang, Tren de Aragua. Out of the 37 people arrested, only two were gang members. The other 35 had entered the country illegally.   The administration's exaggerated claims \"are justifying extreme emergency level powers on the part of the executive branch — both in extremely draconian uses of immigration enforcement that we're seeing … and in the use of the military domestically,\" said Ryan Goodman, a law professor at New York University School of Law and co-editor-in-chief of the online journal, Just Security.   During the 2024 campaign, Trump and Vance amplified the false claim that Haitian immigrants in Ohio were eating pets. Candidate Trump repeatedly mentioned the baseless claim that Venezuela was opening its prisons and mental institutions and sending those people to the U.S., and has continued to repeat this as president.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Demonstrators try to stop a car leaving an ICE processing center during a protest in Broadview, Ill., on Sept. 19, 2025.\n                \n                    Octavio Jones/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Octavio Jones/AFP via Getty Images\n    \n\n   \n   Most recently, the Trump administration has lashed out at Somalis in Minnesota. Officials have helped amplify unverified claims about fraud perpetuated by the Somali community, which was used in part as a justification to crack down on the state.   Ahilan Arulanantham, a professor at UCLA School of Law, said he believes the prevalence of what he called \"macro lies\" from the White House has \"translated down into the behavior of lower level government officials.\"   \n   In November, a federal judge in Chicago accused Bovino of \"outright lying\" in his court testimony. The judge wrote, \"Bovino admitted in his deposition that he lied multiple times\" about the events leading up to his decision to pepper spray protesters during DHS operations in the city last year.   That finding is just one of more than 60 instances of judges calling out the second Trump administration officials for providing false information through November, according to a tally by Just Security.   \n   \"If they can do it in one case, what stops them from doing it to anyone, really?\"   The Trump administration has publicized inaccurate information about some of the immigrants it is trying to deport.   Ramón Morales Reyes, a Mexican immigrant in Wisconsin living in the country without legal status, was the victim of a burglary and an assault in 2023. Last May, he also became the victim of official misinformation when DHS and the White House publicly accused him of a crime he didn't commit.   His assailant, Demetric Scott, later admitted that he framed Morales by forging a letter making threats to assassinate Trump in Morales' name. The letter was part of an elaborate plan to get Morales Reyes deported so he would be unable to testify against Scott.   Morales Reyes was arrested by ICE and detained, though investigators quickly realized that he had not written the letter and turned their attention to Scott. This week, Scott was convicted of witness intimidation by a jury.   Despite that, Noem issued a statement with Morales Reyes' name and photo, thanking ICE for putting an \"illegal alien who threatened to assassinate President Trump\" behind bars. The White House posted an image of his face on X captioned, \"FAFO: Threaten to Kill the President as an Illegal Alien—You'll Be Captured, Deported, and Never Set Foot on American Soil Again.\" (FAFO stands for \"f*** around, find out.\")   While in detention, Morales Reyes experienced harassment due to the allegations and was stressed that he was being accused of a crime he didn't commit, his lawyer Cain Oulahan told NPR.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Ramon Morales Reyes' attorney, Cain Oulahan, (center) addresses the media in Milwaukee about the detention of Ramon Morales Reyes on May 30, 2025.\n                \n                    Andy Manis/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andy Manis/AP\n    \n\n   \n   Morales will not be charged for the threats but he is in deportation proceedings. After eight months, the federal government still hasn't properly cleared his name, Oulahan said.   A small disclaimer now appears on Noem's online statement about Morales Reyes. At the very bottom it notes he \"is no longer under investigation for threats against the President.\" But the disclaimer calls him a \"criminal alien\" and says he has \"previous arrests\" and lists charges.   \n   Oulahan has yet to find records corroborating those arrests related to his client. He thinks the list of arrests likely refer to database results for someone else with the same name.   He's appalled to see up close how the administration could publicize a smear.   \"If they can do it in one case, what stops them from doing it to anyone, really? Anyone that disagrees with their policies, anyone who they see as an obstacle or someone that they want to get retribution against,\" Oulahan said. \"It's very disturbing.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DHS keeps making false claims about people. It's part of a broader pattern",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3366x1893+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb4%2Fd8%2Fc50f7d6b4584a0067ecb1bf71df4%2Fgettyimages-2258012442.jpg"
      ],
      "datePublished": "2026-01-31T05:16:59.000Z",
      "dateModified": "2026-01-31T05:16:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]