[
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713305/federal-funding-democratic-states-lawsuit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fce%2F9d%2F4a8b3eb6493e8275e7269e6a0981%2Fap26041698014391.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:31:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - A sign marks the entrance to the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - A sign marks the entrance to the U.S. Centers for Disease Control and Prevention headquarters Wednesday, Aug. 27, 2025, in Atlanta. (AP Photo/Brynn Anderson, File)\n                \n                    Brynn Anderson/AP/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brynn Anderson/AP/AP\n    \n\n   \n   President Donald Trump's administration cannot rescind $600 million in public health grants allocated to four Democratic-led states, for now, a federal judge in Illinois ruled Thursday.   \n   California, Colorado, Illinois and Minnesota sued Wednesday to try to block the planned funding cuts to programs that track disease outbreaks and study health outcomes of LGBTQ+ people and communities of color in major cities.   U.S. District Judge Manish Shah stopped the cuts from taking effect for 14 days, saying in his order that the states \"have shown that they would suffer irreparable harm from the agency action.\" That will keep grant money flowing from the Centers for Disease Control and Prevention to state and city health departments and their partner organizations while the challenge proceeds.   \n   The first batch of grants could have been pulled Thursday if the judge had not intervened, Colorado Attorney General Phil Weiser said.   The Department of Health and Human Services said the grants are being terminated because they do not reflect CDC priorities, which were revised last year to align with the administration's shift away from health equity, the idea that certain populations may need additional support to eliminate health disparities.   Much of the money helped cities fight the spread of HIV and other sexually transmitted infections, especially among gay and bisexual men, adolescents and ethnic minorities.   \n   Federal health officials did not immediately respond to requests for comment on the judge's order.   Officials in the four states are among Trump's strongest political foes and view the cuts as retaliation for opposing his immigration enforcement crackdown. All have been targets of other federal cuts, including for food assistance programs, child care subsidies and electric vehicle infrastructure.   Their lawsuit, led by Illinois Attorney General Kwame Raoul, argues that the health care cuts violate the Constitution by imposing retroactive conditions on funding that Congress already awarded.   \"Targeting four Democrat-run states that are standing up to his completely unrelated immigration policies is a transparent attempt to bully us into compliance,\" Raoul said. \"The president may be playing politics with critical public health funding, including more than $100 million to Illinois, but our residents are the ones who pay the price.\"   \n   The attorneys general say the loss of funding would force them to lay off hundreds of public health workers.   Minnesota Attorney General Keith Ellison said they will seek to extend the judge's pause for the duration of the lawsuit.   Courts have temporarily blocked similar efforts by the Trump administration, including a plan to cut off billions for child care subsidies and other programs for low-income families in the four states, plus New York.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fce%2F9d%2F4a8b3eb6493e8275e7269e6a0981%2Fap26041698014391.jpg"
      ],
      "datePublished": "2026-02-13T07:31:12.000Z",
      "dateModified": "2026-02-13T07:31:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bangladesh National Party claims victory in first election since student uprising",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713306/bangladesh-national-party-claims-victory-first-election-since-student-uprising",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4e%2Fd3%2Fb9fc763449809b1a642b501829b4%2Fap26043148980377.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:28:20.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bangladesh Nationalist Party Chairperson",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bangladesh Nationalist Party Chairperson Tarique Rahman waves as he comes out after casting his vote during the national parliamentary elections in Dhaka, Bangladesh, Thursday, Feb. 12, 2026.\n                \n                    Mahmud Hossain Opu/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mahmud Hossain Opu/AP\n    \n\n   \n   DHAKA, Bangladesh — The Bangladeshi Nationalist Party (BNP), led by Tarique Rahman, claimed victory Friday in the first elections held since the previous government was toppled in a student-led revolution in 2024.   \n   Final results have yet to be announced, with the Election Commission expected to do so shortly, but the BNP says it has secured a majority.   Developments in Bangladesh are being closely watched beyond its borders. It is the world's eighth-most populous country and second-largest garment exporter after China, supplying major brands to Europe and the United States - a position the BNP will be keen to protect.   Rahman, 60, hails from a political dynasty. Both of his parents were central figures in the party for decades. His father, military officer and former president Ziaur Rahman, founded the BNP in 1978.   \n   His mother, Khaleda Zia - who died in December - had led the party for more than 30 years and served three times as prime minister.   Rahman's rise follows the uprising in July and August 2024 that resulted in up to 1,400 deaths, according to the United Nations. The unrest ended with former prime minister and Awami League leader Sheikh Hasina fleeing the country.   Jon Danilowicz, an independent political analyst and retired U.S. diplomat who previously served in Bangladesh, told NPR he believes the uprising may serve as a warning for Rahman.   He said: \"Tarique Rahman would not be in the position he is in had he not been Khaleda Zia and Ziaur Rahman's son. But it seems he has understood what has changed in the country. He has acknowledged the July revolution and the sacrifices of those who were on the front line.\"   Rahman faced a tough challenge from Bangladesh's third-largest party, Jamaat-e-Islami, which contested the election as part of an 11-party alliance that included the National Citizen Party (NCP), formed by students who led the uprising.   He now faces the daunting task of steering the South Asian nation of around 180 million people through high inflation, rising unemployment and the growing impacts of climate change.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Security personnel guard near the chairman office of the Bangladesh Nationalist Party (BNP) before the national parliamentary election result is announced in Dhaka, Bangladesh, Thursday, Feb. 12, 2026.\n                \n                    Anupam Nath/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anupam Nath/AP\n    \n\n   \n   It will be an especially challenging task for someone who has never held public office in Bangladesh and returned to the country less than two months ago after 17 years of self-imposed exile in London.   \n   While abroad, Rahman was convicted in Bangladesh of multiple offences while the Awami League was in power, including corruption and money laundering - convictions he and his party rejected as politically motivated.   The rulings were overturned between 2024 and 2025 during an interim period led by Nobel laureate Muhammad Yunus, paving the way for his return.   Challenges ahead   As prime minister, his immediate challenge will be to form a government capable of tackling economic pressures, creating jobs and restoring law and order.   \"There have been a lot of promises made in terms of social welfare programs and family cards, which give women with families a monthly stipend,\" Danilowicz said. \"But there's a fiscal reality the government will face. Bangladesh has one of the lowest taxation rates, and there are limits to how much revenue it can generate.\"   On foreign policy, the BNP government is expected to consolidate its relations with both the United States and China. The BNP has already said it plans to deepen relations with China, Bangladesh's largest trading partner. Relations with neighboring India, however, could prove more complicated.   Prime Minister Narendra Modi's government enjoyed close ties with the Awami League while it was in power and has been sheltering Sheikh Hasina since she fled. New Delhi has so far not responded to requests from Bangladesh to extradite her after a Bangladeshi court sentenced Hasina to death in November last year for crimes against humanity linked to the uprising - a verdict she refutes.   Danilowicz said: \"Bangladesh's population has turned against India over the past 18 months. The challenge for Rahman will be how far the BNP can go towards restoring relations with India without facing a public backlash.\"   Rahman and his party must also contend with a package of reform proposals designed to prevent a return to authoritarian rule. Known as the July National Charter, the plan outlines constitutional, institutional and electoral changes.   \n   It was signed in October last year by leaders of major political parties and approved by voters in a referendum held the same day as the parliamentary elections.   Danilowicz said: \"Certainly, the reforms can make a difference, making it harder for an executive to act in a way that is unchecked by any other institution. That was a fundamental issue that needed to be addressed.\"   With a reasonably robust opposition in parliament in the form of a Jamaat-e-Islami alliance, the BNP government is likely to face closer scrutiny than its predecessor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bangladesh National Party claims victory in first election since student uprising",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4e%2Fd3%2Fb9fc763449809b1a642b501829b4%2Fap26043148980377.jpg"
      ],
      "datePublished": "2026-02-13T07:28:20.000Z",
      "dateModified": "2026-02-13T07:28:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DHS expected to shut down as immigration talks falter",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5712744/dhs-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5784x3254+0+301/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbd%2Ffa%2F29f44f2c499b916d899a38e9f039%2Fgettyimages-2261301466.jpg",
    "tag": "Politics",
    "date": "2026-02-12T21:27:14.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Senate Majority Leader John Thune told r",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Senate Majority Leader John Thune told reporters Thursday that Democrats and Republicans are \"not close\" to a deal on Department of Homeland Security funding but that a \"deal space is there. I think we can get it done.\"\n                \n                    Heather Diehl/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Heather Diehl/Getty Images\n    \n\n   \n   The Department of Homeland Security, which houses agencies focused on immigration, disaster response and cybersecurity, is on track to shut down Saturday as lawmakers leave town without a funding agreement or a deal that Democrats hope will rein in the conduct of federal immigration officers.   After two U.S. citizens were shot dead by immigration officers in Minneapolis, Democrats laid out 10 demands to restrict agents' aggressive tactics as a condition for funding DHS. Democrats produced proposed legislative text over the weekend, and the White House responded with a counteroffer Wednesday night, though lawmakers declined to detail its contents.   \n   Senate Democrats blocked two Republican-backed measures Thursday to keep the department open, including a short-term funding extension for two weeks as negotiations continue.   \"Today's strong vote was a shot across the bow to Republicans,\" Senate Minority Leader Chuck Schumer said. \"Democrats will not support a blank check for chaos. This vote today asked a simple question: Will you rein in ICE's abuses, or will you vote to extend the chaos? Republicans chose chaos. And the Democrats, we refused.\"   House and Senate Republican leadership declined to cancel the upcoming weeklong recess. Senate Majority Leader John Thune said lawmakers have been told to be ready to return if a deal is reached, though he indicated that this would be unlikely.   \"I just think at the moment we're not close,\" Thune told reporters.   Democrats and Republicans have already started trading blame for the failure to avert a shutdown. Republicans say Democrats were slow to make an initial offer and then balked at anything short of their full slate of demands. Democrats accuse the White House of delivering a counterproposal that was \"insufficient and incomplete.\"   But leaders in both parties have still signaled they think a deal is possible.   \"That deal space is there,\" Thune said. \"I think this can get done.\"   \n   Immigration enforcement will continue while other programs pause   The shutdown is likely to have minimal impact on pay for Immigration and Customs Enforcement (ICE) and Customs and Border Protection (CBP) officers and funding for their enforcement operations, since both agencies received an infusion of cash from Congress last summer. During the government shutdown last fall, officers and agents conducting arrests continued to do so and also continued to be paid.   According to DHS' contingency plan, last updated in September, 22,862 agency workers not in ICE or CBP could be furloughed, meaning they would not work and would not be paid until the end of the shutdown. Other workers may be instructed to continue working but without pay, and there could be pauses to other programs.   The leadership of ICE, CBP and U.S. Citizenship and Immigration Services (USCIS) told lawmakers this week that the shutdown would have minimal impact on their employees. Still, some programs could be on hold.   For example, during the 43-day shutdown last fall, the Office of Detention Oversight, which investigates immigration detention conditions and deaths, was not working.   USCIS Director Joseph Edlow reminded House lawmakers that his agency is funded primarily by the fees that people pay when they submit various forms and applications, so his employees would still get paid.   ICE Acting Director Todd Lyons said the shutdown could affect DHS' work on transnational crime, but he did not note any impact to immigration operations. And CBP Commissioner Rodney Scott also didn't detail how the shutdown would affect personnel, just saying: \"I agree America becomes less safe.\"   Shutdown impacts will likely be limited   Republican lawmakers have warned that the shutdown could affect DHS agencies like the Transportation Security Administration and the Federal Emergency Management Agency (FEMA).   \"By not allowing us time to continue these conversations, real people are paying the price,\" said Sen. Katie Britt, R-Ala., who chairs the Appropriations subcommittee on homeland security.   \n   But most Americans may not feel severe impacts of the partial shutdown unless it is prolonged.   FEMA has millions of dollars on hand to continue responding to emergencies during the shutdown. FEMA Associate Administrator Gregg Phillips told Congress Wednesday that the fund \"has sufficient balances to continue emergency response activities for the foreseeable future.\" If the shutdown lasts several weeks, paychecks in March could be paused.   During the previous shutdown, DHS tapped into funding authorized by Congress last summer to continue paying active-duty Coast Guard and Secret Service members. Those funds could be made available again to stave off shutdown effects.   TSA agents are not expected to miss a paycheck until mid-March.   \"I am hopeful that these discussions will continue,\" said Sen. Chris Murphy, D-Conn., Britt's Democratic counterpart in charge of homeland security funding. \"But frankly, we had plenty of time to get a deal in the last two weeks. We want to fund the Department of Homeland Security, but only a department that is obeying the law.\"   This will be the third shutdown in a matter of months. Last fall, the entire federal government shut down for a record-long 43 days as Democrats tried and ultimately failed to extend expiring health insurance subsidies.   Funding briefly lapsed for part of the government earlier this month as Democrats withheld their votes for funding DHS through September as they tried to extract policy changes after the second deadly shooting in Minneapolis.   NPR's Rebecca Hersher contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DHS expected to shut down as immigration talks falter",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5784x3254+0+301/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbd%2Ffa%2F29f44f2c499b916d899a38e9f039%2Fgettyimages-2261301466.jpg"
      ],
      "datePublished": "2026-02-12T21:27:14.000Z",
      "dateModified": "2026-02-12T21:27:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "An effort in Congress to restrain immigration enforcement tactics is flailing (again)",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5704265/an-effort-in-congress-to-restrain-immigration-enforcement-tactics-is-flailing-again",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-12T22:31:31.000Z",
    "description": "\n      A bipartisan effort in Congress to restrain immigration enforcement tactics is flailing. It wouldn't be the first time recently that lawmakers ",
    "body": "\n      A bipartisan effort in Congress to restrain immigration enforcement tactics is flailing. It wouldn't be the first time recently that lawmakers pledged to find consensus, only for negotiations to fail.   \n\n    MARY LOUISE KELLY, HOST:  A bipartisan effort in Congress to restrain immigration enforcement tactics is flailing. And without a deal, the Department of Homeland Security will run out of funding after tomorrow. This would not be the first time lawmakers pledged to find consensus only for negotiations to fall apart. NPR congressional reporter Sam Gringlas explains.SAM GRINGLAS, BYLINE: A month ago, Republican Senator Bernie Moreno of Ohio was confident a bipartisan group of lawmakers was nearing a deal to renew lapsed health insurance subsidies.(SOUNDBITE OF ARCHIVED RECORDING)BERNIE MORENO: We're in the red zone, but that does not mean a touchdown. And it could mean a 95-yard fumble.GRINGLAS: In the end, there was no touchdown. Moreno says the talks fizzled, blaming Minority Leader Chuck Schumer for shutting them down in order to keep pummeling Republicans over premium costs.(SOUNDBITE OF ARCHIVED RECORDING)MORENO: Shouldn't we be here trying to figure out how to solve problems, rather than trying to figure out how to score political points for the purposes of the next election?GRINGLAS: Democratic negotiators say Republicans blew up the effort by inserting anti-abortion language in a provision on health savings accounts. Some Democrats, like Senator Chris Murphy of Connecticut, say the effort was doomed to fail not because of lack of compromise, but because Democrats gave up their leverage when a few voted to end the shutdown last fall.(SOUNDBITE OF ARCHIVED RECORDING)CHRISTOPHER MURPHY: I was pretty confident the minute that we gave up that we weren't going to get it.GRINGLAS: Congress' ability to act is again being tested, this time by two deadly shootings of U.S. citizens by immigration agents in Minneapolis. As with the subsidies, public demand pushed a number of Democrats and Republicans to pledge to do something - in this case, reining in enforcement tactics. And top lawmakers were optimistic they could find common ground, from House Speaker Mike Johnson to leading Senate Democrats like Patty Murray.(SOUNDBITE OF ARCHIVED RECORDING)PATTY MURRAY: I'll be doing everything I possibly can to ensure that we meet this moment.(SOUNDBITE OF ARCHIVED RECORDING)MIKE JOHNSON: And so I think we can get to an agreement. I certainly hope that's true.GRINGLAS: But within days, that rosiness dissipated ahead of a Friday deadline to fund the Department of Homeland Security.(SOUNDBITE OF ARCHIVED RECORDING)JOHN THUNE: Their immediate rejection of the Democrats' common-sense proposals was totally predictable - that such a short timeline would be challenging, if not impossible.GRINGLAS: Senate Majority Leader John Thune there says Democrats dawdled and then produced a laundry list of nonstarters. Senate Minority Leader Schumer called Republicans' offer insufficient. I asked Republican Senator Susan Collins of Maine, who's been a part of the negotiations on subsidies and immigration, why bipartisan collaborations keep crumbling. She said Congress does collaborate to get stuff done, like the bipartisan spending laws.SUSAN COLLINS: I don't know how you can possibly describe that as crumbling. That's Congress reasserting its power of the purse.GRINGLAS: Former Senator Heidi Heitkamp, a North Dakota Democrat, spent hours in rooms with senators like Collins trying to resolve a standoff over the debt ceiling. She says bipartisan negotiations have always been a high-wire act, particularly amid a national crisis.HEIDI HEITKAMP: You know, when the shock wears off, then all of a sudden, everybody goes back to their corners.GRINGLAS: A gang of eight lawmakers tried but failed to pass comprehensive immigration reform in 2013. A bipartisan Senate duo made progress on policing reform after the murder of George Floyd in 2020 but came up empty-handed. Heitkamp says many lawmakers today see even less incentive to compromise as politics becomes more tribal.HEITKAMP: The base on both sides, their willingness to reward compromise is greatly diminished (ph).GRINGLAS: When Congress promises to act and does not, Heitkamp says public trust is eroded. Republican Senator Katie Britt of Alabama says she's thinking a lot about that as she helps lead the current negotiations.KATIE BRITT: Anybody can identify a problem. We have to be people that are looking for solutions. I think we owe it to the people we serve to actually find that pathway forward.GRINGLAS: Britt has dismissed Democrats' initial demands as a Christmas list. But last fall, she did strike a deal with those handful of Democrats that voted to end that 43-day shutdown, including Senator Tim Kaine of Virginia. Kaine still believes bipartisan action is possible, but the reality is that on the most fraught issues, it is really hard.(SOUNDBITE OF ARCHIVED RECORDING)TIMOTHY KAINE: On health care, on immigration, the parties are in fundamentally very, very different places.GRINGLAS: Kaine says he goes into negotiations like these with high hopes, low expectations. Sam Gringlas, NPR News, Washington.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "An effort in Congress to restrain immigration enforcement tactics is flailing (again)",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-12T22:31:31.000Z",
      "dateModified": "2026-02-12T22:31:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge temporarily blocks Pentagon action against Mark Kelly over illegal orders video",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5698515/mark-kelly-pete-hegseth-lawsuit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2248+0+377/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff6%2F5d%2F2c71526a46a1aeea1374c92177c6%2Fgettyimages-2255797338.jpg",
    "tag": "Politics",
    "date": "2026-02-12T18:05:39.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Mark Kelly, D-Ariz., takes his seat",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Mark Kelly, D-Ariz., takes his seat during a Senate Armed Services Committee hearing on January 15.\n                \n                    Tom Brenner/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Brenner/Getty Images\n    \n\n   \n   A federal judge in Washington, D.C., has granted Sen. Mark Kelly's request for a preliminary injunction against Pete Hegseth, in a lawsuit filed by the Arizona Democrat accusing the defense secretary of trying to punish him for his political speech.   Kelly, a former Navy Captain, sued Hegseth in January, one week after the defense secretary moved to formally censure him for participating in a video where he and several Democratic lawmakers told U.S. servicemembers they can refuse illegal orders.   \"Our rules are clear. You can refuse illegal orders,\" Kelly says in the video.   \n   Hegseth has labeled Kelly's statements as \"seditious\" and announced a review of his retirement grade, which could lead to a demotion in rank and reduction in retirement pay.   Thursday's ruling temporarily blocks the Pentagon from taking steps to discipline Kelly. It was issued by Judge Richard Leon, a George W. Bush appointee on the U.S. District Court for the District of Columbia.   \"This Court has all it needs to conclude that Defendants have trampled on Senator Kelly's First Amendment freedoms and threatened the constitutional liberties of millions of military retirees,\" Leon wrote in his opinion. \"After all, as Bob Dylan famously said, 'You don't need a weatherman to know which way the wind blows.'\"    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth arrives on Capitol Hill for a classified briefing with senators on the situation in Venezuela on January 7.\n                \n                    J. Scott Applewhite/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        J. Scott Applewhite/AP\n    \n\n   \n   In his lawsuit, Kelly's lawyers argued that the Pentagon review was both \"unconstitutional and legally baseless.\"   \"The First Amendment forbids the government and its officials from punishing disfavored expression or retaliating against protected speech,\" the suit reads. \"That prohibition applies with particular force to legislators speaking on matters of public policy.\"   In a statement following the court's ruling, Kelly said the case was bigger than him.    \"This administration was sending a message to millions of retired veterans that they too can be censured or demoted just for speaking out. That's why I couldn't let this stand.\"    \n   \"I appreciate the judge's careful consideration of this case, and the clarity of his ruling,\" he continued. \"But I also know that this might not be over yet, because this President and this administration do not know how to admit when they're wrong.\"    Hegseth responded to the ruling in a post on X, saying the judge's decision would be \"immediately appealed.\"   \"Sedition is sedition, 'Captain,'\" he added.   Kelly was one of six Democratic lawmakers to participate in the video, which was released on social media in November amid concerns from Democrats in Congress about the legality of U.S. military strikes on alleged narco-trafficking boats in the Caribbean.    The video drew a furious response from President Trump, who in a post on social media called it \"SEDITIOUS BEHAVIOR, punishable by DEATH!\" Trump also said the lawmakers — all with military or intelligence backgrounds — \"should be ARRESTED AND PUT ON TRIAL.\"    Federal prosecutors attempted to indict the lawmakers, but a grand jury in Washington, D.C., ultimately rejected the effort, according to a source familiar with the matter who was not authorized to speak publicly.    It is not clear what charges prosecutors attempted to bring against the lawmakers. Previously the Justice Department had declined to \"confirm or deny the existence of an investigation\" into either Democrat.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge temporarily blocks Pentagon action against Mark Kelly over illegal orders video",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2248+0+377/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff6%2F5d%2F2c71526a46a1aeea1374c92177c6%2Fgettyimages-2255797338.jpg"
      ],
      "datePublished": "2026-02-12T18:05:39.000Z",
      "dateModified": "2026-02-12T18:05:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump border czar Tom Homan announces Minnesota immigration surge is ending",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5712280/minnesota-ice-surge-ends",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2407x1355+0+245/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F23%2F84%2F64ec55734b42a24e2cb53d54606f%2Fap26043511018917.jpg",
    "tag": "Politics",
    "date": "2026-02-12T17:41:35.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                White House border czar Tom Homan holds ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                White House border czar Tom Homan holds a news conference at the Bishop Whipple Federal building on Feb. 12, 2026 in Minneapolis.\n                \n                    Steve Karnowski/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Steve Karnowski/AP\n    \n\n   \n   The Trump administration will end the immigration enforcement crackdown in Minnesota that prompted widespread protests and claimed the lives of two U.S. citizens, border czar Tom Homan announced Thursday.   \"I have proposed, and President Trump has concurred, that this surge operation conclude,\" Homan said at a news conference in Minneapolis. \"A significant drawdown has already been underway this week and will continue to the next week.\"    Homan said the decision to end what the administration called \"Operation Metro Surge\" after two months followed improved cooperation between federal, state and local law enforcement. That allows more immigration detentions to occur at jails rather than in operations on the street.  He also said local law enforcement agencies are responding more quickly and consistently to protests.    \n   \"This surge operation and our work here with state and local officials to improve coordination and achieve mutual goals, as well as our efforts to address issues of concern here on the ground, have yielded the successful results we have came here for,\" Homan said. \"We are leaving Minnesota safer.\"    Minneapolis Mayor Jacob Frey, who from the outset fiercely opposed the Immigration and Customs Enforcement operation, declared victory.    \"They thought they could break us, but a love for our neighbors and a resolve to endure can outlast an occupation,\" Frey posted on X.  \"These patriots of Minneapolis are showing that it's not just about resistance — standing with our neighbors is deeply American.\"   Minnesota Gov. Tim Walz said the state can now move forward.   \"The long road to recovery starts now,\" Walz posted on X after Homan's news conference. \"The impact on our economy, our schools, and people's lives won't be reversed overnight. That work starts today.\"   In a news conference Thursday morning, Walz acknowledged it will take time for many Minnesota residents to feel safe enough to leave their homes without fear of apprehension by federal immigration agents.    \"It's going to be a long road,\" he said. \"Our sense of normalcy was shook to the core. The trauma that's been inflicted, certainly across an immigrant community, but to every single Minnesotan, is unlike anything we've witnessed.\"   \n   Walz said nothing has changed about the way Minnesota is addressing immigration enforcement. The state supports targeted enforcement, he said. When asked what has changed, Walz said border czar Tom Homan's arrival in Minnesota last week kicked off conversations with state and local officials.   Walz criticized other Trump administration officials, including Department of Homeland Security Secretary Kristi Noem and Greg Bovino, the Border Patrol commander who previously led operations on the ground in Minnesota, saying they had not engaged in talks — a move Walz characterized as \"arrogance.\"     Walz also said Homan's earlier remark that the two leaders disagree on a lot of things was \"an understatement.\"   The governor's take on today's announcement is that the Trump administration knew it needed to withdraw federal agents, particularly after the killings of Renee Macklin Good and Alex Pretti, \"but in very Trumpian fashion, they needed to save face,\" Walz said.   In January, federal immigration agents shot and killed Pretti and Macklin Good, two U.S. citizens. The Department of Justice's Civil Rights Division is investigating Pretti's death but not the killing of Macklin Good.   Homan notably did not mention the names of Pretti or Macklin Good during Thursday's news conference.   \"I don't want to see any more bloodshed,\" he said. \"I pray every night for the safety of our law enforcement personnel and the safety of those in the community, whether you're here legally or illegally. I don't want to see anybody harmed. If you break the law, we're going to arrest you.\"   Earlier this week, Walz suggested the end of the crackdown was imminent, following recent talks with White House officials.   On Feb. 4, Homan announced plans to withdraw 700 of the roughly 3,000 agents sent to Minnesota. Further reductions, he said then, would be contingent on more cooperation from local officials. That  included giving federal officials greater access to local jails to pick up undocumented people set to be released. In Thursday's briefing, Homan said those agreements have been strengthened.   \n   \"Under President Trump's direction, we have obtained an unprecedented level of coordination with law enforcement officials that is focused on promoting public safety across the entire state,\" he said. \"While I don't agree with Gov. Walz and Attorney General [Keith] Ellison on everything, I appreciate the support the governor gives the state agencies, who coordinate with us in a manner intended to promote public safety. And I appreciate the AG having an open dialogue with me.\"   Homan said a \"small footprint of personnel\" will remain to close out the operation and \"transition full command and control back to the field office.\" Homan will remain in Minneapolis to oversee the drawdown.    During his briefing Thursday, Homan spent several minutes defending the work of ICE agents and touting thousands of arrests of undocumented people he called criminals.  He reported a \"notable decrease\" in activity from what he called unlawful agitators.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump border czar Tom Homan announces Minnesota immigration surge is ending",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2407x1355+0+245/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F23%2F84%2F64ec55734b42a24e2cb53d54606f%2Fap26043511018917.jpg"
      ],
      "datePublished": "2026-02-12T17:41:35.000Z",
      "dateModified": "2026-02-12T17:41:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713307/trump-nfl-pardons",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3820x2149+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F63%2F41%2F9626d3f24a3b90df1d3c1694a5be%2Fap26043715315685-1.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:41:41.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks during an ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks during an event with Environmental Protection Agency director Lee Zeldin to announce the EPA will no longer regulate greenhouse gases, in the Roosevelt Room of the White House, Thursday, Feb. 12, 2026, in Washington.\n                \n                    Evan Vucci/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Evan Vucci/AP\n    \n\n   \n   WASHINGTON — President Donald Trump on Thursday pardoned five former professional football players — one posthumously — for various crimes ranging from perjury to drug trafficking.   The pardons were announced by White House pardon czar Alice Marie Johnson. Ex-NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon were granted the clemency.   \n   \"As football reminds us, excellence is built on grit, grace, and the courage to rise again. So is our nation,\" Johnson wrote on the social media site X, as she thanked Trump for his \"continued commitment to second chances.\"   Johnson said Dallas Cowboys owner Jerry Jones \"personally\" shared the news with Newton, who won three Super Bowls with the team.   The White House did not return a request for comment Thursday night on why Trump, an avid sports fan, pardoned the players.   \n   Klecko, a former star for the New York Jets, pleaded guilty to perjury after lying to a federal grand jury that was investigating insurance fraud. A defensive lineman, Klecko was inducted into the Pro Football Hall of Fame in 2023. He was a two-time Associated Press All-Pro player and a four-time Pro Bowler.   Newton, an offensive lineman, pleaded guilty to a federal drug trafficking charge after authorities discovered $10,000 in his pickup truck as well as 175 pounds of marijuana in an accompanying car driven by another man. Newton was a two-time All-Pro player and six-time Pro Bowler.   \n   Lewis, formerly of the Baltimore Ravens and the Cleveland Browns, pleaded guilty in a drug case in which he used a cellphone to try to set up a drug deal not long after he was a top pick in the 2000 NFL draft. Lewis, a running back, was named an All-Pro once and was a one-time Pro Bowler. He was named the 2003 AP Offensive Player of the Year.   Henry, who played for the Denver Broncos, pleaded guilty to conspiracy to traffic cocaine for financing a drug ring that moved the drug between Colorado and Montana. He was a running back for three teams and a one-time Pro Bowler.   \n   And Cannon — who played with the Houston Oilers, Oakland Raiders and Kansas City Chiefs — admitted to counterfeiting in the mid-1980s after a series of bad investments and debts left him broke.   \n   Cannon was a two-time All-Pro player and a two-time Pro Bowler. Cannon also won the 1959 Heisman Trophy while starring for Louisiana State University, where he had one of the most memorable plays in college football history: an 89-yard punt return for a touchdown against Ole Miss. He died in 2018.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3820x2149+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F63%2F41%2F9626d3f24a3b90df1d3c1694a5be%2Fap26043715315685-1.jpg"
      ],
      "datePublished": "2026-02-13T07:41:41.000Z",
      "dateModified": "2026-02-13T07:41:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE conducted 37 investigations into officer misconduct in last year",
    "url": "https://www.npr.org/2026/02/12/g-s1-109841/immigration-enforcement-investigations-misconduct",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F57%2F71%2Fb16886e24116a9e8b54ddec11bf8%2Fgettyimages-2260762407.jpg",
    "tag": "Politics",
    "date": "2026-02-12T20:38:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Acting Director of U.S. Immigration and ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Acting Director of U.S. Immigration and Customs Enforcement Todd Lyons testifies before a Senate Homeland Security and Governmental Affairs Committee on Feb. 12, 2026.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   In the last year, Immigration and Customs Enforcement conducted 37 investigations into officers' use of force, acting ICE Director Todd Lyons said during congressional testimony on Thursday.   Of those, 18 are closed and 19 are still pending or referred for further investigation, he said. Lyons did not say whether any investigations have resulted in terminations.   The investigations affect a tiny fraction of an ICE workforce. DHS has said they have been successful in nearly doubling their ranks in recent months to 22,000 people, not all of whom conduct arrests.   \n   Lyons' comments come after immigration officers shot and killed two U.S. citizens in Minneapolis last month, intensifying questions about immigration officers' tactics, training and use of force. It also raised further questions about the integrity of the department's internal oversight mechanisms.   Lyons shared the details about investigations during a Senate Homeland Security Committee hearing on Thursday featuring top immigration enforcement officials. GOP Sen. Rand Paul, Ky., called the hearing after federal immigration officers in Minneapolis killed 37-year-old Alex Pretti, a U.S. citizen.   The Department of Homeland Security rarely shares information about its internal misconduct investigations, though several have come to light in recent months.   \n   For example, ICE briefly put on administrative leave Victor Mojica in New York, who roughly pushed a woman in an immigration court hallway. Also put on administrative leave were Jonathan Ross, the ICE officer who shot U.S. citizen Renee Macklin Good, two Border Patrol agents involved in Pretti's shooting, and Border Patrol agent Charles Exum, who shot at U.S. citizen Mariamar Martinez.   Lyons' comments on investigations only concerned ICE; it is unclear how many Customs and Border Protection officers are under review for misconduct; lawmakers at the hearing didn't ask the commissioner of CBP, Rodney Scott, about his agency's investigations.   \n   Questions about training   Some of the agents involved in the recent incidents had been with their agencies for several years. But critics of surging enforcement have also raised concerns about the training provided for 12,000 new ICE employees.   In response to questions on the training timeline from Sen. Ruben Gallego, D-Ariz., on Thursday, Lyons said the curriculum at the federal law enforcement training center in Georgia was truncated from 75 days to 42 days for new recruits – and that there was instead a longer time for \"on-the-job training. He said that after the academy, agents get \"real-world training like when [a] local police officer comes out of the academy.\"   Lyons said it was possible that a new recruit could go from having never held a weapon to being on the ground in a state like Minnesota after those 42 days of training.   \n   He had previously said that those who are former law enforcement officers and special agents attended a shorter training module at the Federal Law Enforcement Training Center in Georgia, focused on just topics like the Immigration and Nationality Act. It's unclear how long that would be.   \"I am glad you're doing investigations, to be clear — but the fact that there are consistent mishandling of weapons, use of escalation of force that is above what is necessary, and there have not been any command decisions about how to fix — this is concerning,\" Gallego said in response to Lyons' comments.   \n   Questions about internal oversight   Critics of the administration, and former ICE personnel, have told NPR they worry the lack of transparency about DHS's disciplinary practices is further eroding trust in federal law enforcement.   The Department of Homeland Security has cut jobs in the oversight divisions focused on civil rights, as part of a broader reduction in force across the federal government. That includes jobs in the Office for Civil Rights and Civil Liberties, which could be involved in any investigation into fatal incidents.   \n   The administration has been quick to defend officers after violent incidents become public.   \n   Initially, for example, Trump administration officials labeled Good and Pretti as \"domestic terrorists,\" after they were shot by immigration officers.   A preliminary government review later contradicted the Trump administration's initial narrative about Pretti's shooting, as did multiple bystander videos and witness testimony.   DHS officials testifying in Congress notably declined to back up those early assertions from Homeland Security Secretary Kristi Noem, among others.   \"Any comments made publicly, privately, text, Instagram, is going to put a bias on the investigation,\" Lyons said on Thursday.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE conducted 37 investigations into officer misconduct in last year",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F57%2F71%2Fb16886e24116a9e8b54ddec11bf8%2Fgettyimages-2260762407.jpg"
      ],
      "datePublished": "2026-02-12T20:38:12.000Z",
      "dateModified": "2026-02-12T20:38:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For the first time, lawmakers are reviewing unredacted copies of the Epstein files",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5712359/for-the-first-time-lawmakers-are-reviewing-unredacted-copies-of-the-epstein-files",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-12T22:32:14.000Z",
    "description": "\n      \n      For the first time, lawmakers are reviewing unredacted copies of the Epstein files\n    \n            \n                \n                Tr",
    "body": "\n      \n      For the first time, lawmakers are reviewing unredacted copies of the Epstein files\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5712359/nx-s1-9647047\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Lawmakers are just beginning to review unredacted versions of the Epstein files but those who have read them say the system is complicated and insufficient.   \n\n    AILSA CHANG, HOST:  For the first time, lawmakers can review unredacted copies of the Justice Department's Epstein files to see what information has been withheld from versions that were released to the public. Maryland Democrat Jamie Raskin says what they've learned is that they have only scratched the surface.JAMIE RASKIN: The ones they're not releasing are the ones that are piquing my interest the most. And we've probably been able to look at less than 1% of them.CHANG: Lawmakers argue that the already difficult process of combing through the millions of files is now being hindered. Joining us now is NPR congressional correspondent Claudia Grisales, who's been following all of this. Hi, Claudia.CLAUDIA GRISALES, BYLINE: Hi, Ailsa.CHANG: OK, so I've been hearing lawmakers say that they've been under surveillance, basically, by the Justice Department when they're searching through all of these files, like they're being spied on. Can you explain? What is happening?GRISALES: Well, lawmakers are already facing an arcane process when they try to view these records. They have to set an appointment at the Justice Department to get a time slot. And there's only four terminals set up to search through the 3.5 million records released so far. And they can't take in any electronics or any staff. And yesterday, Attorney General Pam Bondi was carrying a binder at a House oversight hearing with a printed list of members who've conducted these searches and the specific documents that they looked at. I talked to New Mexico Democrat Teresa Leger Fernandez about this.TERESA LEGER FERNANDEZ: This is exactly why this whole process is flawed and a sham. And it is an outrage that they are spying on Congress.GRISALES: And she says DOJ should be investigating the Epstein case, not lawmakers who are looking through these documents in controlled searches. And she said when she did look at the files herself, she found names of men that should have been released long ago.CHANG: Interesting. OK, so even though there have been these roadblocks, do we know if these lawmakers are uncovering any new revelations?GRISALES: Yes, they have. The authors of the Epstein Transparency Act - this is Kentucky Republican Thomas Massie and California Democrat Ro Khanna - they've been a key part of forcing the release this week of names of men and co-conspirators that were redacted on some of these files. Ultimately, what a lot of these lawmakers want is what they've heard from the Epstein survivors and what they want, which is a release of the full list of men who they believe were part of this sex trafficking network - and accountability. Here's Vermont Democrat Becca Balint.BECCA BALINT: They really want us to help them change the culture, and we made that commitment to them. How long do we follow this? Until we feel like the work is in a good place. And we're nowhere near that right now.GRISALES: So it's clear they're playing a really big role here.CHANG: Yeah. OK, so then what are some of the other challenges that these lawmakers are facing as they're trying to review these files?GRISALES: Well, they passed a law requiring the release of these files nearly three months ago now. Lawmakers say this process has been riddled with pushback from President Trump and his administration. And until they change their posture or there are changes in leadership, people will not be held accountable. Here's North Carolina (ph) Republican Nancy Mace this morning speaking with our colleagues on Morning Edition.(SOUNDBITE OF ARCHIVED NPR CONTENT)NANCY MACE: And it's going to be up to us in a bipartisan manner in Congress to have the courage and the bravery to bring these people before America and let them answer for what actually happened.CHANG: OK, so what happens next, Claudia?GRISALES: Well, lawmakers say it's going to be an uphill process. It's going to take a lot of time. They're going to keep searching the records that have been released. But we know the Justice Department has not released 3 million records they say are duplicates, but lawmakers are not buying that. So we should expect them to put a lot more pressure on Attorney General Bondi, Trump and his administration to make sure everyone who should be held accountable is.CHANG: That is NPR's Claudia Grisales. Thank you, Claudia.GRISALES: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For the first time, lawmakers are reviewing unredacted copies of the Epstein files",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-12T22:32:14.000Z",
      "dateModified": "2026-02-12T22:32:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pam Bondi clashes with House Democrats at DOJ oversight hearing",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5711513/pam-bondi-clashes-with-house-democrats-at-doj-oversight-hearing",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-12T11:42:45.000Z",
    "description": "\n      Attorney General Pam Bondi clashed with Democratic lawmakers who questioned her about the Epstein files and the weaponization of the Justice De",
    "body": "\n      Attorney General Pam Bondi clashed with Democratic lawmakers who questioned her about the Epstein files and the weaponization of the Justice Department at an oversight hearing Wednesday.   \n\n    A MARTÍNEZ, HOST:  Attorney General Pam Bondi's appearance before Congress on Wednesday turned into a shouting match with lawmakers.STEVE INSKEEP, HOST:  The hearing, in theory, was going to focus on oversight of the Justice Department. Instead, Bondi insulted lawmakers and ducked questions about documents relating to convicted sex offender Jeffrey Epstein. In a moment, we'll speak with one of the Democratic lawmakers, Pramila Jayapal. First, we get the facts.MARTÍNEZ: NPR's Carrie Johnson followed the hearing. Carrie, I mean, even for Congress, this one was a doozy.CARRIE JOHNSON, BYLINE: Definitely not business as usual. There was a lot of hostility. Pam Bondi came into this House judiciary hearing prepared to attack Democrats on the panel when they tried to ask her about the messy rollout of the Epstein files and other controversies at the Justice Department. Congressman Jerry Nadler, a Democrat from New York, he wanted to know whether anyone else who worked with Jeffrey Epstein would be prosecuted. Here's a taste of how that went.(SOUNDBITE OF ARCHIVED RECORDING)PAM BONDI: I find it...JERRY NADLER: How many have you indicted?BONDI: Excuse me. I'm going to answer the question.NADLER: Answer my question.BONDI: No. I'm going to answer the question the way I want to answer the question.NADLER: No.BONDI: Your theatrics are ridiculous.NADLER: You're going to answer the question the way I asked it.BONDI: Chairman...JOHNSON: The congressman never got an answer about whether anyone else might be under investigation. And the attorney general called other lawmakers on the panel washed-up and bad lawyers, and on it went for hours.MARTÍNEZ: Yeah, it sure did. Several Epstein survivors, though, who had been trafficked by him were in the hearing room. Did the attorney general react to them or acknowledge them in any way?JOHNSON: At one point, Representative Pramila Jayapal of Washington asked Pam Bondi to turn around and apologize to some of the victims in the room for how they were treated by the Justice Department. In its release of some 3 million pages, some of those people's identities and nude images appeared in public on the DOJ website. Bondi responded by accusing the congresswoman who asked the question of engaging in gutter politics, and she also defended her record in law enforcement.(SOUNDBITE OF ARCHIVED RECORDING)BONDI: I have spent my entire career fighting for victims, and I will continue to do so. I am deeply sorry for what any victim - any victim - has been through, especially as a result of that monster.MARTÍNEZ: All right. What about Republicans on the panel when they had their chance to interact with the attorney general?JOHNSON: They asked Pam Bondi about the enormous drop in violent crime across the country. They praised the Trump administration for tough immigration enforcement, and they gave her some time to respond to some of the harsher questions from Democrats. The only Republican on the panel who pushed back on the attorney general is Thomas Massie of Kentucky. He sponsored that law to release the Epstein files, and he says the DOJ effort has been a massive failure because it seems like prosecutors continue to black out the names of men who behaved badly. Massie told the AG this is a cover-up that spans decades, and she's responsible for part of it.MARTÍNEZ: You know, the DOJ is really at the center of so many different controversies, including a lot of efforts to prosecute President Trump's political foes. I'm wondering if that came up at all in the hearing.JOHNSON: It really did. Congressman Jamie Raskin, a Democrat from Maryland, he sees a pattern here. Here's Raskin at the hearing.(SOUNDBITE OF ARCHIVED RECORDING)JAMIE RASKIN: You've turned the people's Department of Justice into Trump's instrument of revenge. Trump orders up prosecutions like pizza, and you deliver every time.JOHNSON: Remember, just this week, prosecutors tried and failed to get a grand jury to indict Democratic lawmakers who made a video telling American service members to follow their oaths and the law. DOJ has also brought cases against the former FBI director Jim Comey and New York Attorney General Tish James. Both those cases have been dismissed, but DOJ continues to investigate Trump's perceived political foes.MARTÍNEZ: That's NPR's Carrie Johnson. Carrie, thanks.JOHNSON: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pam Bondi clashes with House Democrats at DOJ oversight hearing",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-12T11:42:45.000Z",
      "dateModified": "2026-02-12T11:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]