[
  {
    "title": "White House downplays new Epstein emails that mention Trump",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605582/epstein-files-release-trump-email-grijalva-massie",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5751x3235+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F84%2F685306ef458596cafbdda271be02%2Fgettyimages-1178185854.jpg",
    "tag": "Politics",
    "date": "2025-11-12T13:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump's name appears in convic",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump's name appears in convicted sex offender Jeffrey Epstein's correspondence released Wednesday by Democrats on the House Oversight Committee.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   Democrats on the House Oversight Committee released three new emails Wednesday morning from the estate of convicted sex offender Jeffrey Epstein that mention President Trump, raising new questions about the extent of their relationship.    Republicans on the House Oversight Committee later Wednesday released the latest set of more than 20,000 documents that include emails from Epstein frequently expressing displeasure with Trump and his presidency, financial market reports and court documents from Epstein's cases.   \"The more Donald Trump tries to cover-up the Epstein files, the more we uncover,\" Oversight Ranking Member Rep. Robert Garcia, D-Calif. said in a statement. \"These latest emails and correspondence raise glaring questions about what else the White House is hiding and the nature of the relationship between Epstein and the President.\"   \n   In one 2015 email between Epstein and author Michael Wolff, the pair discuss a potential question from an upcoming CNN appearance about Trump and Epstein's personal ties.   \"I think you should let him hang himself,\" Wolff wrote. \"If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.\"   \n   Another email Epstein sent in 2011 to Ghislaine Maxwell, his associate who has been convicted on trafficking charges, called Trump the \"dog that hasn't barked\" and says Trump spent \"hours at my house\" with one of the alleged sex trafficking victims.   Still another is a 2019 message between Epstein and Wolff in which the disgraced financier wrote that \"of course [Trump] knew about the girls as he asked Ghislaine to stop.\" The email does not elaborate any further.   \"I have met some very bad people, none as bad as Trump,\" Epstein wrote in 2017 to former Treasury Secretary Lawrence Summers. \"Not one decent cell in his body.\"    On Wednesday, White House Press Secretary Karoline Leavitt sent a statement to NPR that said in part \"the Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump.\"   \"These stories are nothing more than bad-faith efforts to distract from President Trump's historic accomplishments, and any American with common sense sees right through this hoax and clear distraction from the government opening back up again,\" Leavitt wrote.   \n   During a press briefing, Leavitt reiterated that the emails \"prove absolutely nothing other than the fact that President Trump did nothing wrong\" and said the administration \"has done more with respect to transparency when it comes to Jeffrey Epstein than any administration ever.\"   In September, House Democrats released more than 200 pages of a birthday book for Epstein created more than two decades ago that includes a lewd drawing and letter that appears to be signed by Trump.    The president, who has consistently denied any meaningful connection to Epstein, called the drawing and signature \"fake.\"    Trump has been criticized for paying little heed to his own supporters who have called for a full release of files kept on Epstein and his alleged crimes, before and after he died by suicide in 2019 while in federal custody.   In July, Trump  told reporters that he and Epstein fell out because Epstein hired away young female employees who worked at the spa at Mar-a-Lago.   The release timed with House votes   The latest Epstein files revelation comes as the House returns to session for votes that could reopen the federal government after the longest shutdown in U.S. history.    House Democrats and four Republicans have been pushing for a vote to release additional files related to the Epstein case since before the government shutdown began in October.    But House Speaker Mike Johnson was able to delay the vote by keeping the chamber out for seven weeks, and most recently by refusing to swear in Democratic Rep. Adelita Grijalva of Arizona. Grijalva is expected to be sworn in on Wednesday afternoon.   Critics on both sides of the aisle viewed Johnson's refusal as a means of avoiding the vote to direct the Department of Justice to release the Epstein documents.   On the campaign trail, Grijalva, who won a special election Sept. 23, promised to sign onto the bipartisan petition spearheaded by Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., to force a House vote on the Epstein matter. Grijalva's signature marked the 218th one needed to force a vote on the matter.   \n   The Epstein files continue to be a political thorn in the president's side, after Trump campaigned on releasing the documents as part of a broader message painting his candidacy as a way to expose powerful people hiding the truth.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House downplays new Epstein emails that mention Trump",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5751x3235+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F84%2F685306ef458596cafbdda271be02%2Fgettyimages-1178185854.jpg"
      ],
      "datePublished": "2025-11-12T13:30:00.000Z",
      "dateModified": "2025-11-12T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House votes to end the longest shutdown in history",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5607044/house-votes-to-end-the-longest-shutdown-in-history",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T21:41:52.000Z",
    "description": "\n      The House has voted on a bill to end the government shutdown after 43 days. President Trump is expected to sign the bill on Wednesday night, pa",
    "body": "\n      The House has voted on a bill to end the government shutdown after 43 days. President Trump is expected to sign the bill on Wednesday night, paving the way for many federal workers to return to work.   \n\n    AILSA CHANG, HOST:  The House has passed legislation to reopen the government. The bill passed the Senate earlier this week, and President Trump is expected to sign the bill tonight, ending the longest government shutdown in U.S. history. NPR congressional correspondent Deirdre Walsh has been following this bill and what comes next and joins us now. Hi, Deirdre.DEIRDRE WALSH, BYLINE: Hey, Ailsa.CHANG: All right, so after 43 days, Congress has a deal to reopen the government. What is in this deal, exactly?WALSH: Well, this bill funds most federal agencies through the end of January. It also includes three spending bills that were negotiated between both parties, and those include a full year's funding for some agencies like the Veterans Administration, money for food assistance programs. This also includes a provision to reverse the layoffs that the Trump administration put into place since the start of the shutdown. But one thing it does not include is anything to deal with the central issue that caused the shutdown - the demand from Democrats to extend health care subsidies that are expiring at the end of this year.CHANG: Right, and we know that most Senate Democrats did not like this deal because it did not address health care subsidies. So how are House Democrats feeling?WALSH: They're not happy about it either. I mean, many House Democrats coming out of a caucus meeting this morning pointed to results just last week of off-year elections. Democratic candidates won a pair of governor's races, also won some local elections, and they say voters backed the shutdown strategy and thought that Democrats had more leverage to force action on health care. California Democratic Congressman Ro Khanna just ripped the compromise.(SOUNDBITE OF ARCHIVED RECORDING)RO KHANNA: I think the American people got a raw deal. Twenty million Americans are going to see their premiums skyrocket. I don't think they like the fact that we didn't fight hard enough.CHANG: Well, health care subsidies, Deirdre, are expiring at the end of December, so is Congress going to do anything before then?WALSH: It's not a lot of time. I mean, Senate Majority...CHANG: Yeah.WALSH: ...Leader John Thune agreed to hold a vote by mid-December on legislation that Democrats are working on. But that's just a couple of weeks before those tax credits expire. There are some Senate Republicans who want to address the issue, but there's no agreement on any details - how long the subsidies would be extended, if they're going to cap them by income level. The Senate Democrats who negotiated this deal say President Trump is really under pressure to engage. They say, you know, more people in red states that backed Trump rely on these subsidies than people in blue states.CHANG: OK, but that's the Senate side. What about the House side?WALSH: I mean, House Speaker Mike Johnson hasn't committed to any health care vote in the House, even if the Senate passes something. You know, Democrats believe that rising premiums that people are expected to see very soon get at the heart of cost of living concerns that were front and center in those elections last week. They believe this is something that will resonate in the 2026 midterms. We saw House Democratic Leader Hakeem Jeffries hold a rally on the east front of the Capitol earlier today. He vowed to make this an issue.(SOUNDBITE OF ARCHIVED RECORDING)HAKEEM JEFFRIES: House Democrats will continue the fight to address the Republican health care crisis, and House Democrats will fight to extend the Affordable Care Act tax credits. This fight is not over. We're just getting started.(APPLAUSE)CHANG: OK, that fight isn't over, but assuming the president signs this bill quickly, do you have any idea how long it might take for government services to resume and for workers to see their paychecks again?WALSH: Well, under the law, federal workers are entitled to back pay, and the guidance is that they should return to work as soon as possible when the bill's signed, and they'll get paid as soon as possible. One thing that we may see as a little bit of a leftover from the shutdown is airport delays due to staffing shortages. The secretary of transportation says they're going to evaluate the restrictions when they look at staffing levels getting back to normal.CHANG: That is NPR's Deirdre Walsh. Thank you, Deirdre.WALSH: Thanks, Ailsa.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House votes to end the longest shutdown in history",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T21:41:52.000Z",
      "dateModified": "2025-11-12T21:41:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The longest government shutdown in U.S. history comes to a close",
    "url": "https://www.npr.org/2025/11/12/g-s1-97607/house-vote-shutdown-end",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbd%2F7b%2Fa09056ee4412aa1ce956093f61f3%2Fgettyimages-2245873235.jpg",
    "tag": "Politics",
    "date": "2025-11-13T01:22:34.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump shows the signed ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump shows the signed bill package to re-open the federal government in the Oval Office of the White House in Washington, DC, on November 12, 2025.\n                \n                    BRENDAN SMIALOWSKI/AFP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        BRENDAN SMIALOWSKI/AFP\n    \n\n   \n   President Trump has signed a bill to fund the government, bringing a close to the longest government shutdown in history, one that saw millions of Americans affected and ended with little political gain.   The bill passed Wednesday night despite Republicans' narrow margin in the House. Six Democrats joined their Republican colleagues to get the bill over the finish line 43 days after the shutdown began: Reps. Henry Cuellar of Texas, Don Davis of North Carolina, Adam Gray of California, Jared Golden of Maine, Marie Gluesenkamp Perez of Washington, and Tom Suozzi of New York.   Two Republicans -- Reps. Thomas Massie of Kentucky and Greg Steube of Florida -- voted no. The final vote was 222 to 209.   \n   President Trump signed the bill shortly after the House vote. Trump blamed Democrats for the shutdown at the signing event in the Oval Office.    \"This was an easy extension but they didn't want to do it the easy way,\" Trump said. \"They wanted to do it the hard way.\"   In addition to extending last year's spending levels through the end of January for most of the government, the bill provides funding for some agencies through the end of next September, including payments for the Supplemental Nutrition Assistance Program (SNAP). The program, which provides food aid to nearly 1 in 8 Americans, has been mired in a court battle because of the shutdown.   The bill includes a measure to reverse layoffs the Trump administration imposed during the shutdown, provides backpay for federal employees, and institutes protections against further layoffs.   But the central issue underlying the entire shutdown — extensions on enhanced Affordable Care Act subsidies that expire at the end of the year — is not addressed in the bill.   Instead, as part of the deal reached with a bipartisan contingent of senators, Senate Majority Leader John Thune, R-S.D., agreed to hold a vote in mid-December on Democrat-drafted legislation aimed at extending those subsidies.   \n   That doesn't sit well with many Senate Democrats, who remain wary of the pledge.   \"A handshake deal with my Republican colleagues to reopen the government and no guarantee to actually lower costs is simply not good enough,\" said Sen. Tammy Baldwin, D-Wisc., who voted against the measure.   Even if a December bill addressing the expiring subsidies passes the Senate, it would need to go to the House. Speaker Mike Johnson, R-La., has not made a guarantee to bring such a bill to the floor for a vote.   A lot of pain, not a lot of gain   Government shutdowns historically have not been effective tools for advancing a party's policy goals. The last six weeks proved that to be the rule, not an exception.   The decision by Senate Democrats not to fund the government before Oct. 1 was fueled, at least in part, by demands from the Democrats' political base to be a strong opposition party. The party homed in on a promise that they would not fund the government unless Republicans agreed to extend subsidies for people who buy health care through the Affordable Care Act marketplace.   The decision came after key Democrats, including Senate Minority Leader Chuck Schumer, voted alongside Republicans to avoid a shutdown in March. The result was a furious Democratic base, who demanded the minority party exert what little leverage it has to force a negotiation with Republicans in exchange for their votes to fund the government.   With an eye toward the expiring subsidies and resulting skyrocketing premiums, Senate Democrats stood firm during the October shutdown, hoping their resolve, paired with the devastating impacts of the shutdown on millions of Americans, would bring Republicans to the negotiating table.   But the strategy ultimately didn't work. Republicans didn't budge and continued to hold regular votes to fund the government.   \n   In the meantime, 42 million Americans who participate with SNAP didn't receive the food aid they rely on. Air traffic controllers and most Transportation Security Administration employees had to remain on the job without pay, leading to the Federal Aviation Administration's order to scale back flights. Millions of federal workers went without pay.   The group of seven Democrats and one independent senator who voted to end the shutdown acknowledged that waiting longer wouldn't bring about a different result.   \"There was no guarantee that waiting would get us a better result, but there was a guarantee that waiting would impose suffering on more everyday people,\" Sen. Tim Kaine, D-Va., told NPR.   The result is an end to a shutdown that does not address the core demand from Democrats on the subsidies. Instead they are left to defend the kind of handshake agreement that they once said was insufficient.   Thune's ultimate deal with Democrats aligns with his repeated statements throughout the shutdown that Republicans would be open to negotiating on the expiring subsidies only after the government was funded, not before.   Rep. Jared Golden, D-Maine, one of the six Democrats who voted for the bill in the House, said there is still an opportunity to address health care.   \"Congress still has a window to pass bipartisan legislation to extend the ACA premium tax credits,\" Golden said in a statement. \"In September, I joined a bipartisan coalition in the House to put forth legislation to extend the credits for one year and now, with the shutdown now over, I urge members of both parties who care about affordable health care to come back to the table so we can get the job done.\"   Another factor that didn't go Democrats' way is the president himself. President Trump has been known at times to upend Congressional Republicans' game plan. But he took a step back during the shutdown and let Thune drive the GOP strategy. He didn't take the bait from Democrats who repeatedly asked where Trump \"the great negotiator\" was in the discussions.   \n   What happens now?    Both parties have significant choices ahead that could lay the groundwork for their political successes and headaches through next year.   Senate Democrats have about a month to craft a bill that addresses the expiring ACA subsidies in a way that brings enough Republicans on board for passage.   If they're successful at getting an extension, Democrats will be able to start 2026 with a policy victory in hand that will shape their messaging going into the midterm elections. If Republicans don't support it, Democrats still have what they see as a winning issue — health care — to run on next year.   Some Republicans have shown interest in addressing the subsidies, but want to institute reforms like fraud prevention and income caps.   And both parties have to contend with the fact that the government is only funded for a few months. Congress will still have to pass nine other appropriations bills before the continuing resolution ends.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The longest government shutdown in U.S. history comes to a close",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fbd%2F7b%2Fa09056ee4412aa1ce956093f61f3%2Fgettyimages-2245873235.jpg"
      ],
      "datePublished": "2025-11-13T01:22:34.000Z",
      "dateModified": "2025-11-13T01:22:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Immigrants with obesity, diabetes and other health problems may be denied visas",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606348/immigrants-visas-health-conditions-trump-guidance",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1013x570+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2F3a%2F51f05f2d450dbc2ebfd9e24d31cd%2Fgettyimages-1224917096.jpg",
    "tag": "Politics",
    "date": "2025-11-12T14:46:54.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Trump administration is directing im",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Trump administration is directing immigration officers to consider some chronic health conditions like diabetes in deciding whether to issue visas to immigrants.\n                \n                    CHRIS DELMAS/AFP/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        CHRIS DELMAS/AFP/Getty Images\n    \n\n   \n   Foreigners seeking visas to live in the U.S. might be rejected if they have certain medical conditions, including diabetes or obesity, under a directive issued last week by the Trump administration.   The guidance, issued in a cable the State Department sent to embassy and consular officials and examined by KFF Health News, directs visa officers to deem applicants ineligible to enter the U.S. for several new reasons, including age or the likelihood they might rely on public benefits.   The guidance says that such people could become a \"public charge\" — a potential drain on U.S. resources — because of their health issues or age.   \n   While assessing the health of potential immigrants has been part of the visa application process for years, including screening for communicable diseases such as tuberculosis and obtaining vaccine history, experts said the new guidelines greatly expand the list of medical conditions to be considered and give visa officers more power to make decisions about immigration based on an applicant's health status.   The directive is part of the Trump administration's divisive and aggressive campaign to deport immigrants living without authorization in the U.S. and dissuade others from immigrating into the country. The White House's crusade to push out immigrants has included daily mass arrests, bans on refugees from certain countries, and plans to severely restrict the total number permitted into the U.S.   The new guidelines mandate that immigrants' health be a focus in the application process. The guidance applies to nearly all visa applicants but is likely to be used only in cases in which people seek to permanently reside in the U.S., said Charles Wheeler, a senior attorney for the Catholic Legal Immigration Network, a nonprofit legal aid group.   \"You must consider an applicant's health,\" the cable reads. \"Certain medical conditions – including, but not limited to, cardiovascular diseases, respiratory diseases, cancers, diabetes, metabolic diseases, neurological diseases, and mental health conditions – can require hundreds of thousands of dollars' worth of care.\"   \n   About 10% of the world's population has diabetes. Cardiovascular diseases are also common; they are the globe's leading killer.   The cable also encourages visa officers to consider other conditions, such as obesity, which it notes can cause asthma, sleep apnea, and high blood pressure, in their assessment of whether an immigrant could become a public charge and therefore should be denied entry into the U.S.   \"All of these can require expensive, long-term care,\" the cable reads. Spokespeople for the State Department did not immediately respond to a request for comment on the cable.   Visa officers were also directed to determine if applicants have the means to pay for medical treatment without help from the U.S. government.   \"Does the applicant have adequate financial resources to cover the costs of such care over his entire expected lifespan without seeking public cash assistance or long-term institutionalization at government expense?\" the cable reads.   The cable's language appears at odds with the Foreign Affairs Manual, the State Department's own handbook, which says that visa officers cannot reject an application based on \"what if\" scenarios, Wheeler said.   The guidance directs visa officers to develop \"their own thoughts about what could lead to some sort of medical emergency or sort of medical costs in the future,\" he said. \"That's troubling because they're not medically trained, they have no experience in this area, and they shouldn't be making projections based on their own personal knowledge or bias.\"   The guidance also directs visa officers to consider the health of family members, including children or older parents.   \"Do any of the dependents have disabilities, chronic medical conditions, or other special needs and require care such that the applicant cannot maintain employment?\" the cable asks.   Immigrants already undergo a medical exam by a physician who's been approved by a U.S. embassy.   \n   They are screened for communicable diseases, such as tuberculosis, and asked to fill out a form that asks them to disclose any history of drug or alcohol use, mental health conditions, or violence. They're also required to have a number of vaccinations to guard against infectious diseases like measles, polio, and hepatitis B.   But the new guidance goes further, emphasizing that chronic diseases should be considered, said Sophia Genovese, an immigration lawyer at Georgetown University. She also noted that the language of the directive encourages visa officers and the doctors who examine people seeking to immigrate to speculate on the cost of applicants' medical care and their ability to get employment in the U.S., considering their medical history.   \"Taking into consideration one's diabetic history or heart health history — that's quite expansive,\" Genovese said. \"There is a degree of this assessment already, just not quite as expansive as opining over, 'What if someone goes into diabetic shock?' If this change is going to happen immediately, that's obviously going to cause a myriad of issues when people are going into their consular interviews.\"   KFF Health News is a national newsroom that produces in-depth journalism about health issues and is one of the core operating programs at KFF.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Immigrants with obesity, diabetes and other health problems may be denied visas",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1013x570+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2F3a%2F51f05f2d450dbc2ebfd9e24d31cd%2Fgettyimages-1224917096.jpg"
      ],
      "datePublished": "2025-11-12T14:46:54.000Z",
      "dateModified": "2025-11-12T14:46:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606050/rep-katherine-clark-d-mass-talks-about-upcoming-vote-to-reopen-the-government",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:12.000Z",
    "description": "\n      NPR's Steve Inskeep speaks with House Democratic Whip Katherine Clark of Massachusetts about the pending vote on a measure to end the governmen",
    "body": "\n      NPR's Steve Inskeep speaks with House Democratic Whip Katherine Clark of Massachusetts about the pending vote on a measure to end the government shutdown.   \n\n    STEVE INSKEEP, HOST:  Now let's go to the House Democratic whip, the minority whip, Katherine Clark, the No. 2 Democrat in the House. Welcome back to the program.KATHERINE CLARK: Oh, good morning, Steve.INSKEEP: Quite a debate. But first, do you assume this measure is going to pass the House today?CLARK: I do. I think that we have seen Republicans consolidate time and time again. When Donald Trump asked them to do something, they do it. And they have shown in the House, they weren't even willing to come to work for over 50 days in order to avoid any negotiation around health care, any discussion about how we can make life easier and less expensive for the American people. So I fully assume they are going to fall in line and vote yes as a block and pass this today.INSKEEP: OK. Well, let's talk now about this debate within the Democratic Party about what happened and what you do now. We had earlier on today Josh Barro, longtime journalist, who made the case that Democrats may have actually gained here, even though they gave up and they lost in the end. You made your point. The president's approval declined. Now you move on. Is there anything to that argument?CLARK: I think it is not just moving on. It is continuing this fight. Listen, our point has been from the beginning of this president's term that he should hold true to his promise. He promised he'd lower costs on Day 1. And everything that they have done - everything the House and Senate GOP and this president have done has made life harder and more expensive. The entire system doesn't work for people, and the Republicans are hell-bent on rigging it further against them and in favor of the very wealthy in this country.So whatever frustration and disappointment we had last week, we don't have time to dwell there. We have to unite and keep this fight up. The American people who are facing a cliff on whether they will be able to afford and keep health insurance for themselves and their families are depending on us to act as the fighters that we have proven to be.INSKEEP: Well, let's figure that out because the Senate has promised to vote on extending these Obamacare subsidies, which are effective for millions of people. The House leadership, Mike Johnson, has not promised a vote. Do you have any means to compel a vote, or do you have reason to think that enough Republicans will want to vote that you're going to get one?CLARK: Listen, we're going to use every tool that we have, and we are keeping close track of those Republicans who are trying to have it both ways, say, oh, I am really concerned about people's health care. And I hope that, you know, we can do something about that and prevent the misery and the anxiety that they are inflicting on the American people. So let's do it.I would start by rejecting this budget and its extreme attacks on people's ability to be able to afford and access health care. But we will have another chance in December when the Senate votes again. What is your response going to be? I think what we have done is expose that the Republicans don't have a plan except to further enrich the very wealthiest of Americans. And so put your cards on the table, and that will start today with the vote that we are going to take in the House.INSKEEP: OK. So you're challenging them to come up with a plan or to vote for yours. But let me ask about the underlying issue here. The reason that Democrats extended Obamacare subsidies, expanded them in 2021, the reason you want them back now is because health care costs have continued to increase over time. We discussed this with Mike Lawler, a Republican, in the other hour of the program, and he pointed out correctly that Obamacare was supposed to bring down, bend the curve on costs. It was supposed to lower costs, as well as covering more people. That seems not to have happened. Would you agree there's a fundamental problem in that costs keep going up and up, and you keep having to subsidize them more?CLARK: Oh, I would certainly agree that we have a fundamental problem with the delivery of health care in this country. It is too expensive for people. But I would ask Mike Lawler and the other House Republicans, where have they been? Instead of coming together and working with us, they have had one plan for health care. They have voted to repeal the ACA over 70 times. And since they took the power - they have the majority in the House, the Senate, and they control the White House - their only plan for health care is to shift the cost burden even more onto hardworking Americans - cuts to Medicaid, cuts to the ACA, cuts to Medicare, cuts to medical research and the promise of future interventions for people who are looking for a cure. So spare me this, you know, oh, we wish we could come together. We've been waiting since 2017 for them to deliver a plan. Their only plan is to shift costs to the American people who are just trying to get by.INSKEEP: Katherine Clark is the No. 2 Democrat in the House of Representatives. Always a pleasure talking with you. Thank you so much.CLARK: Thank you, Steve.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:12.000Z",
      "dateModified": "2025-11-12T11:59:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605565/rep-mike-lawler-r-n-y-talks-about-upcoming-house-vote-to-end-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:21.000Z",
    "description": "\n      NPR's Steve Inskeep speaks with Republican Congressman Mike Lawler of New York about the imminent House vote on a deal to end the longest shutd",
    "body": "\n      NPR's Steve Inskeep speaks with Republican Congressman Mike Lawler of New York about the imminent House vote on a deal to end the longest shutdown in U.S. history.   \n\n    STEVE INSKEEP, HOST:  Let's hear a Republican view of all this. Congressman Mike Lawler represents a good part of upstate New York, suburbs of New York City. Congressman, welcome back.MIKE LAWLER: Good morning. Thanks for having me.INSKEEP: Glad you're with us. Do you assume this is going to pass the House today?LAWLER: It will, and there'll even be a few Democrats to vote for it, so it will be bipartisan. But this is, you know, 42 days overdue. It never should've happened. Chuck Schumer chose to shut the government down for his own political purpose, trying to appease a far-left radical base that wants him and Senate Democrats to fight back against President Trump. At the end of the day, that's what this was always about. It was not about health care. It was not about any specific policy issue. It was about, quote-unquote, \"fighting back against Trump.\" And...INSKEEP: I think there's been a lot of analysis to that effect that this was part of the Democrats' calculus. They felt they needed to fight. But there was this substantive issue on the table having to do with Obamacare subsidies. And assuming this passes today in the House, you move on, the Senate is going to at least vote on extending subsidies for Obamacare. House Speaker Mike Johnson is not guaranteed a vote in the House, though. Do you believe the House should vote on those subsidies?LAWLER: I do. I've been a co-lead on a bill since the beginning of September to extend the ACA subsidies by one year. Remember, these were put in place during COVID to help ease the pressure on families in the middle of a health pandemic. These subsidies go directly to the insurance companies. And so the question really is, is the federal government paying 78% of the premium or 88% of the premium? That's what the fight is over right now. I'm supportive of extending it by a year, but it really requires a larger discussion, which is, how do we actually make health care affordable? Because if you look at premiums since Obamacare took effect, 96% increase in the private insurance market since Obamacare took effect, and 114 to 125% increase in the Obamacare market since it took effect in 2010. That is unsustainable. It is not affordable, and it is something that we have to address long-term. So there's the short-term issue of the subsidy.INSKEEP: Yeah.LAWLER: There's the longer term issue of how we actually reduce health care costs in America.INSKEEP: I guess we should note this is a Republican argument here. Obamacare was about extending health care to more people, but it was also supposed to be about bending the curve, as they said, bringing down costs over time. I think you're saying that part of it didn't work.LAWLER: No question. And again, I think this is incumbent on all of us - Republicans and Democrats - to work together to address this. Everybody should be able to acknowledge that health care is not affordable. And if it's not affordable, that means that what was done did not work. And so the question is, how do we fix it? How do we actually make progress on improving upon the current situation? I'm not advocating for repeal and replace. I'm saying, let's look at this. Let's fix it. This is a problem for the American people.INSKEEP: I want to ask about another issue, Congressman, because you live in suburban New York, and I - I'm thinking about that area. And you must have a lot of constituents who might like to live in New York City, but they could never afford to live there. And New York City has now elected a mayor who says, I'm going to hold down the rent. I'm going to hold down costs and expenses, and that seems to have been a big factor in elections across the country last Tuesday. And President Trump is talking about it now, saying that maybe people should have 50-year mortgages so they can have a slightly lower mortgage payment. What do you make of all that, and what do you think that people should be focused on?LAWLER: Look, affordability is the No. 1 issue. It always has been. As James Carville famously said, it's the economy, stupid. If people cannot afford where they live, if they cannot afford to put food on the table, then other issues result. And so, to me, that has to be the focus. I believe housing is a major crisis in this country. We're about 8 million units underbuilt nationwide. It's basic supply and demand. Health care costs obviously are a major challenge. Grocery bills are coming down but still a challenge. And so the question is, how do we tackle this issue? You look at New York City and the irony of Zohran Mamdani claiming there's an affordability crisis, Democrats have controlled New York City for well over a decade. They've controlled New York State for well over two decades now, and you look at the challenges facing the state and the city. They've increased, for instance, state spending by $100 billion in 10 years. That creates the challenge of unaffordability. And so the question is, how do you deal with these issues...INSKEEP: I want to focus - yeah. Yeah. In a few seconds, I just want to focus on the housing part of this. I can accept the argument that rent control hasn't worked very well for decades in New York. I'm not sure this 50-year mortgage really helps people's mortgage payments that much, but you talked about supply. Is there something you can do to increase the housing supply?LAWLER: No question. I've introduced a bill to revitalize America's housing market. It's 208 pages, 39 provisions. The objective is to actually lessen the regulatory burden on housing, construction and financing, making sure that we are opening up our capital markets to contractors and investors. There's key components to ease up, for instance, regulations on manufactured housing. In the most recent tax bill, we increased the low-income housing tax credit, which will help build a million units of housing over the next decade. I have a bill...INSKEEP: OK. We'll keep following that. I'm afraid we got to stop it there, but Congressman Mike Lawler of New York, thanks so much. It's a pleasure talking with you.LAWLER: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:21.000Z",
      "dateModified": "2025-11-12T11:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House set to vote on bill to end the longest shutdown as Democrats remain divided",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605559/house-set-to-vote-on-bill-to-end-the-longest-shutdown-as-democrats-remain-divided",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:28.000Z",
    "description": "House set to vote on bill to end the longest shutdown as Democrats remain divided   The House may vote as early as Wednesday afternoon on a measure th",
    "body": "House set to vote on bill to end the longest shutdown as Democrats remain divided   The House may vote as early as Wednesday afternoon on a measure that will end the longest government shutdown in U.S. history, but Democrats remain deeply divided about whether to support it.\n\n    \n        Politics\n    \n\n\n      \n                  \n            November 12, 20256:59 AM ET\n         \n      \n   \n                                                            ,                \n            \n\n\n      \n      House set to vote on bill to end the longest shutdown as Democrats remain divided\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5605559/nx-s1-9530122\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      The House may vote as early as Wednesday afternoon on a measure that will end the longest government shutdown in U.S. history, but Democrats remain deeply divided about whether to support it.   \n\n\n    A MARTÍNEZ, HOST:  Today, the House returns to take up legislation that would end the longest government shutdown in U.S. history. In a moment, we'll hear from Republican Congressman Mike Lawler.STEVE INSKEEP, HOST:  We have also been hearing from Democrats, many of whom are upset with this deal and the handful of their Senate colleagues who voted for it.MARTÍNEZ: NPR congressional correspondent Claudia Grisales has been following this - what? - 43 days of a shutdown. Is this the end? Is this over with now?CLAUDIA GRISALES, BYLINE: It truly could be. House lawmakers will be back in town today for the first time since House Speaker Mike Johnson let them go home in September before the shutdown even began. The House Rules Committee met for more than seven hours last night. And they moved this bill to the floor just a few hours ago, and that sets the stage for a final vote later tonight. And as you recall, this deal came together after a group of Senate Democrats broke ranks to vote with Republicans to end the government shutdown, and they sent this bill to the House. Now, the package includes a stopgap measure to fund the government at least through the end of January, with full-year appropriations plans funding some of those federal agencies and services.MARTÍNEZ: The thing is that Senate deal does not include anything about extending the health care subsidies that Democrats were dug in on. So what did they get instead?GRISALES: Right. Exactly. That was a key demand from Democrats, and this deal doesn't address that. Instead, they secured a promise for a vote in December on health care and a commitment to negotiate a plan to address those subsidies. Those who broke with the party in the Senate said they got the best deal possible. And that includes those full-year appropriations plans, which were negotiated between the parties over several months. Meanwhile, other Senate Democrats who voted no argued they weren't making good to reopen the government in exchange for addressing these expiring Affordable Care Act subsidies. That's spiking premiums.So those who are upset - it carries over to the House. And the fury is only worse there, where we expect most Democrats to vote no on this plan. Several progressives, for example, have called for Senate Minority Leader Chuck Schumer to be ousted from his leadership role, even as he voted no on the plan. And last night, House Minority Leader Hakeem Jeffries dodged a question on this with reporters in terms of Schumer's role. And so a reminder the party's really struggling to reconcile the various factions around this deal.MARTÍNEZ: Claudia, the promise to vote...GRISALES: Yeah.MARTÍNEZ: ...In December on the Affordable Care Act subsidies - what might come out of that?GRISALES: Well, we could see a deal come out of that, possibly, but it's a very tall order. It's going to be a really difficult negotiation for Congress, especially in these ultrapartisan times. And we already know that Republicans have demands on ACA reforms that many Democrats won't be able to stomach, such as installing new restrictions for care related to abortions. And even if it can pass the Senate, it's not clear Speaker Mike Johnson will bring it up for a vote in the House. But we do know Democrats have warned, if Republicans do not hold up their end of the deal and negotiate a plan to extend these subsidies, they will hold Republicans' feet to the fire when most of the government's funding ends January 30 under this current plan. So it could be something we're still talking about come next year and into the midterm elections.MARTÍNEZ: And we'll be here for all of it. That's NPR's Claudia Grisales. Thanks a lot.GRISALES: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House set to vote on bill to end the longest shutdown as Democrats remain divided",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:28.000Z",
      "dateModified": "2025-11-12T11:59:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "3 questions about Trump's 50-year mortgage plan",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5604384/50-year-mortgage-trump-housing-explainer",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4c%2F46%2Fe77a6cf44678a59a8e50036d0a98%2Fgettyimages-1468619453.jpg",
    "tag": "Politics",
    "date": "2025-11-12T23:22:08.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A For Sale sign displayed in front of a ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A For Sale sign displayed in front of a home in 2023 in Miami, Fla. Trump administration officials are proposing a 50-year mortgage option.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   Most people who take out mortgages go with a 30-year term. But President Trump wants the federal government to back a 50-year mortgage option for homebuyers — a plan that would be \"a complete game changer,\" according to Federal Housing Finance Agency Director Bill Pulte.   Backers of the idea say it could help more prospective buyers get into a home they might not otherwise afford. But skepticism abounds, with Fox News' Laura Ingraham telling Trump this week that the proposal \"has enraged your MAGA friends.\"   Ingraham cited \"significant MAGA backlash, calling it a giveaway to the banks and simply prolonging the time it would take for Americans to own a home outright.\"   \n   Trump said the criticism is overblown: \"All it means is you pay less per month, you pay it over a longer period of time. It's not like a big factor. It might help a little bit.\"   The proposal is being floated at a time when many are struggling to get a foothold in the housing market. The pace of home sales has slowed, as potential buyers navigate two main obstacles: mortgage interest rates spiked in recent years, and home prices continue to rise in many areas.   \n   The new plan would also expose borrowers to debt for 20 additional years compared to a 30-year mortgage. And because standard repayment schedules devote far more money to paying interest in the early years of a loan rather than paying down the principal, it would take home buyers even longer to build equity in their property.   \"You're going to be paying almost all interest for the first 10 years. It's really akin to an interest-only loan at that point,\" says Chris Hendrix, senior vice president for the home loans unit of NBKC Bank in Kansas City. He adds, \"that's true for a 30-year loan too: for the first 10 years, you're paying mostly interest on that loan. But it would look even worse on a 50-year loan for sure.\"   \n   Many questions remain about the plan, which the Trump administration revealed over the weekend.   How do the numbers look on a 50-year versus 30-year mortgage?   Using a $400,000 home with a 6.25% interest rate and a 10% down payment as an example, Realtor.com senior economist Joel Berner said via email, \"a 50-year loan would save at most about $250 per month compared to the 30-year loan.\"   That would help buyers in the short term — but over decades, buyers would end up paying much more.   \n   \"Total interest on the 50-year loan would amount to $816,396 compared to $438,156 on the 30-year loan, a difference of $378,240,\" he says. \"That's 86% more interest over the life of the loans.\"   Berner cautions that his hypothetical example assumes the same interest rate for both loans. In reality, he says, the interest rate for a 50-year loan would be higher than one for 30 years, making the disparity even more pronounced. \"The longer the life of the loan, the more compensation the lender will demand.\"    Loading... \n   Why would a bank want to offer a 50-year mortgage, and why would a buyer want one?   \"Buyers do benefit from spreading out the high cost of a home purchase over a longer period,\" Berner says, \"but lenders certainly benefit too by having a longer period to charge higher interest rates.\"   Bruce Marks, the CEO of the Neighborhood Assistance Corporation of America, a nonprofit that helps people get low-cost mortgages, is skeptical that home buyers will embrace the plan.   \n   \"It will have no legs because they've tried to do a 40-year term that has not taken off,\" he says, referring to 40-year mortgage modifications that have been offered in earlier attempts to help struggling homeowners.   The 50-year proposal \"is even worse,\" Marks says. \"It will go nowhere. Borrowers will not do it. They see through that. They will know that they will not generate any wealth.\"   The potential timing of a 50-year mortgage is uncertain.   \"There's a lot of legal analysis\" over the proposal, National Economic Council director Kevin Hassett said this week, as he implied the plan might require legislation. Under the Dodd-Frank Act, mortgages longer than 30 years don't meet the criteria for qualified mortgages — meaning they're ineligible to get the backing of Fannie Mae and Freddie Mac, and lenders would be hesitant to offer them.   \n   In response to criticisms of the plan, Hassett said homeowners also build equity when their properties appreciate in value. Noting that prices tend to increase, he added, \"I don't think that the absence of equity is a serious concern about this.\"   Could other changes help ease the housing crunch?   \"This is not the best way to solve housing affordability,\" Berner says. \"The administration would do better to reverse tariff-induced inflation, which is keeping the rates on existing mortgages high, and to encourage the expansion of housing supply by promoting homebuilding.\"   Hendrix says he understands the White House's motivation: to address a housing crisis.   \n   \"The median homebuyer right now in the nation is 59 years old. It is the highest that it's ever been since we started tracking it since 1981. What else is staggering is the median age for a first-time homebuyer is 40 years old right now. You're looking at a generation that has not had the ability to get into a property, start building equity, start building wealth from a home.\"   Lower interest rates could help, Hendrix says. But he adds that the government also has other tools, such as helping first-time homebuyers and encouraging housing construction.   One change Marks would like to see is any move that might limit individual homebuyers from being outbid by large corporations that add homes as part of their investment portfolios. Another, he says, is any policy that might support buyers secure mortgages of 30 years or less.   \"The 30-year term has always been the sweet spot in this country. And that sets us apart from every other country. And we should not just try to eliminate that or undermine that. We should double down,\" he says, and find ways to give consumers more flexibility and financial well-being.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "3 questions about Trump's 50-year mortgage plan",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4c%2F46%2Fe77a6cf44678a59a8e50036d0a98%2Fgettyimages-1468619453.jpg"
      ],
      "datePublished": "2025-11-12T23:22:08.000Z",
      "dateModified": "2025-11-12T23:22:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Oversight Committee member talks about emails that appear to tie Epstein to Trump",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605857/house-oversight-committee-member-talks-about-emails-that-appear-to-tie-epstein-to-trump",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T22:17:35.000Z",
    "description": "\n      NPR's Scott Detrow speaks with Rep. Robert Garcia, ranking Democratic member of the House Oversight Committee, about newly-public emails that a",
    "body": "\n      NPR's Scott Detrow speaks with Rep. Robert Garcia, ranking Democratic member of the House Oversight Committee, about newly-public emails that appear to tie Jeffrey Epstein to President Trump.   \n\n    SCOTT DETROW, HOST:  Today, Democrats on the House Oversight Committee released emails between Jeffrey Epstein and his confidants that suggest that President Trump may have known about Epstein's sex abuse operations. In one email, Epstein writes that Trump, quote, \"spent hours at my house\" with one of Epstein's victims. In another, he writes that Trump, quote, \"knew about the girls.\" In the third, a writer advises Epstein that he can use his history with Trump as a, quote, \"valuable PR and political currency\" should he ever need to. Democrats are trying to force the Department of Justice to release more information from its investigation of Epstein and accuses the White House of a cover-up.In response to today's release, the White House said that these were, quote, \"selectively leaked emails\" to, quote, \"create a fake narrative.\" And Republicans on the Oversight Committee released more than 20,000 pages of documents from the Epstein case from which these three emails came. Let's hear more from Representative Robert Garcia of California. He is the ranking Democratic member of the House Oversight Committee. Congressman, thanks for joining us.ROBERT GARCIA: Sure thing. Happy to be here.DETROW: Let's start with this. We have long known now that the future president and Jeffrey Epstein were friendly before they had a falling out around 2004, which was well before Trump ran for president. What did we learn that was new here? Did this bring any new information?GARCIA: I think that the emails today show clearly that there is a relationship between Donald Trump and Epstein. As far as what Donald Trump knew, what he participated in I think are real questions. And I think the thing on everyone's mind, certainly those of us on the committee, is why the cover-up? Why won't the White House release the full Epstein files?You have an email today essentially saying that Donald Trump may have spent hours with one of the victims. As you said, another email that talks about Donald Trump possibly knowing what was happening with these girls. And I think this is really disturbing stuff. We want justice for these women and these survivors. We know that many were abused when they were underaged. And powerful men were involved. And our whole goal here is to get to the truth. And we are imploring the Department of Justice to release the files.DETROW: But again, we've all been blanketed with the pictures of these two men together. We saw a lot of reporting earlier this year of these alleged birthday notes that Trump was writing to Epstein. What new information did you learn from these emails?GARCIA: Well, I think part of it is the president admitting that there was a real relationship here between him and Epstein. And I think that is what today's emails actually also show. First, these 23...DETROW: Well, these are all other people talking about Trump.GARCIA: Absolutely.DETROW: Trump does not appear himself.GARCIA: That's right. This is Jeffrey Epstein's emails. And there's 23,000 documents here, of course. So what's important is, when you spend the entire campaign saying you're going to release the Epstein files, when we know that Jeffrey Epstein has said that Donald Trump was his best friend for 10 years - the birthday note you just referenced, Donald Trump, as a reminder, said it didn't exist until we actually produced it with his own signature.And so Trump has a record of lying about this. And he has a record of saying that he wanted to release, and now they're refusing to do so. I think it's important to note that every single piece of evidence we want to release to the public. This is about transparency, it's about oversight and it's about getting justice for the victims.DETROW: Curious how you're approaching this. This is a case laden with conspiracy theories. These are emails, many of whom are coming from not especially trustworthy people. How are you verifying this information that you're looking at?GARCIA: Look, I think the important thing is that people absorb and read the documents for themselves and make their own judgments. I think for us, clearly anything that is a correspondence from Jeffrey Epstein, whether it's to Ghislaine Maxwell, which we saw today in one of those emails, or others is significant. And what we're trying to say right now at this moment is the only way to get the full picture of what happened is for the DOJ to follow the subpoena sent by the Oversight Committee and to hand over all of the documents.There are an enormous amount of documents, photographs, possibly videos that the public has a right to know what actually happened. We know, for example, that back when the Epstein case was being developed and prosecuted, there were multiple men that were going to be named as coconspirators in this and that that was all essentially washed aside by, at the time, Alex Acosta, who then becomes, of course, Trump's labor secretary. So there's a lot of questions here.DETROW: I want to make sure we get to a few more points here. This is also a notable day in that you're about to gain another Democratic member of the House, who will sign the discharge petition and force a vote, possibly, on the House floor to release the files. We know the White House is pressuring the four Republicans who have signed onto that petition to pull their names. Are you in communication with any of these Republican representatives who have been having meetings at the White House today?GARCIA: Look, I've been talking to many Republicans. There's no question that if we hold and they hold, this will pass the House, and there will be numerous Republicans that'll vote yes. They understand that this is important to their constituency. The Epstein files and its release is very bipartisan when you ask the American public. And again, the question...DETROW: What especially is important? Because again, this is something that's been playing out for more than a decade now. This is somebody who's been long dead but continues to make news. Why is this the priority for you given all of the other issues the federal government is facing?GARCIA: Well, look, I think there's a lot of important things. We got to focus on health care. We got to focus on lowering costs. This goes straight to the corruption of this administration. And Donald Trump spent his campaign talking about this. And if you were going to lean in so hard on a campaign promise and then essentially go back on it, we have to ask why. And in meeting all these women and these victims and survivors, they want justice. I've talked to many of them personally, one on one. And they deserve justice, and they deserve the truth. I also...DETROW: How do you balance...GARCIA: But let me say one more thing because I think it's really important. When you have powerful men - and I don't care what party they're in or what their job is. When you have powerful men abuse, rape and traffic women and yet you don't bring justice to those women, what are we saying to American kids, to girls, to women across this country that the most powerful men can get away with this? And that has to also drive our investigation.DETROW: Congressman, we've got about 30 seconds left. But how do you balance transparency and protecting these victims, who have been abused so many times at this point forward, with the release of thousands of pages of information?GARCIA: What's most important at the end of the day is we've got to protect the victims. And so we're doing that. We're redacting names. We've made that promise. And everything else we're going to get out to the public.DETROW: That is Congressman Robert Garcia of California, the top Democrat on the House Oversight Committee. Thank you so much for talking to us.GARCIA: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Oversight Committee member talks about emails that appear to tie Epstein to Trump",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T22:17:35.000Z",
      "dateModified": "2025-11-12T22:17:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]