[
  {
    "title": "U.S. strikes another alleged drug-smuggling boat in eastern Pacific",
    "url": "https://www.npr.org/2025/12/23/g-s1-103420/u-s-strikes-another-alleged-drug-smuggling-boat",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3505x1972+0+183/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fff%2Fc3a9116f49f697b0ce9c9b3fab5e%2Fap25356812101411.jpg",
    "tag": "Politics",
    "date": "2025-12-23T07:02:29.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth speaks as",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Defense Secretary Pete Hegseth speaks as President Donald Trump looks on, at Trump's Mar-a-Lago club, Monday, Dec. 22, 2025, in Palm Beach, Fla.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — The U.S. military said Monday that it had conducted another strike against a boat it said was smuggling drugs in the eastern Pacific Ocean, killing one person.   \n   In a social media post, U.S. Southern Command said, \"Intelligence confirmed the low-profile vessel was transiting along known narco-trafficking routes in the Eastern Pacific and was engaged in narco-trafficking operations.\" Southern Command provided no evidence that the vessel was engaged in drug smuggling.   A video posted by U.S. Southern Command shows splashes of water near one side of the boat. After a second salvo, the rear of the boat catches fire. More splashes engulf the craft and the fire grows. In the final second of the video, the vessel can be seen adrift with a large patch of fire alongside it.   \n   Earlier videos of U.S. boat strikes showed vessels suddenly exploding, suggesting missile strikes. Some strike videos even had visible rocket-like projectiles coming down on the boats.   \n   The Trump administration has said the strikes were meant to stop the flow of drugs into the U.S. and increase pressure on Venezuelan President Nicolás Maduro.   At least 105 people have been killed in 29 known strikes since early September. The strikes have faced scrutiny from U.S. lawmakers and human rights activists, who say the administration has offered scant evidence that its targets are indeed drug smugglers and say the fatal strikes amount to extrajudicial killings.   Meanwhile, the U.S. Coast Guard has stepped up efforts to interdict oil tankers in the Caribbean Sea as part of the Trump administration's escalating campaign against Maduro.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. strikes another alleged drug-smuggling boat in eastern Pacific",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3505x1972+0+183/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa4%2Fff%2Fc3a9116f49f697b0ce9c9b3fab5e%2Fap25356812101411.jpg"
      ],
      "datePublished": "2025-12-23T07:02:29.000Z",
      "dateModified": "2025-12-23T07:02:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Adam Smith says Trump's oil blockade is about power over Venezuela",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5651285/trump-oil-blockade-venezuela-adam-smith",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5325x2995+0+555/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2Fd9%2Ff0923e3a4c2c90e13568ef523ea4%2Fap25338726041929.jpg",
    "tag": "Politics",
    "date": "2025-12-22T11:50:09.000Z",
    "description": "Rep. Adam Smith: Trump’s oil blockade is about power over Venezuela   Rep. Adam Smith, the Democratic leader of the Armed Services Committee, says Tru",
    "body": "Rep. Adam Smith: Trump’s oil blockade is about power over Venezuela   Rep. Adam Smith, the Democratic leader of the Armed Services Committee, says Trump's oil blockade is about driving Venezuelan President Nicolás Maduro out of power more than anything.\n\n    \n        Politics\n    \n\n\n                  \n            Updated December 22, 20252:00 PM ET\n                \n                    Originally published December 22, 20256:50 AM ET\n                \n                \n         \n      \n\n      \n      Rep. Adam Smith, D-Wash., on the Trump's seizures of Venezuela-linked oil tankers\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5651285/nx-s1-9581726\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Adam Smith, D-Wash., the ranking member of the House Armed Services Committee, leaves after a classified briefing with Adm. Frank \"Mitch\" Bradley, commander of the U.S. Special Operations Command, and Gen. Dan Caine, chairman of the Joint Chiefs of Staff, at the United States Capitol in Washington, Thursday, Dec. 4.\n                \n                    J. Scott Applewhite/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        J. Scott Applewhite/AP\n    \n\n   \n   Representative Adam Smith, Democratic leader of the House Armed Services Committee, says President Trump's move to block Venezuela's sanctioned oil shipments is aimed at driving President Nicolás Maduro from power, not enforcing maritime law.   \"This is about regime change in the conflict with Venezuela, much more than it's about trying to enforce international laws against false flag vessels or dark fleet vessels,\" Smith told Morning Edition.   His comments come as the Department of Homeland Security says the U.S. Coast Guard is pursuing an oil tanker that has recently departed from Venezuela, the third oil-carrying vessel pursued this month off the country's coast. Two ships have already been seized.   \n   The move follows President Donald Trump's announcement last week to put a \"total and complete blockade\" against Venezuelan oil and sanctioned tankers. Trump said more military pressure would come \"until they return to the United States of America, all of the oil, land and other assets that Venezuela stole from us.\"   Venezuela denies that it has stolen from the U.S. and says Trump is after the country's natural resources, including its vast oil reserves.   NPR's Leila Fadel spoke with Smith further about why the Coast Guard is seizing sanctioned oil tankers linked to Venezuela.   Listen to the full interview by clicking on the blue button above.   The web copy of this interview was written by Destinee Adams.\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Adam Smith says Trump's oil blockade is about power over Venezuela",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5325x2995+0+555/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0b%2Fd9%2Ff0923e3a4c2c90e13568ef523ea4%2Fap25338726041929.jpg"
      ],
      "datePublished": "2025-12-22T11:50:09.000Z",
      "dateModified": "2025-12-22T11:50:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nearly two dozen states sue the Trump administration over funding for CFPB",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5652043/cfpb-trump-russell-vought-lawsuit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8010x4506+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff8%2Fb1%2F8a5049ad435896e922e97eb0f994%2Fgettyimages-2198219205-1.jpg",
    "tag": "Politics",
    "date": "2025-12-22T21:52:45.000Z",
    "description": "\n      \n      22 attorneys general have sued the Trump administration over CFPB funding\n    \n            \n                \n                Transcript\n",
    "body": "\n      \n      22 attorneys general have sued the Trump administration over CFPB funding\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5652043/nx-s1-9582815\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A view of the Consumer Financial Protection Bureau headquarters building in Washington, D.C., on Feb. 10, 2025.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   A coalition of 21 states along with the District of Columbia sued the Trump administration on Monday to prevent it from defunding the Consumer Financial Protection Bureau, which says it will run out of money in a few weeks.   \n   The consumer watchdog agency is funded by the Federal Reserve — unlike many other federal agencies — to insulate it from political whims. But under Acting Director Russell Vought, the CFPB is refusing to accept money from the Fed.    The CFPB argues that the law that established the agency says it must get funding from the Fed's \"combined earnings,\" or profits made by the Fed.  But the Fed doesn't have those earnings, the Trump administration says, because it's paying out more money than it's taking in, or operating at a loss.    \n   The attorneys general suing the administration — and some Democratic lawmakers — reject that argument. They say the CFPB is narrowly defining \"combined earnings\" as profits, whereas lawmakers had intended the term to mean the wider funds — or proceeds — coming into the Fed.   In their suit, filed in the U.S. District Court in Oregon,  the states argue Vought and CFPB are using \"an unreasonable and unlawful interpretation of 'combined earnings.'\" The agency's stance puts the \"CFPB at risk of losing all of its funding as early as January 2026,\" the states argue.   Such a loss of funding would hurt their residents, the attorney generals argue.   In a statement, New York Attorney General Letitia James — who is leading the coalition of states — argues that the CFPB is legally required to \"collect and process consumer complaints and share that complaint data with states,\" which the agency can't do if it isn't funded.    \"Defunding the Consumer Financial Protection Bureau will make it harder to stop predatory lenders, scammers, and other bad actors from taking advantage of New Yorkers,\" James said in the statement.     \"My office and attorneys general across the country rely on the CFPB for consumer complaints and other data to get justice for consumers,\" she added.    \n   Under the Trump administration, much of the CFPB has been gutted, with the agency preventing many of its staff from doing their work. The administration also has tried to fire most of the CFPB's staff, though those attempts have been blocked by the courts.   Since its creation in the aftermath of the 2008 financial crisis, the CFPB has been the target of many conservatives. They argue the agency is too aggressive when it comes to enforcement and that it's not accountable enough to Congress.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nearly two dozen states sue the Trump administration over funding for CFPB",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8010x4506+0+290/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff8%2Fb1%2F8a5049ad435896e922e97eb0f994%2Fgettyimages-2198219205-1.jpg"
      ],
      "datePublished": "2025-12-22T21:52:45.000Z",
      "dateModified": "2025-12-22T21:52:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Trump administration pauses wind projects off New England, New York and Virginia",
    "url": "https://www.npr.org/2025/12/22/g-s1-103320/offshore-wind-power-pause-trump-administration-new-england-new-york-virginia-national-security",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+95/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2Fd9%2F87cadeec4f9980374305fd573095%2Fap25351790346421.jpg",
    "tag": "Politics",
    "date": "2025-12-22T17:09:42.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Wind turbines operate in July at the Vin",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Wind turbines operate in July at the Vineyard Wind 1 offshore wind farm off the coast of Massachusetts.\n                \n                    Carolyn Kaster/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Carolyn Kaster/AP\n    \n\n   \n   WASHINGTON — The Trump administration said Monday it is pausing leases for five large-scale offshore wind projects under construction along the East Coast due to what it said were national security risks identified by the Pentagon.   The pause, effective immediately, is the latest step the administration has taken to hobble offshore wind in its push against renewable energy sources. It comes two weeks after a federal judge struck down President Donald Trump's executive order blocking wind energy projects, calling it unlawful.   The administration said the pause will give the Interior Department, which oversees offshore wind, time to work with the Defense Department and other agencies to assess the possible ways to mitigate any security risks posed by the projects.   \n   \"The prime duty of the United States government is to protect the American people,\" Interior Secretary Doug Burgum said in a statement. \"Today's action addresses emerging national security risks, including the rapid evolution of the relevant adversary technologies, and the vulnerabilities created by large-scale offshore wind projects with proximity near our east coast population centers.\"   The statement did not detail the national security risks.   Wind proponents slammed the move, saying it was another blow by the administration against clean energy.   \n   The administration said leases are paused for the Vineyard Wind project under construction in Massachusetts, Revolution Wind in Rhode Island and Connecticut, Coastal Virginia Offshore Wind, and two projects in New York: Sunrise Wind and Empire Wind.   The Interior Department said unclassified reports from the U.S. government have long found that the movement of massive turbine blades and the highly reflective towers create radar interference called \"clutter.\" The clutter caused by offshore wind projects obscures legitimate moving targets and generates false targets in the vicinity of wind projects, the Interior Department said.   National security expert and former Commander of the USS Cole Kirk Lippold said the projects were awarded permits \"following years of review by state and federal agencies,\" including the Coast Guard, the Naval Undersea Warfare Center, the Air Force and more.   \n   \"The record of decisions all show that the Department of Defense was consulted at every stage of the permitting process,\" he said, arguing that the projects would benefit national security because they would diversify the country's energy supply.   \n   The action comes two weeks after a federal judge struck down Trump's executive order blocking wind energy projects, saying the effort to halt virtually all leasing of wind farms on federal lands and waters was \"arbitrary and capricious\" and violates U.S. law.   Judge Patti Saris of the U.S. District Court for the District of Massachusetts vacated Trump's Jan. 20 executive order blocking wind energy projects and declared it unlawful.   Saris ruled in favor of a coalition of state attorneys general from 17 states and Washington, D.C., led by New York Attorney General Letitia James, that challenged Trump's Day One order that paused leasing and permitting for wind energy projects.   Trump has been hostile to renewable energy, particularly offshore wind, and prioritizes fossil fuels to produce electricity.   \n   Wind supporters called the administration's actions illegal and said offshore wind provides some of the most affordable, reliable electric power to the grid.   \"For nearly a year, the Trump administration has recklessly obstructed the build-out of clean, affordable power for millions of Americans, just as the country's need for electricity is surging,\" said Ted Kelly of the Environmental Defense Fund.   \"Now the administration is again illegally blocking clean, affordable energy,\" Kelly said. \"We should not be kneecapping America's largest source of renewable power, especially when we need more cheap, homegrown electricity.''   The administration's actions are especially egregious because, at the same time, it is propping up aging, expensive coal plants \"that barely work and pollute our air,\" Kelly said.   The Conservation Law Foundation, a Boston-based environmental group, called the pause \"a desperate rerun of the Trump administration's failed attempt to kill offshore wind,'' noting that courts have already rejected the administration's arguments.   \n   \"Trying again to halt these projects tramples on the rule of law, threatens jobs and deliberately sabotages a critical industry that strengthens — not weakens — America's energy security,\" said Kate Sinding Daly, senior vice president for law and policy at the law foundation.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Trump administration pauses wind projects off New England, New York and Virginia",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+95/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2Fd9%2F87cadeec4f9980374305fd573095%2Fap25351790346421.jpg"
      ],
      "datePublished": "2025-12-22T17:09:42.000Z",
      "dateModified": "2025-12-22T17:09:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federal judge says U.S. must give due process to deported Venezuelans",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5652187/alien-enemies-act-deportations-case",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5789x3256+0+301/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F32%2F74%2F2b998b3b408c972a527bd9330c77%2Fgettyimages-2253176450.jpg",
    "tag": "Politics",
    "date": "2025-12-22T23:18:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A prison guard mans an interior perimete",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A prison guard mans an interior perimeter at the CECOT (Counter Terrorism Confinement Center) on Dec.15, 2025 in Tecoluca, El Salvador. CECOT gained notoriety in 2025 when the Trump administration began its controversial policy of deporting people to El Salvador who they claimed were members of the Venezuelan gang Tren De Aragua.\n                \n                    John Moore/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        John Moore/Getty Images\n    \n\n   \n   A federal judge on Monday said the U.S. government denied due process to the Venezuelan men it deported to a prison in El Salvador in March after President Trump invoked the Alien Enemies Act.   The case over the Alien Enemies Act first brought into focus critiques about the Trump administration's lack of due process in its immigration policy.   The American Civil Liberties Union and Democracy Forward challenged the deportation of the Venezuelans, saying the Alien Enemies Act was invoked illegally and that the men should have been given the opportunity to argue against their removal.   \n   Chief Judge James Boasberg of the U.S. District Court for the District of Columbia in his order agreed that they deserved the right to a hearing — whether by bringing them back to the U.S. or allowing them to pursue legal remedies from abroad.   \n   \"On the merits, the Court concludes that this class was denied their due-process rights and will thus require the Government to facilitate their ability to obtain such hearing. Our law requires no less,\" Boasberg wrote in his opinion.   The Trump administration is likely to appeal.   President Trump around March 15 invoked the 1798 Alien Enemies Act to target members of Tren de Aragua, a Venezuelan prison gang he said was invading the United States. The government sent several planeloads of alleged gang members to El Salvador immediately after invoking the act, including 137 people under the statute, the White House said at the time. (The men have since been returned to Venezuela as part of a prisoner exchange.)    \n   Boasberg imposed a temporary restraining order barring deportations that same evening — but the planes still arrived in El Salvador. The Justice Department argued that the judge had overstepped his authority by inserting himself into questions of foreign policy.   \"This ruling makes clear the government can't just send people off to a brutal foreign prison with zero due process and simply walk away,\" said ACLU attorney Lee Gelernt, lead counsel in the case.   \"Meaningful opportunity\" to make their case   Boasberg in Monday's order said the U.S. maintained custody over the men while they were imprisoned at a notorious prison in El Salvador, so the court continued to have jurisdiction over their fate. He gave the administration until January 5 to either \"facilitate\" their return to the U.S., or \"to otherwise provide them with hearings that satisfy the requirements of due process.\"   \n   He said regardless of whether Trump was lawful in invoking the Alien Enemies Act, the men deserved to have a \"meaningful opportunity\" to prove they weren't gang members before being deported.   \"Otherwise, a finding of unlawful removal would be meaningless for Plaintiffs, who have already been sent back to Venezuela against their wishes and without due process,\" he said. \"Expedited removal cannot be allowed to render this relief toothless,\" Boasberg said, otherwise there would be nothing to stop the government from \"secretly spiriting\" people to a foreign country.   Boasberg also certified the group of people removed on March 15 as a class, meaning the Venezuelans who brought the case as plaintiffs could represent the entire group of men removed.   Separately, Boasberg had in July said there was \"probable cause\" to find the Trump administration in criminal contempt for violating his order to stop the planes going to El Salvador in the first place. An appeals court stepped in earlier this month to put a pause on that issue until at least the new year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federal judge says U.S. must give due process to deported Venezuelans",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5789x3256+0+301/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F32%2F74%2F2b998b3b408c972a527bd9330c77%2Fgettyimages-2253176450.jpg"
      ],
      "datePublished": "2025-12-22T23:18:12.000Z",
      "dateModified": "2025-12-22T23:18:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump announces plans for new Navy 'battleship' as part of a 'Golden Fleet'",
    "url": "https://www.npr.org/2025/12/22/g-s1-103408/trump-navy-battleship-golden-fleet",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1740x979+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2Fcf%2F97e944104072878e02419a60bce9%2Fap25356849560501.jpg",
    "tag": "Politics",
    "date": "2025-12-23T01:53:28.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump departs after speaking a",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump departs after speaking at his Mar-a-Lago club on Monday in Palm Beach, Fla.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — President Trump has announced a bold plan for the Navy to build a new, large warship that he is calling a \"battleship\" as part of a larger vision to create a \"Golden Fleet.\"   \"They'll be the fastest, the biggest, and by far 100 times more powerful than any battleship ever built,\" Trump claimed during the announcement at his Mar-a-Lago resort in Florida.   According to Trump, the ship, the first of which will be named the USS Defiant, will be longer and larger than the World War II-era Iowa-class battleships and will be armed with hypersonic missiles, nuclear cruise missiles, rail guns, and high-powered lasers — all technologies that are in various stages of development by the Navy.   \n   The announcement comes just a month after the Navy scrapped its plans to build a new, small warship, citing growing delays and cost overruns, deciding instead to go with a modified version of a Coast Guard cutter that was being produced until recently. The sea service has also failed to build its other newly designed ships, like the new Ford-class aircraft carrier and Columbia-class submarines, on time and on budget.   Meanwhile, the Navy has struggled to field some of the technologies Trump says will be aboard the new ship.   The Navy spent hundreds of millions of dollars and more than 15 years trying to field a railgun aboard a ship before finally abandoning the effort in 2021.   Laser technology has seen more success in making its way onto Navy ships in recent years, but its employment is still limited. One system that is designed to blind or disable drone sensors is now aboard eight destroyers after spending eight years in development.   Developing nuclear cruise missile capabilities or deploying them on ships may also violate non-proliferation treaties that the U.S. has signed with Russia.   \n   A U.S. official, who spoke on condition of anonymity to discuss ongoing plans, told The Associated Press that design efforts are now underway for the new ship and construction is planned to begin in the early 2030s.   Both Trump and Navy Secretary John Phelan spoke about the new Trump-class warship as a spiritual successor to the battleships of the 20th century, but historically that term has referred to a very specific type of ship — a large, heavily armored vessel armed with massive guns designed to bombard other ships or targets ashore.   \n   This type of ship was at the height of prominence during World War II, and the largest of the U.S. battleships, the Iowa-class, were roughly 60,000 tons. But after World War II, the battleship's role in modern fleets diminished rapidly in favor of aircraft carriers and long-range missiles. The U.S. Navy did modernize four Iowa-class battleships in the 1980s by adding cruise missiles and anti-ship missiles, along with modern radars, but by the 1990s all four were decommissioned.   According to a newly created website for the \"Golden Fleet,\" this new \"guided missile battleship\" is set to be roughly the same size as Iowa-class battleships but only weigh about half as much, around 35,000 tons, and have far smaller crews — between 650 and 850 sailors.   Its primary weapons will also be missiles, not large naval guns.   \n   Trump has long held strong opinions on specific aspects of the Navy's fleet, sometimes with a view toward keeping older technology instead of modernizing.   During his first term, he unsuccessfully called for the return to steam-powered catapults to launch jets from the Navy's newest aircraft carriers instead of the more modern electromagnetic system.   He has also complained to Phelan about the look of the Navy's destroyers and decried Navy ships being covered in rust.   Phelan told senators at his confirmation hearing that Trump \"has texted me numerous times very late at night, sometimes after one (o'clock) in the morning\" about \"rusty ships or ships in a yard, asking me what am I doing about it.\"   \n   On a visit to a shipyard that was working on the now-canceled Constellation-class frigate in 2020, Trump said he personally changed the design of the ship.   \"I looked at it, I said, 'That's a terrible-looking ship, let's make it beautiful,'\" Trump said at the time.   He said Monday he will have a direct role in designing this new warship as well.   \"The U.S. Navy will lead the design of these ships along with me, because I'm a very aesthetic person,\" Trump said.   \n   Phelan said the new USS Defiant \"will inspire awe and reverence for the American flag whenever it pulls into a foreign port.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump announces plans for new Navy 'battleship' as part of a 'Golden Fleet'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1740x979+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F8b%2Fcf%2F97e944104072878e02419a60bce9%2Fap25356849560501.jpg"
      ],
      "datePublished": "2025-12-23T01:53:28.000Z",
      "dateModified": "2025-12-23T01:53:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's second term marks a significant departure from his first term, analysts say",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5640005/trumps-second-term-marks-a-significant-departure-from-his-first-term-analysts-say",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-22T22:16:36.000Z",
    "description": "\n      President Trump's first year of foreign policy in his second term surprised many — for a lot of different reasons.   \n\n    JUANA SUMMERS, HOST:",
    "body": "\n      President Trump's first year of foreign policy in his second term surprised many — for a lot of different reasons.   \n\n    JUANA SUMMERS, HOST:  From the first days of his second term, it was clear President Trump had an aggressive approach to how he would wield American power abroad. He's used tariffs as a weapon against allies, secured the release of hostages from Gaza, cozied up to Russian President Vladimir Putin and launched a pressure campaign against the Venezuelan government of Nicolas Maduro. NPR White House correspondent Franco Ordoñez has more on Trump's busy year and how he's reshaped U.S. foreign policy.(SOUNDBITE OF ARCHIVED RECORDING)UNIDENTIFIED PERSON: Ladies and gentlemen, the president-elect of the United States, the Honorable Donald John Trump.FRANCO ORDOÑEZ, BYLINE: On his first days in office, President Trump threatened to take back control of the Panama Canal, seize Greenland and turn Canada into the 51st state - reflections of his fascination with expansionism and foreshadowing his determination to carve up the world between the three major powers.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: America will reclaim its rightful place as the greatest, most powerful, most respected nation on Earth, inspiring the awe and admiration of the entire world. A short time from now, we are going to be changing the name of the Gulf of Mexico to the Gulf of America.ORDOÑEZ: Unlike those who came before him, Trump rarely speaks about America's responsibilities of global leadership. He disdains alliances and paints European allies as weak. Stewart Patrick served in the George W. Bush State Department and is now at the Carnegie Endowment for International Peace. He says Trump's taken aim at the global systems that he's long complained were unfair to the U.S. taxpayer.STEWART PATRICK: Trump's second term in office has represented a significant departure from Trump 1.0. It's far more of a revolutionary approach to international order, and the upheaval that he's created is just monumental.ORDOÑEZ: Those shifts have stunned Western partners who have struggled to balance maintaining transatlantic ties while defending their own interests. Ursula von der Leyen, the president of the European Commission, has complained that, quote, \"the West as we know it no longer exists.\"(SOUNDBITE OF ARCHIVED RECORDING)URSULA VON DER LEYEN: Europe did not start this confrontation. We think it is wrong.ORDOÑEZ: Trump has also had to push back against domestic allies who have accused him of spending too much time abroad and straying from his America First priorities. The White House told me Trump's acting on his campaign promises to advance American interests, delivering fair trade deals, pushing allies to increase defense spending, killing narco terrorists - those are their words - while also ending global conflicts to make the world safer.LORI ESPOSITO MURRAY: I think it is really clear that the perceptions of America First as isolationist at the beginning of his administration was clearly wrong.ORDOÑEZ: Lori Esposito Murray is a veteran in diplomatic circles who has advised both Republican and Democratic leaders. She says the main goal of America First is not to withdraw but to engage, to use American economic power to reshape global trade to press partners to carry their own weight. It's also about using American military power.MURRAY: He's not hesitating to use force, but they're really carefully calculated situations - Iran, enabling Ukraine for long-range strikes into Russia, bombing the Houthis - they're carefully calculated use of force but definitely not hesitating to use U.S. military force to achieve his goals.ORDOÑEZ: And perhaps nowhere is the link between Trump's domestic goals and foreign policy as intertwined as it is in the Western Hemisphere, where Trump has positioned a historic level of military acid.BENJAMIN GEDAN: President Trump views the world in spheres of influence, this old-fashioned idea that's become in style again, that you divide up the globe amongst major powers, and for the United States, we're the major power in the Western Hemisphere. And he's really acted on that.ORDOÑEZ: Benjamin Gedan led the Venezuela portfolio in the Obama White House. He says it's clear that the U.S. seeks to reassert its dominance in the region over other actors who have gained influence, such as Russia and China.GEDAN: One thing that's notable is that China became a competitor to the United States and Latin America not by moving an aircraft carrier into the region, but through trade and investment in infrastructure and being an appealing partner for all these countries.ORDOÑEZ: He says the U.S. should be working to be the partner of choice and not the partner who is feared.Franco Ordoñez.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's second term marks a significant departure from his first term, analysts say",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-22T22:16:36.000Z",
      "dateModified": "2025-12-22T22:16:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Congress is in a coma': Former members sound alarm on health of the House",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5648858/congress-is-in-a-coma-former-members-sound-alarm-on-health-of-the-house",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-22T21:15:58.000Z",
    "description": "\n      Congress ends the year with a thin list of legislative accomplishments and a growing number of retirements. Former lawmakers say the problems n",
    "body": "\n      Congress ends the year with a thin list of legislative accomplishments and a growing number of retirements. Former lawmakers say the problems now plaguing Capitol Hill have been years in the making.   \n\n    JUANA SUMMERS, HOST:  A record number of lawmakers are calling it quits ahead of the midterm elections next year. More than 40 people in the House won't be running for reelection in their current seats, but more than a dozen former members from both parties told NPR congressional correspondent Barbara Sprunt that legislative stagnation and low morale aren't new. They've been building over time.BARBARA SPRUNT, BYLINE: Democrat Jim Cooper of Tennessee has seen Congress go through a lot. He was first elected during the Reagan administration and retired two years ago. And he has a pretty blunt diagnosis for the House.JIM COOPER: Congress is in a coma. It has a pulse but not many brain waves.SPRUNT: And the proof, he says, is a historic 43-day shutdown, where members of the House were sent back home. But Cooper says this is about more than just a shutdown.COOPER: The Constitution intended Congress to be the most important branch of the government. But now Congress is so functionless. It's taken itself out of the game.SPRUNT: He's not alone in that concern. Former members say Congress is not fulfilling its core constitutional duties, like declaring war, power of the purse and oversight of the executive branch. They say executive overreach has been happening over time, but it's gotten worse under President Trump who has gone further than past presidents to usurp congressional power.DANIEL LIPINSKI: I love Congress, and it pains me what has become of it.SPRUNT: That's Daniel Lipinski, an Illinois Democrat. He recently met with current members who said they're upset that the power in Congress is increasingly top down.LIPINSKI: The speaker's office will tell a committee chair this is what we want to see in this bill. This is what we don't want in this bill. And there's just a lot of frustration over that amongst members 'cause they know that's where they can have an impact. And if the committees aren't working, then they don't have an opportunity to be a legislator.SPRUNT: Wisconsin Republican Reid Ribble agrees.REID RIBBLE: Being a member of the House of Representatives today is more like an honorary position with no actual authority whatsoever.SPRUNT: Because of Senate budget rules, increasingly, the majority party tries to cram as much of its agenda into big bills. And if a measure isn't in it, it's hard for it to succeed later. And Ribble says, in the meantime, the House just votes on other bills they know have no real future.RIBBLE: I got tired of just voting on a bunch of messaging bills that were never going to be taken up by the Senate, that were all pretend.SPRUNT: Members say the job has a personal toll, too. Here's Fred Upton, a Michigan Republican.FRED UPTON: If you're in a district like mine, 650 miles away from D.C., you're gone half the time. So you're missing you know, birthdays, school events, you know, reading the paper or taking a walk with your spouse.SPRUNT: Michigan Democrat Dan Kildee says there's always been trade-offs.DAN KILDEE: Many of us were willing to do that because we saw a purpose. You know, you can actually feel like, at the end of a week or end of a month, you can look at what you did and see that you made a difference in somebody's life. And it was you making it happen, whereas now, it's much more difficult to see that.SPRUNT: Adding to this are rising threats against lawmakers. The Capitol Police estimates it investigated 14,000 threats against members this year alone. Here's Democrat Cheri Bustos of Illinois.CHERI BUSTOS: Look, my husband was a sheriff of our county. Every time we went out, he was armed. You know, so I had a level of security, at least when I was with my husband, that I didn't have to pay for. But those are the realities of what families have to live with, what elected officials have to live with. And you have to make a decision, you know, are you OK with that?SPRUNT: Democrat Anna Eshoo of California says the rise of threats has tracked with the rise of hyper partisanship, something she says makes the work of Congress even harder.ANNA ESHOO: I got to the point where I wanted to have a conversation with a Republican colleague. When I approached them, I want you to know that I don't view you as my enemy. I mean, isn't that something that I felt like I needed to say that?SPRUNT: Members say it's all of these things combined - the gridlock, the threats, the lack of bipartisanship - that creates an environment that leads to people leaving. But Cooper, the longtime Tennessee Democrat, says despite all these challenges, he still encourages people to run for Congress.COOPER: We need more good people to run, and it takes energy. It takes caring. It takes good ideas for how to fix problems. But our country is worth fixing.SPRUNT: Barbara Sprunt, NPR News.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Congress is in a coma': Former members sound alarm on health of the House",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-22T21:15:58.000Z",
      "dateModified": "2025-12-22T21:15:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A rift in MAGA has top Heritage Foundation officials leaving to join with Mike Pence",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5651990/heritage-foundation-mike-pence",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2F6a%2Fc5ece11a4638889047c40d8e5f95%2Fgettyimages-2236124859.jpg",
    "tag": "Politics",
    "date": "2025-12-22T21:06:51.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former Vice President Mike Pence takes p",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former Vice President Mike Pence takes part in the 2025 Atlantic Festival at PAC NYC on Sept. 18, 2025 in New York City.\n                \n                    Michael Loccisano/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Michael Loccisano/Getty Images\n    \n\n   \n   More than a dozen staff members at the influential conservative think tank the Heritage Foundation are leaving the organization to join a group founded by former Vice President Mike Pence.   The mass departure follows turmoil within Heritage and the larger conservative movement over the role of right-wing influencers who've promoted antisemitic and other extremist ideas. Those tensions were on display at Heritage after its president, Kevin Roberts, released a video defending Tucker Carlson for a friendly interview in October with Nick Fuentes, an avowed white nationalist who has previously praised Adolf Hitler. Roberts' video sparked controversy inside Heritage, prompting him to later apologize for it.   \n   Pence's think tank, Advancing American Freedom, or AAF, announced the hires on Monday, saying they include leaders from the Heritage Foundation's legal, economic and data teams.   In a statement, Pence welcomed the new hires and said they \"bring a wealth of experience, a love of country, and a deep commitment to the Constitution and Conservative Movement that will further the cause of liberty.\"   AAF President Tim Chapman told NPR that after learning of the Heritage staffers' interest in leaving the organization, AAF raised $13 million toward a $15 million goal in two weeks to help fund their salaries over the next three years.   The move dramatically expands AAF's size, Chapman said, taking the organization from 18 employees to more than 30. Chapman said AAF is bolstering its research team in an effort to fill what it sees as a gap within the modern conservative movement.   Chapman said AAF will promote traditional conservative ideas such as low taxation, strong national defense and limited regulation at a time when he said the Republican Party and others on the right are in a battle to define the future.   \"I think what's happening right now is that a movement that has oriented itself around political personalities and specific political leaders is starting to realize that those leaders are not going to be here forever, whether it's President Trump or other leaders,\" Chapman said.   \n   \"There is an end date on their leadership … And so the question is now popping up, what is it that the movement after that leadership structure, what is it that that movement stands for after that?\"   Meanwhile, in a statement to NPR, Heritage Foundation Chief Advancement Officer Andy Olivastro accused some of the staff members who left of \"disloyalty,\" adding that the departures \"clear the way for a stronger, more focused team.\"   A task force focused on fighting antisemitism recently cut ties with Heritage over related concerns. Heritage has played an influential role in the Trump administration, including through its publication of Project 2025, which outlines a detailed list of conservative policy goals and plans, many of which the administration has implemented.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A rift in MAGA has top Heritage Foundation officials leaving to join with Mike Pence",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F02%2F6a%2Fc5ece11a4638889047c40d8e5f95%2Fgettyimages-2236124859.jpg"
      ],
      "datePublished": "2025-12-22T21:06:51.000Z",
      "dateModified": "2025-12-22T21:06:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Trump's 'crony capitalism' has shaken up U.S. business",
    "url": "https://www.npr.org/2025/12/22/nx-s1-5639916/trump-crony-capitalism-free-market",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+264/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2b%2F13f0d3ba42c2badb101fc812b775%2Fgettyimages-2251825522.jpg",
    "tag": "Politics",
    "date": "2025-12-22T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump has spent the past year ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump has spent the past year actively favoring some U.S. companies and investors, while threatening others.\n                \n                    Pool/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Pool/Getty Images North America\n    \n\n   \n   State capitalism. MAGA Marxism. Crony capitalism.   Those are just some of the terms business and political commentators have used this year to describe how President Trump's policies are reshaping U.S. free-market capitalism. There are some differences in definition — but all of these terms underline how dramatically Trump has blurred the boundaries between business and government, to an extent that could have long-term consequences for the U.S. economy and the country's global standing.   \n   \"When the American government appears to favor a company over rival companies, that distorts the marketplace,\" says Ann Lipton, a veteran business law expert and professor at University of Colorado's law school.   \"It means that other firms have less incentive to compete on innovation, which is sort of the opposite of how a free market is supposed to operate,\" she adds. \"It's just bad for the economy.\"   There's ample evidence this year of Trump actively favoring some U.S. companies and investors, while threatening others. In August, he publicly called for the resignation of Intel CEO Lip-Bu Tan — until Tan came to the White House to meet with him, and agreed to give the U.S. government a 10% stake in the tech company.   \n   Several other tech CEOs also spent the year appearing to personally court Trump. Take Nvidia CEO Jensen Huang, who runs the world's most valuable company and is among the donors funding Trump's controversial plans to build a White House ballroom. This month, Trump said the U.S. would grant Nvidia permission to sell one of its more advanced semiconductor chips in China — as long as the U.S. government gets a 25% cut of sales.   \n   Lipton calls this capitalism by \"schmoozing,\" and warns that it could seriously damage the competitiveness of U.S. businesses, thus hurting the overall economy in the long term.   \"We're not going to get the best innovations. We're not going to get the best products,\" she says. \"If [businesses] are competing on their ability to schmooze, then that's bad for everybody.\"   Intel did not respond to an NPR request for comment. In an emailed statement, a spokesperson for Nvidia said, \"In our discussions, President Trump focuses on his desire for America to win as a nation and his efforts to protect national security, American prosperity and technology leadership.\"   China-style 'state capitalism'   Business leaders have always spent some amount of time trying to cozy up to the White House, no matter its occupant. But Lipton and business insiders across the political spectrum say that Trump's direct influence over private companies this year — and the degree to which some of those companies and their leaders have sought to appeal to him personally — is pushing the U.S. economy away from free-market or \"rules-based\" capitalism.   \n   This system, traditionally embraced by both businesses and Republicans, has helped make the United States into the dominant global economy.   But now, these business insiders say, Trump's policies are creating a government-controlled style of \"state capitalism,\" in which the government — rather than competition between private businesses — shapes the economy. Some go so far as to call it \"crony capitalism,\" meaning that the U.S. government picks winners and losers based on the president's personal relationships.   \"We are seeing a shift away from the type of rules-based capitalism that has made America's economy so robust for so long. And there's a lot of risk in that,\" says Daniella Ballou-Aares, who co-founded the consulting firm Dalberg and served in  President Obama's State Department. She now runs the Leadership Now Project, a coalition of business leaders that has endorsed candidates from both political parties.   \n   In October, her group and The Harris Poll surveyed business leaders across the political spectrum — and found that 84% are worried \"about the current political and legal climate's impact on their companies.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Nvidia CEO Jensen Huang listens as President Trump speaks at the U.S.-Saudi Investment Forum in November in Washington, D.C. Nvidia has spent the year seeking the U.S. government's approval to sell more of its semiconductor chips in China.\n                \n                    Win McNamee/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Win McNamee/Getty Images North America\n    \n\n   \n   A White House official, who spoke on condition of anonymity, says \"this narrative about how [President Trump] reshaped capitalism is significantly overstated\" and calls Trump's policies by and large \"the traditional free-market policy-making that you would expect coming out of a Republican Administration.\"   The official dismissed claims that the White House is engaging in \"crony capitalism,\" and says \"there are companies that are benefiting [from Trump's policies] whether or not they have a good relationship with the administration.\"   The official also notes that so far, the U.S. government has largely sought to take ownership stakes or revenue-sharing deals from companies that play a role in economic and national security: For example, Intel and Nvidia both sell the semiconductors at the center of the artificial-intelligence arms race with China. The U.S. government has also taken stakes or other interests in U.S. Steel and MP Materials, a rare-earth minerals mining company, among others.   \n   \"What we're trying to do is very much embracing the free market and the growth that it unleashes, but making targeted interventions where there's too much on the line,\" the official says.   Tech winners vs. everyone else in corporate America   Businesses largely welcomed President Trump's victory in last year's election, in part due to frustration with what they perceived as a harsh and \"anti-business\" regulatory climate under President Biden.   And some seem pretty happy with his first year in office — especially the tech billionaires whose \"Magnificent Seven\" companies are powering the A.I. boom.   \"The Magnificent Seven and Trump 2.0 are really on the same page to a large extent,\" says Daniel Kinderman, a political science professor at the University of Delaware who studies what he calls \"authoritarian capitalism\" and business responses to right-wing movements.    Some of President Trump's policies, including his sweeping tariffs and his changes to immigration policies for highly-skilled foreign workers, have complicated the business of Big Tech. But most tech CEOs have tried to avoid criticizing those policies publicly, and instead focused on donating to Trump's personal projects. Apple's Tim Cook, for example, this summer presented Trump with a gold-plated and glass plaque as his company promised to invest $600 billion in the United States.    Such gifts appear to have helped: Apple's iPhones have escaped the worst of Trump's tariffs.   Apple did not respond to a request for comment.   Kinderman points out that for wealthy and powerful CEOs, Trump's degree of personal involvement in their businesses at least makes it efficient to deal directly with him — if they can keep him happy — instead of wading through the slow and complicated red tape of federal regulatory processes.   \"These companies are a huge portion of the American economy,\" he says. \"And I think Trump is also giving them, to a large extent, what they want.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In August, Apple CEO Tim Cook presented President Trump with a gold-plated and glass plaque, as his company pledged to invest a total of $600 billion in the United States.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   Still, he and others warn that, taken to the extreme, codependent relationships between political leaders and CEOs don't always end well for the latter.   \n   In more authoritarian countries, where leaders exert much more control over private businesses, the stakes can be especially fraught. Russia, Hungary, and China all exercise some form of state-controlled capitalism, where an autocratic leader cultivates relationships with oligarchic business CEOs — and can quickly force them out of favor.   As one extreme example, Ballou-Aares invokes Jack Ma, the Alibaba founder who built one of China's biggest tech companies before criticizing the country's financial regulations … and then largely disappearing from public view for several years.   \"We know that crony capitalism never really ends well for most companies,\" she says. \"I mean, tell Jack Ma that autocracy is okay for business.\"   'Most CEOs are pretty frustrated'   Outside of Big Tech, many businesses feel a lot more conflicted about how President Trump is reshaping U.S. capitalism. Some have even filed lawsuits against the administration, over its tariffs and its immigration policies.   \"Despite the handful of tech titans that do seem to admittedly genuflect at the White House and at Mar-a-Lago, most CEOs are pretty frustrated with what's happening,\" says Jeffrey Sonnenfeld, a Yale management professor who regularly speaks with CEOs.    Pockets of frustration from corporate America have become more visible recently. The U.S. Chamber of Commerce sued the administration over its plans to start charging $100,000 for H-1B visas for highly-skilled foreign workers — although it did so while praising Trump's \"ambitious agenda.\"   \n   And JPMorgan Chase chief executive Jamie Dimon, who runs the country's largest bank and is one of the most prominent non-tech CEOs in the country, recently told CNN why his company had declined to donate to Trump's White House ballroom.   \"Since we do a lot of contracts with governments here and around the world, we have to be very careful about how anything is perceived,\" Dimon said. \"We're quite conscious of risks we bear by doing anything that looks like buying favors or anything like that.\"   \n   That said, most businesses are reluctant to publicly criticize President Trump or his policies. Smaller companies lack the power to effectively stand up to the White House. And even those running the country's biggest companies are unwilling to draw the personal attacks that Trump can often wield, or the ensuing partisan boycotts and financial damage that can follow.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Earlier this month, demolition work continued where the East Wing once stood at the White House. President Trump ordered the East Wing and Jacqueline Kennedy Garden leveled to make way for a new 90,000-square-foot ballroom that he says will be paid for with private donations from companies including Apple, Amazon, Meta, Microsoft and Google.\n                \n                    Chip Somodevilla/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images North America\n    \n\n   \n   Many businesses have neither the appetite nor the capacity to take on the U.S. government. They just want to focus on making money, even if that means adapting to dramatic tariffs or other sharp shifts in government policy.   \"It's tactical fire-fighting,\" says Drew DeLong, who advises businesses around the world as head of corporate statecraft for the consulting company Kearney, and who served in the State Department during Trump's first administration.   \"Every moment and every hour you spend on tariff mitigation is one less hour that you spend on innovation,\" he says. \"There is an urgency towards fire-fighting as best as they possibly can, but there's also a fatigue.\"   'Merger review has been weaponized'   The Trump Administration's approach to approving — or not — corporate mergers has drawn some of the highest scrutiny, because of the nexus of political and business issues at stake.   \n   For example, the Federal Communications Commission this year approved several telecommunications mergers only after Verizon and T-Mobile agreed to terminate internal policies around \"diversity, equity, and inclusion,\" or DEI. Then it threatened to take federal action against some ABC affiliates over Jimmy Kimmel's comments about Charlie Kirk's killing on his ABC late-night show; the owners of some of those stations were also seeking federal approvals for mergers. (ABC parent Walt Disney suspended Kimmel's show for almost a week, before reinstating him. ABC did not respond to requests for comment.)   \"Merger review has been weaponized into a tool for control,\" says Elizabeth Wilkins, the former chief of staff to Lina Khan, who oversaw U.S. merger review as chair of President Biden's Federal Trade Commission.   \n   \"With those kinds of tools hanging over corporate leaders' heads, we have seen an atmosphere of uncertainty and fear — which breeds silence,\" adds Wilkins, who now runs the Roosevelt Institute, a progressive think tank.   The exception is, again, for leaders who cultivate close ties with the president. This year, the White House helped broker a deal for a coalition of U.S. investors to buy the U.S. operations of TikTok — and asked for an unusual multibillion-dollar payment to the federal government, which business experts have compared to a \"shakedown\" or \"extortion.\" Some of those same investors, including Trump ally Larry Ellison and his son, David, are now seeking even more media deals.   Some business experts say now that corporate America has a better idea of President Trump's playbook in this administration, they expect to see companies and their executives feel more confident about how and when to push back against White House policies that they think will damage their businesses and the wider economy.   \"I think it is clear that the administration's approach here is broadly unpopular, including with business,\" says Ballou-Aares.   But Kearney's DeLong, the veteran of Trump's first administration, warns businesses to brace for much more policy change, and uncertainty about what capitalism and the economy will look like in the future.   \"This is just year one,\" he says. \"Where do we go [during] the rest of this administration? Where do we go after?\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Trump's 'crony capitalism' has shaken up U.S. business",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+264/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6e%2F2b%2F13f0d3ba42c2badb101fc812b775%2Fgettyimages-2251825522.jpg"
      ],
      "datePublished": "2025-12-22T10:00:00.000Z",
      "dateModified": "2025-12-22T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]