[
  {
    "title": "Amid claims that left-wing terrorism is rising, what do the data say?",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5565134/amid-claims-that-left-wing-terrorism-is-rising-what-do-the-data-say",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-22T20:28:44.000Z",
    "description": "\n      The assassination of right-wing activist Charlie Kirk has reanimated claims that the left is increasingly responsible for terrorist activity in",
    "body": "\n      The assassination of right-wing activist Charlie Kirk has reanimated claims that the left is increasingly responsible for terrorist activity in the U.S. But the data paints a more complicated picture.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amid claims that left-wing terrorism is rising, what do the data say?",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-22T20:28:44.000Z",
      "dateModified": "2025-10-22T20:28:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Health insurance is at the center of the government shutdown battle",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5582342/health-insurance-is-at-the-center-of-the-government-shutdown-battle",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-22T20:14:42.000Z",
    "description": "Health insurance is at the center of the government shutdown battle   The NPR Politics Podcast breaks down the central policy issue behind the governm",
    "body": "Health insurance is at the center of the government shutdown battle   The NPR Politics Podcast breaks down the central policy issue behind the government shutdown: enhanced subsidies for Affordable Care Act health insurance plans.\n\n    \n        Politics\n    \n\n\n      \n                  \n            October 22, 20254:14 PM ET\n         \n      \n   \n                              By                               ,                               ,                \n            \n\n\n      \n      Health insurance is at the center of the government shutdown battle\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5582342/nx-s1-9502413\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n\n      The NPR Politics Podcast breaks down the central policy issue behind the government shutdown: enhanced subsidies for Affordable Care Act health insurance plans.   \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Health insurance is at the center of the government shutdown battle",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-22T20:14:42.000Z",
      "dateModified": "2025-10-22T20:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump uses 'common sense' to make a political point. It has populist appeal",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5581554/trump-common-sense",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2531+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff9%2Fb6%2F942ad3434dc48dcc47c8cce15a91%2Ftrump-common-sense.jpg",
    "tag": "Politics",
    "date": "2025-10-22T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Left: President Trump gestures during a ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Left: President Trump gestures during a meeting at the White House on Oct. 14. Right: The title page of the 1776 R. Bell edition of \"Common Sense,\" by American author and politician Thomas Paine.\n                \n                    Kevin Dietsch and Joe Griffin/Hulton Archive/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch and Joe Griffin/Hulton Archive/Getty Images\n    \n\n   \n   The idea of \"common sense\" has been central to American politics since the founding of the United States. Politicians still use the phrase all the time — and perhaps none more so than President Trump.   Just this month at a Cabinet meeting, he used the phrase when he again recommended that pregnant women not take Tylenol.   \"There's something going on, and we have to address it. And so, I'm addressing it the best I can as a nondoctor, but I'm a man of common sense,\" he said.   He also used the term when he cast doubt on the monthly jobs report on CNBC in August: \"It's totally rigged. Smart people know it. People with common sense know it.\"   \n   The White House has also used it to explain the current government shutdown.   \"Not enough Democrats voted for this common sense, clean continuing resolution to keep the government open,\" White House press secretary Karoline Leavitt recently told NPR's Morning Edition.   This isn't exactly new. \"Common sense\" is such a widely used political phrase that University of Pennsylvania history professor Sophia Rosenfeld wrote an entire book on it. And yet, she says, Trump's usage of it is unique.   \n   \"He uses it more than almost anybody else in American politics,\" she said. \"Although, of course, it has a really old origin story.\"   That goes back to Thomas Paine, in his 1776 pamphlet \"Common Sense,\" which made the case to the earliest Americans that British rule of the colonies was wrong. And in that, she says, Paine had hit upon the populist appeal of the phrase.   \"It invokes some kind of primordial basic sense of ordinary people, a kind of lived experience that should transcend what the official or elite position is on something and particularly should transcend book learning and school learning,\" she said.   And Trump often invokes that dichotomy of common sense vs. academic smarts.   Speaking to military leaders in Quantico, Va., last month, Trump differentiated his administration from Joe Biden's, saying that Biden was surrounded by \"radical left lunatics that are brilliant people but dumb as hell when it came to policy and common sense.\"   \n   The phrase appeals more to several demographics that strongly align with Trump, says Frank Luntz, a longtime Republican strategist.   \"Common sense is a higher priority to those who live in rural communities than those in the urban areas. Common sense does better among older voters than it does among younger voters,\" he said. \"And I think the reason why is that it reminds people of a more simple past.\"   And that understandably appeals to people who want to make America great again.   But Democrats use the phrase too. President Barack Obama tried to pass what he called \"common sense gun reform.\"   Rep. Alexandria Ocasio-Cortez, D-N.Y., used it this year on her Fighting Oligarchy Tour with Sen. Bernie Sanders, I-Vt.   \"I believe that in the wealthiest nation in the history of the world, if a person gets sick, they shouldn't go bankrupt. Common sense,\" she told a crowd at Arizona State University in March.   One way to look at \"common sense\" is as an attempt to signal that a policy isn't extreme and could have broad appeal.   But as Luntz points out, it can also be a cudgel, especially in Trump's hands.   \"For him, common sense has an even broader meaning,\" he said. \"It's not just that you're right for the right reasons. It's also that the other side is wrong for being ideological, for being political or being outside the mainstream.\"   Rosenfeld has a similar take.   \"It's also potentially rather demagogic,\" she says of the phrase. \"Common sense also suggests not that there's another side to it. The other side in a debate with common sense is nonsense.\"   And in that sense and others, common sense can be considered one of the most powerful pieces of rhetoric the MAGA movement has found.   To Rosenfeld, Trump especially uses the phrase to try to excuse norm-shattering behavior — like a September social media post that Chicago was \"about to find out why it's called the Department of War.\"   \n   Here's how Trump explained that to a reporter: \"We're going to clean up our cities. We're going to clean them up so they don't kill five people every weekend. That's not war — that's common sense.\"   \"Common sense\" gives the impression of timeworn policy ideas, even if the policy — mass deployment of the National Guard into U.S. cities — was previously unthinkable.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump uses 'common sense' to make a political point. It has populist appeal",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4500x2531+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff9%2Fb6%2F942ad3434dc48dcc47c8cce15a91%2Ftrump-common-sense.jpg"
      ],
      "datePublished": "2025-10-22T09:00:00.000Z",
      "dateModified": "2025-10-22T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump targets 'Democrat priorities' in an effort to end the shutdown standoff",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5581253/trump-targets-democrat-priorities-in-an-effort-to-end-the-shutdown-standoff",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-22T10:57:13.000Z",
    "description": "\n      \n      Trump targets 'Democrat priorities' in an effort to end the shutdown standoff\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      Trump targets 'Democrat priorities' in an effort to end the shutdown standoff\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5581253/nx-s1-9501485\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      As we enter another week of the government shutdown, the Trump administration continues to apply political pressures to Democrats by threatening to cut their priorities, but so far that has not swayed them to end the standoff.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump targets 'Democrat priorities' in an effort to end the shutdown standoff",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-22T10:57:13.000Z",
      "dateModified": "2025-10-22T10:57:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The federal government is still shut down. Here's what that means across the country",
    "url": "https://www.npr.org/2025/10/22/g-s1-94389/government-shutdown",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2Ff2%2Fa4cfe06943b187246c2bd2393fd4%2Fgettyimages-2242059574.jpg",
    "tag": "Politics",
    "date": "2025-10-22T09:04:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A volunteer helps prepare food for distr",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A volunteer helps prepare food for distribution for furloughed federal workers at No Limits Outreach Ministries on October 21, 2025 in Hyattsville, Md. The US government shutdown dragged into a third week, with Congress gridlocked in a clash over spending and no resolution in sight to a crisis that has already cost thousands of jobs.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   It's Day 22 of the federal government shutdown, and Republicans and Democrats appear no closer to an agreement to end it.   Without a fix, many federal employees will not be getting paid this Friday, the first full paycheck they'll miss as a result of the shutdown. By law federal workers are supposed to get back pay once the shutdown ends, but the White House has tried to cast doubt on that.   Meanwhile, President Trump has tied the shutdown to his overall goal of shrinking the size of the government, laying off workers en masse while it continues — and promising more — while specifically targeting what he calls \"Democrat programs.\"    \n   Read the latest on a case brought by some fired federal workers to pause the latest wave of shutdown layoffs.   As the shutdown drags on, here's the latest on what we know.      Jump to state-specific impacts.      Why did the federal government shut down?    A partisan argument over if and when lawmakers need to act to extend subsidies for the Affordable Care Act (ACA) marketplaces led to the current shutdown. Some 24 million people — who don't have insurance through their jobs or a public program like Medicaid — use the system to buy health plans.     Prominent Republican lawmakers have claimed the Democrats are looking to provide tax dollars to help pay for the heath care of undocumented immigrants. That is not true.   Democrats in the Senate refused to vote for the Republican short-term funding bill that passed the House but did not include an extension of the health care tax credits. Democrats are also hoping to repeal cuts to health care programs that were put in place as part of the GOP spending and tax bill that passed over the summer.    NPR's Deirdre Walsh reports that some Democrats say Nov. 1 could be a key date in talks to loosen the current gridlock. That date marks the beginning of open enrollment for people getting coverage through the ACA, when most states will send notices to subscribers laying out the cost of coverage without subsidies.   \n    In Vermont, where notices started going out on Oct. 15, for example, some families are facing increases of $25,000, according to Sen. Peter Welch, D-Vt.    Read more about more about the health care fight behind the shutdown here.    Plus, why Democrats are casting the government shutdown as a health care showdown.   — Selena Simmons-Duffin, NPR      Will the military get paid on Oct. 29?     The Trump administration earlier this month found unused research and development funds to pay active military members, according to a Pentagon official not authorized to speak publicly. So they didn't miss a full paycheck, but it only covered one pay cycle. That was on Oct. 15; troops get paid every other Wednesday.    Military families are already seeking additional assistance from food banks and other groups to help with paying bills.      Are government workers being laid off during the shutdown?   The Trump administration has been following through on threats to further slash the size of government during the shutdown, seeking to layoff roughly 4,000 workers earlier this month. Some workers are fighting back in court; the judge overseeing the case issued a temporary restraining order directing the Trump administration to pause reduction in force (RIF) efforts that affect certain unionized employees.   Read more about the case and how the Trump administration has reacted to the temporary court order        What about WIC and SNAP benefits?   Tens of millions of people are at risk of losing food and nutrition aid if the shutdown continues into November. That includes nearly 42 million who rely on the Supplemental Nutrition Assistance Program or SNAP, previously known as food stamps. Their debit-like cards were funded a month in advance through October, but the Trump administration has warned the program will run out of money Nov. 1. In a letter dated Oct. 10, the USDA told state agencies to hold off distributing November benefits \"until further notice\" because of insufficient funds. The left-leaning Center on Budget and Policy Priorities has called on the agency to shift money from its contingency fund and other places to keep SNAP at least partially funded.   \n   Meanwhile, the Supplemental Nutrition Program for Women, Infants and Children (WIC) — which helps 7 million mothers and young children — was initially slated to lose funding after only a couple weeks. The Trump administration shifted $300 million in tariff revenue to keep it afloat, but the National WIC Association says that emergency funding will only last through October. It's calling for an additional $300 million to keep WIC operating for a couple more weeks. Some states could step in to help fill the gap, depending on their resources.   — Jennifer Ludden, NPR   And what about school lunches?   Some state agencies say they may not have the funds to reimburse schools providing free and low-cost meals.   Diane Pratt-Heavner, a spokesperson for the School Nutrition Association, says some agencies have told her organization they don't have the money to pay schools back for meals during the shutdown.   \"There is a strong commitment on both sides of the aisle to make sure that kids have access to healthy meals at school, so we are hopeful that the administration and Congress will act before this becomes an issue.\"   According to Pratt-Heavner, USDA released funds to regional offices for meals served in October. But some states report they have yet to receive any money, she said. Before the shutdown, USDA released a contingency plan outlining funds states could tap into to cover any gaps. A USDA spokesman did not directly answer NPR when asked if the agency would advance funding to state agencies should the shutdown persist.    — Kadin Mills, NPR      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A United States Postal Service (USPS) mail box stands in Manhattan on Aug. 5, 2020 in New York City. Mail services will not be affected by the government shutdown.\n                \n                    Spencer Platt/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Spencer Platt/Getty Images\n    \n\n   \n   USPS is 'open for business as usual'   \"U.S. Postal Service operations will not be interrupted in the event of a government shutdown,\" according to a statement by USPS. The postal service is primarily self-funded and doesn't depend on the appropriations process to continue running as usual.      IRS furloughs nearly half its staff   A contingency plan from the Treasury Department says that slightly more than half of the IRS' approximately 74,000 workers remain on the job and will continue to work for the foreseeable future. Some IRS employees were issued reduction in force, or RIF, notices on Friday and posted screenshots of those notices informing them of their last day, Dec. 9.   \n   The contingency plan says nearly all of those employees who continue to work will be paid using sources other than annual appropriations, which are on hold during the shutdown. Tasks will include completing and testing systems to handle next year's tax-filing season, and maintaining computers to prevent the loss of data.    — Scott Horsley, Andrea Hsu and Stephen Fowler, NPR      National Nuclear Security Administration furloughs 1,400 employees   On Monday, the National Nuclear Security Administration, which oversees the nation's nuclear weapons, said it is furloughing approximately 1,400 employees. The agency is responsible for overseeing thousands of warheads that are not currently deployed on missiles, bombers and submarines.    According to an Energy Department spokesperson, the furloughs are due to the \"Democrat shutdown.\"    Around 400 employees remain on the job providing security and safety oversight. And the office responsible for moving nuclear weapons around the country remains funded until next week.   — Geoff Brumfiel, NPR   In addition, Nevada Public Radio is reporting more than 1,000 nuclear contractors in Nevada could receive notices by the end of the month, because their work relies on the federal government remaining open.      Teachers and schools won't be directly impacted, but federal education functions might   Eighty-seven percent of Department of Education employees have been temporary furloughed, as detailed in agency shutdown contingency plans.    At the same time, the administration is trying to use a new round of layoffs to gut multiple offices inside the department, including the Office for Civil Rights and the office responsible for overseeing special education, according to multiple sources within the department.    This latest reduction-in-force (RIF) cut at least 121 staffers responsible for overseeing roughly $15 billion in special education funding and for making sure states provide special education services to the nation's more than 7.5 million children with disabilities. According to multiple sources, the special education office is now left with just a handful of top executives and support staff.    \n   In addition, many Department of Education employees who were furloughed were surprised to see a message blaming Democrats for the government shutdown inserted into their out-of-office replies. A federal workers union is suing the Trump administration for inserting the language into employees' out-of-office email messages.   — Shannon Bond and Cory Turner, NPR   The Free Application for Federal Student Aid (FAFSA) for 2026 went live as scheduled at the start of October. As WPR's Corrinne Hess reports, the U.S. Department of Education says that student financial aid programs will continue, despite the shutdown.      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Greg Freeman, a National Park Service ranger closes the entrance gate due to the government shutdown at the Everglades National Park Shark Valley on Oct. 1 in Florida. Shark Valley remains open to visitors who park outside the entrance gate and walk in, although with limited staffing.\n                \n                    Joe Raedle/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Joe Raedle/Getty Images\n    \n\n   \n   National Parks are a mixed bag   Across the country, the National Park Service (NPS) have brought their operations to a halt. That includes the National Zoo and other Smithsonian facilities. NPR's Alana Wise reports that the Smithsonian assured the public that animals would still be cared for during the zoo's closure. Animal cams are considered nonessential and will be turned off for the remainder of the shutdown.   As KQED's Sarah Wright and Carly Severn reported, a contingency plan for the NPS says that park roads, lookouts and trails \"will generally remain accessible to visitors\" for the duration of the shutdown, but other services such as regular road and trail condition updates would not be provided.   Concerns have also been raised about the safety and responsibility of keeping parks open without having a robust number of employees available to conduct critical services.   Salem will be open through Halloween thanks to community support    WBUR's Andrea Shea reports that local leaders in Salem, Mass., learned a National Park Service visitor center and its bathrooms would be closed during their busiest tourist season so they took action on a plan to keep them open.    Shea reports that NPS agreed to let Salem reopen the center if the community covered costs through Halloween weekend. Annie Harris — CEO of the non-profit Essex Heritage that helps staff and run the facility — sent out a flurry of emails including to the mayor. Within 48 hours businesses and non-profits raised $18,000 — keeping the center open until Nov. 2.   \n      Medicare, Medicaid and Social Security benefits will continue   Social Security, VA and other benefits will continue.    But employees at Social Security field offices earlier this month said the government shutdown has left them unable to carry out an important service for some recipients. As NPR's Ashley Lopez reports, workers say they are unable to provide benefit verification letters to people calling in to request them. These official letters act as a sort of income verification and are therefore key to obtaining aid like housing assistance, fuel assistance and help from nonprofits.    In an Oct. 21 email to users answering commonly asked questions about how shutdown impacts, SSA noted the online portal can still be used to access benefit verification letters.   As NPR's Scott Horsley reports some furloughed employees at the Labor Department are coming back to work, in order to complete the September inflation report, which is a key ingredient used to calculate the cost of living adjustment that Social Security recipients will receive next year. The report will come come out on Friday, nine days late.    Read more on how a fight over health policy led to the government shutdown from NPR's Selena Simmons-Duffin.      ICE will mostly continue uninterrupted   Immigration cases and enforcement are proceeding as usual during the government shutdown, with a few small exceptions. Department of Homeland Security spokesperson Tricia McLaughlin confirmed that the employees in the Office of Detention Oversight, which inspects immigration detention centers, is currently not working. \"We hope Democrats will open up the government swiftly so that this office can resume its work,\" McLaughlin said.   According to DHS Secretary Kristi Noem, DHS law enforcement, including ICE agents, will be paid for work done during the shutdown.   \"More than 70,000 sworn law enforcement officers across DHS including those serving in CBP, ICE, Secret Service, TSA and other critical mission areas will be paid for all hours worked during the shutdown period,\" Noem posted on X last week. \"By Wednesday, October 22, law enforcement officers will receive a \"super check\" — which covers the 4 days lost, their overtime, and their next pay period.\"   \n   The U.S. Coast Guard, which is housed within DHS, will continue to be paid, also according to a post last week from Noem, from funds appropriated in the reconciliation bill earlier this year.   — Ximena Bustillo, NPR      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An air traffic control tower at the Austin-Bergstrom International Airport on Oct. 1 in Austin, Texas is seen following the federal government shutdown.\n                \n                    Brandon Bell/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brandon Bell/Getty Images\n    \n\n   \n   If you're flying soon …   Air traffic controllers and most Transportation Security Administration employees are considered \"essential workers\" and have to stay on the job.   Travelers across the U.S. are beginning to feel the impacts of the government shutdown, as air traffic control staffing shortages disrupt flights across the country.    Air traffic controllers helped to end the last government shutdown, and could help end this one as well. A \"slight increase\" in sick leave at two facilities on the East Coast threw some major airports into chaos.   Read more on what a shortage of air traffic controllers could do to bring an end to the shutdown from NPR's Joel Rose.      \n   The impact of the shutdown looks different in different parts of the country   Some states across the country are uniquely positioned to feel the impact of the government shutdown. Reporters from the NPR Network are digging into the ways the government shutdown is playing out in their region.   Here's what we know so far about how the shutdown is affecting specific communities across the country:      Alaska   The U.S. Transportation Department says it has secured funding to continue the Essential Air Service program, subsidizing routes to 65 Alaska communities and more than an additional 100 communities nationwide, through Nov. 2. [Alaska Public Media]About 15,000 federal employees live in Alaska, one of the highest percentages of federal employees when compared with other states. President Trump's threat that federal employees could receive termination notices increases the uncertainty around how this crucial workforce to Alaska's economy could be affected. [Alaska Public Media]   For more on the impact in Alaska, head to Alaska Public Media.      \n   Arizona   Arizona Gov. Katie Hobbs said she would not spend state funds to keep Grand Canyon National Park open should the government shutdown. [KJZZ] Social services in Grand Canyon Village are gearing up to support non-essential employees at Grand Canyon National Park, including food pantry resources. [KNAU]Sen. Ruben Gallego said the shutdown would also not affect federal relief money to communities in the Miami-Globe area after torrential monsoon rains caused flash flooding in the region [KJZZ]Phoenix Sky Harbor Airport joined a handful of other airports across the country that have refused to display a video from Homeland Security Secretary Kristi Noem blaming Democrats for the government shutdown. [KJZZ]      California   Well over 1 million people in L.A. County get food benefits from CalFresh — the state's implementation of the federally funded SNAP program. The other major SoCal counties — San Bernardino, Riverside and Orange — each have more than 300,000 people on CalFresh, according to state data. [LAist]The shutdown of the federal government has brought the full or partial closure of many National Park Service sites across California: Muir Woods is fully closed. Alcatraz Island is slated to stay open. Other sites like Point Reyes National Seashore and Fort Point have partial closures, with some parking lots blocked or bathrooms locked. Even some park staff said they didn't learn the plan until Sept. 30 — the afternoon before the government shut down. Yosemite is open, but with lots of changes for visitors. [KQED]      Colorado   Sites and lands in Colorado operated by the National Park Service are open, but \"some services may be limited or unavailable,\" according to the agency's website. [Colorado Public Radio]In Colorado, the federal government employs thousands of workers at climate or land-management agencies. An EPA spokesperson told CPR News that the agency is operating under its shutdown plan, which would furlough thousands of employees. [Colorado Public Radio]Court documents show almost 200 Colorado-based positions that the Interior Department wants to cut. [Colorado Public Radio]Unemployment claims from Colorado's federal workers are surging amid the U.S. government shutdown. Stephanie Rogers, a Colorado-based microbiologist with the Food and Drug Administration, told CPR she filed for unemployment the day after the shutdown started. [Colorado Public Radio]   Coloradans: Been impacted by the federal government shutdown? Colorado Public Radio wants to hear from you.      Connecticut   Connecticut will continue federally funded food assistance programs for state residents during the government shutdown, Gov. Ned Lamont said on Wednesday. But he said the state's reserve money for SNAP, the food assistance program for low-income families, will run out by the end of the month. [WSHU]Connecticut has a $2.5 billion budget surplus this year — its second largest in history. Advocates are asking Lamont to consider using it to help offset the federal shortfall. Legislative leaders are considering appropriating the money during a special session next month. [WSHU]      Georgia   For federal workers living paycheck to paycheck, one option to get through being furloughed could be filing for unemployment insurance, Georgia Labor Commissioner Barbara Rivera Holmes said. The employees will have to pay the benefits back once the shutdown ends and they receive back pay, but the benefits can help them make ends meet while they are not being paid. [GPB]Georgia farmers could also face delays in block grant funding and commodity data they rely on during the time-sensitive season of planting and harvesting. [NPR]      Hawaii   University of Hawaiʻi is paying affected employees out of pocket during shutdown. Over 830 University of Hawaiʻi employees are at least partially paid through federal dollars, with thousands more in positions that are fully federally funded. UH has been able to pay them with internal funds, but it costs more than $20 million a pay period — every two weeks — for the system to match their salaries. [Hawaiʻi Public Radio]   For more on the impact in Hawai'i, head to Hawaiʻi Public Radio.      Illinois   Three workers who spoke with the Chicago Sun-Times said they haven't been furloughed, but they've dealt with uncertainties and fragmented coordination since the federal government shut down Oct. 1 on top of a year of uncertainty. [Chicago Public Media]      Indiana   An estimated 24,000 civilians in Indiana work for the federal government. Gleaners Food Bank set up food distribution systems to help federal workers in Indiana impacted by the shutdown. [WFYI]       Iowa    Over 60,000 Iowans participate in the Special Supplemental Nutrition Program for Women, Infants and Children. [IPR]The government shutdown stops USDA from administering farm subsidies, raising the specter of growing farm foreclosures across the Midwest. It also delays a bailout President Trump had promised for farmers impacted by tariffs. [Harvest Public Media]      Kansas   If the federal government shutdown continues, the Mid-America Regional Council said it may need to temporarily close Head Start centers serving more than 2,300 Kansas City children beginning Nov. 1. [KCUR]The government shutdown stops USDA from administering farm subsidies, raising the specter of growing farm foreclosures across the Midwest. It also delays a bailout President Trump had promised for farmers impacted by tariffs. [Harvest Public Media]During the last two shutdowns, the USDA did not publish its monthly crop reports. This comes at an inconvenient time as Midwest farmers are in harvest season. [KCUR]   For more on the impact in Kansas City, head to KCUR.      Kentucky   Funding for food assistance benefits next month isn't coming, Gov. Andy Beshear said, due to the federal government shutdown. Funding for the Temporary Assistance for Needy Families program is also delayed. [LPM]      Louisiana   The National Flood Insurance Program, or NFIP, is managed by FEMA and provides flood insurance to those who don't have a private option. It has grown in size as most homeowner's insurance policies across the U.S. have dropped flood damage entirely. It covers nearly half a million Louisianans. Policyholders with expiring contracts could lose coverage and funds to pay claims have dropped $30 billion due to the shutdown. [WWNO/WRKF]   For more on the impact in Louisiana, head to WWNO/WRKF.      Maine   Nearly 170,000 Mainers, or over 12% of the state's total population, could lose food assistance if SNAP benefits are not funded for November. [Maine Public]Even though much of the staff of Acadia National Park in Maine has been furloughed, it has still been busy at the park. [Maine Public]       Massachussetts   While travelers across the U.S. are experiencing delays and cancellations as a result of the ongoing federal government shutdown, it's mostly business as usual at Boston's Logan International Airport. [GBH]      Michigan   In response to how the federal shutdown will affect rural flights in Michigan, airport officials said they are continuing with \"business as usual.\" At least, for now. Federal funding for the Essential Air Service (EAS) program is set to extend only through Nov. 2. [Michigan Public]      Minnesota   Thousands of Minnesotans might not receive federal food aid benefits if the government shutdown continues into November, as federal officials have told states that funding for SNAP benefits is running out. [MPR News]      Missouri   Roughly 650,000 Missourians will not receive SNAP benefits for the month of November due to the ongoing government shutdown. [St. Louis Public Radio]The Gateway Arch and Old Courthouse in downtown St. Louis are temporarily closed, with National Park Service work largely on hold. [St. Louis Public Radio]      New Hampshire   SNAP serves more than 75,000 people in New Hampshire. And while state officials say they've received extra money to keep WIC running into November, it's unclear if SNAP will also be funded. [NHPR]On Oct. 7, Sen. Jeanne Shaheen, D-N.H., the veteran appropriator who has helped broker past bipartisan deals, told NPR, she has been working behind the scenes with senators from both parties to \"find common ground.\" [NPR]   For more on the impact in New Hampshire, head to NHPR.      North Dakota   The state-owned Bank of North Dakota is partnering with local banks and credit unions to provide short-term low interest loans to federal government employees and members of the armed services stationed in North Dakota, if they experience financial hardship because of the federal government shutdown. [Prairie Public]   For more on the impact in North Dakota, head to Prairie Public.      Oklahoma   With the federal government shut down, National Park rangers are not present at the Oklahoma City National Memorial and Museum. Victims, family members and first responders are stepping in to educate visitors on the location's story.⁠ [KOSU]      Oregon   The federal government program used to subsidize commercial flights in Pendleton got a last-minute reprieve from grinding to a halt due to the partial government shutdown. But as of Wednesday, immediate answers on how that might affect Eastern Oregon's only commercial airport are in short supply. The municipally operated Eastern Oregon Regional Airport in Pendleton holds the only Essential Air Service (EAS) contract in the state, a federal program that helps rural airports operate. [OPB]      Pennsylvania   Tens of thousands of Pennsylvania-based federal workers furloughed during the government shutdown may be eligible for unemployment compensation through the state Department of Labor & Industry. [WITF]      Tennessee   On Oct. 7, the FAA notified local officials in Nashville that flights in and out of Nashville International Airport (BNA) would be reduced Tuesday afternoon due to a shortage of air traffic controllers during the government shutdown. Nashville's airport was back to normal by Wednesday morning. [WLPN]      Texas   U.S. Customs and Border Protection employees who inspect cargo at the 32 other official ports of entry are among the essential federal workers who must remain on the job unpaid. The longer the shutdown lasts, the greater the risk of cargo backups at these Texas ports due to unpaid employees calling in sick. [Houston Public Media]      Utah   In Ogden, Utah, about 10 percent works for the IRS, and when federal workers stop getting paychecks, impacts are felt quickly and broadly. (KUER)      Vermont   If SNAP benefits run out at the end of the month, 63,000 Vermonters would lose their benefits. SNAP dollars fund the Vermont program 3SquaresVT. [Vermont Public]Though the Vermont Legislature passed a state budget in May that set aside about $100 million to offset potential federal funding losses, Secretary of Human Services Jenney Samuelson told lawmakers last week that the state might not be able to leverage those reserves. [Vermont Public]Meanwhile, Vermont is waiting on more than $22 million in federal funds for the Low Income Home Energy Assistance, or LIHEAP, which helps people who can't afford to fill their heating tanks this winter. [Vermont Public]   For more on the impact in Vermont, head to Vermont Public.      Washington   On Oct. 6, state officials say they have enough to cover WIC for the next two weeks. Seattle and King County have partnered to dedicate nearly $2 million to provide one-time vouchers to an estimated 30,000 clients in King County who rely on WIC. [KUOW]The Employment Security Department says the 80,000 federal workers in Washington State may qualify for unemployment benefits. [OPB]      Wyoming   On Oct. 3, Gov. Mark Gordon said Wyoming will cover gaps in funding to federally funded state employees who are in the state budget \"in the short-term.\" [Wyoming Public Media]   For more on the impact in Wyoming, head to Wyoming Public Media.      NPR's Padma Rama, Emily Alfin Johnson and Heidi Glenn edited this piece.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The federal government is still shut down. Here's what that means across the country",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2Ff2%2Fa4cfe06943b187246c2bd2393fd4%2Fgettyimages-2242059574.jpg"
      ],
      "datePublished": "2025-10-22T09:04:00.000Z",
      "dateModified": "2025-10-22T09:04:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VP Vance tries to progress Gaza ceasefire. And, White House demolition draws critics",
    "url": "https://www.npr.org/2025/10/22/g-s1-94462/up-first-newsletter-jd-vance-israel-gaza-government-shutdown-white-house-ballroom",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2F2b%2Fcbd64ac242b7b2ea3945070bf5dd%2Fgettyimages-2242022226.jpg",
    "tag": "Politics",
    "date": "2025-10-22T11:44:58.000Z",
    "description": "\n      \n      VP Vance In Israel, Shutdown Politics, White House Under Construction\n    \n            \n                \n                Transcript\n    ",
    "body": "\n      \n      VP Vance In Israel, Shutdown Politics, White House Under Construction\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/g-s1-94462/nx-s1-mx-5771497\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.   Today's top stories   Vice President JD Vance is in Israel, where he is set to meet with Prime Minister Benjamin Netanyahu. The Gaza ceasefire has been in place for almost two weeks. Vance says the deal is continuing to progress despite the fighting between Israel and Hamas over the weekend. The vice president, along with several other U.S. officials in Israel, is working to get the two sides to take the next steps under the deal.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President JD Vance gestures as he departs a press conference following a military briefing at the Civilian Military Coordination Center in southern Israel on Oct. 21. Vance is expected to meet top US Middle East envoys and military experts monitoring the fragile US-brokered ceasefire in Gaza.\n                \n                    Fadel Senna/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Fadel Senna/AFP via Getty Images\n    \n\n   \n   🎧 The next phase of the ceasefire poses challenges as Gaza doesn't have a government, and it isn't clear when it will have one, NPR's Greg Myre tells Up First. Vance says other things, like getting the people of Gaza food, medicine and security, should happen first. Other big issues that need to be addressed are the next phase's calls for Hamas to disarm, Israeli troops to pull back and international troops to take their place in Gaza as a stabilization force. To work on these priorities, U.S. troops built a civilian-military coordination center outside of Gaza for officials from the U.S. and other countries, as well as other organizations working in Gaza, so that they can synchronize efforts.   \n   Democratic House Minority Leader Hakeem Jeffries believes that public pressure will intensify on Republicans in the coming days to extend health insurance subsidies, which are a key sticking point in the shutdown fight. The federal government remains shut down after the Senate failed to pass a spending bill again on Monday. Congressional leaders continue to avoid negotiating an end to the shutdown. The White House has attempted to end the standoff between the two sides by threatening Democrats with more cuts to spending and the workforce.    🎧 President Trump has praised Office of Management and Budget Director Russell Vought for cutting \"Democrat priorities\" that the party will not get back. The president has repeatedly referred to \"Democrat programs,\" but NPR's Stephen Fowler says there are no such things, because the federal employees who process Social Security payments and handle taxes work in a nonpartisan manner. Vought has announced plans to cancel grants for energy projects in Democratic-led cities and states and other efforts to make Democrats feel the fiscal impact. The off-year elections are on Nov. 4, and they could reflect voter discontent with Republican governance, including the shutdown, Fowler says.   Images of an excavator demolishing the facade of the East Wing of the White House went viral this week. The construction marks the groundbreaking for the president's $250 million ballroom project. Trump has wanted to build the ballroom for more than a decade, but not everyone is pleased with the developments, and historic preservation groups are expressing concerns.    \n   🎧 The demolition has taken many people by surprise because Trump downplayed the impacts when he announced the project in July, says NPR's Tamara Keith. The National Capital Planning Commission would typically have a role in approving a project like this, but it is currently not operating due to the government shutdown. Trump says he is funding some of the ballroom project, and other donors include major corporations with business before the government, Keith says. Google is donating over $20 million to settle a civil suit that Trump filed. Watchdogs say this is one of many reasons the project is an ethical red flag.   Today's listen   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Karine Jean-Pierre gives an interview on her new book \"Independent: A Look Inside a Broken White House, Outside the Party Lines\".\n                \n                    Bronson Arcuri/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Bronson Arcuri/NPR\n    \n\n   \n   Former White House press secretary Karine Jean-Pierre, who served during the Biden administration, has released her new book, Independent: A Look Inside a Broken White House, Outside the Party Lines. She wrote about how the Democratic Party's internal dysfunction led to its downfall during the 2024 presidential election. Before her new book hit store shelves, Morning Edition host Michel Martin sat down with Jean-Pierre. During their conversation, Jean-Pierre reflected on her decision to leave the party she once represented and the scrutiny she faced in her role as press secretary. Watch their interview here. Listen to Jean-Pierre discuss her decision to identify as an independent and read five takeaways from the conversation.   Life advice   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Grab a mug! It's fall now.\n                \n                    Stefania Pelfini la Waziya/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stefania Pelfini la Waziya/Getty Images\n    \n\n   \n   From vibrantly colored leaves to comforting weather, fall is a favorite season for many people. With all the excitement the season brings, you might feel anxious about making the most of this time of year. Life Kit has put together a list of simple ideas to help make the lead-up to Halloween feel festive.    🍂 Make simple adjustments as the days shorten, like switching from a cold breakfast to a warm one or lighting candles, to prepare your nest.🍂 When decorating, think about your commitment to putting away the decorations. This could be especially important as the end-of-the-year holidays approach.🍂 Don't feel pressured to find the perfect Halloween costume. It can be fun to try something unexpected, like dressing up as an inanimate object. Have you ever considered being a fruit or a bottle of Windex?   \n   For tips on how to embrace a lifestyle of rest and coziness, listen to this episode of NPR's Life Kit. Subscribe to the Life Kit newsletter for expert advice on love, money, relationships and more.   3 things to know before you go   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Researchers say fewer children developed peanut allergies after guidelines were put into place calling for introducing peanut products to young children.\n                \n                    Patrick Sison/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Patrick Sison/AP\n    \n\n   \n   A new study in the journal Pediatrics reveals that a reversal in health guidance for when to feed babies peanuts helped prevent tens of thousands of peanut allergy cases in children under 3 in the U.S.The 2026 Sundance Film Festival will honor its founder, Robert Redford, who died in September at the age of 89. January's event will also include a Park City legacy program with film screenings from previous editions and artist talks. (via KPCW)A federal judge has ordered the Department of Defense to return books about gender and race to five school libraries on military bases, following claims that the removal violated students' First Amendment rights.   This newsletter was edited by Suzanne Nuyen.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VP Vance tries to progress Gaza ceasefire. And, White House demolition draws critics",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fba%2F2b%2Fcbd64ac242b7b2ea3945070bf5dd%2Fgettyimages-2242022226.jpg"
      ],
      "datePublished": "2025-10-22T11:44:58.000Z",
      "dateModified": "2025-10-22T11:44:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats call for a hearing on the use of the military on alleged drug boats",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5581356/democrats-call-for-a-hearing-on-the-use-of-the-military-on-alleged-drug-boats",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-22T08:52:30.000Z",
    "description": "\n      The White House has ordered several deadly strikes on alleged drug boats in the Caribbean. NPR's Michel Martin talks to Rep. Adam Smith, D-Wash",
    "body": "\n      The White House has ordered several deadly strikes on alleged drug boats in the Caribbean. NPR's Michel Martin talks to Rep. Adam Smith, D-Wash., about why he's calling for a hearing on the missions.   \n\n    MICHEL MARTIN, HOST:  The Trump administration has acknowledged killing more than 30 people in the last two months as it destroyed boats in the Caribbean it says were carrying drugs. Now Congressman Adam Smith, the top Democrat on the House Armed Services Committee, is calling for a hearing to examine this use of military force. Congressman Smith represents the 9th District in Washington State. He's on the line with us this morning. Good morning, Congressman. Thanks for joining us.ADAM SMITH: Good morning. Thanks for having me on.MARTIN: So what are some of the questions you have for the Trump administration?SMITH: Well, there's been a complete lack of transparency. I mean, there's several layers to the problem, but No. 1 is just a clear explanation of who's being killed, why and what the strategy is. And, you know, the Trump administration has basically said that drug traffickers leave us alone, and this is highly unusual. I mean, obviously, ever since 9/11, we've had the U.S. military involved in going after various terrorist organizations. But the Armed Services Committee and the intel committees had always been very well-informed about that. We knew who the people were who were being targeted. We knew why, and we knew how they were connected to a larger picture of al-Qaida or ISIS. Here, Trump basically says, they're drug dealers. We blew them up. End of story. So you've got that problem - lack of transparency.Second, the explanations that have been offered by the administration have varied. You know, sometimes they talk about them being, you know, narcoterrorists. Other times, they talk about how they're connected to governments in Venezuela and Colombia that they don't like. So is this regime change, or is this an effort at stopping drug trafficking? And then we've heard these explanations - you know, oh, gosh, we've got to stop fentanyl. You know, fentanyl's the issue. Fentanyl doesn't come out of Venezuela, OK? This is cocaine and marijuana. So there is no clear explanation, and we are talking about the U.S. government making the decision to kill somebody without an adequate explanation. That's a major problem legally, morally and in terms of what the U.S. ought to be doing in the world.MARTIN: So you're asking for House Republicans to return to the Capitol in order to hold this hearing. I do think most people understand that Republicans control both Houses of Congress, as well as the White House, so they are the ones who sort of determine the committee calendar. So the first question is, have you spoken with the committee chair, Mike Rogers? Is this something that he is interested in also? And second, is there any indication that the speaker would agree to bring people back to hold this hearing?SMITH: Yeah. I've not spoken to Mike directly. Our staffs have communicated. I'm going to see him today. I know there are Republicans who are concerned about this, along the same lines that I have been. I have not yet received any assurances that they are interested in coming back and holding the hearing. And I also want your listeners to fully understand just how unprecedented it is for Congress to not be in session during a government shutdown. We have been through a number of shutdowns. Congress, the House, has always been in session, precisely because, gosh, we got to talk. We got to figure out how to get the government open. So to actually have completely shut down the United States House of Representatives is a dangerous step, in my mind. We're supposed to be working on a wide variety of issues.MARTIN: Outside of a hearing, do the Democrats have any recourse to seek answers on the legality of these attacks?SMITH: I mean, the recourse - two steps. One, we can ask, as we have a number of people at the Pentagon. But do remember that President Trump, you know, fired, you know, all of the inspector generals, then fired a whole bunch of the judge advocate generals, who are the lawyers for the Department of Defense, who are supposed to give advice when they say, hey, can we hit this boat? The lawyers go, OK, well, here's why you can or why you can't. A lot of those people have been fired. The ones that are there, the focus is on loyalty to Trump, not on loyalty to the law or the ethics of the situation. So that also undermines the ability to get to those right answers. And then lastly, as we spoke about a little bit, Admiral Holsey, who is the Southern Command Commander, who is the one who ultimately has the authority to make the decision directly in theater, resigned.MARTIN: Yeah. Yeah. What do you know about that? As you also mentioned, the Pentagon said unexpectedly - well, unexpected to us, anyway - that Admiral Holsey was retiring. Head of U.S. Southern Command, as you said, oversees military operations in Latin America. Do you know why he retired?SMITH: Yeah. I know three things. No. 1, it is highly unusual for a combatant commander to resign one year into what is typically a four-year assignment. It just doesn't happen. Two, there was a lot of controversy swirling around the legality of these strikes. Many, many people, including myself, feel they are illegal, so it is an illegal order. And three, there are a number of rumors, not that I have been able to track down specifically and directly, that Admiral Holsey was concerned about the legality of the strikes and that that conflict had a lot to do with why, ultimately, he was either forced out or decided to resign.MARTIN: So before we let you go, we only have 30 seconds left. Assuming that there is no hearing called by the broader committee, do you have any recourse to ask Admiral Holsey why he retired?SMITH: We - again, we can ask. We don't necessarily get an answer to that. The other thing is, the Republicans could actually do their job. They could actually recognize that Congress exists, and we could vote to do this. And last point. This is really about power for Donald Trump as much as it is about drug policy.MARTIN: That's Representative Adam Smith. He's a Democrat from Washington State. Representative Smith, thank you so much for joining us.SMITH: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats call for a hearing on the use of the military on alleged drug boats",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-22T08:52:30.000Z",
      "dateModified": "2025-10-22T08:52:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mamdani's rise in NYC reflects a generational fight within the Democratic Party",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5581418/mamdani-cuomo-nyc-mayor",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F96%2Fb96b033548c0b8213de4ffb7cb97%2Fgettyimages-2241088048.jpg",
    "tag": "Politics",
    "date": "2025-10-22T09:02:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Candidates Andrew Cuomo (left) and Zohra",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Candidates Andrew Cuomo (left) and Zohran Mamdani shake hands during a mayoral debate in New York on Oct. 16.\n                \n                    Angelina Katsanis/Bloomberg via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Angelina Katsanis/Bloomberg via Getty Images\n    \n\n   \n   When state lawmaker Zohran Mamdani and former Gov. Andrew Cuomo faced off in the first New York City mayoral debate of the general election, the generational battle within the Democratic Party was on full display.   Cuomo was long a member of Democratic royalty, leading New York as governor for nearly 11 years after serving in the Clinton administration.  His late father, Gov. Mario Cuomo, was a Democratic Party icon.    Again and again, Cuomo hammered the idea that his deep resume makes him uniquely qualified to lead America's biggest city.   \"This is no job for on-the-job training,\" Cuomo said during the Oct. 16 exchange, painting Mamdani as a political novice with left-leaning ideas outside the mainstream. \"He never has had a job. On his resume it said he interned for his mother. This is not a job for a first-timer.\"   \n   But Cuomo is running in this race as an independent after Mamdani, who turned 34 last weekend, trounced him during the Democratic Party primary. Mamdani was an unknown outside his state Assembly district until this year, but has led consistently in the general election by double-digit margins, according to polls.   \"What I don't have in experience, I make up for in integrity,\" Mamdani said during the debate. \"And what you don't have in integrity, you could never make up for in experience.\"   \n   That barb pointed to the downside of Cuomo's long track record in office: It comes with some gritty political baggage, including a sexual misconduct scandal that led Cuomo to resign as governor in 2021.    Cuomo has denied any wrongdoing. But Andres Bernal, a political analyst who lectures at the City University of New York, thinks many young voters look at Cuomo's history of controversy and are reminded of the Democratic Party establishment that has left them disillusioned.     \"It's a revolving door with a lot of corporate America, a lot of funders and lobbyists,\" he said.   Bernal says Mamdani overcame Cuomo's attacks over his relatively thin resume by offering big progressive ideas, like freezing apartment rents and offering free city bus service, that appeal to many young voters.     \n   \"Be ambitious and look for fundamental changes that I think inspire a lot of people and I think are associated with Mamdani's youth,\" Bernal said.   It seems to be working. The latest poll by AARP and Gotham Polling shows over half of Mamdani's support comes from young New Yorkers, under age 50. For Cuomo, meanwhile, 76% of his support is over age 50.    But it's not only serious policy issues that set these men apart. It's also lived experience and style. When asked during the debate whether they've bought marijuana in New York City's legal cannabis shops, Mamdani laughed and said yes.  Cuomo offered a terse no.    Their starkly different tones have played out in social media, where Cuomo offered conventional campaign ads, often attacking Mamdani. Mamdani's campaign, meanwhile, posts upbeat, often funny and hopeful videos that regularly go viral.     \n   \"Zohran Mamdani is right now the epitome of what you're going to see every other candidate trying to do,\" said J.C. Polanco, a political analyst and professor at the University of Mount St. Vincent in the Bronx.    Polanco is critical of many of Mamdani's left-leaning policy ideas. But he says Mamdani's use of social media to reach young voters is a game changer, allowing him to overcome his relative lack of experience.   \"He has rewritten the book. I love his style; he's a happy warrior,\" he said.   During last week's debate, Cuomo said his campaign's social media messaging has gotten better since he lost the Democratic primary, but he acknowledged playing catch-up.  \"I did not do enough on social media, which is a very effective medium now,\" he said.     While Cuomo and Mamdani have sparred, often bitterly, across this generational party divide, the Republican in the race, Curtis Sliwa, has suggested they're closer on policy issues than their campaign rhetoric suggests. \"We have the architect and the apprentice,\" Sliwa said during the debate.   \n   Early voting is now underway. If Mamdani holds onto his lead through Election Day on Nov. 4, he will represent one more big generational change, serving as the first Muslim mayor in a city that's home to the largest Jewish community outside Israel.   Cuomo has attacked Mamdani repeatedly for criticizing Israel, but that hasn't appeared to slow Mamdani's momentum. Mamdani has picked up some key endorsements from  Jewish leaders in the city and a New York Times-Siena poll last month found most young voters in New York City sympathize more with the Palestinians than with Israel over the war in Gaza.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mamdani's rise in NYC reflects a generational fight within the Democratic Party",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd6%2F96%2Fb96b033548c0b8213de4ffb7cb97%2Fgettyimages-2241088048.jpg"
      ],
      "datePublished": "2025-10-22T09:02:00.000Z",
      "dateModified": "2025-10-22T09:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican Rep. Jeff Hurd of Colorado talks about the ongoing shutdown",
    "url": "https://www.npr.org/2025/10/22/nx-s1-5581346/republican-rep-jeff-hurd-of-colorado-talks-about-the-ongoing-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-22T10:56:54.000Z",
    "description": "\n      Congressman Jeff Hurd, R-Colo., talks about the ongoing government shutdown and how it's affecting federal workers in his state.   \n\n    MICHEL",
    "body": "\n      Congressman Jeff Hurd, R-Colo., talks about the ongoing government shutdown and how it's affecting federal workers in his state.   \n\n    MICHEL MARTIN, HOST:  We've been speaking with lawmakers on both sides of the aisle since the start of the government shutdown 22 days ago. Today, we're joined by Republican Congressman Jeff Hurd of Colorado. Good morning, Congressman. Thank you for - so much for joining us.JEFF HURD: Happy to be with you, Michel.MARTIN: You're in your first term. Did you expect this when you ran?HURD: No, definitely not. I felt like we had a really productive several months in Congress, and now things have unfortunately ground to a halt completely unnecessarily. But we are where we are.MARTIN: Are you hearing from your constituents about this? What are they telling you?HURD: Yeah. So my district is most of western and southern Colorado, and they're frustrated. They're frustrated by the - not just the politics, but also by the uncertainty. I've talked to ranchers and federal workers in places like the Colorado National Monument and families who rely on SNAP, and they are definitely tired of what they see as this Washington dysfunction. You know, and I - my response to them is, look, the House did its job weeks ago. We passed a commonsense bill to keep the government open. It's something that Democrats have supported before. And I tell them, please encourage your senators - reach out to them. Tell them the Senate needs to act and end the filibuster and end the shutdown. But fundamentally, Michel, folks in Colorado don't care about party spin. They just want government to function again.MARTIN: Well, you know, I spoke with House Minority Leader Hakeem Jeffries yesterday, and he talked about the expected increases, which are expected to be caused by the expiration of the ACA tax subsidies. Let's just play a little bit of what he said.(SOUNDBITE OF ARCHIVED NPR CONTENT)HAKEEM JEFFRIES: Costs may increase on a monthly basis by approximately $2,000 per month. That means that health insurance premiums could actually increase to over $24,000 a year. That's unaffordable. The average income of someone who receives an Affordable Care Act tax credit is around $63,000 a year.MARTIN: Congressman, I understand that about 40,000 people in your district get their health coverage through this ACA marketplace. They could see premium increases between - what? - a hundred and forty and 330%, as I understand it, according to the - sort of your state officials' analysis. Are you hearing from them about this, and what are they saying about that?HURD: Yeah, absolutely. People are concerned about the - you know, the cliff that they're facing when it comes to what they're paying for insurance on the premium market. Now, what I say is, listen, I'm on legislation that would extend the enhanced premium tax credits temporarily for a short term. It's something that's important to address the immediate cost increases that we're facing. But long term, we need to look at systemic fixes to the cost of health care.But more fundamentally, I'm concerned about striking any sort of deal now and attaching those tax credit extensions to a shutdown bill. I just - I don't think it's good policy. It's governing by crisis, and it's incentivizing future threats of shutdowns every time somebody wants to leverage for their policy wish list. So I don't think that cutting a deal on enhanced premium tax credits in the middle of a shutdown is the right approach.MARTIN: So here's the argument from the other side. Our - the Democrats say everybody knew that this cliff was coming. The bill that you mentioned passed, you know, months ago. So while Republicans are saying the Democrats knew this was coming, this was expiring, so did Republicans. Like, everybody knew that this cliff was coming. Their argument now is that they need to codify this because they don't trust the Republicans to stand by the deal, and they don't trust the White House to stand by any deal. What do you say to that?HURD: Well, first, the expiration date was written into law when Democrats passed the last extension. They set this deadline. They had the ability to plan for it. They could have resolved it earlier this year in the budget, but I don't remember hearing them talking about this, and it's now being used as leverage for a larger funding fight. I just don't think that kind of brinksmanship is good for Colorado families.MARTIN: Do the Republicans have a plan to keep insurance costs down for Americans? What is it?HURD: Well, certainly. We need a couple things. I mean, the things that come to mind right away that are driving those health care costs are legal reforms. I mean, we have doctors that are practicing defensive medicine completely unnecessarily, ordering tests and procedures that drive up the cost of health care 'cause they're worried about legal fees and getting sued. Nuclear verdict is another concern. How about the cost of prescription drugs? We have a - we need to be addressing those.The other fundamental issue that I see from my perspective is we have a health care system that pays for and rewards volume over value. We need to get to a system that incentivizes payers and providers and health care consumers to be utilizing health care efficiently and effectively.MARTIN: OK. But the...HURD: So, yes, there's a lot of change that needs to be done (ph).MARTIN: ...Republicans control the White House and the Senate and the Congress. So - and so I think the question would be, where's the bill?HURD: Well, I mean, listen, I'm on legislation - for example, on the enhanced premium tax credits - dealing with the subsidy issue. So I'm one of those people that's willing to be in that discussion. When it comes to the other reforms, there are other pieces of legislation that are out there. I am one of those Republicans that's willing to look at those underlying health care cost drivers and fix our health care system. This is something that's incredibly important to my district, both on the individual market side but - and small-group and large-group market, but also on the Medicaid and Medicare side as well.So I'm one of those Republicans - like you mentioned, Michel, I'm a freshman, but I'm one of those Republicans that is willing to be part of those discussions. And we need to have them because this system that we have right now is simply not sustainable.MARTIN: That's Jeff Hurd. He's a congressman. He represents the 3rd District in Colorado, and he's a Republican. Congressman, thanks so much for talking to us. I do hope we'll talk again.HURD: Sounds good. Thank you, Michel.(SOUNDBITE OF THE LITTLEST VIKING'S \"LUMPY SPACE PRINCESS\")\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican Rep. Jeff Hurd of Colorado talks about the ongoing shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-22T10:56:54.000Z",
      "dateModified": "2025-10-22T10:56:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]