[
  {
    "title": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713305/federal-funding-democratic-states-lawsuit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fce%2F9d%2F4a8b3eb6493e8275e7269e6a0981%2Fap26041698014391.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:31:12.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - A sign marks the entrance to the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                FILE - A sign marks the entrance to the U.S. Centers for Disease Control and Prevention headquarters Wednesday, Aug. 27, 2025, in Atlanta. (AP Photo/Brynn Anderson, File)\n                \n                    Brynn Anderson/AP/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brynn Anderson/AP/AP\n    \n\n   \n   President Donald Trump's administration cannot rescind $600 million in public health grants allocated to four Democratic-led states, for now, a federal judge in Illinois ruled Thursday.   \n   California, Colorado, Illinois and Minnesota sued Wednesday to try to block the planned funding cuts to programs that track disease outbreaks and study health outcomes of LGBTQ+ people and communities of color in major cities.   U.S. District Judge Manish Shah stopped the cuts from taking effect for 14 days, saying in his order that the states \"have shown that they would suffer irreparable harm from the agency action.\" That will keep grant money flowing from the Centers for Disease Control and Prevention to state and city health departments and their partner organizations while the challenge proceeds.   \n   The first batch of grants could have been pulled Thursday if the judge had not intervened, Colorado Attorney General Phil Weiser said.   The Department of Health and Human Services said the grants are being terminated because they do not reflect CDC priorities, which were revised last year to align with the administration's shift away from health equity, the idea that certain populations may need additional support to eliminate health disparities.   Much of the money helped cities fight the spread of HIV and other sexually transmitted infections, especially among gay and bisexual men, adolescents and ethnic minorities.   \n   Federal health officials did not immediately respond to requests for comment on the judge's order.   Officials in the four states are among Trump's strongest political foes and view the cuts as retaliation for opposing his immigration enforcement crackdown. All have been targets of other federal cuts, including for food assistance programs, child care subsidies and electric vehicle infrastructure.   Their lawsuit, led by Illinois Attorney General Kwame Raoul, argues that the health care cuts violate the Constitution by imposing retroactive conditions on funding that Congress already awarded.   \"Targeting four Democrat-run states that are standing up to his completely unrelated immigration policies is a transparent attempt to bully us into compliance,\" Raoul said. \"The president may be playing politics with critical public health funding, including more than $100 million to Illinois, but our residents are the ones who pay the price.\"   \n   The attorneys general say the loss of funding would force them to lay off hundreds of public health workers.   Minnesota Attorney General Keith Ellison said they will seek to extend the judge's pause for the duration of the lawsuit.   Courts have temporarily blocked similar efforts by the Trump administration, including a plan to cut off billions for child care subsidies and other programs for low-income families in the four states, plus New York.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks Trump admin from rescinding health grants to Democratic-led states",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fce%2F9d%2F4a8b3eb6493e8275e7269e6a0981%2Fap26041698014391.jpg"
      ],
      "datePublished": "2026-02-13T07:31:12.000Z",
      "dateModified": "2026-02-13T07:31:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DHS expected to shut down as talks over immigration enforcement reform falter",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5712312/dhs-expected-to-shut-down-as-talks-over-immigration-enforcement-reform-falter",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-13T11:44:43.000Z",
    "description": "\n      \n      DHS expected to shut down as talks over immigration enforcement reform falter\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      DHS expected to shut down as talks over immigration enforcement reform falter\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5712312/nx-s1-9647514\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      A stopgap bill to temporarily fund the Department of Homeland Security expires Friday night. DHS could be without funding for days, as the House and Senate are expected to be in recess next week.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DHS expected to shut down as talks over immigration enforcement reform falter",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-13T11:44:43.000Z",
      "dateModified": "2026-02-13T11:44:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Swing voters in Arizona say ICE should be reformed",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5707491/swing-voters-in-arizona-say-ice-should-be-reformed",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-13T09:47:09.000Z",
    "description": "\n      \n      Swing voters in Arizona say ICE should be reformed\n    \n        \n                Download\n                \n                \n            ",
    "body": "\n      \n      Swing voters in Arizona say ICE should be reformed\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5707491/nx-s1-9647415\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep speaks to Rich Thau, who runs focus groups with swing voters and recently asked for their opinions on the Trump administration's immigration policies.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Swing voters in Arizona say ICE should be reformed",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-13T09:47:09.000Z",
      "dateModified": "2026-02-13T09:47:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "RFK Jr. made promises to get his job as health secretary. He's broken many of them",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5712721/rfk-jr-children-vaccines-cdc-funding-autism-immunizations",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8211x4619+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc5%2F24%2F25b35eb64330a411436fa2e88d26%2Fgettyimages-2199432719.jpg",
    "tag": "Politics",
    "date": "2026-02-13T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Robert F. Kennedy Jr. was sworn in as se",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Robert F. Kennedy Jr. was sworn in as secretary of health and human services in the Oval Office on Feb. 13, 2025.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   One year after taking charge of the nation's health department, Health and Human Services Secretary Robert F. Kennedy Jr. hasn't held true to many of the promises he made while appealing to U.S. senators concerned about the longtime anti-vaccine activist's plans for the nation's care.   Kennedy squeaked through a narrow Senate vote to be confirmed as head of the Department of Health and Human Services only after making a number of public and private guarantees about how he would handle vaccine funding and recommendations as secretary.   Here's a look at some of the promises Kennedy made during his confirmation process.   \n   The childhood vaccine schedule   In two hearings in January 2025, Kennedy repeatedly assured senators that he supported childhood vaccines, noting that all his children were vaccinated.   Sen. Elizabeth Warren, D-Mass., grilled Kennedy about the money he has made in the private sector from lawsuits against vaccine makers and accused him of planning to profit from potential future policies making it easier to sue.   \"Kennedy can kill off access to vaccines and make millions of dollars while he does it,\" Warren said during the Senate Finance Committee hearing. \"Kids might die, but Robert Kennedy can keep cashing in.\"   Warren's statement prompted an assurance by Kennedy.   \"Senator, I support vaccines,\" he said. \"I support the childhood schedule. I will do that.\"   Days later, Sen. Bill Cassidy of Louisiana, a Republican and chairman of the Senate Health, Education, Labor and Pensions Committee, declared that Kennedy had pledged to maintain existing vaccine recommendations if confirmed.    \n\n    \n        \n    \n        \n                    YouTube\n                \n        \n   Cassidy, a physician specializing in liver diseases and a vocal supporter of vaccination, had questioned Kennedy sharply in a hearing about his views on shots.   \"If confirmed, he will maintain the Centers for Disease Control and Prevention's Advisory Committee on Immunization Practices' recommendations without changes,\" Cassidy said during a speech on the Senate floor explaining his vote for Kennedy.   A few months after he was confirmed, Kennedy fired all the incumbent members of the vaccine advisory panel, known as ACIP, and appointed new members, including several who, like him, oppose some vaccines. The panel's recommendations soon changed drastically.   \n   Last month, the CDC removed its universal recommendations for children to receive seven immunizations: those protecting against respiratory syncytial virus, meningococcal disease, flu, COVID-19, hepatitis A, hepatitis B and rotavirus. The move followed a memorandum from the White House calling on the CDC to cull the schedule.   Now, those vaccines, which researchers estimate have prevented thousands of deaths and millions of illnesses, are recommended by the CDC only for children at high risk of serious illness or after consultation between doctors and parents.   In response to questions about Kennedy's actions on vaccines over the past year, HHS spokesperson Andrew Nixon said the secretary \"continues to follow through on his commitments\" to Cassidy.   \"As part of those commitments, HHS accepted Chairman Cassidy's numerous recommendations for key roles at the agency, retained particular language on the CDC website, and adopted ACIP recommendations,\" Nixon added. \"Secretary Kennedy talks to the chairman at a regular clip.\"   Cassidy and his office have repeatedly rebuffed questions about whether Kennedy, since becoming secretary, has broken the commitments he made to the senator.   Vaccine funding axed   Weeks after Kennedy took over the federal health department, the CDC pulled back $11 billion in COVID-era grants that local health departments were using to fund vaccination programs, among other initiatives.   That happened after Kennedy pledged during his confirmation hearings not to undermine vaccine funding. Kennedy replied, \"Yes\" when Cassidy asked him directly: \"Do you commit that you will not work to impound, divert, or otherwise reduce any funding appropriated by Congress for the purpose of vaccination programs?\"   A federal judge later ordered HHS to distribute the money.   The National Institutes of Health, part of HHS, also yanked dozens of research grants supporting studies of vaccine hesitancy last year. Kennedy, meanwhile, ordered the cancellation of a half-billion dollars' worth of mRNA vaccine research in August.   \n   A discredited theory about autism   Cassidy said in his floor speech that he received a guarantee from Kennedy that the CDC's website would not remove statements explaining that vaccines do not cause autism.   Technically, Kennedy kept his promise not to remove the statements. The website still says that vaccines do not cause autism.   But late last year, new statements sprang up on the same webpage, baselessly casting doubt on vaccine safety. \"The claim 'vaccines do not cause autism' is not an evidence-based claim because studies have not ruled out the possibility that infant vaccines cause autism,\" the page on autism now misleadingly reads.   The webpage also states that the public has largely ignored studies showing that vaccines do cause autism. That is false. Over decades of research, scientific studies have repeatedly concluded that there is no link between vaccines and autism.   A controversial 1998 study that captured global attention did link the measles, mumps and rubella vaccine to autism. It was retracted for being fraudulent — though not until a decade after it was published, during which there were sharp declines in U.S. vaccination rates.      KFF Health News is a national newsroom that produces in-depth journalism about health issues and is one of the core operating programs at KFF.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "RFK Jr. made promises to get his job as health secretary. He's broken many of them",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8211x4619+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc5%2F24%2F25b35eb64330a411436fa2e88d26%2Fgettyimages-2199432719.jpg"
      ],
      "datePublished": "2026-02-13T10:00:00.000Z",
      "dateModified": "2026-02-13T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sen. Ruben Gallego talks about debate over DHS funding as deadline approaches",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5712516/sen-ruben-gallego-talks-about-debate-over-dhs-funding-as-deadline-approaches",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-13T11:44:38.000Z",
    "description": "\n      \n      Sen. Ruben Gallego talks about debate over DHS funding as deadline approaches\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      Sen. Ruben Gallego talks about debate over DHS funding as deadline approaches\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5712516/nx-s1-9647513\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep asks Democratic Sen. Ruben Gallego of Arizona about the fight over funding for the Department of Homeland Security.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sen. Ruben Gallego talks about debate over DHS funding as deadline approaches",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-13T11:44:38.000Z",
      "dateModified": "2026-02-13T11:44:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minnesota Sen. Amy Klobuchar talks about last effect of federal immigration crackdown",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5712399/minnesota-sen-amy-klobuchar-talks-about-last-effect-of-federal-immigration-crackdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-13T09:46:23.000Z",
    "description": "\n      \n      Minnesota Sen. Amy Klobuchar talks about last effect of federal immigration crackdown\n    \n        \n                Download\n           ",
    "body": "\n      \n      Minnesota Sen. Amy Klobuchar talks about last effect of federal immigration crackdown\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5712399/nx-s1-9647442\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep asks Sen. Amy Klobuchar, D-Minn., about the lingering impact of the federal immigration crackdown in Minnesota.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota Sen. Amy Klobuchar talks about last effect of federal immigration crackdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-13T09:46:23.000Z",
      "dateModified": "2026-02-13T09:46:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For the first time, lawmakers are reviewing unredacted copies of the Epstein files",
    "url": "https://www.npr.org/2026/02/12/nx-s1-5712359/for-the-first-time-lawmakers-are-reviewing-unredacted-copies-of-the-epstein-files",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-12T22:32:14.000Z",
    "description": "\n      \n      For the first time, lawmakers are reviewing unredacted copies of the Epstein files\n    \n            \n                \n                Tr",
    "body": "\n      \n      For the first time, lawmakers are reviewing unredacted copies of the Epstein files\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5712359/nx-s1-9647047\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Lawmakers are just beginning to review unredacted versions of the Epstein files but those who have read them say the system is complicated and insufficient.   \n\n    AILSA CHANG, HOST:  For the first time, lawmakers can review unredacted copies of the Justice Department's Epstein files to see what information has been withheld from versions that were released to the public. Maryland Democrat Jamie Raskin says what they've learned is that they have only scratched the surface.JAMIE RASKIN: The ones they're not releasing are the ones that are piquing my interest the most. And we've probably been able to look at less than 1% of them.CHANG: Lawmakers argue that the already difficult process of combing through the millions of files is now being hindered. Joining us now is NPR congressional correspondent Claudia Grisales, who's been following all of this. Hi, Claudia.CLAUDIA GRISALES, BYLINE: Hi, Ailsa.CHANG: OK, so I've been hearing lawmakers say that they've been under surveillance, basically, by the Justice Department when they're searching through all of these files, like they're being spied on. Can you explain? What is happening?GRISALES: Well, lawmakers are already facing an arcane process when they try to view these records. They have to set an appointment at the Justice Department to get a time slot. And there's only four terminals set up to search through the 3.5 million records released so far. And they can't take in any electronics or any staff. And yesterday, Attorney General Pam Bondi was carrying a binder at a House oversight hearing with a printed list of members who've conducted these searches and the specific documents that they looked at. I talked to New Mexico Democrat Teresa Leger Fernandez about this.TERESA LEGER FERNANDEZ: This is exactly why this whole process is flawed and a sham. And it is an outrage that they are spying on Congress.GRISALES: And she says DOJ should be investigating the Epstein case, not lawmakers who are looking through these documents in controlled searches. And she said when she did look at the files herself, she found names of men that should have been released long ago.CHANG: Interesting. OK, so even though there have been these roadblocks, do we know if these lawmakers are uncovering any new revelations?GRISALES: Yes, they have. The authors of the Epstein Transparency Act - this is Kentucky Republican Thomas Massie and California Democrat Ro Khanna - they've been a key part of forcing the release this week of names of men and co-conspirators that were redacted on some of these files. Ultimately, what a lot of these lawmakers want is what they've heard from the Epstein survivors and what they want, which is a release of the full list of men who they believe were part of this sex trafficking network - and accountability. Here's Vermont Democrat Becca Balint.BECCA BALINT: They really want us to help them change the culture, and we made that commitment to them. How long do we follow this? Until we feel like the work is in a good place. And we're nowhere near that right now.GRISALES: So it's clear they're playing a really big role here.CHANG: Yeah. OK, so then what are some of the other challenges that these lawmakers are facing as they're trying to review these files?GRISALES: Well, they passed a law requiring the release of these files nearly three months ago now. Lawmakers say this process has been riddled with pushback from President Trump and his administration. And until they change their posture or there are changes in leadership, people will not be held accountable. Here's North Carolina (ph) Republican Nancy Mace this morning speaking with our colleagues on Morning Edition.(SOUNDBITE OF ARCHIVED NPR CONTENT)NANCY MACE: And it's going to be up to us in a bipartisan manner in Congress to have the courage and the bravery to bring these people before America and let them answer for what actually happened.CHANG: OK, so what happens next, Claudia?GRISALES: Well, lawmakers say it's going to be an uphill process. It's going to take a lot of time. They're going to keep searching the records that have been released. But we know the Justice Department has not released 3 million records they say are duplicates, but lawmakers are not buying that. So we should expect them to put a lot more pressure on Attorney General Bondi, Trump and his administration to make sure everyone who should be held accountable is.CHANG: That is NPR's Claudia Grisales. Thank you, Claudia.GRISALES: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For the first time, lawmakers are reviewing unredacted copies of the Epstein files",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-12T22:32:14.000Z",
      "dateModified": "2026-02-12T22:32:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713307/trump-nfl-pardons",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3820x2149+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F63%2F41%2F9626d3f24a3b90df1d3c1694a5be%2Fap26043715315685-1.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:41:41.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks during an ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump speaks during an event with Environmental Protection Agency director Lee Zeldin to announce the EPA will no longer regulate greenhouse gases, in the Roosevelt Room of the White House, Thursday, Feb. 12, 2026, in Washington.\n                \n                    Evan Vucci/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Evan Vucci/AP\n    \n\n   \n   WASHINGTON — President Donald Trump on Thursday pardoned five former professional football players — one posthumously — for various crimes ranging from perjury to drug trafficking.   The pardons were announced by White House pardon czar Alice Marie Johnson. Ex-NFL players Joe Klecko, Nate Newton, Jamal Lewis, Travis Henry and the late Billy Cannon were granted the clemency.   \n   \"As football reminds us, excellence is built on grit, grace, and the courage to rise again. So is our nation,\" Johnson wrote on the social media site X, as she thanked Trump for his \"continued commitment to second chances.\"   Johnson said Dallas Cowboys owner Jerry Jones \"personally\" shared the news with Newton, who won three Super Bowls with the team.   The White House did not return a request for comment Thursday night on why Trump, an avid sports fan, pardoned the players.   \n   Klecko, a former star for the New York Jets, pleaded guilty to perjury after lying to a federal grand jury that was investigating insurance fraud. A defensive lineman, Klecko was inducted into the Pro Football Hall of Fame in 2023. He was a two-time Associated Press All-Pro player and a four-time Pro Bowler.   Newton, an offensive lineman, pleaded guilty to a federal drug trafficking charge after authorities discovered $10,000 in his pickup truck as well as 175 pounds of marijuana in an accompanying car driven by another man. Newton was a two-time All-Pro player and six-time Pro Bowler.   \n   Lewis, formerly of the Baltimore Ravens and the Cleveland Browns, pleaded guilty in a drug case in which he used a cellphone to try to set up a drug deal not long after he was a top pick in the 2000 NFL draft. Lewis, a running back, was named an All-Pro once and was a one-time Pro Bowler. He was named the 2003 AP Offensive Player of the Year.   Henry, who played for the Denver Broncos, pleaded guilty to conspiracy to traffic cocaine for financing a drug ring that moved the drug between Colorado and Montana. He was a running back for three teams and a one-time Pro Bowler.   \n   And Cannon — who played with the Houston Oilers, Oakland Raiders and Kansas City Chiefs — admitted to counterfeiting in the mid-1980s after a series of bad investments and debts left him broke.   \n   Cannon was a two-time All-Pro player and a two-time Pro Bowler. Cannon also won the 1959 Heisman Trophy while starring for Louisiana State University, where he had one of the most memorable plays in college football history: an 89-yard punt return for a touchdown against Ole Miss. He died in 2018.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons 5 former NFL players for crimes ranging from perjury to drug trafficking",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3820x2149+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F63%2F41%2F9626d3f24a3b90df1d3c1694a5be%2Fap26043715315685-1.jpg"
      ],
      "datePublished": "2026-02-13T07:41:41.000Z",
      "dateModified": "2026-02-13T07:41:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A historic election in Bangladesh brings BNP to power. What to know about its leader",
    "url": "https://www.npr.org/2026/02/13/nx-s1-5713306/bangladesh-nationalist-party-victory-election-student-uprising-leader",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4e%2Fd3%2Fb9fc763449809b1a642b501829b4%2Fap26043148980377.jpg",
    "tag": "Politics",
    "date": "2026-02-13T07:28:20.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bangladesh Nationalist Party Chairperson",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Bangladesh Nationalist Party Chairperson Tarique Rahman waves as he comes out after casting his vote during the national parliamentary elections in Dhaka, Bangladesh, Thursday, Feb. 12, 2026.\n                \n                    Mahmud Hossain Opu/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mahmud Hossain Opu/AP\n    \n\n   \n   DHAKA, Bangladesh — The Bangladeshi Nationalist Party (BNP), led by Tarique Rahman, claimed victory Friday in the first elections held since the previous government was toppled in a student-led revolution in 2024.   \n   Final results have yet to be announced, with the Election Commission expected to do so in the coming days, but the BNP says it has secured a majority.   Developments in Bangladesh are being closely watched beyond its borders. It is the world's eighth-most populous country and second-largest garment exporter after China, supplying major brands to Europe and the United States - a position the BNP will be keen to protect.   Rahman, 60, hails from a political dynasty. Both of his parents were central figures in the party for decades. His father, military officer and former president Ziaur Rahman, founded the BNP in 1978.   \n   His mother, Khaleda Zia - who died in December - had led the party for more than 30 years and served three times as prime minister.   Rahman's rise follows the uprising in July and August 2024 that resulted in up to 1,400 deaths, according to the United Nations. The unrest ended with former prime minister and Awami League leader Sheikh Hasina fleeing the country.   Jon Danilowicz, an independent political analyst and retired U.S. diplomat who previously served in Bangladesh, told NPR he believes the uprising may serve as a warning for Rahman.   He said: \"Tarique Rahman would not be in the position he is in had he not been Khaleda Zia and Ziaur Rahman's son. But it seems he has understood what has changed in the country. He has acknowledged the July revolution and the sacrifices of those who were on the front line.\"   Rahman faced a tough challenge from Bangladesh's third-largest party, Jamaat-e-Islami, which contested the election as part of an 11-party alliance that included the National Citizen Party (NCP), formed by students who led the uprising.   He now faces the daunting task of steering the South Asian nation of around 180 million people through high inflation, rising unemployment and the growing impacts of climate change.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Security personnel guard near the chairman office of the Bangladesh Nationalist Party (BNP) before the national parliamentary election result is announced in Dhaka, Bangladesh, Thursday, Feb. 12, 2026.\n                \n                    Anupam Nath/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anupam Nath/AP\n    \n\n   \n   It will be an especially challenging task for someone who has never held public office in Bangladesh and returned to the country less than two months ago after 17 years of self-imposed exile in London.   \n   While abroad, Rahman was convicted in Bangladesh of multiple offences while the Awami League was in power, including corruption and money laundering - convictions he and his party rejected as politically motivated.   The rulings were overturned between 2024 and 2025 during an interim period led by Nobel laureate Muhammad Yunus, paving the way for his return.   Challenges ahead   As prime minister, his immediate challenge will be to form a government capable of tackling economic pressures, creating jobs and restoring law and order.   \"There have been a lot of promises made in terms of social welfare programs and family cards, which give women with families a monthly stipend,\" Danilowicz said. \"But there's a fiscal reality the government will face. Bangladesh has one of the lowest taxation rates, and there are limits to how much revenue it can generate.\"   On foreign policy, the BNP government is expected to consolidate its relations with both the United States and China. The BNP has already said it plans to deepen relations with China, Bangladesh's largest trading partner. Relations with neighboring India, however, could prove more complicated.   Prime Minister Narendra Modi's government enjoyed close ties with the Awami League while it was in power and has been sheltering Sheikh Hasina since she fled. New Delhi has so far not responded to requests from Bangladesh to extradite her after a Bangladeshi court sentenced Hasina to death in November last year for crimes against humanity linked to the uprising - a verdict she refutes.   Danilowicz said: \"Bangladesh's population has turned against India over the past 18 months. The challenge for Rahman will be how far the BNP can go towards restoring relations with India without facing a public backlash.\"   Rahman and his party must also contend with a package of reform proposals designed to prevent a return to authoritarian rule. Known as the July National Charter, the plan outlines constitutional, institutional and electoral changes.   \n   It was signed in October last year by leaders of major political parties and approved by voters in a referendum held the same day as the parliamentary elections.   Danilowicz said: \"Certainly, the reforms can make a difference, making it harder for an executive to act in a way that is unchecked by any other institution. That was a fundamental issue that needed to be addressed.\"   With a reasonably robust opposition in parliament in the form of a Jamaat-e-Islami alliance, the BNP government is likely to face closer scrutiny than its predecessor.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A historic election in Bangladesh brings BNP to power. What to know about its leader",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8256x4644+0+430/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F4e%2Fd3%2Fb9fc763449809b1a642b501829b4%2Fap26043148980377.jpg"
      ],
      "datePublished": "2026-02-13T07:28:20.000Z",
      "dateModified": "2026-02-13T07:28:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A bipartisan effort to save health subsidies failed. Will ICE reform be different?",
    "url": "https://www.npr.org/2026/02/13/g-s1-109818/bipartisan-effort-save-health-subsidies-failed-ice-reform-different",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5621x3162+0+293/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe0%2Fcb%2Fa93ce38a411b9c8b2fe04470b3f4%2Fgettyimages-2257668133.jpg",
    "tag": "Politics",
    "date": "2026-02-13T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The dome of the U.S. Capitol is framed t",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The dome of the U.S. Capitol is framed through a tree on Jan. 25.\n                \n                    Al Drago/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Al Drago/Getty Images\n    \n\n   \n   A bipartisan effort in Congress to control immigration enforcement tactics after officers killed two people in Minneapolis is faltering ahead of a Friday deadline to fund the Department of Homeland Security.   It would not be the first time recently that lawmakers pledged to find consensus only for negotiations to fall apart.   A month ago, Sen. Bernie Moreno, R-Ohio, was projecting confidence that a bipartisan group of lawmakers was nearing a deal to restore lapsed health insurance subsidies.   The enhanced Affordable Care Act subsidies expired at the end of last year, despite a majority of Americans in favor of Congress renewing them, according to polling from the nonprofit KFF.   \n   \"We're in the red zone,\" Moreno told reporters. \"But that does not mean a touchdown. It could mean a 95-yard fumble.\"   In the end, there was no touchdown. Moreno told NPR last week that the talks fizzled. He blamed Senate Minority Leader Chuck Schumer, D-N.Y., for shutting them down in order to keep pummeling Republicans over premium costs.   \"Shouldn't we be here trying to figure out how to solve problems rather than trying to score political points for the purposes of the next election?\" Moreno asked.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Bernie Moreno, R-Ohio, speaks to members of the media at the U.S. Capitol on January 13, 2026. Until recently, Moreno was projecting confidence that a deal to restore lapsed health insurance subsidies was in reach.\n                \n                    Kevin Dietsch/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch/Getty Images\n    \n\n   \n   Democrats dispute that characterization, saying Republicans blew up the effort by inserting anti-abortion language in a provision on health savings accounts.   Sen. Chris Murphy, D-Conn., says the effort was doomed to fail — not because of a lack of compromise but because Democrats lost leverage when a few voted to end the shutdown last fall.   \"I was pretty confident the minute we gave up that we weren't going to get it,\" Murphy said.   A bipartisan agreement to address ICE tactics has yet to materialize    Congress' ability to act is again being tested, this time by the aggressive actions of Immigration and Customs Enforcement and Customs and Border Protection agents in Minnesota and elsewhere.   As with the subsidies, public outcry pushed a number of Republicans and Democrats to pledge to do something — in this case, reining in enforcement tactics. Top lawmakers initially signaled optimism that they could find common ground on topics such as requiring that officers wear body cameras.   \n   But within days, that rosiness dissipated. Now Democrats are again threatening to withhold their votes for the measure, risking a shutdown of the department after Friday, unless Republican lawmakers and the White House agree to the reforms they want.   Senate Majority Leader John Thune, R-S.D., has repeatedly blamed Democrats, saying they imposed an unrealistic timeline and then dawdled before producing a laundry list of nonstarters, like banning agents from wearing masks or requiring judicial warrants for enforcement operations in homes.   Schumer and House Minority Leader Hakeem Jeffries, D-N.Y., called the White House's initial response to their demands insufficient and continue to insist that their proposals are reasonable and targeted.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Susan Collins, R-Maine, enters the U.S. Capitol on January 27, 2026. Collins has been a key negotiator in government funding talks, and says the passage of appropriations bills is evidence that Congress can still do hard things.\n                \n                    Heather Diehl/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Heather Diehl/Getty Images\n    \n\n   \n   Asked why bipartisan negotiations keep crumbling, Sen. Susan Collins, R-Maine., who has participated in negotiations on the subsidies and immigration, said Congress does successfully collaborate, like negotiating and passing bipartisan government funding bills worth more than $1 trillion.   \"I don't know how you could possibly describe that as crumbling,\" Collins told NPR. \"That's Congress reasserting its power of the purse.\"   Little incentive to compromise   Heidi Heitkamp, a Democrat who represented North Dakota in the Senate from 2013 through 2018, spent hours in rooms with centrist senators like Collins trying to resolve a standoff over the debt ceiling.   She says bipartisan negotiations have always been a high-wire act, particularly amid a national crisis.   \"When the shock wears off, then all of a sudden everyone goes back to their corners,\" Heitkamp said.   A gang of eight lawmakers tried, but failed, to pass comprehensive immigration reform in 2013. Sens. Cory Booker, D-N.J., and Tim Scott, R-S.C., made progress on policing reform after the murder of George Floyd by a Minneapolis police officer in 2020, but came up empty-handed.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A gang of eight lawmakers, including Sen. Lindsey Graham, R-S.C., tried but failed, to pass comprehensive immigration reform in 2013. Above, from left in the gang of eight were, Sen. Jeff Flake, R-Ariz., Sen. Marco Rubio, R-Fla., Sen. Chuck Schumer, D-N.Y., Graham, Sen. John McCain, R-Ariz., and Sen. Robert Menendez, D-N.J.\n                \n                    J. Scott Applewhite/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        J. Scott Applewhite/AP\n    \n\n   \n   Heitkamp, who until recently directed the University of Chicago's Institute of Politics, says many lawmakers today see even less incentive to compromise as politics becomes more tribal.   \n   \"The base on both sides, their willingness to reward compromise is greatly diminished,\" she said. \"If you look at the Senate of old, there were a lot of egos in that room and a lot of people who made up their own minds, and now what you have is people who are willing to be cogs in the wheel.\"   How inaction diminishes public trust   When Congress promises to act and does not, Heitkamp says, that erodes public trust in the institution's ability to respond to problems.   Sixty-six percent of Americans report having not very much or no trust in Congress, according to a September Gallup survey.   Of the 14 Arizona swing voters who participated in a Feb. 10 online focus group organized by NPR and the Swing Voter Project, only two said they had confidence that Congress would take any action on the immigration-related proposals being discussed.   Sen. Katie Britt, R-Ala., says she is thinking about public trust as she helps lead the current negotiations on immigration enforcement.   \"Anybody can identify a problem,\" Britt said in an interview. \"We have to be people that are looking for solutions. Treating people with dignity and respect allows you to have tough conversations. I think we owe it to the people we serve to actually find that pathway forward.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Katie Britt, R-Ala., right, speaks with Sen. Chris Murphy, D-Conn.,  during an oversight hearing on May 8, 2025. Britt and Murphy have been key negotiators for their parties in talks around DHS funding.\n                \n                    Julia Demaree Nikhinson/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Julia Demaree Nikhinson/AP\n    \n\n   \n   Britt panned Democrats' initial demands last week as a Christmas list, though talks are ongoing and, unlike the fight over the health subsidies, the White House is involved and negotiating directly with Democrats.   Last fall, Britt helped strike a deal with those handful of Democrats who voted to end the 43-day shutdown — including Sen. Tim Kaine.   Kaine, D-Va., says bipartisan action is still possible, but the reality is that on the most fraught issues, it is extremely difficult.   \"On health care, on immigration, the parties are in fundamentally very different places,\" he said. \"And so that means I go into any negotiation on a topic like this: high hopes, low expectations.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A bipartisan effort to save health subsidies failed. Will ICE reform be different?",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5621x3162+0+293/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe0%2Fcb%2Fa93ce38a411b9c8b2fe04470b3f4%2Fgettyimages-2257668133.jpg"
      ],
      "datePublished": "2026-02-13T10:00:00.000Z",
      "dateModified": "2026-02-13T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]