[
  {
    "title": "Appeals court hands Trump a victory, OK'ing firings of two independent agency heads",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5634705/trump-nlrb-mspb-firing-appeal",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+0/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2F89%2F428e90ab413da46d0363c56e7c98%2Fdiptych-5.png",
    "tag": "Politics",
    "date": "2025-12-05T18:05:23.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Merit Systems Protection Board member Ca",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Merit Systems Protection Board member Cathy Harris (left) and National Labor Relations Board member Gwynne Wilcox (right) were fired by President Trump early this year. A panel of judges at the D.C. Circuit Court of Appeals says the firings were lawful.\n                \n                    Mike Scarcella/Reuters; FM Archive / Alamy Stock Photo\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mike Scarcella/Reuters; FM Archive / Alamy Stock Photo\n    \n\n   \n   The D.C. Circuit Court of Appeals said in a 2-to-1 ruling that President Trump acted lawfully in firing two members of independent agencies, despite federal laws that hold they can only be fired for cause, because they wield significant executive power.   The ruling comes as the Supreme Court prepares to hear arguments in a similar case on Monday.   The case decided by the appeals court was brought by Cathy Harris, a Democratic member of the Merit Systems Protection Board, and Gwynne Wilcox, a Democratic member of the National Labor Relations Board. Trump fired both within weeks of taking office but did not cite any permissible reason, such as neglect of duty or malfeasance in office.   \n   The MSPB hears federal employees' appeals of personnel actions taken by the government. The NLRB hears appeals of cases involving unfair labor practices and oversees union elections, among other duties. Both have multiple members appointed by the president and confirmed by the Senate, who serve staggered terms.   \n   Initially, lower courts ordered the two officials reinstated, citing a 1935 Supreme Court decision known as Humphrey's Executor. In that unanimous decision, the court held that while the president has the power to remove purely executive officers for any reason, that unlimited power does not extend to agencies whose duties \"are neither political nor executive, but predominantly quasi-judicial and quasi-legislative.\"   The Trump administration appealed, and in May, the Supreme Court weighed in with an emergency order allowing the firings of Harris and Wilcox to stand pending a merits hearing in their combined case.   \"The stay reflects our judgment that the Government is likely to show that both the NLRB and MSPB exercise considerable executive power,\" the Supreme Court majority wrote in the unsigned order.   On Friday, the D.C. Circuit fulfilled that prediction. In the majority opinion, U.S. Circuit Court Judge Gregory Katsas, a Trump appointee, cited the substantive rulemaking powers of the MSPB and the NLRB, as well the agencies' broad powers to order things like reinstatement and back pay.   \n   Katsas declined to address whether the president can still fire officers at agencies that are \"purely adjudicatory\" in nature, nor did he wade into the thorny question of whether members of the Federal Reserve should remain insulated from the president's reach.   The dissent came from U.S. Circuit Court Judge Florence Pan, a Biden appointee. She argued that the MSPB and the NLRB do not in fact wield substantial executive power, and she warned of the consequences of granting the president control over such bodies.   \"We may soon be living in a world in which every hiring decision and action by any government agency will be influenced by politics, with little regard for subject-matter expertise, the public good, and merit-based decision-making,\" she wrote.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Appeals court hands Trump a victory, OK'ing firings of two independent agency heads",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1920x1080+0+0/resize/1400/quality/100/format/png/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2F89%2F428e90ab413da46d0363c56e7c98%2Fdiptych-5.png"
      ],
      "datePublished": "2025-12-05T18:05:23.000Z",
      "dateModified": "2025-12-05T18:05:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Kennedy Center Honors are coming up. This year's event will be different",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5607173/kennedy-center-honors-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7273x4089+0+487/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe3%2F1b%2F0d82e51a4ac1bf8c47732fac5479%2Fgettyimages-2205100679.jpg",
    "tag": "Politics",
    "date": "2025-12-05T14:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump stands in the presidenti",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump stands in the presidential box as he tours the John F. Kennedy Center for the Performing Arts in Washington, D.C., on March 17.\n                \n                    Jim Watson/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jim Watson/AFP via Getty Images\n    \n\n   \n   The Kennedy Center Honors have traditionally been one of Washington's splashiest affairs. Think Hollywood on the Potomac.   Every year, an astonishing number of A-listers come to Washington, D.C., to pay tribute to the honorees with performances and speeches. Think Beyoncé performing for Tina Turner, Audrey Hepburn rhapsodizing about Cary Grant, Rob Reiner praising Norman Lear, Aretha Franklin singing for Carol King, Sidney Poitier honoring Harry Belafonte or James Taylor and John Williams playing for Yo-Yo Ma.   \n\n    \n        \n    \n        \n                    YouTube\n                \n        \n   This year's Kennedy Center honorees are Sylvester Stallone, George Strait, the rock band KISS, Gloria Gaynor and English actor and singer Michael Crawford.   As in years past, Sunday night's gala will be turned into a broadcast special that will air on CBS and Paramount+ on Dec. 23.   But, after months of upheaval at the Kennedy Center, the 48th Honors will be different. In February, President Trump abruptly ousted the Kennedy Center president, Deborah Rutter, and board chair David Rubenstein. Staff who worked on the ceremony and broadcast have also recently resigned.   \n   Here's what else has changed.   The selection process   In the past, honorees were chosen in a months-long, bipartisan undertaking by members of the Kennedy Center board with input from the general public and past honorees. Ultimately recipients were selected by executive members of the board and a couple of other senior staff members, with consultation from past honorees such as Julie Andrews, Lionel Richie and John Williams.   This year, President Trump said he was \"about 98%\" involved in the selection process. He also broke with tradition by personally announcing the names at a press conference at the Kennedy Center last August. Previously, the announcement was made on the center's website and in press releases.   \n   The host   \n   Previous hosts of the Kennedy Center Honors have included Walter Cronkite, Stephen Colbert, Gloria Estefan and Queen Latifah. Trump will host this year, a first for a U.S. president. At the August press conference, Trump said he's hosting because he was asked (he didn't say by whom), and said he was told \"You'll get much higher ratings.\" He continued, \"I used to host The Apprentice finales and we did rather well with that. So I think we're going to do very well because we have some great honorees.\"   Neither Trump nor first lady Melania Trump attended Honors events during his first term.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Actor and singer Queen Latifah, Jill Biden and former President Joe Biden attend the 46th Kennedy Center Honors in 2023.\n                \n                    Kent Nishimura/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kent Nishimura/AFP via Getty Images\n    \n\n   \n   One of the time-honored perks of being chosen is getting to sit with the president and first lady in the Box Tier of the Kennedy Center Opera House. It's unclear how Trump's hosting duties will affect his presence in the box.   \n   The iconic rainbow medallion is no more    In the past, Kennedy Center Honorees were each presented with a vibrant, multicolored satin ribbon adorned with a gold plate inscribed with the honoree's name at a State Department dinner the evening before the gala. Past honorees including Quincy Jones and Rita Moreno would attend subsequent galas proudly wearing their own medallions.   For the first time since 1978, the medallions will not be made by the same family of artists, as first reported by The Washington Post. The new design is by Tiffany & Co. and features a blue ribbon instead of the rainbow one, with rainbow stripes on the medallion itself.    Who will show?   In keeping with tradition, the Kennedy Center is not revealing the names of the performers who will pay tribute to this year's honorees. The surprise on honorees' faces when they see who has come to pay their respects has made for some fun, poignant TV moments.   \n\n    \n        \n    \n        \n                    YouTube\n                \n        \n   The upheaval at the Kennedy Center has led to questions about who will be there this year. Historically, even when artists have disagreed with past administrations, they've in large part showed up. Some make it a point to come every year.   \n   This year could be different. Former honoree Herbie Hancock, who has attended many past Honors and consulted during the selection process, will not attend. His spokesperson told NPR he will be on a tour of Asia. Bonnie Raitt, one of last year's honorees who has also been a tribute performer, will not attend either.   Over the decades, the Kennedy Center forged strong relationships with leading performing artists from around the world. At the press conference in August, Trump boasted that he and the center's new leadership \"ended the woke political programming.\" Words that might push some artists away.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Kennedy Center Honors are coming up. This year's event will be different",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7273x4089+0+487/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe3%2F1b%2F0d82e51a4ac1bf8c47732fac5479%2Fgettyimages-2205100679.jpg"
      ],
      "datePublished": "2025-12-05T14:00:00.000Z",
      "dateModified": "2025-12-05T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HHS changed the name of transgender health leader on her official portrait",
    "url": "https://www.npr.org/sections/shots-health-news/2025/12/05/nx-s1-5633282/transgender-rachel-levine-portrait-hhs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F10%2Fd9c7b0644ff4b86d44b4f59285ff%2F20241220-npr-admirallevine-0020.JPG",
    "tag": "Politics",
    "date": "2025-12-05T22:38:16.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Admiral Rachel L. Levine, pictured at HH",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Admiral Rachel L. Levine, pictured at HHS headquarters last year, led the Public Health Corps during the Biden administration. Her official portrait was changed during the government shutdown to her previous name.\n                \n                    Maansi Srivastava for NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Maansi Srivastava for NPR\n    \n\n   \n   As you walk down a particular hallway on the seventh floor of the Humphrey Building in Washington, D.C., you'll find a line of photographic portraits of all the people from years past who have led the Public Health Corps at the federal Department of Health and Human Services.   Only one of those portraits is of a transgender person: Adm. Rachel Levine, who served for four years as President Biden's assistant secretary for health. She was the first transgender person to win Senate confirmation, and her portrait has been displayed in the hallway since soon after she was confirmed in 2021. The role is a four-star admiral position in charge of the Commissioned Corps of the U.S. Public Health Service.   \n   Levine's official portrait was recently altered, a spokesperson for HHS confirmed to NPR. A digital photograph of the portrait in the hallway obtained by NPR shows that Levine's previous name is now typed below the portrait, under the glass of the frame.   Levine responds   \"During the federal shutdown, the current leadership of the Office of the Assistant Secretary for Health changed Admiral Levine's photo to remove her current legal name and use a prior name,\" says Adrian Shanker, former deputy assistant secretary for health policy in the Biden administration who worked with Levine and is now her spokesperson. He called the move an act \"of bigotry against her.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Adm. Rachel Levine's official portrait has hung in a hallway of the headquarters of HHS since shortly after she was confirmed by the Senate in 2021.\n                \n                    Chris Sean Smith/U.S. Public Health Service Commissioned Corps\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chris Sean Smith/U.S. Public Health Service Commissioned Corps\n    \n\n   \n   Levine told NPR that it was an honor to serve the American people as the assistant secretary for health \"and I'm not going to comment on this type of petty action.\"   HHS statement   NPR asked HHS who made the change and why. In response, HHS spokesperson Andrew Nixon wrote: \"Our priority is ensuring that the information presented internally and externally by HHS reflects gold standard science. We remain committed to reversing harmful policies enacted by Levine and ensuring that biological reality guides our approach to public health.\"   The current assistant secretary for health is Adm. Brian Christine, a urologist from Alabama who was confirmed by the Senate in October.   \n   An HHS staff member who asked not be identified for fear of professional retribution called the change \"disrespectful\" and added that it exemplifies \"the erasure of transgender individuals by this administration.\"   During the 2024 campaign, President Trump and other Republicans spent millions on anti-transgender ads, some of which featured Levine's image.    \n   Since taking office, Trump has moved aggressively to curtail the rights of transgender and intersex people through many federal agencies, including the Departments of Health, Justice, Education, and others. At the Pentagon, transgender servicemembers were forced out of the military without benefits. At the Department of State, decades-old passport policies were reversed. The president often describes transgender people as a danger to society.   Shanker says the alteration of Levine's official portrait is unprecedented. He praised her public health work on COVID-19, syphilis, HIV/AIDS and opioids, and said rather than act vindictively towards her, current leaders at HHS should focus on the many public health challenges facing the American people.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HHS changed the name of transgender health leader on her official portrait",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2F10%2Fd9c7b0644ff4b86d44b4f59285ff%2F20241220-npr-admirallevine-0020.JPG"
      ],
      "datePublished": "2025-12-05T22:38:16.000Z",
      "dateModified": "2025-12-05T22:38:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "State Department to deny visas to fact checkers and others, citing 'censorship'",
    "url": "https://www.npr.org/2025/12/04/nx-s1-5633444/trump-content-moderation-visas-censorship",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5719x3217+0+298/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2F76%2Fcc40c11344e1996558b2d52102e1%2Fgettyimages-2177493971.jpg",
    "tag": "Politics",
    "date": "2025-12-04T22:22:06.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Harry S. Truman Federal Building, he",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Harry S. Truman Federal Building, headquarters of the U.S. Department of State, in a 2024 file photo.\n                \n                    Kevin Dietsch/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch/Getty Images\n    \n\n   \n   The State Department is instructing its staff to reject visa applications from people who worked on fact-checking, content moderation or other activities the Trump administration considers \"censorship\" of Americans' speech.   The directive, sent in an internal memo on Tuesday, is focused on applicants for H-1B visas for highly skilled workers, which are frequently used by tech companies, among other sectors. The memo was first reported by Reuters; NPR also obtained a copy.   \n   \"If you uncover evidence an applicant was responsible for, or complicit in, censorship or attempted censorship of protected expression in the United States, you should pursue a finding that the applicant is ineligible\" for a visa, the memo says. It refers to a policy announced by Secretary of State Marco Rubio in May restricting visas from being issued to \"foreign officials and persons who are complicit in censoring Americans.\"   The Trump administration has been highly critical of tech companies' efforts to police what people are allowed to post on their platforms and of the broader field of trust and safety, the tech industry's term for teams that focus on preventing abuse, fraud, illegal content, and other harmful behavior online.   \n   President Trump was banned from multiple social media platforms in the aftermath of his supporters' attack on the Capitol on Jan. 6, 2021. While those bans have since been lifted, the president and members of his administration frequently cite that experience as evidence for their claims that tech companies unfairly target conservatives — even as many tech leaders have eased their policies in the face of that backlash.   \n   Tuesday's memo calls out H-1B visa applicants in particular \"as many work in or have worked in the tech sector, including in social media or financial services companies involved in the suppression of protected expression.\"   It directs consular officers to \"thoroughly explore\" the work histories of applicants, both new and returning, by reviewing their resumes, LinkedIn profiles, and appearances in media articles for activities including combatting misinformation, disinformation or false narratives, fact-checking, content moderation, compliance, and trust and safety.   \n   \"I'm alarmed that trust and safety work is being conflated with 'censorship',\" said Alice Goguen Hunsberger, who has worked in trust and safety at tech companies including OpenAI and Grindr.   \"Trust and safety is a broad practice which includes critical and life-saving work to protect children and stop CSAM [child sexual abuse material], as well as preventing fraud, scams, and sextortion. T&S workers are focused on making the internet a safer and better place, not censoring just for the sake of it,\" she said. \"Bad actors that target Americans come from all over the world and it's so important to have people who understand different languages and cultures on trust and safety teams — having global workers at tech companies in [trust and safety] absolutely keeps Americans safer.\"   \n   In a statement, a State Department spokesperson who declined to give their name said the department does not comment on \"allegedly leaked documents,\" but added: \"the Administration has made clear that it defends Americans' freedom of expression against foreigners who wish to censor them. We do not support aliens coming to the United States to work as censors muzzling Americans.\"   The statement continued: \"In the past, the President himself was the victim of this kind of abuse when social media companies locked his accounts. He does not want other Americans to suffer this way. Allowing foreigners to lead this type of censorship would both insult and injure the American people.\"   First Amendment experts criticized the memo's guidance as itself a potential violation of free speech rights.   \"People who study misinformation and work on content-moderation teams aren't engaged in 'censorship'— they're engaged in activities that the First Amendment was designed to protect. This policy is incoherent and unconstitutional,\" said Carrie DeCell, senior staff attorney and legislative advisor at the Knight First Amendment Institute at Columbia University, in a statement.   Even as the administration has targeted those it claims are engaged in censoring Americans, it has also tightened its own scrutiny of visa applicants' online speech.   On Wednesday, the State Department announced it would require H-1B visa applicants and their dependents to set their social media profiles to \"public\" so they can be reviewed by U.S. officials.   NPR's Bobby Allyn and Michele Kelemen contributed reporting.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "State Department to deny visas to fact checkers and others, citing 'censorship'",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5719x3217+0+298/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7b%2F76%2Fcc40c11344e1996558b2d52102e1%2Fgettyimages-2177493971.jpg"
      ],
      "datePublished": "2025-12-04T22:22:06.000Z",
      "dateModified": "2025-12-04T22:22:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Are you a swing voter? We want to hear how you're feeling about politics",
    "url": "https://www.npr.org/2025/12/05/g-s1-99912/swing-voter-politics-election",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F98%2F85%2F22f925f64a95a4ffb86554235ad5%2Fgettyimages-2181096933.jpg",
    "tag": "Politics",
    "date": "2025-12-05T15:40:17.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A voter casts an in-person early ballot ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A voter casts an in-person early ballot for the 2024 general election at the Northwest Activities Center on October 29, 2024 in Detroit, Michigan.\n                \n                    Jeff Kowalsky/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jeff Kowalsky/AFP via Getty Images\n    \n\n   \n   As we approach the end of 2025 and the one-year-mark of President Trump's second term, NPR wants to hear from swing voters about how they're feeling about politics.   Do you think the country is going in the right or wrong direction? Are you happy with your vote last year or do you have any regrets? Or maybe you sat the election out? We want to hear your thoughts on the economy, foreign policy, how Congress is doing and more. We may even interview you for a future NPR story.    Fill out the form below and tell us about yourself. If you would be open to an NPR producer contacting you for a story, please indicate that in the appropriate field. We will not use your submission in our story until we have communicated with you and obtained your consent to use the details that will be published.   \n   Your submission will be governed by our general Terms of Use and Privacy Policy. As the Privacy Policy says, we want you to be aware that there may be circumstances in which the exemptions provided under law for journalistic activities or freedom of expression may override privacy rights you might otherwise have.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Are you a swing voter? We want to hear how you're feeling about politics",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F98%2F85%2F22f925f64a95a4ffb86554235ad5%2Fgettyimages-2181096933.jpg"
      ],
      "datePublished": "2025-12-05T15:40:17.000Z",
      "dateModified": "2025-12-05T15:40:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Jim Himes recounts briefing on U.S. boat strike in the Caribbean",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5633262/rep-jim-himes-recounts-briefing-on-u-s-boat-strike-in-the-caribbean",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-05T11:55:06.000Z",
    "description": "\n      NPR's Michel Martins talks with Rep. Jim Himes, D-Conn., about what he learned in a briefing from the Navy admiral who ordered the second strik",
    "body": "\n      NPR's Michel Martins talks with Rep. Jim Himes, D-Conn., about what he learned in a briefing from the Navy admiral who ordered the second strike on a boat near Venezuela.   \n\n    MICHEL MARTIN, HOST:  Representative Jim Himes of Connecticut is on the line with us now. He is the ranking Democrat on the House Permanent Select Committee on Intelligence, and he was among the lawmakers who heard from the Navy admiral who gave the order for that second strike on a boat that was allegedly involved in drug smuggling. Congressman Himes, welcome back to MORNING EDITION.JIM HIMES: Good morning.MARTIN: So there have been a lot of different narratives about what happened on that boat and to that boat. In as much detail as you can share, what did you see in that video that was shown to you yesterday?HIMES: Yeah. I saw something far more disturbing than other videos of lethal strikes that I have reviewed over the years. You know, Americans will be aware that from time to time, in a context like the taking out of Soleimani years ago, this was very, very different. When the U.S. takes lethal strikes, usually you're talking about somebody who is clearly an avowed enemy of the United States, usually a terrorist, or in the case I cited, an Iranian military commander. You know, there's often weapons around, and these individuals are active and operational. So you start with the context, which is that killing unindicted criminals - 'cause these people are criminals, not terrorists. Terrorism - terrorist has a distinct meaning. Killing them without due process, without an arrest, that context is problematic. But what's really problematic and what was really hard to watch yesterday, the notion that they were going to right their boat and continue on their mission is simply nonsensical, and anyone who sees that video would know that.Without getting into too much detail, I would tell you that what you see in that video is the United States, for a lengthy period of time - so this is not a fog of war thing - for a lengthy period of time, observing two men with no weapons, with no radio. They've just had a massive munition go off over their head in such a way that their boat has been a conflagration. I mean, I doubt that anything survived that fire. And they are clinging to a little piece of wood. Now, this was a big boat. This was - I mean, it's 40 feet long or so. Almost all of it is underwater. So the notion that they could right it after they've had a munition go off over their head is absurd, as is the notion that they could right it, get into it, make it functional and continue on their mission. So what I saw and what I think, you know, any American would see if they didn't know the political context was two probably soon to be dead, not because of a missile, but because of drowning, shipwrecked sailors. And the United States took the decision to kill them, which, as you point out, in the Pentagon manual is the very definition of a war crime.MARTIN: So let me play you what Republican Senator Tom Cotton said yesterday after he was briefed.(SOUNDBITE OF ARCHIVED RECORDING)TOM COTTON: The first strike, the second strike and the third and the fourth strike on September 2 were entirely lawful and needful, and they were exactly what we'd expect our military commanders to do.MARTIN: You both attended the same briefing. How do you explain such a fundamentally different interpretation?HIMES: Well, you know, sadly, the opinion about the strike yesterday seems to break precisely on partisan lines. And again, I'm not interested in persuading people along partisan lines. I'm very interested in this video being released because, again, you know, this is a - the visual is two men who are about to go under the waves, observed for a lengthy period of time, shipwrecked sailors killed by the United States. Again, not in the fog of war, not because they pointed an AK-47 at an American service member, but just because there was this absurd notion that clinging to a piece of wood, they were still capable of hostilities, which is the legal question. So, look, I - you know, Rick Crawford, my counterpart in the Republican Party, said something similar. The decisions and the interpretations are falling along partisan lines. The American people need to see this. They need to see it.MARTIN: And what would happen when they do? How do you think that will change the conversation we're having?HIMES: Well, the reason that's important - you know, I've said from the beginning that killing people who we have traditionally arrested and interdicted is both stupid because if you kill them, you can't interview them to find out who their bosses are, what the transshipment points are, what the routes are. But, you know, these are criminals. They are not terrorists. Terrorists have a political and a strategic objective. Narcotraffickers, as hideous as they are, are simply trying to sell a product to Americans. And so there's a distinction there.MARTIN: OK.HIMES: And Americans need to actually see the visual...MARTIN: OK.HIMES: ...Of what it is that we're doing here.MARTIN: Before we let you go, as briefly as you can, The Washington Post reported that the defense secretary gave a verbal order to kill everybody on the boat. Did Admiral Bradley speak to that? What did he say?HIMES: He did. I asked him very explicitly whether that order had been issued, and he said absolutely not.MARTIN: Do you believe him?HIMES: Admiral Bradley is - anyone who's ever worked with Admiral Bradley knows that - says that he is a man of great integrity...MARTIN: OK.HIMES: ...With a storied history.MARTIN: OK.HIMES: So given that, I don't have any reason not to.MARTIN: That's Representative Jim Himes. He's the top Democrat on the House Permanent Select Committee on Intelligence. Congressman, thank you so much.HIMES: Thank you.MARTIN: And I do want to mention, we've invited a number of Republican colleagues of the congressman to come on the program. That offer still stands.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Jim Himes recounts briefing on U.S. boat strike in the Caribbean",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-05T11:55:06.000Z",
      "dateModified": "2025-12-05T11:55:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This week in Washington",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5633317/this-week-in-washington",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-05T23:00:14.000Z",
    "description": "\n      It was a busy week in Washington, from foreign policy to Congressional redistricting and another special election. NPR's Domenico Montanaro and",
    "body": "\n      It was a busy week in Washington, from foreign policy to Congressional redistricting and another special election. NPR's Domenico Montanaro and Tamara Keith break down the big news of the week.   \n\n    JUANA SUMMERS, HOST:  It was another busy week in politics. The Supreme Court approved controversial redistricting plans in Texas. Secretary of Defense Pete Hegseth was in hot water in part because of strikes on alleged Venezuelan drug boats in the Caribbean. Oh, and also, there was another special election. So we've asked senior White House correspondent Tamara Keith and senior political editor and correspondent Domenico Montanaro to join us today to take a step back and put all of this into context. Hi to both of you.TAMARA KEITH, BYLINE: Hello.DOMENICO MONTANARO, BYLINE: Hey.SUMMERS: Tam, I want to start with you and Secretary Hegseth, who was at the center of some really big scrutiny this week. Tell us what happened.KEITH: It all comes back to Hegseth's leadership and judgment as secretary of defense. He was clearly in the hot seat all week. There was concern about the boat strike on September 2, where there were survivors who were then hit a second time and killed. Top lawmakers on key committees went into a closed-door hearing this week with bipartisan concerns. During that meeting, they saw a full video of the strikes, and they came out divided over how alarmed people should be about what happened. And they were divided on partisan political lines.And that briefing up on the hill happened on the same day that an independent inspector general at the Department of Defense released a report that found, back in March, Hegseth had violated policy and risked the safety of U.S. service members by sharing sensitive military information in a group chat.MONTANARO: Yeah. And politically, I mean, we've seen Republicans come to Hegseth's defense clearly here. You know, they're pointing to former President Barack Obama for these double-tap drone missile firings in the war on terrorism that were really controversial. They're saying that he wrote the playbook on this. The Pentagon spokesman called the inspector general's report a, quote, \"total exoneration,\" but that's not quite true. And, you know, it's just another example in the Trump era of just saying something is true and then hoping the base will echo those talking points.And that's also been the case with Trump's recent racist comments about Somalis and Afghan refugees. You know, it's part of the Trump playbook to distract from worse news, like negative views of his handling of the economy, frankly, and go to xenophobia, immigration and other culture war issues. And his base has generally gone right along with that.SUMMERS: And Hegseth is one part of all of this. But what are we learning this week about the way that the Trump administration is approaching foreign policy and national defense?MONTANARO: Well, the White House put out a 33-page national security strategy document for the country. It's pretty notable for how Trump and his administration see the United States' role in the world. A few things really jumped out to me. One, there's real isolationist tendencies in it, noting, for example, quote, \"the affairs of other countries are our concern only if their activities directly threaten our interests.\" Second, there's a clear retrenchment and focus on the Western hemisphere, which we've seen already here. And thirdly, there's this very harsh, negative view of Europe. The document describes Europe as undergoing economic decline and, quote, \"civilizational erasure\" tied to migration.SUMMERS: But I have to say, this is not entirely surprising given what we've already seen and know about President Trump.KEITH: Yeah. It's in line with how he has governed. But the document does lay this out explicitly, and it is quite the crack up of the post World War II order of alliances that largely kept peace and security for the West for well more than half a century at this point. And the question I have with this document is, will this be an enduring position or will it shift depending on who the president's talking to, as policies often do under this president?SUMMERS: But at the same time, Republicans are grappling with a whole lot of data that suggests that voters are souring on Trump. Tell us what we're seeing.MONTANARO: Well, Trump is really at his lowest point in his presidency politically. His approval ratings are the lowest. He's seen averaging now in the high 30s. He's in the 20s in our polling with independents. And so much of that is about the economy. His handling of it is low, as the cost of living has really been the dominant issue on people's minds. And yet Trump again this week was dismissing affordability as something important.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: You know, there's this fake narrative that the Democrats talk about - affordability. They just say the word. It doesn't mean anything to anybody. They just say it - affordability. I inherited the worst inflation in history. There was no affordability. Nobody could afford anything.MONTANARO: You know, it certainly was the key issue in the special election we just saw this week in Tennessee, where Democrats again overperformed. The Republican won there, but Democrats did better. So clearly, the cost of living does really matter to people.SUMMERS: What has the White House been saying about all of this?KEITH: Well, first, they insist that they do not have their hair on fire about what happened in Tennessee. I did go in and speak with a senior White House official earlier this week who said that the president's travel is really going to ramp up at the end of this year. The first stop, the only one that's been announced so far, is next Tuesday in Pennsylvania. The focus will be affordability. But I have to say, this same senior White House official told me almost exactly the same thing almost a month ago. That time, I was told that the message would about empathy on prices, saying, you know, I feel your pain. We've done a lot, but there's a lot more we need to do.But as we've seen, the president keeps steering back to the idea of affordability as a word that Democrats made up as some kind of con job against him. That lack of message discipline has been hard to break. And the problem with the cost of living is people go to the grocery store all the time. They are out Christmas shopping, holiday shopping right now, and they can see for themselves what things cost.SUMMERS: Right. And we've also talked a whole lot about the structural advantages that Republicans have when it comes to the midterms next year. Where do things stand now?KEITH: Well, the Supreme Court last night delivered a big victory to Republicans, saying that the maps drawn in Texas can stand. That mid-decade redrawing of lines was designed to give Republicans up to five more seats in an already heavily Republican state. President Trump has been a driving force behind that because he is very openly concerned about what happens if Republicans lose control of the House.MONTANARO: And still, though, for Republicans, you know, they're trying to gain more seats, and they very well may create more in someplace like Texas, but they may not get as many as they would have hoped for. And they're being offset by places like California and elsewhere. And in a wave year, redrawing those seats and making some of them less Republican could backfire. And it's part of a reason, that and affordability, why we've seen potentially so many Republicans retiring from Congress, a real sign that Republicans are taking it very seriously that this could be a wave year coming up for Democrats next year.KEITH: Because nobody likes to be in the minority.SUMMERS: NPR's Tamara Keith and Domenico Montanaro, thanks to both of you.KEITH: You're welcome.MONTANARO: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This week in Washington",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-05T23:00:14.000Z",
      "dateModified": "2025-12-05T23:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Defense secretary under fire as lawmakers question admiral about deadly boat strikes",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5633325/defense-secretary-under-fire-as-lawmakers-question-admiral-about-deadly-boat-strikes",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-05T11:55:20.000Z",
    "description": "\n      Defense Secretary Pete Hegseth is under pressure this week as a Navy admiral faces tough questions from lawmakers about the legality of strikin",
    "body": "\n      Defense Secretary Pete Hegseth is under pressure this week as a Navy admiral faces tough questions from lawmakers about the legality of striking boats allegedly carrying drugs in the Caribbean.   \n\n    STEVE INSKEEP, HOST:  Members of Congress have now seen the video of U.S. strikes on a boat in the Caribbean. In a few moments, we'll hear from one of those lawmakers, Democrat Jim Himes.MICHEL MARTIN, HOST:  But first, let's get to what we know. Democrats said they were disturbed by the second hit on a boat allegedly carrying drugs that killed two men after the boat was disabled. Republicans said the strike was justified because those two people might otherwise have continued on to their destination.INSKEEP: That is one of two big stories focused on the Pentagon, and NPR Pentagon correspondent Tom Bowman is covering both. Tom, good morning.TOM BOWMAN, BYLINE: Hey, Steve.INSKEEP: OK. So let's get this other story out of the way first. Inspector general report is now public about Defense Secretary Pete Hegseth sharing information about an attack on the Signal texting app. What did you learn by reading the report?BOWMAN: Well, it said that two to four hours before the airstrikes by American F-18 pilots, Secretary Hegseth - he was getting a classified briefing from General Eric Carillo about the upcoming attacks on Houthi rebels. A lot of detail about the number of planes, the targets, the timing. And while Hegseth was getting this, he was sharing it on a Signal chat with other officials and on another chat with his wife, his brother and his lawyer. None of those three had security clearances, and all of this was secret information, the report said.INSKEEP: And let's just disclose, as we do, that NPR's CEO, Katherine Maher, also chairs the board of the Signal Foundation, which has a subsidiary that makes this app. But what has been the reaction to the inspector general?BOWMAN: Well, Secretary Hegseth's spokesman said the IG report exonerates him. That is not true. Nothing in the 76 pages says anything close to that. It does say that the Pentagon should be aware of proper procedures on the handling of classified information. It only states facts, Steve, not what should happen next.INSKEEP: All right. So let's now talk about this second strike on the boat in the Caribbean. What are lawmakers saying, and what are you learning now that they have seen this video and also heard from the commander involved?BOWMAN: Well, Admiral Mitch Bradley, the top commander overseeing Central and South America, appeared behind closed doors to explain what happened. Lawmakers said he defended that second missile strike, saying basically, the survivors of the initial strike were still kind of being active, trying to reach their comrades by radio, trying to corral drugs on the boat that was nearly destroyed. So Bradley, again, ordered this second missile strike to kill them and then two more to sink the boat. Secretary Hegseth said he was only there for the first missile strike on the boat and didn't see the others. He had meetings, he said. Now lawmakers are asking, you know, did the second missile strike result in an illegal killing, a war crime? Because, Steve, the Pentagon's Law of War Manual lays out what is an illegal order that no service member has to obey, and the manual has this example. Get this. Quote, \"for example, orders to fire upon the shipwrecked would be clearly illegal.\"INSKEEP: Tom, granting the differing interpretations, it does seem that everyone came out of the closed-door video session saying this boat was severely damaged at the least and even capsized. Any doubt about that?BOWMAN: I don't think there is. Senator Tom Cotton said these guys, the two survivors, are trying to flip over this capsized boat. Congressman Adam Smith and others said, listen, they were just shirtless guys, and not much of this boat was above water. So that's why it's important, I think, for the public to see this video. It should be released.INSKEEP: NPR's Tom Bowman. Thanks so much.BOWMAN: You're welcome.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Defense secretary under fire as lawmakers question admiral about deadly boat strikes",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-05T11:55:20.000Z",
      "dateModified": "2025-12-05T11:55:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump official signals potential rollback of changes to census racial categories",
    "url": "https://www.npr.org/2025/12/05/nx-s1-5634897/trump-census-race-categories-ethnicity-middle-east-north-africa",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5220x2936+0+278/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb0%2F1a%2Fe5fd7d3d469fb43029a7f2ecdd10%2Fap20315621824213.jpg",
    "tag": "Politics",
    "date": "2025-12-05T23:51:36.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An envelope sent from the U.S. Census Bu",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                An envelope sent from the U.S. Census Bureau contains information about the 2020 national head count. The Trump administration is reviewing the racial and ethnic categories approved for the 2030 census and other future federal surveys.\n                \n                    Matt Rourke/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Matt Rourke/AP\n    \n\n   \n   A Trump administration official on Friday signaled a potential rollback of the racial and ethnic categories approved for the 2030 census and other future federal government forms.   Supporters of those categories fear that any last-minute modifications to the U.S. government's standards for data about race and ethnicity could hurt the accuracy of census data and other future statistics used for redrawing voting districts, enforcing civil rights protections and guiding policymaking.   Those standards were last revised in 2024 during the Biden administration, after Census Bureau research and public discussion.   A White House agency at the time approved, among other changes, new checkboxes for \"Middle Eastern or North African\" and \"Hispanic or Latino\" under a reformatted question that asks survey participants: \"What is your race and/or ethnicity?\" The revisions also require the federal government to stop automatically categorizing people who identify with Middle Eastern or North African groups as white.   \n   But at a Friday meeting of the Council of Professional Associations on Federal Statistics in Washington, D.C., the chief statistician within the White House's Office of Management and Budget revealed that the Trump administration has started a new review of those standards and how the 2024 revisions were approved.   \"We're still at the very beginning of a review. And this, again, is not prejudging any particular outcome. I think we just wanted to be able to take a look at the process and decide where we wanted to end up on a number of these questions,\" said Mark Calabria. \"I've certainly heard a wide range of views within the administration. So it's just premature to say where we'll end up.\"   \n   OMB's press office did not immediately respond to NPR's request for comment.   Calabria's comments mark the first public confirmation that Trump officials are considering the possibility of not using the latest racial and ethnic category changes and other revisions. They come amid the administration's attack on diversity, equity and inclusion programs, a push to stop producing data that could protect the rights of transgender people and threats to the reliability of federal statistics.   In September, OMB said those Biden-era revisions \"continue to be in effect\" when it announced a six-month extension to the 2029 deadline for federal agencies to follow the new standards when collecting data on race and ethnicity.   \n   Calabria said the delay gave agencies more time to implement the changes \"while we review.\"   The first Trump administration stalled the process for revising the racial and ethnic data standards in time for the 2020 census.    The \"Project 2025\" policy agenda released by The Heritage Foundation, the conservative, D.C.-based think tank, called for a Republican administration to \"thoroughly review any changes\" to census race and ethnicity questions because of \"concerns among conservatives that the data under Biden Administration proposals could be skewed to bolster progressive political agendas.\"   \n   Advocates of the changes, however, see the new categories and other revisions as long-needed updates to better reflect people's identities.   \"At stake is a more accurate and deeper understanding of the communities that comprise our country,\" says Meeta Anand, senior director of census and data equity at the Leadership Conference on Civil and Human Rights. \"I am not concerned if it's reviewed in an honest attempt to understand what the process was. I am concerned if it's for a predetermined outcome that would be to ignore the entire process that was done in a very transparent manner.\"   Edited by Benjamin Swasey\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump official signals potential rollback of changes to census racial categories",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5220x2936+0+278/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb0%2F1a%2Fe5fd7d3d469fb43029a7f2ecdd10%2Fap20315621824213.jpg"
      ],
      "datePublished": "2025-12-05T23:51:36.000Z",
      "dateModified": "2025-12-05T23:51:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Supreme Court lets Texas use gerrymandered map that could give GOP 5 more House seats",
    "url": "https://www.npr.org/2025/12/04/nx-s1-5619692/supreme-court-texas-redistricting-map",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3536x1989+0+209/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2Fbf%2Fecdbf39d44678d10ab6e3e156cf6%2Fap25234569690648.jpg",
    "tag": "Politics",
    "date": "2025-12-04T23:02:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Texas Republican state Sen. Pete Flores ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Texas Republican state Sen. Pete Flores looks over the state's redrawn congressional map at the Texas Capitol in Austin in August.\n                \n                    Eric Gay/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Eric Gay/AP\n    \n\n   \n   The Supreme Court has cleared the way for Texas to use a new congressional map that could help Republicans win five more U.S. House seats in the 2026 midterm election.   The decision released Thursday boosts the GOP's chances of preserving its slim majority in the House of Representatives amid an unprecedented gerrymandering fight launched by President Trump, who has been pushing Texas and other GOP-led states to redraw their congressional districts to benefit Republicans.   The high court's unsigned order follows Texas' emergency request for the justices to pause a three-judge panel's ruling blocking the state's recently redrawn map.   \n   After holding a nine-day hearing in October, that panel found challengers of the new map are likely to prove in a trial that the map violates the Constitution by discriminating against voters based on race.   \n   In its majority opinion — authored by a Trump nominee — the panel cited a letter from the Department of Justice and multiple public statements by key Republican state lawmakers that suggested their map-drawer manipulated the racial demographics of voting districts to eliminate existing districts where Black and Latino voters together make up the majority. For the next year's midterms, the panel ordered Texas to keep using the congressional districts the state's GOP-controlled legislature drew in 2021.   But in Texas' filing to the Supreme Court, the state claimed the lawmakers were not motivated by race and were focused instead on drawing new districts that are more likely to elect Republicans.   What the Supreme Court said    In its Thursday decision to side with Texas, the Supreme Court said the panel \"failed to honor the presumption of legislative good faith by construing ambiguous direct and circumstantial evidence against the legislature.\"   The high court also found that, given the release of the panel's ruling in the middle of Texas' candidate filing period, the lower court had \"improperly inserted itself into an active primary campaign, causing much confusion and upsetting the delicate federal-state balance in elections.\"   \n   In a dissenting opinion, however, Supreme Court Justice Elena Kagan criticized the court's majority for reversing the panel's decision after a \"perusal, over a holiday weekend, of a cold paper record.\"   The high court's decision \"ensures that many Texas citizens, for no good reason, will be placed in electoral districts because of their race,\" wrote Kagan, who was joined by the court's two other liberals, Justices Sonia Sotomayor and Ketanji Brown Jackson. \"And that result, as this Court has pronounced year in and year out, is a violation of the Constitution.\"   \n   In November, after the panel blocked the new map, Justice Samuel Alito allowed Texas to temporarily reinstate it while the Supreme Court reviewed the state's emergency request.   Texas state Attorney General Ken Paxton, a Republican, cheered the Supreme Court's ruling on Thursday, saying in a statement that the GOP-drawn map \"reflects the political climate of our state and is a massive win for Texas and every conservative who is tired of watching the left try to upend the political system with bogus lawsuits.\"   Democrats criticized the high court. In a statement, U.S. Rep. Suzan DelBene, chair of the Democratic Congressional Campaign Committee, said in a statement that the \"people of Texas don't want this map, but it was put in place at the behest of national Republicans who are desperate to cling to their majority in the House of Representatives by decimating minority voting opportunity.\"   Texas kicked off a redistricting fight   The mid-decade redistricting plan Texas Republicans passed in August sparked a counter response by Democratic leaders in California, where voters in a special election in November approved a new congressional map that could help Democrats gain five additional House seats. A court hearing for a legal challenge to that map is set for Dec. 15.   \n   The rest of the redistricting landscape remains unsettled as well. Lawsuits are challenging new gerrymanders in places like Missouri, where there is also a contested referendum effort. And other states, including Florida, Indiana and Virginia, may also pursue new districts prior to the midterms.   Last week, a federal court ruled to allow North Carolina's midterm election to be held under a recently redrawn map that could give Republicans an additional seat.   Another wave of congressional redistricting may be coming soon depending on what — and when — the Supreme Court decides in a voting rights case about Louisiana's congressional map. After the court held a rare rehearing for that case in October, some states are watching for a potential earlier-than-usual ruling that may allow Republican-led states to draw more GOP-friendly districts in time for the 2026 midterms.   \n   Edited by Benjamin Swasey\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Supreme Court lets Texas use gerrymandered map that could give GOP 5 more House seats",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3536x1989+0+209/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa6%2Fbf%2Fecdbf39d44678d10ab6e3e156cf6%2Fap25234569690648.jpg"
      ],
      "datePublished": "2025-12-04T23:02:21.000Z",
      "dateModified": "2025-12-04T23:02:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]