[
  {
    "title": "Immigration enforcement becomes a flashpoint in Minnesota Senate race",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5677273/immigration-enforcement-becomes-a-flashpoint-in-minnesota-senate-race",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-16T21:04:09.000Z",
    "description": "\n      Immigration is shaping up as a key issue in the race for Minnesota's open U.S. Senate seat, with Democratic candidates trying to navigate how t",
    "body": "\n      Immigration is shaping up as a key issue in the race for Minnesota's open U.S. Senate seat, with Democratic candidates trying to navigate how they respond to a surge in federal agents in their state.   \n\n    AILSA CHANG, HOST:  The fatal shooting of Renee Macklin Good by an ICE officer in Minneapolis has ignited a national debate about immigration enforcement, especially in the U.S. Senate race in Minnesota, where Democratic Senator Tina Smith is retiring, and the candidates vying to replace her are trying to meet the moment. Minnesota Public Radio's Dana Ferguson reports.DANA FERGUSON, BYLINE: U.S. Democratic representative Angie Craig says it enraged her when fellow Minnesota representative Tom Emmer, a Republican, reacted like this just after the shooting.(SOUNDBITE OF ARCHIVED RECORDING)TOM EMMER: People need to understand that there is a ICE officer standing directly in front of the car when it starts to accelerate.FERGUSON: That was Emmer, the House Republican majority whip, on Fox News last week. He said Jonathan Ross, the ICE officer who shot Macklin Good, acted in self-defense. And the Trump administration agrees, with Vice President JD Vance saying Good's death was of her own making. To Craig, ICE officers escalated the situation. At the U.S. Capitol in D.C., she confronted Emmer that afternoon, yelling as colleagues intervened to pull them apart.ANGIE CRAIG: Simply told him on the House floor that this political stunt by this administration got a woman killed in Minneapolis today.FERGUSON: Later, Craig reflected on the exchange.CRAIG: We have a number of Republicans across this country who refuse to stand up to this administration, refuse to call for the rule of law. And, you know, I'm not going to let Tom Emmer or anybody else get away with it.FERGUSON: Craig is a moderate Democrat from a swing district that hugs the St. Paul suburbs and spans down into farm country. She's running for the Democratic nomination for U.S. Senate. Her Democratic opponent in the race, Lieutenant Governor Peggy Flanagan, quickly seized on Craig's voting record on immigration, and her campaign said Craig's dustup with Emmer was a political stunt.PEGGY FLANAGAN: Well, I think this is actually one of the clearest points of contrast between me and my primary opponent, Angie Craig.FERGUSON: Flanagan points to Craig's vote a year ago in support of the GOP-led Laken Riley Act. The policy allows for detention of people without legal status who are charged with crimes ranging from minor theft to assault on law enforcement.FLANAGAN: I just - I think that Minnesotans have a really clear choice. Do you want someone who votes along with Donald Trump and the - you know, the agents who are terrorizing our communities, or do you want someone who, you know, believes that we can have secure borders, comprehensive immigration reform, a pathway to citizenship?FERGUSON: Craig defends that vote by saying the law provides for due process before deportation. And she says Flanagan would have problems of her own if she faced Republicans in the fall.Minnesota's tracked hundreds of millions of dollars of fraud in state government programs, and the Trump administration has pinned blame on Governor Tim Walz for not doing more to prevent it. Craig says as Walz's second in command, Flanagan could take heat for that.CRAIG: Pushing Governor Walz in front of that bus by himself, as she has been his partner for seven years, is kind of disgusting, quite frankly.FERGUSON: Flanagan's campaign says Craig is the one refusing to take accountability and is putting the seat in jeopardy. For their part, Republicans in the running are standing behind the ICE officer who shot Macklin Good.DAVID HANN: You can't keep encouraging people to defy the law and not see bad things happen.FERGUSON: That's David Hann, a candidate who is former chair of the Minnesota Republican Party. He faulted Democrats for demonizing federal law enforcement. Republicans hope that this moment where Minnesota's blue leaders are under fire can help flip the seat that's been in Democratic hands for 16 years.For NPR News, I'm Dana Ferguson in St. Paul, Minnesota.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Immigration enforcement becomes a flashpoint in Minnesota Senate race",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-16T21:04:09.000Z",
      "dateModified": "2026-01-16T21:04:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela's Machado says she presented her Nobel Peace Prize to Trump during their meeting",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5679424/venezuela-machado-nobel-prize-trump-meeting",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3683x2072+0+192/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff1%2Fde%2F112992a34462be4822945f2dfcec%2Fap26015713681855.jpg",
    "tag": "Politics",
    "date": "2026-01-16T06:12:37.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan opposition leader María Corin",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan opposition leader María Corina Machado waves to supporters on Pennsylvania Avenue as she leaves the White House after meeting with President Donald Trump Thursday, in Washington.\n                \n                    Pablo Martinez Monsivais/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Pablo Martinez Monsivais/AP\n    \n\n   \n   WASHINGTON — Venezuelan opposition leader María Corina Machado said she presented her Nobel Peace Prize medal to President Donald Trump at the White House on Thursday even as he has questioned her credibility to take over her country after the U.S. ousted then-President Nicolás Maduro.   \n   The Nobel Institute has said Machado could not give her prize to Trump, an honor that he has coveted. Even if it the gesture proves to be purely symbolic, it was extraordinary given that Trump has effectively sidelined Machado, who has long been the face of resistance in Venezuela. He has signaled his willingness to work with acting President Delcy Rodríguez, who had been Maduro's second in command.   \"I presented the president of the United States the medal, the Nobel Peace Prize,\" Machado told reporters after leaving the White House and heading to Capitol Hill. She said she had done so \"as a recognition for his unique commitment with our freedom.\"   \n   Trump confirmed later on social media that Machado had left the medal for him to keep, and he said it was an honor to meet her.   \"She is a wonderful woman who has been through so much. María presented me with her Nobel Peace Prize for the work I have done,\" Trump said in his post. \"Such a wonderful gesture of mutual respect. Thank you María!\"   \n   The White House later posted a photo of Machado standing next to Trump in the Oval Office as he holds the medal in a large frame. A text in the frame reads, \"Presented as a personal symbol of gratitude on behalf of the Venezuelan people in recognition of President Trump's principled and decisive action to secure a free Venezuela.\"   Trump has raised doubts about his stated commitment to backing democratic rule in Venezuela, giving no timetable on when elections might be held. Machado indicated that he had provided few specifics on that front during their discussion.   She did not provide more information on what was said.   'We can count on President Trump'   After the closed-door meeting, Machado greeted dozens of cheering supporters waiting for her near the White House gates, stopping to hug many.   \n   \"We can count on President Trump,\" she told them without elaborating, prompting some to briefly chant, \"Thank you, Trump.\"   Before her visit to Washington, Machado had not been seen in public since she traveled last month to Norway, where her daughter received the peace prize on her behalf. She had spent 11 months in hiding in Venezuela before she appeared in Norway after the ceremony.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan opposition leader Maria Corina Machado, center, is welcomed by Sen. Dick Durbin, D-Ill., left, Sen. Ruben Gallego, D-Ariz., far left, and Sen. Alex Padilla, D-Calif., right, as the Nobel Peace Prize recipient visits American leaders at the Capitol in Washington, Thursday, Jan. 15, 2026.\n                \n                    J. Scott Applewhite/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        J. Scott Applewhite/AP\n    \n\n   \n   The jubilant scene after her meeting with Trump stood in contrast to political realities in Venezuela. Rodríguez remains in charge of day-to-day government operations, along with others in Maduro's inner circle. In her first state of the union speech Thursday, the interim president promoted the resumption of diplomatic ties between the historic adversaries and advocated for opening the state-run oil industry to more foreign investment after Trump pledged to seize control of Venezuelan crude sales.   Trump has said it would be difficult for Machado to lead because she \"doesn't have the support within or the respect within the country.\" Her party is widely believed to have won 2024 elections rejected by Maduro.   White House press secretary Karoline Leavitt called Machado \"a remarkable and brave voice\" but also said the meeting didn't mean Trump's opinion of her changed, calling it \"a realistic assessment.\"   Leavitt told reporters that Trump supported new Venezuelan elections \"when the time is right\" but did not say when he thought that might be.   A 'frank and positive discussion' about Venezuela   Leavitt said Machado had sought the face-to-face meeting without setting expectations for what would occur. She spent about two and a half hours at the White House.   \"I don't think he needs to hear anything from Ms. Machado,\" the press secretary said while the meeting was still going on, other than to have a \"frank and positive discussion about what's taking place in Venezuela.\"   \n   After leaving the White House, Machado went on to a closed-door meeting with a bipartisan group of senators.   Sen. Chris Murphy, D-Conn., said Machado told them that \"if there's not some progress, real progress towards a transition in power, and/or elections in the next several months, we should all be worried.\"   \"She reminded us that Delcy Rodríguez is, in many ways, worse than Maduro,\" he added.   Asked if Machado had heard any commitment from the White House on holding elections in Venezuela, Murphy said, \"No, I don't think she got any commitment from them.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Venezuelan opposition leader María Corina Machado, center, leaves the Capitol, Thursday, Jan. 15, 2026, in Washington.\n                \n                    Allison Robbert/FR172296 AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Allison Robbert/FR172296 AP\n    \n\n   \n   Sen. Bernie Moreno, an Ohio Republican, was exultant following the meeting, saying Machado \"delivered a message that loud and clear: What President Trump did was the most important, significant event in Latin America. That getting rid of Maduro was absolutely essential.\"   Machado's Washington stop coincided with U.S. forces in the Caribbean Sea seizing another sanctioned oil tanker that the Trump administration says had ties to Venezuela. It is part of a broader U.S. effort to take control of the South American country's oil after U.S. forces captured Maduro and his wife less than two weeks ago at a heavily guarded compound in the Venezuelan capital of Caracas and brought them to New York to stand trial on drug trafficking charges.   Leavitt said Venezuela's interim authorities have been fully cooperating with the Trump administration and noted that Rodríguez's government said it planned to release more prisoners detained under Maduro. Among those released were five Americans this week.   Trump said Wednesday that he had a \"great conversation\" with Rodríguez, their first since Maduro was ousted.   Machado doesn't get the nod from Trump   Just hours after Maduro's capture, Trump said of Machado that \"it would be very tough for her to be the leader.\" Machado had steered a careful course to avoid offending Trump, notably after winning the peace prize, and had sought to cultivate relationships with him and key administration voices like Secretary of State Marco Rubio.   \n   The industrial engineer and daughter of a steel magnate, Machado began challenging the ruling party in 2004, when the nongovernmental organization she co-founded, Súmate, promoted a referendum to recall then-President Hugo Chávez. The initiative failed, and Machado and other Súmate executives were charged with conspiracy.   A year later, she drew the anger of Chávez and his allies again for traveling to Washington to meet President George W. Bush, whom Chávez considered an adversary.   Almost two decades later, she marshaled millions of Venezuelans to reject Chávez's successor, Maduro, for another term in the 2024 election. But ruling party-loyal electoral authorities declared him the winner despite ample credible evidence to the contrary. Ensuing anti-government protests ended in a brutal crackdown.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela's Machado says she presented her Nobel Peace Prize to Trump during their meeting",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3683x2072+0+192/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff1%2Fde%2F112992a34462be4822945f2dfcec%2Fap26015713681855.jpg"
      ],
      "datePublished": "2026-01-16T06:12:37.000Z",
      "dateModified": "2026-01-16T06:12:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With limited political power, Minnesota Democrats navigate resistance to Trump",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5678565/immigration-minnesota-democrats-navigate-resistance-to-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3200x1800+0+166/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F05%2F6f%2Faa4b907745ad8a0581cfaf785b39%2F20260112-cbp-03.jpg",
    "tag": "Politics",
    "date": "2026-01-16T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A U.S. Customs and Border Protection off",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A U.S. Customs and Border Protection officer questions M.A., who tells NPR he is a U.S. citizen who was was born in Somalia, in Minneapolis on Monday. He did not want to share his full name for fear of his safety.\n                \n                    Ben Hovland/MPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Ben Hovland/MPR\n    \n\n   \n   MINNEAPOLIS — When President Trump took office last year for a second term, he vowed to curb legal migration and deport those who are in the U.S. without legal status.   Now, after nearly one year in office, Minnesota offers a prime example of how his administration is enforcing immigration policies in a blue state.   The fatal shooting of Renee Macklin Good by an Immigration and Customs Enforcement agent last week became a flashpoint for the simmering opposition to federal agents operating within the state.   More than 2,000 federal immigration agents are in Minnesota, and that number is expected to increase.   \n   On Wednesday night, an ICE agent shot a man in the leg. Homeland Security authorities say they were trying to arrest the immigrant when they were \"ambushed and attacked\" by two other people.   In response, President Trump threatened to use the Insurrection Act to deploy troops to the state.   Officials for the Trump administration say they have had to increase the number of ICE agents in Minnesota because the state's leaders are not working with them to enforce immigration.   But Minnesota's Democratic lawmakers, from the mayor of Minneapolis to its U.S. senators, are pushing back against the federal government's intervention.   \n   On Thursday, Minnesota's Democratic attorney general, Keith Ellison, responded to Trump's threat to invoke the Insurrection Act.   \"Donald Trump is clearly trying to create an excuse to invoke the Insurrection Act, but none exists,\" Ellison said.   Minneapolis Mayor Jacob Frey is also among those calling for federal agents to leave.   \"This is not sustainable,\" Frey said about ICE's increased presence during a press conference Wednesday night. \"We have two governmental entities that are literally fighting one another.\"   \"This is an impossible situation our city is being put in,\" Frey said.   An ICE detention facility visit cut short    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Minnesota representatives, including Kelly Morrison, Ilhan Omar, and Angie Craig, leave the Bishop Henry Whipple Federal Building in Minneapolis on Jan. 10.\n                \n                    Adam Gray/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Adam Gray/AP\n    \n\n   \n   Some congressional Democrats have tried to use their oversight authority to check the federal government's actions.   \n   Last weekend, Reps. Angie Craig, Kelly Morrison and Ilhan Omar walked to the front of an ICE detention center just outside Minneapolis, along with some protesters.   The lawmakers said they had called the facility before showing up and told them they were coming to conduct an oversight check. Dozens of ICE agents stood in a line facing the Congress members.   The three were allowed in for about 10 minutes, then turned away.   \"What happened today is a blatant attempt to obstruct members of Congress from doing their oversight duties,\" Omar said following the visit.   Rep. Kelly Morrison, a physician, said she was interested to see the conditions inside.   \"We were very briefly allowed to go in, but we saw no beds,\" Morrison said. \"We saw a lot of young men sitting with their heads in their hands. We were not allowed to speak to any of them.\"   Under federal law, members of Congress have the right to make unannounced visits to Immigration and Customs Enforcement detention facilities. A Washington, D.C., federal court ruling affirmed this last month, saying it applies to facilities that are funded by regular congressional appropriations.   But in a Jan. 8 memo from Homeland Security Secretary Kristi Noem obtained by NPR, Noem instructed her staff that visits should be requested at least seven days in advance.   Craig disputes Noem's reasoning for turning them away.   \"It is our job as members of Congress to make sure that those folks detained are treated with humanity because we are the damn United States of America,\" Craig said. \"We don't treat people the way that this administration is treating people.\"   Noem spoke to reporters outside the White House on Thursday, saying the Insurrection Act is one tool the president has at his disposal. She called on the state's Democratic officials to work with them.   \n   \"My hope is this leadership team in Minnesota will start to work with us to get criminals off the streets,\" Noem said Thursday.   Minneapolis officials say that the Trump administration's claims they are fighting fraud in the state are a \"pretext,\" arguing that \"randomly stopping people on the street and demanding their papers does nothing to combat fraud.\"   Walz drops bid for reelection    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Minnesota Gov. Tim Walz and his wife, Gwen Walz, look on during a vigil for Renee Macklin Good on the steps of the state Capitol on Jan. 9 in St. Paul, Minn.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   Minnesota has been a focal point for Trump's political ire since the year began, and that includes the state's governor, Tim Walz.   Last week, he backed out of his bid for a third term, saying that running for reelection would prevent him from devoting his full attention to governing the state and fighting fraud. State and federal officials are conducting ongoing fraud investigations into state social service programs, which the Trump administration has cited for the surge in federal agents.    Walz continues to plead with the Department of Homeland Security to loosen its grip on the state. The former vice presidential candidate said last week that protesters here need to hold the line.   \"The nation is looking to us to hold the line on democracy, to hold the line on decency,\" Walz said. \"We can look out for one another. We can have differences. But we've proved to the world for 250 years that our democracy can hold. It feels to me like we're at one of those inflection points.\"   Vice President JD Vance was asked to respond at a White House briefing.   \"Look, Tim Walz is a joke. His entire administration has been a joke. The idea that he's some sort of freedom fighter? He's not,\" Vance said last week.   Walz urged Minnesotans to peacefully and legally record ICE activity in the state, in part to \"create a database of the atrocities against Minnesotans\" and \"to bank evidence for future prosecutions.\"   \n   There's now an online form on the Minnesota attorney general's website where people can share photos and videos.   Democrats look to midterms     In many cases, Democrats have not been able to completely push back against the Trump administration.   University of Minnesota political science professor Michael Minta said there was some dissent from moderate Republicans during Trump's first term. This time around, Democrats don't control the House or Senate. They could use the support of moderate GOP members but Minta says Republicans are rarely willing to buck Trump.   \"They're not necessarily coming out in favor of Republicans or Trump policies, but they're not doing anything to stop it. And so that makes it very difficult for the minority party, for Democrats, to really mount any type of opposition,\" Minta said.   \n   In an interview with MPR News this week, Minnesota Democratic Sen. Amy Klobuchar says she is seriously considering a run for governor since Walz backed out of a reelection bid.   Klobuchar acknowledges that in order to have a political pathway to push back against President Trump's actions, her party needs to focus on picking up a majority in one of the chambers next year.   \"We need a check on Donald Trump,\" Klobuchar said. \"He will not have this unbridled power if there can be a House of Representatives or a Senate that can rein him in.\"   But it's still months until the outcome of the midterm elections could change the makeup of Congress, depending on the results of several races across the country.   While Democrats don't have many political options for stopping the increased surge of immigration authorities in the state, they do have legal avenues they are pursuing.   Ellison, along with the cities of Minneapolis and St. Paul, sued the federal government this week to try and halt ICE operations in the state.   \n   NPR's Sergio Martínez-Beltrán contributed to this report\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With limited political power, Minnesota Democrats navigate resistance to Trump",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3200x1800+0+166/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F05%2F6f%2Faa4b907745ad8a0581cfaf785b39%2F20260112-cbp-03.jpg"
      ],
      "datePublished": "2026-01-16T10:00:00.000Z",
      "dateModified": "2026-01-16T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House Republicans are investigating Jan. 6. NPR fact-checked the first hearing",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5678645/jan-6-house-gop-capitol-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+218/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F76%2F19%2Fb70b75444b4a9b529f55108bac41%2Fap23131575325564.jpg",
    "tag": "Politics",
    "date": "2026-01-16T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Barry Loudermilk, R-Ga., is leading",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep. Barry Loudermilk, R-Ga., is leading a congressional subcommittee reinvestigating the Jan. 6, 2021, attack on the U.S. Capitol. The Trump administration has promoted a distorted and whitewashed history of that day's events.\n                \n                    Andrew Harnik/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/AP\n    \n\n   \n   A new Republican-led congressional subcommittee to investigate the Jan. 6, 2021, attack on the U.S. Capitol held its first public hearing this week. GOP lawmakers used the opportunity to criticize the Biden administration and, at times, promote conspiracy theories about the riot. An NPR fact check has identified multiple false and misleading claims from the hearing, which coincides with a broader effort by the Trump administration to rewrite the history of the attack.   \n   The hearing unfolded against the backdrop of Trump's mass pardons for the Jan. 6 defendants almost one year ago. Stewart Rhodes, the former leader of the Oath Keepers who was convicted of seditious conspiracy for his role in the attack and sentenced to 18 years in prison, appeared at the front of the audience. Rhodes is one of a small group of former defendants who did not receive a full pardon from Trump, and instead received a commutation. As a result, Rhodes was released from prison but his seditious conspiracy conviction remains on his record.   \n   The official topic for Wednesday's hearing was \"Examining the Investigation into the DNC and RNC Pipe Bombs.\" On Jan. 6, just as rioters began breaching the outer perimeter of the Capitol, two bombs were discovered outside the headquarters of the Republican and Democratic national committees, diverting law enforcement resources at a critical moment.   During the Biden administration, the investigation into who planted the bombs stalled, and the lack of an arrest fueled conspiracy theories. Dan Bongino, the conservative podcaster who would later become deputy director of the FBI, said on his show in November 2024 that he was certain the bombs were placed by \"either a connected anti-Trump insider or this was an inside job.\"   A year later, Bongino told a very different story.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former FBI Deputy Director Dan Bongino confirming the arrest of a suspect in the Jan. 6 pipe bomb case at the Department of Justice in 2025.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   While serving as a top FBI official, he appeared at a press conference announcing charges against Brian Cole Jr., a 30-year-old man from Virginia accused of planting the bombs. Cole, who has pleaded not guilty, twice voted for Trump, according to his lawyer. Federal prosecutors allege that Cole confessed and said he believed votes had been \"tampered\" with in the 2020 election.   Bongino addressed his shifting stance on the pipe bomber case on Fox News in December 2025. \"I was paid in the past for my opinions,\" Bongino said, \"but that's not what I'm paid for now. I'm paid to be your deputy director.\" Bongino left the FBI at the beginning of January 2026 and is set to return to podcasting.   \n   Rep. Barry Loudermilk, R-Ga., who chairs the subcommittee, has made the pipe bomb case a central focus of his inquiry. He repeatedly criticized the FBI for failing to crack the case for nearly five years and said internal documents \"paint a dismal picture\" of the investigation during the Biden administration.   In one of the few moments of bipartisan agreement, Rep. Jamie Raskin, D-Md., praised the FBI under Director Kash Patel for making an arrest, calling it \"a rare bright spot for federal law enforcement over the last year.\"   But with the pipe bombing case now moving through the courts — rather than the political arena — lawmakers sometimes veered into claims that did not match the facts.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Trump supporters storm the U.S. Capitol on Jan. 6, 2021.\n                \n                    Samuel Corum/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Samuel Corum/Getty Images\n    \n\n\n        \n            \n            \n            \n        \n    \n\n        Trump supporters storm the U.S. Capitol on Jan. 6, 2021.\n        \n            Samuel Corum/Getty Images\n        \n    \n   \n   The claim:    \"The Biden FBI did have undercover agents and confidential informants embedded within the rally crowds,\" said Rep. Clay Higgins, R-La. \"And the Biden FBI did conspire to entrap MAGA Americans prior to J6 and then successfully entrapped several hundred Americans on J6.\"   The facts:    Joe Biden was not president on Jan. 6 — Donald Trump was.   At the time of the attack, the FBI was led by Christopher Wray, a Trump appointee.   Joe Biden took office on Jan. 20, 2021, two weeks after the riot, and Wray remained FBI director for the duration of his presidency.   A Department of Justice inspector general report examined the presence of confidential FBI sources in the crowds on Jan. 6 and found that \"none of these FBI [Confidential Human Sources] was authorized by the FBI to enter the Capitol or a restricted area or to otherwise break the law on January 6, nor was any CHS directed by the FBI to encourage others to commit illegal acts on January 6.\" The report also found no evidence \"showing or suggesting that the FBI had undercover employees in the various protest crowds, or at the Capitol, on January 6.\"   \n   Higgins' office did not respond to a request for comment.   \n   The claim:   Raskin said Trump failed to act decisively to stop the riot and \"did nothing to send out the National Guard under his unilateral direct control in the District of Columbia.\"   In response, Loudermilk countered that Trump \"cannot just send the National Guard unless the National Guard is requested by the legislative branch.\"   Referring to former Capitol Police Chief Steven Sund, Loudermilk said, \"There were multiple requests made by the former chief of police for National Guard before the request to call them was given. And that was only after shots were fired in the Capitol. That request was made to the Department of Defense in the one o'clock hour on Jan. 6.\"   The facts:   The president has direct control of the D.C. National Guard, and the Capitol Police requested assistance from the guard prior to the breach of the building. Still, troops did not arrive until hours later.   Loudermilk appears to have jumbled the timeline of the National Guard's response, which is laid out in reports from both the Capitol Police and Department of Defense Office of Inspector General.   At 1:09 p.m. and again at 1:22 p.m., former Capitol Police Chief Steven Sund asked the House and Senate sergeants at arms to declare an emergency and formally request help from the National Guard. By that point, rioters had breached the outer perimeter of the Capitol grounds and were assaulting police, but had not yet broken into the building. At 1:49 p.m., Sund called the commanding general of the D.C. National Guard directly to request the assistance of guard troops at the Capitol. At 2:10 p.m., Sund relayed that he received formal authorization from the Capitol Police Board.At 2:13 p.m., rioters broke a Capitol window and began flooding into the building.At 2:44 p.m., Capitol Police Officer Michael Byrd fired a single shot, striking rioter Ashli Babbitt as she attempted to breach a door to the Speaker's Lobby, where members of Congress were trying to evacuate. Babbitt subsequently died. National Guard troops did not arrive at the Capitol until 5:55 p.m.   \n   In an email to NPR, Loudermilk's Deputy Chief of Staff Brandon Cockerham said that the congressman's reference to a request made \"only after shots were fired\" was an allusion to a later moment in the timeline, when acting Defense Secretary Christopher Miller authorized the mobilization of the National Guard.   \"I believe the Chairman meant to use the word 'authorization' instead of 'request' as he was alluding to the authorized mobilization of the D.C. National Guard which came at approximately 3:04 PM,\" Cockerham wrote.      The claim:   Rep. Troy Nehls, R-Texas, criticized police officers who testified before the previous Jan. 6 select committee, which was led by Rep. Bennie Thompson, D-Miss., and former Rep. Liz Cheney, R-Wyo.   \"They set out to have a highly pre-scripted hearing, designated to play on the emotions of Americans,\" said Nehls. \"For example, the hearing with Capitol Police officers Dunn, Gonell, Fanone, Hodges — four Trump haters who gave highly scripted and pre-planned testimonies.\"   The facts:   Nehls was referring to testimony by Harry Dunn and Aquilino Gonell, who served with the Capitol Police, and Michael Fanone and Daniel Hodges, who served with D.C.'s Metropolitan Police Department.   All four officers have publicly criticized Trump, in large part because of the injuries and trauma they suffered defending the Capitol on Jan. 6.   But their politics are not as simple as Nehls suggested.   Fanone, who was dragged into the crowd and repeatedly beaten and shocked in the neck by a rioter with a Taser-style device, voted for Trump in 2016.   \"I was looking for a candidate that supported law enforcement,\" Fanone told NPR in an interview last year. \"I regret the decision. It was clearly the wrong decision in hindsight.\"   Fanone suffered a traumatic brain injury and a minor heart attack due to the assaults on Jan. 6.   Nehls' office did not respond to NPR's request for comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Republicans are investigating Jan. 6. NPR fact-checked the first hearing",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+218/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F76%2F19%2Fb70b75444b4a9b529f55108bac41%2Fap23131575325564.jpg"
      ],
      "datePublished": "2026-01-16T10:00:00.000Z",
      "dateModified": "2026-01-16T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A federal judge dismisses the DOJ's effort to get voter data from California",
    "url": "https://www.npr.org/2026/01/15/nx-s1-5678969/doj-voter-data-california-dismissal",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7029x3954+0+698/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F13%2Fa2%2F3691be7c4c3b9246275304c3c2ca%2Fgettyimages-2244998877.jpg",
    "tag": "Politics",
    "date": "2026-01-15T23:59:08.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person enters a polling station to vot",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A person enters a polling station to vote on Nov. 4, 2025, at First United Methodist Church in Pasadena, Calif.\n                \n                    Mario Tama/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mario Tama/Getty Images\n    \n\n   \n   The Trump administration on Thursday was dealt its first legal setback in its unprecedented effort to consolidate voter data traditionally held by states.   Federal district Judge David O. Carter dismissed a lawsuit in California that sought to give the Justice Department access to that state's unredacted voter file, which includes sensitive data like Social Security numbers and driver's license data. A district judge in Oregon also said in court Wednesday that he was tentatively planning to do the same there.   California and Oregon are two of 23 states, along with Washington, D.C., that have been sued by the Department of Justice for rebuffing requests for voter data. All states are led by Democrats, or were lost by President Trump in the 2020 election.   \n   The DOJ has argued that it needs unfettered access to the state voter lists to determine whether states are maintaining their voter lists in accordance with federal law. State officials from both major political parties, however, have noted that the federal government has never had access to this data before, and expressed worries about what else the federal government could use the data for.   \"The government's request is unprecedented and illegal,\" Judge Carter wrote. \"The DOJ's request for the sensitive information of Californians stands to have a chilling effect on American citizens like political minority groups and working-class immigrants who may consider not registering to vote or skip casting a ballot because they are worried about how their information will be used.\"   Carter, who was appointed by President Bill Clinton, also wrote that the Justice Department's suit appeared to be a \"telltale 'fishing expedition.'\"   \"Even the federal government is not permitted to sue first, obtain discovery, and finalize its allegations later,\" Carter wrote.   The Department of Justice did not immediately reply to a request for comment on Carter's dismissal.   The U.S. Constitution is clear that states run their own elections, with almost no input from the executive branch. And when the Trump administration made similar requests for this sort of election data in Trump's first term, it was universally rejected. In 2017, one Republican secretary of state famously said the Trump administration could \"go jump in the Gulf of Mexico.\"   \n   But things have changed.   At least eight Republican states have either voluntarily provided or said they will provide their full statewide registration list to the administration during his second term, according to tracking by the Brennan Center for Justice.   In many cases, the data has been run through a revamped system at the Department of Homeland Security meant to search for noncitizens. NPR was the first news outlet to report on the details of the system, known as SAVE, but after tens of millions of records were run through it, no evidence of the sort of widespread voter fraud Trump has long talked about has come to light.   Carter's ruling is the first to come out of the numerous voter data lawsuits across the country, and during a hearing, he noted that he expected his ruling to be appealed regardless of the outcome, potentially all the way to the Supreme Court.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A federal judge dismisses the DOJ's effort to get voter data from California",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7029x3954+0+698/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F13%2Fa2%2F3691be7c4c3b9246275304c3c2ca%2Fgettyimages-2244998877.jpg"
      ],
      "datePublished": "2026-01-15T23:59:08.000Z",
      "dateModified": "2026-01-15T23:59:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the Trump administration is using influencers to justify its immigration policies",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5677637/how-the-trump-administration-is-using-influencers-to-justify-its-immigration-policies",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-01-16T09:44:16.000Z",
    "description": "How the Trump administration is using influencers to justify its immigration policies   A recent surge in federal agents and Trump-friendly social med",
    "body": "How the Trump administration is using influencers to justify its immigration policies   A recent surge in federal agents and Trump-friendly social media influencers to Minnesota is part of a White House communication strategy that emphasizes online content to influence policy.\n\n    \n        Politics\n    \n\n\n      \n                  \n            January 16, 20264:44 AM ET\n         \n      \n   \n                                                            ,                \n            \n\n\n      \n      How the Trump administration is using influencers to justify its immigration policies\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5677637/nx-s1-9610226\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      A recent surge in federal agents and Trump-friendly social media influencers to Minnesota is part of a White House communication strategy that emphasizes online content to influence policy.   \n\n\n    A MARTÍNEZ, HOST:  There is not just a surge of immigration officers in the Twin Cities. There's also been a growing number of right-wing influencers to document the officers' arrests and clashes with protesters. Both are part of a White House strategy that has used social media content to justify and promote its increasingly aggressive immigration policies. NPR's Stephen Fowler has been reporting on the administration's online presence. Stephen, a lot of the administration's messaging around what's happening in Minnesota seems to be online. President Trump posted on his social media site, threatening to use the Insurrection Act, and the White House is posting memes on their account. What's their strategy here?STEPHEN FOWLER, BYLINE: Well, A, for the Trump administration, content is governing and governing is content. The push into Minnesota with a record number of immigration agents is inspired in part by a viral social media video with unproven claims of fraud. More agents means more protests. More protests bring the Trump-friendly influencers to document the scene, and all of these videos are, in turn, used to justify more agents and the government's response. Beyond ICE agents, the administration has also sought to freeze different types of federal aid to the state and end temporary protected status for Somalis, all of them accompanied by memes and trolling of Democrats. Whitney Phillips, for the University of Oregon, calls it combat sensationalism.WHITNEY PHILLIPS: It's combative. It's highly provocative, but it's also focused on a very particular kind of fight between real Americans, which maps onto MAGA and then this imagined liberal other.MARTÍNEZ: Stephen, what other ways are you seeing this online strategy?FOWLER: Well, in the last two weeks alone, there have been a firehose of examples - the Trump administration using social media to drive policies and to speak to targeted audiences. You've got the defense secretary monitoring the situation in Venezuela with tabs of X, the social media platform behind him. You've got agencies posting QAnon slogans and songs associated with white supremacists. And the official White House account has repeatedly asserted that the United States is seizing Greenland while using popular meme formats of the day. I asked the White House if they have any concern that this high volume of posts that feels more like a campaign feed might be something that turns people off or leaves out those that are less online. A spokeswoman told me, quote, \"the White House has an authentic style and unmatched communication strategy because it's led by the greatest communicator in the history of American politics, President Donald J. Trump.\"MARTÍNEZ: All right. So what's been the pushback to this strategy?FOWLER: Well, in Minnesota, you've got people like Governor Tim Walz, who have compared it to reality TV. They say it's reckless and inflaming tensions after an ICE agent killed Renee Macklin Good last week. In the last year, there's also been a number of controversies around the administration using AI-generated images to attack opponents, posts with dog whistles to extremist content. It's also led to a rise of other politicians mimicking this trolling antagonism, like Governor Gavin Newsom and Governor Kathy Hochul. Where does this all go? We don't know yet. Some of these experts we talk to for the story say a coarsening of politics could push people away from engaging. But on the other hand, they do say viral videos of masked federal agents using aggressive tactics against people could prompt people to tune back into the news and demand change in the administration's policies around ICE.MARTÍNEZ: All right, that's NPR's Stephen Fowler in Atlanta. Stephen, thanks.FOWLER: Thank you.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the Trump administration is using influencers to justify its immigration policies",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-01-16T09:44:16.000Z",
      "dateModified": "2026-01-16T09:44:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justice Department opens investigation into Minnesota governor and Minneapolis mayor",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5680368/justice-department-minnesota-tim-walz-jacob-frey-investigation",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6048x3402+0+315/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6f%2F2a%2Fa9aba88c4f2287b1be7b61a03996%2Fgettyimages-22542066761.jpg",
    "tag": "Politics",
    "date": "2026-01-17T02:22:59.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Minnesota Gov. Tim Walz speaks during a ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Minnesota Gov. Tim Walz speaks during a press conference at the State Capitol on Jan. 5, 2026 in St. Paul, Minn., where he announced he was abandoning his re-election campaign.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   The Justice Department is investigating Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey, a U.S. official said. The official sought anonymity because were not authorized to discuss the matter publicly.   Frey said in a post on X on Friday: \"This is an obvious attempt to intimidate me for standing up for Minneapolis, local law enforcement, and residents against the chaos and danger this Administration has brought to our city. I will not be intimidated.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Minneapolis Mayor Jacob Frey speaks during a press conference at City Hall on Jan. 9. Frey has called on federal investigators to turn over information to the Minnesota Bureau of Criminal Apprehension after the shooting death of Renee Good by a federal officer.\n                \n                    Stephen Maturen/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephen Maturen/Getty Images\n    \n\n   \n   Walz, in a post on X, did not explicitly address the news reports, but said: \"Two days ago it was Elissa Slotkin. Last week it was Jerome Powell. Before that, Mark Kelly. Weaponizing the justice system against your opponents is an authoritarian tactic. The only person not being investigated for the shooting of Renee Good is the federal agent who shot her.\"   The killing of Renee Macklin Good by an Immigration and Customs Enforcement officer last week became a flashpoint for the simmering opposition to federal agents operating within the state.   \n   Walz, Frey and other Democrats in the state have been vocal in their criticism of ICE's presence in the state.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justice Department opens investigation into Minnesota governor and Minneapolis mayor",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6048x3402+0+315/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6f%2F2a%2Fa9aba88c4f2287b1be7b61a03996%2Fgettyimages-22542066761.jpg"
      ],
      "datePublished": "2026-01-17T02:22:59.000Z",
      "dateModified": "2026-01-17T02:22:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It took 75 governors to elect a woman. Spanberger will soon be at Virginia's helm",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5675312/spanberger-virginia-governor-inauguration",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fad%2F0ef22a1a4b16a85b61014a7bd51e%2F260113-gov-elect-abigail-spanberger-06.JPG",
    "tag": "Politics",
    "date": "2026-01-16T19:56:35.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Gov.-elect Abigail Spanberger poses for ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Gov.-elect Abigail Spanberger poses for a portrait during an interview in Richmond, Va., on Tuesday, Jan 13, 2026. Spanberger will break decades of tradition during her inauguration on Saturday by not wearing a morning suit worn by male governors before her.\n                \n                    Tyrone Turner/WAMU\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tyrone Turner/WAMU\n    \n\n   \n   RICHMOND, Va. — Virginia inaugurates its governors in traditional style, complete with a swearing-in ceremony outside the Capitol building presided over by men in three-piece morning suits with coattails and an occasional top hat.   \"At the conclusion of the oaths, there is a 19-gun salute by the National Guard and a jet flyby, if that has been requested,\" reads the state's protocol guide. \"After the salute, the previous Governor and his family retire from the platform.\"   While everyone is busy with the pomp and circumstance, the guide continues, state employees \"prepare the Governor's Office for the new Governor and his staff … to be ready for use the following day.\"   \n   But the guide will need a tweak or two now that Abigail Spanberger is set to become Virginia's 75th governor and the first woman in the role.   \"There's no requirements for what women wear, what women do,\" she said. So she's doing her best to honor the commonwealth's traditions — but also forge her own.   \"I'm not going to wear a morning coat, not to disappoint anyone,\" she added with a laugh.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Glenn Youngkin (left) and Ralph Northam wear the traditional morning suit at their inaugurations in 2022 and 2018.\n                \n                    Anna Moneymaker/Getty Images; Kevin Morley/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images; Kevin Morley/AP\n    \n\n   \n   Spanberger, a Democrat, said she wants her inauguration — which will be complete with a parade, a small-business marketplace, and a ball — to showcase the commonwealth's modern vibrancy and diversity. It helps that the two other leaders taking office are also breaking boundaries. Saturday, Ghazala Hashmi will become the lieutenant governor and the first Muslim woman sworn into a statewide office in the country. Jay Jones will become the commonwealth's first Black attorney general.   Spanberger's own historic \"first\" didn't come up a whole lot on the campaign trail, perhaps because the three-term congresswoman and former CIA officer was running against another woman, Republican Winsome Earle-Sears, for the job.   Spanberger, who led in fundraising throughout the race, won a decisive 15-point victory in November after a campaign focused on the cost of living and the impact of the Trump administration's federal cuts in Virginia. Democrats see her victory as an early test case of the party's emerging message on \"affordability,\" which they are expected to deploy across the country in this year's midterms.   \n   Economic concerns were at the forefront of her victory speech in November. But Spanberger also paid tribute to the Virginia women in politics before her, including Barbara Johns, a Black teenage activist who led a 1951 school walkout to protest school segregation. The walkout led to a legal case that was later folded into the landmark U.S. Supreme Court case Brown v. Board of Education that ultimately desegregated American public schools.   \"She showed us that no matter your age, you can be part of the change and the progress that you want to see here in Virginia and across the nation,\" Spanberger said in her speech. \"We are a nation founded on ideas, but we are a country where it is up to us, the citizens, who must put those ideas into action.\"   She also recognized Mary Sue Terry, a fellow Democrat who served eight years in the Virginia House of Delegates and another eight as attorney general, making her the first woman elected to a statewide position in Virginia.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Mary Sue Terry, the first woman elected to statewide office in Virginia, is sworn in as attorney general on Jan. 11, 1986. Terry recalled to NPR that members of the legislature debated what she should wear to the inauguration. \"The speaker, who had been my running mate for three elections, cut the matter short and said, 'Hell, let her wear what she wants to wear.' And that's what I did,\" she said.\n                \n                    Steve Helber/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Steve Helber/AP\n    \n\n   \n   Terry said she was surprised and delighted to get a shout-out from Spanberger, who she said is \"not just a woman, but the right woman for the job.\"   In one way, Spanberger's election felt like a vindication, she told NPR. Terry ran for governor in 1993 but lost to Republican George Allen, despite her early advantages in fundraising and the polls. During the campaign, opponents criticized her for being unmarried and childless. The attacks came to a head a month before Election Day, when Terry was accused of covering up a relationship with another woman. The allegation was baseless and came from a psychiatrist who had been prosecuted by Terry's office for having sex with minors, but it dominated news coverage in the critical final weeks of the race. To avoid prosecution, the psychiatrist gave up his medical license.   \n   \"All I knew I could do was stay as centered as I could while internalizing the reality that after 15 years of public service in Virginia, my tenure as an elected official would be over as a result of the allegations of my sexuality and my failure to have children,\" Terry recalled.   She says the episode hurt her deeply, and she worried about what it meant for other women coming behind her.   \"I'm sure that there were those who would consider running who weren't comfortable with what I went through, and the prospect of what they would go through,\" Terry said. \"It was terrible.\"   But in her concession speech after she lost the race, Terry told her supporters she still believed another woman would succeed one day.   \"Somewhere in Virginia tonight, the first woman governor of Virginia is watching,\" she said, to cheers.   And while Spanberger can't remember if she watched Terry's speech more than thirty years ago — she was in ninth grade at the time — she does remember how excited her mother was about Terry's candidacy, which she insisted on making \"a teachable moment\" for Spanberger and her two sisters.   \"I know that I was watching her campaigning and excited and inspired by that,\" she recalled. \"Just because it didn't go all the way to the inaugural day, doesn't mean that it wasn't impactful on all of us.\"   Spanberger has a big job ahead of her. She'll need to steer Virginia through a lagging economy and federal cuts to health care and the social safety net, which she pointed out will deeply affect Virginia women, particularly mothers caring for children.   \"It's becoming incumbent on states to endeavor to bridge the gap where possible to ensure that it's not kids and their caregivers who are bearing the largest brunt of those choices,\" she said.   \n   She cited conversations with hospital systems in Virginia who may be forced to shrink or eliminate costly labor and delivery units as they weather federal shifts. She also said she would focus on policies to improve the economic reality of Virginia women, including reducing the state's childcare waitlist to allow caregivers to more easily rejoin the workforce.   But for now, Spanberger is also relishing the chance to shape a new image of what a Virginia governor can be — particularly for the littlest Virginians. She recounted a recent example from a father she met at an event.   \"When he was leaving his home that afternoon, he said, 'Oh, I'm going to go meet the next governor,' and his little daughter said, 'Okay, well tell him hello.' And he said to his daughter, 'Actually, no, it's a woman. The next governor is a woman.'\"   \"The little girl said, 'A GIRL governor?!'\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It took 75 governors to elect a woman. Spanberger will soon be at Virginia's helm",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fad%2F0ef22a1a4b16a85b61014a7bd51e%2F260113-gov-elect-abigail-spanberger-06.JPG"
      ],
      "datePublished": "2026-01-16T19:56:35.000Z",
      "dateModified": "2026-01-16T19:56:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minnesota shows what happens when governing and content creation merge",
    "url": "https://www.npr.org/2026/01/16/nx-s1-5675909/trump-post-online-minnesota-social-media-ice",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3840x2160+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F01%2F88f2e80046ee87ea8d9040172e72%2Fgettyimages-2255804293.jpg",
    "tag": "Politics",
    "date": "2026-01-16T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                White House Press Secretary Karoline Lea",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                White House Press Secretary Karoline Leavitt holds up a printout of a social media post with pictures of alleged undocumented criminals arrested recently by Immigration and Customs Enforcement (ICE) in Minnesota as she speaks during a press briefing at the White House on Jan. 15, 2026.\n                \n                    Mandel Ngan/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mandel Ngan/AFP via Getty Images\n    \n\n   \n   A helicopter flies low across the water at night before heavily armed figures rappel to the ground, take their positions and break down a door. It's not a trailer for a movie, a video game or a recap of a Pentagon operation.   Instead, it's a video from the Department of Homeland Security showcasing Border Patrol agents at work. Despite the combative visuals, it is captioned with the Bible verse, \"Blessed are the peacemakers, for they shall be called sons of God.\"   In President Trump's second term, content is governing and governing is content. Videos like these — as well as from friendly influencers — are how the administration justifies its increasingly aggressive immigration policies.   \n   The messaging blitz to control the narrative has most recently been on display in Minnesota, where a surge of agents and the fatal shooting last week of 37-year-old Renee Macklin Good by an Immigration and Customs Enforcement agent has put the White House's online statements and real-life actions in the spotlight.   After another ICE-involved shooting in Minneapolis Wednesday evening, videos showed federal agents using flash-bang grenades, pepper balls and chemical irritants against protestors. Almost immediately, pro-Trump influencers used clips of the incident to call for the president to invoke the Insurrection Act and deploy the military.   By Thursday morning, Trump had threatened to do just that unless the \"corrupt politicians of Minnesota\" stopped \"the professional agitators and insurrectionists from attacking the Patriots of I.C.E., who are only trying to do their job.\" The White House posted an image of armed federal agents, some wearing masks, with the caption, \"STAND WITH ICE.\"   \n   It's not just Minnesota where the Trump administration is using social media to drive its policies and speak to targeted audiences.   In the first weeks of 2026, a military raid to seize Venezuelan President Nicolás Maduro generated a flood of viral images and clips. Official photos of Defense Secretary Pete Hegseth and others showed that they were also monitoring search results for Venezuela on the social media platform X.    The Labor Department shared a graphic tagged with a popular QAnon conspiracy slogan urging Americans to \"Trust the Plan\" while an ICE recruitment post on Instagram proclaims \"WE'LL HAVE OUR HOME AGAIN,\" attaching a song of the same name popularized by white supremacists.   (Tricia McLaughlin, assistant secretary for public affairs with DHS said on CNN Friday that \"there's no reason we should be manufacturing outrage\" when asked about the poster. The Labor Department did not respond to a request for comment.)   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                In an image provided by the White House, Chairman of the Joint Chiefs of Staff Gen. Dan Caine, left, CIA Director John Ratcliffe, center,  and Secretary of Defense Pete Hegseth, right, monitor U.S. military operations in Venezuela on Jan. 3 from President Trump's Mar-a-Lago club in Florida. On Hegseth's right is a display featuring a search for \"Venezuela\" on the social media platform X.\n                \n                    White House/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        White House/Getty Images\n    \n\n   \n   Online and from the White House briefing room, Vice President JD Vance chastised the media and critics, while the official White House X account copied popular meme formats to regularly assert that the United States will take over Greenland.   \n   \"The strategy looks more like continuous campaigning, more so than the controlled and toned down communication we typically would associate with a governing administration,\" said Yini Zhang, a University at Buffalo professor who studies political communications on social media. \"Volume is a feature, because they can post very frequently and they can shape agenda and framing in real time.\"   The administration's posts are often designed to provoke a reaction, troll opponents and frequently paint Democrats, immigrants and the media as threats.   \"It's combative, it's highly provocative, but it's also focused on a very particular kind of fight between real Americans — which maps on to MAGA — and then this imagined liberal other,\" said Whitney Phillips, a professor at the University of Oregon who studies how information impacts people. She added, \"It is framed as a full-on cosmic drama between ultimate good and ultimate evil.\"   In a statement to NPR, White House assistant press secretary Liz Huston said \"the White House has an authentic style and unmatched communications strategy because it's led by the greatest communicator in the history of American politics – President Donald J. Trump.\"   From viral video to funding cuts in three weeks   The Trump administration's aggressive immigration crackdown in Minnesota, which has been labeled the largest DHS operation in history, was itself propelled by viral social media content created by its allies, specifically a video created by 23-year-old YouTuber Nick Shirley that alleged widespread fraud at several Somali-run daycare centers.   \n   Shirley visited a number of daycares unannounced with a camera and an entourage and claimed the daycare centers must not actually be serving children because he found locked doors or staff declined to answer questions and he could not see if there were kids inside. His specific claims are so far unsubstantiated — state investigators found daycares featured in the film operating as expected.    Other massive fraud schemes in state social service programs are well documented. In a federal case that began during the Biden administration, at least 78 people, many of them of Somali descent, have been criminally charged related to a $250 million scheme involving a COVID-era nutrition program.   \n   Vance quickly praised Shirley's video and this week, as Shirley released a second one, the White House posted, \"The videos from Nick Shirley have shed tremendous light on the situation in Minnesota.\"   In recent weeks, the Trump administration has announced unprecedented efforts to withhold federal funding for Minnesota and other Democratic-led states, though courts have so far blocked most of those attempts. Trump also threatened Tuesday to halt payments to \"sanctuary cities or states having sanctuary cities\" next month.   The administration also announced the end of Temporary Protected Status for Somali nationals on Tuesday and included a meme referencing a Somali pirate from a Tom Hanks movie. Trump then posted on his own social media website, defending ICE and warning there was more to come: \"FEAR NOT, GREAT PEOPLE OF MINNESOTA, THE DAY OF RECKONING & RETRIBUTION IS COMING!\"   The Homeland Security X account this week shared a \"reminder\" from White House deputy chief of staff for policy Stephen Miller that ICE officers \"have federal immunity in the conduct of your duties,\" indicating the administration has no intention of trying to lower the temperature.   But legal scholars have pointed out that federal agents do not have absolute immunity and can be prosecuted for crimes, with some exceptions.   \n   \"Anybody who lays a hand on you or tries to stop you or tries to obstruct you is committing a felony,\" Miller said on Fox News. \"You have immunity to perform your duties and no one — no city official, no state official, no illegal alien, no leftist agitator or domestic insurrectionist — can prevent you from fulfilling your legal obligations and duties.\"   A rush to judgment   Video footage from Jan. 7 shows Renee Macklin Good, a U.S. citizen, was blocking a lane in her SUV on a Minneapolis street when ICE agent Jonathan Ross circled her car and two other agents then ordered her out of her vehicle. One agent tried to open the driver's side door. Good briefly reversed her car, turned her steering wheel to the right which turned her wheels away from Ross, who at that point was near the front left of the car, and drove forward.   \n   Ross fired his gun, fatally shooting Good. DHS officials have told media outlets, including NPR, that Ross suffered internal bleeding from being struck by the car. The agency has not responded to NPR's questions about the extent of the injuries.   Minnesota Gov. Tim Walz blamed the Trump administration for escalating tensions. \"What we're seeing is the consequences of governance designed to generate fear, headlines, and conflict,\" Walz said at a press conference after the shooting. \"It's governing by reality TV, and today that recklessness cost someone their life.\"   Multiple videos of the shooting from different angles — including the video Ross had recorded on his own cell phone in one hand as he fired his gun with his other — were shared online and incorporated into a sea of content from administration officials aimed at justifying the shooting.   Instead of awaiting an investigation to determine the facts about Good's death, the Trump administration's immediate response left no room for nuance or debate. Within hours, Trump posted to his social media platform that Good \"violently, willfully, and viciously ran over the ICE officer,\" adding that \"it is hard to believe he is alive.\"   Vance called Good a \"deranged leftist,\" said \"nobody debates\" that she aimed her car at the officer and put her foot on the accelerator, and scolded journalists on X for \"lying\" about the \"innocent\" ICE officer.   \n            What the press has done in lying about this innocent law enforcement officer is disgusting. You should all be ashamed of yourselves. https://t.co/IfXAAxi9Ql— JD Vance (@JDVance) January 9, 2026\n   \n   Four days later, when it was clear that many Americans and media outlets had interpreted the video evidence differently, a DHS agency spokesperson made a video reinforcing the administration's narrative and trying to discredit other interpretations. \"The nonstop lies and smears from the FAKE NEWS are meant to tear down our brave men and women who protect our homeland every day,\" read the caption.   The swiftness of the Trump administration's very online effort to control the narrative of the shooting has frustrated critics, including Michael Brodkorb, a former officer of the Minnesota Republican Party who says the emphasis on \"leadership through social media\" is not helping soothe tensions.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal officer stands guard as protestors gather while ICE operates in a residential neighborhood in Minneapolis on Jan. 13, 2026.\n                \n                    Octavio Jones/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Octavio Jones/AFP via Getty Images\n    \n\n   \n   \"There was no reason whatsoever I think from a public policy standpoint, from a law enforcement standpoint or from an investigative matter, to go out and frame what occurred in such blunt, raw language — other than for content to energize folks on social media and to whip them up into a lather,\" Brodkorb said.   \n   Brodkorb said the videos that document before, during and after the shooting gives people more information and perspective about what happened, but at the same time a broader online conflict around Minnesota — like Trump calling people from Somalia \"garbage\" — means there is no humanity in the discussion.   \"We've lost the ability to creatively and constructively think about problems,\" he said. \"Critical thinking is just gone. It's out the window, and it's becoming more and more difficult for people to, in essence, call balls and strikes fairly often and things that we're seeing right in front of our eyes without being lobbed into one camp or another.\"    The current political environment has switched from being policy driven to narrative driven, where someone's perspective on an issue is determined by the party they voted for instead of what they could be persuaded to believe, said Larry Schack, a political strategist who recently published an analysis of the 2024 election with the University of Virginia's Center for Politics.   \"We found that voters have largely abandoned issue-by-issue assessment,\" he wrote this week. \"Instead, they adopt broad partisan narratives that shape their understanding of everything, including — as we're seeing in real time — the basic facts of a shooting captured on video.\"   Schack told NPR that an increase of political messaging that reinforces division is \"the type of environment in which democracy over time becomes unsustainable.\"    In the case of the Minnesota shooting, Schack said the immediate jump to partisan conclusions meant that evidence \"doesn't exist to inform, the evidence exists to create and expand and blow out the narratives that support the predominant view of each side.\"   Trump's rise to power has been accelerated by the internet   The Trump administration's governance through content creation strategy is in some ways the logical conclusion for a president whose 2016 campaign was shaped by headline-grabbing social media posts, is now the owner of a social media site, and whose return to the White House was propelled in part by the growing influence of right-wing content creators and podcasters as well as the algorithms of sites like X.   \n   While the early days of 2026 have been dominated by an especially intense digital presence from the Trump administration, its perpetually online strategy has been central to key initiatives from the start of his second term.   The Department of Government Efficiency effort that spent much of 2025 attempting to overhaul the government was inspired by a longstanding online meme and overseen by Elon Musk, the owner of the social media platform X.    DOGE's efforts to cancel federal contracts, fire federal workers and obtain unprecedented access to sensitive data on millions of Americans were themselves fueled by online suggestions on X and defended in social media content that relied on overstated and inaccurate claims of fraud.   The always-online focus is also evident in the Trump administration's staffing. Multiple administration officials had large followings as online influencers before joining government, including Dan Bongino who recently left the FBI and has promised to start podcasting again. Last month, Harmeet Dhillon, the assistant attorney general for civil rights, grumbled on X that her follower count was not growing. \"What kind of content do my folks want to see more of to like and share?\" she posted.   \n            I’ve been stuck at the same level of followers on this account pretty much since I started my government job. What, am I chopped liver over here? What kind of content do my folks want to see more of to like and share?— Harmeet K. Dhillon (@HarmeetKDhillon) December 6, 2025\n   \n   The consequences of having senior government officials compulsively posting online is a concern for Don Moynihan, a professor at University of Michigan's Ford School of Public Policy, who called the fusion of posting and policy a \"clicktatorship.\"   \"Spending excessive time online leads to more extreme behavior in an unrealistic and increasingly toxic environment — just to keep the dopamine coming,\" Moynihan wrote in his newsletter. \"These bubbles are far worse for the rich and powerful, who already have limited contact with people not beholden to them. It hardly needs pointing out that this is less than ideal for a representative government.\"   In the last year, the Trump administration has come to view influencers and partisan journalists as a primary audience it needs to cater to. It holds special briefings for them, gives them access to Cabinet members and invites them on ICE ride-alongs.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Pro-Trump social media influencer James Klug, center, speaks during a roundtable discussion at the White House in October 2025.\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   One event last year, to discuss antifa, the far-left ideology opposing fascism, came about after pro-Trump influencers amplified protests in Portland over ICE and portrayed the city as a war zone requiring military intervention. The invitees included Nick Shirley. Some influencers urged Trump to designate antifa as a foreign terrorist organization. The following month the State Department issued the designation for four European leftist groups.    \n   \"You have to think about the political influencers as being quite aligned and part of that propaganda machine, in part because of the incentives and the access that they have to the administration,\" said Renée DiResta, a professor at Georgetown University who studies online adversarial abuse, influence and propaganda.   \"And that, I think that's not typically how people have thought about propaganda. They thought about it more as a top down media, if anything, or state media. But this intersection with the creator and the administration is changing what that word means and how that relationship operates.\"   Many of those same online influencers are now sharing video of clashes between protesters and federal agents in Minneapolis.   \"What drives attention more than ever is conflict, animosity,\" Brodkorb, the Minnesota Republican, said. \"And that's just not a way to solve problems, and it can just inflame a situation. And what we're seeing right now in Minnesota is exactly that.\"   Winning the internet – but not public opinion?   The Trump administration's social media-first strategy has played a role in numerous other controversies in the last year, often involving AI-generated images and videos to troll political opponents, including a video that purported to show Trump piloting a fighter jet and dropping poop on a Democratic commentator and anti-Trump protesters.    The Department of Homeland Security in particular has come under fire for repeated posts that reference extremist and neo-Nazi material, and in recent days the Department of Labor and the White House have also posted content that include such dog whistles.   \n   But catering to its most fervent online supporters has also sometimes backfired on the administration. During the 2024 campaign, Trump and his allies embraced conspiracies about Jeffrey Epstein and vowed to release all of the government's information about Epstein, who died by suicide while in jail awaiting trial on charges of sexually abusing and trafficking children. Trump's campaign suggested Democrats were behind efforts to keep the truth from the public.   Once in office, Attorney General Pam Bondi invited a group of pro-Trump influencers to receive binders that supposedly included part one of the Epstein files, only for it to be revealed that they included little new material. Trump then spent much of the year attacking his supporters' calls for the documents to be released.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Political influencer Rogan O'Handley, known online as DC Draino, center, next to influencers Jessica Reed Kraus on the left and Chaya Raichik, right, carry binders bearing the seal of the U.S. Justice Department reading \"The Epstein Files: Phase 1\" as they walk out of the the White House in February 2025. The administration mostly released old materials to the influencers, leading to disappointment and strains within Trump's coalition.\n                \n                    Saul Loeb/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Saul Loeb/AFP via Getty Images\n    \n\n   \n   The disappointment and outrage among some Trump supporters about his handling of the Epstein documents ultimately led to a small rebellion among congressional Republicans, who approved near-unanimous legislation requiring the federal government to release almost all the information it has about Epstein after Trump relented to the pressure.   \n   The White House posting style has also inspired some opponents, most notably California Gov. Gavin Newsom, and more recently New York Gov. Kathy Hochul, to mimic Trump's trolling antagonism.   But this coarsening of the political discourse can have grave consequences and lead to more polarization, Zhang of the University at Buffalo warns.   \"More people might be repelled by politics and might tune out of politics and political news because they are just disgusted with the harsh rhetoric and this kind of like endless finger pointing and blaming from both sides,\" Zhang said.   At the same time, recent viral videos of masked federal agents in Minneapolis using aggressive tactics, including smashing car windows and dragging people out of them, could prompt some Americans who had stopped following the news this year to tune back in.   On Wednesday evening, Walz urged Minnesotans to use their cell phones to make more videos of ICE agents' abuses.   \"Help us create a database of the atrocities against Minnesotans — not just to establish a record for posterity, but to bank evidence for future prosecution,\" Walz said.   Videos that show things that Americans are not used to seeing are hard to ignore, said Phillips of the University of Oregon.   \"The irony might ultimately be that if the administration has harnessed for their own benefit the algorithms and trending topics — that those very same things might be what ultimately become part of their undoing when people see it and then think, 'Oh, God,'\" Phillips said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota shows what happens when governing and content creation merge",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3840x2160+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F28%2F01%2F88f2e80046ee87ea8d9040172e72%2Fgettyimages-2255804293.jpg"
      ],
      "datePublished": "2026-01-16T10:00:00.000Z",
      "dateModified": "2026-01-16T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens military action in Minneapolis. And, inside his healthcare plan",
    "url": "https://www.npr.org/2026/01/16/g-s1-106275/up-first-newsletter-minneapolis-protests-venezuela-opposition-trump-health-care-plan",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+156/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F59%2Fa1a6c9574aedbe1ba0cfef9a4c55%2Fgettyimages-2255813342.jpg",
    "tag": "Politics",
    "date": "2026-01-16T12:35:18.000Z",
    "description": "\n      \n      Trump and Minnesota, Venezuela's Opposition, Trump's Healthcare Plan\n    \n            \n                \n                Transcript\n     ",
    "body": "\n      \n      Trump and Minnesota, Venezuela's Opposition, Trump's Healthcare Plan\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/g-s1-106275/nx-s1-mx-5679441-1\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n      Good morning. You're reading the Up First newsletter. Subscribe here to get it delivered to your inbox, and listen to the Up First podcast for all the news you need to start your day.   Today's top stories   President Trump has threatened to invoke the Insurrection Act in Minnesota to stop protests in Minneapolis. On Wednesday, immigration officers shot an immigrant man in the leg, sparking unrest on the city's north side. There are as many as 3,000 federal immigration officers on the ground or expected to arrive soon in the Twin Cities, NPR's Meg Anderson tells Up First.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Protesters (R) are confronted by an ICE supporter during a demonstration outside the Bishop Whipple Federal Building in Minneapolis, Minn., on Jan.15, 2026. Hundreds more federal agents were heading to Minneapolis, the U.S. Homeland Security chief said on Jan. 11, brushing aside demands by the Midwestern city's Democratic leaders to leave after an immigration officer fatally shot a woman protester.\n                \n                    Octavio Jones/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Octavio Jones/AFP via Getty Images\n    \n\n   \n   🎧 Fierce resistance to ICE's presence continues noisily, as community members follow immigration agents in their vehicles. Anderson notes that observers filming and making noise are peaceful acts of resistance that are constitutionally protected. However, ICE has responded aggressively over the last five days with tear gas, flash bangs and pepper balls to disperse crowds. Some people in the community are afraid to leave their homes, including an asylum seeker, who asked to only be identified by her first initial, A. She feels like she can't see a future for herself or her family.   Venezuelan opposition leader María Corina Machado came to Washington, D.C., to meet with Trump for the first time and presented him with her Nobel Peace Prize. She is pushing to remain part of Venezuela's future after the U.S. military operation that resulted in the seizure of Nicolás Maduro. Trump has sidelined Machado and is backing Venezuela's acting president.    \n   🎧 After Maduro's capture, Trump shockingly said he was not backing Machado for president because she didn't have the support or respect within her country. Bloomberg and The Economist's recent polling shows she has substantial support, and people widely believe her party won the disputed 2024 presidential election by a landslide. NPR's Carrie Kahn says the timing of Machado's meeting was extraordinary as acting President Delcy Rodríguez gave a scheduled State of the Nation speech. Venezuela was attacked by the strongest military in the world, but it has to resume diplomatic relations with the U.S., she said.   Yesterday, Trump announced an outline for new health care legislation, which he has dubbed the \"Great Healthcare Plan.\" The White House issued a fact sheet outlining a framework the administration is asking Congress to develop, with four pillars: drug price reforms, health insurance reforms, price transparency for health costs, and fraud protections and safeguards.    🎧 One thing that jumped out to NPR's Selena Simmons-Duffin about the fact sheet is that the policies are not new, but like a compilation of the greatest hits of Republican health policy ideas. The proposal doesn't mention repealing Obamacare, but, given the sparse details provided, it seems to want to let people use federal dollars to buy plans that don't offer comprehensive coverage. The president's plan could potentially weaken Healthcare.gov because its plans can be expensive but offer essential benefits and don't discriminate against people with pre-existing conditions.   \n   Life advice   \n            \n        \n            \n            \n            \n        \n\n\n    \n        Antoine Doré for NPR\n    \n\n   \n   People who have a fear of not being able to sleep are experiencing a phenomenon called \"sleep anxiety,\" which, if it is left untreated, can prevent people from getting any shut-eye. One of the most effective ways to overcome this form of anxiety is through cognitive behavioral therapy for insomnia (CBT-I). But you don't need the official program to benefit from CBT-I. Whether you're dealing with some sleep stress or simply struggling with an off-night from time to time, these CBT-I practices can help:    💤 Wake up at the same time every day, which can help your body know when it's time to get sleepy.💤 Pick a time to transition from daytime activities to nighttime activities in an effort to focus on winding down for bed earlier.💤 If stress comes before bedtime, put some dedicated \"worry time\" on your calendar during daylight hours. You could use that time to write out what's bothering you so you can relax later.   For more guidance on how to beat the anxiety of insomnia, listen to this episode of NPR's Life Kit. Subscribe to the Life Kit newsletter for expert advice on love, money, relationships and more.   Weekend picks   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sandro Rosta as Caleb Mir and Zoë Steiner as Tarima Sadal in Star Trek: Starfleet Academy.\n                \n                    John Medland/Paramount+\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        John Medland/Paramount+\n    \n\n   \n   Check out what NPR is watching, reading and listening to this weekend:   🍿 Movies: Kristen Stewart makes her feature-length directorial debut with The Chronology of Water, based on Lidia Yuknavitch's memoir about growing up with an abusive father and confronting personal memories. Hear what Stewart told Morning Edition host Steve Inskeep about the film.   📺 TV: NPR's Eric Deggans finds Star Trek: Starfleet Academy to be promising, setting the table for future achievement, but not quite ready to prove its value against Trek series legends like Captain Kirk or Mr. Spock.   📚 Books: The new year brings promising titles from George Saunders, Julian Barnes, Jennette McCurdy, Karl Ove Knausgaard, and more. See what publishes this month.   \n   🎵 Music: From Dry Cleaning's Secret Love to Jenny On Holiday's Quicksand Heart, check out the new music that was released today. Plus, a musical playlist to start your weekend off right.   ❓ Quiz: I scored a decent seven out of 10. Think you can beat that? Put your knowledge to the test!   3 things to know before you go   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Tom Sinclair today, smiling while he holds a large cauliflower.\n                \n                    Tom Sinclair\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Sinclair\n    \n\n   \n   When Tom Sinclair was 6 years old, he wandered away from his family's campsite on Lake Superior and got lost. At dawn, he heard the voice of his unsung hero, a stranger who was part of an extensive search to find him. Now, at 66, Sinclair still keeps the newspaper clipping about his rescue and believes the man saved his life.A new national database helps track how state and local governments spend their share of settlement funds. This includes the District of Columbia, which will receive more than $80 million in opioid settlement money over the coming years. (via WAMU)Jodie Foster has spoken French since childhood, but only now has she taken on a lead role scripted almost entirely in the language of Molière, for A Private Life. And, she hopes to take part in more French films.   This newsletter was edited by Yvonne Dennis.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens military action in Minneapolis. And, inside his healthcare plan",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+156/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F59%2Fa1a6c9574aedbe1ba0cfef9a4c55%2Fgettyimages-2255813342.jpg"
      ],
      "datePublished": "2026-01-16T12:35:18.000Z",
      "dateModified": "2026-01-16T12:35:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]