[
  {
    "title": "ICE officer accused of excessive force, then sent back to work despite active probe",
    "url": "https://www.npr.org/2025/12/24/nx-s1-5650773/ice-immigration-agent-leave-oversight",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+402/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2F7a%2F2dbce1ae48a1bf09991f326961d6%2Fgettyimages-2236977859.jpg",
    "tag": "Politics",
    "date": "2025-12-24T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal agent pushes the wife of the d",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A federal agent pushes the wife of the detained man from Ecuador to the ground on September 25, 2025 in New York City.\n                \n                    Stephanie Keith/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Stephanie Keith/Getty Images\n    \n\n   \n   In the span of less than 72 hours, Immigration and Customs Enforcement officer Victor Mojica went from being widely vilified and placed on administrative leave — to being returned right back to his old job.   On a Friday in September, Mojica was caught on several cameras roughly pushing a woman into the hallway and then to the ground, as the woman screamed.   The incident at an immigration court in New York rapidly circulated online and prompted the Homeland Security Department to place Mojica on administrative leave – a rare instance of such leave being publicly announced.   By the following Monday, Mojica was back on the job, without any further explanation from the agency.   \n   NPR has now learned that he returned to work before the Homeland Security Department's internal watchdog had concluded a review into his behavior. The DHS Office of Inspector General ultimately decided — nearly two months later — that the incident did not merit a criminal probe.   The disclosure of the probe raises questions about the adequacy of DHS oversight mechanisms to investigate employee misconduct. It comes as the department has gutted some internal oversight agencies and faces consistent pressure from Trump officials to ramp up deportations.   Critics of the administration, and former ICE personnel, also worry the lack of transparency about DHS's disciplinary practices can further erode trust in federal law enforcement.   \"That's the scary part, that this is just one small case of a larger systemic issue of how law enforcement is being hyper-politicized,\" said Jason Houser, former ICE chief of staff under President Biden. He said the incident adds to the negative view of ICE officers.   \n   DHS has not responded to NPR's questions about its investigation process and procedures.   When Mojica was first suspended, DHS issued a statement that criticized his behavior.   \"The officer's conduct in this video is unacceptable and beneath the men and women of ICE,\" Tricia McLaughlin, assistant secretary of media affairs at DHS, said at the time. \"Our ICE law enforcement are held to the highest professional standards and this officer is being relieved of current duties as we conduct a full investigation.\"   \n   NPR had also documented this officer's previous use of force while on the job.   But a few days later, Mojica returned to \"full active duty\" at ICE, according to media reports at the time. The news was re-shared on social media by Trump advisers, including deputy chief of staff Stephen Miller, seen as one of the architects of Trump's aggressive immigration policy. No further explanation was provided.   \n   Push for more details from DHS   Rep. Dan Goldman, a Democrat, represents the district in New York that includes the immigration court where the incident took place. He had also been interested in getting answers about what happened with Mojica.   He questioned Homeland Security Secretary Kristi Noem about it at a hearing this month, and Noem promised she would give the congressman \"the investigation and the information that you would like.\"   Noem's response, shared with NPR in an undated letter, was five paragraphs long. She said ICE referred the incident \"for appropriate review.\" And DHS's Office of Inspector General on November 25 made the decision to not open a criminal investigation.   It was not immediately clear why Mojica was able to return to work before the agency's inspector general's office had closed its review of his behavior.   It's also unclear whether the inspector general, Joseph Cuffari, who was confirmed by the Senate during Trump's first term, is still pursuing an administrative complaint against Mojica.   \n   \"ICE officers continue to operate in a highly challenging and increasingly dangerous environment,\" according to Noem's response. \"Allegations of excessive force are reviewed through established internal mechanisms and accountability is imposed where warranted, consistent with law and due process. DHS will not litigate individual personnel matters through correspondence.\"   Goldman called the letter \"a wholly unsatisfactory response.\"   It \"didn't answer the question as to what investigation had been done in the three days between the incident and when he was reinstated, and certainly did not provide any more information about any additional investigation by the inspector general or anyone else,\" Goldman said in an interview.   \n   \"So it begs more questions than it answers.\"   Concerns about DHS discipline   Concerns about how DHS investigates and disciplines its employees predate President Trump.   During the Biden administration, the DHS OIG conducted a review of policies and procedures regarding senior executive employees going back nearly a decade and found that ICE did not follow its written policy when conducting disciplinary reviews of these employees.   But immigration policy experts say prior problems could be exacerbated by the rapid surge in hiring new officers, and the pressure the agency faces to detain more immigrants.   \n   For example, groups like the Migration Policy Institute say the rapid expansion of Border Patrol in the mid-2000s led to cutting corners on training and eased applicant vetting, two factors that may have contributed to an increase in misconduct.   Noem's letter to Rep. Goldman also said ICE relies on internal processes, including through its Office of Professional Responsibility, to address personnel and compliance matters. She declined to provide further details, citing that information \"is not appropriate for public disclosure.\"   Darius Reeves, a former ICE field office director for the Baltimore Enforcement and Removal Operations branch, said it is standard for administrative matters to be handed to the Office of Professional Responsibility, especially if there are no broader systemic issues.   Reeves was with the agency during the first Trump administration and left after the Biden administration.   \n   If it was not a criminal complaint, it could be reasonable for an officer to be reinstated quickly given the administration's push for arrests, he said. But he said DHS should have given the public more of an explanation of why it reinstated Mojica since it had publicly denounced the incident.   \"ICE is losing its professionalism,\" he said, speaking about the lack of public response and viral moments like this one. \"ICE has lost what I've always deemed us to be: the silent service.\"   \n   Houser, the former ICE chief of staff, agreed that both the inspector general and internal Office of Professional Responsibility could still be looking into a case like this, but the processes are lengthy.   \"That takes a lot of time and diligence and it doesn't happen overnight and it doesn't happen over a weekend,\" Houser said. He said investigations may be followed by additional review from legal counsels across the agency.   \n   \"Those processes need to be carried out by those that won't have political motives as their goal. It should be carried out by law enforcement,\" he said. \"And when that happened historically, there's a long paper trail of interviews, of witnesses and review and assessment.   \"It's not just brushed under the rug over a weekend.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE officer accused of excessive force, then sent back to work despite active probe",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+402/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F15%2F7a%2F2dbce1ae48a1bf09991f326961d6%2Fgettyimages-2236977859.jpg"
      ],
      "datePublished": "2025-12-24T10:00:00.000Z",
      "dateModified": "2025-12-24T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. bars Europeans it says pressured tech firms to censor American viewpoints online",
    "url": "https://www.npr.org/2025/12/24/g-s1-103606/u-s-bars-five-europeans-american-viewpoints-online",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5072x2853+0+264/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0a%2F05%2F05b145a04717b59d1e2364a8503e%2Fap25356806335161.jpg",
    "tag": "Politics",
    "date": "2025-12-24T06:48:22.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Secretary of State Marco Rubio listens a",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Secretary of State Marco Rubio listens as President Donald Trump speaks at his Mar-a-Lago club, Monday, Dec. 22, 2025, in Palm Beach, Fla.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   WASHINGTON — The State Department announced Tuesday it was barring five Europeans it accused of leading efforts to pressure U.S. tech firms to censor or suppress American viewpoints.   \n   The Europeans, characterized by Secretary of State Marco Rubio as \"radical\" activists and \"weaponized\" nongovernmental organizations, fell afoul of a new visa policy announced in May to restrict the entry of foreigners deemed responsible for censorship of protected speech in the United States.   \"For far too long, ideologues in Europe have led organized efforts to coerce American platforms to punish American viewpoints they oppose,\" Rubio posted on X. \"The Trump Administration will no longer tolerate these egregious acts of extraterritorial censorship.\"   \n   The five Europeans were identified by Sarah Rogers, the under secretary of state for public diplomacy, in a series of posts on social media. They include the leaders of organizations that address digital hate and a former European Union commissioner who clashed with tech billionaire Elon Musk over broadcasting an online interview with Donald Trump.   Rubio's statement said they advanced foreign government censorship campaigns against Americans and U.S. companies, which he said created \"potentially serious adverse foreign policy consequences\" for the U.S.   The action to bar them from the U.S. is part of a Trump administration campaign against foreign influence over online speech, using immigration law rather than platform regulations or sanctions.   The five Europeans named by Rogers are: Imran Ahmed, chief executive of the Centre for Countering Digital Hate; Josephine Ballon and Anna-Lena von Hodenberg, leaders of HateAid, a German organization; Clare Melford, who runs the Global Disinformation Index; and former EU Commissioner Thierry Breton, who was responsible for digital affairs.   Rogers in her post on X called Breton, a French business executive and former finance minister, the \"mastermind\" behind the EU's Digital Services Act, which imposes a set of strict requirements designed to keep internet users safe online. This includes flagging harmful or illegal content like hate speech.   \n   She referred to Breton warning Musk of a possible \"amplification of harmful content\" by broadcasting his livestream interview with Trump in August 2024 when he was running for president.   Breton responded Tuesday on X by noting that all 27 EU members voted for the Digital Services Act in 2022. \"To our American friends: 'Censorship isn't where you think it is,'\" he wrote.   French Foreign Minister Jean-Noël Barrot said France condemns the visa restrictions on Breton and the four others. Also posting on X, he said the DSA was adopted to ensure that \"what is illegal offline is also illegal online.\" He said it \"has absolutely no extraterritorial reach and in no way concerns the United States.\"   \n   Most Europeans are covered by the Visa Waiver Program, which means they don't necessarily need visas to come into the country. They do, however, need to complete an online application prior to arrival under a system run by the Department of Homeland Security, so it is possible that at least some of these five people have been flagged to DHS, a U.S. official said, speaking on condition of anonymity to discuss details not publicly released.   Other visa restriction policies were announced this year, along with bans targeting foreign visitors from certain African and Middle Eastern countries and the Palestinian Authority. Visitors from some countries could be required to post a financial bond when applying for a visa.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. bars Europeans it says pressured tech firms to censor American viewpoints online",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5072x2853+0+264/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F0a%2F05%2F05b145a04717b59d1e2364a8503e%2Fap25356806335161.jpg"
      ],
      "datePublished": "2025-12-24T06:48:22.000Z",
      "dateModified": "2025-12-24T06:48:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration wants to set quota for denaturalizing American citizens",
    "url": "https://www.npr.org/2025/12/24/nx-s1-5649729/trump-administration-wants-to-set-quota-for-denaturalizing-american-citizens",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-24T09:53:19.000Z",
    "description": "Trump administration wants to set quota for denaturalizing American citizens   The Trump administration says it wants to establish a quota for next ye",
    "body": "Trump administration wants to set quota for denaturalizing American citizens   The Trump administration says it wants to establish a quota for next year to denaturalize up to 200 American citizens per month.\n\n    \n        Politics\n    \n\n\n                  \n            December 24, 20254:53 AM ET\n         \n      \n\n      \n      Trump administration wants to set quota for denaturalizing American citizens\n    \n            \n                \n                Transcript\n            \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5649729/nx-s1-9584722\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n                \n                  \n                    \n                    Transcript\n                  \n                \n        \n    \n\n\n\n\n      The Trump administration says it wants to establish a quota for next year to denaturalize up to 200 American citizens per month.   \n\n\n    LEILA FADEL, HOST:  The Trump administration says it wants to accelerate efforts to take away the citizenships of some naturalized Americans. As NPR's Lilly Quiroz reports, it's part of the administration's efforts to remove immigrants - Americans, in this case - they say should not be in the U.S.LILLY QUIROZ, BYLINE: In a document circulated recently to the U.S. Citizenship and Immigration Services Department, the administration says it wants to denaturalize 100 to 200 people per month in 2026. It also says USCIS should work with the Department of Justice to meet that quota. NPR hasn't seen the document, which was first obtained by The New York Times. USCIS spokesman Matthew J. Tragesser told NPR that the goal is to prioritize the denaturalization of people who have been found lying or misrepresenting themselves in the naturalization process. Now, the Trump administration wanting to denaturalize people is not new. Establishing a quota is. Elizabeth Taufa is with the San Francisco-based Immigrant Legal Resource Center. She says denaturalization has historically been used in rare cases.ELIZABETH TAUFA: The traditional example was, like, Nazis who had lied about their Nazi membership and come to the United States and assumed a different identity. And later on, it was found out that they were war criminals, and so they were denaturalized as a result of that.QUIROZ: In June, the DOJ disseminated similar guidance, saying that they would prioritize denaturalization to advance the administration's goal of rooting out people who have become citizens unlawfully. President Trump's administration is not the first to target people accused of naturalizing illegally. Taufa says under President Barack Obama, new digital tools were launched to find potential cases of naturalization fraud.TAUFA: Every single time this happens, it creates this horrible chilling effect in the naturalized citizen and eligible-to-naturalize population, where folks get scared. And, like, that, you know, unfortunately, is the biggest impact.QUIROZ: During Trump's first administration, about 170 denaturalization cases were sent to court. That's according to an analysis conducted by researchers at Hofstra University's National Immigration Forum. Taufa says it would be a Herculean undertaking for the administration to meet the 100-to-200-per-month quota.TAUFA: I mean, not without cutting some corners. And I think we've seen this administration is very willing to set legal precedent aside.QUIROZ: Immigration law experts and advocates say these efforts will likely be challenged in court.Lilly Quiroz, NPR News.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration wants to set quota for denaturalizing American citizens",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-24T09:53:19.000Z",
      "dateModified": "2025-12-24T09:53:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Republican strategist talks about what the future holds for the GOP",
    "url": "https://www.npr.org/2025/12/26/nx-s1-5652063/republican-strategist-talks-about-what-the-future-holds-for-the-gop",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-26T12:25:58.000Z",
    "description": "\n      \n      Republican strategist talks about what the future holds for the GOP\n    \n        \n                Download\n                \n            ",
    "body": "\n      \n      Republican strategist talks about what the future holds for the GOP\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5652063/nx-s1-9586569\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Morning Edition host Leila Fadel asks GOP strategist Alex Conant about the future of the Republican party in 2026 and beyond.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Republican strategist talks about what the future holds for the GOP",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-26T12:25:58.000Z",
      "dateModified": "2025-12-26T12:25:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How one politically divided family keeps the peace during the holidays",
    "url": "https://www.npr.org/2025/12/25/nx-s1-5647745/how-one-politically-divided-family-keeps-the-peace-during-the-holidays",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-25T09:58:25.000Z",
    "description": "\n      Talking about politics over the holidays can be difficult for many families, even for politicians themselves. One politically divided family in",
    "body": "\n      Talking about politics over the holidays can be difficult for many families, even for politicians themselves. One politically divided family in Colorado makes sure get along, especially during the holidays.   \n\n    LEILA FADEL, HOST:  Politics can make the holidays tough for a lot of families, and that includes politicians. Colorado Public Radio's Bente Birkeland brings us this story about how one politically-divided family keeps the peace.BENTE BIRKELAND, BYLINE: Monica Duran is one of the top Democratic leaders in Colorado. She serves as the House majority leader and manages the floor and the hundreds of bills that come through the House each legislative session.(SOUNDBITE OF ARCHIVED RECORDING)UNIDENTIFIED PERSON: Members, we are moving into business. Madam Majority Leader.MONICA DURAN: Thank you, Madam Speaker. I move the following bills be made special orders...BIRKELAND: But in her actual House, the Democrat has long been outnumbered by Republicans. Her two sons are conservative. So was her late husband. They all voted for President Trump.DURAN: We're very vocal. Nothing is really held back. So they can be very passionate. And I think when it gets to that point where we're kind of heated, you know, I will say, just timeout. You know, family comes before politics. It just has to.BIRKELAND: Her oldest son, Patrick Ellis, says he's learned a lot from his mom, but when it comes to the issues, she's never managed to change his mind and he's never changed hers.PATRICK ELLIS: I've tried. I think it worked the same way as when you tried to convince me, is...DURAN: (Laughter) Yeah.ELLIS: ...I think you'll hear what I'm saying, you'll understand my perspective, but it will run into a core belief that you have where there is no changing that.BIRKELAND: Patrick studied political science in college and still follows politics closely. Duran says he was the driving force behind her first run for office.DURAN: I was working, and he said, Mom, why don't you do that for yourself? You've always wanted to. And, you know, you always think, well, what do I have to offer? What do I know about any of this?BIRKELAND: Duran is in her eighth year at the State House, serving her final session because of term limits. She lives in a suburb of Denver. Patrick is her constituent, and he says his mom is the only Democrat he's ever voted for.ELLIS: I found instead of really focusing in on the handful of issues we don't agree on is the ones that I do agree with my mom. So, like, what she does for victims, for women, what she's done for animals, things like that, like, we're 100% in agreement with.BIRKELAND: But some policy disagreements are impossible to ignore and have had a big impact on her family. Duran's been a champion of Colorado's stricter gun laws, like waiting periods and age limits for purchases. Those laws led her son David Duran to move out of the state.DURAN: My younger son is extremely passionate and very vocal. He's moved his family to Wyoming because of the direction Colorado is going.BIRKELAND: Her son David didn't want to be interviewed for this story. Duran says it can be hard to hear his stance on gun laws.DURAN: I acknowledge the fact that, yeah, you're right. I have ran those policies, and I realize they've impacted what you feel are your freedoms and your choices that you want to be able to make and how you want to raise your daughter, my granddaughter.BIRKELAND: For Patrick, he says the key to their strong family bond is respect. He says people are so much more than their party affiliation.ELLIS: It's not the biggest focal point of our relationships. My mom is my mother. You know, she's my best friend. She's somebody I can confide in. I don't look at her as somebody who votes entirely different than me.BIRKELAND: Over the holidays, Duran says she and her sons plan to get together. David loves to cook for the family.DURAN: He takes after his dad, so he will make many different dishes - Mexican dishes. I know. Patrick loves it. I love it.BIRKELAND: And when it comes to politics, Duran says she still holds out the tiniest bit of hope that someday her sons will say, turns out Mom was right all along.For NPR News, I'm Bente Birkeland.(SOUNDBITE OF SONG, \"THERE IS NO CHRISTMAS LIKE A HOME CHRISTMAS\")PERRY COMO: (Singing) There is no Chrismas like a home...\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How one politically divided family keeps the peace during the holidays",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-25T09:58:25.000Z",
      "dateModified": "2025-12-25T09:58:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Ro Khanna, D-Calif., on lawmakers demanding more Epstein files be released",
    "url": "https://www.npr.org/2025/12/24/nx-s1-5653315/rep-ro-khanna-d-calif-on-lawmakers-demanding-more-epstein-files-be-released",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-24T12:01:47.000Z",
    "description": "\n      NPR's Leila Fadel asks Democratic Congressman Ro Khanna of California about lawmakers' demands that the Justice Department release more files r",
    "body": "\n      NPR's Leila Fadel asks Democratic Congressman Ro Khanna of California about lawmakers' demands that the Justice Department release more files related to Jeffrey Epstein.   \n\n    LEILA FADEL, HOST:  OK. Now we turn to one of the members of Congress who co-sponsored the legislation that's forcing the release of these documents from the Department of Justice related to Jeffrey Epstein. Ro Khanna is a Democrat from California. Congressman, thank you for being back on the program, and good morning.RO KHANNA: Good morning.FADEL: So you've called this most recent release a bombshell, and you cite in particular one reference to 10 co-conspirators. What are you looking at in the files that you see as a bombshell?KHANNA: The fact that there is an email saying there are 10 co-conspirators means that there are other rich and powerful men who were involved. A lot of the skeptics have said that this is a hoax - that only Epstein and Ghislaine Maxwell were involved in the abuse. I know from talking to the survivors that's not true. They have named other men who either went to the rape island, abused them or covered up for that abuse. This is in the statements to the FBI, the 302 statements, and that is what we're pushing to have released. But we got an email at least saying there were 10 other co-conspirators.FADEL: Now, you said - to expand on what you're wanting to be released, you've said you want to see the FBI witness interviews, which names other men, the Epstein emails seized from his computers, the 60-count draft indictment and the 82-page prosecution memo. You know, just tell me what you're looking for in these particular documents that you want, that is leading for you to want them to be public. Like, what are you looking for in these documents?KHANNA: The most important are the FBI witness interviews. I know from survivors and survivors' lawyers that when they had these conversations with FBI agents, they specifically named other men who they were trafficked to...FADEL: Yeah.KHANNA: ...Or who showed up at the island or who covered up for this abuse. And there were lawyers of the survivors present there. There are dozens of these interview memorandums. The DOJ has not released a single one. In fact, in one case, the DOJ released a survivor's name illegally, but they had not released the file that the survivor wanted. The 60-count draft indictment shows how much the prosecution of Epstein was botched. They only prosecuted him for two counts. So we need that. And the emails on the computer that Jeffrey Epstein had that are - those are his emails to other men, arranging for trafficking, arranging for flights to the island. None of that has come out.FADEL: We are now long past last Friday's deadline for releasing all the files that was set by your legislation. What do you make of the DOJ's argument that it takes time because they need to examine each document to avoid inadvertently identifying victims?KHANNA: Well, frankly, they haven't done a good job. I mean, they've inadvertently released too many survivors. But both Thomas Massie and I have said we are less hung up on the time issue. We are more concerned about them complying with the spirit of the law in good faith, and they haven't done that. If they released some 302 FBI witness interview memorandum, that would be fine. If they released the 60-count draft indictment, that would be fine. That doesn't take a lot of time, and the law explicitly calls for them to release internal communication about charging or not. So they are protecting people, and the president's made it clear who they're trying to protect. He's concerned that people will be harmed with their reputation - that they're bankers and powerful politicians who are in these files. And that is true, and that's the purpose of the law, to have public accountability for them. But the DOJ seems intent on protecting them, frankly, more than the survivors.FADEL: Now, both you and Republican Thomas Massie, the co-sponsor of this legislation, have talked about bringing, quote, \"inherent contempt\" proceedings against Attorney General Pam Bondi. What would that look like? What is inherent contempt?KHANNA: Well, we have Republican support - some Republican support for it as well. We would give the attorney general a 30-day grace period to continue to release documents to be in compliance. And after those 30 days, there would start to be a $5,000 fine on her personally for the documents that she is not releasing. We also plan to go to the Southern District of New York, asking the judge who ordered these releases to have a special master see what should be redacted or not or to create a congressional committee, a bipartisan committee, to see what should be redacted or not.FADEL: Is it realistic, though, that something like this would pass the House? I mean, inherent contempt charges haven't passed in the House against anyone since the 1930s, and this House in particular seems unable to agree on much.KHANNA: Well, people thought it was very unrealistic for us to get the discharge petition passed. That also has not passed for decades. We do know we have some Republican support. And the point is that, given we have Republican support, the Justice Department started to backtrack. An hour after Massie and I announced that they started to release redacted documents in an unredacted form, they did a second release of documents that had that email about the 10 co-conspirators. They are...FADEL: We'll have to leave it there. Democratic Congressman Ro Khanna, thank you. He is the co-sponsor of the Epstein Files Transparency Act.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Ro Khanna, D-Calif., on lawmakers demanding more Epstein files be released",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-24T12:01:47.000Z",
      "dateModified": "2025-12-24T12:01:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For Trump, 'America First' has meant an aggressive use of power in foreign policy",
    "url": "https://www.npr.org/2025/12/25/nx-s1-5647706/for-trump-america-first-has-meant-an-aggressive-use-of-power-in-foreign-policy",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-25T11:52:51.000Z",
    "description": "\n      In his first year back in office, President Trump has made clear that America First is far from isolationist, instead it means aggressive use o",
    "body": "\n      In his first year back in office, President Trump has made clear that America First is far from isolationist, instead it means aggressive use of the country's unilateral power around the world.   \n\n    LEILA FADEL, HOST:  In a few minutes, we'll hear what a career diplomat thinks about President Trump's approach to foreign policy in his first year. Before we do that, though, we look at the facts. The president recently ordered a blockade on all oil tankers into and out of Venezuela that are on U.S. sanctions lists - a dramatic escalation of his pressure campaign against the government of President Nicolas Maduro. It's just one of the latest examples of Trump's aggressive use of power in the region and around the world as he seeks to reshape the global order to U.S. preferences, or at least his own preferences.(SOUNDBITE OF ARCHIVED RECORDING)PRESIDENT DONALD TRUMP: I've restored American strength, settled eight wars in 10 months, destroyed the Iran nuclear threat and ended the war in Gaza, bringing, for the first time in 3,000 years, peace to the Middle East.FADEL: Now, that's a lot of exaggeration, but it has been a busy year on the foreign policy front, and here to talk about this is NPR White House correspondent Franco Ordoñez. Hi, Franco.FRANCO ORDOÑEZ, BYLINE: Hey, Leila.FADEL: Trump campaigned in this idea of ending forever wars, America First, and he's seen as more transactional, having a limited view of when the U.S. needs to engage globally. But in his second term, there's been a lot of focus overseas, right?ORDOÑEZ: Yeah. I mean, since taking office, he's used tariffs as a weapon against allies, declared war on drug cartels, secured the release of hostages in Gaza, and also cozied up to Russian president Vladimir Putin. He's painted European partners as weak and disdains alliances. Stewart Patrick, who served in the George W. Bush State Department and is now at the Carnegie Endowment for International Peace, he told me that Trump has taken aim at the post-Cold War order of economic institutions and alliances and basically redefined it through an America First lens.STEWART PATRICK: The way I have sometimes described is on the eve of America's 250th anniversary, Trump has launched a second American Revolution. He's declared independence from the world that the United States created.ORDOÑEZ: Now, the White House told me that Trump's acting on his promises to advance American interests, delivering fair-trade deals, pushing allies to increase their defense spending, killing narco terrorists - that's their words - while ending global conflicts around the world to make the world safer.FADEL: At the same time, you see in his moves and his statements how Trump really seems to be wanting to divide the world between major powers.ORDOÑEZ: Yeah. I mean, he really does see the world through spheres of influence. I mean, Trump's even cited the Monroe Doctrine in saying that he wants to reassert U.S. dominance in the Western Hemisphere. And that's a big break from past administrations that's prioritized other regions while also confronting the big powers like Russia and China. Trump's instead sought to curry favor with Russia, as we've reported, in a bid to try to end the war in Ukraine.FADEL: Is this where his actions in Venezuela play a role - not only the oil tankers, but these deadly and very controversial drug boat strikes?ORDOÑEZ: Yeah. I mean, and also on immigration and the military buildup in the Caribbean, also the controversial $20 billion bailout of Argentina, Trump's made very clear that he wants the U.S. to be the most influential power in the hemisphere and not China or Russia.FADEL: But isn't China already playing a big role in the hemisphere?ORDOÑEZ: Yeah. I mean, very much so. Benjamin Gedan, who handled the South America portfolio in the Obama White House, told me that Beijing has been eating America's lunch for decades, and they do this through trade and investment, trying to be an appealing partner.BENJAMIN GEDAN: Latin America has a lot of problems right now, and the United States really could help. But the policy prescription right now is just bad medicine. It's bringing a military-first approach to a region that needs investment, it needs trade and it needs help for its law enforcement agencies to be able to fight organized crime. None of those are tasks for an aircraft carrier.ORDOÑEZ: Now, Gedan says the U.S. could instead be building bridges, working to be a partner of choice and not the partner who is feared, which it is now.FADEL: That's White House correspondent Franco Ordoñez. Thank you, Franco.ORDOÑEZ: Thank you, Leila.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For Trump, 'America First' has meant an aggressive use of power in foreign policy",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-25T11:52:51.000Z",
      "dateModified": "2025-12-25T11:52:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A look back at Congress' tumultuous year",
    "url": "https://www.npr.org/2025/12/26/nx-s1-5648830/a-look-back-at-congress-tumultuous-year",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-26T12:26:02.000Z",
    "description": "\n      \n      A look back at Congress' tumultuous year\n    \n        \n                Download\n                \n                \n                    \n ",
    "body": "\n      \n      A look back at Congress' tumultuous year\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5648830/nx-s1-9586568\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Congress kicked off 2025 with an ambitious agenda, but 12 months later, it has ceded much of its power to President Trump and passed a record low number of bills.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A look back at Congress' tumultuous year",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-26T12:26:02.000Z",
      "dateModified": "2025-12-26T12:26:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former ambassador talks about Trump's foreign policy approach during his second term",
    "url": "https://www.npr.org/2025/12/25/nx-s1-5649762/former-ambassador-talks-about-trumps-foreign-policy-approach-during-his-second-term",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-12-25T11:52:40.000Z",
    "description": "\n      Wendy Sherman, a former ambassador who has served under three presidential administrations, analyzes President Trump's approach to foreign poli",
    "body": "\n      Wendy Sherman, a former ambassador who has served under three presidential administrations, analyzes President Trump's approach to foreign policy this year.   \n\n    LEILA FADEL, HOST:  Throughout the year, the Trump administration has argued that it was bringing a dealmaker's mindset to foreign policy, that everything is a transaction. So does that approach to foreign policy work? We're going to discuss this with someone who has a long career of negotiating for the U.S. Ambassador Wendy Sherman is the former U.S. deputy secretary of state and has served three presidents throughout her career. Thank you for joining us.WENDY SHERMAN: I'm delighted to be with you all.FADEL: So, Ambassador, this president's approach to foreign policy, as we said, has been repeatedly called transactional - to fulfill his America First agenda. As you look at this past year, is what you saw illustrative of a transactional foreign policy? And is that the right approach?SHERMAN: I think it is probably a good description of what we have seen. Transactional is not always a bad thing.FADEL: Yeah.SHERMAN: Of course, in any negotiation, you're trying to understand everybody's interests and what they need, what you can give and what you can get. But what is different in this administration is a very go-it-alone, bilateral approach - not one that uses all of the elements of American power, all of the alliances and points of leverage that we have, but rather approaching this as if one's trying to build a building and get an agreement from the zoning authority. And that doesn't work so well in diplomacy.FADEL: You know, we've watched this president sometimes treat allies like enemies, publicly threatening, publicly bullying if he doesn't get what he wants. But he's gotten some things done - a Gaza deal that hasn't exactly brought peace, but has ended the worst of the violence. He touts a slew of other peace deals between feuding countries - Armenia and Azerbaijan, Rwanda and the Democratic Republic of Congo. Is this approach of transactional deal-making working?SHERMAN: Well, I think the issue is whether any deal is sustainable. We've already seen the Rwanda and Democratic Republic of Congo break down. Yes, I'm very glad that there is, in essence, a ceasefire in terms of Gaza. But we are seeing the building of more settlements in the West Bank. We're seeing...FADEL: And people are still being killed pretty much every day in Gaza.SHERMAN: Yes, indeed. So, yes, there have been some at least short-term successes, and we all want peace. But is it sustainable? And if we get in trouble, will we have burnt all of our relationships with our allies so that they won't come to our defense?FADEL: Ambassador, I mean, you've negotiated some of the most consequential U.S. deals, including the Iran nuclear deal under President Obama, which the Trump administration actually described as being transactional and then, during his first administration, pulled out of it. But I'm wondering, as somebody who has been involved in these delicate negotiations with foes, what is the line between maximizing leverage and eroding trust?SHERMAN: Well, look. The Iran nuclear deal was not about, actually, a negotiation among equals in the sense that we and our European colleagues and Russia and China were all working to make sure that Iran never got a nuclear weapon. So it really had to take into account what everyone was trying to get done and ensure that Iran would never get a nuclear weapon. Well, so this is why it is a complex process.And so far, we've seen - let's take the Ukraine example. Ukraine was illegally and horrifically invaded by Russia, and the president sent a friend and a dealmaker to meet with the Russians and to meet with the Ukrainians. But in fact, we know from a recent Wall Street Journal article that Putin, who is a well-versed KGB prior agent, really focused on Witkoff because he thought that he could manage him and manipulate him. And it appears that has been the case. Witkoff and Kushner, the president's son-in-law, are saying that they've had constructive meetings with Russia. But Russia is singing a different tune, and our intelligence community is affirming that, in fact, Putin still wants all of Ukraine. So we're not at that deal that the president said he could get...FADEL: Yeah.SHERMAN: ...Done in Day 1 because he needs a team to do it and not just a couple of guys who think they know best.FADEL: So if you were advising the president on this issue, what would you say to him?SHERMAN: I would say to Witkoff and Kushner, take that intelligence briefing so you really know what you're up against. Use the team that's been put together for you to support you. Listen to them. Talk to your partners. I'm glad to hear that the president spoke with the prime minister of the U.K. recently, that he's been on the phone with the president of France, because, in fact, we all are going to have to deal with the consequences and are dealing with the consequences of what is happening or won't happen here. And for the administration to always remember this is not about a negotiation among equals. Yes, Putin has a lot of power. But this is about someone who illegally invaded a sovereign country.FADEL: Ambassador Wendy Sherman is the former U.S. deputy secretary of state. Thank you so much for your time.SHERMAN: Thank you.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former ambassador talks about Trump's foreign policy approach during his second term",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-12-25T11:52:40.000Z",
      "dateModified": "2025-12-25T11:52:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DOJ says it may need a 'few more weeks' to finish releasing Epstein files",
    "url": "https://www.npr.org/2025/12/25/g-s1-103685/doj-says-few-more-weeks-epstein-files",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7200x4050+0+529/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F71%2F769d00e54f4a8f2dec8e8477971c%2Fap25353818433698.jpg",
    "tag": "Politics",
    "date": "2025-12-25T08:06:45.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This undated photo released by the U.S. ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                This undated photo released by the U.S. Department of Justice shows Jeffrey Epstein and Ghislaine Maxwell.\n                \n                    AP/U.S. Department of Justice\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        AP/U.S. Department of Justice\n    \n\n   \n   WASHINGTON — The Justice Department said Wednesday that it may need a \"few more weeks\" to release all of its records on the late sex offender Jeffrey Epstein after suddenly discovering more than a million potentially relevant documents, further delaying compliance with last Friday's congressionally mandated deadline.   \n   The Christmas Eve announcement came hours after a dozen U.S. senators called on the Justice Department's watchdog to examine its failure to meet the deadline. The group, 11 Democrats and a Republican, told Acting Inspector General Don Berthiaume in a letter that victims \"deserve full disclosure\" and the \"peace of mind\" of an independent audit.   The Justice Department said in a social media post that federal prosecutors in Manhattan and the FBI \"have uncovered over a million more documents\" that could be related to the Epstein case — a stunning 11th hour development after department officials suggested months ago that they had undertaken a comprehensive review that accounted for the vast universe of Epstein-related materials.   \n   In March, Attorney General Pam Bondi told Fox News that a \"truckload of evidence\" had been produced after she ordered the FBI to \"deliver the full and complete Epstein files to my office.\" She issued the directive after saying she learned from an unidentified source that the FBI in New York was \"in possession of thousands of pages of documents.\"   In July, the FBI and Justice Department indicated in an unsigned memo that they had undertaken an \"exhaustive review\" and had determined that no additional evidence should be released — an extraordinary about face from the Trump administration, which for months had pledged maximum transparency. The memo did not raise the possibility that additional evidence existed that officials were unaware of or had not reviewed.   Wednesday's post did not say when the Justice Department was informed of the newly uncovered files.   \n   In a letter last week, Deputy Attorney General Todd Blanche said Manhattan federal prosecutors already had more than 3.6 million records from sex trafficking investigations into Epstein and his longtime confidant Ghislaine Maxwell, though many were copies of material already turned over by the FBI.   The Justice Department said its lawyers are \"working around the clock\" to review the documents and remove victims names and other identifying information as required by the Epstein Files Transparency Act, the law enacted last month that requires the government to open its files on Epstein and Maxwell.   \n   \"We will release the documents as soon as possible,\" the department said. \"Due to the mass volume of material, this process may take a few more weeks.\"   The announcement came amid increasing scrutiny on the Justice Department's staggered release of Epstein-related records, including from Epstein victims and members of Congress.   Republican Rep. Thomas Massie, of Kentucky, one of the chief authors of the law mandating the document release, posted Wednesday on X: \"DOJ did break the law by making illegal redactions and by missing the deadline.\" Another architect of the law, Rep. Ro Khanna, D-Calif., said he and Massie will \"continue to keep the pressure on\" and noted that the Justice Department was releasing more documents after lawmakers threatened contempt.   \"A Christmas Eve news dump of 'a million more files' only proves what we already know: Trump is engaged in a massive coverup,\" Senate Minority Leader Chuck Schumer, D-N.Y., said after the DOJ's announcement. \"The question Americans deserve answered is simple: WHAT are they hiding — and WHY?\"   \n   The White House on Wednesday defended the Justice Department's handling of the Epstein records.   \"President Trump has assembled the greatest cabinet in American history, which includes Attorney General Bondi and her team — like Deputy Attorney General Blanche — who are doing a great job implementing the President's agenda,\" spokeswoman Abigail Jackson said in a statement.   After releasing an initial wave of records on Friday, the Justice Department posted more batches to its website over the weekend and on Tuesday. The Justice Department has not given any notice when more records might arrive.   Records that have been released, including photographs, interview transcripts, call logs, court records and other documents, were either already public or heavily blacked out, and many lacked necessary context. Records that hadn't been seen before include transcripts of grand jury testimony from FBI agents who described interviews they had with several girls and young women who described being paid to perform sex acts for Epstein.   \n   Other records made public in recent days include a note from a federal prosecutor from January 2020 that said Trump had flown on the financier's private plane more often than had been previously known and emails between Maxwell and someone who signs off with the initial \"A.\" They contain other references that suggest the writer was Britain's former Prince Andrew. In one, \"A\" writes: \"How's LA? Have you found me some new inappropriate friends?\"   The senators' call Wednesday for an inspector general audit comes days after Schumer introduced a resolution that, if passed, would direct the Senate to file or join lawsuits aimed at forcing the Justice Department to comply with the disclosure and deadline requirements. In a statement, he called the staggered, heavily redacted release \"a blatant cover-up.\"   \n   Republican Sen. Lisa Murkowski of Alaska joined Sens. Richard Blumenthal, D-Conn. and Jeff Merkley, D-Ore., in leading the call for an inspector general audit. Others signing the letter were Democratic Sens. Amy Klobuchar of Minnesota., Adam Schiff of California, Dick Durbin of Illinois, Cory Booker and Andy Kim, both of New Jersey, Gary Peters of Michigan, Chris Van Hollen, of Maryland, Mazie Hirono, of Hawaii, and Sheldon Whitehouse of Rhode Island.   \"Given the (Trump) Administration's historic hostility to releasing the files, politicization of the Epstein case more broadly, and failure to comply with the Epstein Files Transparency Act, a neutral assessment of its compliance with the statutory disclosure requirements is essential,\" the senators wrote. Full transparency, they said, \"is essential in identifying members of our society who enabled and participated in Epstein's crimes.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DOJ says it may need a 'few more weeks' to finish releasing Epstein files",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7200x4050+0+529/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F31%2F71%2F769d00e54f4a8f2dec8e8477971c%2Fap25353818433698.jpg"
      ],
      "datePublished": "2025-12-25T08:06:45.000Z",
      "dateModified": "2025-12-25T08:06:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]