[
  {
    "title": "Trump praises Japan's new prime minister during visit",
    "url": "https://www.npr.org/2025/10/28/g-s1-95314/trump-japan-visit",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7925x4458+0+791/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd5%2F1729682e4e218ef178066899d230%2Fap25301176761115.jpg",
    "tag": "Politics",
    "date": "2025-10-28T08:47:29.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, left, and Japane",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Donald Trump, left, and Japanese Prime Minister Sanae Takaichi shake hands before their summit talk at Akasaka Palace in Tokyo, on Tuesday.\n                \n                    AP/Japan Pool via Kyodo News\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        AP/Japan Pool via Kyodo News\n    \n\n   \n   TOKYO — President Donald Trump began one of his busiest days of his Asia trip on Tuesday by warmly greeting the new Japanese prime minister, and taking her with him as he spoke to U.S. troops aboard an aircraft carrier.   \n   Although Trump is visiting one of America's most steadfast allies in Asia, there's no shortage of uncertainty while he's there. Sanae Takaichi, who became the country's first female prime minister only days ago, must solidify her relationship with Trump while defending her country's economic interests. Trump is trying to nail down $550 billion in Japanese investment as part of a trade agreement.   Trump and Takaichi swap warm words   As Trump and Takaichi met on Tuesday, they shook hands and he paid her a compliment: \"That's a very strong handshake.\"   \n   In return, Takaichi talked about watching the third game of the U.S. World Series before the event. She added that Japan would give Washington 250 cherry trees next year to honor America's 250th anniversary, as well as fireworks from Akita Prefecture for July 4 celebrations.   She used her early remarks to mention former Japanese Prime Minister Shinzo Abe, her archconservative mentor who forged a strong bond with Trump during his first term through their shared interest of golf.   \"As a matter of fact, Prime Minister Abe often told me about your dynamic diplomacy,\" she said.   Trump called her role as Japan's first woman prime minister as a \"big deal,\" putting an emphasis on the U.S. commitment to Japan. While the president in the past has publicly scolded his foreign counterparts, he had nothing but praise for Takaichi.   \"Anything I can do to help Japan, we will be there,\" Trump said. \"We are an ally at the strongest level.\"   Takaichi is primed for a charm offensive, including a potential purchase of Ford F-150 trucks. Reporters arriving for the event were hustled past a gold-hued Ford F-150 as well as what appeared to be white American-made Toyota vehicles parked outside the Akasaka Palace, which is Tokyo's guest house for visiting foreign leaders.   \n   Trump has often complained that Japan doesn't buy American vehicles, which are often too wide to be practical on narrow Japanese streets.   The Japanese delegation also made the strategic choice to serve American beef and rice during a working lunch that was mixed with Japanese ingredients, at which the two leaders also discussed efforts to end Russia's war in Ukraine.   Takaichi also gave Trump a putter used by Abe, the former prime minister, and a golf bag signed by the professional golfer Hideki Matsuyama, according to a post on X by White House aide Margo Martin. They signed black \"Japan is Back\" baseball caps that resembled Trump's own red \"Make America Great Again\" caps.   Agreements vow a 'golden age' for alliance and cooperation on critical minerals   Both leaders signed the implementation of an agreement for the \"golden age\" of their nations' alliance. When the document was held up after signing, it ran to less than one page and reaffirmed the earlier framework by which the U.S. would tax goods imported from Japan at 15% and the creation of a $550 billion fund for Japan to invest in the U.S.   \n   Trump and Takaichi then signed a second agreement, this one laying out a U.S.-Japan framework for securing the supply of critical minerals and rare earths. That agreement suggested that some of the investment dollars would go to the development of rare earths needed for advanced technologies.   White House press secretary Karoline Leavitt told reporters that Takaichi would be nominating Trump for the Nobel Peace Prize. The two leaders also met with people whose family members were abducted by North Korea.   Trump talks to troops on US aircraft carrier   Although Trump has focused his foreign policy toward Asia around tariffs and trade, he also spoke aboard the USS George Washington, an aircraft carrier docked at an American naval base near Tokyo. The president brought Takaichi with him and she also spoke.   \n   The president talked about individual units on the aircraft carrier, his political opponents, national security and the U.S. economy, saying that Takaichi had told him that Toyota would be investing $10 billion in auto plants in America.   Trump arrived in Tokyo on Monday, when he met with the emperor in a ceremonial visit. He was previously in Kuala Lumpur, Malaysia, where he participated in the annual summit of the Association of Southeast Asian Nations.   The gathering was an opportunity for Trump to celebrate an expanded ceasefire agreement between Thailand and Cambodia, which skirmished along their disputed border earlier this year. Trump had pressured them to stop fighting by threatening to withhold trade agreements.   There were also signs that tensions between the U.S. and China were cooling off ahead of a planned meeting between Trump and Chinese leader Xi Jinping, which is expected to take place in South Korea later this week. Top negotiators from each country said a trade deal was coming together, which could prevent a potentially damaging confrontation between the world's two largest economies.   Details were scarce, and it was unclear how much any agreement would resolve long-standing issues, or if it would return the relationship to the status quo before recent confrontations. China has restructured the export of rare earth elements that are critical for high-tech manufacturing, and Trump responded by threatening tariffs that even he admits would be unsustainable.   Trump is scheduled to leave Wednesday for South Korea, which is hosting the Asia-Pacific Economic Cooperation summit.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump praises Japan's new prime minister during visit",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7925x4458+0+791/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd5%2F1729682e4e218ef178066899d230%2Fap25301176761115.jpg"
      ],
      "datePublished": "2025-10-28T08:47:29.000Z",
      "dateModified": "2025-10-28T08:47:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lawmakers want to crack down on websites pirating sports content",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5564791/lawmakers-want-to-crack-down-on-websites-pirating-sports-content",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-28T08:57:35.000Z",
    "description": "\n      \n      Lawmakers want to crack down on websites pirating sports content\n    \n        \n                Download\n                \n               ",
    "body": "\n      \n      Lawmakers want to crack down on websites pirating sports content\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5564791/nx-s1-9508853\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      The cost of streaming services can add up when you're a sports fan. That's why some turn to pirated websites to follow their teams. A bill introduced in Congress aims to crack down on that practice.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lawmakers want to crack down on websites pirating sports content",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-28T08:57:35.000Z",
      "dateModified": "2025-10-28T08:57:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Confederate statue toppled in Washington, D.C., in 2020 has been reinstalled",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5587824/confederate-statue-albert-pike-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5472x3078+0+285/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff1%2F2e%2F631c5efa4a27b51b2bc84c7ff525%2Fap25217510371940.jpg",
    "tag": "Politics",
    "date": "2025-10-27T20:57:05.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A 2017 photo of the statue commemorating",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A 2017 photo of the statue commemorating Confederate general Albert Pike in Washington, D.C.\n                \n                    Alex Brandon/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Alex Brandon/AP\n    \n\n   \n   A statue of the Confederate general Albert Pike that was pulled down and set ablaze in Washington, D.C. in June 2020 during the Black Lives Matter movement has been renovated and reinstalled in Judiciary Square. The reinstallation on Saturday was a follow-through of an earlier National Park Service announcement that the federal government intended to restore the statue, which it says had been damaged in \"riots.\"   The monument to Pike was first erected in 1901, but has long been a contentious issue within the nation's capital.   The Pike statue is the only monument within Washington, D.C. to honor a Confederate general – but it does not mention his military history. Pike, who was a Freemason and was pardoned by President Andrew Johnson, has also been identified by historians as possibly having been involved with the development of the Ku Klux Klan in the period after the Civil War.   \n   The plaque at the base of the statue, which was originally mounted by the Freemasons, calls Pike an \"author, poet, scholar, soldier, jurist, orator, philanthropist and philosopher.\"   Members of the D.C. Council, the district's legislature, have been calling for the statue's removal since 1992.   \n   In an unsigned statement sent to NPR on Monday, the National Park Service wrote: \"The National Park Service announced on Aug. 4, 2025 that it will restore and reinstall the bronze statue of Albert Pike, which was damaged and vandalized during the Black Lives Matter riots in June 2020. The restoration aligns with federal responsibilities under historic-preservation law and recent executive orders to beautify the nation's capital and restore pre-existing statues.\"   In a statement released Monday, Del. Eleanor Holmes Norton (D-D.C.) objected to the statue's reinstallation, calling it \"an affront to the mostly Black and Brown residents of the District of Columbia and offensive to members of the military who serve honorably.\"   \"Pike himself served dishonorably. He took up arms against the United States, misappropriated funds, and was ultimately captured and imprisoned by his own troops,\" Norton continued. \"He resigned in disgrace after committing a war crime and dishonoring even his own Confederate military service. Confederate statues should be placed in museums as historical artifacts, not remain in parks or other locations that imply honor. Pike represents the worst of the Confederacy and has no claim to be memorialized in the Nation's capital.\" In August, Norton introduced a bill to remove the Pike statue permanently.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Confederate statue toppled in Washington, D.C., in 2020 has been reinstalled",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5472x3078+0+285/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff1%2F2e%2F631c5efa4a27b51b2bc84c7ff525%2Fap25217510371940.jpg"
      ],
      "datePublished": "2025-10-27T20:57:05.000Z",
      "dateModified": "2025-10-27T20:57:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Californians' redistricting vote could hinge on how they feel about Newsom and Trump",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5582302/californians-redistricting-vote-could-hinge-on-how-they-feel-about-newsom-and-trump",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-10-27T20:03:43.000Z",
    "description": "\n      Californians vote on whether to draw new congressional districts next month. Their decision might come down to how they feel about Gov. Gavin N",
    "body": "\n      Californians vote on whether to draw new congressional districts next month. Their decision might come down to how they feel about Gov. Gavin Newsom's confrontation with President Trump.   \n\n    AILSA CHANG, HOST:  Across this state, we're seeing lots of political ads ahead of next week's election. Californians are being asked to approve new congressional maps, and the result could determine who wins control of the House in next year's midterm elections. Now, that vote could hinge on how Californians view Democratic Governor Gavin Newsom versus how they view President Trump. From member station KQED in San Francisco, Marisa Lagos reports.MARISA LAGOS, BYLINE: Newsom and fellow Democrats are asking voters to throw away the maps created by an independent redistricting commission just a few years ago and approve districts aimed at giving Democrats five more seats in Congress next year. The measure is known as Prop 50.(SOUNDBITE OF ARCHIVED NPR CONTENT)GAVIN NEWSOM: Why is Prop 50 called the Election Rigging Response Act? It's in response to an unprecedented assault on midterm redistricting.LAGOS: In an interview with KQED on Friday, the governor says the measure was placed before voters because President Trump is getting Texas and other Republican-led states to redraw their maps to give the GOP an advantage.(SOUNDBITE OF ARCHIVED NPR CONTENT)NEWSOM: This was not - again, this was not the fight we wanted to have.LAGOS: Trump started the unusual mid-decade redistricting race, but there are political implications for Newsom, who acknowledged this weekend on CBS that he'll think about a presidential run in 2028. The outcome of next week's redistricting vote could impact his appeal to Democrats. He says this is about an assault on democracy by Trump and Republicans, noting Trump's Department of Justice announced Friday that it's sending election monitors to California and New Jersey, where there's a governor's race.(SOUNDBITE OF ARCHIVED NPR CONTENT)NEWSOM: They're rigging the election. They're creating the pretext that after we're successful with Prop 50, that they can suggest somehow these were fraudulent. These elections were rigged against them. This is a preview of 2026. Wake up, everybody.LAGOS: In a statement, the DOJ said the monitors were being sent to, quote, \"ensure transparency, ballot security and compliance with federal law.\" Newsom's comments underscore how the Prop 50 campaign is making sure to tie that measure to national Republicans, President Trump and the MAGA movement. And that strategy is similar to four years ago when Newsom beat an attempt to boot him out of office in a recall election. But Jessica Millan Patterson, who's chairing the campaign opposed to the proposition and who previously ran the state Republican Party, says that approach is tired.JESSICA MILLAN PATTERSON: They don't have a playbook. Like, they have one play, and they play that every single time.LAGOS: Patterson says a large swath of the electorate remains undecided, and a range of voters, including disaffected Democrats and independents, are open to the argument that opponents are making.PATTERSON: This is far less partisan, despite what the yes side is trying to do. We talk about these lines that have been drawn by Democrats in a back room. That is when people are like, this is fishy, this is shady, and I don't want anything to do with it.LAGOS: GOP strategist Rob Stutzman, who's not involved in either campaign, says both tactics make sense. Democrats, who hold a 20-point registration advantage over Republicans in California, are simply trying to turn out their base he says.ROB STUTZMAN: So this is a, we don't want to do this, but they're forcing us to do this. If they're going to play dirty, then we got to play dirty.LAGOS: But Stutzman says he wouldn't count out the no side who are relying in part on a strategy that uses Newsom the same way Democrats use Trump.STUTZMAN: Newsom isn't just unpopular with Republicans. He actually triggers them.LAGOS: Newsom says Democrats across the nation are excited about Prop 50, and the campaign has received small dollar donations from all 50 states.(SOUNDBITE OF ARCHIVED NPR CONTENT)NEWSOM: Because people understand what's at stake and they want to see people stand up and have their backs and fight.LAGOS: So while voters here are deciding whether to approve new maps, it may feel more like a choice between Newsom and Trump. For NPR News, I'm Marisa Lagos in San Francisco.\n    Copyright © 2025 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Californians' redistricting vote could hinge on how they feel about Newsom and Trump",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-10-27T20:03:43.000Z",
      "dateModified": "2025-10-27T20:03:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "America's immigration crackdown is disrupting the global remittance market",
    "url": "https://www.npr.org/sections/planet-money/2025/10/28/g-s1-94960/americas-immigration-crackdown-is-disrupting-the-global-remittance-market",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg",
    "tag": "Politics",
    "date": "2025-10-28T10:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        elenabs/Getty Images\n    \n\n   \n   Earlier this year, the Trump administration shut down USAID and slashed spending on international aid and development. Development advocates worried — and continue to worry — that this will hurt the economies of developing nations and have deadly consequences for some of the poorest people on Earth. That story generated tons of headlines earlier this year.   But Dean Yang, an economist at the University of Michigan, argues \"the anti-immigration actions of the Trump administration are likely to have an even bigger negative effect on the economic development of the world's poor countries\" — and that story has gotten much less attention.   \n   It's not just that migration is one of the best known mechanisms to lift people out of poverty. Studies suggest those who move from poor countries to work in rich nations like the United States often see a four-to-five fold increase in the amount they're able to earn, and sometimes way more.   What leads Yang to argue this is that immigrants in the United States send a jaw-dropping amount of money back home to their families. These remittances, as they're known, have dwarfed the size of official foreign aid that the U.S. spends on things like economic development, health, and humanitarian assistance.   In fact, the United States has far and away been the number one source of remittances in the world. According to the International Organization for Migration, which works with the United Nations, immigrants in the United States sent almost $80 billion to their origin countries in 2022 (the last available year of data).   In an upcoming episode of Planet Money, which will be released Oct. 29, we dive into the disruption of these large financial flows in an era of immigration restriction. While some countries, including Mexico, have already seen a large drop in remittances from the United States in recent months, others are seeing a rather surprising pattern: a record-breaking surge. Our episode focuses on the causes and consequences of this surge and dives into the economics of remittances.   \n   This recent surge of remittances, however, is likely only going to be a temporary blip. Remittances will likely drop in the near future, with the large decline of immigration to the U.S., and the large numbers of immigrants already here getting deported.   And that could have significant macroeconomic effects on a whole host of nations, especially in Central America. For countries like Honduras, Nicaragua, El Salvador, and Guatemala, remittances account for a staggering share of their economies, ranging from around 20% to 27% of each country's GDP. These nations are already politically and economically fragile, which is a big reason why so many of their citizens immigrated to the United States in the first place. It's one reason why Yang believes the immigration crackdown could have severe consequences in the developing world.   Stay tuned for our new episode of Planet Money that dives more into this story.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "America's immigration crackdown is disrupting the global remittance market",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6400x3600+0+200/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F56%2Ff0%2F097478f948309937efa8ea9d7ce3%2Fgettyimages-1320933875.jpg"
      ],
      "datePublished": "2025-10-28T10:30:00.000Z",
      "dateModified": "2025-10-28T10:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As Trump talks of designating antifa a foreign terrorist group, experts see danger",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5587726/trump-antifa-terrorist-group",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5653x3180+0+295/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F79%2F4310ac134638800569f178f2cc8a%2Fgettyimages-2239999886.jpg",
    "tag": "Politics",
    "date": "2025-10-28T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as (L-R) White Ho",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump speaks as (L-R) White House Deputy Chief of Staff Stephen Miller, White House Chief of Staff Susie Wiles, Attorney General Pam Bondi, Secretary of Homeland Security Kristi Noem and Federal Bureau of Investigation Director Kash Patel listen during a roundtable discussion at the White House on Oct. 8. The administration held the roundtable to discuss the antifa movement after the president signed an executive order designating it as a \"domestic terrorist organization.\"\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   Earlier this month, President Trump hosted a roundtable at the White House about antifa, the far-left movement or ideology opposed to fascism. Some of the right-wing influencers gathered around the table urged him to designate antifa as a foreign terrorist organization.   \"Would you like to see it done?\" the president asked. \"You think it would help? I'd be glad to do it. I think it's the kind of thing I'd like to do. Does everybody agree? If you agree, I agree. Let's get it done.\" Trump then turned to Secretary of State Marco Rubio and said, \"Marco, we'll take care of that.\"   \n   Trump has already issued an executive order that labels antifa a domestic terrorist organization, but the impact of that is unclear since there is no federal legal provision to designate domestic terrorism groups.   The State Department does have the authority, however, to designate foreign terrorist groups, a move that has real legal teeth. If the Trump administration were to take that step against antifa, it would likely have massive implications.   \"It would have a legal impact that would have a cascading effect across civil society, including social media organizations, civic organizations and everything in between,\" said Thomas Brzozowski, the former counsel for domestic terrorism at the Justice Department.   \"It would effectively criminalize activity that is associated with a diffuse — I hesitate to use the term organization — but more of an ethos or a shared collective dissent to a lot of what the administration is doing.\"   Trump has made no secret of his antipathy for the political left   During Trump's first term in office, he blamed far-left radicals and antifa for violence in cities during social justice protests after the police killing of George Floyd in Minneapolis.   The Justice Department tried to figure out then if there was a funding network or leadership structure for antifa but never presented evidence of either.    \n   The FBI director at the time, Christopher Wray, testified before Congress in 2020 that antifa is not a group but rather an ideology, while also stating that the bureau did have investigations into people who identify as antifa.    This year, after the assassination of conservative activist Charlie Kirk, Trump said there are \"radical left lunatics out there and we just have to beat the hell out of them.\"   \n   Deputy White House Chief of Staff Stephen Miller recently said the Democratic party \"is not a political party. It is a domestic extremist organization.\"   Miller, who was at the White House roundtable, was asked by Trump about possibly designating antifa as a foreign terrorist group.   In response, Miller claimed antifa has \"extensive\" foreign ties and said designating it \"would be a very valid step to take.\"           The secretary of state designates a foreign terrorist organization based on certain legal criteria: Is the entity in question an organization? Is it foreign? Is it engaged in terrorism against Americans or American national security interests?   Based on those criteria, it would be difficult from a legal perspective to designate antifa a foreign terrorist organization, said Jason Blazakis, who for a decade led the State Department office responsible for designations under the Obama and first Trump administrations.    \"First and foremost, antifa is not necessarily an organization. It is at best a movement of disparately linked individuals who are united based on an ideology, which is a belief that fascism is bad,\" Blazakis said.   Antifa isn't a functioning, cohesive organization like ISIS or al-Qaida, he said, which had clear leaders and a hierarchy.   \"I would really call on the State Department or the U.S. government to tell us who the leader of antifa is and where they are based,\" he said. \"We've not heard anybody from the administration really talk about antifa's leadership and its organization structure.\"   \n   Even if officials were to try to characterize antifa as a formal group, senior administration officials have repeatedly described it as inherently domestic, which would make it difficult to suddenly declare it a foreign entity, Blazakis said.   Still, he acknowledged that the Trump administration could push a designation over the line if the president wants it to happen.   Far-right allies in Hungary and the Netherlands, for example, have made statements — echoing Trump — about declaring antifa a terrorist organization.   The administration could point to those, Blazakis said, to \"try to make a creative argument that there is some foreign-based nexus that exists here.\"   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A protest sign held by a demonstrator at a rally at the Atlanta Civic Center on Oct. 18 in Atlanta.\n                \n                    Julia Beverly/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Julia Beverly/Getty Images\n    \n\n   \n   \"It's not necessarily something that we can ignore as a possibility that this administration, they want to pursue, essentially just stretch the truth, to fit its policy objective, in this case going after left-wing or progressives through the lens of using counterterrorism tools,\" Blazakis said.   Asked whether the State Department had begun the process of designating antifa, a department spokesperson said: \"Antifa represents a dangerous threat to law and order. The United States has a variety of options available to target terrorists and terrorist organizations, and the State Department will use all available tools to keep Americans safe.\"   Criminal charges could begin with material support   If the Trump administration does designate antifa a foreign terrorist group, the reverberations would likely be huge, starting with the ability of federal prosecutors to bring the criminal charge of material support to a designated terrorist organization.   This has been a standing charge against ISIS and al-Qaida supporters, and it carries a penalty of up to 20 years in prison.   Material support has been broadly defined over the years; it can mean everything from financial or educational support to something as small as a bottle of water or a $10 gift card.   The law also extends to activity between two people just talking about providing material support to a foreign terrorist organization, which is cause for concern with a nebulous term like antifa, said Brzozowski, the former counsel for domestic terrorism at the Justice Department.   \n   \"When that foreign terrorist organization is so ill defined and nobody even knows what it is, and it potentially includes all activity that can be painted as left wing or whatever term you'd like to hang on it, that becomes potentially catastrophically dangerous for anybody, for everybody,\" Brzozowski said.   There are also potential ripple effects.   Social media companies, for example, take their cues from the government on which groups are dangerous. If antifa is designated, social media companies would likely take steps to restrict any communication that could be seen as related to antifa, Brzozowski said.   The companies also would likely build mechanisms to affirmatively report such activities on their platforms to the government.   \"The social media piece is super important,\" Brzozowski said. \"That really in today's environment obviously is going to dictate in many respects what the broader public sees and what they don't see. So that's going to have an immediate impact on public discourse across the board.\"   Universities, meanwhile, could cancel conferences that touch any topic that might be viewed as related to anti-fascism, and faculty research could be curtailed, Brzozowski said.   Then there are the insurance firms that insure universities, nonprofits, progressive think tanks and foundations.   \"They're not going to insure these institutions if they touch anything that remotely concerns anti-fascism,\" Brzozowksi said. \"And think about how broad that is. What does that even mean? It sounds crazy, Kafkaesque, but that's what this designation would bring into play.\"   All of these ripple effects depend, of course, on the Trump administration following through and designating antifa a foreign terrorist organization.   In Brzozowski's view, there's good reason to believe the administration will.   \"The president himself during a roundtable at the White House turned to his senior advisers whose job it is to designate these entities and instructed them to do it, on TV,\" he said. \"So yeah I think they might do it. And people are not ready for it. People are not ready for it. If that goes through, I'm telling you, unbelievable.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As Trump talks of designating antifa a foreign terrorist group, experts see danger",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5653x3180+0+295/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F65%2F79%2F4310ac134638800569f178f2cc8a%2Fgettyimages-2239999886.jpg"
      ],
      "datePublished": "2025-10-28T09:00:00.000Z",
      "dateModified": "2025-10-28T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration says emergency funds can't be used to keep SNAP benefits going",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5587255/snap-benefit-shutdown-contingency-fund-food-stamps",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2Fa4%2Fce11765142c7a3829bbd6f119945%2Fgettyimages-1287472642.jpg",
    "tag": "Politics",
    "date": "2025-10-27T20:04:06.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                \"SNAP welcomed here\" sign is seen at the",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                \"SNAP welcomed here\" sign is seen at the entrance to a Big Lots store in Portland, Oregon on Oct 28, 2020. The Supplemental Nutrition Assistance Program (SNAP) is a federal program.\n                \n                    Hapabapa/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Hapabapa/Getty Images\n    \n\n   \n   The Trump administration says it will not use emergency funds to send out federal food aid at the beginning of November, blaming Democrats for not working to reopen the government.   Millions of Americans are expected to lose their benefits this week – leaving states scrambling to pitch in and pay the difference, even as some have already notified recipients not to expect their monthly food assistance.   The Supplemental Nutrition Assistance Program (SNAP) is an entitlement program that provides about 1 in 8 U.S. residents an average of $187 a month in food aid. But the roughly $8 billion a month to fund SNAP benefits comes through annual Congressional appropriations, which lapsed on Oct. 1.   \n   A new banner atop the U.S. Department of Agriculture's (USDA) website published Saturday says \"the well has run dry\" and that Senate Democrats are responsible for the department's decision not to send out benefits on Nov. 1.   It's one of several politicized messages posted on the websites of federal agencies during the shutdown in ways that experts say could be a violation of federal ethics laws.    USDA memo says contingency funds can't be used during shutdown   A USDA memo provided to NPR on Monday argues that SNAP contingency funds \"are only available to supplement regular monthly benefits when amounts have been appropriated for, but are insufficient to cover, benefits.\"    The contingency fund is not available to support FY 2026 regular benefits, the memo says, because the appropriation for regular benefits no longer exists.\"     Yet this assessment by the USDA is a departure from the agency's shutdown lapse plan released before Oct. 1, which says \"Congressional intent is evident that SNAP's operations should continue\" in the case of a shutdown, citing the multi-year contingency funds that were created to help cover administrative expenses for states \"to ensure that the state can also continue operations during a Federal Government shutdown.\"   \"These multi-year contingency funds are also available to fund participant benefits in the event that a lapse occurs in the middle of the fiscal year,\" the USDA shutdown plan continued.    \n   That plan has since been removed from the USDA's website.    The White House did not respond to NPR's questions about why the lapse plan was removed or the apparent change in SNAP funding guidance.   Funding decisions affect who can access benefits    Many budget experts disagree with the administration's assessment that the SNAP contingency funds cannot be used during the shutdown and tell NPR that SNAP funding is being used as a political cudgel in the ongoing shutdown.   \"If you have an entitlement to something, and you have money that can fill that use, then you must fill that use,\" Bobby Kogan with the center-left Center for American Progress said. \"When they say 'Oh, no, it's not for benefits.' What do you think SNAP is? What do you think a program operation for SNAP is other than benefits?\"    Kogan also points to the administration's transfer of $300 million to continue funding the Special Supplemental Nutrition Program for Women, Infants, and Children, also known as WIC, as a pathway to keep SNAP benefits going.   According to federal budget documents, the Trump administration transferred the $300 million for WIC from a state child nutrition programs account that is funded in part by a portion of customs duties collected during the prior calendar year.   Those Section 32 funds are separate from the increased revenue generated from sweeping tariffs imposed by President Trump in recent months. That $23 billion is also a source that the administration says it won't tap for SNAP, arguing it would jeopardize money for school meals and infant formula.   The Trump administration has taken several steps throughout the shutdown to move money around to fund priorities, such as a directive to pay active-duty military members using unexpired defense research funds.   A White House memo directed Defense Secretary Pete Hegseth to find money within the department's budget that had \"a reasonable, logical relationship to the pay and allowances of military personnel, consistent with applicable law.\"   \n   Devin O'Connor with the left-leaning Center on Budget and Policy Priorities said that the USDA lapse plan and the way previous potential SNAP shortfalls were handled shows that the contingency fund accounts are supposed to be used for a case like this.   Those contingency funds, which currently total just under $6 billion, are intended by law \"for use only in such amounts and at such times as may become necessary to carry out program operations.\"   Still, O'Connor said the federal government and its programs are not designed to withstand a lapse in funding.   \"When you shut down the government, bad things happen, and the longer the government is shut down, the more bad things will happen,\" he said. \"And even with the Trump administration taking relatively aggressive actions to try to prevent certain harms over time, it's just going to grow and it's going to become more and more painful.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration says emergency funds can't be used to keep SNAP benefits going",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe2%2Fa4%2Fce11765142c7a3829bbd6f119945%2Fgettyimages-1287472642.jpg"
      ],
      "datePublished": "2025-10-27T20:04:06.000Z",
      "dateModified": "2025-10-27T20:04:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fight over government layoffs continues as shutdown drags on",
    "url": "https://www.npr.org/2025/10/28/nx-s1-5585083/government-shutdown-trump-rif-layoffs",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6816x3834+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F04%2Fc6ae1c6c4e81b2a0a7a2c8655cd9%2Fimage-credit-tom-williamscq-roll-call-inc-via-getty-images.jpg",
    "tag": "Politics",
    "date": "2025-10-28T09:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Signs with the image of Office of Manage",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Signs with the image of Office of Management and Budget Director Russell Vought are seen during a news conference Congressional Democrats held to protest the Trump administration's mass firing of federal employees in Washington, D.C., on Tuesday, Oct. 14.\n                \n                    Tom Williams/CQ-Roll Call, Inc via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Williams/CQ-Roll Call, Inc via Getty Images\n    \n\n   \n   A federal judge in San Francisco will weigh Tuesday whether to indefinitely halt the Trump administration's mass layoffs of federal employees during the government shutdown.   The hearing comes almost two weeks after U.S. District Judge Susan Illston temporarily paused thousands of layoffs, known as RIFs, or reductions-in-force, at agencies where the federal employee unions that brought the lawsuit, including the American Federation of Government Employees, have members or bargaining units.   The Trump administration has pushed back. It's argued first, that the court lacks jurisdiction to hear the case, and second, that the unions have failed to show that they are suffering irreparable harm as a result of the administration's actions.   \n   In the days since Illston first issued her temporary restraining order, the two sides have haggled over its scope. The Trump administration initially determined it did not apply to most of the roughly 4,000 federal employees who have received layoff notices since the government shutdown began on Oct. 1, including those working for the Treasury Department and the Centers for Disease Control and Prevention. Illston later modified the order, including by broadening it to cover six additional unions.   Whatever comes of President Trump's latest attempts to slash the federal workforce, it's clear that the administration's modus operandi — taking sweeping and legally questionable actions to swiftly eliminate jobs — is taking a toll on workers, as is evidenced by some of the testimonies submitted to the court as part of a lawsuit.   For many of those receiving layoff notices amid the shutdown, it's not the first time the Trump administration has tried to fire them.   In a declaration filed in court, Mayra Medrano, a program analyst with the Commerce Department's Minority Business Development Agency and a member of the National Federation of Federal Employees, writes that she first received a RIF notice in April with an effective termination date of May 9 before being reinstated by court order in June.   \n   \"The constant threat of being fired, which has persisted for months, has caused me tremendous physical and mental distress,\" she writes, elaborating that she experienced a severe stress-induced seizure while on administrative leave this spring.   She writes that she now feels as if she's reliving that nightmare.   \"Receiving a RIF notice during the government shutdown, on top of the previous RIF, has been traumatic and it will have a lasting impact on my health,\" she writes. \"It doesn't feel as though the administration thought about or cared about that long-lasting impact.\"   Medrano did not respond to NPR's request for further comment.    In the initial hearing in the case two weeks ago, the plaintiffs' attorney Danielle Leonard sought to draw attention to the emotional trauma that federal workers are experiencing, pointing to comments made by White House Office of Management and Budget Director Russell Vought before Trump's re-election.   In a private speech in 2023 surfaced by ProPublica, Vought, who is now largely seen as the force behind the shutdown layoffs, said he wanted government bureaucrats to be \"traumatically affected\" to the point of not wanting to go to work.   \"That's exactly what they are doing,\" Leonard told the court.   In an interview with The Charlie Kirk Show before Illston blocked the layoffs, Vought said more than 10,000 people could receive RIF notices during the shutdown.   \n   Still, that amounts to only a fraction of the federal employees who have been fired since Trump returned to the White House in January.   Back in August, Office of Personnel Management Director Scott Kupor said roughly 300,000 federal workers would be gone from the government by the end of the year, noting that 80% of those departures were voluntary.   That means even prior to the shutdown, roughly 60,000 federal workers faced involuntary separation, according to Kupor's estimates.   Another 154,000 workers took the Trump administration's \"Fork in the Road\" buyout offer, according to OPM. Many who took the buyout told NPR they feared they would be fired if they didn't leave.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fight over government layoffs continues as shutdown drags on",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6816x3834+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6a%2F04%2Fc6ae1c6c4e81b2a0a7a2c8655cd9%2Fimage-credit-tom-williamscq-roll-call-inc-via-getty-images.jpg"
      ],
      "datePublished": "2025-10-28T09:00:00.000Z",
      "dateModified": "2025-10-28T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Doug Ford, the Canadian politician pushing Trump's buttons?",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5587701/doug-ford-canada-tariffs-ad-trump",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8301x4669+0+432/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2F4b%2F677e3d514724a6a844e184dba1a8%2Fap25042644796048.jpg",
    "tag": "Politics",
    "date": "2025-10-27T18:11:38.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Ontario Premier Doug Ford speaks during ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Ontario Premier Doug Ford speaks during an event with the U.S. Chamber of Commerce on Feb. 11 in Washington, D.C.\n                \n                    Mark Schiefelbein/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Mark Schiefelbein/AP\n    \n\n   \n   As Doug Ford campaigned to become Ontario's premier in 2018, he put out a very Trumpian vibe. On the trail, he attacked the media and the elites, raged against measures to combat climate change, vowed to cut income taxes and gas prices, and even expressed support for President Trump's policies.   It might seem surprising then to now see Ford — who is in charge of Canada's largest province — taking the lead in opposing Trump's harsh tariffs as Prime Minister Mark Carney scrambles to manage the fallout from U.S.-Canada trade tensions.   In recent months, Ford's criticism of Trump has been growing, most recently in the form of a television ad featuring the words of President Ronald Reagan warning in a 1987 radio address against the perils of protectionism. The ad has attracted Trump's ire and appears, at least temporarily, to have derailed trade talks between the two countries.   \n   Who exactly is Doug Ford and what accounts for this political 180?   Three generations of the former businessman's family have served as elected officials, and Ford began his political career on the Toronto City Council from 2010 to 2014.   \n   The period was marked by the dramatic fall from grace of his younger brother, then-Toronto Mayor Rob Ford, who admitted to smoking crack cocaine and then was dogged by evidence of a string of other abusive behavior.    In the same year that Rob Ford publicly admitted to drug use, The Globe and Mail published an exposé that said the brothers had dealt hashish in the 1980s.   Rob Ford died from a rare form of cancer in 2016.   Moving from the right to the center   Just two years after his brother's death, Doug Ford's political fortunes blossomed. He and his right-of-center Progressive Conservative Party won a majority in Ontario, riding discontent against the Liberal Party, who were coming off 15 years in power in the province.   \"Doug Ford got elected in large measure to get rid of a very unpopular government,\" says Steve Paikin, a long-time political analyst and host of the Paikin Podcast, a weekly current affairs podcast in Canada.   Paikin says after Ford's success in 2018, he made the mistake of assuming Ontario had voted for his agenda, when in fact the Progressive Conservatives' election success was mostly about removing the Liberals.   \n   \"He got into office practicing a kind of disruptive, robust populism on steroids, which made his government, frankly, the most unpopular I had ever seen,\" Paikin says.   That's when he decided to tack to the center. In the years that followed, Ford reached out to Canada's left, including the now-prime minister. He also won praise even from critics for his handling of the COVID-19 pandemic response in Ontario.   \"COVID saved him. When the COVID crisis hit, he suddenly realized that all the kind of populist, anti-science, anti-expertise, 'we're just going to wing it by the seat of our pants,' that wasn't going to work,\" Paikin says. \"He suddenly realized, I need to rely on experts.\"   NPR reached out to Ford's office for an interview with the premier, but received no response.   From Trump enthusiast to \"Captain Canada\"   When former Prime Minister Justin Trudeau announced he would step down in March this year, just as the White House was preparing its April 2 \"Liberation Day\" tariffs, Ford moved in to fill the vacuum, emerging as the voice of the anti-tariff response.   \n   By the time of his second reelection bid earlier this year, Ford's early enthusiasm for Trump had long faded. On the campaign trail, he donned a baseball cap that mocked the red \"Make America Great Again\" hats — Ford's blue cap, worn at a news conference in January, read \"Canada is not for sale.\"   \"President Trump is promising steep and sweeping tariffs that will devastate our economy and put hundreds of thousands of people out of work,\" Ford told voters. \"Whether he imposes tariffs next week, next month or waits a year, President Trump's threats are not going away. With a strong mandate from the people, I will do whatever it takes to protect Ontario.\"   After winning reelection in February, Ford threatened to cut off electricity to homes in the U.S. in retaliation for the tariffs and Trump's threats to annex Canada. Ford also canceled a $100 million contract with Elon Musk's SpaceX to provide Starlink services to the country.   \n   Ford's stance won him the sobriquet \"Captain Canada.\"   \"Bad cop\" to Carney's \"good cop\"   Trump announced Friday that he was ending all trade negotiations with Canada over the ad featuring Reagan. Ford subsequently said that after talking with Carney, he had decided to pause the advertising campaign, calling it a success for having reached U.S. audiences.   In an X post on Friday, Ford wrote: \"Canada and the United States are friends, neighbours and allies.\" In a statement later, he said: \"Our intention was always to initiate a conversation about the kind of economy that Americans want to build and the impact of tariffs on workers and businesses.\"   \"We've achieved our goal, having reached U.S. audiences at the highest levels,\" he added.   Paikin suggests that because of their close relationship, Carney and Ford are playing a game of \"good cop, bad cop\" with the anti-tariff ads – Ford gets to ramp up the rhetoric as Carney plays deal maker.   \"Mark Carney ran on a platform of elbows up and ever since he became the prime minister, the elbows have definitely been down,\" Paikin says. \"He's trying to take a more muted approach.\"   \"The other side of the coin is [that] Doug Ford is free to do whatever he wants.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Doug Ford, the Canadian politician pushing Trump's buttons?",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8301x4669+0+432/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F5f%2F4b%2F677e3d514724a6a844e184dba1a8%2Fap25042644796048.jpg"
      ],
      "datePublished": "2025-10-27T18:11:38.000Z",
      "dateModified": "2025-10-27T18:11:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Finland's stubbornly low birth rate shows why a population shift may be inevitable",
    "url": "https://www.npr.org/2025/10/27/nx-s1-5536836/population-family-birth-rate-babies-europe-finland-baby-box",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5712x3213+0+298/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F47%2Fa1%2F983a83eb4a319c44bb7a92e46c7f%2Fimg-3507.jpg",
    "tag": "Politics",
    "date": "2025-10-27T14:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Poa Pohjola, 38, and Wilhelm Blomberg, 3",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Poa Pohjola, 38, and Wilhelm Blomberg, 35, of Helsinki, welcomed their first baby in July. After initially hesitating to have a child, Pohjola says she realized in her mid-30s that she wanted to become a mother, and Blomberg agreed.\n                \n                    Sarah McCammon/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sarah McCammon/NPR\n    \n\n   \n   Families in the U.S. and around the world are having fewer children as people make profoundly different decisions about their lives. NPR's series Population Shift: How Smaller Families Are Changing the World explores the causes and implications of this trend.      On a clear but chilly autumn day, Poa Pohjola and her partner Wilhelm Blomberg are relaxing in their Helsinki apartment while their baby naps outside on the balcony, in traditional Finnish style.   \"They sleep very well outside, in colder degrees, I think,\" Pohjola said with a laugh. \"Or, that's how I grew up thinking.\"   \n   Pohjola is 38 and Blomberg is 35. They've been together for about three years, and they started talking about having a baby early on - even though Pohjola had once thought she might never have kids.   \"I think I was denying that for myself because it seemed [like] something that would be impossible to have,\" she said.   \n   In her 20s, Pohjola says she struggled to figure out what she wanted from life. By the time she met Blomberg, she knew the window of opportunity to become pregnant was closing because of her age.   But one night, the couple talked about their wishes for their future, and she told Blomberg she thought she wanted a baby. He agreed.   Blomberg says they both felt ready to be parents.   \"One, in a way, convincing argument was that both of us have had time to, like, roam around and do what we want in life,\" he explained.   Researchers say Finnish people are increasingly delaying having children, or not having them at all. The nation's \"total fertility rate\" — a technical term used by demographers — has fallen to historic lows in recent years. Although there have been some signs of a possible rebound in recent months, the number remains less than 1.3 children per woman — well below the replacement level of 2.1 needed to maintain a steady population.   \n   That's despite the Nordic region's reputation for providing paid time off for both mothers and fathers, along with childcare and other support. As families around the world are having fewer children, even Europe is seeing a major drop in birth rates despite those generous, publicly funded benefits.   Among other things, that means less demand for Finland's iconic baby boxes.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Eeva Patomeri, a spokesperson for Kela, Finland's taxpayer-funded social insurance agency, says the government has been distributing \"baby boxes\" filled with clothing and other infant supplies since the 1930s. But she says the demand has declined along with the birth rate.\n                \n                    Sarah McCammon/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sarah McCammon/NPR\n    \n\n   \n   \"It has loads of winter clothes, loads of summer clothes, loads of baby care items, something for moms,\" said Eeva Patomeri, a spokesperson for Kela, Finland's taxpayer-funded social insurance agency.   They've been handing out the boxes since the 1930s and there's a new edition of the box each year. But many new parents were still getting last year's box well into 2025 because Kela still had so many left over from 2024.   \"Sometimes the box, we start delivering it in spring, and now it was August, and that's because of low birth rates,\" Patomeri said, adding more parents are choosing cash payments in lieu of the box, too.   \n   Benefits for Finnish parents go far beyond free baby clothes and blankets. Both mothers and fathers receive government-subsidized parental leave through Kela, low-cost childcare and national healthcare.   Kela's research manager, Anneli Miettinen, says historically, leaders of the Nordic countries: Finland, along with Denmark, Iceland, Norway and Sweden, thought these policies were helping to support relatively stable birth rates.   \"So we cannot really any longer say that it's our good family policies that explain good fertility in the Nordics,\" she said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Along with Finland's iconic baby boxes filled with supplies, Finland's government offers new parents taxpayer-funded benefits including paid parental leave, low-cost subsidies, and national healthcare.\n                \n                    Sarah McCammon/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sarah McCammon/NPR\n    \n\n   \n   Births have fallen across the region, with Finland's falling to the lowest rate among the five nations — down by a third since 2010.   \"What is puzzling researchers, is how this could be true, because all of these countries are relatively good in providing support to families,\" Miettinen said, \"but there aren't really very good explanations for the very low fertility rates at present.\"   \n   Immigration has offset some of the decline, but officials in Finland, like many other countries facing this global trend, are still worried about an aging population, a shrinking workforce and pressure on the pension system.   Anna Rotkirch, with the nonprofit Family Federation of Finland authored a report last year commissioned by the Finnish government, which outlined possible causes and policy solutions. Rotkirch says her research suggests a gap between what young people say they want from life and the families they ultimately form.   \"We go to schools; you talk to 17-year-olds, and we are like, 'What would be your ideal family? If you want a family at all, what would be your ideal life?'\" she explained.    \"You get these, surprisingly, in a way, normative perceptions,\" she added. \"You know, 'I want a small house with a dog and a garden and a spouse and three children.'\"    \"And it really breaks my heart, because I'm like, that's not going to happen. If the world goes on like it's now, you know, half of you, this is just not going to happen,\" she said.    \n   Disconnected and financially uncertain amid family planning   Rotkirch says there appear to be many possible reasons for this decline. Many young people are focusing on their education and careers. Those who have children are having them later. Rotkirch says young people also are having a harder time forming relationships, and some researchers think technology is partly to blame.   \"Screens are away from actual physical, embodied interactions, and it's in those interactions that babies get made and also people fall in love,\" she explained. \"The physical part of our humanity is obviously at stake.\"   Milla Tuokkola, a 34-year-old television writer in Helsinki, says she's tried dating online. But too often, she says, she's been harassed and subjected to degrading language.   \"They're just very porn-brained…objectifying,\" she said of the men she's meeting online and on dating apps. \"I feel like they're being radicalized online when they're young.\"   Tuokkola is divorced. Sometimes, she thinks she'd like to have a child, but she's had trouble meeting the right partner.   \"They don't seem a safe, reliable option to have a child with,\" she said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Milla Tuokkola, 34, a television writer in Helsinki, says she's open to having a child but she has struggled to find the right partner\n                \n                    Sarah McCammon/NPR\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Sarah McCammon/NPR\n    \n\n   \n   Some young adults say when they think about having children, they also worry about the larger state of the world, whether climate change or the economy.   Anselmi Auramo, 28, is a student in Helsinki. He's engaged to be married, and plans to become a father one day, but says he's not sure when he'll be financially ready. He believes financial concerns cause many young people to think twice about having children.    \"Whether it's [the] American dream or Finnish dream or whatever it is, it seems so distant, and you expect to have that in order to have the family,\" he said.   Answering a global question   Finland's struggle to boost family size matches what many other countries are experiencing. From authoritarian regimes like China and Russia to progressive nations like Canada and Finland, governments have tried a range of policies designed to encourage higher birth rates.   \n   But experts say even the most expensive attempts at policy solutions have shown limited or no success.   Miettinen, with Kela, says there's not one, single reason why young people are having fewer children, and there won't be a single solution to reversing the trend, either.   \"These types of policies may not be enough any longer, but we need to invent something else to support young adults,\" she said.   \n   Rotkirch, with the Family Federation, says ultimately, these decisions are in the hands of younger generations.   \"But what we can do as the elderly generations and what the policy makers can do is really prioritize this,\" Rotkirch said. \"Prioritize listening to young people - their wishes for family formation - and support them.\"   For Poa Pohjola and Wilhelm Blomberg, the couple with the new baby, there are fears about the future. Pohjola remembers Finland's financial crisis in the early 1990s, and worries about economic stability.   Blomberg says he thinks about climate change and rising authoritarianism around the world.   \"We are in such turbulent times, and it's hard to, like, have a sense that you can control things,\" he said. \"And one thing you can control is whether you're having a baby or not, as it's so hard to predict what the future will bring.\"   Still, they're talking about having another child; Blomberg has a brother he's very close to, and he'd like to give their son a sibling, too.   Pohjola is slightly more hesitant.   \"When I start overthinking it, I'm like, 'Okay, we would need to have this child quite soonish, and then we have a toddler and a baby,\" she said. \"And okay, we won't be sleeping, so it's gonna be a lot of work.\"   But, now that she's had one baby, she said, she's inclined to have another.   NPR's Brian Mann contributed to this story. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Finland's stubbornly low birth rate shows why a population shift may be inevitable",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5712x3213+0+298/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F47%2Fa1%2F983a83eb4a319c44bb7a92e46c7f%2Fimg-3507.jpg"
      ],
      "datePublished": "2025-10-27T14:00:00.000Z",
      "dateModified": "2025-10-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]