[
  {
    "title": "House set to vote on bill to end the longest shutdown as Democrats remain divided",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605559/house-set-to-vote-on-bill-to-end-the-longest-shutdown-as-democrats-remain-divided",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:28.000Z",
    "description": "\n      \n      House set to vote on bill to end the longest shutdown as Democrats remain divided\n    \n        \n                Download\n               ",
    "body": "\n      \n      House set to vote on bill to end the longest shutdown as Democrats remain divided\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5605559/nx-s1-9530122\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      The House may vote as early as Wednesday afternoon on a measure that will end the longest government shutdown in U.S. history, but Democrats remain deeply divided about whether to support it.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House set to vote on bill to end the longest shutdown as Democrats remain divided",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:28.000Z",
      "dateModified": "2025-11-12T11:59:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Immigrants with obesity, diabetes and other health problems may be denied visas",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606348/immigrants-visas-health-conditions-trump-guidance",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1013x570+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2F3a%2F51f05f2d450dbc2ebfd9e24d31cd%2Fgettyimages-1224917096.jpg",
    "tag": "Politics",
    "date": "2025-11-12T14:46:54.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Trump administration is directing im",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The Trump administration is directing immigration officers to consider some chronic health conditions like diabetes in deciding whether to issue visas to immigrants.\n                \n                    CHRIS DELMAS/AFP/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        CHRIS DELMAS/AFP/Getty Images\n    \n\n   \n   Foreigners seeking visas to live in the U.S. might be rejected if they have certain medical conditions, including diabetes or obesity, under a directive issued last week by the Trump administration.   The guidance, issued in a cable the State Department sent to embassy and consular officials and examined by KFF Health News, directs visa officers to deem applicants ineligible to enter the U.S. for several new reasons, including age or the likelihood they might rely on public benefits.   The guidance says that such people could become a \"public charge\" — a potential drain on U.S. resources — because of their health issues or age.   \n   While assessing the health of potential immigrants has been part of the visa application process for years, including screening for communicable diseases such as tuberculosis and obtaining vaccine history, experts said the new guidelines greatly expand the list of medical conditions to be considered and give visa officers more power to make decisions about immigration based on an applicant's health status.   The directive is part of the Trump administration's divisive and aggressive campaign to deport immigrants living without authorization in the U.S. and dissuade others from immigrating into the country. The White House's crusade to push out immigrants has included daily mass arrests, bans on refugees from certain countries, and plans to severely restrict the total number permitted into the U.S.   The new guidelines mandate that immigrants' health be a focus in the application process. The guidance applies to nearly all visa applicants but is likely to be used only in cases in which people seek to permanently reside in the U.S., said Charles Wheeler, a senior attorney for the Catholic Legal Immigration Network, a nonprofit legal aid group.   \"You must consider an applicant's health,\" the cable reads. \"Certain medical conditions – including, but not limited to, cardiovascular diseases, respiratory diseases, cancers, diabetes, metabolic diseases, neurological diseases, and mental health conditions – can require hundreds of thousands of dollars' worth of care.\"   \n   About 10% of the world's population has diabetes. Cardiovascular diseases are also common; they are the globe's leading killer.   The cable also encourages visa officers to consider other conditions, such as obesity, which it notes can cause asthma, sleep apnea, and high blood pressure, in their assessment of whether an immigrant could become a public charge and therefore should be denied entry into the U.S.   \"All of these can require expensive, long-term care,\" the cable reads. Spokespeople for the State Department did not immediately respond to a request for comment on the cable.   Visa officers were also directed to determine if applicants have the means to pay for medical treatment without help from the U.S. government.   \"Does the applicant have adequate financial resources to cover the costs of such care over his entire expected lifespan without seeking public cash assistance or long-term institutionalization at government expense?\" the cable reads.   The cable's language appears at odds with the Foreign Affairs Manual, the State Department's own handbook, which says that visa officers cannot reject an application based on \"what if\" scenarios, Wheeler said.   The guidance directs visa officers to develop \"their own thoughts about what could lead to some sort of medical emergency or sort of medical costs in the future,\" he said. \"That's troubling because they're not medically trained, they have no experience in this area, and they shouldn't be making projections based on their own personal knowledge or bias.\"   The guidance also directs visa officers to consider the health of family members, including children or older parents.   \"Do any of the dependents have disabilities, chronic medical conditions, or other special needs and require care such that the applicant cannot maintain employment?\" the cable asks.   Immigrants already undergo a medical exam by a physician who's been approved by a U.S. embassy.   \n   They are screened for communicable diseases, such as tuberculosis, and asked to fill out a form that asks them to disclose any history of drug or alcohol use, mental health conditions, or violence. They're also required to have a number of vaccinations to guard against infectious diseases like measles, polio, and hepatitis B.   But the new guidance goes further, emphasizing that chronic diseases should be considered, said Sophia Genovese, an immigration lawyer at Georgetown University. She also noted that the language of the directive encourages visa officers and the doctors who examine people seeking to immigrate to speculate on the cost of applicants' medical care and their ability to get employment in the U.S., considering their medical history.   \"Taking into consideration one's diabetic history or heart health history — that's quite expansive,\" Genovese said. \"There is a degree of this assessment already, just not quite as expansive as opining over, 'What if someone goes into diabetic shock?' If this change is going to happen immediately, that's obviously going to cause a myriad of issues when people are going into their consular interviews.\"   KFF Health News is a national newsroom that produces in-depth journalism about health issues and is one of the core operating programs at KFF.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Immigrants with obesity, diabetes and other health problems may be denied visas",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1013x570+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F55%2F3a%2F51f05f2d450dbc2ebfd9e24d31cd%2Fgettyimages-1224917096.jpg"
      ],
      "datePublished": "2025-11-12T14:46:54.000Z",
      "dateModified": "2025-11-12T14:46:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606050/rep-katherine-clark-d-mass-talks-about-upcoming-vote-to-reopen-the-government",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:12.000Z",
    "description": "\n      \n      Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government\n    \n        \n                Download\n               ",
    "body": "\n      \n      Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5606050/nx-s1-9530197\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep speaks with House Democratic Whip Katherine Clark of Massachusetts about the pending vote on a measure to end the government shutdown.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Katherine Clark, D-Mass., talks about upcoming vote to reopen the government",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:12.000Z",
      "dateModified": "2025-11-12T11:59:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This 26-year-old political strategist has a new vision for the Democratic Party",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5600588/this-26-year-old-political-strategist-has-a-new-vision-for-the-democratic-party",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T09:43:38.000Z",
    "description": "\n      \n      This 26-year-old political strategist has a new vision for the Democratic Party\n    \n        \n                Download\n                \n",
    "body": "\n      \n      This 26-year-old political strategist has a new vision for the Democratic Party\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5600588/nx-s1-9530166\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      Morris Katz is a 26-year-old political strategist who wants to take the Democratic party in a new direction. Leila Fadel talks to him about the candidates he's backing and his vision for the future.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This 26-year-old political strategist has a new vision for the Democratic Party",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T09:43:38.000Z",
      "dateModified": "2025-11-12T09:43:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Epstein emails appear to reveal more Trump ties",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605582/epstein-files-release-trump-email-grijalva-massie",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5751x3235+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F84%2F685306ef458596cafbdda271be02%2Fgettyimages-1178185854.jpg",
    "tag": "Politics",
    "date": "2025-11-12T13:30:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump's name appears in convic",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump's name appears in convicted sex offender Jeffrey Epstein's correspondence released Wednesday by Democrats on the House Oversight Committee.\n                \n                    Chip Somodevilla/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Chip Somodevilla/Getty Images\n    \n\n   \n   Democrats on the House Oversight Committee have released three new emails from the estate of convicted sex offender Jeffrey Epstein that mention President Trump, raising new questions about the extent of their relationship.    \n   In one 2015 email between Epstein and author Michael Wolff, the pair discuss a potential question from Trump's upcoming CNN interview about Trump and Epstein's personal ties.   \"I think you should let him hang himself,\" Wolff wrote. \"If he says he hasn't been on the plane or to the house, then that gives you a valuable PR and political currency. You can hang him in a way that potentially generates a positive benefit for you, or, if it really looks like he could win, you could save him, generating a debt.\"   \n   The correspondence shared Wednesday is part of 23,000 additional documents the committee is reviewing from the Epstein estate, Oversight Ranking Member Rep. Robert Garcia, D-Calif., said in a statement.   \"The more Donald Trump tries to cover-up the Epstein files, the more we uncover,\" Garcia wrote. \"These latest emails and correspondence raise glaring questions about what else the White House is hiding and the nature of the relationship between Epstein and the President.\"   \n   Another email Epstein sent in 2011 to Ghislane Maxwell, his associate who was also convicted on trafficking charges, called Trump the \"dog that hasn't barked\" and says Trump spent \"hours at my house\" with one of the alleged sex trafficking victims.   The last email shared is a 2019 message between Epstein and Wolff in which the disgraced financier wrote that \"of course [Trump] knew about the girls as he asked Ghislane to stop.\" The email does not elaborate any further.   NPR has not independently confirmed the veracity of the correspondence.    In September, House Democrats released more than 200 pages of a birthday book for Epstein created more than two decades ago that includes a lewd drawing and letter that appears to be signed by Trump.    The president has consistently denied any meaningful connection to Epstein, the veracity of the birthday book and paid little heed to his own supporters who have called for a full release of files kept on Epstein and his alleged crimes, before and after he died by suicide in 2019 while in federal custody.   \n   White House Press Secretary Karoline Leavitt sent a statement to NPR that said in part \"the Democrats selectively leaked emails to the liberal media to create a fake narrative to smear President Trump.\"   \"These stories are nothing more than bad-faith efforts to distract from President Trump's historic accomplishments, and any American with common sense sees right through this hoax and clear distraction from the government opening back up again,\" Leavitt wrote.   In July, he told reporters that he and Epstein fell out because Epstein hired away young female employees who worked at the spa at Mar-a-Lago.   The release timed with House votes   The latest Epstein files revelation comes as the House returns to session for votes that could reopen the federal government after the longest shutdown in U.S. history.    House Democrats and four Republicans have been pushing for a vote to release additional files related to the Epstein case since before the government shutdown began in October.    But House Speaker Mike Johnson was able to delay the vote by keeping the chamber out for seven weeks, and most recently by refusing to swear in Democratic Rep. Adelita Grijalva of Arizona. Grijalva is expected to be sworn in on Wednesday afternoon.   Critics on both sides of the aisle viewed Johnson's refusal as a means of avoiding the vote to direct the Department of Justice to release the Epstein documents.   On the campaign trail, Grijalva, who won a special election Sept. 23, promised to sign onto the bipartisan petition spearheaded by Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif., to force a House vote on the Epstein matter. Grijalva's signature marked the 218th one needed to force a vote on the matter.   The Epstein files continue to be a political thorn in the president's side, after Trump campaigned on releasing the documents as part of a broader message painting his candidacy as a way to expose powerful people hiding the truth.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Epstein emails appear to reveal more Trump ties",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5751x3235+0+300/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fb3%2F84%2F685306ef458596cafbdda271be02%2Fgettyimages-1178185854.jpg"
      ],
      "datePublished": "2025-11-12T13:30:00.000Z",
      "dateModified": "2025-11-12T13:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's how many strikes on alleged drug vessels the U.S. has announced",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5604895/trump-venezuela-drug-boat-strikes",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdb%2F9f%2Fd71084544e53b2797718e9c2068e%2Fgettyimages-2240137118.jpg",
    "tag": "Politics",
    "date": "2025-11-12T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump, Secretary of State Marc",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                President Trump, Secretary of State Marco Rubio (left) and Defense Secretary Pete Hegseth attend a Cabinet meeting at the White House on Oct. 9.\n                \n                    Anna Moneymaker/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images\n    \n\n   \n   For over three months, the U.S. military has repeatedly struck boats in the Caribbean Sea and Pacific Ocean, claiming that the vessels were intending to carry drugs into the United States. Since the first attack was announced on Sept. 2, these strikes have occurred nearly every week, killing dozens of people.   NPR compiled a list of these boat attacks using posts on Truth Social and X by President Trump and Defense Secretary Pete Hegseth. These posts show grainy video footage of vessels being blown up. The administration has not publicly released further evidence that the boats were actually carrying drugs and who was on board. Select lawmakers have been briefed about  the U.S. attacks, though some of them, including the Republican and Democratic leaders of the Senate Armed Services Committee, have requested additional information.   \n   The strikes are part of a larger Trump administration  strategy to target what officials call \"narco-terrorists.\" In a post on X on Nov. 4, Defense Secretary Pete Hegseth vowed to \"find and and terminate EVERY vessel with the intention of trafficking drugs to America to poison our citizens,\" adding that \"NO cartel terrorist stands a chance against the American military.\"   Of specific interest to Trump is targeting Tren de Aragua, a Venezuelan gang that his administration designated a foreign terrorist organization in January 2025. In dozens of speeches since taking office, Trump has accused Tren de Aragua of violent criminal activity within the United States' borders.   \"Such organizations torture, maim, mutilate and murder with impunity,\" Trump said in an address to the United Nations on Sept. 23. \"And for this reason, we've recently begun using the supreme power of the United States military to destroy Venezuelan terrorists and trafficking networks led by [Venezuelan President] Nicolás Maduro.\" The Venezuelan government denies the charges that it plays a role in drug trafficking.    \n   Legal scholars question whether the executive branch has the unilateral authority to launch these attacks in international waters without an authorization of force from Congress. The administration claims it does have the authority, and the president has said he doesn't need a congressional declaration of war.   There are also reports that these strikes have endangered and killed civilians. Colombian President Gustavo Petro accused the U.S. of murdering a Colombian fisherman with no ties to drug smuggling in a September strike. Relations between the United States and some Latin American countries had already begun to strain since Trump took office. This latest high-profile military operation in the region marks a significant further erosion.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's how many strikes on alleged drug vessels the U.S. has announced",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1024x576+0+54/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fdb%2F9f%2Fd71084544e53b2797718e9c2068e%2Fgettyimages-2240137118.jpg"
      ],
      "datePublished": "2025-11-12T10:00:00.000Z",
      "dateModified": "2025-11-12T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adelita Grijalva is set to be sworn in, teeing up a potential vote on Epstein files",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606350/adelita-grijalva-swearing-in",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4564x2567+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fa5%2F2beba5474085be37376fb913c8b3%2Fgettyimages-2244046562.jpg",
    "tag": "Politics",
    "date": "2025-11-12T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep.-elect Adelita Grijalva, D-Ariz., sp",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Rep.-elect Adelita Grijalva, D-Ariz., speaks during Arizona Gov. Katie Hobbs' \"Arizona First\" rally at El Rio Center on Nov. 1, 2025 in Tucson, Ariz.\n                \n                    Rebecca Noble/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Rebecca Noble/Getty Images\n    \n\n   \n   Fifty days after winning her seat in Congress, Rep.-elect Adelita Grijalva is poised to drop the \"elect\" from her title on Wednesday.   House Speaker Mike Johnson, R-La., is expected to administer the oath of office for the Arizona Democrat after the chamber returns to session this afternoon to take up a plan to reopen the government after a record shutdown.   Speaking with All Things Considered on Tuesday, Grijalva argued her support to release the Jeffrey Epstein files played a role in her wait to get seated.    \"I do believe that there is absolutely a connection,\" Grijalva said. \"That has resulted in denying representation to more than 800,000 Arizonans for the last seven weeks.\"    \n   On the campaign trail, Grijalva promised to sign onto a bipartisan petition to force a vote to release the Epstein files. Hers would be the decisive 218th signature on the petition to trigger that vote — an effort that's been led by Reps. Thomas Massie, R-Ky., and Ro Khanna, D-Calif.   The fight over the delay in swearing her in has galvanized Democrats, who have accused Johnson of stalling in order to put off the vote.   Johnson has rejected those accusations, recently saying he would allow a vote on the Epstein files.   He had previously said he would swear in the winner of the Arizona race as soon as they wanted, but later said he would not do so until after the government reopened. Johnson kept members away during the government shutdown. The chamber's last legislative session before Wednesday was Sept. 19.   \n   Grijalva won her seat on Sept. 23 in a special election to represent the state's 7th Congressional District — a border district that includes parts of Tucson.   During that time, Grijalva and other Democrats worked to meet with Johnson, marching to his office and in some cases, confronting him.    \"I have no staff ... The phones don't work. There's no computer,\" Grijalva told NPR last month. \"We don't have a government email.\"   Grijalva told All Things Considered she \"absolutely\" still planned to sign the Epstein discharge petition once she is sworn in, explaining she wants \"justice for the survivors and consequences for those who committed crimes against children and women.\"   \n   Speaking to reporters on Tuesday, House Minority Leader Hakeem Jeffries, D-N.Y., said the delays were \"unbelievable,\" but \"those days are over.\" The top Democrat on the House Rules Commitee, Jim McGovern of Massachusetts, said the petition could trigger the vote by early December \"if all goes the way we want it to go.\"    Before that, one of Grijalva's first votes is expected to be on whether to reopen the government. Grijalva said she would not support the bipartisan plan passed by the Senate on Monday, saying the concessions secured by Democrats \"weren't significant in making a difference for anybody who's fighting to keep their health care.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adelita Grijalva is set to be sworn in, teeing up a potential vote on Epstein files",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4564x2567+0+238/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc1%2Fa5%2F2beba5474085be37376fb913c8b3%2Fgettyimages-2244046562.jpg"
      ],
      "datePublished": "2025-11-12T10:00:00.000Z",
      "dateModified": "2025-11-12T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605565/rep-mike-lawler-r-n-y-talks-about-upcoming-house-vote-to-end-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T11:59:21.000Z",
    "description": "\n      \n      Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown\n    \n        \n                Download\n                \n  ",
    "body": "\n      \n      Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5605565/nx-s1-9530129\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      NPR's Steve Inskeep speaks with Republican Congressman Mike Lawler of New York about the imminent House vote on a deal to end the longest shutdown in U.S. history.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rep. Mike Lawler, R-N.Y., talks about upcoming House vote to end the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T11:59:21.000Z",
      "dateModified": "2025-11-12T11:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "On day 43 of the shutdown, a vote in the House could bring the impasse to an end",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5606078/government-shutdown-house-vote",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8040x4523+0+420/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd0%2Ffc3fd5c0446788c662e1b56ff7ac%2Fgettyimages-2246192322.jpg",
    "tag": "Politics",
    "date": "2025-11-12T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is shown on Tuesday, th",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                The U.S. Capitol is shown on Tuesday, the morning after the Senate passed legislation to reopen the federal government. The House could vote on the plan as early as Wednesday.\n                \n                    Win McNamee/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Win McNamee/Getty Images\n    \n\n   \n   The House of Representatives is expected to approve a funding bill on Wednesday that would bring an end to the longest government shutdown in U.S. history.   The measure, which extends funding levels for much of the government through Jan. 30, also includes a trio of appropriation bills that would fully fund some federal programs, including the Supplemental Nutrition Assistance Program (SNAP) through Sept. 30, 2026. Payments for SNAP, which provides food assistance to nearly 42 million people, have been locked in a court fight as a result of the shutdown.   The Senate approved the legislation late Monday, with seven Democrats and one Independent joining most Republicans. The bill includes a provision to reverse the layoffs the Trump administration imposed during the shutdown.   \n   Most Democrats on Capitol Hill angrily denounced the deal because it failed to address the central issue prompting the standoff — how to address health care subsidies that are expiring at the end of the year.   As part of the compromise, Senate Majority Leader John Thune, R-S.D., agreed to hold a vote by mid-December on legislation Democrats will craft to extend the Affordable Care Act tax credits. Some Republicans agree Congress needs to do something to head off steep premium increases for those relying on the subsidies, but it's unclear there are enough GOP votes to pass a bill through the chamber. Even if a deal comes together in the next few weeks, House Speaker Mike Johnson, R-La., has declined to guarantee a vote.    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                House Speaker Mike Johnson, R-La., attends a Veterans Day ceremony at Arlington National Cemetery on Tuesday.\n                \n                    Brendan Smialowski/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Brendan Smialowski/AFP via Getty Images\n    \n\n   \n   New Hampshire Democratic Sen. Jeanne Shaheen, a moderate who helped broker the deal with Thune, told reporters on Monday that the shutdown increased political pressure on the GOP to negotiate some solution on health care.   \"If the Republicans don't come to the table, if Donald Trump, who claims he can make a deal, is not willing to say to Speaker Johnson, 'you need to have a vote, you need to get something done,' then come next election, in the midterms, the American people are going to hold them accountable and we are going to continue to make this an issue.\"   \n   House Minority Leader Hakeem Jeffries, D-N.Y., panned the deal shortly before the Senate passed it, and urged House Democrats to vote no.    \"We're not going to support a partisan Republican spending bill that continues to gut the health care of the American people,\" Jeffries said.    \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                House Minority Leader Hakeem Jeffries,D-N.Y., speaks during a news conference Monday on Capitol Hill.\n                \n                    Tom Brenner/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Tom Brenner/Getty Images\n    \n\n   \n   Jeffries and other opponents of the deal argue the results of last week's elections, which featured big Democratic wins in gubernatorial contests and other local elections, sent a signal that voters backed the shutdown strategy, and wanted action on health care.   \n   Hill Republicans maintain that flight delays due to staffing shortages and disruption in government services over several weeks will harm Democrats who blocked bills to reopen the government. But President Trump suggested after GOP candidates were defeated last week that the shutdown harmed the party.   With the midterm elections a year away it's unclear just how far the longest shutdown on record will factor into voters' decisions, especially if concerns about the economy persist.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "On day 43 of the shutdown, a vote in the House could bring the impasse to an end",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8040x4523+0+420/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F68%2Fd0%2Ffc3fd5c0446788c662e1b56ff7ac%2Fgettyimages-2246192322.jpg"
      ],
      "datePublished": "2025-11-12T10:00:00.000Z",
      "dateModified": "2025-11-12T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats point fingers and share their dissent ahead of vote to end the shutdown",
    "url": "https://www.npr.org/2025/11/12/nx-s1-5605590/democrats-point-fingers-and-share-their-dissent-ahead-of-vote-to-end-the-shutdown",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg",
    "tag": "Politics",
    "date": "2025-11-12T09:42:44.000Z",
    "description": "\n      \n      Democrats point fingers and share their dissent ahead of vote to end the shutdown\n    \n        \n                Download\n               ",
    "body": "\n      \n      Democrats point fingers and share their dissent ahead of vote to end the shutdown\n    \n        \n                Download\n                \n                \n                    \n                        \n                            \n                            Embed\n                        \n                        \n                            <iframe src=\"https://www.npr.org/player/embed/nx-s1-5605590/nx-s1-9530172\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\">\n                        \n                    \n                \n        \n    \n\n\n\n      After a breakaway faction of Democratic senators supported a deal to end the government shutdown, some in the party expressed their discontent.   \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats point fingers and share their dissent ahead of vote to end the shutdown",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
      ],
      "datePublished": "2025-11-12T09:42:44.000Z",
      "dateModified": "2025-11-12T09:42:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]