[
  {
    "title": "House Oversight Committee member Rep. Wesley Bell discusses the Clintons' deposition",
    "url": "https://www.npr.org/2026/02/27/nx-s1-5727874/house-oversight-committee-member-rep-wesley-bell-discusses-the-clintons-deposition",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-27T11:39:14.000Z",
    "description": "\n      Democratic Rep. Wesley Bell of Missouri, a member of the House Oversight Committee, talks about the deposition of the Clintons in the Epstein p",
    "body": "\n      Democratic Rep. Wesley Bell of Missouri, a member of the House Oversight Committee, talks about the deposition of the Clintons in the Epstein probe, which continues Friday with the former president.   \n\n    MICHEL MARTIN, HOST:  Congressman Wesley Bell, a Democrat from Missouri, is a member of that House panel, the Oversight Committee, which is expected to hear from former President Bill Clinton today. We actually reached him at a diner in New York in advance of the hearing. Good morning, Congressman. Thanks for joining us.WESLEY BELL: Hey. Good to be here, and I got my coffee at the diner so (laughter)...MARTIN: Excellent. Good to hear. So former first lady, the former Secretary of State Hillary Clinton repeatedly said she never met Jeffrey Epstein, but the former president obviously had. There are photographs of them together. The president's spokesperson acknowledges that Mr. Clinton took four international trips on Epstein's plane for the Clinton Foundation's charity works. He had a meeting with Epstein in New York, et cetera. So what do you think you might learn from him today?BELL: You know, I've - he released his declaration, and so I anticipate it will be similar to that, obviously, more detail. But, you know, what I've said is - and I've led these type of depositions before as a former prosecutor, what we're seeing is political theater. This is not a serious investigation by Republicans, and it's disappointing because there are real victims. There are real survivors who deserve justice and deserve us to do a full and transparent investigation, and that's just not what we're seeing.MARTIN: Is it possible that this sets a precedent that might allow for President Trump to be deposed regarding Mr. Epstein?BELL: I mean, the precedent has been set at this point. You know, if Republicans feel that it's necessary to depose the former president, which I'm not opposed to hearing information - any information that leads us or gets us closer to uncovering the truth. But then that also includes the current president, that includes the current first lady, that includes Howard Lutnick. It includes Elon Musk and a slew of others. I don't care what the letter is in front of your name, if there is information that will help an investigation so that we can bring justice to the survivors and victims, then that's what we need to do.MARTIN: It - just one more question on this question of sort of political theater. The fact is the FEC filings do show that Bill and Hillary Clinton both benefited from Epstein's political donations. Now, that was back in the 1990s. There are visitor logs that show that Epstein made 17 trips to the White House. That was in the Clinton administration, and the Clinton Foundation did receive a significant donation from Epstein's nonprofit. Now, that was 2006. Now, that was before he was convicted - that Mr. Epstein was convicted in connection with these sex trafficking charges, but it does indicate a relationship there. Is that not worthy of some discussion or investigation?BELL: Again, I am - been on the record publicly and privately. Anyone who has information, we want to hear from, and that includes the Clintons. So I don't have any issue with hearing them and deposing them. But what I'm seeing from this administration, from House Republicans, is that they want all the information from Democrats to smear Democrats, but they stop at Republicans. And then when I hear the talking points from Republicans that Donald Trump was exonerated when we have living survivors who are saying the opposite and publicly saying that, and we know that there are at least 50 pages of missing Epstein files that include Donald Trump, so they need to release all the files. They need to do a serious investigation because at the end of the day, Americans want to know, and victims and survivors deserve to know.MARTIN: So a couple of more questions about the - just the hearings themselves. Hillary Clinton said she wanted her testimony and Mr. Clinton's to be public. Can you offer any insight into why this was denied?BELL: It was denied because Republican - House Republicans denied it. They don't want to be transparent. They want to say that they're being transparent. They want to use it as a talking point, but the proof isn't right here in the pudding. Democrats have asked for these depositions to be public. The Clintons asked for these depositions to be public. The media was a hundred yards away outside. We could've easily just opened the door and let them in, but Republicans refused and then released pictures, released leaked comments and statements. It's ridiculous. It's not serious, and Republicans need to take this seriously because victims and survivors deserve it.MARTIN: Before we let you go, just very briefly, you mentioned that a right-wing influencer posted a photo online of Hillary Clinton, apparently taken by your Republican colleague Lauren Boebert during the closed deposition. That's a violation of House rules. Is there going to be a consequence for this?BELL: I think there should be. You know, I think there should be. I think that the rules were made by the Republicans. They decided to make these depositions closed, and then they violated the - their own rules.MARTIN: That is Democratic Congressman Wesley Bell of Missouri. He's a member of the House Oversight Committee. Congressman, thank you.BELL: My pleasure.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House Oversight Committee member Rep. Wesley Bell discusses the Clintons' deposition",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-27T11:39:14.000Z",
      "dateModified": "2026-02-27T11:39:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Political consultant talks about the depositions of the Clintons in Epstein probe",
    "url": "https://www.npr.org/2026/02/27/nx-s1-5727655/political-consultant-talks-about-the-depositions-of-the-clintons-in-epstein-probe",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-27T09:43:59.000Z",
    "description": "\n      NPR's Michel Martin speaks with political consultant and longtime Clinton ally Paul Begala  about the depositions of former President Bill Clin",
    "body": "\n      NPR's Michel Martin speaks with political consultant and longtime Clinton ally Paul Begala  about the depositions of former President Bill Clinton and former Secretary of State Hillary Clinton.   \n\n    MICHEL MARTIN, HOST:  We wanted to get another perspective on the Clintons' deposition, so we've called Paul Begala. He's a longtime political strategist who helped orchestrate Bill Clinton's presidential win in 1992 and worked in the Clinton White House as counselor to the president. Good morning, Paul Begala. Thanks so much for joining us.PAUL BEGALA: Thanks, Michel.MARTIN: So what do you make of what happened yesterday?BEGALA: (Laughter) I can't wait for the tape. I'm laughing because I don't know if you've ever argued with Hillary Clinton, but I have. It doesn't go well. She's brilliant. She's focused. And - but she was pretty annoyed, I'm quite sure. So I can't wait to see it. I mean, it's an unpleasant thing. I'm sorry my friend had to go through it. But I have very little doubt that they finished that hearing with tire tracks across their faces because I think she just ran right over them.MARTIN: Well, some senior Democrats like Nancy Pelosi said everybody associated with Epstein should be deposed regardless of party. So - and on that basis, do you think it was fair that they were called?BEGALA: Well, it just dragged them in. They weren't associated, especially Hillary. But they're not associated. They didn't have anything useful to report. If this were an on-the-level investigation, absolutely. But when Leslie Wexner - the millionaire who was much more closely tied to Mr. Epstein - he was deposed, no Republicans showed up, and he probably had useful information. So it's not on the level. They're just dragging the Clintons in 'cause they're famous Democrats.MARTIN: Well, I take your point. I mean, Hillary Clinton said yesterday she never met Epstein, but it is the case that former President Clinton was pictured with Epstein. He flew on his plane multiple times. He contributed to Epstein's 50th birthday book in 2003. And both the former president and the former secretary of state did benefit from Epstein's political donations back in the 1990s. Visitor logs obtained by the Daily Mail said that Epstein made 17 trips to the White House during the Clinton administration. So on that basis?BEGALA: Oh, they should - they can ask them about all that. I suspect those White House trips were, like, for donors to the Historical Association and things like that. But the - Bill Clinton is the only guy in this whole sordid disgusting affair who hasn't had to change his story. He's the only guy who hasn't lied. He said, I never went to Epstein's island. I never went to Epstein's ranch. I never knew about any of his crimes, and I cut off contact with him long before he died.By the way, Susie Wiles, President Trump's chief of staff, has said, yeah, Trump was wrong. Clinton never went to Epstein's Island, and she claimed that she'd seen all the files. So he's the only guy as more and more information has come out, has been proved to have been telling the truth from the beginning. And, believe me, if there was something more in those files that could damage Bill Clinton, I do trust the Trump Justice Department to put that out.MARTIN: So we just heard that Republican committee chair James Comer said that many of former Secretary of State Hillary Clinton's - former First Lady Hillary Clinton's answers were essentially, so ask Bill, ask the former president. Do you expect that he will give some substantive answers today that we might hear more about? And do you think that that testimony, his testimony, at some point will also be made public?BEGALA: Oh, I want it all made public, and I'm sure the president does - former president. I - of course, he's going to answer all their questions. But his - he - again, his story hasn't changed. He just doesn't have any useful information. He didn't really know the guy. He never went to his island. He never went to his ranch. He never knew anything about his crimes and cut off all contact with him.I think the real problem here strategically is that this means Donald Trump is going to have to testify, right? There used to be a precedent, the Trump precedent. The January 6 Committee subpoenaed Trump. He was a former president. He not only refused to obey the subpoena, he sued the committee. Because no - except for Gerald Ford once, no former president has ever testified to Congress. OK. That was the Trump rule. Well, now there's a Clinton rule. And Donald Trump's going to have to live by that Clinton rule. In 1,057 days, he will no longer be president. It'll be a Saturday. The sun will shine. The birds will chirp.MARTIN: OK.BEGALA: And former President Trump will be subpoenaed to tell what he knows about the Epstein crimes.MARTIN: Why do you think it - I mean, Congressman Robert Garcia, a Democrat, wants reporters admitted to hear it - to the room to hear former President Clinton's deposition? Why do you think the Republicans keep rejecting that?BEGALA: I don't know. I - this is the first group of clowns that didn't want an audience. I think that's why. I mean, Hillary said that they asked her about UFOs and about this horrible Pizzagate lie, conspiracy theory. I believe that it's because they probably don't conduct themselves with the kind of professionalism that we saw, say, in the January 6 committee, which all of their hearings, so far as I know, were public.MARTIN: So before we let you go, I'm sure you've heard an NPR investigation found that files related to President Trump - Epstein Files - are missing from the public record. How do you advise Democrats to proceed to have those files released?BEGALA: I think they just keep having to press. I would caution them not to jump to any conclusions at all 'cause they don't know what's in them either. But I think we have a right to see them. I think the American people and, God knows, those survivors have a right to see what's in those files. And I think that that's something that they're going to keep pressing. And again, I think the Democrats are going to win the midterms, and then they'll have real subpoena power.MARTIN: OK.BEGALA: And they'll get them.MARTIN: That is Paul Begala. He's a former adviser to President Bill Clinton. Mr. Begala, thank you.BEGALA: Thanks, Michel.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Political consultant talks about the depositions of the Clintons in Epstein probe",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-27T09:43:59.000Z",
      "dateModified": "2026-02-27T09:43:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats strategizing on how to take back the House in upcoming midterm elections",
    "url": "https://www.npr.org/2026/02/27/nx-s1-5727627/democrats-strategizing-on-how-to-take-back-the-house-in-upcoming-midterm-elections",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-27T09:43:24.000Z",
    "description": "\n      Democrats are meeting this week to discuss their strategy to regain control of the House in the upcoming midterm elections.   \n\n    MICHEL MART",
    "body": "\n      Democrats are meeting this week to discuss their strategy to regain control of the House in the upcoming midterm elections.   \n\n    MICHEL MARTIN, HOST:  Democrats are wrapping up a retreat today trying to figure out a strategy to take back control of the U.S. House. They're planning for this year's midterms as President Trump's poll numbers are falling across a range of issues. NPR congressional correspondent Claudia Grisales talked to Democrats at their retreat in Leesburg, Virginia, and she's with us now to tell us more about it. Good morning, Claudia.CLAUDIA GRISALES, BYLINE: Good morning, Michel.MARTIN: So you've covered quite a few of these retreats.GRISALES: Right.MARTIN: How would you describe the mood there, especially compared to last year, say, and the year before?GRISALES: Yeah. There was a very different mood. Democrats were very energized, and you could tell, in terms of their strategy, they had a more unified message and plan versus last year, where it felt like they were lost in a political wilderness.MARTIN: So how are they preparing for November?GRISALES: Well, they say they're going to reach voters by selling them an alternate agenda to the president's policies right now. Leaders said what their closing message would be this fall. House Democratic Whip Katherine Clark said this is what Americans will hear.(SOUNDBITE OF ARCHIVED RECORDING)KATHERINE CLARK: They deserve better. A better economy, better schools, better health care, a better and more affordable future.GRISALES: And in addition to affordability, they said another major part of their agenda is oversight of the Trump administration. They developed this plan by going to constituents, and these are the issues that rose to the top. And Democrats have said they learned hard lessons on how not to ignore voters. They learned that in the last election cycle and say they're determined not to repeat those mistakes again.MARTIN: Like what mistakes?GRISALES: Well, one member joked that some members have learned how to use a podcast and how to show up on a podcast. But essentially, they are committed, they said, to spend time both in person and online, getting to voters where they are.MARTIN: So let's talk about that affordability agenda. What exactly are House Democrats proposing?GRISALES: Well, a major focus is health care, and they want to address the rise in costs there from reversing cuts to Medicaid, Medicare and reinstating health care subsidies that expired last year for the Affordable Care Act. They're also aiming to end Trump's tariff programs. They say those have led to higher costs for everything from groceries to housing, and with that, they're crafting legislative proposals to address these issues this year.MARTIN: You also mentioned plans for more oversight of the Trump administrations. Can you say more about that?GRISALES: I talked to Maryland Congressman Jamie Raskin, who's the top Democrat on the House Judiciary Committee who could be the chair if Democrats take over the House. He says they want to tackle what they see as the weaponization of the government against U.S. citizens. That includes the deaths of Americans at the hands of federal immigration law enforcement agents in Minneapolis. So this would be comprehensive investigations that he and others argue have not happened. And after that, forcing the Justice Department to release the full tranche of the Jeffrey Epstein files. Congress has passed legislation requiring that, but Democrats say the administration has not complied.MARTIN: So all is not rosy, though, for the Democrats. There still are headwinds that they have to prepare for. So talk about that, if you would.GRISALES: Right. There's quite a few. To start, if Democrats are successful in any capacity, they're still heading into a divided government. So legislatively, they're going to face obstacles from President Trump and if Republicans keep control of the Senate. Democrats are also facing efforts by the Trump administration and Republicans that they say will make it harder to vote. This is an effort Democrats say they're preparing to fight in court. But they're still expressing a lot of confidence and that, along with the historical precedent of the opposition party performing well in the midterms, they're riding a new wave of enthusiasm. They point to special election races results, where they saw successful outcomes, for example, in New Jersey. But they still need to flesh out a lot of specifics on these plans, and with a caucus that has a lot of diverse opinions, that will be a tall order.MARTIN: That is NPR's Claudia Grisales. Claudia, thank you.GRISALES: Thank you.(SOUNDBITE OF QUANTIC'S \"TIME IS THE ENEMY\")\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats strategizing on how to take back the House in upcoming midterm elections",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-27T09:43:24.000Z",
      "dateModified": "2026-02-27T09:43:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's ballroom project can continue for now, court says",
    "url": "https://www.npr.org/2026/02/26/nx-s1-5727859/trumps-ballroom-project-can-continue-for-now-court-says",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8040x4520+0+316/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7f%2Fa6%2F58ea141843afb300d22dbe518044%2Fgettyimages-2262999590.jpg",
    "tag": "Politics",
    "date": "2026-02-26T21:51:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Cranes are seen on the grounds of the Wh",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Cranes are seen on the grounds of the White House as construction work continues for U.S. President Trump's new ballroom in Washington, D.C., on Wednesday.\n                \n                    Oliver Contreras/AFP/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Oliver Contreras/AFP/Getty Images\n    \n\n   \n   President Trump's White House ballroom project can proceed for now, after a court ruling Thursday. A US District Court judge denied a preservation group's effort to put a pause on construction, but left the door open to a revised filing.   Trump celebrated with a social media post, writing \"Great news for America, and our wonderful White House! The Judge on the case of what will be the most beautiful Ballroom anywhere in the World, has just thrown out, and completely erased, the effort to stop its construction.\"   That's not exactly what Judge Richard Leon's opinion said.   \n   The National Trust for Historic Preservation argued the president hadn't followed proper procedure in tearing down the East Wing of the White House and soliciting private donations to fund the $300-million ballroom. In his opinion Leon wrote that he wasn't making a determination on the merits because of the way the suit had been framed. He concluded, saying that if the group were to amend its complaint \"the Court will expeditiously consider it and, if viable, address the merits of the novel and weighty issues presented.\"   The group responded with disappointment, but said they would continue pushing to halt construction.   \"While we are disappointed that the Court did not issue the preliminary injunction, we were pleased that Judge Leon ruled that the National Trust has standing to bring this lawsuit, as we have asserted from the start,\" Carol Quillen, president and CEO of the National Trust, said in a statement. \"We are also pleased that he encouraged us to amend our complaint—specifically, to assert that the President has acted beyond his statutory authority—and we plan to do so promptly.\"   The planned ballroom is designed to seat 1,000 guests and has long been a dream project for Trump. It generated massive controversy and public pushback, but recently got approval from the Commission of Fine Arts, an architectural review panel now packed with Trump allies. The commission voted to give it a final signoff despite not seeing the final design. It had received more than 2,000 public comments, which according to staff were 99% negative.   \n   The White House is also seeking approval from the National Capital Planning Commission, which will review ballroom plans at its next meeting on March 5. It is also dominated by Trump appointees and not expected to give final approval until April.   \"The Ballroom construction, which is anticipated to also handle future Inaugurations and large State Visits, is ahead of schedule, and under budget,\" Trump said in his post. \"It will stand long into the future as a symbol to the Greatness of America!\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's ballroom project can continue for now, court says",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8040x4520+0+316/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F7f%2Fa6%2F58ea141843afb300d22dbe518044%2Fgettyimages-2262999590.jpg"
      ],
      "datePublished": "2026-02-26T21:51:21.000Z",
      "dateModified": "2026-02-26T21:51:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "HUD proposes time limits and work requirements for rental aid",
    "url": "https://www.npr.org/2026/02/27/nx-s1-5728988/hud-proposes-time-limits-work-requirements-for-rental-aid",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7801x4388+0+406/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F45%2Fe5%2F8a7ef90f472e9a401923dda11249%2Fap25194013151183.jpg",
    "tag": "Politics",
    "date": "2026-02-27T17:46:53.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Apartment buildings are seen at the Stod",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Apartment buildings are seen at the Stoddard Johnston Scholar House, Friday, July 11, 2025, in Louisville, Ky.\n                \n                    Jon Cherry/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Jon Cherry/AP\n    \n\n   \n   A proposed rule by the Department of Housing and Urban Development would allow strict time limits and work requirements as a condition for rental subsidies, a move that critics say could put millions of people at risk of losing such aid amid record-high housing costs and homelessness.   The decision to impose new restrictions would be up to local housing authorities and private property owners who rent to people using a housing voucher, known as Section 8. Time limits could be as short as two years, and work requirements up to 40 hours a week. Those who are elderly or disabled – a majority of people with federal rental subsidies – would be exempt.   \n   President Trump proposed a two-year limit in his White House budget last year, along with slashing rental aid by 40%, but Congress rejected that. This rule would bypass Congress, assuming it's finalized.   Housing Secretary Scott Turner has said repeatedly that he wants to help tenants get off federal aid and promote self-sufficiency. Last year, he and three other Cabinet members wrote a New York Times opinion piece calling on Congress to expand work requirements across safety net programs. They said an increasing share of public benefits are not going to the \"truly needy,\" but to able-bodied adults who don't work.   Some 9 million people in the U.S. get federal housing assistance, and the cost of rent is unaffordable for large numbers of Americans.    \n   \"This proposal is based on false and harmful stereotypes, rather than concrete data or best practices,\" Deborah Thrope, deputy director at the National Housing Law Project, said in a statement. \"It ignores the fact that most participants in federal housing programs who can work, do in fact work. Saving enough to move off of assistance takes a long time and a lot of support.\"   The case for time limits on housing subsidies   Rental assistance is not an entitlement, and demand far outstrips the funds available. For the lucky minority who do get a housing voucher or a spot in public housing, often after waiting for years, they can keep it as long as needed. Supporters say time limits could help spread limited rental aid among more people.   \n   \"There's a whole lot of people who qualify for this kind of aid who don't receive it. So there's an inefficient use of our housing, because people can stay so long,\" said Howard Husock, a senior fellow in domestic policy at the conservative-leaning American Enterprise Institute.   He said time limits could also encourage upward mobility, but should be not be imposed \"in a vacuum.\" To be effective, Husock said, a time limit should include a fixed rent and automatic savings accounts, so people can get ahead as their income rises.   Delaware State Housing Authority is one agency that's had success with such a program. Its time limit is 5-7 years, but can stretch longer in some cases.   The track record for time limits is mixed   Nationwide there are about 3,300 local public agencies that provide federally subsidized housing. Only about 140 of them currently have the flexibility to try things like time limits and work requirements, and only a few dozen have done so.   \n   \"I just don't necessarily think that a hard term limit has generated the sort of outcomes that people are looking for,\" Joshua Meehan told NPR last year. He advocates for these agencies as president of the Moving to Work Collaborative.   The group includes Keene Housing in New Hampshire, which Meehan now leads. It used to have a 5-year time limit but dropped it. As the deadline to end people's assistance approached it was clear their incomes had not increased by much.   \"I think it's fair to assume they would have wound up back on our waiting lists,\" he said.   Given that track record, it's not clear whether a significant number of housing authorities would choose to adopt the new restrictions. Forcing millions of people to give up their subsidy every few years could also rattle the private landlords who lease to those with a housing voucher.   \n   The proposed rule is scheduled to be published Monday, and will be open 60-days for public comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "HUD proposes time limits and work requirements for rental aid",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/7801x4388+0+406/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F45%2Fe5%2F8a7ef90f472e9a401923dda11249%2Fap25194013151183.jpg"
      ],
      "datePublished": "2026-02-27T17:46:53.000Z",
      "dateModified": "2026-02-27T17:46:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hillary Clinton calls House Oversight questioning 'repetitive' in 6 hour deposition",
    "url": "https://www.npr.org/2026/02/26/nx-s1-5727777/hillary-clinton-deposition-house-oversight-epstein",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3936x2214+0+209/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Fe1%2F385637eb4f3591d7ecd72ab36f8a%2Fap26057845384069.jpg",
    "tag": "Politics",
    "date": "2026-02-27T01:39:58.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former Secretary of State Hillary Clinto",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Former Secretary of State Hillary Clinton speaks outside the Chappaqua Performing Arts Center, after testifying before House lawmakers as part of a congressional investigation into convicted sex offender Jeffrey Epstein Thursday in Chappaqua, N.Y.\n                \n                    Yuki Iwamura/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Yuki Iwamura/AP\n    \n\n   \n   Former Secretary of State Hillary Clinton spent more than six hours in a closed-door deposition Thursday, facing questions from the House Oversight Committee. The Republican-led committee subpoenaed Clinton, and her husband, former President Bill Clinton, to appear in its investigation into convicted sex offender and disgraced financier Jeffrey Epstein.    The former president will take questions Friday from the committee.   In a short press conference following the deposition, Hillary Clinton said she wished the proceedings had been public and that she and her attorneys have asked for transcripts and videos to be available as soon as possible.   \n   \"It was disappointing that they refused to hold a public hearing so I wouldn't have to be out here characterizing it for you,\" she told reporters outside the Chappaqua Performing Arts Center in New York where the hearing took place. \"You could have seen it for yourself. We had asked for that. We think it would have been better for the committee and its efforts to gather whatever information they are seeking.\"    Lamenting what she called \"repetitive\" questioning, Clinton said she would not appear before the committee again, even if the deposition were public.    \"I don't know how many times I had to say I did not know Jeffrey Epstein. I never went to his island, I never went to his home, I never went to his offices,\" she said. The former president, her husband Bill, did have a friendship with Epstein and photographs of him appear in the Epstein files. Bill Clinton has not be accused of wrongdoing.    Clinton said by the end of the hearing, Republicans were asking her off-topic questions about UFOs and the pizzagate conspiracy theory that falsely claimed some high-profile Democrats were involved in a child sex-trafficiking ring.    In a preview of what lawmakers may hear from former President Bill Clinton Friday, Hillary Clinton said she was confident that Bill Clinton knew nothing about Epstein's criminal history and that her husband's relationship with Epstein ended \"several years before anything about Epstein's criminal history came to light.\"    \n   She added Epstein was given a sweetheart deal when he was initially charged and convicted in 2008 of soliciting sex from underage girls in Florida.    \"I think it is fair to say that the vast majority of people who had contact with him before his criminal pleas in '08, they did not know what he was doing,\" Clinton said, \"and I think that that is exactly what my husband will testify to tomorrow.\"    Committee Chair, Kentucky Republican Rep. James Comer, said he hopes to have the video publicly available within the next 24 hours. The transcript, Comer said, will be published once Clinton's attorneys approve it, which are the standard rules of a deposition.    Despite a brief interruption shortly after the proceedings started, when Clinton halted the deposition after a photo from inside the room was posted by a conservative influencer on X, the questioning ultimately continued with lawmakers on both sides of the aisle.    Speaking after the deposition, Comer and his fellow Republicans said it was  productive and that Clinton answered most of their questions but that it \"was a shame\" that it took months to get the Clintons to agree to testify.    \"I think we learned a lot. There were a lot of questions that we asked that we, you know, weren't satisfied with the answers that we got, but we will continue to move forward,\" Comer said.    Comer said there were a number of times Clinton responded with \"I don't know, you'll have to ask my husband.\" And that is exactly what he plans to do on Friday.   \"We have a lot of questions for her husband tomorrow, and I'm confident that deposition will last even longer than this one,\" Comer said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hillary Clinton calls House Oversight questioning 'repetitive' in 6 hour deposition",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3936x2214+0+209/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F3a%2Fe1%2F385637eb4f3591d7ecd72ab36f8a%2Fap26057845384069.jpg"
      ],
      "datePublished": "2026-02-27T01:39:58.000Z",
      "dateModified": "2026-02-27T01:39:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sen. Tim Kaine on why he's pursuing a war powers resolution — again",
    "url": "https://www.npr.org/2026/02/26/nx-s1-5726769/sen-tim-kaine-on-why-hes-pursuing-a-war-powers-resolution-again",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-26T21:17:32.000Z",
    "description": "\n      NPR's Ailsa Chang speaks with Sen. Tim Kaine, Democrat of Virginia, about his continued efforts to limit President Trump's ability to use milit",
    "body": "\n      NPR's Ailsa Chang speaks with Sen. Tim Kaine, Democrat of Virginia, about his continued efforts to limit President Trump's ability to use military force through war powers resolutions.   \n\n    AILSA CHANG, BYLINE: It's in Article 1, Section 8, Clause 11 where the U.S. Constitution empowers Congress, not the president, to declare war. Of course, anyone versed in recent U.S. history will know that U.S. presidents have authorized plenty of military action without Congress signing off first. One timely example - last year, the U.S. struck three nuclear sites in Iran, joining Israel in its fight against the country. And right now, the U.S. has massively built up military forces in the Middle East. This week, the U.S. is also conducting diplomatic talks with Iran, which could end in a nuclear deal or could end with more violence.In the Senate, Democrat Tim Kaine of Virginia and Republican Rand Paul of Kentucky have filed a war powers resolution to prevent the president from attacking Iran without congressional approval. Senator Kaine joins us now. Welcome back to ALL THINGS CONSIDERED.TIM KAINE: Ailsa, great to be with you. Thanks.CHANG: Great to have you. So when do you expect to vote on this resolution?KAINE: Ailsa, it will happen early next week. Even as I sit here talking to you, it's being negotiated, but it will be in the first couple of days of next week when we're back in session Monday.CHANG: OK, but I have to ask because previous votes on war powers resolutions - like over Venezuela, over last year's strikes on Iran - they have failed. Almost all Republicans have voted against them. So why does this moment feel any different to you?KAINE: Well, first, whether they succeed or fail, we shouldn't be at war without a vote, and so members of Congress should be held accountable. Secondly, we learn, and particularly in the Venezuela vote. In the Senate, we actually got enough votes - Democrat plus some Republicans initially - and then a few Republicans got convinced to change their minds in some subsequent votes. But it changed the president's behavior. After the first vote, within a few hours he canceled a second strike on Venezuela. And he also agreed finally to have a public hearing to send Secretary Rubio up to discuss what, in fact, was the mission, what were the goals, what would success look like.And so I very much learned from that effort, even though we ultimately were not successful, that forcing a vote and a debate on these matters brings it more to the public's attention, where the public can decide whether a mission's in the national interest. And it can even change the behavior of the administration.CHANG: But I want to share a statement from a fellow Democrat. This is Congressman Josh Gottheimer of New Jersey, who's opposed to an equivalent war powers resolution in the House. And he writes, quote, \"this resolution would restrict the flexibility needed to respond to real and evolving threats and risks, signaling weakness at a dangerous moment.\" What do you say to your colleague there about that?KAINE: I'm on the Armed Services Committee and the Foreign Relations Committee, and I'm in the classified facility all the time hearing about risks, and I hear nothing whatsoever about any risks right now that Iran poses to the United States that are at a sufficient level that we should allow a president to take our sons and daughters into war without a debate by Congress.CHANG: Well, during the State of the Union address, President Trump said that Iran is developing missiles that may soon be able to reach the U.S. and that Iran is restarting its nuclear program. How much has the Trump administration shared evidence of those claims with lawmakers like you?KAINE: Well, let's take both. So how about the nuclear program? First, we had controlled Iran's nuclear program by a diplomatic deal that we entered into with our allies, with adversaries like China and Russia and Iran. President Trump tore up the deal. President Trump, after a 12-day bombing campaign by Israel over the summer, used U.S. assets to bomb Iranian nuclear sites and claimed that the Iranian nuclear program was obliterated. That was just six months ago. So now all of a sudden, their nuclear program poses such a threat that we can't even have a debate and vote in Congress? It makes no sense.With respect to the missiles, they are developing missiles, which they may use at some time against the United States. There's so many hypotheticals in there, and the overmatch we have is such that Iran knows this. If they were to use a missile against the United States, which they haven't, it would be a catastrophe for them.CHANG: OK, but given what you know now about the situation in Iran and whatever threat they do or might pose to the U.S. militarily, what would you want to see the U.S. military do at this point? Is there anything justifiable in your mind right now?KAINE: I would say, provide defense support to nations in the region. But we shouldn't commit our own children to yet another war in the Middle East when 25 years of war in the Middle East has produced so little for this country and so little for the region.CHANG: OK. As we mentioned, there is a U.S. delegation in Geneva right now...KAINE: Yes.CHANG: ...In talks with Iran. What about concerns that this debate in Congress about limiting presidential power - what about concerns that that might reduce the U.S.'s leverage in those diplomatic talks? Could they?KAINE: Well, you know, a war is a good idea or a bad idea, and if it's a bad idea, I don't think you should bluff it to try to, you know, get the upper hand in a negotiation. It's a bad idea, in this case, in my view. That - but the fact of the discussions even today is one of the reasons why even though my resolution was ripe for voting this week, we decided a few days out in the future, likely next week, would be preferable. Let that negotiation proceed.CHANG: Yeah.KAINE: Let's do all we can to do what we did 10 years ago and find a diplomatic deal to avoid the need for war.CHANG: You oppose the Trump administration's claiming of powers that you believe belong to Congress constitutionally. You also oppose war - war with Iran and the repression by the regime in Iran. So then, what is your larger preferred path forward here when it comes to the regime there?KAINE: Well, look, I do think the tools that we have, the sanctions tools and others, have made a huge impact on the regime. And it's put the regime in a place, as was the case in 2016. The regime came to the table and negotiated the nuclear deal not because of the threat of war. What was real was the sanctions' effect on the Iranian economy. That brought them to the table. We reached that deal. But then we also maintain the ability to use sanctions against Iran for nonnuclear activity - missiles, you know, crackdowns on human rights.CHANG: Right.KAINE: So I think we should try to return to that. Let's get a deal on the nuclear program and then use these other tools that we have to try to deal with nonnuclear activities that are causing instability in the region.CHANG: Democratic Senator Tim Kaine of Virginia, thank you very much for joining us, and happy birthday.KAINE: Hey, thanks so much. Take care.\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sen. Tim Kaine on why he's pursuing a war powers resolution — again",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-26T21:17:32.000Z",
      "dateModified": "2026-02-26T21:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crowded Democratic field could give GOP an opening in California governor's race",
    "url": "https://www.npr.org/2026/02/26/nx-s1-5720925-e1/crowded-democratic-field-could-give-gop-an-opening-in-california-governors-race",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "tag": "Politics",
    "date": "2026-02-26T22:01:29.000Z",
    "description": "\n      In California, the two candidates with the most votes in the primary advance to the general election, regardless of party. That's an issue for ",
    "body": "\n      In California, the two candidates with the most votes in the primary advance to the general election, regardless of party. That's an issue for Democrats who have nine major candidates for governor.   \n\n    JUANA SUMMERS, HOST:  California Governor Gavin Newsom knows he's widely considered a potential presidential candidate in 2028 because Newsom is term-limited. Something like a small army of Democrats is hoping to succeed him, but the party is worried that the state's unique primary system is leading to something unthinkable - a general election between two Republicans in the nation's largest blue state. Guy Marzorati from member station KQED has this report.GUY MARZORATI, BYLINE: Democratic activists bustled around San Francisco's massive Moscone Center convention hall last week, campaign workers setting up booths and hanging banners for the California Democratic Party Convention. The three-day event was a premiere showcase for the Democrats vying to be the state's next governor.RYAN PARVIZSHAHI: Right now, we have a pretty crowded field with Democrats running to replace Gavin Newsom.MARZORATI: Ryan Parvizshahi, a California political consultant, ran through some of the top names.PARVIZSHAHI: Eric Swalwell. He's a congressman out here in the Bay Area.MARZORATI: There's Tom Steyer, a billionaire philanthropist.PARVIZSHAHI: Matt Mahan, who's the mayor of San Jose.MARZORATI: Xavier Becerra, the former attorney general. Antonio Villaraigosa, the former mayor of LA.PARVIZSHAHI: And Katie Porter, former congresswoman.MARZORATI: And that's just on the Democratic side. There's also two leading Republicans - commentator Steve Hilton and Chad Bianco, the sheriff of Riverside County. In California, Democrats and Republicans appear on the ballot together in the primary. The two candidates who receive the most votes move on to the general election. A poll this week from a think tank, the Public Policy Institute of California, found three Democrats - Porter, Swalwell and Steyer - in a virtual tie with Republicans Hilton and Bianco.MARK BALDASSARE: No telling, at this point, who the top two candidates are going to be...MARZORATI: That's Mark Baldassare, the survey's director.BALDASSARE: ...And whether they're going to be Democrats or Republicans that are going to be running for governor in November.MARZORATI: The fractured vote means that, yes, two Republicans could advance to the general election in California.NANCY TUNG: You know, it's not a negligible concern.MARZORATI: Nancy Tung is the chair of the San Francisco Democratic Party.TUNG: Because, you know, the Republican vote is going to be split two ways versus the Democratic vote that could be split - I mean, we have nine major candidates. It could be split into pieces.MARZORATI: The idea of electing a Republican governor, which California hasn't done in 20 years, is starting to worry Tung.TUNG: If we don't have somebody in the top two, then that seems like a future that I don't want to acknowledge.MARZORATI: But other Democrats are less concerned. State party Chair Rusty Hicks says candidates can take clear steps to stand out.RUSTY HICKS: Those who are able to raise the resources to communicate a message, those who land significant endorsements and supporters.MARZORATI: By the time voting begins in May...HICKS: My guess is we're not going to have the same number of candidates truly competing for the support of California voters.MARZORATI: But candidates can't wait that long to get their names off the ballot. The deadline for that is next month. For NPR News, I'm Guy Marzorati in San Jose.(SOUNDBITE OF MINUTEMEN'S \"COHESION\")\n    Copyright © 2026 NPR.  All rights reserved.  Visit our website terms of use and permissions pages at www.npr.org for further information.\n    \n        Accuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.\n    \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crowded Democratic field could give GOP an opening in California governor's race",
      "image": [
        "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg"
      ],
      "datePublished": "2026-02-26T22:01:29.000Z",
      "dateModified": "2026-02-26T22:01:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SNL mocked her as a 'scary mom.' In the Senate, Katie Britt is an emerging dealmaker",
    "url": "https://www.npr.org/2026/02/27/nx-s1-5727795/katie-britt-senate-trump-immigration",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5351x3010+0+279/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F03%2Fd0%2Fca81bf774c699ba57f841555e00d%2Fgettyimages-2157615750.jpg",
    "tag": "Politics",
    "date": "2026-02-27T10:00:00.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Katie Britt, R-Ala., arrives for a ",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Katie Britt, R-Ala., arrives for a meeting on Capitol Hill on June 18, 2024. Britt has taken on a leading role helping negotiate changes to immigration enforcement.\n                \n                    Andrew Harnik/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Harnik/Getty Images\n    \n\n   \n   Stay up to date with our Politics newsletter, sent weekly.      Two years ago, Republican Sen. Katie Britt of Alabama accepted what is often called the worst assignment in politics — rebutting the president's State of the Union address.   The televised response, broadcast live from Britt's tidy kitchen in Montgomery, was the Alabama freshman's introduction to a national audience, and what many viewers saw was an over-the-top firebrand, parodied as a \"scary mom\" by actress Scarlett Johansson on Saturday Night Live.   \"The American dream has turned into a nightmare for so many families,\" Britt said in the speech.   \n   Standing in as her party's pick to rebut the president, ahead of his reelection bid no less, is a daunting task for any up-and-coming politician, but even some Republicans described Britt's performance with words like baffling and bizarre.   Colleagues say this initial caricature of Britt as a hyper-partisan MAGA mom is simply untrue. In the Senate, Britt has been building a different reputation — as a bipartisan dealmaker.   Now Britt is helping negotiate changes to how immigration agents operate after the deadly shootings of two U.S. citizens in Minneapolis as Democrats refuse to fund the Department of Homeland Security without reforms. The department has now been shut down for more than 10 days.   And at a time of deep polarization, this moment is testing how far Britt, and other lawmakers, are willing to go to tackle knotty policy problems captivating national attention.   A front row seat   Veteran Alabama political columnist Steve Flowers first met Britt when she was a teenager attending a prestigious girls leadership program. Flowers was so impressed, he called up his old friend, Alabama's long-serving Republican senator, Richard Shelby.   \"And I said, 'Shelby, I just met a young woman who's got U.S. Senator or governor written all over her.\"   \n   Britt went to work on Capitol Hill for Shelby, who for years was the top Republican on the powerful Senate Appropriations Committee, a group so bipartisan in nature that Hill veterans are known to joke about three categories of lawmakers — Republicans, Democrats and appropriators.   Shelby taught young aides that your word is your bond and making deals across the aisle hinges on trust, and often, genuine friendship. Shelby and his counterpart on the committee, former Sen. Patrick Leahy, D-Vt., were like brothers, Flowers said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Vice President Kamala Harris swears in Katie Britt for the 118th Congress on Jan. 3, 2023. At 40 years old, Britt became the youngest Republican woman elected to the Senate.\n                \n                    Olivier Douliery/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Olivier Douliery/AFP via Getty Images\n    \n\n   \n   \"Quite frankly, it's the ingredient that is necessary for any of that to come together,\" says Dayne Cutrell, a former Shelby staffer who overlapped with Britt. \"Not only does she see it because of who she is, but she had a front row seat to somebody that was able to do it for years to the benefit of the state.\"   Cutrell remembers when Britt eventually became Shelby's chief of staff, she made a point of meeting with all 99 other Senate chiefs. \"And not only did she do it, she did it in like two weeks,\" Cutrell said.   When Shelby retired after 2022, Britt, at 40 years old, became the youngest Republican woman elected to the Senate. In her Capitol Hill office, Britt displays a gold-framed handbill from Shelby's first campaign for the Alabama Senate in 1970. Her desk was once Shelby's – and before that, Lyndon B. Johnson's.   \"Now that she is a member, she is the same person that wants to know not just you as an individual, but your family and what makes you tick and why it's important,\" Cutrell said.   \"Anybody can go sit in a corner\"   That's in part why Britt was able to help bring Democratic Sen. Tim Kaine, D-Va., onto a deal to end the record-long government shutdown last fall, despite deep opposition from others in his party. The pair already had a relationship from drafting legislation on affordable child care.   \n   \"I was testing ideas with her, and when it looked like things might break down, [she would say] 'Hey come on let's keep talking.' We may disagree, but I'll get a read on where's the caucus, where's the White House likely to be on this, and that's helpful,\" Kaine said.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Britt speaks on the phone at the National Prayer Breakfast in the Kennedy Caucus Room on Capitol Hill on Feb. 05. Britt says her constituents sent her to Washington to find compromise. \"Anybody can go sit in a corner,\" she says.\n                \n                    Anna Moneymaker/Getty Images/Getty Images North America\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Anna Moneymaker/Getty Images/Getty Images North America\n    \n\n   \n   At a time when compromise seems to have little political upside, why wade in? Britt says that is what her constituents sent her to Washington to do.   \"Anybody can go sit in a corner,\" Britt said in an interview. \"Two-year-olds do it best, and we have a lot of people that are taking their ball and sitting in the corner. And I just think it's too critical of a moment in our country's history to do that.\"   A delicate balance    For many members, the latest inflection point in the country was the Trump administration's aggressive immigration crackdown in Minneapolis.   For Britt, it was the viral image of a five-year-old boy in a bunny hat and Spiderman backpack being detained by federal officers there that she could not shake — so much so that she raised questions about the incident with the administration.   There were reports that federal officers were using the boy to lure other potential targets for arrest. Britt's office scheduled a call with Homeland Security Secretary Kristi Noem, first reported by The New York Times. Britt said Noem assured her that was not true.   And Britt has refrained from mentioning the boy in her public remarks, instead focusing on criticizing Democrats for refusing to fund the Department of Homeland Security amid negotiations.   \"I'm over it,\" Britt told her colleagues recently on the floor. \"Everybody on that side of the aisle knows that ICE and CBP will continue to be funded. They're going to continue to enforce the law just as they should. Who's going to pay the price? It's the TSA agent, it's the person working at FEMA.\"   \n   That message has frustrated Democratic negotiators who were already irked when Britt called their demands a \"ridiculous Christmas list.\"   \"My wish is for my Republican colleagues to be just as upset as they are about what is going to happen at TSA or FEMA as for the children that are being traumatized right now,\" responded Sen. Chris Murphy, D-Conn., Britt's counterpart on the appropriations subcommittee on homeland security.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Sen. Chris Murphy, D-Conn., talks to Sen. Katie Britt, R-Ala., during a March 29, 2023 hearing on Capitol Hill.\n                \n                    Kevin Dietsch/Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Kevin Dietsch/Getty Images\n    \n\n   \n   Murphy and Britt worked together to negotiate the homeland security funding bill that was set to pass with bipartisan support before the deadly shootings in Minneapolis.   Senate Republicans have signaled that much of the back and forth so far has been directly between Democrats and the White House — and there have been few signs of progress in recent days.   Democrats and Republicans say Britt's appeal as an emerging mediator comes not only from trust she has built across the aisle, but also with her party's leadership in the Senate and the White House.   Maintaining all three is a delicate balance.   In 2025 Britt voted in line with President Trump 100% of the time on legislation he took a position on, according to Congressional Quarterly.   \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                Britt listens as President Trump speaks in the Oval Office on Oct.16, 2025. Britt has been a reliable vote for the president's agenda, but criticized a racist video posted on his social media.\n                \n                    Andrew Caballero-Reynolds/AFP via Getty Images\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Andrew Caballero-Reynolds/AFP via Getty Images\n    \n\n   \n   But she was one of a few Republicans to criticize a racist video posted on President Trump's social media, which depicted former President Barack Obama and former First Lady Michelle Obama as apes. Britt said the video \"should have never been posted to begin with, and is not who we are as a nation.\"   Trump saw the critical comment as disloyalty, according to CNN, a report Britt's office called \"fake news.\"   Ideologues and facilitators    Flowers, the Alabama columnist, sees two types of senators: idealogues: \"You may have one who will be a Fox News-chasing publicity hound who wants to be known as a right-wing fire eater,\" he said.   And facilitators, like Shelby. \"That's what Katie's role will be: bring home the bacon, get things done for Alabama, as well as voting conservative,\" Flowers said.   \n   Flowers says it is not as easy to be a facilitator as it was in Shelby's day. He said he hopes Britt won't be pulled away from her approach as she steps further onto the national stage.   \"I think it is harder now to do that, but maybe she can balance it,\" Flowers said. \"She doesn't owe Trump anything. She'll be there long after Trump's gone.\"\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SNL mocked her as a 'scary mom.' In the Senate, Katie Britt is an emerging dealmaker",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5351x3010+0+279/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F03%2Fd0%2Fca81bf774c699ba57f841555e00d%2Fgettyimages-2157615750.jpg"
      ],
      "datePublished": "2026-02-27T10:00:00.000Z",
      "dateModified": "2026-02-27T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These major issues have brought together Democrats and Republicans in states",
    "url": "https://www.npr.org/2026/02/26/nx-s1-5726431/data-centers-ai-trump-housing-states",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1913x1076+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fff%2Fb8%2F90e47f5e41a3a1f98bd4554fd531%2Fap26043795166336.jpg",
    "tag": "Politics",
    "date": "2026-02-26T19:22:21.000Z",
    "description": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A data center owned by Amazon Web Servic",
    "body": "\n      \n            \n        \n            \n            \n            \n        \n\n\n    \n        \n                A data center owned by Amazon Web Services, front right, is under construction next to the Susquehanna nuclear power plant in Berwick, Pa., Jan. 14, 2025.\n                \n                    Ted Shaffrey/AP\n                \n                hide caption\n            \n            toggle caption\n    \n    \n        Ted Shaffrey/AP\n    \n\n   \n   Unlike the deep partisan divides grinding Congress to a halt, Democrats and Republicans at the state level are coming together on some of the most significant issues of the 2026 legislative season.   Legislators in most states want to regulate artificial intelligence and curb the sprawling, electricity-hungry data centers that make AI possible in the first place.   Big tech has \"scrambled the typical ideological alignments of the left and the right,\" says David Primo, a professor of political science and business administration at the University of Rochester in New York. \"Conservatives and liberals are saying, 'Well, here's an opportunity for us to stop what we think is a problem.'\"   \n   And while the two parties remain far apart on many issues — like tax policy, Primo says — it's not just big tech that has Republicans and Democrats aligned.   Regulating artificial intelligence   Ron DeSantis of Florida and Kathy Hochul of New York, two governors on opposite sides of the political spectrum, sound a lot alike when it comes to reining in AI.   DeSantis, a Republican, is backing legislation in Florida called the Artificial Intelligence Bill of Rights. The proposal, working its way through the state Senate, makes it illegal to use a person's name, image or likeness without their consent, requires anyone under 18 to have parental permission to engage with companion chatbots and mandates that bots remind users they're not talking to humans.   \"I really fear that if this is not addressed in an intelligent and proper way, you know, it could set off an age of darkness and deceit,\" DeSantis said when proposing the bill package. Tech companies have to be regulated, he says, because they have prioritized profits over user safety.   New York already requires chatbots to identify themselves as non-humans. This year, Hochul is pushing to further limit them. She wants to ban chatbots within social media apps for kids under 18. Other proposals would limit the way bots can interact with young people.   \n   \"We're going to disable certain companion features. You've heard about these, right?\" she asked an audience gathered at her high school alma mater earlier this year.   \"Under our proposals, we're removing that burden from parents and placing the responsibility where it belongs — on the shoulders of the app companies and the platforms themselves.\"   Late last year, Trump issued an executive order trying to prevent states from regulating AI on their own. But Republicans and Democrats in states are pressing ahead anyway. Nearly every state has a proposal to regulate AI. They range from requiring humans to oversee AI decisions about employees to blocking AI surveillance that could be used to set different prices for consumers.   Data center pushback    As the public's appetite for AI grows, so does the need for more data centers to handle the massive computing demands. That's a concern in states because data centers require substantial amounts of electricity and water to operate.   In Florida, lawmakers are raising issues about effects on the power grid and water use, and the possibility of passing higher utility costs along to residents, which the Republican-led state Senate is working to address. DeSantis says he thinks many of the arguments in favor of data centers, such as the idea that they'll drive job creation or lower property tax rates, are largely overblown.   South Dakota wants to make sure the state can't overrule local governments when it comes to regulating data centers. Oklahoma is also considering bills to limit the impact of data center growth.   As with the AI debate, Trump and most states have found themselves on opposite sides of the data center fight, too. Trump has largely been supportive of their growth, but says tech companies have to pay their own way. In his State of the Union address on Tuesday, the president said, \"We're telling the major tech companies that they have the obligation to provide for their own power needs; they can build their own power plants as part of their factory.\" His administration wants to require tech companies building new centers to pay more for electricity to control price increases affecting consumers.   \n   Democratic lawmakers in New York and Maine are proposing a temporary ban on data centers, as are Republicans in Oklahoma.   The bill in New York is fairly new, but Hochul has announced the state's Public Service Commission will take a close look at the issue to ensure that data centers are \"paying their fair share.\"     In Colorado, a proposal would require data centers to use renewable energy for their operations. And many states, led by Republicans and Democrats alike, are considering expanding nuclear energy to help power AI.   Tech companies are opposing many of these proposals and putting money into political campaigns. They say it would be impossible to follow different laws in each state and that regulations could stifle innovation that could benefit the public.   Housing   Nationwide, the rising cost of housing is also a concern for both parties. In Florida, a bill to loosen restrictions on accessory dwelling units received full bipartisan support in the state Senate. DeSantis wants to address the affordable housing crisis by cutting property taxes. That isn't sitting well with Democrats in the state who say they worry about the impact on local governments. They say decreasing property insurance rates would be a better path.   Lawmakers in New York and other states are trying to streamline environmental regulations. Dozens of states are considering proposals to cut building regulations, strengthen tenants' rights and improve conditions in rental housing. In other words, when it comes to housing, lawmakers across the political spectrum are embracing ideas usually popular with one party or the other.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These major issues have brought together Democrats and Republicans in states",
      "image": [
        "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/1913x1076+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fff%2Fb8%2F90e47f5e41a3a1f98bd4554fd531%2Fap26043795166336.jpg"
      ],
      "datePublished": "2026-02-26T19:22:21.000Z",
      "dateModified": "2026-02-26T19:22:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]