[
  {
    "title": "Everything James Franklin said after Penn State stunned by UCLA: 'We did not handle last week's loss well' - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/everything-james-franklin-said-after-penn-state-stunned-by-ucla-we-did-not-handle-last-weeks-loss-well/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/c847f97a-8bed-4275-ada1-60eb65e2816f/thumbnail/1200x675/8b12264cbd83eb9cc2a3e00b7e6383a5/james-franklin.jpg",
    "tag": "Sports",
    "date": "2025-10-05T00:58:28.000Z",
    "description": "Penn State coach James Franklin had little sugarcoating for the No. 7 Nittany Lions' 42-37 loss to UCLA on Saturday at the Rose Bowl, a stunning defeat that snapped PSU's 34-game winning streak against...",
    "body": "<div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PSU/penn-state-nittany-lions/\">Penn State</a> coach James Franklin had little sugarcoating for <a href=\"https://www.cbssports.com/college-football/news/penn-state-ucla-game-score-live-updates/live/\" target=\"_blank\">the No. 7 Nittany Lions' 42-37 loss to UCLA</a> on Saturday at the Rose Bowl, a stunning defeat that snapped PSU's 34-game winning streak against unranked teams. The Bruins -- previously winless and playing with an interim coach and offensive coordinator -- pulled off the upset behind a five-touchdown performance from quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29123367/nico-iamaleava/\">Nico Iamaleava</a>, who threw for 166 yards and two touchdowns while rushing for 128 yards and three more scores.</p><p>The loss marked back-to-back setbacks for Penn State following a double-overtime defeat to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OREG/oregon-ducks/\">Oregon</a> last week in a top 10 showdown, and raised questions about the Nittany Lions' ability to respond under pressure and their path forward.</p><p>\"We've got to tune out all the outside noise,\" Franklin said postgame when asked about preventing his team from spiraling further. \"I thought our guys worked hard at doing that last week, but obviously not well enough. ... There's going to be a lot out there to divide, divide, divide, and we've got to tune all that out and stick together.\"</p><a href=\"https://www.cbssports.com/college-football/news/college-football-winners-losers-in-week-6-ucla-rises-from-the-ashes-preseason-no-1-texas-full-of-flaws/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>College football winners, losers in Week 6: UCLA rises from the ashes, preseason No. 1 Texas full of flaws</p>\n                <p>\n                    Shehan Jeyarajah                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"College football winners, losers in Week 6: UCLA rises from the ashes, preseason No. 1 Texas full of flaws\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/04/a4a16cb6-a573-4613-86d3-eeec30f960b2/thumbnail/270x152/6ac6b24ee2b3d68877c6260602af5025/ucla.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>The loss also marks the first time the Nittany Lions are 0-2 to start conference play since the shortened 2020 season.</p>\n<p>Below is everything Franklin said postgame Saturday:</p><h2>Opening statement:</h2><p>\"First of all, gotta give <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UCLA/ucla-bruins/\">UCLA</a> and their coaching staff a ton of credit. Gotta give their quarterback a ton of credit. We obviously had a hard time stopping him all day long, but I think the opening sequence of the game was significant -- with the touchdown and then the surprise onside (kick) that we talked about all week long, that they were going to take significant risks in this game. And that was obviously two really significant drives and plays in the game.</p><p>\"From that point on, we were battling. Obviously went in at halftime in a challenging situation, came out and then battled in the second half, but not enough to win the game. So give UCLA credit. Give their quarterback a ton of credit.</p><p>\"We made mistakes today that we normally don't make -- had a ton of missed assignments, turnovers at critical times, penalties at critical times, things that we really don't do and have not done for a very long time. So, give UCLA credit.\"</p>\n<h2>On why it was hard to contain Iamaleava:</h2><p>\"Yeah, he had 153 yards, and a lot of those yards came at critical points. A couple times we spied him, and when we spied him, he was able to either make the spy miss or run away from the spy. To your point, obviously we lost a significant player for us last week (linebacker <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29123940/tony-rojas/\">Tony Rojas</a>), who normally would have that responsibility. But at the end of the day, we spied and he ran away from the spy, we spied and he made the spy miss. And a couple other times they caught us in man coverage without a spy, and we got out of our rush lanes, and he made a ton of plays.\"</p>\n<h2>On why Penn State wasn't prepared, focused after Oregon loss:</h2><p>\"Obviously, we did not handle last week's loss well. We also lost some players in that game, and then everything else -- travel, everything else -- we did not come out with the right energy to start the game. And before you know it, obviously they get a touchdown drive and an onside kick, and now you're fighting. They gain confidence, and we're fighting for the next three quarters. So, that's my responsibility, and I didn't get it done.\"</p><h2>On if the defensive effort was up to Penn State's standard:</h2><p>\"Yeah, especially when you talk about the first half, third down was not very good. We could not get off the field. Again, they did a really good job of staying on schedule. In the second half, when we were able to get them off schedule a few times, that's when Nico really hurt us a few times. I didn't feel like watching the game it was an effort thing, but I did think we made a bunch of mistakes based on what I saw and what I heard on the headsets.\"</p>\n<h2>On the fourth-and-2 call in the red zone:</h2><p>\"Obviously, it's a QB power read where we had an opportunity to get the ball on the edge, divide the defense and get the quarterback downhill based on the read. And they brought edge pressure, and we knew it was coming. They beat the block, and we weren't able to get around it. They got penetration; the read gave us the give read, and they had two guys right at the point of attack for not only on the ball carrier, which would have been (Trebor) Pena, but also Drew (Allar).</p><p>\"So, give them credit for the aggressive cover-zero call. But we also have to make sure we're making the blocks at the point of attack.\"</p>\n<h2>On how he makes sure Penn State handles this loss better:</h2><p>\"We've got to tune out all the outside noise. I thought our guys worked hard at doing that last week, but obviously not well enough. So, we've got to stick together -- the coaches, the players in the locker room, offense, defense, special teams. The reality is we did not play well enough in all three phases to win the game.</p>\n<p>\"There's going to be a lot out there to divide, divide, divide, and we've got to tune all that out and stick together. I think we will do that. It's not going to be easy, but I think we will.\"</p><h2>On the mood in the locker room down 27-7 at half:</h2><p>\"Yeah, we've been in this situation before. So I thought the locker room was good. Obviously, there was some emotion and there was some energy, and there were some adjustments being made. We were in a similar situation last year at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/USC/usc-trojans/\">USC</a> -- that was part of the discussion.</p><p>\"I thought we came out and gave us a chance to win the game in the second half, but not enough, obviously, to win the game. And obviously, their quarterback was in a lot of ways the difference in the game, in multiple scenarios and multiple situations.\"</p>\n<h2>On if he still believes Penn State has the best combination of talent and coaches in the country:</h2><p>\"Yeah, obviously, that question at this moment -- how am I supposed to answer that? When we lose the last two games, then obviously, that's all that matters. We didn't win the last two games, but yeah, obviously I felt that way, or I wouldn't have said it. But after two losses, it's hard for me to answer that question and say that that's the case.\"</p>\n            </div>"
  },
  {
    "title": "UFC 320 odds, props, predictions, fight card: Ankalaev vs. Pereira expert picks - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-odds-props-top-predictions-fight-card-ankalaev-pereira-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/2ef2b7c3-acc5-409c-921c-4f9e7f092c5c/thumbnail/1200x675/c94ea9b668fa5e9f9b19216ade12bd30/alex-pereira-ufc-mma-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-04T23:46:44.000Z",
    "description": "For the second time this year, champion Magomed Ankalaev will face top-contender Alex Pereira for the UFC light heavyweight championship at UFC 320: Ankalaev vs. Pereira 2 on Saturday. Ankalaev earned the...",
    "body": "<div>\n        <p>For the second time this year, champion Magomed Ankalaev will face top-contender Alex Pereira for the UFC light heavyweight championship at UFC 320: Ankalaev vs. Pereira 2 on Saturday. Ankalaev earned the title with a unanimous decision over Pereira at UFC 313 this past March. The main UFC 320 fight card from T-Mobile Arena in Las Vegas is scheduled to begin at 10 p.m. ET. Ankalaev is on a three-bout winning streak after a no-contest with Johnny Walker in October 2023.</p><p>Ankalaev enters as the favorite at -238 (risk $238 to win $100), while Pereira is the underdog at +195 in the latest UFC 320: Ankalaev vs. Pereira odds at DraftKings Sportsbook. In the co-main event, Merab Dvalishvili is the -395 favorite against Cory Sandhagen (+310) in a bantamweight championship bout. Before locking in any UFC 320 picks, <a target=\"_blank\" href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\">make sure you see the MMA predictions and betting advice from SportsLine expert Daniel Vithlani</a>.</p><p><em>New users can also target the </em><span><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$200 in bonus bets instantly if your bet wins</em></a>:</p><p>Vithlani, who is also known as Danny Brasco, is a highly-analytical UFC bettor who has been a consistent winner for SportsLine members since making his debut in January 2023 with a 5-0 record for UFC 283. In fact, he's up over $1,500 on his UFC main-card <a href=\"https://www.cbssports.com/betting/\" target=\"_blank\">sports betting</a> picks.</p><p>His other highlights include calling an upset for Sean O'Malley (+210) against Aljamain Sterling (-250) at UFC 292 as part of a 4-1 main card and his UFC 299 winners included underdog selections on Dustin Poirier (+190) against Benoit Saint Denis (-230) and Michael Page (+110) against Kevin Holland (-130). Anyone who has followed him at <a href=\"https://www.cbssports.com/betting/sportsbooks/\" target=\"_blank\">sportsbooks</a> and on <a href=\"https://www.cbssports.com/betting/apps/\" target=\"_blank\">betting apps</a> could be way up.</p><p>Now, Vithlani has studied Magomed Ankalaev vs. Alex Pereira from every angle and revealed his top <a href=\"https://www.cbssports.com/betting/\" target=\"_blank\">betting</a> picks and best bets. <a href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\" target=\"_blank\">Head to SportsLine to see them</a>. </p><p><em>New users can also target the latest </em><span><a href=\"https://www.cbssports.com/betting/news/underdog/\" target=\"_blank\"><em>Underdog promo code</em></a></span><em>, good for </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=underdog&c=dfs\" target=\"_blank\"><em>$100 in site credits when you play $5 with the promo code CBSSPORTS2</em></a><em> </em>in select states.</p><h2>Ankalaev vs. Pereira preview </h2><p>Ankalaev, 33, has been dominant, winning 12 of his last 14 matches, with one draw and one no contest. His last defeat came on March 17, 2018, when he lost by submission to Paul Craig at UFC Fight Night: Werdum vs. Volkov. It was also his first bout after being signed by UFC. Ankaleav is 20-1 overall since turning pro in January 2014, when he earned a majority decision over Vasily Babich. </p><p>Ankalaev is the first Russian UFC light heavyweight champion. He is a four-time Performance of the Night winner, and is tied with Carlos Ulberg for the second longest win streak in UFC light heavyweight division history at nine. He also has the fifth longest unbeaten streak in UFC history at 14. He is a three-time World MMA Association champion. <a target=\"_blank\" href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\">Check out SportsLine to see his picks and analysis.</a></p><p>Pereira, 38, is the 10th in the UFC men's pound for pound rankings. He is a former UFC light heavyweight champion with three successful title defenses. He is also a one-time middleweight title holder, and is the first and only fighter to win both the UFC middleweight and light heavyweight championships. He is a five-time Performance of the Night winner, and one-time Fight of the Night performer. </p><p>Pereira began his professional career in October 2015, losing by submission to Quemuel Ottoni at Jungle Fight 82. He won his next three fights before joining UFC in November 2021. Pereira has compiled a 12-3 record with 10 wins by knockout and two by decision. He has also been a successful kickboxer, compiling a 33-7 record with 21 knockout wins. <a target=\"_blank\" href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\">You can only see his picks and analysis at SportsLine</a>. </p><h2>UFC 320: Ankalaev vs. Pereira predictions</h2><p>We'll reveal one of Brasco's UFC 320: Ankalaev vs. Pereira selections here: Punahale Soriano (-395) to defeat Nikolay Veretennikov (+310) in a welterweight matchup on the early preliminary card.</p><p>\"Soriano has elevated his game since joining Xtreme Cotoure MMA gym,\" Vithlani said. \"He is now on a two-fight win streak in which he controlled one opponent with his wrestling and put the other's lights out with his knockout power. Soriano throws heavy hooks and overhand shots, which help him close the distance to get to his wrestling attack. Veretennikov may be the more technical striker, but I think he will be taken down multiple times. In his last fight against a 21-year-old prospect, Veretennikov won a split decision that I do not feel he deserved. Against the veteran wrestler Austin Vanderford, Veretennikov had no answers with his defensive grappling and was totally dominated on the mat. Soriano can look to exploit him on the ground.\" </p><p>You can make this pick at FanDuel, where new users can also check out the latest <span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\">FanDuel promo code</a></span> and <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">get $300 in bonus bets instantly at FanDuel if your $5 bet wins</a>. </p><h2>UFC 320: Ankalaev vs. Pereira main fight card, odds</h2><p>Vithlani has strong picks for Ankalaev vs. Pereira and other bouts on the UFC 320: Ankalaev vs. Pereira card. He's also backing a fighter who \"has a deep bag of MMA tools\" to pull off a huge victory. <a target=\"_blank\" href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\">He's sharing who it is only at SportsLine</a>.</p><p><strong>Who wins UFC 320: Ankalaev vs. Pereira, and how exactly does the fight end? <a target=\"_blank\" href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\">Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks</a>, and find out.</strong></p><h2>UFC 320: Ankalaev vs. Pereira main fight card, odds </h2><p><a href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\" target=\"_blank\">See picks at SportsLine</a>.<br />(Odds subject to change)<br />Magomed Ankalaev (-238) vs. Alex Pereira (+195)<br /> Merab Dvalishvili (-395) vs. Cory Sandhagen (+310)<br /> Jiri Prochazka (-205) vs. Khalil Rountree (+170)<br /> Josh Emmett (+360) vs. Youseff Zalal (-470)<br /> Abus Magomedov (+195) vs. Joe Pyfer (-238)                  </p>\n            </div>"
  },
  {
    "title": "Nico Iamaleava delivers career-defining win as UCLA shocks No. 7 Penn State - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/nico-iamaleava-delivers-career-defining-win-as-ucla-shocks-no-7-penn-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/bda429a8-e2ab-4646-b97e-f6a83d54ad73/thumbnail/1200x675/b5300e12aed8217dc8f0d4d03a91a7fa/untitled-design-26.png",
    "tag": "Sports",
    "date": "2025-10-05T01:01:51.000Z",
    "description": "PASADENA, Calif. -- No Power Four college football program has undergone more change during the last six months than UCLA.The Bruins swapped quarterback Joey Aguilar for Nico Iamaleava with Tennessee in the...",
    "body": "<div>\n        <p>PASADENA, Calif. -- No Power Four <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">college football</a> program has undergone more change during the last six months than <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UCLA/ucla-bruins/\">UCLA</a>.</p><p>The Bruins swapped quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29123610/joey-aguilar/\">Joey Aguilar</a> for <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29123367/nico-iamaleava/\">Nico Iamaleava</a> with <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TENN/tennessee-volunteers/\">Tennessee</a> in the first \"unofficial trade\" in college football history during the spring transfer portal window. Then, last month, UCLA fired coach DeShaun Foster after a disastrous loss to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/NMEX/new-mexico-lobos/\">New Mexico</a> at home and saw offensive coordinator Tino Sunseri and defensive coordinator Ikaika Malloe depart from the program shortly after.</p><p>Sitting at 0-4 and being the only FBS team that hadn't led in a game this season, it would've been easy for Iamaleava -- the former top-ranked player in the 247Sports transfer rankings -- to pack it up. Instead, Iamaleava put <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PSU/penn-state-nittany-lions/\">Penn State</a> in a position where winning out might be the only guarantee at a spot in the College Football Playoff after UCLA delivered the most stunning result of the season with a <a href=\"https://www.cbssports.com/college-football/gametracker/boxscore/NCAAF_20251004_PSU@UCLA/\" target=\"_blank\">42-37 win over No. 7 Penn State on Saturday at the Rose Bowl</a>.</p><p>\"There was a lot of outside noise coming into it,\" Iamaleava said. \"I was preaching to the guys, if you don't want to be here, you can leave. I was basically telling the guys, whoever still believes that we are still in this and that we have games ahead of us that we can go win, then let's roll.\"</p>\n<p>You can count on one hand the number of active college football players who have been talked about as much as Iamaleava since his shocking departure from Tennessee earlier this spring. Even before that, Iamaleava was talked about just as much as anyone during his recruitment as a five-star quarterback coming out of Southern California, where he served as one of the early faces of Name, Image and Likeness.</p><p>When Iamaleava transferred to UCLA, there was an immediate sense of hope that Iamaleava could be the star at the position the program was looking for. Through UCLA's first four games, Iamaleava was anything but that. He was among the most pressured quarterbacks in the country and UCLA's offense ranked last among all Power Four teams (14.2) in points per game.</p><p>In the midst of more change, more chaos, and more uncertainty around the program with Sunseri departing just days before the Penn State game, 33-year-old Jerry Neuheisel was promoted to UCLA's active offensive coordinator. That meant he had to come up with a game plan with Iamaleava, on a short week, against a stout Penn State defense led by first-year defensive coordinator Jim Knowles.</p>\n<p>Whatever UCLA did, or didn't do, it worked. Iamaleava finished 17 of 24 for 166 yards and rushed for 128 yards and three touchdowns. He set a new career high in rushing yards and total touchdowns and offered a glimpse into why UCLA signed him in the first place despite the baggage he was bringing with him.</p><p>\"Nico brought these guys together,\" Neuheisel said. \"I would love to take a lot of credit, like all of a sudden we said some voodoo magic to him, but that's who he is. That's what he's capable of. ... He's special.\"</p><p>By signing Iamaleava and seeing Aguilar simultaneously enter the transfer portal, the risk -- on the field and financially -- was apparent. After all, quarterbacks who are former five-star recruits or have a ceiling of someone who can play on Sundays don't enter the transfer portal very often.</p>\n<p>After all the noise, chaos and change the first month of the season has brought, for 60 football minutes, Iamaleava showed why UCLA went all-in on the untapped talent. Iamaleava didn't just deliver the signature moment of his UCLA tenure Saturday. He delivered the defining moment of his entire football career.</p>\n            </div>"
  },
  {
    "title": "Can Billy Napier save his job again? Upset win over Texas a good start as Florida offense shows signs of life - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/can-billy-napier-save-his-job-again-upset-win-over-texas-a-good-start-as-florida-offense-shows-signs-of-life/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/215a3c84-5695-472e-80e4-816c7a4a0cb0/thumbnail/1200x675/132e0daec8066b6c40cd0ad2a9a03510/napier.jpg",
    "tag": "Sports",
    "date": "2025-10-05T00:11:06.000Z",
    "description": "Florida coach Billy Napier operates best with his back against the wall. For a second straight year, his Gators looked dead in the water before the midway point of the season. And, for a second straight year,...",
    "body": "<div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/FLA/florida-gators/\">Florida</a> coach Billy Napier <span><a href=\"https://www.cbssports.com/college-football/news/billy-napier-buyout-contract-florida-head-coach/\" target=\"_blank\">operates best with his back against the wall</a></span>. For a second straight year, his <span><a href=\"https://www.cbssports.com/college-football/news/why-hasnt-florida-fired-billy-napier-redshirt-rule-transfer-portal-window-create-timing-challenges/\" target=\"_blank\">Gators looked dead in the water</a></span> before the midway point of the season. </p><p>And, for a second straight year, Napier might be on the path back to redemption after Florida notched its second win of the season in a stunning 29-21 upset of No. 9 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TEXAS/texas-longhorns/\">Texas</a>. At the very least, his seat has cooled for another week. </p><p>It's a movie that Florida fans have seen before. Fresh off a losing season in 2023, Florida started 4-4 in 2024, including a 13-point loss to unranked <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TXAM/texas-am-aggies/\">Texas A&M</a>, a 24-point loss to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MIAMI/miami-fla-hurricanes/\">Miami</a> and a 14-point loss to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UGA/georgia-bulldogs/\">Georgia</a>. </p><p>But just days after that loss to Georgia, Florida athletic director Scott Stricklin reaffirmed his faith in his embattled football coach. A rejuvenated Napier led Florida to a 4-1 record down the stretch, which included ranked wins against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/LSU/lsu-tigers/\">LSU</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MISS/ole-miss-rebels/\">Ole Miss</a> and his first postseason win with the Gators in the Gasparilla Bowl. </p>\n<a href=\"https://www.cbssports.com/college-football/news/texas-fails-to-live-up-to-lofty-hype-offensive-shortcomings-plague-longhorns-team-ranked-preseason-no-1/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Texas fails to live up to lofty hype: Offensive shortcomings plague Longhorns team ranked preseason No. 1</p>\n                <p>\n                    Chip Patterson                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Texas fails to live up to lofty hype: Offensive shortcomings plague Longhorns team ranked preseason No. 1\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/04/3d63dfc8-2106-4abb-8f1a-36578ce1f380/thumbnail/270x152/51568109fe45a16917610210e40c0414/texas-florida.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>That close to the year, and Napier's efforts in recruiting and retaining talent like quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28904801/dj-lagway/\">DJ Lagway</a>, center <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/26717726/jake-slaughter/\">Jake Slaughter</a> and defensive lineman <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/26695685/caleb-banks/\">Caleb Banks</a>, had Florida pegged as a top-15 team entering the 2025 season. Many saw the Gators as a legitimate <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">College Football</a> Playoff contender. </p><p>Then, once again, the wheels fell off. Florida suffered a disastrous Week 2 loss to unranked USF, which led to renewed calls for Napier's job. Those calls became thundrous shouts as the Gators slipped to 1-3 with consecutive double-digit losses to LSU and Miami. Florida scored a combined 17 points against those two rivals. </p><p>There was some speculation that Florida would fire Napier during its bye week. Suffice to say, Napier survived and the Gators thrived with a week to prepare. </p>\n<p>The win over Texas doesn't magically make them playoff competitors. Nor does it put them in the thick of the SEC race. Florida did, however, show sufficient signs of life and evidence that it hasn't given up on this year yet. </p><p>Napier made the brilliant decision to start to freshman wide receivers to try and spark his ailing offense. They both delivered in their featured roles. </p><p><a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29034062/dallas-wilson/\">Dallas Wilson</a>, in his first appearance of the year, torched a good Texas defense to the tune of six catches for 111 yards and two touchdowns. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28906390/vernell-brown-iii/\">Vernell Brown III</a>, his first-year running mate, had 72 yards on three catches and also rushed for 14 yards on a jet sweep. </p>\n<p>They're a big reason why Florida scored more points in a single game than it had in its other two contests against Power Four competition combined. As was running back <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28904625/jadan-baugh/\">Jadan Baugh</a>, who kept the chains moving while averaging four yards per carry. </p><p>Napier's got a long road to complete salvation, and he's not entirely safe just because he beat Texas. There will still be plenty of voices calling for his head, especially since he has yet to put together a completely impressive season. </p><p>But Florida's difficult schedule also presents opportunity, provided Saturday's result was a sign of things to come and not a mere blimp on the radar. The Gators get No. 12 Georgia, No. 15 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TENN/tennessee-volunteers/\">Tennessee</a> and No. 18 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/FSU/florida-state-seminoles/\">Florida State</a> at home. That showdown against the Vols is particularly enticing since Tennessee has not won in Gainesville since 2003. </p>\n<p>They also have winnable contests against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MISSST/mississippi-state-bulldogs/\">Mississippi State</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UK/kentucky-wildcats/\">Kentucky</a>. It's true that Napier still doesn't have much wiggle room. Florida's administration would have plenty of reason to pull the plug after any loss. </p><p>But if Napier can beat at least two of those ranked opponents at home while continuing to recruit at a high level and win the games he should, he could at least argue his case for another year. </p>\n            </div>"
  },
  {
    "title": "Tomorrow's Top 25 Today projects college football rankings entering Week 7 - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tomorrows-top-25-today-penn-state-texas-flirting-with-exit-from-college-football-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/b56bca8e-3f3c-4761-a25c-3350a0b4eebf/thumbnail/1200x675/b380a8dd0357fc3c041e34776cf0d017/psu-top-25.png",
    "tag": "Sports",
    "date": "2025-10-05T03:34:14.000Z",
    "description": "A chaotic Saturday afternoon in college football has provided a massive shakeup in the rankings, as two top-10 teams both fell and the AP Top 25 voters must wrestle with how to rank a pair squads it...",
    "body": "<div>\n        <p>A chaotic Saturday afternoon in <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">college football</a> has provided a massive shakeup in the rankings, as two top-10 teams both fell and the AP Top 25 voters must wrestle with how to rank a pair squads it considered among the best in the country heading into the season. </p><p><a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TEXAS/texas-longhorns/\">Texas</a> started the 2025 season as the No. 1 team in the country, according to the AP voters, with <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PSU/penn-state-nittany-lions/\">Penn State</a> close on its heels at No. 2. Now, both teams face potential elimination from the rankings after each taking their second loss of the season here in Week 6 -- both falling to unranked teams. </p><p>It's become its own bit of history, as this is just the second-ever season in AP poll history (since 1936) that the preseason top two teams have both lost at least two of their first five games. The only other instance, according to CBS Sports Research, was in 1964 when No. 1 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MISS/ole-miss-rebels/\">Ole Miss</a> started 3-2 and No. 2 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OKLA/oklahoma-sooners/\">Oklahoma</a> started 2-3. </p><p>This is the biggest heat check for preseason rankings in the modern era, and it has created a mess for voters who have to decide what to do with both of these presumed contenders. Neither Penn State nor Texas has a win against a power conference opponent, yet both have one-score losses to teams that currently reside in top two of the rankings. But those \"quality losses\" -- Texas' 14-7 loss at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OHIOST/ohio-state-buckeyes/\">Ohio State</a> and Penn State's 30-24 double-overtime defeat at the hands of <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OREG/oregon-ducks/\">Oregon</a> -- can only count for so much after both teams went on the road in Week 6 and lost to unranked opponents. </p>\n<a href=\"https://www.cbssports.com/college-football/news/bowl-projections-miami-moves-to-top-seed-in-college-football-playoff-bracket-as-penn-state-texas-exit/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Bowl projections: Miami moves to top seed in College Football Playoff bracket as Penn State, Texas exit</p>\n                <p>\n                    Brad Crawford                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Bowl projections: Miami moves to top seed in College Football Playoff bracket as Penn State, Texas exit\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/05/39bc2cdd-a7d6-49b6-89c7-4a85ce3a24d2/thumbnail/270x152/ab3f62f74d09311d2b8a65771a4eb3d2/miami-bowl-projections.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Ultimately, the biases of each individual voter will determine the rankings fate of these two blue bloods who have failed to live up to preseason hype. Voters who still lean on a power ratings or power rankings mentality will keep these talented groups around, albeit in much lower positions than they held coming into the weekend. But others who lean more on resume will reward some of the surprise teams who have spent the first half of the season stacking four or five wins, even if the oddsmakers would make that group an underdog against either the Nittany Lions or Longhorns. </p><p>That wasn't the only chaos of the day. In total, we saw five ranked teams lose and three of them were to unranked teams. So, with all that in mind, here's how we project the new AP Top 25 to look on Sunday after Week 6.</p><p><strong>1. Ohio State (Last week — 1)</strong>: Once again, the Buckeyes defense pitched a bit of a masterpiece, and after allowing a field goal on the first drive, totally shut down <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MINN/minnesota-golden-gophers/\">Minnesota</a>. </p>\n<p><strong>2. Oregon (2):</strong> The Ducks were off in Week 6 and will be back in action next Saturday in a top 10 matchup against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/IND/indiana-hoosiers/\">Indiana</a>, a game you can see on CBS. </p><p><strong>3. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MIAMI/miami-fla-hurricanes/\">Miami</a> (3):</strong> Look for Miami to make big cut into the first-place vote collection of both Ohio State and Oregon after thumping <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/FSU/florida-state-seminoles/\">Florida State</a> in Tallahassee. There's going to be a big push from pundits for Miami as the new No. 1, but history shows AP voters are a bit more sluggish to bump established teams like Ohio State and Oregon from top spots when they've done little to suggest they're unfit for the honor.  </p><p><strong>4. Ole Miss (4):</strong> The Rebels were off in Week 6 and will be back in action next week against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/WASHST/washington-state-cougars/\">Washington State</a>. </p>\n<p><strong>5. Oklahoma (5):</strong> The big news out of Norman on Saturday was not Oklahoma's 44-0 win in general but of a specific appreciation for <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29390586/michael-hawkins-jr/\">Michael Hawkins Jr</a>. stepping in for <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28915380/john-mateer/\">John Mateer</a> with a four-touchdown showing. All eyes will be on Mateer's status for next week's game against Texas, but if the Sooners quarterback can't go, Hawkins has a good foundation to build on in his first start under new offensive coordinator Ben Arbuckle.  </p><p><strong>6. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TXAM/texas-am-aggies/\">Texas A&M</a> (6):</strong> Mike Elko was right about how this Texas A&M defense deserves more credit, and the way the Aggies have kept their first two SEC opponents bottled up points to a strength that this group can ride into conference title contention. </p><p><strong>7. Indiana (8):</strong> The Hoosiers were off in Week 6 and will be back in action next week at Oregon. </p>\n<p><strong>8. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BAMA/alabama-crimson-tide/\">Alabama</a> (10):</strong> After being tied at halftime and very much in a dogfight with <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/VANDY/vanderbilt-commodores/\">Vanderbilt</a>, Alabama kicked up a notch in the second half with key scores and stops that sparked a 16-point win. The season-opening loss at Florida State will carry less weight with AP voters after each additional SEC win, especially if they look as impressive as Saturday's victory against the previously undefeated Commodores. </p><p><strong>9. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TXTECH/texas-tech-red-raiders/\">Texas Tech</a> (11):</strong> The class of the Big 12 lived up to the hype, going on the road to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/HOU/houston-cougars/\">Houston</a> and handling business with a double-digit win. </p><p><strong>10. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UGA/georgia-bulldogs/\">Georgia</a> (12):</strong> The Bulldogs bounced back from last week's tough loss to Alabama with a 35-14 win against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UK/kentucky-wildcats/\">Kentucky</a>. </p>\n<p><strong>11. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/LSU/lsu-tigers/\">LSU</a> (13):</strong> The Tigers were off in Week 6 and will back in action next week at home against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/SC/south-carolina-gamecocks/\">South Carolina</a>. </p><p><strong>12. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TENN/tennessee-volunteers/\">Tennessee</a> (15):</strong> The Vols were off in Week 6 and will be back in action next week against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/ARK/arkansas-razorbacks/\">Arkansas</a>. </p><p><strong>13. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/GATECH/georgia-tech-yellow-jackets/\">Georgia Tech</a> (17):</strong> The Yellow Jackets were off in Week 6 and will be back in action next week against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/VATECH/virginia-tech-hokies/\">Virginia Tech</a>. </p>\n<p><strong>14. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MIZZOU/missouri-tigers/\">Missouri</a> (19):</strong> The Tigers were off in Week 6 and will be back in action next week against Alabama. </p><p><strong>15. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MICH/michigan-wolverines/\">Michigan</a> (20): </strong>After starting a bit slow out of the gate, Michigan hit some explosive plays in the second half and puled away for a comfortable 24-10 win against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/WISC/wisconsin-badgers/\">Wisconsin</a>. </p><p><strong>16. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/ND/notre-dame-fighting-irish/\">Notre Dame</a> (21):</strong> For one of the first times in a few weeks, the Notre Dame offense wasn't pouring on the points, but luckily the defense stepped up with one its best performances of the year. The Fighting Irish picked off <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BOISE/boise-state-broncos/\">Boise State</a> quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28921239/maddux-madsen/\">Maddux Madsen</a> four times and held the Broncos to just one touchdown in a 28-7 win to improve to 3-2.  </p>\n<p><strong>17. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/ILL/illinois-fighting-illini/\">Illinois</a> (22):</strong> The Fighting Illini kicked the offense into high gear against a <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PURDUE/purdue-boilermakers/\">Purdue</a> team that was plucky early but ultimately could not trade paint with <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/26701853/luke-altmyer/\">Luke Altmyer</a> and the Illinois passing attack. At 5-1 with the only loss coming to top-10 Indiana, Illinois is inside the top 25 though still needing quality wins to make a serious move up in the rankings. </p><p><strong>18. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BYU/byu-cougars/\">BYU</a> (23):</strong> Now at 5-0 following a win against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/WVU/west-virginia-mountaineers/\">West Virginia</a> on Friday night, we are projecting a slight move up in the rankings for the Cougars as voters begin to give bonuses to teams that have made it this far into the season without a loss. BYU's best win is probably a close road victory at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/COLO/colorado-buffaloes/\">Colorado</a>, so there's a ceiling to how high the team can climb on voters' ballots but that zero in the loss column means more the deeper we get into October. </p><p><strong>19. Vanderbilt (16): </strong>There is no expectation that Vanderbilt will fall out of the rankings after losing at Alabama, but there will be a slight adjustment now that the Commodores are no longer undefeated. Alabama's stock is on the rise so, the rankings punishment will be limited, but at the same time there's not obvious quality wins to help slot Vanderbilt among one-loss teams. </p>\n<p><strong>20. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UVA/virginia-cavaliers/\">Virginia</a> (24): </strong>The ACC title race got very interesting in Week 6, not only from the result in Tallahassee but also because Virginia just went into <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/LVILLE/louisville-cardinals/\">Louisville</a> came out with a double-overtime win against the Cardinals. The Wahoos are 5-1 overall heading into their off week but 3-0 in conference play because the lone loss, 35-31 at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/NCST/nc-state-wolfpack/\">NC State</a>, was not a conference game. With wins over Florida State and Louisville, the toughest challenges on the conference schedule are behind them, setting the stage for some real expectations over the second half of the season.    </p><p><strong>21. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/ARIZST/arizona-state-sun-devils/\">Arizona State</a> (25):</strong> The Sun Devils were off in Week 6 and will be back in action next week at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UTAH/utah-utes/\">Utah</a>.  </p><p><strong>22. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/SFLA/south-florida-bulls/\">South Florida</a> (NR):</strong> Voters had the Bulls as the first team outside the top 25 last week, and while blasting <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/CHARLO/charlotte-49ers/\">Charlotte</a> doesn't spark a big move up the resume for USF as a one-loss team, it looks much better after the results of Week 6. USF has a win over <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/FLA/florida-gators/\">Florida</a>, which just beat Texas, and its only loss is at Miami, which just beat Florida State. </p>\n<p><strong>23. Penn State (7): </strong>James Franklin admitted after the game that Penn State did not handle last week's double-overtime loss to Oregon well, and it showed with how the Nittany Lions started against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UCLA/ucla-bruins/\">UCLA</a>. The previously winless Bruins went wire-to-wire and continued to score on a very good Penn State defense throughout the afternoon. Top 10 teams losing on the road in conference play isn't crazy, but it is when that underdog enters the matchup with an 0-4 record.  </p><p><strong>24. Texas (9)</strong>: If we compare Texas to the idealized version of the Longhorns that was assumed coming into the year, this is a massive disappointment. But compared to other teams in this range, there is an argument that Texas hasn't been that far off the mark. The Longhorns have lost a pair of one-score games on the road in The Horseshoe and the The Swamp. In a vacuum that's not disgraceful, it's just not befitting for a team this talented.  </p><p><strong>25. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MEMP/memphis-tigers/\">Memphis</a> (NR):</strong> The Tigers are the only 6-0 team in the country. They've got a win against Arkansas and though other teams had more voting points last week that feat of six wins in the first six weeks of the season could grab the attention of voters trying to make sense of the end of their ballots. </p><p><strong><em>Projected to drop out</em></strong><em>: No. 14 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/IOWAST/iowa-state-cyclones/\">Iowa State</a>, No. 18 Florida State</em></p>\n            </div>"
  },
  {
    "title": "Napheesa Collier cancels meeting with WNBA commissioner Cathy Engelbert amid public spat, per report - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/wnba/news/napheesa-collier-cancels-meeting-with-wnba-commissioner-cathy-engelbert-amid-public-spat-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/4820fc5e-49f8-449a-ad6f-065b7bf89653/thumbnail/1200x675/e3a859823f3f1f0ec5a9afb801309f9f/gettyimages-2228219949-2.jpg",
    "tag": "Sports",
    "date": "2025-10-05T01:34:57.000Z",
    "description": "Getty Images                                    After publicly calling out WNBA commissioner Cathy Engelbert, Minnesota Lynx star Napheesa Collier was slated to meet with Engelbert next week to discuss...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"gettyimages-2228219949-2.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/05/4820fc5e-49f8-449a-ad6f-065b7bf89653/thumbnail/770x433/4570e808b98b5510cd1fbfffaafe0af3/gettyimages-2228219949-2.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>After publicly calling out WNBA commissioner Cathy Engelbert, <a target=\"_blank\" href=\"https://www.cbssports.com/wnba/teams/MIN/minnesota-lynx/\">Minnesota Lynx</a> star <a target=\"_blank\" href=\"https://www.cbssports.com/wnba/players/26677824/napheesa-collier/\">Napheesa Collier</a> was slated to meet with Engelbert next week to discuss her grievances. However, <a href=\"https://www.espn.com/wnba/story/_/id/46489967/sources-napheesa-collier-cancels-meeting-cathy-engelbert\" target=\"_blank\">according to a report from ESPN</a>, Collier has canceled the meeting due to the latest remarks from Engelbert.</p><p>During her exit interview with the Lynx, <span><a href=\"https://www.cbssports.com/wnba/news/lynxs-napheesa-collier-blasts-wnba-commissioner-cathy-engelbert-we-have-the-worst-leadership-in-the-world/\" target=\"_blank\">Collier took a blowtorch to Engelbert</a></span> on a range of topics from CBA negotiations to officiating. Collier went so far as to say the WNBA has \"the worst leadership in the world.\"</p><p>As part of her lengthy rant against Engelbert, Collier alleged that the WNBA commissioner told her superstar <a target=\"_blank\" href=\"https://www.cbssports.com/wnba/players/29362921/caitlin-clark/\">Caitlin Clark</a> should be \"grateful\" for the platform the league gives her, which allows her to make millions in endorsements.</p>\n<p>Prior to Game 1 of the WNBA Finals, Engelbert denied saying that and <span><a href=\"https://www.cbssports.com/wnba/news/wnba-commissioner-cathy-engelbert-denies-saying-caitlin-clark-needs-to-be-grateful-for-wnba-platform/\" target=\"_blank\">said there were a lot of \"inaccuracies\"</a></span> in Collier's speech. According to the ESPN report, that response \"pretty much pushed the relationship beyond repair\" as far as Collier was concerned.</p><a href=\"https://www.cbssports.com/wnba/news/wnba-commissioner-cathy-engelbert-says-she-wont-resign-ive-never-been-a-quitter/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>WNBA commissioner Cathy Engelbert says she won't resign: 'I've never been a quitter'</p>\n                <p>\n                    Jack Maloney                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"WNBA commissioner Cathy Engelbert says she won't resign: 'I've never been a quitter'\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/04/d05fb347-8312-4f04-8519-80e3eeb13943/thumbnail/270x152/4a3fab4c4cac00464705ec1eec234f79/untitled-design-29.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Engelbert was adamant in denying Collier's characterization of the conversation, and she implied that the Lynx star got a number of other things wrong in her tirade against WNBA leadership.</p>\n<blockquote><p>\"Obviously, I did not make those comments,\" Engelbert said. \"Caitlin has been a transformational player in this league. She's been a great representative of the game. She's brought in tens of millions of new fans to the game, proud of what she's put on the court, unfortunately, the injuries held her back from a full season this year. </p><p>\"But again, I'm not going to get into every point counterpoint, it's not productive here. We're here to celebrate the WNBA Finals. I think what Indiana just did was amazing with all the injuries they had, and everything they faced this year and bringing that to a Game 5 and overtime. But yeah, as I said, there's a lot of inaccuracies reported out there, and I certainly did not say that.\"</p></blockquote><p>Engelbert said she was \"disheartened\" to hear that players in the league don't trust her and the league to look out for their best interests. Engelbert added that she has \"to do better\" moving forward.</p>\n            </div>\n    </div>"
  },
  {
    "title": "UFC 320 results: Jiri Prochazka scores wild comeback KO over Khalil Rountree Jr. in light heavyweight war - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-results-jiri-prochazka-scores-wild-comeback-ko-over-khalil-rountree-jr-in-light-heavyweight-war/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/6d550749-bc5e-4ef4-b358-f1c5997e14f9/thumbnail/1200x675/f951a52766be072e1dcfa1e3a22c9146/jiri-prochazka-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-05T05:41:50.000Z",
    "description": "For two rounds in his UFC 320 light heavyweight bout with Khalil Rountree, Jiri Prochazka appeared to have trouble getting out of first gear. Then, Prochazka flashed his trademark chaotic fighting style in...",
    "body": "<div>\n        <p>For two rounds in his UFC 320 light heavyweight bout with Khalil Rountree, Jiri Prochazka appeared to have trouble getting out of first gear. Then, Prochazka flashed his trademark chaotic fighting style in the third and final round, punishing Rountree with a variety of strikes before scoring a late knockout.</p><p>The fight started slowly compared to the pre-fight expectations of fireworks. Both fighters were wound tight and seemed to be looking for the perfect moment to explode. Rountree focused to the body with punches and kicks while Prochazka tried to feel things out.</p><p>In the late stages of the opening round, Rountree scored with some heavy shots before Prochazka fired back. Rountree got the better of those late exchanges, but Prochazka's chin held up to some clean punches before the end of the frame.</p><p>Rountree continued to build momentum in the second round, getting his strikes off with such speed that Prochazka struggled to find the timing to land counter shots. While Prochazka landed the occasional jab and kick, it appeared Rountree was in control of the fight.</p><p>Then came the third round and the Prochazka charge. Rather than stand back and wait for Rountree to launch his attack, Prochazka brought his chaotic, kinetic style directly to Rountree's face. It didn't take long before Rountree began to wilt in the face of the storm, showing damage and seeming to have had his energy sapped -- a truth that was not helped as Prochazka took an extended moment to focus his attack on Rountree's torso.</p>\n<p>Finally, as Prochazka flurried along the cage, a left hand landed flush to Rountree's chin, knocking him out cold at the 3:04 mark of the final round.</p><p>\"I would like to show every time, a little step up,\" Prochazka said. \"This time, I felt like I need to go through the blood. When the blood war will come, it will be necessary. For me, it was necessary to be in the game and really want it, to be in there here and now and find a way.\"</p><p>Prochazka had his eyes on Saturday's main event between champion Magomed Ankalaev and former champ Alex Pereira, who already holds two knockout wins over Prochazka, believing they would be next up rather than No. 3-ranked Carlos Ulberg, who recently defeated Dominik Reyes to stake his own claim for a title shot.</p>\n<p>\"I believe the next one will be one of the two who, tonight, will fight for the title,\" Prochazka said. \"I already offered Carlos Ulberg the fight and he declined and fought Dominik Reyes.\"</p>\n            </div>"
  },
  {
    "title": "UFC 320 fight card: Start time, where to watch and live stream tonight - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-fight-card-start-time-where-to-watch-live-stream-online-ankalaev-pereira/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/03/de7f948f-45e1-47f7-813e-21bbc10641f2/thumbnail/1200x675/b4466fb2756d8b81b94c598916bbba9b/alex-pereira-magomed-ankalaev-ufc-320-mma-news-today-cbs-sports.jpg",
    "tag": "Sports",
    "date": "2025-10-05T02:30:40.000Z",
    "description": "Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.                                                    All the...",
    "body": "<div>\n<div>\n    <p>\n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    </p>\n        <div>\n<article>\n    <div>\n                                    <h2>All the information you need to watch UFC 320 live in Las Vegas</h2>\n        <div>\n                                                <div>\n                        <a target=\"_blank\" href=\"https://www.cbssports.com/writers/shakiel-mahjouri/\">\n                        <div>\n    <figure><img alt=\"            Shakiel Mahjouri\n    \" src=\"https://sportshub.cbsistatic.com/i/r/2021/11/22/ee8f0453-7850-4b6d-96b2-b9514a8cb31f/thumbnail/80x80/b4b3c81e7224ddbad9efb2048a791df5/shakiel-mahjouri.png\" /></figure>\n                                            </div>\n                    </a>\n                    </div>\n                                            <div>\n                            <p>\n    Oct 4, 2025\n                            <span>\n                    at\n    7:30 pm ET</span>\n                        <span>\n                •\n            </span>\n            <span>2 min read\n            </span>\n        </p>\n    </div>\n</div>\n            </div>\n    <div>\n    <div>\n    <figure><img alt=\"alex-pereira-magomed-ankalaev-ufc-320-mma-news-today-cbs-sports.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/03/de7f948f-45e1-47f7-813e-21bbc10641f2/thumbnail/770x433/246005f024f6fcc3d5432a8b5a62dce6/alex-pereira-magomed-ankalaev-ufc-320-mma-news-today-cbs-sports.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-results-winners-highlights-fight-card-complete-guide/\" target=\"_blank\">UFC 320</a></span> could be a night that proves to be Alex Pereira's redemption, or it could be the night where Magomed Ankalaev cements his place at the top of the light heavyweight division. Ankalaev won the 205-pound championship from Pereira in March, taking a unanimous decision and now will defend the title for the first time against the man he took it from.</p><p>In addition to the main event, Merab Dvalishvili will defend his bantamweight championship against Cory Sandhagen. Sandhagen is finally getting his crack at championship gold, but will be facing a relentless champion who never stops putting the pressure on with constant takedown threats.</p><p>Ankalaev and Pereira run back their title fight from UFC 313. In March, Ankalaev neutralized Pereira's ferocious knockout power to win the light heavyweight crown. \"Poatan\" <span><a href=\"https://www.cbssports.com/mma/news/alex-pereira-reveals-he-was-at-just-40-in-title-loss-to-magomed-anakalev-surprised-i-was-able-to-fight/\" target=\"_blank\">claims to be much healthier</a></span> heading into the rematch, as he looks to evoke his old self, the killer who knocked out four opponents in title fights in less than a year.</p><p>Dvalishvili aims to further his case as the all-time best bantamweight champion. He has a lofty goal to notch four title defenses in 12 months. That requires him to defend his title by Jan. 18, but it's only possible if he beats Sandhagen. A dynamic threat from everywhere, Sandhagen's rise is a major success story. Often the bridesmaid and never the bride, the four UFC fighters to beat \"The Sandman\" immediately fought for an undisputed title. On Saturday, it's finally Sandhagen's turn.</p><a href=\"https://www.cbssports.com/mma/news/ufc-320-predictions-fight-card-odds-expert-picks/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>UFC 320 fight predictions -- Magomed Ankalaev vs. Alex Pereira 2: Expert picks for each main card bout</p>\n                <p>\n                    Brent Brookhouse                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"UFC 320 fight predictions -- Magomed Ankalaev vs. Alex Pereira 2: Expert picks for each main card bout\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/03/39256ac3-63b8-4dd2-b9a0-3147fe4ea509/thumbnail/270x152/1941ac732fc067c59cd2d9214293dd5e/ankalaev-pereira-2-presser.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Plus, fireworks are expected when a pair of light heavyweights meet in a featured bout on the main card. Jiri Prochazka and Khalil Rountree Jr., two of the sport's most exciting fighters, are set to throw down with tons of implications. The winner could position himself for another title shot after both came up short against Pereira. The undercard also sees the return of featherweight veteran Josh Emmett as he welcomes Youssef Zalal in a key crossroads battle. Zalal brings a seven-fight win streak and impressive showings in his first four UFC bouts. Three of those ended in submissions. Emmett is one of the toughest outs in the sport and should provide a true test for the native of Morocco.</p>\n<p>Below is how you can catch all the action on Saturday night from Sin City.</p><h2>Where to watch UFC 320 </h2><p><strong>Date:</strong> Oct. 4 | <strong>Location: </strong>T-Mobile Arena -- Las Vegas<br />Early prelims begin at 6 p.m. ET and can be seen on FX/ESPN+<br />Televised prelims begin at 8 pm. ET and can been seen on FX/ESPN+<br />Main card begins at 10 p.m. ET<br /><strong>Watch live:</strong> ESPN+ PPV | <strong>Price:</strong> $79.99</p><h2>UFC 320 fight card, odds</h2><p><em>Odds via </em><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings</em></a></p>\n<ul><li>Magomed Ankalaev (c) -260 vs. Alex Pereira +210, light heavyweight title</li><li>Merab Dvalishvili (c) -360 vs. Cory Sandhagen +280, bantamweight title</li><li>Jiri Prochazka -180 vs. Khalil Rountree Jr. +150, light heavyweights</li><li>Youssef Zalal -430 vs. Josh Emmett +330, featherweights</li><li>Joe Pyfer -240 vs. Abus Magomedov +200, middleweights</li><li>Edmen Shahbazyan -275 vs. Andre Muniz +225, middleweights</li><li>Farid Basharat -450 vs. Chris Gutierrez +350, bantamweight</li><li>Daniel Santos -140 vs. Yoo Joo-Sang +120, featherweights</li><li>Macy Chiasson -180 vs. Yana Santos +150, women's bantamweights</li><li>Patchy Mix -275 vs. Jakub Wiklacz +225, bantamweights</li><li>Punahele Soriano -260 vs. Nikolay Veretennikov +210, welterweights</li><li>Austin Vanderford -280 vs. Ramiz Brahimaj +230, welterweights</li><li>Veronica Hardy -650 vs. Brogan Walker +450, women's flyweights</li></ul><p><strong>Who wins UFC 320: Ankalaev vs. Pereira, and how exactly does the fight end? <a href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\" target=\"_blank\">Visit SportsLine now to get detailed picks and analysis from the incomparable expert</a> who is up over $1,500 on his UFC main-card picks, and find out.</strong></p>\n            </div>\n    </div>\n</article>\n        </div>\n    </div>\n                        </div>"
  },
  {
    "title": "2025 NFL London Game predictions: Vikings vs. Bears odds, picks - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-london-game-prediction-odds-spread-line-vikings-vs-browns-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/25/6ff68401-66b8-48b6-8f8f-eb181e39aa8d/thumbnail/1200x675/234f32b2395184737403828d0323c228/usatsi-27084709.jpg",
    "tag": "Sports",
    "date": "2025-10-05T11:45:37.000Z",
    "description": "The Minnesota Vikings will look to get back into the win column when they face the Cleveland Browns in one of the 2025 NFL London games on Sunday morning. Minnesota is coming off a 24-21 loss to the...",
    "body": "<div>\n        <p>The <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIN/minnesota-vikings/\">Minnesota Vikings</a> will look to get back into the win column when they face the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/CLE/cleveland-browns/\">Cleveland Browns</a> in one of the 2025 NFL London games on Sunday morning. Minnesota is coming off a 24-21 loss to the Pittsburgh Steelers in Dublin, Ireland, while Cleveland dropped a 34-10 decision at Detroit in Week 4. The Vikings (2-2), who are 1-1 on the road, are also 1-1 against AFC opponents this season. The Browns (1-3), who are 1-1 as the home team, are 1-1 against NFC foes in 2025. Vikings starting quarterback J.J. McCarthy has been ruled out due to a high ankle sprain. Cleveland will start rookie Dillon Gabriel at quarterback, sending Joe Flacco to the bench.</p><p>Kickoff from Tottenham Hotspur Stadium in London, England, is set for 9:30 a.m. ET. Minnesota leads the all-time series 12-5. The Vikings are 3.5-point favorite in the latest Vikings vs. Browns odds, while the over/under for total points scored is 36. Before making any Browns vs. Vikings picks, <a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">make sure to check out the Sunday's London game predictions from SportsLine NFL expert R.J. White</a>.</p><p><em>New users can also target the </em><span><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$200 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a>:</p><p>White, a Fantasy and <a target=\"_blank\" href=\"https://www.cbssports.com/betting/\">gambling</a> editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the Vikings. He is an outstanding 37-13-3 (+2340) on his last 53 picks in games involving the Minnesota Vikings.     Anybody following his <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/college-football/\" target=\"_blank\">NFL betting</a> picks at <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a> and on <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">betting sites</a> could have seen strong returns. </p><p>Now, White has set his sights on <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251005_MIN@CLE/\" target=\"_blank\">Vikings vs. Browns</a> and just locked in his picks and predictions. <a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">You can head to SportsLine now to see his picks</a>. Here are several <a href=\"https://www.cbssports.com/nfl/odds/\" target=\"_blank\">NFL odds</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/betting/\">betting</a> lines for Browns vs. Vikings:</p><table><tbody><tr><td><p>Vikings vs. Browns     spread</p></td><td><p>Minnesota -3.5 at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings Sportsbook</a></p></td></tr><tr><td><p>Vikings vs. Browns         over/under</p></td><td><p>36 points</p></td></tr><tr><td><p>Vikings vs. Browns         money line </p></td><td><p>Minnesota -194, Cleveland +160</p></td></tr><tr><td><p>Vikings vs. Browns     picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Vikings vs. Browns         streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Vikings can win</h2><p>With McCarthy out, veteran <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1907522/carson-wentz/\">Carson Wentz</a> has filled in admirably. In two games, he has completed 44 of 66 passes (66.7%) for 523 yards and four touchdowns with two interceptions. In a 48-10 thrashing of the Cincinnati Bengals on Sept. 21, he completed 14 of 20 passes for 173 yards and two touchdowns. He completed 30 of 46 passes for 350 yards and two touchdowns with two interceptions in the loss to the Steelers.</p><p>Running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2967536/jordan-mason/\">Jordan Mason</a> powers the Minnesota ground attack. In four games, he has rushed 56 times for 271 yards (4.8 average) and two touchdowns. He also has six receptions for 30 yards. In the win over the Bengals, he carried 16 times for 116 yards and two touchdowns. <a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>Why the Browns can win</h2><p>Veteran quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1250697/joe-flacco/\">Joe Flacco</a> has been replaced by rookie third-round draft pick Dillon Gabriel. The former Oregon Duck led his team to a College Football Playoff appearance a year ago. In 2024 at Oregon, he completed 326 of 447 passes for 3,857 yards and 30 touchdowns with six interceptions. In the playoff loss to Ohio State on Jan. 1, he completed 29 of 41 passes for 299 yards and two touchdowns.</p><p>Also leading the offense is rookie running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/28878286/quinshon-judkins/\">Quinshon Judkins</a>. In three games, he has rushed 49 times for 237 yards (4.8 average) and two touchdowns. He has two explosive runs of 20 yards or more, including a long of 38, with 15 first-down conversions. In a 13-10 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/GB/green-bay-packers/\">Green Bay Packers</a> on Sept. 21, he carried 18 times for 94 yards (5.2 average) and one touchdown. <a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">See which team to back at SportsLine</a>.</p><p><em>New users can also check out the latest <span><a href=\"https://www.cbssports.com/betting/news/betmgm-promo-code/\" target=\"_blank\">BetMGM bonus code</a></span> to <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\" target=\"_blank\">get up to $1,500 in bonus bets if your first bet loses</a>:</em></p><h2>How to make Vikings vs. Browns  picks</h2><p>White has analyzed Vikings vs. Browns from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. <a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">He's only sharing what it is, and which side to back, at SportsLine</a>.</p><p><strong>Who wins Vikings vs. Browns, and what critical X-factor makes one side of the spread a must-back?</strong> <strong><a href=\"https://www.sportsline.com/insiders/2025-nfl-week-5-vikings-vs-browns-line-odds-expert-reveals-pick-for-matchup-on-sunday-from-london-england/#ttag=10052025_agg_cbssports_picks_football_nfl_white_VikingsBrowns\" target=\"_blank\">Visit SportsLine now to see which side of the Vikings vs. Browns spread you need to jump on, all from the expert that is 37-13-3 on his last 53 Minnesota Vikings picks</a>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Texas fails to live up to lofty hype: Offensive shortcomings plague Longhorns team ranked preseason No. 1 - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-fails-to-live-up-to-lofty-hype-offensive-shortcomings-plague-longhorns-team-ranked-preseason-no-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/3d63dfc8-2106-4abb-8f1a-36578ce1f380/thumbnail/1200x675/c66695374c5d4c2d93a51238154fcdad/texas-florida.png",
    "tag": "Sports",
    "date": "2025-10-05T03:48:25.000Z",
    "description": "The 2025 college football season has already handed us plenty of curveballs and surprise teams, but as we take stock of the landscape with many teams approaching the midpoint of their year, it's hard to argue...",
    "body": "<div>\n        <p>The 2025 <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">college football</a> season has already handed us plenty of curveballs and surprise teams, but as we take stock of the landscape with many teams approaching the midpoint of their year, it's hard to argue there's a more disappointing team in America than the <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TEXAS/texas-longhorns/\">Texas Longhorns</a>. </p><p>Other teams have fallen short of preseason expectations, and certainly many of those are playing much worse than the Longhorns, who fell to 3-2 with <span><a href=\"https://www.cbssports.com/\" target=\"_blank\">Saturday's 29-21 loss to unranked Florida</a></span> in Gainesville. Texas' defense has been a shining star for much of the year, starting with a strong showing against No. 1 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OHIOST/ohio-state-buckeyes/\">Ohio State</a> in a 14-7 loss in Week 1 and continuing with absolute defensive gems through the rest of the nonconference slate. </p><p>But as SEC play kicked off and the competition ramped up, Texas did not meet the moment. Ultimately, that should not come as a huge surprise, because even as the team stacked wins against lesser competition, the quality of performance was severely lacking for a team that was ranked No. 1 in the country heading into the year. </p><h2>Starting on top of the mountain</h2><p>The Longhorns achieved that preseason No. 1 honor -- something stunningly that had never happened before in the long storied history of Texas football -- largely because of the talent on the roster and the pedigree of its new starting quarterback, <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29122638/arch-manning/\">Arch Manning</a>. Steve Sarkisian led this program to a Big 12 title, SEC Championship Game appearance and back-to-back years of College Football Playoff semifinal berths thanks in part to the maturation of an elite recruiting operation. It seemed as though Sarkisian had built Texas up \"the right way,\" stacking success year-over-year with the potential of a real peak here in 2025. The coaching staff had continuity while other contenders saw notable turnover, and with the star power of the Manning name as the cherry on top, we saw Texas begin 2025 as one of the main characters in college football. </p>\n<p>But while Texas still looks good getting off the bus, as they say, it's not a team that has met the standard of a title contender on offense. And five games into a 12-game regular season, we have enough of a sample set to say that this is not one of the best teams in the country. It's perhaps one of the most dangerous teams in the country but certainly not one of the best. </p><p>Being one of the most dangerous is a nod to the overwhelming collection of talent. When Manning spins away from pressure and casually tosses a 39-yard strike right on the money to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28904799/ryan-wingo/\">Ryan Wingo</a> in the end zone, the Longhorns look awfully scary for opposing offenses. </p><p>But the same possession -- or maybe the same quarter and certainly the same game -- can also include back-breaking penalties, turnovers and an inability to establish that same connection between Manning and the receivers in the downfield passing game. The fits and starts for this Texas offense are in line with what the numbers tell us, and it's that the Longhorns, for all their talent, struggle with execution and details. </p>\n<h2>Offensive shortcomings plague Texas</h2><p>Texas entered Saturday's game ranked 104th nationally in third down conversions (35.8%), 110th nationally in red zone conversions (75%) and 127th nationally in penalty yards per game (78.3). Those categories show the inability to lock in and play in sync during the game's most pivotal moments. When teams don't beat themselves and win high-leverage moments in a game, they can perform at a level close to their peak efficiency. When all of these categories are sub-par, it's impossible to think Texas can magically flip a switch and become the monster that we were expecting to see before the season. </p><p>Those expectations, perhaps, are part of the reason that Texas has been one of the biggest disappointments of 2025. The Longhorns being out of sync offensively against their toughest foes could be a result of a team that's playing tight under the weight of those expectations. They know how talented each of the individuals are in that locker room, and not being able to put it together on the field with consistency is a frustrating position for all of the players and coaches involved. </p><p>Maybe we should not have put those expectations on this Texas team until we saw the Longhorns win a few more of the games required to truly be the No. 1 team in the country. What Sarkisian is set to endure in the wake of Saturday's loss in Gainesville is a reevaluation of his time at Texas. </p>\n<p>Texas is 3-7 against the combination of <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OKLA/oklahoma-sooners/\">Oklahoma</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BAMA/alabama-crimson-tide/\">Alabama</a>, Georgia and Ohio State under Steve Sarkisian. He's a whopping 41-19 overall but well below .500 in some of the highest-profile games as Longhorns coach. Saturday's loss to Florida doesn't really connect to that fact, but what is now a 9-15 record in one-score games certainly does. </p><p>There's this notion that will get some traction that Texas has annually fielded one of the more dangerous teams in the country in the last couple of years under Sarkisian. But the feeling that more could have been won or accomplished will come back to the anecdotal notion that the wheels aren't screwed on quite tight enough for the Longhorns to win the big races. </p><p>The failures on third down showed up again against the Gators, and so did the back-breaking penalties and the inconsistency on offense. Texas was given multiple opportunities to climb back into the game and perhaps even steal one in enemy territory, which is something that the best teams will do often when playing on the road in conference play. </p>\n<p>But this is not, as they have showed in both wins and losses, one of the best teams in the country. And the failures to achieve that status when entering the season as the No. 1 team in the rankings makes the Longhorns one of the most disappointing teams in the country. </p><h2>Where does Texas go from here?</h2><p>Next week, Texas will head to the Cotton Bowl for what is annually one of the biggest games on the college football calendar, squaring off against Oklahoma. It's very possible Texas can win that game because this is a dangerous team capable of going back-and-forth with anyone. But since it's not one of the best teams in the country, we probably should not expect it. And maybe without the weight of expectations we do see a great response from Manning and the rest of the Longhorns. </p><p>But needing to be doubted in order to achieve greatness is not a quality we think of with the No. 1 team in the country. Maybe that's why Texas had never been the preseason No. 1 before, and it might be a while before AP voters come around and hand them that honor again.<strong>  </strong></p>\n            </div>"
  },
  {
    "title": "Nevada vs. Fresno State live stream, where to watch online, CBS Sports Network channel finder, odds - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/unlv-vs-wyoming-live-stream-where-to-watch-online-cbs-sports-network-channel-finder-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/24e649ab-0afe-4279-86ba-056862c4fbcc/thumbnail/1200x675/d447e7b0626bad380e6a5e5a10194a2e/fresno-1.jpg",
    "tag": "Sports",
    "date": "2025-10-05T02:20:34.000Z",
    "description": "Imagn Images                                    The 2025 college football season ramps up in Week 6 with seven (!!) live games on CBS Sports Network across three straight days of action.The marathon kicks...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"hunter-watson-sam-houston.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/04/24e649ab-0afe-4279-86ba-056862c4fbcc/thumbnail/770x433/0e6ae2534f01d28ad000fa0160e1e5d7/fresno-1.jpg\" /></figure>\n                    <figcaption>\n                <span>Imagn Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The 2025 <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">college football</a> season ramps up in Week 6 with seven (!!) live games on CBS Sports Network across three straight days of action.</p><p>The marathon kicks off Thursday night as Sam Houston visits New Mexico State in search of its first win of the season. A Friday doubleheader follows in Conference USA with Delaware hosting Western Kentucky, then shifts west for a Mountain West clash between Colorado State and San Diego State.</p><p><em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">You can bet college football games this week at FanDuel Sportsbook</a>, where new users get $300 in bonus bets with a winning $5 wager. <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">Click here</a>:</em></p><p>Saturday brings four more matchups. Ball State opens its MAC schedule against reigning conference champion Ohio, while UConn looks to extend its winning streak to three when Florida International comes to town. The evening is capped by a Mountain West doubleheader: UNLV travels to Wyoming before Nevada closes the weekend against Fresno State.</p>\n<p>CBS Sports Network will carry all seven games, with full viewing info, betting lines and key storylines to follow as Week 6 unfolds.</p><p><em>All times Eastern | Odds via SportsLine consensus</em></p><h2>Nevada vs. Fresno State</h2><p><strong>Date:</strong> Saturday, Oct. 4 | <strong>Time: </strong>10:30 p.m.<br /><strong>Location: </strong>Valley Children's Stadium -- Fresno, California<br /><strong>TV:</strong> CBS Sports Network [<a href=\"http://www.cbssportsnetwork.com/\" target=\"_blank\">Channel finder</a>] <br /><strong>Live stream:</strong> <a href=\"https://cbs-sports.app.link/Ek1FU81gIjb\" target=\"_blank\">CBSSports.com</a> | <strong>Mobile:</strong> <a href=\"https://cbs-sports.app.link/QeYaC8MVDqb\" target=\"_blank\">CBS Sports App</a> (Free)<br /><strong>Spread:</strong> Fresno State -14 | Will the Bulldogs cover? Check out <a href=\"https://www.sportsline.com/college-football/picks/experts/\" target=\"_blank\">SportsLine's Week 6 projections here</a></p>\n<p>Fresno State (4-1) has a chance to stay tied atop the early Mountain West standings when it hosts Nevada (1-3). The Wolf Pack went winless in conference play last season and have struggled to find consistency offensively behind quarterback Chubba Purdy. Meanwhile, Bulldogs quarterback E.J. Warner, son of Hall of Famer Kurt Warner, has thrown five touchdown passes over the past two games after a rough start with five interceptions and no scores in the first three contests.</p>\n            </div>\n    </div>"
  },
  {
    "title": "UFC 320 predictions, odds, fight card, expert picks for Magomed Ankalaev vs. Alex Pereira 2 - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-predictions-fight-card-odds-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/03/39256ac3-63b8-4dd2-b9a0-3147fe4ea509/thumbnail/1200x675/036dd4c9306d092d6a66371847fff831/ankalaev-pereira-2-presser.jpg",
    "tag": "Sports",
    "date": "2025-10-05T00:00:47.000Z",
    "description": "A stacked UFC 320 card, anchored by a pair of title fights, goes down Saturday night in Las Vegas. The main event features a light heavyweight championship rematch between former champion Alex Pereira and the...",
    "body": "<div>\n        <p>A stacked <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-results-winners-highlights-fight-card-complete-guide/\" target=\"_blank\">UFC 320 card</a></span>, anchored by a pair of title fights, goes down Saturday night in Las Vegas. The main event features a light heavyweight championship rematch between former champion Alex Pereira and the man who took the title from him, titleholder Magomed Ankalaev.</p><p>Ankalaev won the first meeting, at UFC 313 in March, by unanimous decision, landing more strikes and using the clinch to neutralize Pereira's dangerous strikes. There's more bad blood heading into the rematch, and both men are seeking to make a big statement this time around.</p><p><em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">Bet UFC 320 at FanDuel Sportsbook</a>, where new users get $300 in bonus bets with a winning $5 wager:</em></p><p>The co-main event features Merab Dvalishvili putting the bantamweight title on the line against Cory Sandhagen. Dvalishvili is a relentless takedown artist, but he has claimed he will knock Sandhagen out in his third defense of the title, which could also <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-merab-dvalishvili-has-chance-to-become-the-true-bantamweight-goat-as-he-runs-roughshod-over-division/\" target=\"_blank\">put him in some rarified air</a></span>.</p>\n<p>With so much happening on Saturday night, let's look closer at the full fight card with the latest odds before we get to our staff predictions and picks for the PPV portion of the festivities that you can consider before hitting the <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">sportsbooks</a>.</p><h2>UFC 320 fight card, odds</h2><ul><li>Magomed Ankalaev (c) -260 vs. Alex Pereira +210, light heavyweight title</li><li>Merab Dvalishvili (c) -360 vs. Cory Sandhagen +280, bantamweight title</li><li>Jiri Prochazka -180 vs. Khalil Rountree Jr. +150, light heavyweights</li><li>Youssef Zalal -430 vs. Josh Emmett +330, featherweights</li><li>Joe Pyfer -240 vs. Abus Magomedov +200, middleweights</li><li>Edmen Shahbazyan -275 vs. Andre Muniz +225, middleweights</li><li>Farid Basharat -450 vs. Chris Gutierrez +350, bantamweight</li><li>Daniel Santos -140 vs. Yoo Joo-Sang +120, featherweights</li><li>Macy Chiasson -180 vs. Yana Santos +150, women's bantamweights</li><li>Patchy Mix -275 vs. Jakub Wiklacz +225, bantamweights</li><li>Punahele Soriano -260 vs. Nikolay Veretennikov +210, welterweights</li><li>Austin Vanderford -280 vs. Ramiz Brahimaj +230, welterweights</li><li>Veronica Hardy -650 vs. Brogan Walker +450, women's flyweights</li></ul><p>With such a massive main event on tap, the crew at CBS Sports went ahead with predictions and picks for the main card. <em>Here are your pick makers: Brent Brookhouse (Combat sports writer), Brian Campbell (Combat sports writer), Shakiel Mahjouri (writer), Michael Mormile (producer) and Brandon Wise (senior editor).</em></p><h2>UFC 320 picks, predictions</h2><table><tbody><tr><th><br />   </th><th>Campbell</th><th>Brookhouse</th><th>Mahjouri</th><th>Mormile</th><th>Wise</th></tr><tr><td>Ankalaev (c) vs. Pereira</td><td>Pereira</td><td>Ankalaev</td><td>Ankalaev</td><td>Pereira</td><td>Pereira</td></tr><tr><td>Merab (c) vs. Sandhagen</td><td>Merab</td><td>Merab</td><td>Merab</td><td>Merab</td><td>Sandhagen</td></tr><tr><td>Prochazka vs. Rountree Jr.</td><td>Prochazka</td><td>Prochazka</td><td>Prochazka</td><td>Prochazka</td><td>Prochazka</td></tr><tr><td>Zalal vs. Emmett</td><td>Zalal</td><td>Zalal</td><td>Zalal</td><td>Zalal</td><td>Emmett</td></tr><tr><td>Pyfer vs. Magomedov</td><td>Pyfer</td><td>Pyfer</td><td>Magomedov</td><td>Magomedov</td><td>Pyfer</td></tr></tbody></table><h2>Ankalaev vs. Pereira</h2><p><strong>Campbell: </strong>Even though we would learn that both fighters were decidedly less than 100% physically when they squared off in the main event of UFC 313 in March, it's clear that the fighter with the biggest improvement potential if all things are even in the rematch is Pereira. Even with rumors (that Pereira refuses to confirm) that \"Poatan\" was suffering from a broken hand and a battle with norovirus, he still incredibly stuffed all 12 takedown attempts from the wrestling dominant Ankalaev. The new champion unquestionably deserved the close decision win by pressuring Pereira and relying upon his technical advantage to outstrike him. But even though Ankalaev is the more well-rounded fighter of the two, his passivity in big moments against elite foes precedes their first meeting and he isn't anywhere as dangerous or clutch as the stalking Pereira. With a full gas tank, healed body and far less distractions this camp after winning fighter of the year in 2024 and becoming the UFC's biggest star, expect the 38-year-old Pereira to redeem himself in a big way after a slow and competitive start. </p>\n<p><strong>Brookhouse: </strong>For all the talk of Ankalaev's wrestling, he is a fighter who has never utilized great takedowns. He averages 0.8 takedowns per 15 minutes of Octagon time with 22% takedown accuracy. Where Ankalaev's grappling was a factor in the first fight with Pereira was in how it allowed him to control the clinch and nullify Pereira's game. Pereira will make adjustments, I'm sure, and will likely go for broke knowing he can't sit back and pick his spots. That could lead to a win for Pereira, or it will leave him open for counterfire. It just feels like Ankalaev knows he can clinch and bully Pereira around the cage, even if he can't score takedowns, and that should be enough for another win for Ankalaev.</p><p><strong>Mahjouri: </strong>The analysis around Ankalaev vs. Pereira is peculiar. Before their first fight, Ankalaev's wrestling was presented as his greatest asset. In truth, his wrestling credentials were overblown, but it didn't stop him from winning the title. Ankalaev nullified Pereira with a combination of point striking and clinch work. Pereira seems to struggle when he can't dictate the terms of engagement. Ankalaev's best strength is his well-roundedness. It should empower him to win another decision against \"Poatan.\"</p><p><em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=underdog&c=dfs\" target=\"_blank\">Pick UFC 320 at Underdog Fantasy</a>, where new users who play $5 now get $100 in site credits with promo code CBSSPORTS2 in select states.</em></p>\n<h2>Merab vs. Sandhagen</h2><p><strong>Campbell: </strong>It's true, Sandhagen represents the most difficult style challenge to Dvalishvili during his incredible run of 13 straight wins that led him to both the bantamweight title and a top five spot on <span><a href=\"https://www.cbssports.com/mma/news/ufc-pound-for-pound-fighter-rankings-khamzat-chimaev-jumps-into-top-five-despite-boos-in-victory/\" target=\"_blank\">the pound-for-pound rankings</a></span>. Sandhagen even has a strong gas tank, to boot, and an unpredictable array of leaping strikes that could prove to be the Kryptonite to Dvalishvili's spamming takedown attack. So why has Dvalishvili been installed as a 4-to-1 betting favorite despite all of that? Because the relentless Georgian simply refuses to be outworked and has subtly improved his striking enough along the way to be a factor against anyone. Dvalishvili also has an overwhelming amount of momentum on his side against an opponent in Sandhagen who is talented and has long been seen as a title threat, yet can't seem to win the big one when the opportunity is presented to him.</p><p><strong>Brookhouse:</strong> Fighting Dvalishvili has to be like living in your worst nightmare as a fighter. He doesn't stop coming forward, forcing you to defend, throwing takedown attempts your way and then sliding in with strikes as you're worrying about the grappling. If you get up from being taken down, he's right back in your face, ready to put you down again. Sandhagen is a good fighter and certainly has a striker's chance of flipping the script, but he doesn't have the cardio or defensive wrestling to handle what Dvalishvili will be throwing at him on Saturday night.</p><p><strong>Mahjouri: </strong>Dvalishvili told CBS Sports that he'd strike with Sandhagen in pursuit of a knockout. Sandhagen is confident that his wrestling skills hold up against the champion. I don't believe either of them. Dvalisvili's endurance and wrestling are a lethal combination. While Sandhagen's endurance is better than most bantamweights, it's hard to believe he's completely reinvented that part of his game. The champ's consistent pressure will break Sandhagen's rhythm, preventing him from building a lead with his dynamic striking.</p>\n<p><strong>Wise:</strong> While everything my colleagues said about this fight stands, I can't help but get a sneaking feeling about this one. Elite MMA is as good as it's ever been and the fighter's do well to cancel each other out when it comes to the specialties. But what happens for Dvalishvili if he can't get Sandhagen down or can't hold him down for long? If Dvalishvili truly choose to engage in a striking battle with Sandhagen, I favor the American and his slick boxing style to find the holes that are left open by Dvalishvili's stance with hands down. Remember, Dvalishvili has been cracked before -- he was nearly knocked out in the first round by Marlon Moraes in 2021 before rallying for a finish of his own when Moraes gassed out. </p><h2>Prochazka vs. Rountree Jr. </h2><p><strong>Campbell: </strong>The similarities between the two explosive knockout artists are interesting, including the fact that both are fresh off of wins over former champion Jamahal Hill, one fight removed from each of them being finished by Pereira in title fights. This matchup between top five light heavyweights could also very well determine the next challenger (particularly if Ankalaev wins), even though Carlos Ulberg remains in the mix while riding a nine-fight win streak. The biggest difference between them, however, might come down to Prochazka being taller and longer in a fight that will likely start slow before inevitably turning into a shootout. But that's when the unpredictable Prochazka does his best work. The former champion appears to have at least one more big run in him at age 32 and should have enough to become the last man standing in an exciting fight.</p><p><strong>Brookhouse: </strong>Who really knows with this one, right? Prochazka wins fights where he's getting cracked routinely because he just never stops winging knockout shots. That didn't work against Pereira (twice) because Pereira is a machine built to eliminate fighters who are not defensively responsible. Rountree has the power to make Prochazka pay for fighting the way he does, but when does that ever really matter in a Prochazka fight?</p>\n<p><strong>Mahjouri: </strong>Prochazka's fights are impossible to predict. Offensively, he might be the most dangerous fighter in any division, but his defensive lapses and striking obsession make him vulnerable. Rountree can crack, and his superior technical skills could end his opponent's night early. However, Prochazka has a knack for overcoming obstacles not named Pereira. With bated breath, I think Prochazka fights a fight-ending shot that puts Rountree down. </p><p><strong>Who wins UFC 320: Ankalaev vs. Pereira, and how exactly does the fight end? <a href=\"https://www.sportsline.com/insiders/ufc-320-odds-picks-mma-analyst-releases-picks-for-ankalaev-vs-pereira-2-and-other-fights-for-october-4-showcase/#ttag=100425_agg_cbssports_picks_UFC_DanielVithlani_UFC320AnkalaevPereira2\" target=\"_blank\">Visit SportsLine now to get detailed picks and analysis from the incomparable expert</a> who is up over $1,500 on his UFC main-card picks, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "UFC 320 -- Magomed Ankalaev vs. Alex Pereira 2: Results, winners, highlights, fight card, complete guide - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-results-winners-highlights-fight-card-complete-guide/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/6fd22560-3234-4c92-a3ca-2dd1f30b2b19/thumbnail/1200x675/b36c4680753fe6d42148570f525b1906/pereira-point.jpg",
    "tag": "Sports",
    "date": "2025-10-05T06:36:58.000Z",
    "description": "A look back at everything that went down at the T-Mobile Arena in Las...",
    "body": "<div>\n<div>\n<article>\n    <div>\n                                    <h2>A look back at everything that went down at the T-Mobile Arena in Las Vegas</h2>\n        <div>\n                                                <div>\n                        <a target=\"_blank\" href=\"https://www.cbssports.com/writers/shakiel-mahjouri/\">\n                        <div>\n    <figure><img alt=\"            Shakiel Mahjouri\n    \" src=\"https://sportshub.cbsistatic.com/i/r/2021/11/22/ee8f0453-7850-4b6d-96b2-b9514a8cb31f/thumbnail/80x80/b4b3c81e7224ddbad9efb2048a791df5/shakiel-mahjouri.png\" /></figure>\n                                            </div>\n                    </a>\n                    </div>\n                                            <div>\n                            <p>\n    Oct 5, 2025\n                            <span>\n                    at\n    2:36 am ET</span>\n                        <span>\n                •\n            </span>\n            <span>2 min read\n            </span>\n        </p>\n    </div>\n</div>\n            </div>\n    <div>\n    <div>\n    <figure><img alt=\"alex-pereira-magomed-ankalaev-ufc-320-313-mma-news-today-sept-4-2025.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/05/6fd22560-3234-4c92-a3ca-2dd1f30b2b19/thumbnail/770x433/a3d3800171e003e57aa4b455e5d043a4/pereira-point.jpg\" /></figure>\n                    <figcaption>\n                <span>Ian Maule/Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>Another PPV is in the books and this was a doozy. UFC 320 gave fans some incredible moments to savor over the next few weeks as Alex Pereira smashed Magomed Ankalaev to regain his light heavyweight title and Merab Dvalishvili beat down Cory Sandhagen to retain his title and extend his remarkable win streak.</p><p>Pereira's win put the title back around his waist after a stunning defeat at the hands of Ankalaev six months earlier. Pereira said that he was well below 100% for that fight and would prove it on Saturday. He did just that in dropping Ankalaev early and forcing the TKO stoppage just 80 seconds in.</p><p>Dvalishvili, meanwhile, blitzed through Sandhagen after a shaky opening round. The native of Georgia set a UFC record with his 20 takedowns in the fight and 117 total in his career. He suffocated Sandhagen with his relentless pressure and wrestling to earn the unanimous decision win and pick up his 13th straight win. </p><p>Elsewhere on the card, another light heavyweight made a statement as Jiri Prochazka scored a stunning knockout of Khalil Rountree Jr. in the third round of a fight he was losing. As has become the case with every Prochazka fight, he's never out of it until the referee says so and he proved once again that he has fight-changing power no matter the situation.</p>\n<p>CBS Sports was with you throughout fight week with the latest news, in-depth features and betting advice to consider. Thanks for stopping by and we'll see you at UFC 321 in Abu Dhabi.</p><h2>UFC 320 fight card, results</h2><ul><li>Alex Pereira def. Magomed Ankalaev (c) via first-round TKO (punches)</li><li><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-results-merab-dvalishvili-grinds-through-cory-sandhagen-to-retain-bantamweight-championship/\" target=\"_blank\">Merab Dvalishvili (c) def. Cory Sandhagen</a></span> via unanimous decision (49-45, 49-45, 49-46)</li><li><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-results-jiri-prochazka-scores-wild-comeback-ko-over-khalil-rountree-jr-in-light-heavyweight-war/\" target=\"_blank\">Jiri Prochazka def. Khalil Rountree Jr.</a></span> via third-round TKO (punches)</li><li>Youssef Zalal def. Josh Emmett via first-round submission (armbar)</li><li>Joe Pyfer def. Abus Magomedov via second-round submission (rear-naked choke)</li><li>Ateba Gautier def. Tre'ston Vines via first-round TKO</li><li>Daniel Santos def. Yoo Joo-Sang via second-round TKO</li><li>Jakub Wiklacz def. Patchy Mix via split decision (29-28, 28-29, 29-28)</li><li>Edmen Shahbazyan def. Andre Muniz +225 via first-round TKO (punches and elbows)</li><li>Punahele Soriano def. Nikolay Veretennikov via unanimous decision (30-27, 30-27, 30-27)</li><li>Macy Chiasson def. Yana Santos via unanimous decision (29-28, 29-28, 29-28)</li><li>Farid Basharat def. Chris Gutierrez via unanimous decision (29-28, 29-28, 29-28)</li><li>Ramiz Brahimaj def. Austin Vanderford via second-round submission (guillotine choke)</li><li>Veronica Hardy def. Brogan Walker via unanimous decision (30-27, 30-27, 30-27)</li></ul><h2>UFC 320 countdown</h2><ul><li><strong><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-predictions-fight-card-odds-expert-picks/\" target=\"_blank\">Staff predictions and expert picks in Las Vegas</a></span></strong></li><li><strong>Brookhouse: </strong><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-best-bets-target-props-in-magomed-ankalaev-vs-alex-pereira-merab-dvalishvili-vs-cory-sandhagen/\" target=\"_blank\">Best bets to consider on the main card</a></span></li><li><strong>Brookhouse: </strong><span><a href=\"https://www.cbssports.com/mma/news/magomed-ankalaev-refutes-alex-pereiras-health-claim-from-first-fight-if-he-was-at-40-i-was-only-at-20/\" target=\"_blank\">Ankalaev refutes Pereira's health claim 'I was only 20%'</a></span></li><li><strong>Campbell: </strong><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-alex-pereira-gets-his-chance-at-redemption-after-rare-humbling-loss-against-magomed-ankalaev/\" target=\"_blank\">Pereira gets his chance at redemption after humbling loss</a></span></li><li><strong>Mahjouri: </strong><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-merab-dvalishvili-has-chance-to-become-the-true-bantamweight-goat-as-he-runs-roughshod-over-division/\" target=\"_blank\">Merab can stake claim as the bantamweight GOAT</a></span></li><li><strong>Mahjouri: </strong><span><a href=\"https://www.cbssports.com/mma/news/ufc-320-fight-card-jiri-prochazka-vs-khalil-rountree-jr-among-best-undercard-fights-to-watch/\" target=\"_blank\">Undercard fights beyond the main event worth your attention</a></span></li><li><strong>Campbell:</strong> <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-fight-card-magomed-ankalaev-vs-alex-pereira-2-five-biggest-storylines-to-watch-in-las-vegas/\" target=\"_blank\">Biggest storylines to watch in Las Vegas</a></span></li><li>Sandhagen eyes other <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-cory-sandhagen-says-sean-omalley-doesnt-deserve-next-title-shot-eyes-other-top-contenders/\" target=\"_blank\">top contenders beyond O'Malley if he wins on Saturday</a></span></li><li>Pereira says that <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-alex-pereira-says-coward-magomed-ankalaev-hid-from-him-at-performance-institute/\" target=\"_blank\">Ankalaev is a 'coward' for 'hiding' at Performance Institute</a></span></li></ul>\n            </div>\n    </div>\n</article>\n        </div>\n                        </div>"
  },
  {
    "title": "Expert NFL DFS picks, stacks, lineup advice, for Week 5 games on Sunday - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-week-5-draftkings-fanduel-daily-fantasy-football-picks-lineups/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/24/fd8bb153-a69e-4061-81ce-1aabddb76a0b/thumbnail/1200x675/101f1599bdf0ed18b411ee5cc780c97c/breece-hall-jets-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-05T12:40:32.000Z",
    "description": "Building winning NFL DFS lineups requires finding the right mix of big-name fantasy stars to combine with NFL DFS sleepers when making NFL DFS picks. Among the marquee matchups on the Week 5 NFL schedule are...",
    "body": "<div>\n        <p>Building winning NFL DFS lineups requires finding the right mix of big-name fantasy stars to combine with NFL DFS sleepers when making NFL DFS picks. Among the marquee matchups on the Week 5 NFL schedule are Ravens vs. Texans, Dolphins vs. Panthers, Eagles vs. Broncos, Cowboys vs. Jets, and Raiders vs. Colts. In the afternoon window, there is Chargers vs. Commanders and Bengals vs. Lions in what could both be fast-paced offensive contests. </p><p>Which players should you target in your core NFL DFS picks for Week 5 on Sunday, and which potential NFL DFS values could help your NFL DFS lineups cash? Before locking in any NFL DFS picks on sites like DraftKings and FanDuel for Sunday, be sure to <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure</a>. </p><p><em>New users can also target the latest </em><span><a href=\"https://www.cbssports.com/betting/news/underdog/\" target=\"_blank\"><em>Underdog promo code</em></a></span><em>, which </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=underdog&c=dfs\" target=\"_blank\"><em>may include a play $5, get $100 offer</em></a>:</p><p>McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him is way up.</p><p>Now, McClure has turned his attention to the Sunday NFL schedule and just locked in his top daily Fantasy football picks. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">You can only see his picks and analysis at SportsLine</a>. </p><p><em>New players can </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=dfs\" target=\"_blank\"><em>get $50 in Pick6 credits at DraftKings when they play $5</em></a><em>: </em></p><h2>Top NFL DFS picks for Week 5</h2><p>One of McClure's top NFL DFS picks for Sunday is Jets running back Breece Hall. The former Iowa State standout has emerged as the bell-cow back for the Jets, bringing a mix of power and explosiveness to New York's rushing attack. In 2024, he carried the ball 209 times for 876 yards (a 4.2 yards per carry average), adding 57 receptions for 483 yards and eight total touchdowns. </p><p>Through the early stretch of 2025, Hall has logged 38 carries for 157 rushing yards (4.1 YPC), and added 78 receiving yards. Across his career, Hall's resume includes being a two-time Big 12 Offensive Player of the Year, a unanimous All-American at Iowa State, and a second-round pick of the Jets in 2022. With Braelon Allen expected to miss up to 12 weeks for New York, even more of New York's rushing game should fall on the legs of Hall. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">See who else to roster here</a>.</p><p>Part of McClure's optimal NFL DFS strategy also includes rostering Seahawks wide receiver Jaxon Smith-Njigba. The former Ohio State star has quickly become a focal point in Seattle's passing game, blending strong route precision with explosive playmaking ability. In 2024, he hauled in 100 receptions for 1,130 yards (an average of 11.3 yards per catch) and found the end zone six times, tying a franchise record for catches in a season and earning a Pro Bowl nod. </p><p>In 2025, he's off to a red-hot start, already totaling 26 receptions for 402 yards (15.5 YPC) and one touchdown in just a handful of games. Over his young career, Smith-Njigba has now amassed 189 receptions for 2,160 yards and 11 touchdowns. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">See who else to roster here</a>.</p><p><em>New users can see the latest </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>FanDuel promo code</em></a></span><em> to </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\"><em>get $300 in bonus bets at FanDuel if your $5 bet wins</em></a>:</p><h2>How to set NFL DFS lineups for Week 5</h2><p>McClure is targeting another undervalued player who could explode for huge numbers on Sunday This pick could be the difference between winning your tournaments and cash games or going home with nothing. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine</a>.</p><p><strong>So who is Mike McClure including in his optimal NFL DFS lineups for Sunday, and which under-the-radar player offers huge value? <a href=\"https://www.sportsline.com/insiders/nfl-dfs-2025-best-fanduel-draftkings-picks-lineup-advice-player-pool-for-week-5-from-a-daily-fantasy-pro/#ttag=10032025_agg_cbssports_dfs_football_nfl_mcclure_SundayDFSMcClure\" target=\"_blank\">Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings</a>, and find out. </strong></p>\n            </div>"
  },
  {
    "title": "WATCH: Rick Neuheisel reacts as son Jerry Neuheisel helps UCLA shock No. 7 Penn State in play-calling debut - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/watch-rick-neuheisel-reacts-as-son-jerry-neuheisel-helps-ucla-shock-no-7-penn-state-in-play-calling-debut/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/05/dc7ed64d-e332-4a32-b86d-5a3e9b70c84b/thumbnail/1200x675/28abc5d5409d822e8f043384e6d21e2d/neuheisel-getty.png",
    "tag": "Sports",
    "date": "2025-10-05T02:35:52.000Z",
    "description": "Getty Images                                    The biggest upset of the 2025 college football season occurred on Saturday when UCLA defeated No. 7 Penn State 42-37 at the Rose Bowl. The upset was even...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"neuheisel-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/05/dc7ed64d-e332-4a32-b86d-5a3e9b70c84b/thumbnail/770x433/c46277aef55a17a7a6f19c297163c414/neuheisel-getty.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The biggest upset of the 2025 <a target=\"_blank\" href=\"https://cbssports.com/college-football/\">college football</a> season occurred on Saturday when <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UCLA/ucla-bruins/\">UCLA</a> defeated No. 7 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PSU/penn-state-nittany-lions/\">Penn State</a> 42-37 at the Rose Bowl. The upset was even more shocking considering the Bruins, who entered the day without a win and were 24.5-point underdogs, made a change at offensive coordinator during the middle of the week of preparation. </p><p>When <span><a href=\"https://www.cbssports.com/college-football/news/ucla-parts-with-offensive-coordinator-tino-sunseri-elevates-jerry-neuheisel-amid-staff-overhaul/\" target=\"_blank\">Tino Sunseri and the program parted ways</a></span>, it opened the door for 33-year-old Jerry Neuheisel to be promoted to the play caller. Neuheisel pushed all the right buttons during his team's stunning win, while UCLA quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29123367/nico-iamaleava/\">Nico Iamaleava</a> had a career day and accounted for five touchdowns in the win.</p><p>Jerry's father, longtime college coach (including a stint at UCLA) and CBS Sports analyst Rick Neuheisel, was locked in on the action and his live reaction was captured at the CBS studios as the Bruins pulled out the shocking upset.</p><p>\"Get him down,\" Neuheisel yelled on the final play. \"Get him down. Yeah!\"</p>\n<p>The elder Neuheisel explained how his son needed to be \"careful\" not to overload his players with too many new plays with such little time to prepare. </p>\n<a href=\"https://www.cbssports.com/college-football/news/nico-iamaleava-delivers-career-defining-win-as-ucla-shocks-no-7-penn-state/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Nico Iamaleava delivers career-defining win as UCLA shocks No. 7 Penn State</p>\n                <p>\n                    Cameron Salerno                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Nico Iamaleava delivers career-defining win as UCLA shocks No. 7 Penn State\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/04/bda429a8-e2ab-4646-b97e-f6a83d54ad73/thumbnail/270x152/f1142e002bdb505b19838c51c290a8fd/untitled-design-26.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>\"He got the job the middle of the week, so he had to be real careful about how much new went in,\" <a href=\"https://x.com/CBSSportsCFB/status/1974614713645297951\" target=\"_blank\">the elder Neuheisel said</a>. \"He's got a special quarterback and he's got a special head coach.\"</p><p>To say Rick was proud of his son would be an understatement.</p>\n<p>Rick Neuheisel was the head coach at UCLA from 2008-11 while Jerry played quarterback for the Bruins before joining the coaching staff, first as a graduate assistant, in 2018. He worked his way up to wide receivers coach and later became assistant head coach and tight ends coach under DeShaun Foster, <span><a href=\"https://www.cbssports.com/college-football/news/doomed-from-the-start-how-ucla-set-deshaun-foster-up-for-failure-why-bruins-must-swing-big-for-next-coach/\" target=\"_blank\">who was fired on Sept. 14</a></span> after an ugly home loss to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/NMEX/new-mexico-lobos/\">New Mexico</a>. </p>\n<p>After the win, UCLA players carried Neuheisel off the field, while fans in the stands chanted \"Jerry\" throughout the game.</p>\n            </div>\n    </div>"
  }
]