[
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Knicks-76ers, Hornets-Hawks on Wednesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-300-bonus-bets-knicks-76ers-hornets-hawks-wednesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/04bf8ef2-4f69-4eef-a212-308060e0fa94/thumbnail/1200x675/e792444ec3070c6ff53f9f15bb211c82/jalen-brunson-new-york-knicks-imagn-images-5.jpg",
    "tag": "Sports",
    "date": "2026-02-11T17:57:14.000Z",
    "description": "\n        The latest DraftKings promo code gives new users $300 in bonus bets if your first $5 bet wins, and with a 14-game NBA slate on Wednesday, the",
    "body": "\n        The latest DraftKings promo code gives new users $300 in bonus bets if your first $5 bet wins, and with a 14-game NBA slate on Wednesday, there are plenty of ways to take advantage of this latest offer. One of the Wednesday's top matchups features the Philadelphia 76ers hosting the New York Knicks in an Eastern Conference battle, and although the 76ers are favored in the latest Wednesday NBA odds, the SportsLine Projection Model projects the Knicks to win 60% of simulations, making the Knicks (+114) one of its Wednesday NBA best bets at DraftKings Sportsbook in a 7:30 p.m. ET matchup.The model also sees an opportunity to back another underdog to win on Wednesday, seeing value in the Atlanta Hawks at +164 odds to defeat the Charlotte Hornets. The Hawks win in 47% of the model's simulations, compared to the implied odds of 37.9%. One of SportsLine's top experts has also locked in a college basketball bet for Missouri vs. Texas A&M at 9 p.m. ET. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Wednesday best bets at DraftKings SportsbookKnicks (+114) to defeat the 76ers Hawks (+164) to defeat the HornetsTexas A&M (-6.5) vs. Missouri (-112)Combining the three picks into a Wednesday parlay at DraftKings would result in a payout of +969 (risk $100 to win $969). Bet it at DraftKings here: (Odds subject to change):\nKnicks (+114) to defeat the 76ers The Knicks are coming off a stunning 137-134 overtime loss to the Pacers on Tuesday, and with Wednesday being their final game before the NBA All-Star break, you'd imagine they'd be additionally motivated to move past that loss and enter the break with a victory. The Knicks are 9-2 over their last 11 games, which includes a 112-109 win at Philadelphia on Jan. 24. Meanwhile, the 76ers have lost two of their last three games. The Knicks are 8-3 over the last three seasons against the 76ers, which doesn't even include a six-game victory over them in the playoffs two years ago. The model projects the Knicks to win in 60% of simulations, showcasing strong value at plus-money odds. Back the Knicks to win at DraftKings here:Hawks (+164) to defeat the HornetsThere's no denying how well the Hornets have been playing lately, as their nine-game winning streak was snapped by the Pistons, who have the best record in the Eastern Conference, on Monday. However, despite a 26-29 record this season, the Hawks are 6-4 over their last 10 games and are currently playing some of their best basketball of the season. The Hawks travel to the Hornets, and ironically enough, both the Hawks and Hornets have better road records than home marks this season. Atlanta is 16-14 away, and Charlotte is 11-14 at home this season. The model projects the Hawks to win in 47% of simulations, compared to the implied odds of 37.9%, making this value too good to pass up on for Wednesday NBA bets. Back the Hawks to win at DraftKings here:Texas A&M (-6.5) vs. Missouri (-112)\"This feels like a good time to buy low on Texas A&M,\" SportsLine expert Thomas Casale said. \"The Aggies fought to the wire against Alabama, but that 100-97 loss appeared to take a lot out of them. A&M had no juice in the first half versus Florida, scoring just 19 points. They did wake up and score 48 in the second half, but it was too little, too late. This is a bad matchup for a Missouri team that struggles with turnovers and guarding the three-point line. I think Texas A&M rebounds from two straight losses with a big win at home here.\" Back Texas A&M to cover at DraftKings here:\nWant more NBA, college basketball picks on Wednesday?You've seen some of the model's Wednesday best bets. Now, get against the spread, total and money-line picks for all games, including the NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Knicks-76ers, Hornets-Hawks on Wednesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/04bf8ef2-4f69-4eef-a212-308060e0fa94/thumbnail/1200x675/e792444ec3070c6ff53f9f15bb211c82/jalen-brunson-new-york-knicks-imagn-images-5.jpg"
      ],
      "datePublished": "2026-02-11T17:57:14.000Z",
      "dateModified": "2026-02-11T17:57:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 AT&T Pebble Beach Pro-Am odds, predictions, field, sleepers: Golf picks from PGA model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-a-t-t-pebble-beach-pro-am-odds-field-picks-predictions-date-projected-leaderboard-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/4ee5bf7f-7707-457b-a080-64bdbbfb46c3/thumbnail/1200x675/595d52bb0ff8c82a3b68958b7a31a77f/scottie-scheffler-pga-golf-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-02-11T18:20:17.000Z",
    "description": "\n        The first PGA Signature Event of the season arrives this week as the 2026 AT&T Pebble Beach Pro-Am unfolds at the iconic Pebble Beach Golf Li",
    "body": "\n        The first PGA Signature Event of the season arrives this week as the 2026 AT&T Pebble Beach Pro-Am unfolds at the iconic Pebble Beach Golf Links in Pebble Beach, Calif. Rory McIlroy won this event in 2025, and he's set to make his season debut this week after skipping the first four tournaments. McIlroy is +1300 in the 2026 AT&T Pebble Beach Pro-Am odds from FanDuel Sportsbook, trailing only favorite Scottie Scheffler (+300) in a loaded 2026 Pebble Beach field with the first tee times coming at 11:45 a.m. ET on Thursday.Other Pebble Beach contenders include Si Woo Kim at +2000, Tommy Fleetwood and Xander Schauffele at +2500 and Cameron Young and Viktor Hovland both at +2700. Before locking in any 2026 AT&T Pebble Beach Pro-Am picks, or making any PGA DFS picks on sites like FanDuel or DraftKings, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, simulated every PGA Tour event 10,000 times and reveals golf betting picks that have a history of being extremely profitable. This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 AT&T Pebble Beach Pro-Am field is locked in, the model simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. 2026 AT&T Pebble Beach Pro-Am predictions One major surprise the model is calling for at the WM Phoenix Open 2026: Hideki Matsuyama, who is coming off a playoff loss against Chris Gotterup at the WM Phoenix Open, doesn't even crack the top 10 this week despite being at +3000 in the odds. Matsuyama finished outside the top 10 in his first two event of the season, and he's finished T48 and T71 in his two appearances at this event. See who else to fade here. \nAnother surprise: The model is extremely high on Kim. He has been one of the hottest golfers on Tour so far this year, finishing no worse than T11 in his four events. He's been T6 or better in his last three events, and is coming off a T3 at the WM Phoenix Open and a T2 the prior week at the Farmers Insurance Open. He's also finished in the top 15 in this event in two straight seasons. See who else to pick here. New users can also check out the latest FanDuel promo code and get $100 in bonus bets at FanDuel if your $5 bet wins:How to make 2026 AT&T Pebble Beach Pro-Am picksThe model is also targeting four huge longshots, including one golfer at +10000. You can only see the model's picks here. \nWho will win the 2026 AT&T Pebble Beach Pro-Am, and which massive longshot will stun the golfing world? Check out the 2026 AT&T Pebble Beach Pro-Am odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 AT&T Pebble Beach Pro-Am odds, favorites Get full 2026 AT&T Pebble Beach Pro-Am picks, best bets and predictions here. (odds via FanDuel and subject to change)Scottie Scheffler +300Rory McIlroy +1300Si Woo Kim +2000Xander Schauffele +2500Tommy Fleetwood +2500Cameron Young +2700Viktor Hovland +2700Chris Gotterup +2700Russell Henley +2700Justin Rose +2700Hideki Matsuyama +3000Maverick McNealy +3000Matt Fitzpatrick +3300Jake Knapp +3500Robert MacIntyre +3500Ben Griffin +3500Patrick Cantlay +3500Ludvig Åberg +3500Michael Thorbjornsen +4000Jason Day +4000Collin Morikawa +4500Sepp Straka +4500Daniel Berger +5000J.J. Spaun +5000Shane Lowry +5000Pierceson Coody +5000Harris English +5000Akshay Bhatia +5500Min Woo Lee+6000Sam Burns +6000Ryan Gerard +6000Taylor Pendrith +7000Rickie Fowler +7000Kurt Kitayama +7500Wyndham Clark +7500Nick Taylor +7500Jacob Bridgeman +8000Harry Hall +8000Keegan Bradley +8000Corey Conners +8000Jordan Spieth +8000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 AT&T Pebble Beach Pro-Am odds, predictions, field, sleepers: Golf picks from PGA model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/4ee5bf7f-7707-457b-a080-64bdbbfb46c3/thumbnail/1200x675/595d52bb0ff8c82a3b68958b7a31a77f/scottie-scheffler-pga-golf-imagn-images-1.jpg"
      ],
      "datePublished": "2026-02-11T18:20:17.000Z",
      "dateModified": "2026-02-11T18:20:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warriors vs. Spurs prediction, odds, line, time: 2026 NBA picks for Wednesday, Feb. 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/warriors-spurs-odds-prediction-time-2026-nba-picks-wednesday-february-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/379233de-4d34-4625-b4ab-1a0be2043005/thumbnail/1200x675/043a25db8b11e7b982a2c5dd6d756654/draymond-green-golden-state-warriors-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-02-11T19:35:24.000Z",
    "description": "\n        A Western Conference showdown on Wednesday's NBA schedule has the Golden State Warriors hosting the San Antonio Spurs. Golden State (29-25) s",
    "body": "\n        A Western Conference showdown on Wednesday's NBA schedule has the Golden State Warriors hosting the San Antonio Spurs. Golden State (29-25) sits eighth in the West and is coming off a Monday victory over Memphis, 114-113, in which the team overcame a 15-point fourth quarter deficit. San Antonio (37-16) is second in the conference and has won five straight games, most recently defeating the Lakers, 136-108, on Tuesday. Steph Curry (knee) is out for the Warriors, as is new acquisition Kristaps Porzingis (Achilles).Tipoff is at 10 p.m. ET from the Chase Center in San Francisco. Golden State won the two matchups earlier this season. The latest Spurs vs. Warriors odds list San Antonio as the 8-point favorite, with the over/under at 221.5. Before making any Warriors vs. Spurs picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Spurs vs. Warriors 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Warriors vs. Spurs:Spurs vs. Warriors   spread                                                                     Spurs -8 at DraftKingsSpurs vs. Warriors   over/under:    221.5 pointsSpurs vs. Warriors  money line:    Spurs -269, Warriors +217Spurs vs. Warriors  picks: See picks at SportsLineSpurs vs. Warriors   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Warriors vs. Spurs picksSportsLine's model has simulated Spurs vs. Warriors 10,000 times and is going Over on the total (221.5 points). Few teams have leaned over more often than the Warriors, who have seen the Over hit in 57.4% of their games, which is the third-highest percentage in the league. As for the Spurs, they've engaged in nothing but high-scoring affairs over the last week. Each of San Antonio's last four games have eclipsed the total.These teams have met four times since the start of 2025, and those contests have averaged 235.3 combined points. Each of the four also had totals of at least 231.5 points, so the O/U for this game being much lower gives it an ever greater likelihood of the total being surpassed. Seven players for each team are projected to score more than 9 points, with six total players having at least 15 points. The model forecasts 229 combined points going on the scoreboard, with the Over hitting 61% of the time.It also says one side of the spread hits well over 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Warriors vs. Spurs, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Spurs vs. Warriors spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warriors vs. Spurs prediction, odds, line, time: 2026 NBA picks for Wednesday, Feb. 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/379233de-4d34-4625-b4ab-1a0be2043005/thumbnail/1200x675/043a25db8b11e7b982a2c5dd6d756654/draymond-green-golden-state-warriors-imagn-images-1.jpg"
      ],
      "datePublished": "2026-02-11T19:35:24.000Z",
      "dateModified": "2026-02-11T19:35:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Lindsey Vonn posts injury update, 'making progress' after third surgery - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/winter-olympics-2026-lindsey-vonn-injury-update-surgery-complex-tibia-fracture/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/76edcb96-4e1a-42c9-8e94-30cd85bcdea2/thumbnail/1200x675/fa90b659be2e8018cc1f187eff46d1db/vonn.jpg",
    "tag": "Sports",
    "date": "2026-02-11T20:23:32.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Lindsey Vonn's incredible comeback to compete at t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Lindsey Vonn's incredible comeback to compete at the 2026 Winter Olympics came to a sudden end on Sunday when she crashed in the women's downhill event and suffered a gruesome leg injury that required her to be airlifted off of the course. On Monday, Vonn made her first public statement following the crash, explaining what happened to cause the crash, insisting she had no regrets about pushing to compete on a torn ACL and thanking fans for their support. In that post, Vonn said her injury -- a complex tibia fracture -- would require multiple surgeries to repair, and on Wednesday she offered another update following her third surgery with a photo from her hospital bed in Italy. \n\nI had my 3rd surgery today and it was successful. Success today has a completely different meaning than it did a few days ago. I'm making progress and while it is slow, I know I'll be ok. Thankful for all of the incredible medical staff, friends, family, who have been by my side and the beautiful outpouring of love and support from people around the world. Also, huge congrats to my teammates and all of the Team USA athletes who are out there inspiring me and giving me something to cheer for. ❤️🤍💙In the photo, the extent of the injury is evident in the amount of bracing on Vonn's leg. However, even in the face of what seems likely to be a career-ending injury, Vonn continues to express gratitude and appreciation for fans supporting her journey back to competition. \nVonn's return to the Olympics saw her return to the top of the downhill standings this season, but a crash in Switzerland a week before the games threatened to derail her comeback after she suffered a torn ACL in her left knee. Vonn was able to get cleared by doctors to continue competing, and after successfully completing her training runs, she was still a podium contender heading into Sunday's downhill. \n        \n            \n                Lindsey Vonn has 'no regrets' after Olympics crash as skiing figures defend her decision to race on torn ACL\n                \n                    Carter Bahns                \n            \n                            \n    \n                \n                    \n    \nEarly in her run, Vonn clipped a gate as she came over a jump that caused her to get off balance and led to the crash that made for a cruel ending to an inspiring comeback bid. As she explained in her first post, she was just five inches too far inside on her line, pushing herself to the limit as always trying to get every edge possible. \nThat willingness to push boundaries made Vonn a legend, and her resilience in the face of injuries and heartache continues to make her a beloved figure in American sport. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Lindsey Vonn posts injury update, 'making progress' after third surgery - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/76edcb96-4e1a-42c9-8e94-30cd85bcdea2/thumbnail/1200x675/fa90b659be2e8018cc1f187eff46d1db/vonn.jpg"
      ],
      "datePublished": "2026-02-11T20:23:32.000Z",
      "dateModified": "2026-02-11T20:23:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-norway-norweigan-biathlete-interview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg",
    "tag": "Sports",
    "date": "2026-02-11T15:50:21.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after wi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after winning a medal at the Games, but it's typically tears of joy, not sadness, that accompany the highlight of their athletic lives. However, after winning bronze in the men's 20km biathlon, Norwegian skier Sturla Holm Lægreid broke down for a much different reason. In an interview with the Norwegian Broadcasting Corporation, he confessed to cheating on his now ex-girlfriend and pleaded with her to take him back. \n\"I told her a week ago. And it's been the worst week of my life,\" Lægreid said, via NBC. \"I had a gold medal in life, and there's probably a lot of people out there who look at me differently now, but I only have eyes for her. Sports has taken a bit of a back seat these past couple of days. Yeah, I wish I could share this with her.\"Lægreid's partner broke up with him after he informed her was unfaithful, but hoped his public confession and act of contrition would convince her to take him back. \n\"I'm not ready to give up. I hope that committing social suicide might show her how much I love her,\" Lægreid said. \"I accept the consequences of what I've done. I regret it with all my heart. Maybe I'm dumb as a rock. I'm a member of Mensa, but I still do stupid stuff.\"He added that he wanted to \"put it all on the table\" in hopes she might take him back, although this plan could backfire spectacularly as not everyone would take kindly to this kind of admission and airing of laundry on a national (and now international, after the interview went viral) scale. His ex-girlfriend responded and did not seem to thrilled about his confession of love, according to VG.\nShe said,\"I did not choose to be in this position, and it hurts to have to be in it. We have had contact, and he is aware of my positions on this.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg"
      ],
      "datePublished": "2026-02-11T15:50:21.000Z",
      "dateModified": "2026-02-11T15:50:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daniel Cormier believes Jon Jones intentionally leaked info about hip injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/daniel-cormier-jon-jones-hip-injury-ufc-white-house/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/8175cae1-f634-4027-8b1b-5c32ed8a78c9/thumbnail/1200x675/0da07e8bef33754abc49a00d17bc3437/cormier-jones-2017.jpg",
    "tag": "Sports",
    "date": "2026-02-11T18:44:06.000Z",
    "description": "\n        Daniel Cormier won't be surprised if Jon Jones never fights again. Jones recently revealed he's dealing with severe injuries that could end h",
    "body": "\n        Daniel Cormier won't be surprised if Jon Jones never fights again. Jones recently revealed he's dealing with severe injuries that could end his MMA career. Cormier believes Jones' injuries, but questions his sincerity about how the information emerged.Jones said he needed a hip replacement after developing severe arthritis. His public statements followed a recording that was uploaded by a fan, who allegedly recorded Jones with Meta glasses during a private conversation at a Dirty Boxing show. On Tuesday, Cormier shared his thoughts on Jones' revelations. Cormier initially thought Jones might not have known about the recording, but wonder if his bitter rival was complicit in leaking the information.\"It's hard to hide that you're being recorded with Meta  glasses if you're in close proximity with the person that is using the  glasses...\" Cormier said on his YouTube channel. When you've been in the public eye, you build this almost sixth sense as to when people are recording you.\"Jones disclosed his condition when asked about a potential Real American Freestyle wrestling match between the longtime UFC rivals. Cormier questioned why Jones shared closely-guarded health issues with a stranger.   \n\"I believe information like that, if it's that close to the vest, you  don't share it with some random [person] either,\" Cormier said. \"I don't  know that anything he does isn't intended to be taken in the way that  it's taken. It feels like everything he does has a purpose. I don't  believe him, and I don't think you should. Because I don't think he was  unaware of the video. \"I think Jon Jones knew what he was doing. I think he wanted people to  know that he's injured, and I think that's exactly the way that he  wanted it to happen by giving it to an influencer. That influencer then  put it on the Internet and then you can feign ignorance and go 'oh my  god, I got caught.' Not true.\" Jones said his condition would prevent him from wrestling Cormier, though he wouldn't rule out a UFC return under the right circumstance. Jones briefly retired from MMA in June, vacating the UFC heavyweight title. He changed his tune shortly after to campaign for a fight at UFC's upcoming White House card. \nCormier's doubts about the leak don't extend to the injuries. Cormier believes Jones is legitimately dealing with career-altering health issues, and wouldn't be surprised if the former two-division champion never fights again.\"I  believe Jon Jones is hurt,\" Cormier said. \"I believe Jon Jones  really  is dealing with injuries from a long, sustained career in combat  sports.  Where knees and elbows and kicks were such a massive part of  his game,  the wrestling, sports from a young age takes a toll on the  body to  anyone. That was the video that made me believe that Jon Jones  doesn't  have anything left in that regard.  \"There  will be no wrestling match between he and I. Because if that's  him in  athletics, it would be too hard for him to compete in a  wrestling match.  His body will not hold up in the training to prepare  for a wrestling  match. So I think people should now start to get ready  for a day when  they don't have Jones in fighting. I don't think you're  going to have  him much longer in this sport. Because I don't think the  guy's body is  going to hold up.\" \nJones' campaign to fight at the White House this summer seems hopeless. UFC president and CEO Dana White set the odds of Jones fighting on the card at \"a billion to one.\" Jones stayed optimistic for a while, but eventually conceded that it likely wouldn't happen. Cormier suggests that Jones knows his window is closing fast.\"It's  a sad thing because in real time you could see him come to  accept that  all those days are over,\" Cormier said. \"I fought that dude  at 36 and 38  years old and I felt great physically and mentally going  into both. But  if I had to fight him at 38, 39 or 40 years old, I don't  know if I  would have felt the way I did.\"In  real time, we're  watching him come to the acceptance that it's over.  You can see it. You  can see him accepting 'I might be done.'\"\nJones and Cormier are reigniting their rivalry as coaches on the Russian reality series ALF MMA. They fought twice in MMA. Jones won a unanimous decision the first time. Their rematch, originally a head kick knockout win for Jones, was overturned to a no-contest after Jones tested positive for banned substances. The two parties famously brawled at a press event in the lead-up to their first fight. Both fighters are former two-division champions, and rank among the all-time best.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daniel Cormier believes Jon Jones intentionally leaked info about hip injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/8175cae1-f634-4027-8b1b-5c32ed8a78c9/thumbnail/1200x675/0da07e8bef33754abc49a00d17bc3437/cormier-jones-2017.jpg"
      ],
      "datePublished": "2026-02-11T18:44:06.000Z",
      "dateModified": "2026-02-11T18:44:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canelo Alvarez pushes for rematch with Terence Crawford after battling cramps in first fight - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/canelo-alvarez-terence-crawford-cramps-rematch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/66d801e7-4bc1-4b95-a3ef-f9fa025c483e/thumbnail/1200x675/cfd9658e5a49e31d1c9f92f71f46ec55/canelo-alvarez-terence-crawford-getty.jpg",
    "tag": "Sports",
    "date": "2026-02-11T17:47:07.000Z",
    "description": "\n        Despite Terence Crawford's retirement, Saul \"Canelo\" Alvarez is chasing a rematch of their September bout, which Crawford won by clear unanim",
    "body": "\n        Despite Terence Crawford's retirement, Saul \"Canelo\" Alvarez is chasing a rematch of their September bout, which Crawford won by clear unanimous decision.Crawford (42-0, 31 KO) spent the majority of his career at welterweight and lighter before taking just one fight at junior middleweight and then jumping all the way to super middleweight to face Alvarez. While many felt the move was too big for Crawford, he dominated much of the action, thoroughly outboxing Alvarez to become undisputed super middleweight champion.Crawford was previously undisputed at welterweight and junior welterweight and also held the WBO lightweight championship.Despite the way the fight with Crawford played out, Alvarez saying the fight would have been different if he could have followed his corner's advice during the bout, claiming leg cramps were the deciding factor.\n\"I tried but my body didn't respond,\" Alvarez told Rick Reeno on the Mr. Verzace Podcast. \"I had cramps in my legs, so it didn't respond the way I wanted. It is what it is, so we learn from that and move forward, but I know what mistakes I made in the fight and in the camp, too. But that's what boxing is about. I think a winner doesn't mean you need to win every time. You need to learn from everything, from the losses, you take the losses and learn from that and still do the things you love.\"Crawford decided to retire after the win over Alvarez, claiming that he had nothing left to prove. Crawford also said that 38 is old in the boxing game and that it was time to walk away.During Alvarez's podcast appearance, he claimed that Crawford owes him a rematch or he should not get credit for his victory.\n\"I always give him all his credit, but we need to run it back,\" Alvarez said. \"After the fight, I said we need to run this fight back because I didn't really feel the way I want. I need to make this fight happen again, and it's going to be different. I think for him to deserve all the credit, he needs to give me the rematch.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canelo Alvarez pushes for rematch with Terence Crawford after battling cramps in first fight - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/66d801e7-4bc1-4b95-a3ef-f9fa025c483e/thumbnail/1200x675/cfd9658e5a49e31d1c9f92f71f46ec55/canelo-alvarez-terence-crawford-getty.jpg"
      ],
      "datePublished": "2026-02-11T17:47:07.000Z",
      "dateModified": "2026-02-11T17:47:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/eb90b318-7013-4d88-8ac0-18c5a9bba5d7/thumbnail/1200x675/018c4be0e2670a4016cdcfe285e8690b/getty-lemley-kauf-olympics.jpg",
    "tag": "Sports",
    "date": "2026-02-11T19:27:41.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA will try to improve upon those numbers in 2026, and they have some golden opportunities to do just that. Both the men's and women's hockey team should be in the running for a gold medal, Jordan Stolz is a favorite in speed skating, Chloe Kim is hitting the halfpipe in snowboarding and Mikaela Shiffrin will once again be on the ski slopes. And figure skaters Alysa Liu and Ilia Malinin have high potential to reach the podium.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Norway has won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    72413\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    45211\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    4127\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    3317\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    32712\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    3216\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    2417\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    2316\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    2248\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    1203\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    1102\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    1102\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    0123\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    0123\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    0112\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0112\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0101\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0101\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0011\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/eb90b318-7013-4d88-8ac0-18c5a9bba5d7/thumbnail/1200x675/018c4be0e2670a4016cdcfe285e8690b/getty-lemley-kauf-olympics.jpg"
      ],
      "datePublished": "2026-02-11T19:27:41.000Z",
      "dateModified": "2026-02-11T19:27:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joey Porter says Steelers protected Ben Roethlisberger, but QB wasn't a 'good person' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/former-steelers-teammate-says-team-protected-ben-roethlisberger-says-he-wasnt-a-good-person/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png",
    "tag": "Sports",
    "date": "2026-02-11T19:59:14.000Z",
    "description": "\n        While he never played for him, former Steelers outside linebacker Joey Porter is going to bat for Mike Tomlin while taking aim at two former ",
    "body": "\n        While he never played for him, former Steelers outside linebacker Joey Porter is going to bat for Mike Tomlin while taking aim at two former teammates who have been outspoken about Tomlin since his decision to step down as Pittsburgh's coach. Fellow former Steelers outside linebacker James Harrison has been extremely vocal in his criticism of Tomlin, going as far as to say he isn't a Hall of Fame coach. Former Pittsburgh quarterback Ben Roethlisberger hasn't been as extreme, but he did make headlines when he suggested late in the 2025 season that Tomlin should become Penn State's new coach. Roethlisberger has since said on his podcast that it was probably time for a change regarding the Steelers' coaching post. Porter, who also served on Pittsburgh's coaching staff from 2015-18, was largely diplomatic in terms of his comments regarding Harrison, but things got personal when he discussed Roethlisberger, his teammate from 2004-06. \"Seven definitely broke the brotherhood,\" Porter said on current Steeler defensive tackle Cameron Heyward's podcast. \"The shit that Seven did that we don't talk about is crazy. Out of anybody, he should never grab a microphone and really talk Steelers business, because if we're talking Steelers business, his ass is foul of all foul, like the shit that he did is foul of all foul. \n\"He's not a good teammate. Won a Super Bowl with him, but the person, he's just not a good teammate. Like he knows that, anybody in the Steeler building knows that, but we protected him, because I've only won one Super Bowl, and that was my quarterback. So do I love my quarterback? Yeah, but is he a good person? No.\" When asked why he felt Roethlisberger was a bad teammate, Porter mentioned Roethlisberger not signing autographs for teammates' family members during his rookie season. Porter, a team captain at the time, decided to have a meeting with Roethlisberger after he specifically declined to sign something for defensive end Aaron Smith. \"Who the hell is too cool to sign for your teammate?\" Porter said while alluding to former teammate and Hall of Fame running back Jerome Bettis and his constant willingness to do things for teammates and fans. \"I always looked at it like this. Look at the team when Joey was a captain, when Jerome was captain, when Hines Ward was a captain. You heard nothing in the locker room. \n\"Captains have to do captain shit, right? We voted to be captains, you had to be voted in. He came in an era where they just gave you a seat, because if he wasn't a captain, he'd probably have a hissy fit, but nobody's going to vote for him as captain because he don't have no captain qualities.\"Roethlisberger was suspended four games in 2010 for a violation of the NFL's personal conduct policy amid accusations from women over misconduct in 2008 and 2010. Roethlisberger himself has acknowledged that he wasn't always the best teammate. Roethlisberger did nonetheless develop close relationships with some teammates, specifically former tight end Heath Miller and former center Maurkice Pouncey. \nObviously, Roethlisberger wasn't for everyone. Steelers quarterback Mason Rudolph, whose frosty relationship with Roethlisberger was well-publicized, supported Porter's comments on social media.As the criticism of Tomlin is concerned, Roethlisberger and Harrison have their own podcasts and have never been afraid to express their opinions. And while both are entitled to their opinions, Porter doesn't feel that either are in a position to speak negatively of someone who did so much for their careers, his included. \"What makes it crazy for me to watch them two talk like that and really act like we don't have the real receipts of how this really works,\" Porter said. \"Like, you know what he just did for y'all? ... When they tell their stories, you'll think Mike didn't do shit for them. I don't know how to shit on somebody that looked out for me.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joey Porter says Steelers protected Ben Roethlisberger, but QB wasn't a 'good person' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png"
      ],
      "datePublished": "2026-02-11T19:59:14.000Z",
      "dateModified": "2026-02-11T19:59:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA suspends four in Pistons vs. Hornets fight: Isaiah Stewart out seven games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/pistons-hornets-fight-nba-suspensions-isaiah-stewart/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/22d3e833-8c34-45a6-a65c-a86270468a77/thumbnail/1200x675/344007545c7646aff784e04982b3d314/is.jpg",
    "tag": "Sports",
    "date": "2026-02-11T17:24:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA handed down suspensions following the Detr",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA handed down suspensions following the Detroit Pistons and Charlotte Hornets fight that took place on Monday night. The league suspended Isaiah Stewart seven games and Jalen Duren two games on the Pistons' side. Hornets forwards Miles Bridges and Moussa Diabate each received four-game suspensions.In the third quarter of the Pistons' eventual 110-104 victory over the Hornets, Diabate fouled Duren as he went up for a shot in the paint. Duren then put his hand in Diabate's face, which caused him to chase after Duren. Bridges also took issue with Duren's \"face wash\" of Diabate, and reignited the fracas just as things appeared to be calming down. That's when Stewart came off the bench to fight Bridges.\nThe NBA issued the most severe punishment to Stewart, \"based in part of his repeated history of unsportsmanlike acts.\" The league's statement also pointed out that Stewart \"aggressively\" entered the court from the bench area to join the altercation. Diabate and Bridges were given four games for \"escalating the altercation,\" while Duren got just two games for \"initiating.\" \nDiabate and Bridges begin their suspensions Wednesday night, when Charlotte hosts the Atlanta Hawks, and are eligible to return to the lineup next Tuesday against the Chicago Bulls. Stewart and Duren will also begin their suspensions Wednesday night, as the Pistons are scheduled to play the second game of a four-game road trip against the Toronto Raptors.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA suspends four in Pistons vs. Hornets fight: Isaiah Stewart out seven games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/22d3e833-8c34-45a6-a65c-a86270468a77/thumbnail/1200x675/344007545c7646aff784e04982b3d314/is.jpg"
      ],
      "datePublished": "2026-02-11T17:24:14.000Z",
      "dateModified": "2026-02-11T17:24:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League picks: Sunderland vs. Liverpool betting odds, expert bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/sunderland-vs-liverpool-prediction-odds-picks-for-premier-league-match-on-wednesday-feb-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/8ace5d60-64f7-4d73-b910-9cc2f2dcfc5f/thumbnail/1200x675/c311fe8efe31362bb73fb335cf63341e/liverpool-1.jpg",
    "tag": "Sports",
    "date": "2026-02-11T16:13:19.000Z",
    "description": "\nLiverpool will be looking to bounce back from a crushing loss when they visit the Stadium of Light to face Sunderland in an English Premier League ma",
    "body": "\nLiverpool will be looking to bounce back from a crushing loss when they visit the Stadium of Light to face Sunderland in an English Premier League match on Wednesday. The Reds (11-6-8) lost 2-1 at Anfield on Sunday as Manchester City rallied in the final six minutes to beat them, leaving Liverpool sixth in the Premier League table. Sunderland (9-9-7) are in ninth place and are on a run of three consecutive EPL losses, but the Black Cats are 7-5-0 at home this season.Kickoff on Wednesday in Sunderland, England is set for 3:15 p.m. ET. Liverpool are -125 favorites (wager $125 to win $100) in the latest Sunderland vs. Liverpool odds at DraftKings Sportsbook, while Sunderland are +340 underdogs (wager $100 to win $340). A draw is priced at +280 and the total is set at 2.5 (Over -130, Under +105). You can see the latest projections for Liverpool vs. Sunderland at SportsLine, and before you lock in your bets, make sure you see what soccer expert Jon Eimer has to say about this Premier League match.Eimer finished 2023 as SportsLine's No. 1 soccer expert, posting a 248-234-12 record (+25.93 units) on SportsLine article picks. Eimer has been red-hot in 2025, posting a profit in multiple leagues, including the Premier League, Champions League, La Liga and more. Anyone following his soccer betting picks could have seen huge returns at sportsbooks and on betting apps. Here are Eimer's best bets and analysis for Sunderland vs. Liverpool on Wednesday.Sunderland vs. Liverpool best betsSunderland Double Chance (+100, 1 unit)Both Teams to Score (-130, 1 unit) Sunderland and the Stadium of LightThere is only one team in the entirety of the Premier League that hasn't lost a match at home this season. It's not Manchester United or Manchester City. It's not Liverpool or Chelsea. It's not even top of the table Arsenal, It's Sunderland. When playing at the Stadium of Light, Sunderland have been in tremendous form. They've played 12 home matches this season and have won seven of those, drawing the other five. They've taken points off  teams like Manchester City, Newcastle, Arsenal and Aston Villa while playing at home. This is important to remember that this team tends to defy odds when backed by its fans. Liverpool's Recent Form Favors GoalsLiverpool will enter this match coming off a brutal loss to Manchester City over the weekend. They went up 1-0 against the Citizens at home, and conceded two goals after the 80th minute to lose all three points. While this match was disappointing, we saw a continuation of a few things.The first is that Liverpool games have been fantastic for people who like betting on goals. Their last five matches have seen 22 goals, with players like Hugo Ekitike, Florian Wirtz and Dominik Szoboszlai really finding their strides. The defense is the main problem. Liverpool's defense has been horrendous and not up to their standard. Expect them to press for goals, but expect a Sunderland team that is dominant at home to do the same.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League picks: Sunderland vs. Liverpool betting odds, expert bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/8ace5d60-64f7-4d73-b910-9cc2f2dcfc5f/thumbnail/1200x675/c311fe8efe31362bb73fb335cf63341e/liverpool-1.jpg"
      ],
      "datePublished": "2026-02-11T16:13:19.000Z",
      "dateModified": "2026-02-11T16:13:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL franchise tag primer: What we're hearing on top candidates - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-franchise-tag-candidates-primer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/8951b9ca-53c5-49f2-a650-d09b58f20748/thumbnail/1200x675/308ffc04429be69345431afb0c1ed8e4/george-pickens.jpg",
    "tag": "Sports",
    "date": "2026-02-11T20:14:55.000Z",
    "description": "\n        The 2026 NFL season is already upon us, and the Seattle Seahawks still smell like cigars and champagne. That's the way the NFL calendar falls",
    "body": "\n        The 2026 NFL season is already upon us, and the Seattle Seahawks still smell like cigars and champagne. That's the way the NFL calendar falls, as all teams have the opportunity to issue the franchise tag as early as Tuesday, Feb. 17, through the March 3 deadline.What better time than now to look at potential tag candidates ahead of free agency? After surveying around the league, I found strong consensus on the three or four teams most likely to issue the franchise tag -- Indianapolis and Dallas at the top -- but most league sources don't expect this to be a robust tag season.The 2026 salary cap has yet to be set, but we know it will eclipse $300 million for the first time ever. That, along with the tag salary projections, is enough to evaluate tag candidates less than a week before the window opens.A few important notes: 1) We always talk about the franchise tag, but teams can also issue the less-expensive transition tag. We'll have more on that later. 2) Teams only issue the tag at the start of the window to make a point ahead of negotiations. If we get to Tuesday night and no one is tagged, that's OK. And 3) The tag is regularly used as a placeholder. If someone is tagged at the start of March, they could have an extension before free agency begins a week later. If they don't, the team has until July 15 to strike a deal, or the player will play the season on the tag.\nLet's begin.Dallas Cowboys\nSee above item 3. The Cowboys tagging George Pickens has been understood since the final quarter of the regular season. It will cost Dallas about $28 million, and the two sides can work to hammer out a long-term deal. There is always a chance the Cowboys tag Pickens with the intent to trade him, but sources believe he will be playing in Dallas in 2026.Indianapolis ColtsAlong with the Cowboys, Indy appears destined to issue the tag in the coming weeks. That's because it has two options, and unless it reaches deals with both Daniel Jones and Alec Pierce, it seems obvious the team will use the tag.\nThe priority is Jones, who is recovering from an Achilles injury and would cost about $47 million on the tag. Indy would prefer to sign Jones to an extension, and there is mutual interest in him remaining there, sources say. But there will be interest in the quarterback if he somehow hits free agency. Jones went through a similar situation in 2023, when he landed a four-year deal with the Giants and Big Blue used the tag on Saquon Barkley.\nAs for Pierce, there is a dearth of free-agent wide receiver talent, and he has only improved with age. He enters his age-26 season coming off his first 1,000-yard year and has led the league in yards per reception over the past two seasons.Atlanta Falcons\nThe former No. 4 overall pick had his breakout year while playing on his fifth-year option. The Falcons couldn't pull the trigger on a long-term deal with Kyle Pitts after he struggled in Years 2 through 4, but he put together a second-team All-Pro season with Michael Penix Jr. and Kirk Cousins throwing to him. That should be enough for the new brain trust to keep him in Atlanta for at least another year.New general manager Ian Cunningham will make the call on a tag that projects around $16 million. Atlanta will also be in the market for an affordable quarterback option with Penix's injury, which could factor into how much money the Falcons allocate. Still, it seems Pitts has earned himself another year there.\nSeattle Seahawks\nIf you read my postgame Super Bowl story this week, you know Kenneth Walker III understood all of this was about to happen. It's no exaggeration to say he earned himself millions this postseason. The Seahawks have plenty of cap space, but both sides may struggle to immediately agree on an extension after this playoff burst. Has he earned a Josh Jacobs- or James Cook-type deal worth $12 million per year? Or does GM John Schneider opt for the one-year, roughly $14 million tag? Either way, after the past few weeks, there is little doubt Walker will remain in Seattle.\n        \n            \n                From Super Bowl MVP to free agent? Ranking where Seahawks star Kenneth Walker III could land\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nPass rushers\nIf one player from this group gets the tag, it's probably Odafe Oweh -- and even he's a longshot. The number will hover around $27 million, and it would be difficult for any team to pay a potential candidate that number. \nThe Chargers have the cap space, and Oweh did produce 7.5 sacks in 12 games after they traded for him. Still, sources would be surprised if Los Angeles issued the tag.\nThe same goes for Jaelan Phillips and the Eagles, who traded for him at the deadline but traditionally play the compensatory-pick game. \nAn interesting name being floated is Trey Hendrickson. He's coming off an injury-filled 2025 entering his age-32 season. While the Bengals retained the right to tag him after protracted talks last offseason, sources deem it unlikely Cincinnati allocates that much money to the position given all of its other defensive needs.\nJacksonville JaguarsTravis Etienne and Devin Lloyd are technically tag candidates, but sources do not expect Jacksonville to use the tag on either player.\nLloyd faces a linebacker tag number near $28 million, which groups off-ball linebackers with outside players. Fred Warner doesn't make that kind of money, and the Jaguars already have Ventrell Miller on a rookie deal. \nThis regime also declined Etienne's fifth-year option last year, and it's hard to envision the team using a $14 million tag even after his nearly 1,400 scrimmage yards in 2025.\nOffensive linemen\nThe linebacker tag number is dwarfed by the offensive line figure. Centers, guards and tackles are grouped together, producing a tag close to $28 million. That's amazing if you're a team with an All-Pro left tackle staring at free agency; it's less amazing if you're the Baltimore Ravens trying to retain center Tyler Linderbaum when the top of that market isn't even $20 million annually. Sources expect he would be a top target for the Chargers if Baltimore can't retain him. \nA long-shot option here is Packers tackle Rasheed Walker, but only in a tag-and-trade scenario. The tackle market -- in free agency and the draft -- is thin, so Green Bay could try to recoup draft capital lost to Dallas. Still, the Packers are typically conservative spenders, and that's a hefty number for GM Brian Gutekunst.\"I don't feel like Gutey is motivated enough to tag Rasheed,\" one league source said. \"Finding a partner at that number is tough, but it's possible.\" Unless there's a deal in place, this won't happen.Running backs\nWalker is the most likely tag candidate, and we've already addressed Etienne. The only other remotely plausible option is Breece Hall, but that seems extremely unlikely as well. Sources expect a buyer's market at the position, with players like Rachaad White, Javonte Williams and Rico Dowdle also set to hit free agency. But that doesn't mean running backs won't be tagged...\nTransition tagThe seldom-used transition tag is worth keeping in mind across several positions, but especially at running back. Teams have used it a half-dozen times over the past 15 or so years, most recently when the Patriots applied it to safety Kyle Dugger. The franchise tag allows a player to sign with another team if that club is willing to surrender two first-round picks. That is not the case with the transition tag, which simply gives the issuing team right of first refusal.Would a team actually trade two first-round picks to Seattle for Walker? Of course not, which means the Seahawks could opt for the transition tag instead. Again, there is likely no tag coming for Etienne, but the Jets have enough cap space to use it on Hall and save roughly $2 million if they choose.There have been tag surprises before, and someone not listed above could still receive the tag if the salary cap lands higher than expected. But remember, the franchise tag suppresses wages and prevents a truer open market for players. So the fewer tags, the better in a world where people should get paid what they deserve.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL franchise tag primer: What we're hearing on top candidates - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/8951b9ca-53c5-49f2-a650-d09b58f20748/thumbnail/1200x675/308ffc04429be69345431afb0c1ed8e4/george-pickens.jpg"
      ],
      "datePublished": "2026-02-11T20:14:55.000Z",
      "dateModified": "2026-02-11T20:14:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology Bubble Watch: Miami picks up big win vs. UNC, can Virginia Tech follow suit? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-bubble-watch-miami-viginia-tech-ncaa-tournament/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/a5a51da6-645e-423b-9d3b-2d1b020797d6/thumbnail/1200x675/5f86fcfc51b04b9b45769a3287c8e8f8/miami-bubble.jpg",
    "tag": "Sports",
    "date": "2026-02-11T19:10:37.000Z",
    "description": "\n        At first glance, it may not appear as though Miami's 75-66 win over North Carolina on Tuesday night had a particularly dramatic impact on the",
    "body": "\n        At first glance, it may not appear as though Miami's 75-66 win over North Carolina on Tuesday night had a particularly dramatic impact on the Hurricanes in CBS Sports Bracketology. After all, Miami is still a projected No. 11 seed, even after taking down the No. 11 ranked Tar Heels in a very non-flukey way.  But there is more than initially meets the eye, as Miami did receive a nice boost. The win catapulted Miami out of the \"Last Four In\" and to the top spot on the No. 11 seed line. The addition of a third Quad 1 win will do wonders for the Hurricanes as Selection Sunday creeps ever closer. At 19-6 and 8-3 in the ACC, first-year coach Jai Lucas has done a great job in Coral Gables after inheriting a 7-24 team.  As for an ACC team with a lot on the line Wednesday night, Virginia Tech fits the bill. The Hokies enter their showdown at Clemson slotted as one of the \"Next Four Out\" in CBS Sports Bracketology and as 8.5-point underdogs. The ACC is destined to improve upon last year's total of four NCAA Tournament bids. The league currently has eight in the field, according to Wednesday's version of the CBS Sports Bracketology model.  \n        \n            \n                Bracketology: Purdue rises to a No. 2 seed, Illinois falls in projected NCAA Tournament seeding\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nIf Virginia Tech could crash the party, it would only benefit the league even further as it seeks to reclaim its place in the college basketball hierarchy.  \nCheck out the CBS Sports Bracketology model's latest bracket at the Bracketology hub                                  All times ET                      Bubble teams in action Wednesday  \n                            \n    \n                                                \n                    \n        VCU  Entering the day: First Four Out  vs. La Salle 6:30 p.m. (ESPN+)  At 18-6 and 9-2 in the Atlantic 10, VCU is in the hunt as a team with at least some chance to join Atlantic 10 stalwart Saint Louis (23-1, 11-0) in the field. Unfortunately for the Rams — and for the A10 as a whole — only one of their remaining games currently project as Quad 1 opportunities (Feb. 20 at Saint Louis). As a result, it's going to be a tense ride down the stretch for a VCU team that is 0-4 in Quad 1.  \n                            \n    \n                                                \n                    \n      Ohio State  Entering the day: Next Four Out  vs. USC 6:30 p.m. (Big Ten Network)  It feels like Ohio State's best chance of getting a Quad 1 win may be for Northwestern to reach the top 75 of the NET, which would turn the Buckeyes' Dec. 6 road victory over the Wildcats into  a Q1 victory. Hosting USC is another Quad 2 opportunity for the Buckeyes, who need to upgrade their No. 49 WAB ranking and start showing some high-end potential.  \n\n                            \n    \n                                                \n                    \n      Virginia Tech  Entering the day: Next Four Out  at Clemson, 7 p.m. (ACC Network)  Virginia Tech is unbeaten across Quads 3  and 4 and owns a nice Dec. 31. win over Virginia. But at just 2-7 overall in Quad 1 and a WAB ranking of No. 51, the Hokies need some resume fortification. Winning on the road against a Clemson team that is 10-1 in the ACC would be a game-changer. Big resume-boosting opportunities at Miami, at North Carolina and at Virginia also await the Hokies, who need to become road warriors.  \n                            \n    \n                                                \n                    \n      Cal  Entering the day: First Four Out  at Syracuse 7 p.m. (ESPNU)  Cal profiles as a top-50 team in resume metrics because it owns four Quad 1 wins and zero losses outside the top two quadrants., But the Bears aren't great in predictive ratings, which makes this Wednesday-Saturday trek through the ACC's swing of Syracuse and Boston College potentially perilous. The Bears are 5.5 point underdogs against a 13-11 Syracuse team that has lost six of seven. \n                            \n    \n                                                \n                    \n      Seton Hall  Entering the day: Next Four Out  vs. Providence 7:30 p.m. (Peacock)  Seton Hall will be seeking a season sweep of Providence as it takes on the Friars in a can't-lose Quad 3 home matchup. The Pirates have dropped six of their last eight games but are entering a manageable stretch of schedule that should allow them to regain their footing before potentially pivotal rematches with UConn and St. John's in the closing stretch. \n\n                            \n    \n                                                \n                    \n      Missouri  Entering the day: Last Four In  at Texas A&M 9 p.m. (SEC Network)  Missouri is given a 50% or better chance at winning just one of its final eight games, per KenPom. Predictive metrics aren't a huge fan of the Tigers, but their resume includes wins over Florida and Kentucky that are aging beautifully. Throw in a road victory over Texas A&M and the Aggies would have three of those coveted Quad1A victories to tout. This team's high-potential. It's just about filling in the gaps after playing an incredibly weak out-of-league schedule. \n                            \n    \n                                                \n                    \n      New Mexico  Entering the day: First Four Out  at Grand Canyon 10 p.m. (FS1)  Three of New Mexico's seven remaining regular season games are shaping up as Quad 1 opportunities. This is one of them. With Grand Canyon hovering at No. 70 in the NET, winning a road game vs. the Antelopes could go a long way for the Lobos and first-year coach Eric Olen as they look to stop a two-game slide.  \n                            \n    \n                                                \n                    \n      Saint Mary's  Entering the day: Last Four In  vs. Pepperdine 10 p.m. (ESPN+)  This is the epitome of a landmine spot for Saint Mary's. No benefit will be derived from a Quad 4 home win against Pepperdine, which enters at 6-19 (1-11 WCC). In fact, a victory is projected to earn the Gaels a paltry 0.03 points in the ever-important WAB, but a loss would be of the catastrophic Quad 4 variety and could do irreparable harm to their at-large chances.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology Bubble Watch: Miami picks up big win vs. UNC, can Virginia Tech follow suit? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/a5a51da6-645e-423b-9d3b-2d1b020797d6/thumbnail/1200x675/5f86fcfc51b04b9b45769a3287c8e8f8/miami-bubble.jpg"
      ],
      "datePublished": "2026-02-11T19:10:37.000Z",
      "dateModified": "2026-02-11T19:10:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Post-Super Bowl NFL Power Rankings: Seahawks show defense beats offense in today's NFL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/post-super-bowl-nfl-power-rankings-prisco-seahawks-defense-offense-adapt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/09/97013de5-e04a-497e-ad3c-f276d430b413/thumbnail/1200x675/d84365238a53b762511bed2352f6f95c/seahawks-defense.jpg",
    "tag": "Sports",
    "date": "2026-02-11T17:40:20.000Z",
    "description": "\n\n\n    \n                                    It's now on offenses to respond by embracing a more aggressive approach\n        \n                         ",
    "body": "\n\n\n    \n                                    It's now on offenses to respond by embracing a more aggressive approach\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 11, 2026\n                            \n                    at\n    12:40 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Remember when the NFL made all those rule changes to help the offense, trying to drive up scoring and make the game more exciting?Well, well.They aren't working now.Defenses have taken over the league. The Seattle Seahawks' domination of the New England Patriots in Super Bowl LX was just the coronation of what has become a defensive-minded NFL.The Seahawks' offense wasn't great against a good New England defense, but it did enough as Seattle won 29-13 in a game that didn't even seem that close. It kept the Seahawks in the top spot of my final Power Rankings for the season, showing you don't always need an elite offense to win in this league.Not anymore. \n        \n            \n                Fingerprints on the Lombardi Trophy: How Mike Macdonald's Super Bowl LX masterpiece was years in the making\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nThe Seattle defense had six sacks -- with another wiped out by penalty -- and also produced an interception returned for a touchdown. It was an impressive showing that made Drake Maye look like a backup quarterback rather than a guy who missed out on league MVP by one vote.\nDefenses now own the NFL. They have so many athletes up front going against offensive lines that don't get to work in pads much anymore, which creates all kinds of problems for offenses.Pressure rates are high and the sacks keep coming, which is why offensive coordinators are now playing scared. Completion percentages are up, while yards-per-attempt numbers are down. That means dink-and-dunk and bubble screens galore.To win now on offense, you better draft and develop offensive linemen. Or else.To win now, you better be more aggressive in the passing game, which takes time.How many times this season have we watched teams take too much time in the huddle, get to the line with the play clock running down, the defense rotates -- which is really the thing now -- and the quarterback can't change the play? He's stuck. The play stinks. The defense wins.\nIt's time for offensive play-callers to be more aggressive. Mix in some no-huddle like the Bills used to run with the old \"K-Gun\" offense. Take back the aggressive approach.Take shots. Don't play scared.All we hear now is how you don't want to turn the ball over. That's ideal, but give me a 350-yard, three-TD, two-INT game over 180 yards with one TD and no picks.Take back the game.Defense has won championships the past two years. Now it's time for the offenses to get back into it.\nQuit playing scared.\n        Biggest Movers\n    \n                2\n            \n                Rams\n            \n                3\n            \n                Texans\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Seahawks\n                                \n                            They showed off their dominant defense in the Super Bowl, which proves you don't always need an elite quarterback to win it all.\n                        \n                            --\n                        \n                            14-3-0\n                        \n                                2\n                            \n                                    Patriots\n                                \n                            The offensive line was a major problem in the postseason. The Super Bowl showing makes you wonder if they overachieved to get there.\n                        \n                            --\n                        \n                            14-3-0\n                        \n                                3\n                            \n                                    Rams\n                                \n                            They played the Super Bowl champs close in three games. That means something. They do need to fix the secondary.\n                        \n                            2\n                        \n                            12-5-0\n                        \n                                4\n                            \n                                    Jaguars\n                                \n                            This young team is building toward something, and Liam Coen is the right guy for the job. They do have to find ways to improve their pass rush.\n                        \n                            1\n                        \n                            13-4-0\n                        \n                                5\n                            \n                                    Broncos\n                                \n                            Did they miss a major chance to win it all when Bo Nix went down and missed the AFC title game? They were better than the Patriots with him.\n                        \n                            1\n                        \n                            14-3-0\n                        \n                                6\n                            \n                                    49ers\n                                \n                            They lost defensive coordinator Robert Saleh to the Titans, but did a nice job landing Raheem Morris to take over. There is no way they can have the same health issues again next year, right?\n                        \n                            --\n                        \n                            12-5-0\n                        \n                                7\n                            \n                                    Bills\n                                \n                            They fired Sean McDermott and promoted Joe Brady to head coach. Now he has to make sure the offense lets Josh Allen play loose again.\n                        \n                            2\n                        \n                            12-5-0\n                        \n                                8\n                            \n                                    Bears\n                                \n                            They made a big leap in the first season for coach Ben Johnson. Now they have to build on it and improve the pass rush.\n                        \n                            1\n                        \n                            11-6-0\n                        \n                                9\n                            \n                                    Eagles\n                                \n                            They changed offensive coordinators and the line coach is gone. There might be some guys up front retiring too. This team is moving in the wrong direction.\n                        \n                            1\n                        \n                            11-6-0\n                        \n                                10\n                            \n                                    Packers\n                                \n                            They lost defensive coordinator Jeff Hafley to the Dolphins as their new coach. But they did a nice job getting Jonathan Gannon to replace him.\n                        \n                            2\n                        \n                            9-7-1\n                        \n                                11\n                            \n                                    Texans\n                                \n                            They head into the offseason with questions about C.J. Stroud. What do they do about a contract? Anything?\n                        \n                            3\n                        \n                            12-5-0\n                        \n                                12\n                            \n                                    Chargers\n                                \n                            Bringing in Mike McDaniel as offensive coordinator will really get that side of the ball going. The health of the offensive line will as well.\n                        \n                            1\n                        \n                            11-6-0\n                        \n                                13\n                            \n                                    Ravens\n                                \n                            Jesse Minter takes over as the new coach and will bring toughness to the defense. He did a great job hiring a staff, which will help.\n                        \n                            2\n                        \n                            8-9-0\n                        \n                                14\n                            \n                                    Lions\n                                \n                            They had a lot of injuries again on defense, which impacted them in a big way. That side of the ball simply wasn't good enough.\n                        \n                            2\n                        \n                            9-8-0\n                        \n                                15\n                            \n                                    Steelers\n                                \n                            Mike McCarthy takes over as the new coach for Mike Tomlin. McCarthy has to figure out who plays quarterback. Does he bring Aaron Rodgers back?\n                        \n                            2\n                        \n                            10-7-0\n                        \n                                16\n                            \n                                    Panthers\n                                \n                            They sneaked into the playoffs by winning the subpar NFC South with an 8-9 record in Year 2 for Dave Canales. Bryce Young was better at times, but consistency is an issue.\n                        \n                            2\n                        \n                            8-9-0\n                        \n                                17\n                            \n                                    Vikings\n                                \n                            They had to sit and watch Sam Darnold win a Super Bowl, which had to sting. Now it's all on J.J. McCarthy -- or else.\n                        \n                            --\n                        \n                            9-8-0\n                        \n                                18\n                            \n                                    Buccaneers\n                                \n                            Todd Bowles is back as coach, but they have a new offensive coordinator in Zac Robinson. They have to find help for their pass rush.\n                        \n                            --\n                        \n                            8-9-0\n                        \n                                19\n                            \n                                    Cowboys\n                                \n                            They have a lot of talent on the roster, and if they can stay healthy, they can push for the division title. They need to get an edge rusher of some sort after trading Micah Parsons last season.\n                        \n                            --\n                        \n                            7-9-1\n                        \n                                20\n                            \n                                    Bengals\n                                \n                            Zac Taylor is back as coach, facing a win-or-else season. They have to get better on both lines.\n                        \n                            --\n                        \n                            6-11-0\n                        \n                                21\n                            \n                                    Dolphins\n                                \n                            New coach Jeff Hafley faces a tough challenge off the bat because of the quarterback situation. They have to figure out what to do with Tua Tagovailoa.\n                        \n                            --\n                        \n                            7-10-0\n                        \n                                22\n                            \n                                    Saints\n                                \n                            They made progress in the first season for new coach Kellen Moore. They have to see if Tyler Shough is the long-term guy.\n                        \n                            --\n                        \n                            6-11-0\n                        \n                                23\n                            \n                                    Falcons\n                                \n                            They landed Kevin Stefanski as their head coach, which was a good move. The big question is the quarterback spot. When will Michael Penix Jr. be ready to play?\n                        \n                            --\n                        \n                            8-9-0\n                        \n                                24\n                            \n                                    Colts\n                                \n                            They have to figure out if Daniel Jones will be back at quarterback. He is a free agent, but he's coming off a torn Achilles tendon.\n                        \n                            --\n                        \n                            8-9-0\n                        \n                                25\n                            \n                                    Chiefs\n                                \n                            They will be back. But it all depends on when Patrick Mahomes is healthy enough to play. If it's Week 1, they will be a contender again. If not, well...\n                        \n                            --\n                        \n                            6-11-0\n                        \n                                26\n                            \n                                    Giants\n                                \n                            New coach John Harbaugh will bring some juice and clout to a team that seemed to fall apart last season. It's all about Jaxson Dart's growth for this team in 2026.\n                        \n                            --\n                        \n                            4-13-0\n                        \n                                27\n                            \n                                    Commanders\n                                \n                            They went from an NFC title team to a bad one in a year. Injuries didn't help, but they have issues on defense too.\n                        \n                            --\n                        \n                            5-12-0\n                        \n                                28\n                            \n                                    Browns\n                                \n                            Todd Monken takes over as the new coach, but he has to figure out the quarterback situation. Will it be Shedeur Sanders? A draft pick? Or a veteran?\n                        \n                            --\n                        \n                            5-12-0\n                        \n                                29\n                            \n                                    Cardinals\n                                \n                            New coach Mike LaFleur faces a lot of challenges with this team. The first challenge is what to do with Kyler Murray.\n                        \n                            --\n                        \n                            3-14-0\n                        \n                                30\n                            \n                                    Titans\n                                \n                            New coach Robert Saleh will bring toughness to the defense. They have a lot of salary cap space to try and fix this team.\n                        \n                            --\n                        \n                            3-14-0\n                        \n                                31\n                            \n                                    Jets\n                                \n                            Aaron Glenn is back for year two, and he won't make it to year three if they don't figure out the quarterback position. What do they do?\n                        \n                            --\n                        \n                            3-14-0\n                        \n                                32\n                            \n                                    Raiders\n                                \n                            Getting Klint Kubiak as coach was the right move. He will be the right guy to develop Fernando Mendoza after they make him the first overall pick in the 2026 NFL Draft.\n                        \n                            --\n                        \n                            3-14-0\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Post-Super Bowl NFL Power Rankings: Seahawks show defense beats offense in today's NFL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/09/97013de5-e04a-497e-ad3c-f276d430b413/thumbnail/1200x675/d84365238a53b762511bed2352f6f95c/seahawks-defense.jpg"
      ],
      "datePublished": "2026-02-11T17:40:20.000Z",
      "dateModified": "2026-02-11T17:40:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL combine: Dates, schedule, where to watch and top prospects - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/2026-nfl-combine-dates-schedule-drills-tv-stream-location-top-prospects/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/28/244185f9-c9dd-4724-8756-920a75fb00c9/thumbnail/1200x675/7ea9db011d003bd77faf539a1fc136e1/nfl-scouting-combine.jpg",
    "tag": "Sports",
    "date": "2026-02-11T16:53:19.000Z",
    "description": "\n        The NFL Scouting Combine is less than one month away. Draft prospects will have the opportunity to go through medical evaluations, meet with ",
    "body": "\n        The NFL Scouting Combine is less than one month away. Draft prospects will have the opportunity to go through medical evaluations, meet with teams, participate in on-field workouts and take part in media interviews. It is a conveyor belt of sorts where players go from one station to the next over the course of that week. Fans are able to watch on-field drills at Lucas Oil Stadium and take part in other NFL experiences. Those unable to attend can still watch on television and other streaming platforms. Here is everything you need to know about the event in Indianapolis:When is the NFL combine?The 2026 NFL Scouting Combine will take place from Feb. 22 to March 2. Here are the tentative dates for on-field workouts:Thursday, Feb. 26 -- Defensive linemen, linebackersFriday, Feb. 27 -- Defensive backs, tight endsSaturday, Feb. 28 -- Quarterbacks, wide receivers, running backsSunday, March 1 -- Offensive linemenTV: NFL Network | Stream: fuboTV (try for free)Where is the NFL combine?The 2026 NFL Scouting Combine will take place at Lucas Oil Stadium in Indianapolis -- home of the Indianapolis Colts. Measurements and media interviews are held at the local convention center. Lengthy medical testing is conducted at nearby hospitals as well. \nThe event has been held in Indianapolis since 1987 and will continue to be held there through at least 2028. There had been some chatter about the event potentially moving elsewhere.  What is the NFL combine schedule?Here's everything the prospects will go through during the NFL combine:DatePK, DL & LBDB & TERB, QB & WROLSun., Feb. 22Early player arrivals———Mon., Feb. 23Registration; Preexam; Orientation; Team interviewsEarly player arrivals——Tue., Feb. 24General medical exam; Preordered studies; Team interviewsRegistration; Preexam; Orientation; Team interviewsRegistration; Orientation; Team interviews—Wed., Feb. 25Ortho exam; Media interviews; Kicking workout; NFLPA meetings; Team interviewsGeneral medical exam; Preordered studies; Team interviewsPreexam; NFLPA meetings; Team interviewsRegistration; Orientation; Team interviewsThu., Feb. 26Measurements; On-field workoutsOrtho exam; Media interviews; NFLPA meetings; Team interviewsGeneral medical exam; Preordered studies; Team interviewsPreexam; NFLPA meetings; Team interviewsFri., Feb. 27Bench press; Depart IndianapolisMeasurements; On-field workoutsOrtho exams; Media interviews; Team interviewsGeneral medical exam; Preordered studies; Team interviewsSat., Feb. 28—Bench press; Depart IndianapolisMeasurements; On-field workoutsOrtho exams; Media interviews; Team interviewsSun., March 1——Bench press; Depart IndianapolisMeasurements; On-field workoutsMon., March 2———Bench press; Depart Indianapolis2026 NFL Draft orderHere is a look at the top 10 picks:\n                            \n    \n                                                \n                    \n    1. Las Vegas Raiders (3-14)Las Vegas overextended last offseason by drafting a running back in the top 10 and trading for a 35-year-old quarterback despite having one of the league's worst rosters. As a result, they fired head coach Pete Carroll after one season and are now picking even earlier in the draft. \n                            \n    \n                                                \n                    \n    2. New York Jets (3-14)The Jets finished with one of the worst records in the league, but at least they have a plan and put themselves in a position to change the course of their franchise. Over the next two years, New York has five first-round picks. \n\n                            \n    \n                                                \n                    \n    3. Arizona Cardinals (3-14)Arizona made the decision to part with head coach Jonathan Gannon. It would not be a surprise if they moved on from Kyler Murray as well. The problem is that there are not a wealth of options to replace Murray.\n                            \n    \n                                                \n                    \n    4. Tennessee Titans (3-14)The positive momentum Tennessee had built over the past month came to a frustrating end in the season finale. Still, Cam Ward's strong finish to the 2025 campaign should give Titans fans hope.\n                            \n    \n                                                \n                    \n    5. New York Giants (4-13)There are reasons to be optimistic about Jaxson Dart's future with the franchise. He brought life to an offense that could have easily wallowed in self-pity following the Malik Nabers and Andrew Thomas injuries. With the hiring of John Harbaugh as their new coach, a bounce back could happen sooner than most would expect.   \n\n                            \n    \n                                                \n                    \n    6. Cleveland Browns (5-12)The Browns made the decision to part with head coach Kevin Stefanski after six seasons. He did lead the franchise to its first playoff win post-expansion, but may not be any closer to identifying the quarterback of the future. \n                            \n    \n                                                \n                    \n    7. Washington Commanders (5-12)Next season is an easy sell for Washington. If Jayden Daniels returns healthy, then the Commanders will be competitive once again, but there are a lot of needs on that roster. An attempt to microwave those weaknesses last offseason did not work out. \n                            \n    \n                                                \n                    \n    8. New Orleans Saints (6-11)The Saints' season ended just as fans were clamoring for more of Tyler Shough. He looks like the clear favorite to open next season as the starting quarterback, bringing a level of optimism that simply didn't exist earlier in the year.\n\n                            \n    \n                                                \n                    \n    9. Kansas City Chiefs (6-11)Kansas City will enter next season in unfamiliar territory: the hungry underdog. Assuming Patrick Mahomes' full health, there is no reason to believe the Chiefs will not be in the mix again next season. They do have a deteriorating roster that desperately needs a youthful infusion. \n                            \n    \n                                                \n                    \n    10. Cincinnati Bengals (6-11)Joe Burrow made a notable attempt to get the Bengals into the playoffs after succumbing to an injury early in the season, but ultimately fell short. The offense will be in a spot to compete next season, but can the defense improve enough this offseason to get them enough stops?\n        \n            \n                2026 NFL Draft order: Full list of first-round picks, team needs and potential free agents after Super Bowl LX\n                \n                    Josh Edwards                \n            \n                            \n    \n                \n                    \n    \nMock draft centralThere is never a shortage of scenarios to play out in the NFL Draft, so that is why CBSSports.com has a new mock draft each week from a rotating group of analysts to account for the latest rumblings and opinions on the top prospects eligible for the 2026 NFL Draft. Each of our first-round mock drafts can be found here.\n\n        \n            \n                2026 NFL mock draft: Projecting all 32 first-round picks after Seahawks' Super Bowl win\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nProspect rankings/full list of participants Last year's draft class was thought to be lacking blue-chip talent, but the rookie group ended up being one of the most impactful in recent years. Although this year's class is viewed as similarly weak at the top, that doesn't mean teams won't be able to find contributors. There appears to be good depth among the wide receivers, edge rushers, tight ends and cornerbacks. Quarterback is similar to last year in that there is one guy at the top, Indiana's Fernando Mendoza, one who may sneak into the first round, Alabama's Ty Simpson, and others with ample playing experience.Here are the top 10 prospects in the 2026 NFL Draft, according to CBSSports' Mike Renner:Fernando Mendoza, QB, Indiana  Rueben Bain Jr., DE, Miami Jordyn Tyson, WR, Arizona State  Carnell Tate, WR, Ohio State  Arvell Reese, DE, Ohio State  Spencer Fano, OG, Utah  Caleb Downs, S, Ohio State  Peter Woods, DT, Clemson  Jermod McCoy, CB, Tennessee  Jeremiyah Love, RB, Notre Dame\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL combine: Dates, schedule, where to watch and top prospects - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/28/244185f9-c9dd-4724-8756-920a75fb00c9/thumbnail/1200x675/7ea9db011d003bd77faf539a1fc136e1/nfl-scouting-combine.jpg"
      ],
      "datePublished": "2026-02-11T16:53:19.000Z",
      "dateModified": "2026-02-11T16:53:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]