[
  {
    "title": "Oleksandr Usyk next fight: Unified heavyweight champ to face kickboxing legend in May - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/oleksandr-usyk-next-fight-rico-verhoeven-egypt-date/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/b5f8530f-dd59-46ad-801f-9125266332ca/thumbnail/1200x675/5176bf1dc038de1c0666485d21daa923/usyk.jpg",
    "tag": "Sports",
    "date": "2026-02-27T19:20:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Unified heavyweight champion Oleksandr Usyk (24-0-",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Unified heavyweight champion Oleksandr Usyk (24-0-0, 15 KOs) has dispatched most of the top heavyweights in boxing. His next challenge will come from the world of kickboxing on May 23 when he puts his WBC heavyweight title on the line against Rico Verhoeven (1-0-0, 1 KO). The fight will take place in front of the Pyramids of Giza in Egypt and will be broadcast by DAZN. Usyk's last six fights have been victories over the heavyweight division's three top challengers and former champions, as he's defeated Anthony Joshua, Tyson Fury and Daniel Dubois twice each. While Fury has resumed his career after a brief retirement and seems headed for a matchup with Joshua later this year, Usyk will look outside the traditional boxing rankings for his next fight. Verhoeven is a kickboxing legend, with a 66-10 career record in kickboxing, he has the longest heavyweight title reign in GLORY history, defending his title 13 times and has been the top-ranked kickboxing heavyweight in the world for more than a decade. His last loss came back in 2015, and he's looking to find a new challenge in the boxing ring. As a boxer, Verhoeven is extremely unproven. He has one professional boxing fight under his belt, a knockout victory over a winless Janos Finfera all the way back in 2014. For all his talents as a fighter, making the move from kickboxing to boxing is already difficult, much less doing so against the No. 2 pound-for-pound boxer in the world in Usyk. \nFor Usyk, this is the biggest fight he can make as he waits to see if Fabio Wardley can beat Dubois on May 9, which would move him up the heavyweight rankings into the top contender spot. Until then, Usyk needed a fight having not stepped in the ring since July 2025, and rather than go for a lower-ranked heavyweight, he opted for the intrigue of bringing Verhoeven into the boxing world. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oleksandr Usyk next fight: Unified heavyweight champ to face kickboxing legend in May - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/b5f8530f-dd59-46ad-801f-9125266332ca/thumbnail/1200x675/5176bf1dc038de1c0666485d21daa923/usyk.jpg"
      ],
      "datePublished": "2026-02-27T19:20:55.000Z",
      "dateModified": "2026-02-27T19:20:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons fire assistant coach LaTroy Lewis after sexual assault allegation surfaces - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-fire-assistant-defensive-line-coach-latroy-lewis/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/e7f73e74-686a-4373-a7b0-148d254ea59f/thumbnail/1200x675/2e0d86d48358a581d37cda094e0d7bf1/falconshelmet.png",
    "tag": "Sports",
    "date": "2026-02-27T19:50:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons have fired assistant defensive",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons have fired assistant defensive line coach LaTroy Lewis after allegations of sexual assault surfaced Friday morning. The team said in a statement Friday morning that it was \"aware of allegations regarding\" Lewis and was \"in the process of gathering information.\" Hours later, the Falcons announced that Lewis had been dismissed from his role. Lewis, 32, was hired by the Falcons under new coach Kevin Stefanski earlier this month after he was the defensive line coach at Toledo during the 2025 season. He previously spent multiple seasons as an assistant at Michigan. The sexual assault allegations stem from his time with the Wolverines, and the Ann Arbor Police Department confirmed to ESPN that it is investigating the claims against Lewis. After a college career at Tennessee, Lewis went undrafted in 2017 before having brief stints with the then-Oakland Raiders, Houston Texans and Tennessee Titans. His playing career ended following one season with the XFL's Houston Roughnecks in 2020. \nLewis broke into coaching at Akron in 2020 as a graduate assistant. He then spent one season at South Alabama and another at Wake Forest before joining then-Michigan coach Jim Harbaugh's staff at Michigan ahead of the 2023 season.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons fire assistant coach LaTroy Lewis after sexual assault allegation surfaces - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/e7f73e74-686a-4373-a7b0-148d254ea59f/thumbnail/1200x675/2e0d86d48358a581d37cda094e0d7bf1/falconshelmet.png"
      ],
      "datePublished": "2026-02-27T19:50:55.000Z",
      "dateModified": "2026-02-27T19:50:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC Fight Night predictions -- Brandon Moreno vs. Lone'er Kavanagh: Fight card, picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-predictions-card-odds-brandon-moreno-vs-loneer-kavanagh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/caf3c2ba-1e03-403a-858c-8d1682aea671/thumbnail/1200x675/59ac6370ec430ffb9ec319dc1bbca8d4/brandon-moreno-warmup-ufc.jpg",
    "tag": "Sports",
    "date": "2026-02-27T17:18:27.000Z",
    "description": "\n        Brandon Moreno is coming home. Moreno, the first Mexican UFC champion, returns to his home nation in the main event of UFC Fight Night on Sat",
    "body": "\n        Brandon Moreno is coming home. Moreno, the first Mexican UFC champion, returns to his home nation in the main event of UFC Fight Night on Saturday, emanating from Arena CDMX in Mexico City. The former two-time flyweight champ faces an unexpected opponent in short-notice replacement Lone'er Kavanagh.Moreno (23-8-2) has much at stake professionally and personally. Joshua Van's unusual ascension to flyweight champion presents new matchmaking opportunities. A win this weekend won't produce an immediate title shot, but could set him up for a title eliminator. Moreno's homecoming comes at a troubling time for the country. Violence has spread across parts of Mexico after the death of powerful  cartel leader Nemesio Ruben Oseguera Cervantes, commonly known as \"El  Mencho.\" Sign up for Paramount+ and Watch UFC Fight Night: Strickland vs. Hernandez for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription! Plans start as low as $8.99/month or $89.99/year!\"It has been really hard hours for my Mexican people,\" Moreno told CBS Sports' Brian Campbell. \"It's weird, man.  It's crazy because, right now, I'm super focused on my fight, but, at the  same time, I know that a lot of Mexican people are focused on this bad  moment. Maybe [the UFC Fight Night event] can be a nice moment for the  people to try to forget the bad moment and get some joy.\" \nKavanagh (9-1) has everything to gain and very little to lose. Kavanagh took the fight on three weeks' notice after Asu Almabayev fell to injury. The fight has many firsts for Kavanagh. It's his first UFC main event, his first five-round fight, his first time competing against a former champion, and his first time coming off a loss. Yet Kavanagh had no hesitation in accepting the bout.\n\"I want to look back on my life and see that I've done some cool stuff,\" Kavanagh said. \"The big thing for me is legacy, and this is a legendary moment, so I'm  looking forward to it. It just brings me one step closer to the title, and  that's what I want. I'm here to get to the top as quickly as I can, and  I'm looking to do whatever it takes to get there.\" Saturday's main card is Mexico vs. the world, with each fight featuring one Mexican fighter. There are three fighters, excluding the main event, that fans should keep a close eye on. Knockout artists David Martinez and Imanol Rodriguez are sizable favorites. Martinez, who fights former title challenger Marlon \"Chito\" Vera, is already a top 10 bantamweight after two UFC fights. Rodriguez makes his UFC debut after a thrilling KO on \"Contender Series.\" Lastly, CBS Sports 2024 Fight of the Year recipient Daniel Zellhuber looks to turn the corner against exciting veteran King Green.\nLet's take a look at the rest of the fight card with the latest odds from DraftKings before getting to a prediction and expert pick on the main event below.UFC Fight Night card, oddsFavoriteUnderdogWeightclassBrandon Moreno -218Lone'er Kavanagh +180FlyweightDavid Martinez -305  Marlon Vera +245  BantamweightDaniel Zellhuber -500King Green +380Lightweight  Edgar Chairez -325Felipe Bunes +260Flyweight  Imanol Rodriguez -455Kevin Borjas +350FlyweightSantiago Luna -625Angel Pacheco +455BantamweightUFC Fight Night viewing informationDate: Feb. 28 | Start time: 8 p.m. ETLocation: Arena CDMX -- Mexico CityStream: Paramount+ (subscribe now for as little as $8.99 per month)PredictionBrandon Moreno vs. Lone'er Kavanagh: I can't see Kavanagh going 25 minutes with Moreno. Props to Kavanagh for stepping up to the plate, but this is a severe mismatch. He doesn't have the experience required to compete with the former two-time champ in the totality of the game. Kavanagh should stick to his typical strong start. Three weeks is not enough time to revolutionize a gameplan. Kavanagh could look good in the first five to seven minutes, but that's when he'll start losing significant ground. Moreno's stellar movement and ability to mix things up will overwhelm Kavanagh in the middle rounds. Pick: Moreno via TKO, Round 2\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night predictions -- Brandon Moreno vs. Lone'er Kavanagh: Fight card, picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/caf3c2ba-1e03-403a-858c-8d1682aea671/thumbnail/1200x675/59ac6370ec430ffb9ec319dc1bbca8d4/brandon-moreno-warmup-ufc.jpg"
      ],
      "datePublished": "2026-02-27T17:18:27.000Z",
      "dateModified": "2026-02-27T17:18:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WNBA CBA updates: Players held testy meeting, agents ask for transparency, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/wnba-cba-updates-players-held-contentious-meeting-agents-sent-letter-asking-for-transparency-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/c7f13da8-9358-484d-8553-75224970295c/thumbnail/1200x675/70eaa6c443eb70d9fae8340439f17365/breanna-stewart-nneka-ogwumike-kennedy-burke-wnba.png",
    "tag": "Sports",
    "date": "2026-02-27T17:09:09.000Z",
    "description": "\n        Time is running out for the WNBA and the Women's National Basketball Players Association. Earlier this week, the league reportedly told the p",
    "body": "\n        Time is running out for the WNBA and the Women's National Basketball Players Association. Earlier this week, the league reportedly told the players that a new collective bargaining agreement must be in place by March 10 to avoid disrupting the 2026 season. It seems the rapidly approaching deadline is causing a stir. The WNBPA held a meeting on Tuesday that became contentious, according to Front Office Sports, while a group of powerful agents sent a letter to the union asking for more transparency about negotiations, per ESPN. A 'spirited' and 'passionate' meetingThe league and the WNBPA met Monday for a virtual bargaining session, and on Tuesday the union convened it's own virtual meeting to discuss the state of the negotiations and their path forward. Following the meeting, WNBPA executive director Terri Carmichael Jackson sent a letter to union members, which was obtained by FOS, that stated, \"last night's conversation was spirited, passionate, and at times tough.\" Jackson added, \"Honest debate is not division. It is engagement.\" \nNotably, the players are reportedly no longer aligned on whether or not to call a strike. In December, the union authorized the seven-player executive committee, led by president Nneka Ogwumike, to \"call a strike when necessary.\" Per the WNBPA, 93% of its members participated in that vote, and 98% voted in favor of authorizing a strike if necessary. Per FOS, some players have since changed their stance, though the exact breakdown is unclear. \nJackson's letter also explained that the union would send out a survey to its members to get feedback on the latest proposal from the league, which arrived on Feb. 20. The players have still not made a counter offer. Agents want 'transparency'On Thursday, a group of nearly a dozen powerful agents sent a letter to Jackson stating \"our collective preference for transparency and coordinated communication\" about the CBA negotiations, according to ESPN. \"At this stage of negotiations, with time being of the essence, alignment and shared information will best serve the players and the Union,\" the letter said.\nESPN confirmed that the following agents all signed the letter (notable players they represent in parentheses):Lindsay Kagawa Colas (Breanna Stewart, Paige Bueckers)Jade Li English (A'ja Wilson)Erin Kane (Caitlin Clark, Napheesa Collier)Gina Paradiso (Angel Reese)Boris Leilchinski (Dominique Malonga)Ticha Penicherio (Kayla McBride)\"Notably, there is an unprecedented level of unity among agents at this moment,\" the agent letter said. \"That alignment reflects a shared commitment to doing what is best for players and the long-term health of the league. We believe that same spirit of collaboration, utilizing all available expertise and resources, is how we should continue working together as a team.\"\n        \n            \n                WNBA CBA updates: League reportedly sets key deadline, WNBPA says revenue sharing was triggered in 2025\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nTime running outThe WNBA reportedly told players (and teams) on Monday that if a deal is not in place by March 10, the 2026 season will be disrupted. That leaves less than two weeks for the two sides to come to terms on a new CBA. At this point, however, the two sides still remain far apart on revenue sharing, which has been the primary point of contention throughout this process. \nThe WNBPA is fighting for a share of gross revenue, while the league is still offering a share of net revenue -- that is, the revenue remaining when league-specified operating expenses are removed from the pot.The WNBPA's most recent proposal would see the players receive an average of 27.5% of the gross revenue over the course of the agreement (with a $9.5 million salary cap in 2026), sources familiar with the negotiations confirmed to CBS Sports. The league's most recent prosposal would offer the players 70% of net revenue over the course of the deal (with a $5.65 million salary cap in 2026). Last month, the WNBA announced the full schedule for the 2026 season. Training camps are scheduled to begin on April 19, with preseason games to begin on April 25 and opening night set for May 8. \nWith less than two months until training camps are supposed to open, the two sides not only have to come to terms on a new CBA, but hold a double expansion draft for the Toronto Tempo and Portland Fire, conduct the busiest free agency period in league history and hold the annual college draft. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WNBA CBA updates: Players held testy meeting, agents ask for transparency, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/c7f13da8-9358-484d-8553-75224970295c/thumbnail/1200x675/70eaa6c443eb70d9fae8340439f17365/breanna-stewart-nneka-ogwumike-kennedy-burke-wnba.png"
      ],
      "datePublished": "2026-02-27T17:09:09.000Z",
      "dateModified": "2026-02-27T17:09:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will Diego Pavia get drafted? Vanderbilt QB defends his maturity at NFL combine - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/diego-pavia-maturity-nfl-draft-combine-vanderbilt-quarterback/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/b734bcb2-f1ea-4f52-b62a-3d4eb57eebfe/thumbnail/1200x675/2e6e7f7fc0a7f182640b8b7f51c5add4/gettyimages-2254538125-1.jpg",
    "tag": "Sports",
    "date": "2026-02-27T18:54:04.000Z",
    "description": "\n        Diego Pavia is one of the most polarizing prospects in the 2026 NFL Draft. On one hand, the former Vanderbilt star has the production and tra",
    "body": "\n        Diego Pavia is one of the most polarizing prospects in the 2026 NFL Draft. On one hand, the former Vanderbilt star has the production and track record that one would expect of an early-round pick. He never had a losing season as a starting quarterback at the collegiate level and was a 2025 Heisman Trophy finalist after throwing for an SEC-leading 29 touchdowns and rushing for 10 more scores. But Pavia does carry some significant question marks into the draft process. During multiple media availabilities at the NFL Scouting Combine on Friday, Pavia was pelted with questions about his maturity, an issue that often took the spotlight during his time with the Commodores. \"Yeah, [Vanderbilt] coach [Clark] Lea always preached that your frontal lobe isn't fully developed until you're 25,\" Pavia joked when fielding one question about his maturity. \"I just turned 24, so I got like 360 more days to go.\"\n        \n            \n                Renner's 2026 NFL Draft Big Board: Ranking the top 200 prospects as the NFL combine unfolds\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \nPavia's humor didn't deflect the deluge. NFL front offices have likely had similar questions to what Pavia has faced in his public appearances. \nHe issued an apology in December after facing backlash after a social media post that stated \"F-all the [Heisman] voters.\" He was also spotted at a club partying with a \"F--- Indiana\" sign in reaction to Indiana quarterback Fernando Mendoza, who beat Pavia for the Heisman before leading the Hoosiers to a national title. Pavia defended his reputation in an interview with CBS Sports by arguing that outsiders often confuse his confidence for arrogance. \"I want them to know, and the future teammates that I do have, that, game on the line, I got you. Don't worry about it,\" Pavia said. \"That's how I carry myself. I think people get caught up in my confidence for arrogance. But my confidence comes from my preparation of work that I put in in the offseason, the week of, just things like that. That's what boosts me to have that extra edge on Saturday.\"\nPavia is one of the most experienced quarterbacks in the 2026 draft class, something he can leverage in his interviews with NFL teams. He played two years at New Mexico Military Institute, two at New Mexico State and two at Vanderbilt. In that time, he amassed a 47-22 record while throwing for 12,899 yards and 114 touchdowns with 4,210 yards and 46 touchdowns rushing. \"I've seen a lot of football,\" Pavia said. \"I feel like I can process a defense really fast, get the ball where it needs to go, check us into good plays, stay out of bad plays. I feel like that's how you stay on schedule, that second-and-6, third-and-short, that's how you win football games.\"   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will Diego Pavia get drafted? Vanderbilt QB defends his maturity at NFL combine - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/b734bcb2-f1ea-4f52-b62a-3d4eb57eebfe/thumbnail/1200x675/2e6e7f7fc0a7f182640b8b7f51c5add4/gettyimages-2254538125-1.jpg"
      ],
      "datePublished": "2026-02-27T18:54:04.000Z",
      "dateModified": "2026-02-27T18:54:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Donald Trump to host White House roundtable on future of college athletics - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/president-donald-trump-white-house-meeting-college-athletics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/b6cbc256-1f47-4260-a1ba-d0f2e41a72a9/thumbnail/1200x675/7853756fb4572b24e36464353e106370/trump.jpg",
    "tag": "Sports",
    "date": "2026-02-27T16:25:18.000Z",
    "description": "\n        President Donald Trump will host a White House meeting next week with prominent figures from across the college sports landscape, a gathering",
    "body": "\n        President Donald Trump will host a White House meeting next week with prominent figures from across the college sports landscape, a gathering designed to address the future of an industry in flux, a source confirms to CBS Sports' Brandon Marcello. At least 35 people have been invited to what is being called the \"College Sports Roundtable,\" which is scheduled for 4 p.m. ET on March 6. It is unclear how many of those invited will ultimately attend.Trump will chair the discussion, while Florida Gov. Ron DeSantis and Randy Levine, president of the New York Yankees, are listed as vice chairs on an invitation list. The invite includes the four power conference commissioners: Jim Phillips (ACC), Brett Yormark (Big 12), Tony Petitti (Big Ten) and Greg Sankey (SEC). Gloria Nevarez, commissioner of the Mountain West, is also invited, as are university leaders and administrators from across the FBS, including Notre Dame athletic director Pete Bevacqua.Others on the invite list include former coaches Nick Saban, Mack Brown and Urban Meyer, former college athletes like Heisman Trophy winners Tim Tebow and Charlie Ward, NBA commissioner Adam Silver, golf star Tiger Woods and former Secretary of State Condoleezza Rice, who previously served on the College Football Playoff selection committee. Media executives from ESPN and Fox Sports are also invited.\n        \n            \n                Big Ten, SEC urge Congress to reject proposal that would consolidate FBS broadcasting rights\n                \n                    Brandon Marcello                \n            \n                            \n    \n                \n                    \n    \nBillionaire businessman Cody Campbell, chairman of Texas Tech's board of regents and a former college football player who has spearheaded a \"Saving College Sports\" campaign, is also included. Campbell has advocated for federal intervention in college athletics, including potential changes to antitrust protections and a reexamination of how conferences structure and sell media rights.\nThe meeting comes at a pivotal time for college sports. In recent years, court rulings have reshaped the NCAA's authority and accelerated the professionalization of the industry, particularly in the name, image and likeness marketplace. Schools are preparing for a revenue-sharing era while navigating a patchwork of state laws and ongoing legal challenges.Congress has held multiple hearings on NIL, athlete employment status and antitrust protection for the NCAA and conferences, but lawmakers have yet to advance comprehensive legislation. Trump signed an executive order last summer titled \"Saving College Sports,\" directing federal agencies to examine issues surrounding athlete classification and third-party NIL enforcement, though it produced no binding changes.\nAgainst that backdrop, the White House session is expected to touch on governance, athlete compensation, collective bargaining concepts and the federal government's potential role in stabilizing a system many leaders believe is at an inflection point. Whether a single afternoon meeting can produce consensus among stakeholders with competing visions remains unclear, but the guest list underscores the national scope -- and political weight -- of the debate.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Donald Trump to host White House roundtable on future of college athletics - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/b6cbc256-1f47-4260-a1ba-d0f2e41a72a9/thumbnail/1200x675/7853756fb4572b24e36464353e106370/trump.jpg"
      ],
      "datePublished": "2026-02-27T16:25:18.000Z",
      "dateModified": "2026-02-27T16:25:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fernando Mendoza explains what he wants to learn most from Tom Brady if he goes to Raiders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/fernando-mendoza-nfl-draft-raiders-tom-brady/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/cbde5605-b9f1-4ae0-ab00-a90fc744c1f8/thumbnail/1200x675/e851218a23095250803dc325e86da0d0/mendoza.jpg",
    "tag": "Sports",
    "date": "2026-02-27T16:08:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        When the 2026 NFL Draft begins in two months and t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        When the 2026 NFL Draft begins in two months and the Las Vegas Raiders are on the clock with the No. 1 overall pick, there isn't expected to be much mystery about who they'll be selecting. The Raiders are in desperate need of a quarterback, and Indiana's Fernando Mendoza is considered the clear QB1 in an otherwise shaky quarterback class. Mendoza is the heavy favorite to go first overall in April, and if that comes to fruition, he'll be tasked with leading a major turnaround in Las Vegas. While the Raiders and general manager John Spytek have a lot of work to do to provide Mendoza with the necessary support around him on the roster, one thing Mendoza would have is an all-time great as a mentor in Raiders minority owner Tom Brady. Mendoza sat down with CBS Sports' Aditi Kinkhabwala at the NFL Combine in Indianapolis and explained what he'd be most excited to learn from Brady if he ends up in Vegas. \n\"I would say his system and his discipline,\" Mendoza said. \"The way he has a system -- the TB12 Method. I've already read the book. Everything that he's all about is something that I've always emulated as a football player. And anything the coaching staff has as coaching points, like, 'Hey Fernando, we need you to get better at this, this and that,' I'm gonna be like, 'Hey Tom, how do I get better at this, this and that?' If I get selected by Mr. Spytek and the Raiders. If that does happen, it'd be a great opportunity. But any team I get drafted by, I look forward to utilizing their former quarterbacks as well.\" Mendoza understands that the separator at the quarterback position is preparation by being both mentally prepared in the film room and physically prepared by taking care of your body. It often takes young players some time to fully embrace the totality of that physical preparation. It's not just getting in the weight room, but also eating right and doing the necessary recovery work that allows you to have a long career. \nNo one did that better than Brady, and Mendoza wants to pick his brain about how to lay that foundation early in his career. From there, it seems clear Mendoza won't be shy in trying to learn as much on the field and in the film room as he can from Brady, noting the seven-time Super Bowl champion and current Raiders owner will be his first call when the Raiders' staff gives him things to improve on. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fernando Mendoza explains what he wants to learn most from Tom Brady if he goes to Raiders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/cbde5605-b9f1-4ae0-ab00-a90fc744c1f8/thumbnail/1200x675/e851218a23095250803dc325e86da0d0/mendoza.jpg"
      ],
      "datePublished": "2026-02-27T16:08:46.000Z",
      "dateModified": "2026-02-27T16:08:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Pickens contract: Cowboys officially place franchise tag on star WR - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/george-pickens-contract-cowboys-franchise-tag/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/df61e48c-ab42-45a3-9b89-ebfb022e94eb/thumbnail/1200x675/eec1ba3b373db60dde48fad515a12a75/george-pickens-getty.png",
    "tag": "Sports",
    "date": "2026-02-27T19:13:36.000Z",
    "description": "\n        The Dallas Cowboys officially placed the franchise tag on wide receiver George Pickens on Friday, a move that secures his rights through at l",
    "body": "\n        The Dallas Cowboys officially placed the franchise tag on wide receiver George Pickens on Friday, a move that secures his rights through at least the 2026 season. If he were to play on the tag in 2026, Pickens would make just over $27 million. A long-term deal between the two sides is also possible. \"We have nothing but respect and we love George and want him here. It's real important to us. I think George wants to be here,\" Cowboys executive vice president Stephen Jones told CBS Sports.Dallas used the non-exclusive franchise tag on Pickens, allowing him to negotiate with other teams when free agency begins on March 11. If Pickens signs an offer sheet with another team, the Cowboys would have five days to match. If the Cowboys do not match, they would be entitled to draft compensation. Jones described Pickens as an \"elite\" receiver and complimented his contributions to what he called some of the \"best offense\" the team has played. Jones acknowledged that Pickens would prefer to be under a long-term contract rather than play under the restrictions of the franchise tag. The Cowboys plan to \"continue to monitor\" the contract situation with Pickens, Jones said. \nThe Cowboys acquired Pickens, 24, from the Pittsburgh Steelers last offseason. He put together his best NFL season, catching 93 passes for 1,429 yards and nine touchdowns en route to his first Pro Bowl selection.Pickens said that he's searching for the \"ultimate best deal\" that benefits both parties, but it remains to be seen what that could be. The deadline to sign Pickens to a long-term deal is July 15.And just because the Cowboys tagged Pickens doesn't guarantee he will be on the roster in 2026. The Cowboys reportedly view tagging and trading Pickens away as a possibility, according to NFL Media, but the goal is to reach a new multi-year deal. \n\"I'm talking to George all the time by virtue of my excitement for him,\" Cowboys owner Jerry Jones said earlier this month of Pickens' future. \"He's better than, as far as what he contributed to our team, showing the potential that he could contribute. I'm looking forward to getting things worked out so George can be a Cowboy [for] a long time.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Pickens contract: Cowboys officially place franchise tag on star WR - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/df61e48c-ab42-45a3-9b89-ebfb022e94eb/thumbnail/1200x675/eec1ba3b373db60dde48fad515a12a75/george-pickens-getty.png"
      ],
      "datePublished": "2026-02-27T19:13:36.000Z",
      "dateModified": "2026-02-27T19:13:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon State fires longtime basketball coach Wayne Tinkle before Pac-12 relaunch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/oregon-state-fires-basketball-coach-wayne-tinkle-pac-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/f2699430-5947-45c9-bd28-dc7bbb2f48ce/thumbnail/1200x675/bb8bc8aebaa1d6dcc233cb869288db33/gettyimages-2209885765-1.jpg",
    "tag": "Sports",
    "date": "2026-02-27T17:27:37.000Z",
    "description": "\n        Oregon State men's basketball coach Wayne Tinkle will not return after the 2025-26 season, the school announced Thursday. Tinkle will coach t",
    "body": "\n        Oregon State men's basketball coach Wayne Tinkle will not return after the 2025-26 season, the school announced Thursday. Tinkle will coach the team for the remainder of the season, he told CBS Sports' Matt Norlander on Friday. Tinkle was given the option by athletic director Scott Barnes to step aside or remain with the team until its season ends. The Beavers, 16-14 overall and 9-8 in West Coast Conference play, will finish out the regular season on the road against Santa Clara on Saturday before conference tournament play begins next week. Tinkle's exit comes after a 12-year run with the Beavers that featured some of the program's highest highs and lowest lows. It also coincides with Oregon State's move from the WCC back into the Pac-12, which debuts as a reconstructed conference beginning next season.Oregon State never finished higher than fourth in the Pac-12 during Tinkle's decade in the conference and concluded its first year in the WCC with a fifth-place finish. Tinkle has a 175-204 overall record for his tenure, with an 82-141 mark in conference games\"We are grateful to Wayne for his dedication to Oregon State and for the leadership he has provided our men's basketball program,\" Oregon State athletic director Scott Barnes said in a statement. \"He has represented Beaver Nation with integrity and commitment. As we approach the dawn of the new Pac-12 era, we believe it is in the best interest of our men's basketball program to transition to its next chapter. These decisions are never easy, but we are focused on positioning our program for sustained success in a rapidly evolving collegiate athletics landscape.\"\nThe Tinkle era at Oregon State will be most remembered for the program's miraculous run to the 2021 Elite Eight. The Beavers entered the NCAA Tournament that season as a No. 12 seed and pulled off upsets of No. 5 Tennessee, No. 4 Oklahoma State and No. 8 Loyola Chicago before falling to No. 2 Houston. It was one of two NCAA Tournament appearances for the Beavers during Tinkle's 12 years at the helm.While the Beavers reached the postseason three times, including a trip to the College Basketball Crown last season, they also logged two of the worst seasons in program history under Tinkle's leadership. The year directly following the Elite Eight run, Oregon State went 3-28 and posted the worst winning percentage (.097) of any Beavers squad in 125 years. Tinkle also oversaw a 5-27 team in 2016-17.Oregon State making changes ahead of Pac-12 relaunchWhen the Pac-12 returns as a full conference this summer, Oregon State will be under new leadership in both football and men's basketball. The Beavers fired football coach Trent Bray midway through the 2025 season and hired Alabama co-offensive coordinator JaMarcus Shephard as his replacement.\nThe overhaul is part of the Beavers' efforts to establish themselves as top-tier contenders in the new-look league. Oregon State was long a bottom-half athletic department in the old Pac-12, but it enters the conference's new era as a potential leader across the board given its status as a recent Power Five member.\n        \n            \n                2026 Pac-12 football schedule: 'Flex week' provides unique advantage in College Football Playoff race\n                \n                    Carter Bahns                \n            \n                            \n    \n                \n                    \n    \nThe Pac-12 has the opportunity to thrive as a top-six basketball conference with the addition of Gonzaga as a basketball-only member, as well as prominent former Mountain West schools. For the 2026-27 basketball season, the Pac-12 will operate as a nine-member league featuring Boise State, Colorado State, Fresno State, Gonzaga, Oregon State, San Diego State, Texas State, Utah State and Washington State.It also projects as a potential Group of Six leader in football and could see its champion clinch a spot in the College Football Playoff on a regular basis.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon State fires longtime basketball coach Wayne Tinkle before Pac-12 relaunch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/f2699430-5947-45c9-bd28-dc7bbb2f48ce/thumbnail/1200x675/bb8bc8aebaa1d6dcc233cb869288db33/gettyimages-2209885765-1.jpg"
      ],
      "datePublished": "2026-02-27T17:27:37.000Z",
      "dateModified": "2026-02-27T17:27:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology Bubble Watch: Miami (Ohio) leads massive weekend for potential at-large teams - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-ncaa-tournament-bubble-watch-miami-ohio-march-madness/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/17071462-f364-4ed3-b63e-66e7c0ab47ed/thumbnail/1200x675/2315fead1214171307b8ca3c638d71c5/miami-bubble.png",
    "tag": "Sports",
    "date": "2026-02-27T15:57:49.000Z",
    "description": "\n        Miami (Ohio) faces Western Michigan on the road Friday night as the RedHawks seek to reach 29-0 in their quest to become the first college ba",
    "body": "\n        Miami (Ohio) faces Western Michigan on the road Friday night as the RedHawks seek to reach 29-0 in their quest to become the first college basketball team to finish the regular season undefeated since Gonzaga in 2020-21. Despite its gaudy record, Miami is still not a lock for the NCAA Tournament.The Redhawks are a No. 11 seed in CBS Sports' Bracketology entering the weekend because they are projected to receive the MAC's automatic bid. If Miami dropped a game at any point along the way and failed to win the MAC Tournament, its at-large credentials would be up for debate.With a solid No. 32 standing in the all-important Wins Above Bubble (WAB) metric, Miami is firmly in at-large territory for now. But even a single loss against MAC opposition would inflict significant damage on Miami's resume metrics. Without any Quad 1 victories to fall back upon and with just one Quad 2 victory, the Redhawks are attempting to thread a needle heading into Selection Sunday.\n        \n            \n                Bracketology: Michigan State's win at Purdue lifts Spartans in latest NCAA Tournament projection\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nTheir Friday showdown at Western Michigan is just one of over a dozen games with NCAA Tournament bubble implications this weekend. Here's the full rundown of the bubble picture and the bubble battles to watch entering the weekend.\nLast Four InCalSanta Clara TCUTexas A&MFirst Four OutNew MexicoOhio State Seton HallVCUNext Four OutIndianaStanfordUSCVirginia TechCheck out the CBS Sports Bracketology model's latest bracket at the Bracketology hub                                All times ET                  Bubble teams in action Friday\n                            \n    \n                                                \n                    \n    Miami (Ohio)at Western Michigan | 6 p.m. (CBS Sports Network)Entering the weekend: No. 11 seed (auto-bid)Game status: Quad 4The RedHawks are closing in on history, sitting just three games away from a perfect regular season. This trip to Western Michigan is the easiest remaining hurdle, but because it's a Quad 4 game, it could also be the costliest potential landmine. Even after a 28-0 start, Miami's NCAA Tournament hopes aren't completely solidified due to a lackluster schedule that has featured zero Quad 1 games and just one Quad 2 game. There is still room for a nightmare scenario in which a late-season stumble and MAC Tournament loss leave this team on the wrong side of the bubble.\nBubble teams in action Saturday\n                            \n    \n                                                \n                    \n    Seton Hallat UConn | 12 p.m. (FS1)Entering the weekend: First Four OutGame status: Quad 1Seton Hall has a lot of ground to make up, but beating UConn on the road would cover a nice chunk of it. This would be one of the 10 best victories posted by anyone in college basketball this season, and it would prove to the selection committee that the Pirates are worthy of a hard look. But if Seton Hall can't pull a mammoth upset, this will likely be the end of the road for the Pirates' at-large aspirations.\n                            \n    \n                                                \n                    \n    VCUvs. Fordham | 12:30 p.m. (USA)Entering the weekend: First Four OutGame status: Quad 4\nThe Rams are an interesting case study because the average of their resume metrics is hovering in the mid-40s. Generally speaking, that's fringe at-large territory. But there isn't a single victory a projected at-large team, and VCU is just 4-7 across the top two quadrants. Playing Fordham is a nothing-burger, but it gives VCU a chance to reset the vibes after more than a week off since a disappointing loss to Saint Louis. \n                            \n    \n                                                \n                    \n    Missouriat Mississippi State | 1 p.m. (SEC Network)Entering the weekend: No. 9 seedGame status: Quad 2Missouri is the perfect example of why you should like at WAB instead of NET. If all you saw was Missouri's No. 58 NET ranking, you might think the Tigers have no business in the at-large conversation. But with a highly respectable No. 35 WAB ranking, Mizzou is actually in decent shape. Coming off a win over Tennessee -- its fifth Quad 1 win -- Missouri would have to fall hard down the stretch to miss the dance. \n\n                            \n    \n                                                \n                    \n    Clemsonvs. Louisville | 2 p.m. (ESPN2)Entering the weekend: No. 9 seedGame status: Quad 1Four straight losses have dropped Clemson from the ACC title race into the bubble conversation. At 10-7 across Quads 1 and 2, the Tigers are still OK for now. But facing Louisville and North Carolina (Tuesday on the road) isn't the easiest way to get back on track. Clemson likely needs to win two of its final three games to feel good entering the ACC Tournament.\n                            \n    \n                                                \n                    \n    New Mexicovs. San Diego State | 2 p.m. (CBS)Entering the weekend: First Four OutGame status: Quad 2\nNew Mexico dropped onto the wrong side of the bubble following a 67-60 Quad 1 loss at Nevada on Tuesday. The Lobos are hovering around 50th in results-based metrics. They will likely need to be in the mid-40s come Selection Sunday to have a realistic chance at inclusion. Any way you slice it, closing the regular season with a win at Utah State would be huge. But evening the season series with San Diego State would keep the Lobos in position along the cut line.\n                            \n    \n                                                \n                    \n    San Diego Stateat New Mexico | 2 p.m. (CBS)Entering the weekend: No. 11 seed (auto-bid)Game status: Quad 1The Mountain West could get anywhere from 1 to 3 bids, depending on how things play out for San Diego State and New Mexico. The Aztecs are currently \"in\" the CBS Sports Bracketology field as the league's automatic bid recipient. But, from an at-large perspective, they are just 53rd in WAB and have work to do. This game is critical because it's the best game the Aztecs have left in the regular season.\n\n                            \n    \n                                                \n                    \n    UCLAat Minnesota | 2 p.m. (FS1)Entering the weekend: No. 9 seedGame status: Quad 1Coming off a blowout loss at Michigan State on Feb. 17, the Bruins had dropped three of five games and two straight by a combined margin of 53 points. Things appeared to be going south in a hurry. But consecutive victories over Illinois and USC have restored UCLA's tournament trajectory. If the Bruins win two of three down the stretch, they will likely head to the Big Ten Tournament in a strong position.\n                            \n    \n                                                \n                    \n    Georgiavs. South Carolina | 3:30 p.m. (SEC Network)Entering the weekend: No. 10 seedGame status: Quad 3Georgia is in good shape, but a loss here would change that. Falling at home to a bad South Carolina team would bring an estimated WAB hit of roughly 0.80, which would translate to a 5-7 spot drop in WAB ranking. That would put Georgia in the low-to-mid 40s, which is close to the likely cut line. But if the Bulldogs take care of business against a team they should beat, they'll head into the final week of the regular season on solid footing.\n\n                            \n    \n                                                \n                    \n    USCvs. Nebraska | 4 p.m. (Big Ten Network)Entering the weekend: Next Four OutGame status: Quad 1It might feel like USC is a lost cause amid a four-game losing streak. But the Trojans have consecutive Quad 1 opportunities ahead, starting Saturday against Nebraska. If they close on a three-game winning streak -- or win 2 of 3 and get some favorable results from other bubble teams -- they could still head to the Big Ten Tournament with some at-large pulse. Pulling that off is going to require some rapid improvement, though, because this team is flunking the eye test.\n                            \n    \n                                                \n                    \n    Californiavs. Pitt | 4 p.m. (ACC Network)Entering the weekend: Last Four InGame status: Quad 3\nPlaying lowly Pitt at home is nothing but a landmine for Cal. It's a no-reward, high-risk proposition, and the Bears better be ready. With wins over four projected tournament teams (UCLA, North Carolina, Miami and SMU), Cal is looking good from a resume perspective. That would change quickly if the Bears slip up against the Panthers.\n                            \n    \n                                                \n                    \n    Texasat Texas A&M | 4 p.m. (ESPN2)Entering the weekend: No. 10 seedGame status: Quad 1Texas had Florida on the ropes until the final seven minutes on Wednesday. That's when the Gators mashed the gas pedal, showing their elite gear and leaving the Longhorns in the dust. Missing out on a potential resume-defining win was a bummer. Still, Texas should have no problem flushing that and getting up for Texas A&M. After losing its first meeting with the Aggies at home back on Jan. 17, Texas will be out for revenge in a high-intensity \"double bubble\" battle.  \n\n                            \n    \n                                                \n                    \n    Texas A&Mvs. Texas | 4 p.m. (ESPN2)Entering the weekend: Last Four InGame status: Quad 2Seeing Bucky McMillan's high-octane system back in the NCAA Tournament would be entertaining. Remember, his Samford team took Kansas down to the wire during a 2024 first-round game. Now in his first season with the Aggies, McMillan has more talent. But he still needs a couple more wins to feel safe after A&M struggled through a four-game losing skid to open February. \n                            \n    \n                                                \n                    \n    TCUat Kansas State | 6:30 p.m. (ESPN2)Entering the weekend: Last Four InGame status: Quad 2TCU has won five of its past six games to reach 18-10 (8-7 Big 12) heading into the weekend. The Horned Frogs own a resume that is all over the map. It includes wins over Florida, Wisconsin and Iowa State but losses to Notre Dame, Utah and Colorado. The demonstrated ability to beat high-caliber opposition bodes well for Jamie Dixon's club in the selection discussion, but the Horned Frogs need to win two of three down the stretch.\n                            \n    \n                                                \n                    \n    Santa Claravs. Oregon State | 8 p.m. (CBS Sports Network)Entering the weekend: Last Four InGame status: Quad 4Santa Clara lost at home to Gonzaga on Feb. 14 and fell at Saint Mary's on Wednesday. The Gaels needed to win one of those two games to feel safe-ish. Now they have to take care of business against Oregon State and then gear up for a potentially tense WCC Tournament. Beating the Zags or Gaels on a neutral floor would be significant for a Santa Clara team that is 1-5 in Quad 1.\n                            \n    \n                                                \n                    \n    Auburnvs. Ole Miss | 8:30 p.m. (SEC Network)Entering the weekend: No. 10 seedGame status: Quad 3Generally speaking, a Quad 3 game this time of year is nothing but a needless risk for a team on the bubble. But in Auburn's case, hosting Ole Miss could be viewed as a welcome reprieve. After a stretch of six losses in seven games, Auburn just needs wins. Ole Miss is limping in on a 10-game losing streak, which should allow the Tigers to regain their footing.\n                            \n    \n                                                \n                    \n    Virginia Techat North Carolina | 8:30 p.m. (ESPN2)Entering the weekend: Next Four OutGame status: Quad 1Virginia Tech fans who have seen their team drop four of its past six games might wonder why the Hokies are still showing up in a bubble watch. But beating North Carolina on the road would send Virginia Tech surging back toward the cut line, as it would bring a projected 5-8 spot rise in WAB ranking for the Hokies. A season-ending road game at Virginia is also a big opportunity. It'll take a big upset or two, but the Hokies aren't dead yet.\n                            \n    \n                                                \n                    \n    Saint Mary'svs. Gonzaga | 10:30 p.m. (ESPN)Entering the weekend: No. 10 seedGame status: Quad 1Saint Mary's averages out as a top-30 team across both results-based and predictive metrics looked at by the selection committee. But while the Gaels are 8-1 in Quad 2, they remain winless in Quad 1. Wednesday night's 86-67 home win over Santa Clara was the best win of the season for the Gaels, which is a little concerning. Toppling Gonzaga one last time before the Bulldogs leave for the Pac-12 would make for some great insurance. Bubble teams in action Sunday\n                            \n    \n                                                \n                    \n    Ohio Statevs. No. 8 Purdue | 1:30 p.m. (CBS)Entering the weekend: First Four OutGame status: Quad 1Ohio State got second-leading scorer John Mobley Jr. back from a three-game injury absence, but the Buckeyes looked flat anyway during a 74-57 loss at Iowa on Wednesday. That was the Buckeyes' last chance to beat an at-large team in a true road environment, and they flunked it. Hosting Purdue marks Ohio State's last guaranteed opportunity to make any sort of statement.\n                            \n    \n                                                \n                    \n    Indianavs. No. 13 Michigan State | 3:45 p.m. (ESPN)Entering the weekend: Next Four OutGame status: Quad 1Indiana's combined total of four victories across Quad 1 and Quad 2 is the fewest of any high-major team in the top 60 of the NET. That's the bad news. The good news is that IU has wins over projected tournament teams Purdue, UCLA and Wisconsin. There are several different ways to interpret this resume, but the Hoosiers desperately need to stop the bleeding after dropping three straight.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology Bubble Watch: Miami (Ohio) leads massive weekend for potential at-large teams - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/17071462-f364-4ed3-b63e-66e7c0ab47ed/thumbnail/1200x675/2315fead1214171307b8ca3c638d71c5/miami-bubble.png"
      ],
      "datePublished": "2026-02-27T15:57:49.000Z",
      "dateModified": "2026-02-27T15:57:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL combine 2026 results: Full list of measurements and 40 times - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/2026-nfl-combine-results-full-list-measurements-40-times/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/ae5c8051-61b4-420a-bc25-f569005f6017/thumbnail/1200x675/5a1825841cc4d23ed32e162472523c6d/nfl-combine.jpg",
    "tag": "Sports",
    "date": "2026-02-27T20:12:32.000Z",
    "description": "\n\n\n    \n                                    Official measurements and testing numbers by position, updated throughout combine week in Indianapolis\n   ",
    "body": "\n\n\n    \n                                    Official measurements and testing numbers by position, updated throughout combine week in Indianapolis\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 27, 2026\n                            \n                    at\n    3:12 pm ET\n                        \n                •\n            \n            8 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        INDIANAPOLIS -- It's Friday of NFL combine week, which means prospect measurements and on-field workouts are officially in full swing. The schedule is as follows:Friday: TE and DBSaturday: QB, RB and WRSunday: OLIn the morning, players log official measurements, including height, weight, wingspan, arm length and hand size. In the afternoon, they participate in on-field testing -- including the 40-yard dash, vertical and broad jumps, and bench press -- before wrapping up with positional drills inside Lucas Oil Stadium.The festivities kicked off Thursday with defensive linemen, edge rushers and linebackers. Much of the day's discussion centered on Rueben Bain Jr.'s historically short arms, but once workouts began, attention shifted to the top prospects not named Bain, who elected not to work out. (Other top prospects to sit out included Peter Woods, Akheem Mesidor and CJ Allen.)Ohio State EDGE Arvell Reese -- the No. 3 prospect in CBS Sports draft analyst Mike Renner's rankings -- performed like a bona fide top-five pick, as did Ohio State LB Sonny Styles (No. 10) and Texas Tech EDGE David Bailey (No. 19).Now attention turns to defensive backs and tight ends on Friday. While Tennessee's Jermod McCoy and LSU's Mansoor Delane -- two of Renner's top three cornerbacks in this class -- will not participate, expect other first-round talents like Ohio State's Caleb Downs (No. 7), Clemson's Avieon Terrell (No. 11) and Oregon's Kenyon Sadiq (No. 29) to showcase their unique skill sets.As combine week rolls along, we've got you covered with every official measurement and testing number as they come in from Indianapolis.\nCB measurementsPlayerSchoolHeightWeightHandArmWingspanJermod McCoyTennessee6-0 ¾188931 ¼77Avieon TerrellClemson5-10 ¾1868 ⅝3175 ½Mansoor DelaneLSU5-11 ¾1878 ⅞3074 ½Colton HoodTennessee5-11 ⅝193931 ⅜74 ⅞Keith AbneyArizona State5-101879 ⅝30--Chris JohnsonSan Diego State6-01939 ⅞30 ⅝--D'Angelo PondsIndiana5-8 ⅝1829 ⅝29 ⅜72 ¼Keionte ScottMiami (FL)5-11 ¼1939 ⅝31 ⅜76 ⅝Brandon CisseSouth Carolina5-11 ¾1898 ⅝30 ⅝75 ⅞Devin MooreFlorida6-3 ¼1988 ⅝31 ⅝76 ⅞Julian NealArkansas6-22039 ¾32 ⅝--Will LeeTexas A&M6-1 ½189932 ⅝--Malik MuhammadTexas6-01829 ⅞32 ⅜--Davison IgbinosunOhio State6-21899 ⅛32 ⅞--Daylen EveretteGeorgia6-11969 ⅝31 ⅞--Chandler RiversDuke5-9 ½1859 ¾29 ⅜--Hezekiah MassesCalifornia6-11798 ¼31 ⅛--TJ HallIowa6-11899 ½30--Domani JacksonAlabama6-11949 ⅛31 ⅛--Tacario DavisWashington6-3 ⅞1949 ¼33 ⅜80 ⅞Thaddeus DixonNorth Carolina6-11951031 ⅛--Ephesians PrysockWashington6-3 ⅜1969 ⅝33 ⅛80 ½Charles DemmingsStephen F. Austin6-119310 ⅛32--Jaylon GuilbeauTexas5-111909 ¼30 ⅛--Andre FullerToledo6-12009 ⅜30 ⅝--Jadon CanadyOregon5-10 ½1819 ¼30--Collin WrightStanford6-01888 ¾30 ⅝--Toriano PrideMissouri5-101859 ¼31--Ahmari HarveyGeorgia Tech5-111859 ⅜30 ⅜--Latrell McCutchinHouston6-21918 ⅝31 ¼--Avery SmithToledo5-10 ½1968 ⅜29 ⅜--Marcus AllenNorth Carolina6-21878 ½32 ⅛--CB measurement takeawaysIt was always known that D'Angelo Ponds is undersized, historically speaking, but now there are official numbers to it (5-foot-8 ⅝, 182 pounds). His play on the field has been fantastic, and that will ultimately determine where teams take him in April. Antoine Winfield Jr. (a second-round pick in 2020) is one player with similar measurements who has gone on to find success. Ponds also has an acceptable wingspan of 72 ¼ inches, which, as Mike Renner notes, is longer than DT Byron Murphy II, CB Donte Jackson and CB Roger McCreary, and nearly identical to CB Trent McDuffie. None of those players were drafted later than No. 55 overall.S measurementsPlayerSchoolHeightWeightHandArmWingspanCaleb DownsOhio State5-11 ⅝2069 ½30 ¼73 ¼Emmanuel McNeil-WarrenToledo6-3 ½2019 ¼32 ⅛78 ¼Dillon ThienemanOregon6-0 ⅛201931 ⅜78 ⅛Genesis SmithArizona6-2 ⅛2028 ⅞32 ½79 ¼A.J. HaulcyLSU6-02159 ¼30 ⅞--Treydan StukesArizona6-11908 ½31 ¾--Zakee WheatleyPenn State6-32039 ½31--Kamari RamseyUSC6-02029 ¼30 ⅝--Robert Spears-JenningsOklahoma6-220510 ⅜32 ½--Bud ClarkTCU6-0188931 ½--Bishop FitzgeraldUSC5-112019 ½31 ¼--VJ PayneKansas State6-32069 ½33 ¾--Michael TaaffeTexas6-01909 ⅜29 ¼--Louis MooreIndiana5-111919 ⅞29 ½--Lorenzo StylesOhio State6-0 ½1949 ½31 ⅝--Jakobe ThomasMiami6-1 ¼21110 ⅝31 ⅞76Jalon KilgoreSouth Carolina6-12109 ⅜32 ⅞--Xavier NwankpaIowa6-2 ¼2088 ¼30 ¾--DeShon SingletonNebraska6-32051032 ⅞--Jalen HuskeyMaryland6-119610 ¼30 ⅞--Ahmaad MosesSMU5-91969 ⅛30 ¼--Dalton JohnsonArizona5-111929 ⅛30 ⅞--TE measurementsPlayerSchoolHeightWeightHandArmWingspanKenyon SadiqOregon6-3 ⅛2411031 ½78 ¼Michael TriggBaylor6-3 ¾24010 ½34 ¼84 ⅜Eli StowersVanderbilt6-3 ¾2399 ⅝32 ⅝79 ¾Nate BoerkircherTexas A&M6-5 ½24510 ½32 ⅝--Max KlareOhio State6-4 ⅜2469 ⅛32 ⅛77 ⅞Josh CuevasAlabama--2459 ⅝30 ⅝--Jack EndriesTexas--2459 ⅝31 ⅛--Eli RaridonNotre Dame--24510 ¾32 ¾--Will KacmarekOhio State6-5 ½2619 ⅝32 ¼--Oscar DelpGeorgia--2459 ½31 ⅝--Joe RoyerCincinnati--24710 ¾31 ½--Dallen BentleyUtah--2539 ¼33 ⅛--Marlin KleinMichigan--2489 ¼32 ⅜--Justin JolyNC State6-3 ½24110 ½32 ¼--Sam RoushStanford6-62671030 ⅝76 ⅜Dae'Quan WrightOle Miss--2469 ¼32 ¼--Tanner KoziolHouston6-6 ½2479 ⅝33 ¾--John Michael GyllenborgWyoming--2491031--Miles KitselmanTennessee--2519 ⅞31 ⅞--Bauer SharpLSU--2499 ⅝31 ¾--Matthew HibnerSMU--2519 ⅜32 ⅜--DJ RogersTCU--2589 ½33 ⅝--Lake McReeUSC--2439 ¼31 ½--Riley NowakowskiIndiana--2508 ¾31 ½--RJ MarylandSMU--236932 ¼--Jaren KanakOklahoma--2349 ⅜30 ½--Khalil DinkinsPenn State--2519 ½33 ¼--EDGE measurementsPlayerSchoolHeightWeightHandArmWingspanRueben Bain Jr.Miami6-2 ¼2639⅛30⅞77⅜Arvell ReeseOhio State6-4 ⅛2419½32½79½David BaileyTexas Tech6-3 ½25110¼33⅝79⅝Cashius HowellTexas A&M6-2 ½2539¼30¼74¼Akheem MesidorMiami6-32591032⅛78⅝R Mason ThomasOklahoma6-2 ¼2418⅞31⅝78⅛T.J. ParkerClemson6-3 ½2639½33⅛79Anthony LucasUSC6-5 ½25610¼33⅜--Malachi LawrenceUCF6-42539¼33⅝--Gabe JacasIllinois6-42601033--Joshua JosephsTennessee6-32421034¼--Zion YoungMissouri6-62629½33--Romello HeightTexas Tech6-32399½32¼--Keyron CrawfordAuburn6-4253932--Derrick MooreMichigan6-42559⅛33⅜--Dani Dennis-SuttonPenn State6-625610⅛33⅜--Nadame TuckerWestern Michigan6-2247931⅜--Tyreak SappFlorida6-22739½32--Wesley WilliamsDuke6-42569½31⅞--Caden CurryOhio State6-32579⅜30⅛--Quintayvious HutchinsBoston College6-32339½32⅝--Trey MooreTexas6-224310½31⅝--Vincent Anthony Jr.Duke6-62581034⅛--Logan FanoUtah6-52579⅜31⅜--Max LlewellynIowa6-6258932¼--George Gumbs Jr.Florida6-4245933⅝--Patrick PaytonLSU6-52601033⅜--Aidan HubbardNorthwestern6-4 ⅝2609⅛32--Jack PyburnLSU6-42581030⅞--Marvin Jones Jr.Oklahoma6-52459¼33⅛--Nyjalik KellyUCF6-525610⅜35⅛--Mason ReigerWisconsin6-525110⅜32⅝--EDGE measurement takeawaysConcernsWe knew Rueben Bain Jr.'s arms were going to measure short, but his 30⅞-inch arms rank as the fourth-shortest among edge rushers since 1999, per MockDraftable. His 77⅜-inch wingspan isn't ideal, either; only 19 edge rushers in the MockDraftable database (since 1999) have measured shorter. Bain will still be a first-round pick -- likely in the top 10 — but teams with strict length thresholds could be wary of those numbers.Cashius Howell, Mike Renner's No. 24 prospect in this class, has even shorter arms than Bain at 30¼ inches -- the shortest of any edge rusher since 1999, per MockDraftable. However, the reigning SEC Defensive Player of the Year doesn't believe his historically short arms will prevent him from being productive in the NFL. \"Those are just the cards that I've been dealt,\" Howell said during Wednesday's podium session. \"I'm going to do everything in my power to perfect my technique and perfect my craft in whatever way possible.\"\n        \n            \n                Can star Miami edge rusher Rueben Bain Jr. overcome physical limitations?\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nEDGE testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Rueben Bain Jr.Miami (FL)------------Arvell ReeseOhio State4.461.58--------David BaileyTexas Tech4.501.623510-9----Cashius HowellTexas A&M4.591.5832.59-7----Akheem MesidorMiami (FL)------------R Mason ThomasOklahoma4.671.63--------T.J. ParkerClemson4.681.613410-0----Anthony LucasUSC------------Malachi LawrenceUCF4.521.594010-10----Gabe JacasIllinois------------Joshua JosephsTennessee------------Zion YoungMissouri------------Romello HeightTexas Tech4.641.633910-5----Keyron CrawfordAuburn------------Derrick MooreMichigan------------Dani Dennis-SuttonPenn State4.631.6339.510-116.90--Nadame TuckerWestern Michigan4.731.6333.59-11----Tyreak SappFlorida------------Wesley WilliamsDuke4.891.6835.510-0----Caden CurryOhio State------------Quintayvious HutchinsBoston College4.741.7337------Trey MooreTexas4.541.6038.510-0--4.43Vincent Anthony Jr.Duke4.841.6732.510-3----Logan FanoUtah------------Max LlewellynIowa4.811.6432.59-7----George GumbsFlorida4.661.674110-17.00--Patrick PaytonLSU------------Aidan HubbardNorthwestern------------Jack PyburnLSU------------Marvin Jones Jr.Oklahoma4.691.65--------Nyjalik KellyUCF4.881.69379-11----Mason ReigerWisconsin4.781.614010-5----DL measurementsPlayerSchoolHeightWeightHandArmWingspanPeter WoodsClemson6-2 ½2989⅛31¼76⅝Lee HunterTexas Tech6-3 ½3189¼33¼80⅝Kayden McDonaldOhio State6-2 ⅛3269⅝32¼78⅛Keldric FaulkAuburn6-5 ⅞2769¾34⅜82¼Christen MillerGeorgia6-3 ¾321103380⅛Caleb BanksFlorida6-6 ¼32710⅞3585¾Jaishawn BarhamMichigan6-3 ½24010¼34⅛--Chris McClellanMissouri6-43131134--Rayshaun BennyMichigan6-32989¼33⅜--Domonique OrangeIowa State6-232210¼33⅜--Dontae CorleoneCincinnati6-0 ⅝3409½31⅞--Nick BarrettSouth Carolina6-33121033⅜--Darrell Jackson Jr.Florida State6-5 ⅝3151134¾--LT OvertonAlabama6-327410⅝33¼--Kaleb ProctorSoutheastern Louisiana6-22919½33--Tim KeenanAlabama6-13278⅝30½--Zxavian HarrisOle Miss6-83301034⅝--Skyler Gill-HowardTexas Tech6-12809¼30⅝--Gracen HaltonOklahoma6-2 ⅝2931031⅛77¾DeMonte CapehartClemson6-531310¼33⅞--Albert RegisTexas A&M6-12959⅝31⅝--Tyler OnyedimTexas A&M6-3 ½29210⅛34⅛--Bryson EasonTennessee6-23231033⅛--David GustaKentucky6-23081031⅛--Brandon ClevelandNC State6-33079¼32⅜--Zane DurantPenn State6-129010⅝31⅞--Damonic WilliamsOklahoma6-23051033⅛--Gary Smith IIIUCLA6-13199⅝32⅝--Cameron BallArkansas6-43109½33--Bobby Jamison-TravisAuburn6-33289⅝34¼--Deven EasternMinnesota6-53151034--Jackie MarshallBaylor6-2 ½2939½32--DL measurement takeawaysWinnersFlorida's Caleb Banks is having a heck of a pre-draft process after being limited to just three games last season because of a broken foot. He reminded everyone of his NFL potential with a strong showing at the Senior Bowl, then followed that up with impressive combine measurables, including an 85¾-inch wingspan — the longest among combine defensive tackles since 1999. He also posted 98th percentile height (6-foot-6 ¼), 89th percentile weight (327 pounds), 94th percentile hand size (10⅞ inches) and 94th percentile arm length (35 inches). Banks has a good chance to go in the back half of Round 1.\nFlorida State's Darrell Jackson Jr. has 11-inch hands, tied for the largest at the combine since at least 2014.ConcernsClemson's Peter Woods entered the 2025 season as a potential top-five pick, but an inconsistent fall -- despite earning first-team All-ACC honors -- pushed him out of that conversation. While Woods remains a first-round talent, some of his measurables disappointed, including fourth-percentile arm length (31¼ inches) and 10th-percentile wingspan (76⅜ inches). Woods also did not participate in on-field drills at the combine. He'll look to show off his skill set at Clemson's pro day on March 12.DL testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Peter WoodsClemson------------Lee HunterTexas Tech5.181.7921.58-4----Kayden McDonaldOhio State------------Keldric FaulkAuburn359-9----Christen MillerGeorgia------------Caleb BanksFlorida5.051.76329-6----Jaishawn BarhamMichigan4.641.613310-3----Chris McClellanMissouri5.051.8029.59-0----Rayshaun BennyMichigan------------Domonique OrangeIowa State------------Dontay CorleoneCincinnati------------Nick BarrettSouth Carolina5.101.7031.59-0--4.91Darrell Jackson Jr.Florida State------------LT OvertonAlabama4.871.70--------Kaleb ProctorSE Louisiana4.791.69339-5--4.71Tim KeenanAlabama5.311.84308-4----Zxavian HarrisOle Miss------------Skyler Gill-HowardTexas Tech------------Gracen HaltonOklahoma4.821.7036.59-6--4.79DeMonte CapehartClemson4.851.7233.58-11----Albert RegisTexas A&M4.881.72349-8--4.85Tyler OnyedimTexas A&M----329-3--Bryson EasonTennessee5.091.7830.59-4--5.00Brandon ClevelandNC State5.121.78--------David GustaKentucky4.881.6832------Zane DurantPenn State4.751.6633.59-4----Damonic WilliamsOklahoma------------Gary Smith IIIUCLA----28------Cameron BallArkansas5.131.79329-1--4.76Bobby Jamison-TravisAuburn------------Deven EasternMinnesota----27.59-4----Jackie MarshallBaylor4.881.69------4.68\n        \n            \n                NFL combine 2026: Grades for top DL/EDGE prospects, plus other standouts from on-field workouts\n                \n                    Josh Edwards                \n            \n                            \n    \n                \n                    \n    \nLB measurementsPlayerSchoolHeightWeightHandArmWingspanSonny StylesOhio State6-52441032⅞80⅞Anthony HillTexas6-22389⅝32⅜79Jake GoldayCincinnati6-4 ½2399½31⅞76⅞Josiah TrotterMissouri6-223710¼32¼--CJ AllenGeorgia6-0 ¾23010⅛31½75½Kyle LouisPittsburgh6-02209½31¼--Jacob RodriguezTexas Tech6-12319¼30⅞--Lander BartonUtah6-52339½32¼--Harold Perkins Jr.LSU6-12238⅛31⅜--Red MurdockBuffalo6-223210⅜31--Keyshaun ElliottArizona State6-22319¼31¼--Deontae LawsonAlabama6-32269¼31⅞--Bryce BoettcherOregon6-1233930⅝--Taurean YorkTexas A&M5-112268⅜30--Jimmy RolderMichigan6-2 ½2389⅝30½--Aiden FisherIndiana6-12329½31⅛--Wade WoodazClemson6-32361032⅝--Jack KellyBYU6-22409⅛31⅛--Kaleb Elarms-OrrTCU6-2234931½--Scooby WilliamsTexas A&M6-22319¼32--Justin JeffersonAlabama6-02231031⅝--Xavian SoreyArkansas6-22289⅝31⅝--Namdi ObiazorTCU6-322910½30⅝--Owen HeineckeOklahoma6-1 ½2279⅝30⅛--Kendal DanielsOklahoma6-52429½32⅝--Eric GentryUSC6-722110½35--Karson ShararIowa6-1 ⅝23110⅛31⅛--Wesley BissaintheMiami6-22259⅝31⅞--LB testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Sonny StylesOhio State4.461.5643.511-2Anthony HillTexas4.511.583710-5Jake GoldayCincinnati4.621.603910-5Josiah TrotterMissouri----CJ AllenGeorgia----Kyle LouisPittsburgh4.531.5839.510-9Jacob RodriguezTexas Tech4.571.6038.510-1Lander BartonUtah----Harold Perkins Jr.LSU----Red MurdockBuffalo----Keyshaun ElliottArizona State----3810-5Deontae LawsonAlabama----Bryce BoettcherOregon----Taurean YorkTexas A&M----Jimmy RolderMichigan----369-11Aiden FisherIndiana----Wade WoodazClemson----Jack KellyBYU4.571.613710-5Kaleb Elarms-OrrTCU4.471.594010-4Scooby WilliamsTexas A&M----Justin JeffersonAlabama4.571.6038.510-5Xavian SoreyArkansas4.631.6637.510Namdi ObiazorTCU4.531.56379-11Owen HeineckeOklahoma4.621.6234.59-11Kendal DanielsOklahoma----Eric GentryUSC----Karson ShararIowa4.561.594010-3Wesley BissaintheMiami--\n        \n            \n                NFL combine 2026: Grades for top LB prospects, plus other standouts from on-field workouts\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nFriday: TE and DB measurements and testing numbersResults will be added here as testing begins.Saturday: QB, RB and WR measurements and testing numbersResults will be added here as testing begins.\nSunday: OL measurements and testing numbersResults will be added here as testing begins.\n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL combine 2026 results: Full list of measurements and 40 times - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/ae5c8051-61b4-420a-bc25-f569005f6017/thumbnail/1200x675/5a1825841cc4d23ed32e162472523c6d/nfl-combine.jpg"
      ],
      "datePublished": "2026-02-27T20:12:32.000Z",
      "dateModified": "2026-02-27T20:12:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Thunder-Nuggets, Michigan-Illinois on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-draftkings-promo-code-to-get-200-bonus-bets-thunder-nuggets-michigan-illinois-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg",
    "tag": "Sports",
    "date": "2026-02-27T15:52:04.000Z",
    "description": "\n        Shai Gilgeous-Alexander makes his return for the Oklahoma City Thunder, the perfect time to claim the current DraftKings promo code, which gi",
    "body": "\n        Shai Gilgeous-Alexander makes his return for the Oklahoma City Thunder, the perfect time to claim the current DraftKings promo code, which gives new users $200 in bonus bets if your first $5+ bet wins. Gilgeous-Alexander has missed the last nine games with an abdominal strain, but the Thunder still went 5-4 without him and are 45-15 on the season. The SportsLine Projection Model is picking the Thunder to cover as 7.5-point favorites as one of its Friday best bets at DraftKings. The model is also backing Over 220.5 total points scored for Knicks vs. Bucks for Friday NBA best bets. One of SportsLine's top experts has also locked in a college basketball pick in a top 10 Big Ten showdown between No. 3 Michigan and No. 10 Illinois at 8 p.m. ET. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5+ bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model entered Week 19 on a sizzling 38-18 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookKnicks vs. Bucks: Over 220.5 total points (-108)Illinois (+120) to defeat Michigan Thunder (-7.5) vs. Nuggets (-118)Combining the three picks into a Friday parlay at DraftKings would result in a payout of +682 (risk $100 to win $682, odds subject to change). Bet it at DraftKings here:Knicks vs. Bucks: Over 220.5 total points (-108)The Knicks are coming off one of their worst scoring performances of the season, posting 94 points against the Cavaliers, but the four other times they've been held to less than 100 points, New York scored at least 110 points the following contest. Expect the Knicks to want to erase that performance, and with the Knicks having a top-10 scoring offense (117.2 points per game, ninth), that's likely to happen. Meanwhile, the Bucks' offense has been rolling lately even without Giannis Antetokounmpo (calf). Milwaukee has scored at least 118 points in three of its last four games. The Over has cashed in three of the last four Bucks games, and the model projects the Over to hit in 67.5% of simulations. Back the Over at DraftKings here:Illinois (+120) to defeat Michigan\"Illinois has had all week to stew over blowing a 23-point lead in an overtime loss at UCLA last Saturday. So while Michigan had a bit of a palate-cleanser from the Duke game with its win against Minnesota at home, I think the Illini are going to be breathing fire,\" SportsLine expert Chip Patterson said. \"Then there's the matchup, which has Illinois with a notable advantage in the backcourt (Keaton Wagler and Kylan Boswell over Elliot Cadaeu and Nimari Burnett) and comparable size to handle Michigan's 6-9, 6-9, 7-3 jumbo-sized front-court. Plus, there's a sneaky series edge here because while Michigan might eye Ohio State or Michigan State as its primary rivals, Illinois has won nine straight against the Wolverines, a streak that dates back to Jan. 2019.\" Back Illinois to win at DraftKings here:Thunder (-7.5) vs. Nuggets (-118)Shai Gilgeous-Alexander is back for the Thunder after missing nine games with an abdominal strain, and although they played well without him, going 5-4, his return takes them to a new level. SGA is the reigning NBA MVP on the reigning NBA champions, and Oklahoma City has the No. 1 score differential (+11.4 ppg) largely due to his court presence. Gilgeous-Alexander is second in the NBA in scoring at 31.8 ppg this year. The Thunder are home on Friday, where OKC is 24-6 overall this season. The Nuggets have lost six of their last 10 games, including a 121-111 loss to the Thunder in Denver where SGA scored 34 points. The model projects the Thunder to cover in 59% of simulations. Back the Thunder to cover at DraftKings here:Want more NBA and college basketball picks on Friday?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including the NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Thunder-Nuggets, Michigan-Illinois on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg"
      ],
      "datePublished": "2026-02-27T15:52:04.000Z",
      "dateModified": "2026-02-27T15:52:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Finn Balor knows his 'days are numbered' after watching AJ Styles retire - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/finn-balor-aj-styles-retirement-wwe-elimination-chamber/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/cdebfaf4-ab5c-48b5-affd-c852da415c95/thumbnail/1200x675/1c507705e30cc2c7f5bf03243c3fc74e/finn-balor-demon-aj-styles-tlc-wwe-elimination-chamber-smackdown-cm-punk-cbs-sports-pro-wrestling-feb-26-2026-v2.jpg",
    "tag": "Sports",
    "date": "2026-02-27T19:28:34.000Z",
    "description": "\n        Professional wrestling is obsessed with singular achievements, especially during WrestleMania season. Superstars chase their \"WrestleMania mo",
    "body": "\n        Professional wrestling is obsessed with singular achievements, especially during WrestleMania season. Superstars chase their \"WrestleMania moment\" and strive to \"finish the story.\" Finn Balor doesn't see it that way. For him, every accomplishment is a thread in a much grander body of work.  This year marks 25 years since Balor's wrestling debut. He may not look it, but he's long in the tooth. The milestone hit harder when his longtime friend and colleague AJ Styles retired ahead of his WWE Hall of Fame induction.\"Seeing AJ retire got me thinking about a lot of things,\" Balor told CBS Sports before Saturday's WWE Elimination Chamber. \"I've always  looked up to AJ. I've always chased his coattails, so to speak. He's  always been the benchmark for what we all strive to be. Seeing him  retire brought it home to me that my days are numbered. AJ has been an  ever-present for me for the last 25 years.\"  Balor will challenge world heavyweight champion CM Punk at Elimination Chamber. The title isn't the only thing at stake. The winner will defend it against Roman Reigns in the main event of WrestleMania 42. Balor is one pinfall away from righting a wrong and securing what many consider the biggest match of his career.  \n\"I have this massive stain on my career from 10 years ago when I got hurt and had to relinquish the universal championship,\" Balor said. \"I've been asked about that in every interview for 10 years. This whole 'what if.'\"Balor couldn't have scripted a better main roster start. In 2016, he defeated Roman Reigns, Kevin Owens and two others in the same night to earn a universal championship match. He became the first person to win a WWE world title in his debut pay-per-view match by dethroning Seth Rollins at SummerSlam. He also suffered a torn labrum that night. His first and only WWE world title reign lasted 22 hours.For 10 years, Balor has revisited that moment in nearly every interview. People remain fixated on what could have been. Since vacating the universal championship, he's won multiple intercontinental and tag team titles, reclaimed the NXT championship and captured the United States title. None of it has erased the stain of that lone world title run.  \n\"It's not like I haven't been trying, but for some reason, people can't  get these 'what ifs' out of their heads,\" Balor said. \"The only way  to fix that is by becoming world champion again.\"  \nBalor might not live in the main event, but he's a constant presence on television. That consistency isn't complacency. It's the product of a drive that's endured for 25 years, regardless of where he's slotted on the card. Headlining Elimination Chamber, and potentially WrestleMania, matters. It just isn't new fuel.\"You can't define your legacy over one match in Belfast, or one moment in Barclays Center, where I got hurt. It's  based on a 25-year career,\" Balor explained. \"It's a body of work that I'm trying to  present. If you look at my body of work, I think it's pretty  accomplished. Sure, I haven't won the world title in 10 years. How many  people have won the Best of the Super Juniors? How many have dominated  in Japan, been successful in Mexico, Europe, and WWE for 10 years?\n\"I try not to worry too much about  feelings in the moment. I try to zoom out and look at the 25 years. Am I  happy with the 25 years? Yes. Has being in the main event reignited a  spark that may have extinguished? No, because the spark never  extinguished. I've always had this burning desire to perform. If that's  in the first match or the last match, once I'm performing, that's what's  important.\"Elimination Chamber isn't about retribution. It's another entry into a rich codex.\"Am I happy with my career?\" Balor asked. \"I would have been happy having one match. My goal when I started training was to have one match. Everything after that was a bonus. Coming to WWE was the most far-fetched idea for a small kid from Ireland. There were no wrestling schools. There was no industry. Nothing.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Finn Balor knows his 'days are numbered' after watching AJ Styles retire - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/cdebfaf4-ab5c-48b5-affd-c852da415c95/thumbnail/1200x675/1c507705e30cc2c7f5bf03243c3fc74e/finn-balor-demon-aj-styles-tlc-wwe-elimination-chamber-smackdown-cm-punk-cbs-sports-pro-wrestling-feb-26-2026-v2.jpg"
      ],
      "datePublished": "2026-02-27T19:28:34.000Z",
      "dateModified": "2026-02-27T19:28:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking all 32 NFL coaches from 2025 based on their leaked NFLPA report card grade - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ranking-all-32-nfl-coaches-nflpa-report-cards/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/433e105a-2846-4280-9e81-011d5346b8a5/thumbnail/1200x675/bcdc22df498902b1d74ea168f0a8a2fb/usatsi-27891099-1.jpg",
    "tag": "Sports",
    "date": "2026-02-27T15:50:24.000Z",
    "description": "\n        The NFLPA report cards are out, and although the NFL doesn't want you to see them, they are now available after being leaked to ESPN this wee",
    "body": "\n        The NFLPA report cards are out, and although the NFL doesn't want you to see them, they are now available after being leaked to ESPN this week. The grades on the report cards are based on a survey that's handed out to players each year. For the most recent season, the NFLPA had 1,759 players rate their team in 17 different categories. One of the most interesting parts of this survey is that it allows each player to anonymously rate their head coach, so you can get an idea of how well a coach relates to his players. With that in mind, we're going to take a look at how each coach graded out. Remember, these grades are based on the 2025 season, so there are several coaches on this list who ended up getting fired. The highest grade handed out was an A+, which went to two different coaches. On the other hand, the lowest grade handed out was a C-, which went to one coach and not surprisingly, that coach was eventually fired. \n        \n            \n                Agent's Take: Which path will Lamar Jackson take for a new Ravens deal? Josh Allen's or Dak Prescott's?\n                \n                    Joel Corry                \n            \n                            \n    \n                \n                    \n    \nHere are the grades for each coach: Grade: A+Coaches: Rams coach Sean McVay, Commanders coach Dan Quinn Notes: Last year, there were a total of six coaches who earned an A+, but this year, that number has been chopped down to two and Quinn is the ONLY coach in the NFL to earn an A+ in both years. Despite the Commanders' struggles in 2025, he clearly never lost the locker room. \nGrade: ACoaches: Bears coach Ben Johnson, Lions coach Dan Campbell, Vikings coach Kevin O'Connell, Eagles coach Nick Sirianni, Seahawks Mike Macdonald, Chiefs coach Andy Reid, Patriots coach Mike Vrabel, Jets coach Aaron Glenn, Steelers coach Mike TomlinNotes: Both Super Bowl coaches landed in this category, which tells you how important it is to have a head coach who can relate to his players. It's also worth noting that eight of the nine coaches in this group have been to the playoffs at least once in the past two seasons and five of the nine have been to at least a conference title game. Mike Tomlin might want to save this grade because it shows that he went out on top. Tomlin was widely viewed as the ultimate player's coach and he was clearly still well-liked after 19 years on the job. The biggest surprise name here is probably Aaron Glenn. Despite a 3-14 record, the Jets first-year coach still graded out highly, which could bode well for his second-year on the job. Grade: A-Coaches: Panthers coach Dave Canales, Cowboys coach Brian Schottenheimer, Texans coach DeMeco Ryans, Saints coach Kellen Moore, 49ers coach Kyle Shanahan, Bills coach Sean McDermott, Bengals coach Zac Taylor, Colts coach Shane Steichen, Jaguars coach Liam Coen\nNotes: Sean McDermott was a popular guy in Buffalo when he got fired, but he still lost his job. and that's because Bills owner Terry Pegula didn't feel like McDermott could take the team to the \"next level.\" Joe Brady will be replacing McDermott and if you're wondering how the players feel about him, he also was given an A- (Offensive coordinators were also graded out, which is why we know how Brady did). One name that might surprise some people here is Zac Taylor. The Bengals locker room clearly still approves of the job he's doing and that could be something that leads to a rebound in 2026. Grade: B+Coaches: Cardinals coach Jonathan Gannon, Falcons coach Raheem Morris Notes: Apparently, this is the grade that no coach should want. Both Morris and Gannon were fired following the 2025 season. Grade: BCoaches: Ravens coach John Harbaugh, Broncos coach Sean Payton, Dolphins coach Mike McDaniel, Buccaneers coach Todd Bowles \nNotes: This is an interesting group, because you have two coaches who were fired (McDaniel, Harbaugh), one coach who led his team to a conference title game (Payton) and one coach who has won his division in three of the past four years (Bowles). The most surprising name here though, is probably Payton. After turning the Broncos around, you'd think that Payton would have a hire approval rate with the players in Denver, but apparently, that's not the case. Worst gradesWe're going to lump the final six coaches together since they landed the worst grades. B-: Packers coach Matt LaFleur, Titans coach Brian Callahan/Mike McCoy C+: Raiders coach Pete Carroll, Chargers coach Jim Harbaugh C: Giants coach Brian Daboll/Mike Kafka C-: Browns coach Kevin Stefanski\nOut of the coaches who landed in this group, four of the six got fired. That means two of them didn't get fired. The first one is Matt LaFleur, who's future in Green Bay was up in the air before he eventually signed an extension in late January. It would be interesting to know how his team feels about the extension considering his grade was so low. The biggest surprise in this group is probably Jim Harbaugh. On one hand, he's an old-school coach and it's possible his coaching philosophy doesn't translate well with younger players, which might explain his low grade. On the other hand, his coaching style works and he has the track record to prove it. In two seasons on the job, he's led the Chargers to two playoff appearances. Harbaugh earned a B+ last year during his first season on the job, but took a tumble this year. The coaches that landed the two worst grades this year both got fired (Daboll, Stefanski). It will be interesting to see if Stefanski's grade goes up at all in Atlanta, because he'll be replacing a coach in Morris who earned an A+ last year and a B+ this year. \nOne interesting thing about the report cards is that they almost didn't come out this year. The NFL filed a grievance against the NFLPA over the report cards back in August and the league actually won. Due to victory, the ruling stated that the results of the report cards would no longer be made public, but they still leaked out anyway. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking all 32 NFL coaches from 2025 based on their leaked NFLPA report card grade - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/433e105a-2846-4280-9e81-011d5346b8a5/thumbnail/1200x675/bcdc22df498902b1d74ea168f0a8a2fb/usatsi-27891099-1.jpg"
      ],
      "datePublished": "2026-02-27T15:50:24.000Z",
      "dateModified": "2026-02-27T15:50:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Hornets are no joke: How Charlotte is pushing for a playoff return with jaw-dropping stats - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/hornets-no-joke-charlotte-playoff-return-jaw-dropping-stats/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/9f4795dd-973a-4a12-8752-6b019c18508e/thumbnail/1200x675/c7a24ffe99d72a84db959944f7ac91c9/lamelo-ball-getty-4.png",
    "tag": "Sports",
    "date": "2026-02-27T16:03:22.000Z",
    "description": "\n        The Charlotte Hornets laid a 133-109 beating on the Indiana Pacers on Thursday night. On Tuesday they beat the Bulls 131-99. All told the Hor",
    "body": "\n        The Charlotte Hornets laid a 133-109 beating on the Indiana Pacers on Thursday night. On Tuesday they beat the Bulls 131-99. All told the Hornets have won 10 games this season by at least 20 points. Only four teams -- the Thunder, Knicks, Celtics and Rockets -- have done so more times. Consider that Charlotte has only won 29 games this year. Which is to say, one out of every three of its victories has been by at least 20 points. That is crazy. And it's reflected in an even crazier number: 16.9. That is the Hornets' average margin of victory this season, and per CBS Sports research, it ranks fourth all-time in the NBA.TeamAvg Win MarginWin Percentage2025-26 Thunder+18.1.7501970-71 Bucks+17.5.8052024-25 Thunder+17.3.8292025-26 Hornets+16.9.4832021-22 Celtics+16.9.622As you can see, and as expected for teams blowing opponents out to this degree, all of these teams are/were elite units. The 2024-25 Thunder and that 1971 Bucks squad won the championship. The 2021-22 Celtics made the Finals. This year's Thunder have the best record in the league. The Hornets would seem to have no business in a group like this. But here they are. They might not win a lot of games (at least not until the last month), but when they do, they pretty regularly destroy teams. On Jan. 10, the Hornets blasted the Jazz by 55 points for the league's most lopsided single-game margin this season. Just shy of two weeks after that, the Hornets began what is their current run of 13 wins in their last 16 games. Over that span, they have -- without question -- been one of the best teams in the league. JAN. 22 - FEB. 26League RankOFF RTG (121.1)1st3P% (40.8)1stFT% (85.0)1stREB% (55.6)1stO-REB% (37.8)2ndNET RTG (+9.2)2ndPT DIFF (+10.9)3rdThere are a couple ways to look at what's going on in Charlotte. One, we're making too big a deal over a 29-31 team that is clinging to the last Eastern Conference's last play-in spot. Or two, we're not making a big enough deal. I'm firmly in the latter camp. I've come to sort of despise the word \"fun\" as one of the suddenly preferred adjectives in NBA parlance, but in the case of these Hornets, I can't think of a better description. Everything about them is a blast. Play-by-play man Eric Collins is GEEKED from the opening tip. At first, Collins's WWE enthusiam at the halfway point of the first quarter was pretty tough for me to deal with. For a while I was actually muting Hornets games just to watch in peace. But I'm in full-fever now, and Collins only adds to the excitement. I've flipped on everything. Earlier in the season, I ranted on LaMelo's one-legged 3s. Now, I can't get enough of the guy. Ball has long been one of the most=skilled players in the world, but it always felt like he was more a showman than a winning player. Maybe that was wrong to slap that label on him. Maybe he's just never been able to stay healthy. Maybe he's just never had a team like this to pay off his pace and passing and overall mastery of a possession. He's only averaging 19 and 7 on a downright bad 40% shooting, but the \"losing player\" case is getting harder to make. Ball makes everything go. The Hornets decline by 14.5 points per 100 possessions when he sits, per Cleaning the Glass. Again, it sounds weird to be speaking of a 40% shooter and a 29-31 team like they're setting the NBA on fire, and sure, there's some relativity as it relates to praising the efforts of a much-maligned mixtape player and a franchise that hasn't been to the playoffs in a decade (and hasn't won a series since 2001), but there's really something happening here. Back on Jan. 5, the Hornets beat the Thunder, who were pretty much full strength and 30-6 at the time, by 27 points. In that game, the Hornets started Ball, Knueppel, Brandon Miller, Miles Bridges and Moussa Diabaté. That is the starting five the Hornets have continued with whenever possible (Miller missed basically the first month of the season; Bridges and Diabaté were each suspended four games for the fight with Detroit in early February), and over 257 minutes, this group has obliterated opponents by 29.5 points per 100 possessions with a 136.8 offensive rating. Those are both the best marks in the league among five-man lineups that have played at least 100 minutes together, per NBA.com. Offensively, no other lineup is close. Second-best is a small-sample Miami unit that registers more than 14 points per 100 possessions worse. Ball, Miller and Knueppel combined for 81 points and 17 3-pointers on Thursday. \nThese three are a great story both collectively and individually. Ball was about to be written off. Miller was the No. 2 overall pick in 2023 when plenty of people laughed at Charlotte for not taking Scoot Henderson, who is nowhere near the player Miller, who's averaging just under 21 PPG this season, has been to this point. And then there is the rookie Knueppel, who at 20 years old might already be the best shooter in the league not named Stephen Curry. That might sounds like hyperbole, but it's not. On Thursday, he broke Keegan Murray's rookie record for 3-pointers in a season with this his 207th. \nAll told, Knueppel is shooting better than 43% from 3 on nearly eight attempts per game. Only five players in history have maintained that percentage on that volume while appearing in at least 50 games: Curry (4x), Klay Thompson (2x), Ray Allen, Duncan Robinson and Zach LaVine. Knueppel, who is tracking to make nearly 300 3s this year (something also only five players have ever done), would be the sixth. Put this all together and you can see why the Hive is buzzing. These Hornets are no joke. If you're a casual NBA fan still thinking of this team as a doormat, it's high time you update your basketball browser and start praying the Bucks don't screw this up and jump the them for the last play-in spot. We need this team in the postseason. So everyone can see what all the fuss is about. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Hornets are no joke: How Charlotte is pushing for a playoff return with jaw-dropping stats - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/9f4795dd-973a-4a12-8752-6b019c18508e/thumbnail/1200x675/c7a24ffe99d72a84db959944f7ac91c9/lamelo-ball-getty-4.png"
      ],
      "datePublished": "2026-02-27T16:03:22.000Z",
      "dateModified": "2026-02-27T16:03:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]