[
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing Blue Jays-Dodgers Over, Pistons, Trail Blazers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-betmgm-bonus-code-cbssports-150-bonus-blue-jays-dodgers-pistons-trail-blazers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-29T19:54:13.000Z",
    "description": "\n        Wednesday marks another great opportunity to take advantage of the latest BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets b",
    "body": "\n        Wednesday marks another great opportunity to take advantage of the latest BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins as a new user. The 2025 World Series continues with a pivotal Game 5 matchup between the Los Angeles Dodgers and Toronto Blue Jays at 8 p.m. ET. There are 10 games set to unfold in the NBA, including Magic vs. Pistons at 7 p.m. ET and Trail Blazers vs. Jazz at 9 p.m. ET.Picks from all three of those games are among our MLB and NBA best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every MLB game 10,000 times. It enters the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anybody following its MLB betting or NBA betting picks at sportsbooks and on betting sites could have seen strong returns.Wednesday's best bets at BetMGMOver 8 runs in Dodgers vs. Blue Jays (-110) Pistons +1.5 vs. Magic (-110)Trail Blazers -3.5 vs. Jazz (-105)Combining these three picks into a Wedneday MLB and NBA parlay at BetMGM would result in a payout of +611 (risk $100 to win $611). Bet it at BetMGM here:\nOver 8 runs in Dodgers vs. Blue Jays (-110)\"The Blue Jays are not blinking in this World Series as the normal Dodger intimidation games don't seem to be working. Toronto could easily have won these last two games at Chavez Ravine as the Jays have blocked out he Dodger Stadium factor, and LA can't be quite as comfy with Blake Snell on the mound after he was roughed up in Game One,\" legendary handicapper Bruce Marshall said. \"Meanwhile, John Schneider is confident he can get five or so innings from Trey Yesevage, though the Blue Jays bullpen is again going to be asked to do some heavy lifting. Three of the four games already in this series have reached at least eight runs.\" Back the Over at BetMGM Sportsbook now:Pistons +1.5 vs. Magic (-110)After a 30-win improvement last season, the Pistons have their sights set on contending in the East. Meanwhile, the Magic had a similarly transcendent 47-win season two years ago, but followed it up with a disappointing 41-win campaign last year. Both teams have underwhelmed a little bit early, with Detroit off to a 2-2 start and Orlando sitting at 1-3. However, the Pistons did win and cover as 2-point favorites at home in January and the model predicts that they cover in 59% of simulations on Wednesday. Back the Pistons at BetMGM Sportsbook now:Trail Blazers -3.5 vs. Jazz (-105)\"We're still figuring out how Phoenix was able to force OT at Utah on Monday. In the end all was well as the Jazz recovered for a 138-134 win helped greatly by 51 points from F Lauri Markkanen, who's had a blazing start to the season as Utah tries to build a fortress out of the Delta Center. Yet we've also been impressed by the Blazers, who don't look like they're missing suspended HC Chauncey Billups one bit,\" Marshall said. \"Portland getting All-Star like production from F Deni Avdija (23.5 ppg), while Jerami Grant (22.5 ppg) looks like Sixth Man of the Year candidate, and vet G Jrue Holiday (17.8 ppg) proving he's still got some petrol in his tank.\" Back the Trail Blazers at BetMGM Sportsbook now:\nWant more NBA picks for this week?You've seen some of the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every NBA game on the schedule, all from the model that's simulated every game 10,000 times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing Blue Jays-Dodgers Over, Pistons, Trail Blazers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-29T19:54:13.000Z",
      "dateModified": "2025-10-29T19:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. Cavaliers odds, picks, best bets, NBA predictions for Wednesday from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-cavaliers-prediction-odds-line-2025-nba-picks-october-29-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/102a6ada-f055-4fd4-a944-3d9f56462f48/thumbnail/1200x675/1ad9f3ea63e352eee247179e457bcd9a/jaylen-brown-boston-celtics-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-29T20:00:42.000Z",
    "description": "\n        The top two seeds from last year's Eastern Conference will meet on Wednesday's NBA schedule as the Cleveland Cavaliers visit the Boston Celti",
    "body": "\n        The top two seeds from last year's Eastern Conference will meet on Wednesday's NBA schedule as the Cleveland Cavaliers visit the Boston Celtics. Cleveland (3-1) had the East's best record at 64-18 a year ago before bowing out in the second round of the playoffs. Boston (1-3) was the No. 2 seed and was also eliminated in the second round of the postseason. These teams have alternated wins and losses over their last six regular-season meetings, with the Cavs prevailing in the most recent matchup..Tipoff is at 7 p.m. ET from TD Garden in Boston. Cleveland is a 3.5-point favorite in the latest Cavaliers vs. Celtics odds, while the over/under for total points scored is 234.5. Before locking in any Celtics vs. Cavaliers picks, make sure to check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven-plus seasons. The model enters Week 2 of the 2025-26 NBA season on a sizzling 161-120 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Celtics vs. Cavaliers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Cavaliers vs. Celtics:Celtics vs. Cavaliers  spreadCleveland -3.5 at DraftKings SportsbookCeltics vs. Cavaliers    over/under234.5 pointsCeltics vs. Cavaliers   money lineCleveland -170, Boston +142Celtics vs. Cavaliers    picksSee picks at SportsLineCeltics vs. Cavaliers   streamingFubo (Try for free)Why the Cavaliers can coverCleveland is coming off its most impressive game of the young season, a 21-point road victory over a Pistons team that made the playoffs last year. Donovan Mitchell led the way with 35 points on just 18 field goal attempts as all five starters were in double digits. Reigning Defensive Player of the Year, Evan Mobley, had 15 points, 11 rebounds, 5 assists and 3 blocks, while fellow big man, Jarrett Allen, had 20 points.The Cavs had the league's No. 1 offensive rating a year ago, while this season the team ranks in the top seven on the other end of the court in both defensive rating and points allowed per game. The Cavaliers are jumping in passing lanes, ranking third in steals, and they've forced opponents into the second-most turnovers per game. Losing possessions to turnovers could be an issue for Boston as it struggles to score in the possessions it does have, as the Celtics rank 25th in 3-point percentage despite ranking second in 3-point attempts. See which team to back at SportsLine.Why the Celtics can coverLast season Boston was second in points allowed per game, and even with various departures and injuries, the team still ranks second in points allowed this year. The team is holding opponents to an NBA-low of 39.9% from the field, and it is also in the top five in terms of 3-point defense. In their first win of the year on Monday versus New Orleans, the Celtics kept the Pelicans to just 90 points after the team had scored at least 116 in each of its first two games.Boston had a well-balanced attack in that win over New Orleans, with the starters combining for 65 points and the reserves chipping in with 57 points. Anfernee Simons had 25 points off the bench, while Jaylen Brown (probable, hamstring) is embracing the role of being the team's go-to player. He's putting up 26 points per game on 50% shooting from the field and 48% from beyond the arc. Even though Boston remains without Jayson Tatum (Achilles), the Cavs are even more banged-up without Darius Garland (toe), Max Strus (foot) and Sam Merrill (hip). See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Cavaliers vs. Celtics picksSportsLine's model has simulated Celtics vs. Cavaliers and is leaning Under the total, projecting 229 combined points. The model also says one side of the spread hits almost 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Cavs vs. Celtics, and which side of the spread hits almost 70% of the time? Visit SportsLine now to see which side of the Celtics vs. Cavs spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. Cavaliers odds, picks, best bets, NBA predictions for Wednesday from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/102a6ada-f055-4fd4-a944-3d9f56462f48/thumbnail/1200x675/1ad9f3ea63e352eee247179e457bcd9a/jaylen-brown-boston-celtics-imagn-images.jpg"
      ],
      "datePublished": "2025-10-29T20:00:42.000Z",
      "dateModified": "2025-10-29T20:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Blue Jays, Suns, Mavericks on Wednesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-blue-jays-suns-mavericks-wednesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-29T19:35:23.000Z",
    "description": "\n        The Toronto Blue Jays evened the series against the Los Angeles Dodgers last night, and now the two teams will square off in Game 5 of the 20",
    "body": "\n        The Toronto Blue Jays evened the series against the Los Angeles Dodgers last night, and now the two teams will square off in Game 5 of the 2025 World Series, providing another great opportunity to use the latest bet365 bonus code CBSBET365, offering new users $200 in bonus bets after placing a first wager of $5 or more. Wednesday's sports schedule also features 10 NBA games, including Pacers vs. Mavericks (8:30 p.m. ET) and Suns vs. Grizzlies (10 p.m. ET).SportsLine's proven computer model is backing the Blue Jays to upset the Dodgers once again and is also targeting the Mavericks and Suns for its Wednesday best bets. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. It is on a sizzling 43-28 run on top-rated picks dating back to 2024. Additionally, the model is up well over $10,000 for $100 players on top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also enters the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. Anybody following its NBA betting picks, MLB betting picks and NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Wednesday's top picks, best betsBlue Jays money line vs. Dodgers (+170)Mavericks (-6) vs. PacersSuns money line vs. Grizzlies (+105)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +956 (risk $100 to win $956). Bet it at bet365 here:\nBlue Jays money line vs. Dodgers (+170) Toronto went toe-to-toe with Los Angeles for 18 innings on Monday night before eventually losing on a Freddie Freeman home run, and the Blue Jays responded with an impressive 6-2 win on Tuesday. Vladimir Guerrero Jr. hit a two-run homer off Dodgers star pitcher Shohei Ohtani to give Toronto a 2-1 lead in the third inning. The Blue Jays racked up 11 total hits in the game while holding the Dodgers to six hits. Toronto rookie pitcher Trey Yesavage has not allowed more than two earned runs in five of his seven starts this season, while Dodgers starter Blake Snell gave up five earned runs in Game 1. The model has Toronto winning in 47% of simulations, providing clear value at +170. Bet it at bet365 here:  Mavericks -6 vs. PacersIndiana is off to a 0-3 start this season and is playing on the road for the third straight game. The Pacers are also dealing with multiple key injuries, including point guard Tyrese Haliburton (Achilles), shooting guard Benedict Mathurin (foot), point guard Andrew Nembhard (shoulder), point guard T.J. McConnell (hamstring) and forward Obi Toppin (foot). This leaves Indiana at a significant disadvantage against Dallas, which picked up a 139-129 win over Toronto on Sunday. The Mavericks are covering the spread in 69% of simulations on Wednesday. Bet it at bet365 here:Suns money line vs. Grizzlies (+105)Phoenix will be happy to return home following a three-game road trip, especially since the Suns opened the season with a 120-116 win at home over the Kings. Guard Collin Gillespie scored 34 points and dished out 19 assists in 74 minutes off the bench during the three-game road trip, including 15 points, 13 assists and three steals against Utah on Monday. Memphis is playing without Zach Edey, Brandon Clarke, Ty Jerome and Scotty Pippen Jr., so the model has Phoenix winning 63% of the time. Bet it at bet365 here:\nLooking for Week 9 NFL picks?You've seen the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Blue Jays, Suns, Mavericks on Wednesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-29T19:35:23.000Z",
      "dateModified": "2025-10-29T19:35:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ed Orgeron open to LSU return, reflects on Brian Kelly firing, SEC coaching vacancies - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ed-orgeron-lsu-brian-kelly-fired-sec-coaching-search/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/5c8aca8b-02c8-4f63-b9c2-c965c102cfb3/thumbnail/1200x675/08f6afa7e9f797426b43f3f75739caba/ed-orgeron.jpg",
    "tag": "Sports",
    "date": "2025-10-29T19:11:36.000Z",
    "description": "\n        As LSU football begins another coaching search, a familiar voice from the program's past made it clear he is ready for a return. Ed Orgeron, ",
    "body": "\n        As LSU football begins another coaching search, a familiar voice from the program's past made it clear he is ready for a return. Ed Orgeron, who led the Tigers to a national title six seasons ago, said he would \"love to\" return to Baton Rouge following the firing of Brian Kelly.\"Are you kidding me? I'm one phone call away,\" Orgeron said on Wednesday on Unsportsmanlike Radio. \"I just gotta get in my truck, I could be there today.\"LSU dismissed Kelly Sunday after a 5-3 start to the 2025 season, ending a polarizing tenure that produced back-to-back 10-win campaigns but fell short of championship expectations. His inability to fully connect with the culture of Louisiana is believed to have played a role in his downfall.Orgeron, a Louisiana native who spent six seasons as coach LSU, understands that connection as well as anyone. On Wednesday, he emphasized that any future Tigers coach must embrace the unique culture that surrounds the program.\n\"When they meet with the candidate, is this the person that can handle the pressures of LSU and embrace the state of Lousiana?\" Orgeron said. \"I think that's one of the things, whether that's true or not, it looked from the outside Brian Kelly never embraced the state of Louisiana. And when you get those guys on your side, it's very powerful.\"Among the candidates reportedly linked to the LSU opening is current Ole Miss coach Lane Kiffin, a longtime colleague of Orgeron's. The two first worked together as assistants under Pete Carroll at USC during the program's early-2000s dynasty. Their professional paths crossed again when Kiffin became coach at Tennessee in 2009, hiring Orgeron as an assistant. When Kiffin left for USC the following year in 2010, Orgeron followed. After Kiffin's firing midway through the 2013 season, USC elevated Orgeron to interim coach and he led the Trojans to a 6-2 finish.Given that history, Orgeron said he'd be open to reuniting with Kiffin in Baton Rouge -- even as an assistant.\n\"I love LSU,\" Orgeron said. \"I still got my home in Baton Rouge. I loved when I coached with coach (Les) Miles being the defensive line coach. I love the Tigers. And I'm getting back to coaching. For sure I'd consider it. No doubt.\"During his six seasons at LSU (2016-21), Orgeron compiled a 51-20 overall record, including a record-setting 15-0 championship year in 2019. That season produced an SEC title and the program's fourth national crown. That season, led by Heisman Trophy winner Joe Burrow, is regarded as one of the most dominant in college football history, with the Tigers defeating seven top-10 opponents on their way to the championship.LSU went 11-11 over the next two seasons, and dismissed Orgeron at the end of 2021.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ed Orgeron open to LSU return, reflects on Brian Kelly firing, SEC coaching vacancies - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/5c8aca8b-02c8-4f63-b9c2-c965c102cfb3/thumbnail/1200x675/08f6afa7e9f797426b43f3f75739caba/ed-orgeron.jpg"
      ],
      "datePublished": "2025-10-29T19:11:36.000Z",
      "dateModified": "2025-10-29T19:11:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks against the spread, money line and over/under for Week 9 from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-against-the-spread-over-under-money-line-picks-best-bets-week-9-ai/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-29T17:40:27.000Z",
    "description": "\n        A pair of AFC division leaders headline the NFL Week 9 schedule when the Indianapolis Colts take on the Pittsburgh Steelers on Sunday. The Co",
    "body": "\n        A pair of AFC division leaders headline the NFL Week 9 schedule when the Indianapolis Colts take on the Pittsburgh Steelers on Sunday. The Colts, behind running back Jonathan Taylor and quarterback Daniel Jones, have taken command of the AFC South at 7-1. Pittsburgh, meanwhile, is in control of the AFC North at 4-3, but have dropped two in a row. Quarterback Aaron Rodgers is coming off a disappointing performance in a loss to the Green Bay Packers, a team he spent 18 years with. Indianapolis enters as a 3-point favorite and is one of seven road favorites during the Week 9 NFL schedule.  Another matchup involving contenders sees the Kansas City Chiefs (4-3) visiting the Buffalo Bills (5-2). The Chiefs are 2-point favorites as former MVP quarterbacks Patrick Mahomes and Josh Allen square off. How should you handle those NFL games and optimize what to bet on NFL in Week 9? Before making any Week 9 NFL picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 9 NFL betting, the AI PickBot has evaluated the NFL odds and provided NFL betting picks for all 13 games. You can only see the AI predictions for the Week 9 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 9 NFL AI picksAfter analyzing every game in Week 9, the AI says the Steelers (+3, 50.5) cover comfortably against the Colts. Rodgers has stabilized the Steelers offense. In seven games, he has completed 68.3% of his passes for 1,489 yards and 16 touchdowns with five interceptions. In Sunday night's loss to the Packers, he completed 24 of 36 passes (66.7%) for 219 yards and two touchdowns.The Steelers lost that game, but won their prior two at home, beating both the Browns and the Vikings and covering in both of those matchups. The Colts' only loss this season came on the road, and SportsLine AI projects that this game comes down to the wire, making Pittsburgh the value play as the Steelers win 28-26 on average. See its other Week 9 football predictions and football picks at SportsLine, and bet the Steelers here:How to make Week 9 NFL picksIn addition, the AI PickBot has generated well over 20 highly-coveted A+ picks for Week 9. You need to see the AI's NFL picks before making any Week 9 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 9 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks against the spread, money line and over/under for Week 9 from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2025-10-29T17:40:27.000Z",
      "dateModified": "2025-10-29T17:40:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals' Joe Flacco dealing with shoulder injury: QB is '50-50' for Week 9 game vs. Bears - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-joe-flacco-shoulder-injury-quarterback-bears/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/90e8bd71-6418-4f68-9d00-7257b4668e96/thumbnail/1200x675/0efc6f98ac7e7ab18e4dc05a310b2223/bengals.jpg",
    "tag": "Sports",
    "date": "2025-10-29T18:19:28.000Z",
    "description": "\n        CINCINNATI -- Quarterback Joe Flacco has brought new life to the Cincinnati Bengals offense since being traded over from the rival Cleveland ",
    "body": "\n        CINCINNATI -- Quarterback Joe Flacco has brought new life to the Cincinnati Bengals offense since being traded over from the rival Cleveland Browns, but he is now dealing with an injury that could affect his availability moving forward. Flacco suffered an AC joint sprain in his throwing shoulder that could impact his status for Cincinnati's Week 9 showdown against Caleb Williams and the Chicago Bears, per NFL Media.If Flacco cannot go, Jake Browning would likely return to the starting lineup. The Bengals also have Sean Clifford on their practice squad.During a press conference on Wednesday, Bengals coach Zac Taylor said there was a '50-50' chance that Flacco would be able to play. \"He won't practice today,\" Taylor said. \"We'll see what we can potentially get out of him [on Thursday]. We'll just work through the week. I think right now it's 50-50 on what it will end up on Sunday.\"\nIf Flacco doesn't practice at all this week, Taylor said he'd still be open to starting him on Sunday if the 40-year-old felt good enough to go. \"I've seen him show up three days with no knowledge of our offense whatsoever,\" Taylor said when asked if he would be comfortable playing Flacco after a week with zero practice reps. \"I think that proof is out there that we could do it if we needed to.\"Flacco was traded to the Bengals on Oct. 7 and then started a Week 6 game for them just five days later in a 27-18 loss to the Green Bay Packers. In Week 7, he had to to turn around and play a Thursday game against the Steelers and he ended up throwing for 342 yards and three touchdowns in a 33-31 win that came after just two days practice. \nThe Bengals are coming off a tough, 39-38 loss to the New York Jets, in which they blew a 15-point fourth-quarter lead. The Cincinnati defense allowed one of the worst offenses in the NFL to rack up a total of 502 yards of total offense, and score 23 points in the final quarter. Still, Flacco impressed as the Bengals' new \"Joe Burrow,\" accounting for eight total touchdowns compared to zero turnovers in his first three starts for Cincy. Joe Flacco vs. Jake Browning through three startsRecordTotal yards per gamePoints per gameJoe Flacco1-2378.729.7Jake Browning0-3217.312.3Flacco's arrival has also been good for superstar wideout Ja'Marr Chase, who has caught 38 passes for 346 yards and two touchdowns on 54 targets in Flacco's three starts. According to CBS Sports Research, those 38 receptions are tied for the most in a three-game span all-time with Michael Thomas in 2018, and the 54 targets are the most in a three-game span over the last 45 seasons. The 3-5 Bengals are No. 2 in the AFC North behind the 4-3 Pittsburgh Steelers. The 2-5 Baltimore Ravens also appear to be on the rise, as two-time NFL MVP quarterback Lamar Jackson is expected to make his return to the lineup this Thursday night against the Miami Dolphins. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals' Joe Flacco dealing with shoulder injury: QB is '50-50' for Week 9 game vs. Bears - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/90e8bd71-6418-4f68-9d00-7257b4668e96/thumbnail/1200x675/0efc6f98ac7e7ab18e4dc05a310b2223/bengals.jpg"
      ],
      "datePublished": "2025-10-29T18:19:28.000Z",
      "dateModified": "2025-10-29T18:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aidan Hutchinson extension: Lions star agrees to record-breaking deal - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/aidan-hutchinson-lions-extension/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/dbca1179-94dd-4789-8a18-89a849c9b89d/thumbnail/1200x675/26918bee973cee53b236760952da3d33/aidan-hutchinson-lions.jpg",
    "tag": "Sports",
    "date": "2025-10-29T16:38:04.000Z",
    "description": "\n        The Detroit Lions and defensive end Aidan Hutchinson have agreed to a four-year, $180 million contract extension, per CBS Sports senior repor",
    "body": "\n        The Detroit Lions and defensive end Aidan Hutchinson have agreed to a four-year, $180 million contract extension, per CBS Sports senior reporter Matt Zenitz. The deal includes $141 million guaranteed, a record for any non-quarterback.At $45 million per year, Hutchinson becomes the second highest-paid non-quarterback on an average annual salary basis; only Micah Parsons, who was stunningly traded from the Dallas Cowboys to the Green Bay Packers and then signed an extension with Green Bay before the season, is averaging more ($46.5 million).Hutchinson, 25, has quickly ascended to superstardom in the Motor City. He finished second in NFL Defensive Rookie of the Year voting in 2022, made the Pro Bowl with 11.5 sacks in 2023 and was leading the NFL with 7.5 sacks through six weeks of the 2024 season before suffering a season-ending tibia and fibula fracture while sacking Dak Prescott of the Dallas Cowboys.He has immediately returned to form in 2025. His 6.9 pressures per game lead the NFL, as do his four forced fumbles. He also ranks top 10 in the league in sacks (six) and pressure rate (19.2%). Since the start of last season, he is averaging an NFL-best 1.13 sacks per game and is the only player averaging more than one sack per game.\nHis rise has coincided with the Lions' rise as a whole. In Hutchinson's four seasons in Detroit, the Lions are 41-17, the fourth-best record in the NFL. In the four seasons prior, the Lions were 17-46-2, the third-worst record in the NFL.Hutchinson is also a hometown hero of sorts. He was born and raised in Plymouth, Michigan, which is just west of Detroit, and he starred at Michigan, where he won Big Ten Defensive Player of the Year and several national awards and was named an All-America selection in 2021.Edge rushers continue to get paid; who's next?Salaries continue to explode across the NFL, and especially at edge rusher. Hutchinson is now one of 11 players at the position making at least $25 million per year, and eight of those 11 players signed their most recent contract this year.\nPlayerAverage Annual Value (AAV)Years/valueYear signedMicah   Parsons$46.5   million4/$186M2025Aidan   Hutchinson$45 million4/$180M2025T.J. Watt$41 million3/$123M2025Myles   Garrett$40 million4/$160M2025Danielle   Hunter$35.6   million1/$35.6M2025Maxx   Crosby$35.5   million3/$106.5M2025Nick Bosa$34 million5/$170M2023Trey Hendrickson$29 million1/$29M2025Josh Hines-Allen$28.25 million5/$121.25M2024Brian Burns$28.2 million5/$121M2024Nik Bonitto$26.5 million4/$106M2025Edge rushers now own the top three largest contracts in terms of total value (Parsons, Hutchinson, Bosa) and in terms of AAV (Parsons, Hutchinson, Watt) among non-quarterbacks.This also sets the table for Texans edge rusher Will Anderson Jr. as next in line for a massive extension that pays him at or near the top of the market. Anderson won Defensive Rookie of the Year in 2023, had 11 sacks last season and is leading the NFL in pressure rate this year. He is extension-eligible this coming offseason.Lions continue to nail draft classes but are getting expensiveAs mentioned above, the Lions have turned from NFL laughingstock to Super Bowl contender. They made the NFC Championship game in the 2023 season and had 15 wins last season despite being ravaged by injuries. This year, they are 5-2.\nCoach Dan Campbell deserves an enormous amount of credit for that success, but so, too, does GM Brad Holmes. Both arrived in 2021 and have led a revival in Detroit. It has started in the draft. The Lions' first ever pick under Campbell and Holmes was right tackle Penei Sewell, who has gone on to be a three-time Pro Bowler and two-time first-team All-Pro. Also in that draft were star wide receiver Amon-Ra St. Brown and stalwart defensive tackle Alim McNeill.The next year, the Lions drafted not only Hutchinson but big-play wide receiver Jameson Williams and ballhawking safety Kerby Joseph. The next year, 2023, brought in running back Jahmyr Gibbs, linebacker Jack Campbell, safety Brian Branch and tight end Sam LaPorta. Gibbs, Branch and LaPorta have all been Pro Bowlers, and Campbell has started every game the last two seasons.Many of those picks, of course, were made thanks to the franchise-changing trade of Matthew Stafford for Jared Goff, and Goff resurrecting his career in Detroit has been the biggest piece of the Lions' success, even with the terrific drafting and development around him.\nAll that success comes with a price, though, and the Lions have a hefty pay sheet. Here are players with a top-10 AAV at their position.QB Jared Goff ($53 million per year)WR Amon-Ra St. Brown ($30 million per year)RT Penei Sewell ($28 million per year)DT Alim McNeill ($24.25 million per year)EDGE Aidan Hutchinson ($45 million per year)S Kerby Joseph ($21.25 million per year)That list doesn't include significant contracts for Williams, running back David Montgomery, left tackle Taylor Decker, either. Gibbs, Campbell, Branch and LaPorta are extension-eligible this offseason.The Lions will have some tough choices to make and some restructuring to do. This season becomes especially important in that light. The pressure to win, though, is far better than the pressure to make the right choice with an early draft pick, a situation Detroit knew far too well before Campbell and Holmes arrived.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aidan Hutchinson extension: Lions star agrees to record-breaking deal - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/dbca1179-94dd-4789-8a18-89a849c9b89d/thumbnail/1200x675/26918bee973cee53b236760952da3d33/aidan-hutchinson-lions.jpg"
      ],
      "datePublished": "2025-10-29T16:38:04.000Z",
      "dateModified": "2025-10-29T16:38:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens vs. Dolphins odds, prediction, best bets: 'Thursday Night Football' picks by expert on 29-14 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-ravens-vs-dolphins-picks-by-expert-on-29-14-roll/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/72e7f03d-e284-40a8-93a7-8769001b775f/thumbnail/1200x675/dde127506b7ea5172563093939b9bdd4/lamar-jackson-baltimore-ravens-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-29T16:00:30.000Z",
    "description": "\n        Teams looking to salvage their seasons clash on 'Thursday Night Football,' when the Baltimore Ravens battle the Miami Dolphins. Baltimore is ",
    "body": "\n        Teams looking to salvage their seasons clash on 'Thursday Night Football,' when the Baltimore Ravens battle the Miami Dolphins. Baltimore is coming off a 30-16 win over the Chicago Bears on Sunday, while Miami rolled to a 34-10 win at Atlanta. The Ravens (2-5), third in the AFC North, are 0-2 on the road this season. The Dolphins (2-6), third in the AFC East, are 1-2 on their home field in 2025. Baltimore quarterback Lamar Jackson (hamstring) has been a full participant at practice this week and is expected to return after missing the past three games.Kickoff from Hard Rock Stadium in Miami Gardens, Fla., is set for 8:15 p.m. ET. The Ravens lead the all-time series 11-8, including wins in nine of the past 12 meetings. Baltimore is a 7.5-point favorite in the latest Ravens vs. Dolphins odds from SportsLine consensus, while the over/under for total points scored is set at 50.5. Before you make any Dolphins vs. Ravens picks, be sure to see what SportsLine expert Mike Tierney has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. He is 235-189-13 in his NFL picks the past three seasons, returning $2,505 to $100 players. He hit 61.2% of his ATS picks (61-39-3) last season. Tierney is also 29-14-1 (+1327) on his last 44 picks in Baltimore Ravens games. Anyone following could've seen huge returns. Now, Tierney has set his sights on Ravens vs. Dolphins and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Dolphins vs. Ravens:Ravens vs. Dolphins                 spreadBaltimore -7.5 at DraftKings SportsbookRavens vs. Dolphins                   over/under50.5 pointsRavens vs. Dolphins                   money line Baltimore -446, Miami +343Ravens vs. Dolphins                   picksSee picks at SportsLineRavens vs. Dolphins                   streaming Amazon Prime   Why the Ravens can coverAmong Baltimore's top offensive weapons is running back Derrick Henry. The 10-year veteran has played in seven games this year. He has carried 109 times for 510 yards (4.7 average) and six touchdowns. He has rushed for more than 100 yards in two games, including 122 yards on 24 carries in a 17-3 loss to the Los Angeles Rams on Oct. 12. He is coming off a 21-carry, 71-yard and two-touchdown effort in Sunday's win over the Bears.Third-year veteran wide receiver Zay Flowers leads the Ravens in receptions with 41 for 486 yards and one touchdown. In a 41-40 season-opening loss at Buffalo, he caught seven passes for 143 yards and one touchdown. He had seven catches for 63 yards in Sunday's win over Chicago. In three seasons, he has played in 40 games, making 192 receptions for 2,403 yards and 10 touchdowns. See which team to back at SportsLine. Why the Dolphins can coverSixth-year veteran quarterback Tua Tagovailoa leads the Miami offense. In eight starts, he has completed 159 of 231 passes (68.8%) for 1,518 yards and 15 touchdowns with 10 interceptions for a 90.4 rating. In Sunday's win at Atlanta, he completed 20 of 26 passes (76.9%) for 205 yards and four touchdowns. In a 27-24 loss at Carolina on Oct. 5, he completed 27 of 36 passes for 256 yards and three touchdowns.His top target is wide receiver Jaylen Waddle. In eight games, he has 35 receptions for 504 yards (14.4 average) and four touchdowns. In Sunday's win over the Falcons, he caught five passes for 99 yards and one touchdown. In the loss to Carolina, he had six receptions for 110 yards and a score. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Ravens vs. Dolphins  picksTierney has analyzed Ravens vs. Dolphins from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Dolphins vs. Ravens, and what critical X-factor makes one side of the spread a must-back?. You can head to SportsLine to see his Ravens vs. Dolphins picks. Visit SportsLine now to see which side you need to jump on, all from the expert that is 29-14-1 on his last 44 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens vs. Dolphins odds, prediction, best bets: 'Thursday Night Football' picks by expert on 29-14 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/72e7f03d-e284-40a8-93a7-8769001b775f/thumbnail/1200x675/dde127506b7ea5172563093939b9bdd4/lamar-jackson-baltimore-ravens-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-29T16:00:30.000Z",
      "dateModified": "2025-10-29T16:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL survivor picks, knockout pool predictions, Week 9 teams to avoid from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-survivor-pool-picks-advice-strategy-guide-week-9-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/84ef3986-bf83-4794-9138-aefed302912b/thumbnail/1200x675/65f75c85249bd3221a9ed886f4bc8cff/courtland-sutton-denver-broncos-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-29T15:52:06.000Z",
    "description": "\n        Week 9 of the NFL schedule will give the shrinking number of remaining survivor pool players some solid options. Unless the Cincinnati Bengal",
    "body": "\n        Week 9 of the NFL schedule will give the shrinking number of remaining survivor pool players some solid options. Unless the Cincinnati Bengals were your pick, there wasn't a whole lot of carnage in Week 8 as most favorites pulled through. That included the Philadelphia Eagles with a 38-20 win over the New York Giants and the Indianapolis Colts with a 38-14 throttling of the Tennessee Titans. Four teams will be on their bye in Week 9, including Cleveland, the New York Jets, Philadelphia and Tampa Bay. A popular choice this week is the Los Angeles Rams (5-2), who are taking on the 1-7 New Orleans Saints. The Saints have lost three in a row since their 26-14 win over the New York Giants on Oct. 5. The Rams, meanwhile, have won two in a row, including a 35-7 win over Jacksonville on Oct. 19. Los Angeles enters as a 13.5-point favorite in what is one of the largest Week 9 NFL lines, and one of five NFL spreads of at least seven points. Another is the Los Angeles Chargers as 9.5-point favorites over the Tennessee Titans, who have now lost three straight by double digits. Before finalizing any Week 9 NFL survivor picks, see which team the red-hot SportsLine Projection Model just went all-in on.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 9 NFL schedule and locked in its Week 9 survivor pool pick. You can only see who the model is backing this week at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top Week 9 NFL survivor pool predictions In Week 9 of the NFL season, the model is shying away from picking the Broncos (6-2) over the Texans (3-4). Although Denver leads the AFC West and is riding a five-game winning streak, the Broncos are just 2-2 on the road this season.There are other reasons to fade Denver as well, however. Houston appears to be turning around their fortunes with three wins in their last four games. Quarterback C.J. Stroud played at a high level in the 26-15 win over the San Francisco 49ers on Sunday. In that game, he completed 30 of 39 passes (76.9%) for 318 yards and two touchdowns with one interception.Despite opening as a road favorite, the SportsLine's model projects Houston will win this one, making the Broncos a team to stay far away from in NFL survivor pools this week. See which team to pick instead here. You can also use the latest FanDuel promo code to get $300 in bonus bets instantly:How to make Week 9 NFL survivor pool picks Instead, the model is confidently backing a team many have not used in survivor pools to win outright in well over 80% of simulations. The time to pick this team is now, and you can only see the play over at SportsLine.Which surprising team is a must-back in your Week 9 NFL survivor pool? Visit SportsLine now to see which team carries you to victory in Week 9, all from the advanced computer model that nails survivor picks and is up well over $7,000 since its inception.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL survivor picks, knockout pool predictions, Week 9 teams to avoid from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/84ef3986-bf83-4794-9138-aefed302912b/thumbnail/1200x675/65f75c85249bd3221a9ed886f4bc8cff/courtland-sutton-denver-broncos-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-29T15:52:06.000Z",
      "dateModified": "2025-10-29T15:52:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Son Heung-Min and LAFC are a perfect match as Korean fans flock to their new star - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/los-angeles-fc-korean-son-heung-min-south-korea-k-pop/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/291ab88a-0c3d-4834-8560-1d671df72b04/thumbnail/1200x675/7b968b82b7d8b66aba94a90c4d4bdbc5/untitled-design-2025-10-29t154806-981.png",
    "tag": "Sports",
    "date": "2025-10-29T16:06:28.000Z",
    "description": "\n        When Son Heung-Min joined Los Angeles FC from Tottenham Hotspur during the summer transfer window, expectations were high for what he could d",
    "body": "\n        When Son Heung-Min joined Los Angeles FC from Tottenham Hotspur during the summer transfer window, expectations were high for what he could deliver on the pitch. It's safe to say that in his short tenure he has exceeded them. With 10 goals and three assists since playing his first match for the black and gold in August, he led the team to the joint-best record in the league alongside Inter Miami. But that's not the only place where Sonny has made an impact.Off the pitch, bringing a South Korean superstar to a city that has the largest Korean population in the United States has also brought a level of representation to fans, energizing a passionate community. Before LAFC even kicked a ball in 2018, a Korean Supporters group, the Tigers Supporters group, formed, but little did they know that things would take off to this level as Son's arrival has kicked soccer into the stratosphere in Los Angeles.\"The first thing that changed is that all the Korean friends and family we were asking to come be part of supporting this club when it first started have finally started coming out,\" Tigers member Sam Ko said about the impact of Son's arrival. \"It's great to see the support that shows up every four years during the World Cup is at BMO whenever Sonny's in town. Koreans are a proud people, L.A. Koreans in particular, and having Sonny here makes us puff our chest out a little further.\"\"What's even more beautiful is the ripple effect,\" Tigers member Daniel \"Deech\" Chung said. \"I love seeing so many new Korean fans fill the stands, waving the Korean flag, it's beautiful. Even my dad, who never really cared about what I was doing with TSG, now acknowledges that LAFC is a team worth mentioning.\"\nAs Los Angeles prepares to host World Cup matches in 2026, this isn't something that's lost on the club either. While they want the club to represent the community, Son isn't the first South Korean to play for the team, as Kim Moon-Hwan holds that distinction, being a member of the club from 2021 to 2022. And identifying with the communities in their city isn't something new to the club either. When LAFC were founded, one of the first things that they did was sign Mexican international Carlos Vela, something that has prepared the club for properly handling the balance of embracing culture while still being authentic about how they do it.LAFC are no strangers to having global stars at the club. Giorgio Chiellini, Gareth Bale, and Oliver Giroud have all donned the Black and Gold, but none have brought the same mania that Son has in such a short time with the club. As co-president Larry Freedman said, Sonny is a perfect fit at the club.\"He fits the culture inside the club. He fits the culture in the community ... and then there's this wonderful connection with the Korean American community, which is just undeniable,\" Freedman said. \"And you know, you don't always have the luxury of getting that authentic fit on all counts. But, you know this, this feels like one of those rare times.\"\nIn the greater makeup of the 3252, LAFC's independent supporters union, there's a full partnership between LAFC's nine recognized supporters groups coming from different walks of life in Los Angeles to come together to cheer on their team as they look to win the MLS Cup for the first time since 2022, and the second time in their young history. If they can make the final, it would be the third time in the past four years that LAFC have been there, which is quite an impressive feat of ensuring that they're successful on the pitch while recognizing the community off of it.Even as their playoff run begins on Wednesday, the Black and Gold will kick off a first of it's kind partnership with HYBE to bring a fan celebration to BMO Stadium that brings a celebration of Korean Culture from K-pop to food and including local vendors as well. It's an embrace of culture that even fans didn't see coming.\"Sure, there is a growing appreciation for K-pop and Korean beauty products, food, etc., but to have this level of exposure on a national scale is incredible! I'm excited to see what comes from this, maybe a NEW JEANS halftime show?!,\" Deech said.\nIn a way, all of this is also preparation for the World Cup, where cultures from around the world will be on display. What LAFC is doing to highlight what makes them special is something that American soccer will be doing on a larger scale in the summer of 2026, and it should be taken notice of.\"We're now in our eighth season playing, and we've been, you know, we've been doing this for eight years. And this is convincing people who say things like, 'I don't like sports, I don't do sports,' or 'I don't understand soccer. I don't like soccer; offsides is an impossible thing to understand,' whatever the reason, and we like to say to people, come one time, just come one time. Experience, the 3252 experience, the brand of football we play, and how exciting that is, and the energy in the stadium when we play, \" Freedman said. \"And you know, you let us know if it was worth your time. And invariably, those first timers, sometimes it's before half time, but certainly before they're leaving at the end, they're already talking about wanting to come back.\"With more stars coming to MLS by the season, especially after the arrival of Lionel Messi in 2023, the league is in a great position to use the World Cup as a platform to reach new heights, so its important at the club level that things are moving in the right direction. Ko put it best, because while it's important to win with the players on the pitch, it's about how soccer can bring people together and create a community. \n\"I'm interested to see how the K-pop world and soccer world collide. K-pop fandom is a phenomenon, and it surprises me all the time,\" Ko said. \"I hope that some of that energy can be brought to LAFC and stays even when Sonny decides to hang it up, because players will always come and go, but the community is forever.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Son Heung-Min and LAFC are a perfect match as Korean fans flock to their new star - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/291ab88a-0c3d-4834-8560-1d671df72b04/thumbnail/1200x675/7b968b82b7d8b66aba94a90c4d4bdbc5/untitled-design-2025-10-29t154806-981.png"
      ],
      "datePublished": "2025-10-29T16:06:28.000Z",
      "dateModified": "2025-10-29T16:06:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 9 NFL betting guide, odds, picks, predictions, player props, DFS and fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-9-nfl-betting-guide-props-spreads-model-expert-parlay-dfs-fantasy-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/ad475040-6bf4-49e2-b2d1-d5e8a26e7706/thumbnail/1200x675/a852704c9fdfa922b760bd77c8458787/oronde-gadsden-ii-los-angeles-chargers-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-10-29T17:52:54.000Z",
    "description": "\n        Week 8 saw just one game decided by single-digits, but should that have an impact with your Week 9 NFL predictions? The NFL odds have a mix o",
    "body": "\n        Week 8 saw just one game decided by single-digits, but should that have an impact with your Week 9 NFL predictions? The NFL odds have a mix of slim NFL lines and wide ones, as there are five games with a spread of under a field goal, as well as five contests with a line of more than a touchdown. Perhaps the focal point of many with their Week 9 NFL bets will be Chiefs vs. Bills (+2) on Sunday at 4:25 p.m. ET as Patrick Mahomes and Josh Allen meet for the 10th time.The team that has outright won has also prevailed versus the spread in each of those nine matchups, and that trend is just one part of a Week 9 NFL betting guide. Should your Week 9 NFL picks include Mahomes, Allen, Travis Kelce or James Cook as part of your NFL DFS strategy, within Fantasy football lineups or among NFL player props? Other close spreads include Broncos vs. Texans (-1.5), Giants vs. 49ers (-2.5) and Cowboys vs. Cardinals (+2.5). If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 9, SportsLine has you covered with its proven model, Machine Learning Model and team of experts. Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 9 that pays 25-1, and one of the legs is the Packers (-12.5, 44.5) covering against the Panthers. The model has Green Bay covering in almost 60% of simulations in an A-rated pick, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $300 in bonus bets + 3 months of NBA League Pass if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Bears' Caleb Williams as one of its top value picks at quarterback, while Pittsburgh's Jaylen Warren is among the best values at running back for Sunday's main slate. Here are its complete Week 9 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Giants' Tyrone Tracy Jr. as a top-15 Fantasy running back in PPR formats. Get his full Week 9 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 9 Fantasy football rankings that can be used to make start-sit decisions. The Chargers' Oronde Gadsden II is projected to be a top-five Fantasy tight end this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model enters Week 9 of the 2025 NFL season up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 45-28 run on top-rated picks dating back to 2024 and has revealed picks for every Week 9 NFL game. One of its favorite picks is the Chargers (-9.5) covering versus Tennessee, which cashes well over 50% of the time. You can find the model's picks for every NFL Week 9 game here. You can also use the latest FanDuel promo code to get $300 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. R.J. White, who is 37-15-3 (+2114) over his last 55 ATS picks in Vikings games, is backing Detroit (-8.5) to cover versus Minnesota. \"[J.J. McCarthy] was terrible for seven of his eight quarters played prior to missing six weeks with a high ankle sprain, and now he returns against a Lions defense that should be more whole in the secondary than the unit that shut down the Bucs two weeks ago. The Vikings defense struggled to stop Kimani Vidal, so I don't like their chances against the Lions' star RB duo. This feels like a game the Lions should lead by double-digits by the third quarter, and I don't like McCarthy's chances of getting a backdoor cover.\" White's NFL best bets for Week 9 can be found here.Eric Cohen, who is 79-41-1 (66%) on his straight-up NFL picks this season, has exact score predictions for all 14 games in Week 9. He is high on the Steelers (+3, 49.5) to upset the Colts, 26-24, on Sunday. Hit any of his exact score picks and you're looking at a payout well over 100-1. That pick, along with his prediction for every game, is available here.Ravens vs. Dolphins 'Thursday Night Football' picksA pair of two-win teams coming off much-needed wins will kick off NFL Week 9 as Miami hosts Baltimore on 'Thursday Night Football.' Lamar Jackson (hamstring) will return after missing three games, and the Ravens are 7.5-point road favorites. SportsLine expert Mike Tierney, who is 29-14-1 (+1327) over his last 44 picks in Ravens games, is backing the Under (50.5) to hit. The SportsLine model has also made spread, money line and over/under picks, including one that hits in almost 70% of simulations. See Dolphins vs. Ravens picks from the advanced model here.Seahawks vs. Commanders 'Sunday Night Football' picksAfter losing on MNF last week, Washington will look to right the ship on SNF versus Seattle (-3.5, 46.5) coming off a bye. These teams have alternated wins and losses over their last six regular season games, with the Seahawks prevailing in their last meeting. The SportsLine model projects Jaxon Smith-Njigba to top all receivers in Week 9 in Fantasy football points. It has also spread, money line and total picks for 'Sunday Night Football'. See the Commanders vs. Seahawks picks from the advanced model here.Cowboys vs. Cardinals 'Monday Night Football' picksKyler Murray is expected to return on MNF in a homecoming game as the Dallas native and the Cardinals visit the Cowboys (-2.5). Arizona is 7-1 versus Dallas over their last eight matchups including three straight wins in Dallas. This game has the highest total (54) of the Week 9 NFL schedule, and the advanced model from SportsLine has the Over hitting, with the teams combining for 59 points. SportsLine's No. 1 NFL expert R.J. White has made his spread pick, and even though both teams enter off losses, White says the unit of one team is coming off \"its best game of the season.\" See White's Cardinals vs. Commanders picks here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 9 NFL betting guide, odds, picks, predictions, player props, DFS and fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/ad475040-6bf4-49e2-b2d1-d5e8a26e7706/thumbnail/1200x675/a852704c9fdfa922b760bd77c8458787/oronde-gadsden-ii-los-angeles-chargers-usatsi.jpg"
      ],
      "datePublished": "2025-10-29T17:52:54.000Z",
      "dateModified": "2025-10-29T17:52:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Midseason Awards: Handing out trophies for major awards, plus best play, quote, more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-midseason-awards-mvp-play-of-the-year-best-quote-top-rookies-more-from-wild-first-half/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/3132b222-b546-4b25-9d18-d609cb1b6b64/thumbnail/1200x675/fd391c7c60e161ac0103bc86afe7b971/jonathan-taylor-colts.jpg",
    "tag": "Sports",
    "date": "2025-10-29T19:49:50.000Z",
    "description": "\n        We've officially reached the midpoint (I think, 17 games makes it weird) of the 2025 NFL season and wow there's a lot going on! It feels like",
    "body": "\n        We've officially reached the midpoint (I think, 17 games makes it weird) of the 2025 NFL season and wow there's a lot going on! It feels like we're back in 2014 with the Patriots, Steelers, Chargers and Colts at the top of their respective divisions in the AFC, while over in the NFC the teams are stacked and ready to make a playoff run.A lot of what we thought would be true about the NFL this season was flipped on its head through the first eight weeks, and that makes football really fun! Since we're at the midseason point, I decided that it's about time that we give out some awards through this point of the season. It won't just be your basic awards like MVP, Offensive Player of the Year and the whole roster of trophies actually given out by the NFL, we're going to have some fun with it, giving out awards for best play, best quote and other cool awards in the same vein. So let's hop into it!Quote of the Year: \"If we keep it a buck right now we ass\" Cam Ward, Tennessee Titans\nWhat a tough year for the first overall pick. Nothing has gone right for the Titans, who have seen the infrastructure around their young QB crumble and their head coach not make it through the first half of the season. Ward is ultra-competitive, and honestly I love this quote from Ward talking to the media. This shows me Ward wants to win and wants to be great, even though this will get memed into oblivion (I've already used it). It was such a blunt answer to a question and a sad truth about the Titans this season.Celebration of the Year: Cam Bynum dancing with BlueFinalists: Six-Seven, Cam Skattebo backflip\nThis one couldn't go to anyone but Bynum, who has set the standard for NFL celebrations for the last couple of years now. The celebrations have been a little subpar this season, but whenever Bynum gets an interception you just know that he's going to be celebrating in some crazy way. My favorite part of this is Blue, the Colts mascot, immediately knowing the vibes and dancing along with him. Incredible work.\nPlay of the Year: Trevor Lawrence's stumble heard around the worldFinalists: Titans' throw a pick and score a TD at the same time\nIn what would be the game winning touchdown, Trevor Lawrence did what might be the most Jacksonville Jaguars thing of all time: he got stepped on by a lineman, forcing him to fall. But then he got up, because he wasn't touched down and ran into the endzone. There's no more cinematic or chaotic way to end a game that's happened this year, and the fact that it was on prime-time television makes it even funnier.Game of the Year: Seahawks-Buccaneers Week 5Finalists: Bengals-Steelers Week 7 (The Unction), Chiefs-Jaguars Week 5, Bills-Ravens Week 1Imagine telling yourself three years ago that teams quarterbacked by Sam Darnold and Baker Mayfield would play in the game of the year. 2025 has been a weird year for football! Seahawks-Bucs was incredible, with insanely high levels of QB play and offense designed by two teams that are vying for the top spot in the NFC. Some of the moments in this game were insane, like WR Emeka Egbuka going toe to toe with his former teammate in WR Jaxon Smith-Njigba and the game ending interception being doinked off a players' helmet. It was absolute cinema, and I hope we see these two teams play in the playoffs.\nOffensive Rookie of the Year: Tyler Warren, TE, Indianapolis ColtsFinalists: Emeka Egbuka, Will Campbell\nThis one feels like the most obvious pick of the group. Tyler Warren is having one of the coolest rookie seasons in recent history, and is providing exactly what the Colts needed to blend their offense together into the machine of efficiency they are now. Warren leads all tight ends in receiving yards this year and is second in Yards After the Catch. Head coach Shane Steichen loves using him in creative ways to dictate matchups from the defense, and he's become a fulcrum of what the Colts want to be as an offense. With Warren on the field, the Colts have one of the most dangerous offenses in 11 personnel in the league, and that's largely because of what Warren brings as both a blocker and receiver. With Warren on the field, the Colts' offense is averaging 0.26 EPA per play and a startling 57% Positive Play Rate, per Sports Info Solutions. He can line up in the backfield, he'll line up spread away from the formation and when the Colts get him the ball, good things happen. Easy pick for Offensive Rookie of the Year.Defensive Rookie of the Year: Abdul Carter, EDGE, New York GiantsFinalists: Nick Emmanwori, Will Johnson, Carson Schwesinger, Xavier Watts\nI REALLY wanted to give this award to Schwesinger, who has been playing out of his mind on a very good Cleveland Browns defense. However, since 2010 only two off-ball linebackers have won the award (Luke Keuchly in 2012, Shaquille Leonard in 2018) and both guys had over 160 tackles and Leonard literally stuffed the statsheet with seven sacks, eight PBUs, four forced fumbles and two interceptions while Keuchly had 164 tackles and seven pass deflections. Schwesinger has been balling, but he's on pace to miss the 160+ mark by 30 tackles and doesn't have the same chaotic plays forced as the other guys. Which leads me to Carter, who is doing freakish things for a defense that gets him on the field in as many ways as possible. He's tied for the NFL lead in quick pressures with 19 per NFL Pro, is 15th in ESPNs Pass Rush Win Rate and is in the top 10 for total pressures with 33. The Giants will give him advantageous situations where he's using his speed to win against guards on the interior, but there are moments on the edge where he's just a blur of speed and power and you just get it. Carter is my pick here, but I do think it's close.\nComeback Player of the Year: Aidan Hutchinson, EDGE, Detroit LionsFinalists: Christian McCaffrey, Matthew Stafford, Andrew Thomas\nThe finalists for CPOY are an interesting one. Making sure this is for players who are recovering from injuries (looking at you, Daniel Jones), I narrowed down the field to these four. McCaffrey leads the NFL in touches with 196 through eight games and has looked like the player we once knew that terrorized NFL defenses. We all know about Stafford's experience with the Ammortal Chamber, but through the first half of the season it looks like whatever they did worked. Stafford is tied for the NFL lead in touchdowns with 17 and has only thrown two interceptions on the year, looking like the pure dropback passer that can still lead the Rams to the promised land.Thomas is coming off a Lisfranc injury, but has looked every bit like the top flight tackle that he has been for the last few years. He's fourth in the NFL in ESPN's Pass Block Win Rate and has been a big part of why the transition to rookie QB Jaxson Dart has been so good.\nHowever, Hutchinson coming back from his leg injury and still being one of the better pass rushers in the NFL gets my vote. He's third in the NFL in total pressures this season, has two turnovers caused by pressures this season and has looked every bit the part of the guy who was racking up sacks before his injury last season. Hutchinson is also a large part of why the Lions sit at second in the NFL in defensive EPA per play allowed, with his pressure forcing teams to get the ball out quick. Eventually the sacks will come, but even without them he's my Comeback Player of the Year.Protector of the Year: Quenton Nelson, OG, Indianapolis ColtsFinalists: Garrett Bolles, Andrew Thomas, Lane JohnsonThere are a lot of good finalists for Protector of the Year, but I have to give it to Nelson in what is another Hall of Fame year in a Hall of Fame career. There are so many parts to the Colts' offense and what makes it work, but their offensive line is what gives them a major margin for error. Nelson has been unstoppable this season, even beyond some of the counting stats like pressure rate allowed. The impact he has as a run blocker has been easy to see on tape, springing big Jonathan Taylor runs and providing a clean pocket for Daniel Jones to throw from. All of the candidates are worthy of Protector of the Year, but for the impact that a Hall of Famer like Nelson has had on the best offense in the NFL this season, he wins the award at midseason.Assistant of the Year: Klint Kubiak, Offensive Coordinator, Seattle SeahawksFinalists: Chris Shula, Josh McDaniels, Vance JosephIn one of the more obvious picks of this slate, Kubiak wins this one clearly for what he's done with a Seahawks offense that still has plenty of holes. The schematic shift they've taken with being in heavier looks and still attacking downfield at such a high rate is so impressive, especially without an offensive line that's played exceptionally well this season. Seattle is one of the most explosive offenses in the NFL despite not having consistent receiving targets outside of WR Jaxon Smith-Njigba, and I think that's due to the mind meld between Kubiak and QB Sam Darnold. Let's talk about their connection for a bit, too. Darnold has shown over the last season and a half that he can be an explosive downfield passer if you dress up the concept for him, and Kubiak has done that so well, using bigger personnel and heavy run looks to force teams into playing base personnel against them. The hope is that as the season continues to move along the run game finds some consistency, but even without that Kubiak should be the front runner for Assistant of the Year.\nPosition Coach of the Year: Hank Fraley, Offensive Line Coach, Detroit LionsFinalists: Tony Sparano Jr, OL Coach, Colts; Chris Partridge, OLB Coach, Seahawks; Jeff Stoutland, OL Coach, EaglesWeek 1 feels like it happened ages ago if you're a Detroit Lions fan. After all of the worrying about the Lions offensive line after the first week of the season, the Lions look like … well, the Lions. The two young starters in Christian Mahogany and Tate Ratledge are playing at a high level on the interior, and Graham Glasgow has been rock solid on the inside. Fraley was a priority keep for the Lions after Ben Johnson left for Chicago, and we're seeing why this season. Having a great offensive line coach makes the margin for error so wide, and because of that Fraley gets the nod.Coach of the Year: Shane Steichen, Indianapolis ColtsFinalists: Kyle Shanahan, Todd Bowles, Dan Campbell, Mike MacdonaldThere are going to be a lot of Colts in these awards, so just be ready for it. What Steichen has done with a QB who was deemed a castoff and an offense that couldn't find its footing last season is so, so impressive. To put some numbers to their offensive turnaround: the 2025 Colts are scoring the most points per drive of any team in the NFL since 2000, even outpacing the 2007 Patriots. Even crazier is that while that Patriots team put up 3.19 points per drive, the Colts are at … 3.46. That's an insane level of efficiency for a team led by Daniel Jones, who would've thought! \nThis year's Colts are eighth in the NFL in Success Rate since 2000, putting more context behind an offense that's executing at a historic level. What I love watching about the Colts offense is that everything builds off of their foundation plays. While the Colts love using split zone, everything builds off of that. Tyler Warren goes across the formation and slips out the backfield for YAC opportunities, Michael Pittman Jr is the dirty work guy over the middle of the field, Alec Pierce stretches the defense vertically and horizontally and Josh Downs is their third down money guy. Everyone on this offense is playing at their highest level in their specific roles, and it's what has the Colts at a blistering 7-1 through eight games. Their second half schedule is rough, but if they get through that with one of the top seeds in the conference Steichen should be Coach of the Year.Offensive Player of the Year: Jonathan Taylor, RB, Indianapolis ColtsFinalists: Jaxon Smith-Njigba, Puka Nacua, Patrick Mahomes\nWhat Smith-Njigba, Mahomes and Nacua have done is incredible, but Taylor is putting up incredibly efficient numbers as one of the most explosive players in the NFL this season. Taylor is on pace for 30 touchdowns this season, second-most in NFL history behind LaDanian Tomlinson in 2006. He's averaging almost six yards per carry, and his +23.4 total EPA as a runner is first in the NFL by almost four points.While the argument will be that Taylor is the beneficiary of a great offensive line (which I will agree he works in concert with his offensive line), the Colts' offense is only 14th in Yards before Contact per attempt. By comparison, the 2024 Eagles were third in that same metric. Meanwhile, Taylor and the Colts are fifth in Yards After Contact per attempt. Taylor by himself averages 4.3 Yards After Contact per attempt this year, first in the NFL among qualifying RBs. Taylor is having a year for the ages, and that gets him OPOY for me.\nDefensive Player of the Year: Myles Garrett, EDGE, Cleveland BrownsFinalists: Nik Bonnito, Micah Parsons\nOn Tuesday's episode of the Pushing the Pile podcast (which I highly recommend), I said I would vote for Nik Bonnito for Defensive Player of the Year, just out of concern for what the precedent was for winning a DPOY but having your team not make the playoffs. Since 2000, only four players have ever won Defensive Player of the Year while not making a playoff team: Michael Strahan in 2001, Ed Reed in 2004, Jason Taylor in 2006 and JJ Watt in 2014. The trend here is that to win DPOY on a losing team is that you have to have darn near historic production. The good thing here is that Myles Garrett is on pace for some truly epic numbers this season. Despite being double teamed at the highest rate among the top EDGEs in ESPNs Pass Rush Win Rate, he's eighth in win rate overall. Garrett is tied with the Giants' Brian Burns for the NFL lead in sacks right now with 10, and is on pace for 21.5 sacks this season, putting him just one sack shy of the single-season record. He's also on pace for 32 tackles for loss this season, which would be the second most in a single season in NFL history. Despite what Nik Bonnito and Micah Parsons are doing this season, Garrett is the best defensive player in the NFL by a substantial margin, and on pace for record numbers, making him the Defensive Player of the Year.MVP: Drake Maye, QB New England PatriotsFinalists: Jonathan Taylor, Patrick Mahomes, Baker Mayfield\nThe jump that Drake Maye has taken from promising to elite in one offseason is a sight to behold. For an offense that still hasn't been perfect (21st in Pass Block Win Rate, 28th in EPA per carry), Maye has been transcendent, leading the Patriots to a 5-2 record and leading the AFC East. Maye has done a little bit of everything for this Patriots' offense, as he's fourth in EPA per play as a passer and fifth in Success Rate. He's also second in the NFL in passer rating, with the only guy ahead of him being Lamar Jackson.\nBut what really stands out about Maye this year is that he's making the offense both explosive and efficient. Maye is 13/17 on passes of over 20 Air Yards this season, a blistering number for any QB let alone a guy in his second year. Maye is doing this while throwing to a receiver group that doesn't truly have an ace pass catcher and with pass protection that's still coming along, but it hasn't mattered for a large majority of the season. In addition, he's getting it done with his legs to keep the offense on schedule. Per Sports Info Solutions, among all QBs with at least ten scrambles Maye is ninth in first down rate. If we confine this to third and fourth down, on Maye's six scrambles he has five first downs, making it almost impossible to stop him. Yes, I understand that the Pats' schedule hasn't exactly been the best, but given the degree of difficulty the Pats' young signal caller is playing with, he's getting the absolute most out of this offense. The game has slowed down for Maye big time this season, and with it has come a year where he looks like the next elite QB and MVP through eight games.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Midseason Awards: Handing out trophies for major awards, plus best play, quote, more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/3132b222-b546-4b25-9d18-d609cb1b6b64/thumbnail/1200x675/fd391c7c60e161ac0103bc86afe7b971/jonathan-taylor-colts.jpg"
      ],
      "datePublished": "2025-10-29T19:49:50.000Z",
      "dateModified": "2025-10-29T19:49:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 9 betting: Lions, Raiders featured in expert's best money line parlays for favorites and underdogs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-9-betting-lions-raiders-featured-in-experts-best-money-line-parlays-for-favorites-and-underdogs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/9489f2e7-96ea-4a24-b037-b0878aa7028d/thumbnail/1200x675/be65ee9cb70c9b82b53bff5b363a79fc/genocarroll.jpg",
    "tag": "Sports",
    "date": "2025-10-29T15:53:15.000Z",
    "description": "\nWeek 9 of the 2025 NFL season provides 14 games, headlined by the Kansas City Chiefs visiting the Buffalo Bills in a rematch of last year's AFC Champ",
    "body": "\nWeek 9 of the 2025 NFL season provides 14 games, headlined by the Kansas City Chiefs visiting the Buffalo Bills in a rematch of last year's AFC Championship Game. Should sports fans back the Chiefs or Bills in any of their wagers, or are there other options which offer more value in Week 9?If you're looking to get into parlay betting and NFL betting for Week 9 NFL games, be sure to see what SportsLine expert Jeff Hochman has put together. He's going with two parlays for Week 9, with one featuring only favorites on the money line and the other featuring only underdogs.Week 9 NFL money line favorites parlay\nBetting heavy favorites can be a solid strategy if you want to bet on a 3-team NFL money line parlay. This approach focuses on teams with odds of -150 or better, which means you lean towards high-probability outcomes. By pairing three teams that usually have odds between -150 and -350 or even higher, you're not only aiming for consistent, modest returns, but you're also stacking the deck in your favor for a higher chance of winning. Remember that you can still parlay a favorite with odds of -140 or less to avoid laying 2.5 points, which can significantly impact your chances of winning. Remember, you have to win all three legs for a successful wager.According to BetMGM data, NFL moneyline favorites at -115 or shorter posted a 68% win percentage in 2023, with a 66.5% rate in 2022. Over the six-season period from 2018-2024, NFL moneyline favorites maintained a 66.6% win rate (1,013-508-7). The strength of favorites correlates directly with their odds. In sports betting, if you see teams with odds between -150 and -200, they generally have a solid chance of winning, with around a 60-65% success rate. Teams that are even bigger favorites, with odds from -250 to -400, tend to be more reliable, showing win rates of about 70% to 80%. The 2024 NFL season stood out for favorites, with an overall win rate hitting 71.8%.NFL favorites dominated the opening week, winning 13 of 16 games for an 81.2% success rate. The second Week saw more competitive results, with favorites winning 9 of 16 games for a 56.2% success rate. In Week 3 of the 2025 NFL season, 12 out of 16 favorites won outright, giving betting favorites a 75.0% success rate. In Week 4, favorites struggled on a relative basis, going 10-5-1. Three weeks ago, NFL betting favorites had their worst Week this season, going 8-5. In Week 6, NFL betting chalk bounced back by winning 11 of 15 games. Two Weeks ago, favorites had another excellent performance, going 12-3 after both chalk won on MNF. Favorites excelled in Week 8, achieving a remarkable 11-2 record with an average point differential of over 10 points.NFL betting favorites have won 86 out of 120 games in the first seven weeks of the 2025 season, achieving an overall success rate of 72.5%. This figure has exceeded last year's mark of 71.8%. What does this mean for Week 9? Will there be any upsets, or will the chalk continue to cash?Detroit Lions over Minnesota Vikings\nMinnesota faces a nightmare scenario with quarterback J.J. McCarthy returning from injury but having only two career regular-season starts under his belt. The Vikings' offensive line ranks 31st in sacks allowed per game (4.0) and just lost quarterback Carson Wentz to a season-ending shoulder injury.Detroit's pass rush will feast on Minnesota's 22nd-ranked pass blocking unit, and the Lions rank 31st in fantasy points allowed to opposing defenses—more than any other franchise. With running backs Jahmyr Gibbs and David Montgomery both healthy and the Vikings' defense ranking in the bottom 10 against the run, Detroit has multiple pathways to a dominant victory.The Lions have defeated the Vikings in five straight meetings, scoring at least 30 points in all five games. Detroit's offense performs at another level at home, and I expect another easy victory against a defense they know well. With a win projection of 79%, my model suggests taking the Lions as an easy parlay piece.Los Angeles Chargers over Tennessee Titans\nThe Chargers are riding momentum from a 37-10 demolition of Minnesota on Thursday Night Football, improving to 5-3 while enjoying extra rest before traveling to face the NFL's most dysfunctional franchise. Los Angeles ranks 17th in offensive EPA per play and features quarterback Justin Herbert at peak efficiency with the return of weapons like Ladd McConkey, who averaged 14.7 yards per catch last week. Getting a healthy Joe Alt back adds stability to the offensive line, enabling head coach Jim Harbaugh to implement his preferred game strategy.Tennessee sits at a dismal 1-7 with its only victory coming against the Arizona Cardinals in a wild fourth quarter comeback, and the Titans been outscored by 120 total points this season—a catastrophic point differential. They are 0-3 at home and have lost three consecutive games by double digits, while their defense ranks 28th in defensive EPA per play (0.10). The Chargers' defense has been stingy, allowing just 188 yards per game and creating advantageous field position that the offense has capitalized on. Tennessee lost four defensive starters in its Week 8 loss, creating even more mismatches for Herbert and company to exploit. The road team has a significant coaching advantage. Please suspend betting on the Titans until further notice.Indianapolis Colts over Pittsburgh Steelers\nI was very disappointed with the Steelers' performance against the Packers on Sunday Night Football. Something is definitely wrong with this Steelers team. Conversely, things could not be going any better in Indianapolis. The Colts own the NFL's best record at 7-1 and lead the league in total offensive yards (385.1 per game), establishing themselves as the AFC's top seed in the current playoff picture. Running back Jonathan Taylor has been unstoppable, recording multiple touchdowns in four of the Colts' last five games while the offense ranks third in quick passing and first in short passing efficiency.Pittsburgh enters on a two-game losing streak, with its defense suddenly vulnerable after allowing 68 points on 924 total yards in consecutive defeats. The Steelers rank 25th in defensive EPA per play (0.07), and their secondary ranks 30th and 24th, respectively, in defending quick and short passes—exactly where Indianapolis excels. Although Pittsburgh's run game ranks fourth in rushing DVOA and could challenge Indy's 24th-ranked total defense (which allows 345.1 yards per game), the Colts have excelled at limiting opponent success. The Steelers have many injuries on both sides of the ball. This is an excellent price on the Colts to improve to 8-1.Week 9 NFL money line underdogs parlay\nA popular option is available if you're willing to take on a bit more risk for a potentially higher reward. Underdog money line parlays offer the largest possible payouts in the NFL betting landscape. Combining three underdogs with odds like +200, +150, and +300 could result in payouts exceeding 20-to-1 or higher. The best part is that, due to the high payouts, underdog parlays can still be profitable even when winning only a small percentage of bets. For example, hitting just one of several large underdog parlays could offset multiple losses and generate overall profit. NFL underdogs have historically outperformed expectations in specific situations, with home underdogs of +2 to +3 winning outright 46-48% of the time.New York Giants over San Francisco 49ers\nThe New York Football Giants, at home getting plus-money against a struggling 49ers squad, present enormous value based on defensive matchups and efficiency metrics. New York's defense has been stout in converting yards into points, allowing just 14.9 yards per point—significantly better than San Francisco's offense, which requires 17.7 yards per point.I mentioned a few weeks ago that the Giants will be a team to \"play on\" once they make the switch off of Russell Wilson at quarterback. I have been mostly right. New York's new look offense features rookie dual-threat quarterback Jaxson Dart, who provides enough clock control to keep games close and limit possessions for San Francisco. The 49ers are just 1-1 against the spread as favorites of 2.5 points or greater this season, and computer simulations give them only a 55% win probability—hardly dominant enough to justify -155 moneyline odds.Let's fade the 49ers, who are playing back-to-back road games and their third in four weeks with a squad that's been missing many starters since the beginning of the season.Las Vegas Raiders over Jacksonville Jaguars\nBoth teams are coming off a Week 8 bye, but the Raiders should benefit more significantly from the extra rest. Las Vegas expects tight end Brock Bowers and wide receiver Jakobi Meyers to return from knee injuries. Their returns transform a struggling passing attack that ranks among the NFL's worst in passing yards (1,425 total) and touchdowns (seven).Even more importantly, Maxx Crosby, a star pass rusher, should be healthy. His Week 7 knee injury exit was described as precautionary, with NFL insider Ian Rapoport confirming it's \"not a major knee injury\" and Crosby is \"OK\". The Raiders essentially protected their best defensive player in a blowout loss, giving him two weeks to recover. He should feast on a Jaguars defense ranked 23rd in sacks allowed per game (2.9).The Raiders' defense excels precisely where the Jaguars' offense struggles most. Las Vegas has allowed at least five yards on just 36% of first-down plays this season—the best in the NFL (league average: 43%). Pete Carroll's track record suggests the Raiders will be more prepared. He's only started 2-5 or worse twice before (finishing 7-9 and 7-10 in those seasons). The veteran coach can rally teams during bye weeks for second-half surges.Jacksonville's road struggles are well-documented. The Jaguars are 2-12 in their last 14 road games and 1-1 on the road this season. Their two consecutive losses were against formidable NFC West opponents, and now they face a desperate Raiders team with everything to prove. Additionally, the Jaguars will be playing the Houston Texans in a look-ahead spot next week.Arizona Cardinals over Dallas Cowboys\nArizona represents the perfect buy-low candidate after losing five consecutive games—all by four points or fewer—indicating the Cardinals are significantly better than their 2-5 record suggests. The Cardinals' expected record is 3.5-4.5 wins per advanced metrics, meaning positive regression should arrive in close games.Dallas presents a catastrophic defensive situation, ranking 31st in defensive DVOA and allowing 31.3 points per game. The Cowboys' secondary is decimated by injuries, and six of their last seven games have featured 57+ total points, creating backdoor cover opportunities even when trailing. While Dallas averages 41.3 points per game at home, they rank just 28th in yards per play allowed and 22nd in offensive DVOA against strength of schedule.Arizona quarterback Kyler Murray returns from the bye week with extra preparation time, though he historically struggles in this spot (only one career win off the bye). However, the Cardinals rank 20th in defensive EPA per play, which should provide enough resistance to keep this game competitive in the high-scoring environment Vegas projects (54.5 total). At +130 for a team that's been competitive in every game, the value is clearly with the Cardinals.The Cardinals have a 1-6 SU record in post-bye week games, including 0-2 SU under head coach Jonathan Gannon. Facing the Cowboys' struggling defense and special teams coverage unit could be just what the road team needs to turn things around.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 9 betting: Lions, Raiders featured in expert's best money line parlays for favorites and underdogs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/9489f2e7-96ea-4a24-b037-b0878aa7028d/thumbnail/1200x675/be65ee9cb70c9b82b53bff5b363a79fc/genocarroll.jpg"
      ],
      "datePublished": "2025-10-29T15:53:15.000Z",
      "dateModified": "2025-10-29T15:53:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football QB Power Rankings: Pitt freshman star Mason Heintschel surges to No. 1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-qb-power-rankings-mason-heintschel-pittsburgh-breakout-freshman-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/a39268eb-9e5e-45d7-86d2-aaa9bbf82081/thumbnail/1200x675/01a599ff05a3139bff7981bd77057026/pitt-qb-power-rankings.png",
    "tag": "Sports",
    "date": "2025-10-29T15:37:37.000Z",
    "description": "\n        Most of college football still has no idea who Pitt quarterback Mason Heintschel is, but that will likely change in November. The Panthers cl",
    "body": "\n        Most of college football still has no idea who Pitt quarterback Mason Heintschel is, but that will likely change in November. The Panthers close the season with three games against teams currently ranked in the top 15, which will provide their star freshman a chance to introduce himself to the nation.Heintschel is 4-0 since taking over the starting job on Oct. 4, and he just earned ACC Rookie of the Week honors for the second time. His 423 yards in last week's 53-34 win over NC State set a freshman record at Pitt. It would be one thing if Heintschel were a former five-star prospect who was pursued by a long list of Power Four programs.In that scenario, his breakout would be a bit less surprising. But Heintschel's journey to becoming one of college football's top freshman stars looked much different. The Oregon, Ohio, native was ranked the No. 43 quarterback in the Class of 2025 by 247Sports and chose the Panthers over programs like Akron, Bowling Green and Coastal Carolina. He was unheralded and overlooked, but Heintschel is making a name for himself and rejuvenating the Pat Narduzzi era at Pitt. The program was just 10-15 over its past two seasons before this year. At 6-2 this year and with Heintschel in the fold, the future suddenly looks much brighter.\nThese rankings are not a Heisman forecast, draft projection or season-long outlook. They are a real-time reaction to performance, weighing competition, game pressure and production. With that, here are this week's power rankings of college football's top 50 quarterbacks.1. Mason Heintschel, PittPitt is 4-0 since Heintschel took over the starting job at the beginning of October. Since then, the unheralded freshman leads the ACC in yards, touchdowns and quarterback rating. In a 53-34 win vs. NC State last week, he became the ACC's first freshman in 30 years to pass for 400+ yards and three touchdowns in the same game. Not bad for a three-star prospect. Last week: 432. Haynes King, Georgia TechKing leads the ACC in rushing touchdowns with 12 and is third in rushing yards with 651. He is the driving force behind Georgia Tech's 8-0 start and is coming off another prolific performance. King threw for a season-best 304 yards and three touchdowns in a 41-16 win over Syracuse. Last week: 4\n3. Fernando Mendoza, IndianaMendoza had an easy day at the office in Indiana's 56-6 win over UCLA, tossing three touchdowns in two and a half quarters of work. That was enough to keep him atop the national leaderboard in passing touchdowns at 24 as the Hoosiers hit the road for consecutive road games against Maryland and Penn State. Last week: 24. Julian Sayin, Ohio StateSayin leads the nation in passing efficiency and completion percentage (80%) as Ohio State prepares to host Penn State. The redshirt freshman is leaving little doubt over why he was ranked the No. 1 quarterback in the Class of 2024 by the 247Sports Composite. Last week: 35. Ty Simpson, AlabamaTy Simpson was just 16 of 34 at one point, but he delivered in the clutch during Alabama's win at South Carolina last week. What else is new? The redshirt junior is in his first season as a starter but brings the poise of an NFL veteran during decisive moments. He is up to 20 touchdowns with just one interception for the season. Last week: 1\n6. Marcel Reed, Texas A&MReed threw a couple of interceptions in the first half but ran for a career-high 108 yards in Texas A&M's bludgeoning of LSU on the road last week. The Aggies have surrendered just seven sacks all season, which is the fewest of any team in the SEC. That's due in part to Reed's elusiveness and pocket awareness. Last week: 67. Trinidad Chambliss, Ole MissChambliss keeps checking off new boxes on his storybook ride from unheralded Division II transfer to SEC starting quarterback. His latest accomplishment was a top-15 road win at Oklahoma. Chambliss surpassed 300 yards passing for the fourth time in six starts while outperforming OU's John Mateer. Last week: 138. Bear Bachmeier, BYUBachmeier continues to show why he was the first BYU true freshman to ever start a season opener. His latest conquest was a 307-yard passing performance in a road win over an Iowa State team that had gone 21 straight games without allowing an opposing QB to reach 300 yards. He also leads the Cougars in rushing touchdowns with nine. Last week: 14\n9. Brendan Sorsby, CincinnatiThe Big 12 is deep with great quarterbacks, and Sorsby is right there with the best of them. He led the Bearcats to a seventh straight victory with his seventh straight interception-free performance last week against Baylor. It was a statistically underwhelming effort — Sorsby threw for just 111 yards — but he added 85 yards and a touchdown on the ground. Last week: 510. Dante Moore, OregonMoore was unspectacular in Oregon's 21-7 win over Wisconsin last week as he completed just 9 of 15 passes for 86 yards without a touchdown. But that was largely a byproduct of the Ducks' conservative, run-heavy approach. His body of work — highlighted by 19 touchdowns and just four interceptions — remains impeccable. Last week: 911. Gunner Stockton, GeorgiaStockton has scored as a runner in five of seven games while using his legs to provide a level of dynamic quarterback play that was missing for the Bulldogs during Carson Beck's tenure at UGA. He was unflappable in victories over top-15 foes Tennessee and Ole Miss and has been intercepted just once so far in his first season as the starter. Last week: 10\n12. Jayden Maiava, USCMaiava is fifth nationally in passing efficiency and leads the Big Ten in yards per attempt at 10.2. With a couple of home run threats established at receiver in Makai Lemon and Ja'Kobi Lane, the Trojans are poised to continue putting up big passing numbers. Maiava's draft stock will be interesting to monitor, as he's well-positioned for a potential rise if he can close the season with a bang. Last week: 1113. Diego Pavia, VanderbiltPavia was his usual, gritty self in Vanderbilt's 17-10 win over Missouri. It wasn't perfect, but he presided over a winning operation. You won't find his name atop the national rankings in any major statistical categories, but the counting stats don't begin to explain Pavia's impact on a Commodores team nearing the doorstep of a CFP appearance. Last week: 814. Byrum Brown, South FloridaBrown and the South Florida offense cooled off at the wrong time, as the Bulls faded late in a 34-31 loss at Memphis last week. But he still totaled a whopping 390 yards and three touchdowns as a passer and runner. USF harbors legitimate CFP aspirations thanks largely to one of the sport's most dynamic QBs. Last week: 7\n15. Joey Aguilar, TennesseeAguilar extended his edge as the SEC's leader in passing yards by throwing for a season-best 396 in Tennessee's 56-34 win at Kentucky. The former App State gunslinger has returned the vertical explosiveness to the Volunteers' passing game. His 31 completions of 20+ yards are tied for tops in the league. Last week: 1516. Conner Weigman, HoustonWeigman is making a name for himself in a conference full of great quarterbacks. He was tabbed the league's offensive player of the week for the second straight week after helping Houston reach 7-1 (4-1 Big 12) with a 24-16 win at Arizona State. The Texas A&M transfer threw for 201 yards and a touchdown while rushing for 111 yards and another two scores. Last week: 2517. Evan Simon, TempleTemple's new staff wanted Trinidad Chambliss, who ended up at Ole Miss. But Simon is working out quite well as a holdover from the prior regime. He is up to 21 touchdowns without an interception and has guided the Owls to within one win of reaching bowl eligibility for the first time since 2019. Last week: 34\n18. Blake Horvath, NavyHorvath is once again feasting on AAC defenses. He totaled season highs in rushing yards (174) and touchdowns (four) during Navy's 42-32 win at FAU last week. Navy's finishing stretch is absolutely brutal, but Horvath's playmaking will give the Midshipmen a chance to pull an upset or two. Last week: 3019. Josh Hoover, TCUHoover is prone to the occasional head-scratching misfire. But he was interception-free in a pair of tight wins over Baylor and West Virginia the last two weeks. TCU has a bye this week before a tough finishing stretch against four of the Big 12's best teams that will require Hoover to be dialed in. Last week: 1220. Demond Williams, WashingtonWilliams flushed the frustration of a poor showing from a loss to Michigan and rebounded by torching Illinois for 280 yards and four touchdowns. The undersized sophomore is also skilled in the art of running around and making things happen with his legs. Last week: 37\n21. Darian Mensah, DukeLast week: 2422. Joe Fagnano, UConnLast week: 1723. CJ Carr, Notre DameLast week: 1924. Drew Mestemaker, North TexasLast week: unranked25. Avery Johnson, Kansas StateLast week: 3626. Carson Beck, MiamiLast week: 3827. Alonza Barnett III, James MadisonLast week: 4028. Sam Leavitt, Arizona StateLast week: 1629. Anthony Colandrea, UNLVLast week: 2930. Taylen Green, ArkansasLast week: 1831. John Mateer, OklahomaLast week: 2032. Jalon Daniels, KansasLast week: 2133. Noah Fifita, ArizonaLast week: 3234. Luke Altmyer, IllinoisLast week: 2235. CJ Bailey, NC StateLast week: 3536. Chandler Morris, VirginiaLast week: 2937. Sawyer Robertson, BaylorLast week: 2638. Rocco Becht, Iowa StateLast week: 2339. Braylon Braxton, Southern MissLast week: unranked40. Bryce Underwood, MichiganLast week: 3141. Kevin Jennings, SMULast week: 3942. Dylan Raiola, NebraskaLast week: 4143. Jake Retzlaff, TulaneLast week: 4244. Micah Alejado, HawaiiLast week: 4945. Colton Joseph, Old DominionLast week: unranked46. Miller Moss, LouisvilleLast week: 46\n47. Malik Washington, MarylandLast week: 4748. Walker Eget, San Jose StateLast week: 4849. Jaron-Keawe Sagapolutele, CalLast week: 5050. Athan Kaliakmanis, RutgersLast week: unranked\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football QB Power Rankings: Pitt freshman star Mason Heintschel surges to No. 1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/a39268eb-9e5e-45d7-86d2-aaa9bbf82081/thumbnail/1200x675/01a599ff05a3139bff7981bd77057026/pitt-qb-power-rankings.png"
      ],
      "datePublished": "2025-10-29T15:37:37.000Z",
      "dateModified": "2025-10-29T15:37:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Series X-factors: What Dodgers, Blue Jays need to capture the title - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/world-series-2025-dodgers-blue-jays-x-factors-game-5/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/6b1a406d-4d36-4227-80ee-d9d9d33183db/thumbnail/1200x675/aae78d6a8399f4ee4d6edb26209733ba/tommy-edman-getty-2.png",
    "tag": "Sports",
    "date": "2025-10-29T17:08:23.000Z",
    "description": "\n        The World Series is down to a best-of-three. Tuesday night the Blue Jays impressively bounced back from the 18-inning marathon loss in Game 3",
    "body": "\n        The World Series is down to a best-of-three. Tuesday night the Blue Jays impressively bounced back from the 18-inning marathon loss in Game 3 to even the series their series with the Dodgers at two games apiece (TOR 6, LAD 2). This guarantees the World Series will end north of the border at Rogers Centre in Game 6 on Friday or Game 7 on Saturday. \"I feel really good about this team every night,\" Blue Jays manager John Schneider said after the Game 4 win. \"It's hard to play 18  innings and come back and kind of flip the narrative against a very  talented team and a very talented individual in Shohei Ohtani on the  mound.  I feel really good about just us focusing on [Wednesday's] game.\" Historically, teams that take a 3-2 lead in a best-of-seven have gone on to win the series 70% of the time, though you needn't look back far to see the last time a team came back from 3-2. The Blue Jays did it against the Mariners in the ALCS last week. Still, I'm sure the Blue Jays would rather go back to Toronto up 3-2 than down 3-2. Same for the Dodgers, of course. We've reached the pitching rematch portion of the World Series. It'll be Blake Snell vs. Trey Yesavage in Game 5, same as Game 1, when neither pitched especially well. Yesavage didn't have his splitter that night and went only four innings. Snell needed 100 pitches to get through five-plus innings, allowing Toronto to go to work on the bullpen (which led to a nine-run inning). \nHere now are two key factors for each team heading into the final two or three games of the World Series.  Los Angeles Dodgers The rest of the offense has to show upIt is not really flying under the radar anymore than the Dodgers' offense other than the singular Ohtani and the great Freddie Freeman isn't doing much of anything. Since the start of the NLDS, Ohtani and Freeman are hitting a combined .253/.388/.589 with eight home runs in 116 plate appearances. The rest of the Dodgers: .210/.290/.306 with seven homers in 375 plate appearances. This says it all about the Dodgers' World Series offense: \nMuch has been made about Toronto's high-contact offense, but the Blue Jays and Dodgers have similar strikeout rates this series (19.3% vs. 21.6%). The larger problem is the Dodgers have hit a ton of weak pop ups and fly balls, which are easy outs. The Blue Jays have a 20.9% to 15.0% edge in line drive rate and, relatedly, a .300 to .239 edge in batting average on balls in play.\nAfter Game 4, manager Dave Roberts said he's \"going to think long and hard and (the lineup) might look a little bit different\" in Game 5, though he has only so many options available. He can sit Andy Pages and Kiké Hernández, and replace them in the lineup with Alex Call and Miguel Rojas, and that's about it. The Dodgers have a shockingly thin bench for a team with that payroll. Rearranging the lineup is an option -- I'd bat Ohtani and Freeman 1-2 to get them the most at-bats, and also because the Blue Jays don't have a dominant lefty reliever to throw at them in the late innings -- but that's all that is, rearranging. It's simple: Either Mookie Betts, Teoscar Hernández, Max Muncy, et al will start hitting and the Dodgers will have a great chance, or they don't and they won't.It's time to put Treinen on the back-burnerThe entire bullpen is shaky, so perhaps it's unfair to single out Blake Treinen, but he's allowed four runs and 12 baserunners in 4 ⅓ innings this postseason, and 14 runs and 32 baserunners in his last 12 innings dating back to the regular season. He's clearly a liability and yet Roberts keeps using him in high leverage situations. Roberts must treat Treinen as the last guy in the bullpen.\nSimilar to the bench, the Dodgers' have a shockingly weak bullpen for a team with that payroll. Roki Sasaki and Emmet Sheehan are their two most reliable righty relievers at this point, and it's probably worth giving Edgardo Henriquez (and Game 4 hero Will Klein?) more responsibility. Roberts has only so many options available to him. It's clear now though Treinen is the worst of them. Yoshinobu Yamamoto showed the best way to handle the bullpen in Game 2: throw a complete game. That's unrealistic, you can't expect complete games in this age, but the more length the Dodgers get out of their starters, the better. I mean heck, Ohtani pitched into the seventh inning in Game 4 and even that wasn't enough. The on-paper rotation advantage the Dodgers have must show up.  Toronto Blue Jays The more Bichette, the betterBo Bichette returned to the lineup in the World Series after missing seven weeks with a knee injury, and it's impossible to tell he had such a long layoff. He is 4 for 11 (.364) with two walks and one strikeout in the World Series, and two of his four hits would've been doubles had Bichette been able to run at 100%. He's returned to the lineup and been an immediate difference-maker.\n\"I'll never count Bo out against anybody with a bat in his hand at any  point in the calendar year,\" Schneider said after Game 4. \"... I think that he's been  pretty locked in since the start of the series with the bat in his  hands.\" George Springer is day-to-day with a side injury, which allowed Bichette to DH and play the entire game in Game 4. In his two starts a second base, he was replaced for a pinch-runner/defensively late, and that was especially costly in the Game 3 marathon. Isiah Kiner-Falefa wound up getting more plate appearances (five) than Bichette (four) despite entering in the seventh inning.Springer is still on the roster, which means the Blue Jays expect him to play again at some point, even if only as a pinch-hitter. As long as he's out of the lineup, Bichette can DH. That's really the only upside to Springer being hurt. The Blue Jays want both guys in the lineup, not one or the other. It's unclear if that will be possible at any point the rest of the series. \nIf Springer does return to the lineup though, we're at the point in the series and on the calendar where the Blue Jays should just run Bichette out there at second base and leave him in the entire game, even late in close games. The bullpens are both so combustible that Bichette's bat will likely be more valuable than Kiner-Falefa's glove (which is OK, not spectacular) in the late innings. Game 5 is Wednesday. Thursday is an off day, then it's Games 6 and 7 on Friday and Saturday. The schedule allows Bichette to rest the day after Game 5. In Game 6, the Blue Jays will either have a chance to win the World Series or need to win to extend their season. In either case, you want Bichette playing the entire game. The same goes for Game 7. Yesavage getting a second windGame 1 was not easy for Yesavage. He was charged with only two runs in four innings, but the Dodgers worked him hard, and at one point seven of 10 batters reached base. Yesavage threw only 10 splitters in Game 1 because he simply didn't have feel for the pitch. Also, his velocity was down, as he failed to crack 95 mph for the second straight start.\nHere is Yesavage's maximum velocity in his seven big league starts (regular season and postseason): Yesavage's top-end velocity hasn't been there in his last two starts. \n                                                                    Brooks Baseball\n                                                            That looks like a young pitcher running out of gas now that he's well over his previous career high in innings and also pitching deeper into the year than ever before. You can even see it within his starts. In Game 1, Yesavage's fastball averaged 94.9 mph in the first inning, 93.9 mph in the second, 93.8 mph in the third, and 92.9 mph in the fourth. That's a pretty big in-game drop off. Velocity is not everything, but there is a big difference between sitting 94-95 mph and topping out at 97 mph like Yesavage did much of the year, and sitting 92-93 mph and topping out at 95 mph like Yesavage did in Game 1. Velocity will help the splitter play up and also just give Yesavage more margin of error. The faster the pitch, the less time the hitter has to react. Baseball 101. \nYesavage looks worn down. So does everyone playing in the World Series, but he's a young pitcher, and in uncharted workload territory. Game 5 will be his final start of 2025 one way or the other. Can he find a second wind and have a better fastball? It would make a world of difference, especially now that the Dodgers are getting a second look at him. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Series X-factors: What Dodgers, Blue Jays need to capture the title - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/6b1a406d-4d36-4227-80ee-d9d9d33183db/thumbnail/1200x675/aae78d6a8399f4ee4d6edb26209733ba/tommy-edman-getty-2.png"
      ],
      "datePublished": "2025-10-29T17:08:23.000Z",
      "dateModified": "2025-10-29T17:08:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]