[
  {
    "title": "Jayden Daniels injury: Commanders star QB severely hurts left elbow late on 'SNF' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jayden-daniels-injury-update-elbow-arm-washington-commanders-qb-seahawks-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/08d6a6ce-3428-4b0a-8d28-8a8266294b1f/thumbnail/1200x675/9087d8b62b486db8338e42b51e95f4f2/jayden-daneils-arm-elbow-injury-g.jpg",
    "tag": "Sports",
    "date": "2025-11-03T04:57:59.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        LANDOVER, Md. -- Commanders quarterback Jayden Dan",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        LANDOVER, Md. -- Commanders quarterback Jayden Daniels suffered a serious left elbow injury with less than 8 minutes remaining in Washington's Week 9 \"Sunday Night Football\" game at home against the Seattle Seahawks. The Seahawks led 38-1 at the time and ultimately prevailed 38-14, having dominated from the onset of the game.Daniels was scrambling to the right sideline when Seahawks linebacker Drake Thomas tackled him. As Daniels rolled over, he tried to use his non-throwing arm to steady himself; however, upon landing on the grass, his left elbow appeared to bend inwards at an unnatural angle.Commanders medical staffers rushed onto the field, bracing Daniels' left elbow and arm before the franchise's star signal caller walked off the field being steadied as he entered the tunnel.\nIt has been a difficult sophomore season for Daniels, who missed two games with an ankle injury incurred in Week 2 against the Packers and sat out of Washington's Week 8 game with a hamstring injury suffered against the Cowboys in his prior game.The Commanders have been badly hampered by injuries all season. After a magical 12-5 campaign in 2024 that included Daniels winning Offensive Rookie of the Year, Washington ended Sunday night 3-6. Daniels was 16 of 22 for 153 yards with an interception; he also carried 10 times for 51 yards and a touchdown.\nMarcus Mariota, who started all three games Daniels previously missed this season, replaced Daniels and completed a touchdown drive. The Commanders are 1-2 with Mariotta starting this season.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jayden Daniels injury: Commanders star QB severely hurts left elbow late on 'SNF' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/08d6a6ce-3428-4b0a-8d28-8a8266294b1f/thumbnail/1200x675/9087d8b62b486db8338e42b51e95f4f2/jayden-daneils-arm-elbow-injury-g.jpg"
      ],
      "datePublished": "2025-11-03T04:57:59.000Z",
      "dateModified": "2025-11-03T04:57:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sunday Night Football NFL DFS picks, lineup advice for Seahawks vs. Commanders on FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-seahawks-commanders-fanduel-draftkings-daily-fantasy-picks-lineups-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:36:30.000Z",
    "description": "\n        The Seattle Seahawks cross the country to take on the Washington Commanders on 'Sunday Night Football' in the penultimate game on the Week 9 ",
    "body": "\n        The Seattle Seahawks cross the country to take on the Washington Commanders on 'Sunday Night Football' in the penultimate game on the Week 9 NFL schedule at 8:20 p.m. ET. Jayden Daniels (hamstring) is off the injury report, infusing more interest into this matchup for NFL DFS players. Should you build around him in your NFL DFS lineups despite his recent injury, or are others better options? Potential SNF DFS sleepers include Jeremy McNichols, AJ Barner and Luke McCaffrey.With an over/under of 48 points, offense should be aplenty in this matchup, so there are plenty of ways to go for NFL DFS picks. Before locking in any NFL DFS picks for Commanders vs. Seahawks on sites like DraftKings and FanDuel, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him is way up.Now, McClure has turned his attention to Sunday Night Football and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top NFL DFS picks for Seahawks vs. CommandersOne of McClure's top NFL DFS picks for Sunday Night Football is Seahawks quarterback Sam Darnold. Darnold has been among the most efficient quarterbacks in the league this season, completing 68.2% of his passes for 12 touchdowns and four interceptions and only taking nine sacks.Opposing quarterbacks have feasted against the Commanders, as they have given up the 28th most Fantasy points to the position. Each of the last two quarterbacks they've faced have had three touchdown passes, in addition to at least 270 total yards. In what should be a competitive, higher-scoring game, look for Darnold to return value against a porous secondary. See who else to roster here.Part of McClure's optimal NFL DFS strategy also includes stacking Darnold with wide receiver Jaxon Smith-Njigba in an effort to further capitalize on the matchup. Smith-Njigba has been the clear-cut No. 1 receiver in Seattle with a 50-819-4 receiving line this season. He's scored in three straight games and has averaged a whopping 13.5 targets over the past two weeks.The Commanders rank 22nd in the NFL in Fantasy points given up to opposing receivers. They've allowed wideouts to post games with 90-plus yards, and a touchdown, in back-to-back weeks, so McClure loves this NFL DFS stack on Sunday night. See who else to roster here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:How to set NFL DFS lineups for Commanders vs. SeahawksMcClure is targeting another undervalued player who could explode for huge numbers on Sunday Night Football. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Sunday Night Football, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sunday Night Football NFL DFS picks, lineup advice for Seahawks vs. Commanders on FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2025-11-03T00:36:30.000Z",
      "dateModified": "2025-11-03T00:36:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sunday Night Football odds, prediction: Seahawks vs. Commanders picks, best bets from expert on 25-14 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-spread-seahawks-commanders-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/2299db99-feca-494e-aecc-41b049f96667/thumbnail/1200x675/a5f4f05a70492144c0b4b3c300f584a1/sam-darnold-seattle-seahawks-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:26:37.000Z",
    "description": "\n        The Washington Commanders will look to snap a three-game losing streak when they take on the Seattle Seahawks on Sunday Night Football. Comma",
    "body": "\n        The Washington Commanders will look to snap a three-game losing streak when they take on the Seattle Seahawks on Sunday Night Football. Commanders quarterback Jayden Daniels will return after missing last week with a hamstring injury. The Seahawks (5-2), who are tied for first in the NFC West with the Los Angeles Rams, are 3-0 on the road this season, having also covered in all three. The Commanders (3-5), who are third in the NFC East, have a 2-1 straight-up and against-the-spread record on their home field.Kickoff from Northwest Stadium in Landover, Md., is set for 8:20 p.m. ET. The Commanders lead the all-time series 13-10, but the Seahawks have won four of the last six meetings. Seattle is a 2.5-point favorite in the latest Seahawks vs. Commanders odds from SportsLine consensus, while the over-under for total points scored is 48.5, a 2.5-point increase from opening at 46. Seattle is at -153 on the money line (risk $153 to win $100), with Washington at +130 (risk $100 to win $130). Before making any Commanders vs. Seahawks picks, make sure you check out what SportsLine expert, Emory Hunt, has to say. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins:Hunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007, and a former running back at Louisiana-Lafayette. He knows the game from a player's perspective. Hunt's dedication to analysis of all levels of college and professional football helped go 88-67-2 (+1474) on all NFL picks over the past two years. He is also 25-14 (+957) on his last 39 against-the-spread picks in Seattle Seahawks games.     Anyone who has followed him could be way up.Now, Hunt has zoned in on Seahawks vs. Commanders. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Commanders vs. Seahawks:Seahawks vs. Commanders                 spreadSeattle -2.5 at DraftKings SportsbookSeahawks vs. Commanders                 over/under48.5 pointsSeahawks vs. Commanders                 money line Seattle -153, Washington +130Seahawks vs. Commanders                 picksSee picks at SportsLineSeahawks vs. Commanders                 streaming Fubo (Try for free)   Why the Seahawks can coverVeteran quarterback Sam Darnold helps lead the Seattle offense. In seven games this season, he has completed 131 of 192 passes (68.2%) for 1,754 yards and 12 touchdowns with just four interceptions for a 109.2 rating. In a 38-35 loss to the Tampa Bay Buccaneers, he completed 28 of 34 passes (82.4%) for 341 yards and four touchdowns with just one interception. He was 17 of 31 passing for 213 yards and one touchdown with one pick in a 27-19 win over the Houston Texans on Oct. 20.Third-year wide receiver Jaxon Smith-Njigba is Darnold's top target. In seven games, he has 50 receptions for 819 yards (16.4 average) and four touchdowns. He has 14 explosive plays of 20 yards or more, including a season-long 61 yards. He has 188 yards after the catch and 36 first-down conversions. In the win over the Texans, he caught eight passes for 123 yards and one touchdown. See which team to back at SportsLine. Why the Commanders can coverDespite the uncertainty at quarterback, Washington is led by running back Jacory Croskey-Merritt. In eight games, he has rushed 82 times for 402 yards (4.9 average) and four touchdowns. He has two explosive plays of 20 or more yards, including a long of 42, as well as 24 first-down conversions. In the passing game, he has seven receptions for 60 yards, including a long of 28. In a 27-10 win over the Los Angeles Chargers, he carried 14 times for 111 yards (7.9 average) and two touchdowns.Seventh-year veteran wide receiver Deebo Samuel has made an impact in the passing attack. In seven games, he has 37 receptions for 326 yards (8.8 average) and three touchdowns. He has four explosive plays, with a long of 24, as well as 185 yards after the catch. He has also rushed for a 19-yard score. In the win over the Chargers, he caught eight passes for 96 yards and one touchdown. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code to get $300 in bonus bets after placing a $5 bet:How to make Seahawks vs. Commanders picksHunt is leaning Under the total, and has found a critical x-factor that has him jumping on one side of the spread. See what it is at SportsLine.Who covers in Commanders vs. Seahawks and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the Seahawks vs. Commanders spread you need to jump, all from the expert who returned $957 to $100 players over his last 39 Seattle Seahawks picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sunday Night Football odds, prediction: Seahawks vs. Commanders picks, best bets from expert on 25-14 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/2299db99-feca-494e-aecc-41b049f96667/thumbnail/1200x675/a5f4f05a70492144c0b4b3c300f584a1/sam-darnold-seattle-seahawks-cbs.jpg"
      ],
      "datePublished": "2025-11-03T00:26:37.000Z",
      "dateModified": "2025-11-03T00:26:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB Gold Glove winners: Cubs lead with three honorees, see full list - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2025-mlb-gold-glove-award-winners-cubs-lead-with-three-honorees/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/1250181a-fe15-4c4b-aff6-97088d38fc62/thumbnail/1200x675/1aeb398f493afa19dd31a7b3cc7da7f1/pca-getty-1.png",
    "tag": "Sports",
    "date": "2025-11-03T02:56:53.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The winners for the 2025 Rawlings Gold Glove were ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The winners for the 2025 Rawlings Gold Glove were announced Sunday night by Major League Baseball.          Gold Gloves have be awarded since 1957 and are given to the best  defensive player at each position in each league. That first year was one MLB-wide honor at each position. In 1958, Gold Gloves were split into AL and NL. Also, it used to be three outfielders per league regardless of exact position. Now the outfield spots are broken down into left field, center field, and right field.        Winners are determined through manager/coach voting (75%) and a statistical component (25%). Team  employees can not vote for their own players.         While MLB  released \"finalists\" for the award a few weeks back, remember that the  voting was already complete and the finalists are simply the top three vote-getters at each position. This means, obviously, postseason  performance had no impact.         \nHere are this year's Gold Glove winners.                  American League         PositionWinnerFinalistsCatcher \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tDillon Dingler (Tigers) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tAlejandro Kirk (Blue Jays); Carlos Narváez (Red Sox) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tFirst base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tTy France (Twins/Blue Jays) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tVladimir Guerrero Jr. (Blue Jays); Carlos Santana (Guardians) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tSecond base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMarcus Semien (Rangers) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tAndrés Giménez (Blue Jays); Luis Rengifo (Angels) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tShortstop \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tBobby Witt Jr. (Royals) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCorey Seager (Rangers); Taylor Walls (Rays) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tThird base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMaikel Garcia (Royals) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tErnie Clement (Blue Jays); José Ramírez (Guardians) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tLeft field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tSteven Kwan (Guardians) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tWyatt Langford (Rangers); Tyler Soderstrom (Athletics) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCenter field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCeddanne Rafaela (Red Sox) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tKyle Isbel (Royals); Julio Rodríguez (Mariners) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tRight field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tWilyer Abreu (Red Sox) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tAdolis García (Rangers); Cam Smith (Astros) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tPitcher \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMax Fried (Yankees) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tJacob deGrom (Rangers); Luis Severino (Athletics) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tUtility \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMauricio Dubón (Astros) \t\t\t\tErnie Clement (Blue Jays); Daniel Schneemann (Guardians) \t\t\t\t         National League         PositionWinnerFinalistsCatcher \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tPatrick Bailey (Giants) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCarson Kelly (Cubs); Luis Torrens (Mets) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tFirst base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMatt Olson (Braves) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tBryce Harper (Phillies); Spencer Steer (Reds) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tSecond base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tNico Hoerner (Cubs) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tXavier Edwards (Marlins); Brice Turang (Brewers) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tShortstop \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMasyn Winn (Cardinals) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tNick Allen (Braves); Mookie Betts (Dodgers) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tThird base \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tKe'Bryan Hayes (Pirates/Reds) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tRyan McMahon (Rockies/Yankees); Matt Shaw (Cubs) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tLeft field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tIan Happ (Cubs) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tTommy Pham (Pirates); Kyle Stowers (Marlins) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCenter field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tPete Crow-Armstrong (Cubs) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tVictor Scott II (Cardinals); Jacob Young (Nationals) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tRight field \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tFernando Tatis Jr. (Padres) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tCorbin Carroll (Diamondbacks); Sal Frelick (Brewers) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tPitcher \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tLogan Webb (Giants) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tMatthew Boyd (Cubs); David Peterson (Mets) \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tUtility \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tJavier Sanoja (Marlins) \t\t\t\tMiguel Rojas (Marlins); Jared Triolo (Pirates) \t\t\t\t\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB Gold Glove winners: Cubs lead with three honorees, see full list - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/1250181a-fe15-4c4b-aff6-97088d38fc62/thumbnail/1200x675/1aeb398f493afa19dd31a7b3cc7da7f1/pca-getty-1.png"
      ],
      "datePublished": "2025-11-03T02:56:53.000Z",
      "dateModified": "2025-11-03T02:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaguars' Travon Walker ejected vs. Raiders after throwing punch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jaguars-travon-walker-ejected-vs-raiders-after-throwing-punch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/67d2ce51-fc28-435f-a222-e62fb1707948/thumbnail/1200x675/db2c13ed73ef25a7051f2d8af39a8207/travon.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:55:33.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Jacksonville Jaguars will have to finish out t",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Jacksonville Jaguars will have to finish out their Week 9 matchup vs. the Las Vegas Raiders without former No. 1 overall pick Travon Walker, as he was ejected for throwing a punch in the third quarter.As Daniel Carlson knocked through a 24-yard field goal to give the Raiders a 9-6 lead, Walker threw a nasty punch at offensive linemen Stone Forsythe. It's unclear why, but both Walker and Forsythe were penalized for personal fouls. Walker, however, was also ejected.Check out what happened, here:\nWalker was fined $11,817 last year for fighting against the Minnesota Vikings, although he was not ejected. So far this season, the Georgia product has recorded 14 combined tackles, two sacks and five QB hits in six games played. \nLast month, we saw Detroit Lions defensive back Brian Branch receive a one-game suspension for sparking a melee following a prime-time loss to the Kansas City Chiefs. Walker could face some form of discipline for his actions on Sunday as well. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaguars' Travon Walker ejected vs. Raiders after throwing punch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/67d2ce51-fc28-435f-a222-e62fb1707948/thumbnail/1200x675/db2c13ed73ef25a7051f2d8af39a8207/travon.jpg"
      ],
      "datePublished": "2025-11-02T23:55:33.000Z",
      "dateModified": "2025-11-02T23:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Commanders props, 'Sunday Night Football' player projections from SportsLine AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-commanders-nfl-player-props-ai-picks-bets-jayden-daniels-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/cfb49fb5-b79d-4dbd-9404-47195e316f1f/thumbnail/1200x675/ac7437bd45e8a0294b046472bcee8dc8/jayden-daniels.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:31:39.000Z",
    "description": "\n        NFC teams with playoff aspirations clash when the Seattle Seahawks meet the Washington Commanders in NFL Week 9 'Sunday Night Football' at 8:",
    "body": "\n        NFC teams with playoff aspirations clash when the Seattle Seahawks meet the Washington Commanders in NFL Week 9 'Sunday Night Football' at 8:20 p.m. ET from Northwest Stadium in Landover, Md. The Seahawks (5-2) co-lead the NFC West, while the Commanders (3-5) are third in the NFC East. The game will showcase Seahawks quarterback Sam Darnold against Commanders quarterback Jayden Daniels, who missed last week and is returning from a hamstring injury. Both players figure into several NFL player props.Daniels has been solid, completing 61% of his passes for 1,031 yards and eight touchdowns while also rushing for 211 yards and one touchdown. Darnold, meanwhile, has been dominant. In seven games, he has completed 68.2% of his passes for 1,754 yards and 12 touchdowns. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Kenneth Walker III, Cooper Kupp and Jaxon Smith-Njigba of Seattle or Jacory Croskey-Merritt, Deebo Samuel and Zach Ertz of Washington. Before betting any Seahawks vs. Commanders props for Sunday Night Football, you need to see the Seahawks vs. Commanders prop predictions powered by SportsLine's Machine Learning Model AI.New users can also target the DraftKings promo code, which offers $300 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Seahawks vs. Commanders NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Commanders vs. Seahawks prop picks. You can only see the Machine Learning Model player prop predictions for Seahawks vs. Commanders here.Top NFL player prop bets for Seahawks vs. CommandersAfter analyzing the Seahawks vs. Commanders props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Commanders QB Daniels goes Under 227.5 passing yards (-114). Daniels is coming back from a hamstring injury and may have some limitations on Sunday. In five games, he has gone under 227.5 yards passing three times, including in a 44-22 loss at Dallas on Oct. 19, where he had just 156 yards passing. He will also be without wide receiver Terry McLaurin and facing a defense that ranks in the top five in both passer rating allowed and yards per completion given up.In a 25-24 loss to the Chicago Bears on Oct. 13, he completed 19 of 26 passes for 211 yards and three touchdowns with one interception. In 17 games last season, he threw for 227 or fewer yards in 10 games. In seven games this season, Seattle's defense has allowed 228 or fewer yards three times. The SportsLine Machine Learning Model projects Daniels to have 182 passing yards and gives this prop a 5-star prop rating. See more NFL props here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make NFL player prop bets for Seahawks vs. CommandersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has four additional NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Commanders vs. Seahawks prop bets for Sunday Night Football.Which Seahawks vs. Commanders prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Seahawks vs. Commanders props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Commanders props, 'Sunday Night Football' player projections from SportsLine AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/cfb49fb5-b79d-4dbd-9404-47195e316f1f/thumbnail/1200x675/ac7437bd45e8a0294b046472bcee8dc8/jayden-daniels.jpg"
      ],
      "datePublished": "2025-11-02T23:31:39.000Z",
      "dateModified": "2025-11-02T23:31:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 9 breakouts: Parker Washington earns a role worth stashing in leagues now, plus more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-9-early-waiver-wire-breakouts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/10/20/c8139aa2-be6e-44df-a439-d0373acdf3f1/thumbnail/1200x675/2310e462091695fc2876d3c61b586ff5/usatsi-parker-washington-jaguars-practice.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:20:46.000Z",
    "description": "\n        In Week 9, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and ",
    "body": "\n        In Week 9, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 10 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Terrell Jennings, RB, PatriotsWith Rhamondre Stevenson sidelined, Jennings played a key role in the Patriots rushing attack. He led the team in rushing attempts with 11 -- a good sign on his own -- and he got the red zone opportunity -- an even better sign. Jennings scored a touchdown with 35 yards on 11 carries. He also added a reception for nine yards. If Stevenson's injury lingers, Jennings has some intrigue as a Flex play with a lead on the red zone role in a high-octane scoring offense facing an easy schedule rest of season.Parker Washington, WR, JaguarsWith Travis Hunter placed on injured reserve, some expected Brian Thomas Jr. season would finally be upon us. That expetation made some sense from a raw talent standpoint, but it ignored the lack of rapport Trevor Lawrence and Thomas have shown together all season. Thomas' best games a a rookie cam with Mac Jones. Washington took over as Lawrence's lead target in the Jaguars' passing attack coming out of the bye week in a new-look pass attack. Washington finished with a team-high 77 yards receiving on eight targets (and seven catches). Thomas also left Week 9 with an ankle injury and after that the Jaguars leaned even more heavily on Washiongton. Washington will be mainstay in PPR leagues and could push into the WR2/3 discussion if he continues to get targeted at this rate. Demario Douglas, WR, PatriotsIt's never easy to figure out where the targets and production are going but we know for certain that production will be coming in this Patriots pass attack. Drake Maye is the truth and Josh McDaniels has maximized his skill set as a drive thrower with elite touch on the vertical plane. Douglas has the speed to win over the top in addition to creating underneath -- he just needed a quarterback like Maye to bring out this area of his game. Douglas is worth stashing in deeper leagues but will struggle to find consistency in a crowded pass game.\nAndrei Iosivas, WR, BengalsIosivas racked up five receptions for 66 yards and a touchdown in Week 9. He will benefit from game script and Joe Flacco as his quarterback. Flacco threw for 450+ in Week 9 as the Bengals defense continued to allow score after score. This led to a late-game scoring opportunity for Andrei who cashed in. He's an interesting stash. He won't find consistent Fantasy value unless Tee Higgins or Ja'Marr Chase get hurt -- but if they do he will be an every-week starter.RJ Harvey, RB, BroncosIt has been a disappointing rookie season for Harvey after coming in with major expectations in the Fantasy Football community, but he is starting to find his niche now. The Broncos are using him as an extension of their run game when their run game struggles to create early. This has been the case early and often for Denver, so they turn to Harvey. In this game, Harvey racked up another five receptions for 51 receiving yards and a score. Harvey has worked his way into the FLEX conversation in PPR leagues.\nBrian Robinson, RB, 49ersRobinson reminded us in Week 9 of what he's capable of when given opportunities. He finished with 53 yards rushing and a touchdown on just five carries. This is a reminder to all Fantasy Football managers that Robinson is the best handcuff stash in the game. If he's unrostered in your league, there's no higher-upside bench stash available. Sign him for your stretch run.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 9 breakouts: Parker Washington earns a role worth stashing in leagues now, plus more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/10/20/c8139aa2-be6e-44df-a439-d0373acdf3f1/thumbnail/1200x675/2310e462091695fc2876d3c61b586ff5/usatsi-parker-washington-jaguars-practice.jpg"
      ],
      "datePublished": "2025-11-03T00:20:46.000Z",
      "dateModified": "2025-11-03T00:20:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Bengals challenge results in a Bears touchdown in one of the wildest finishes of the season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/a-bengals-challenge-results-in-a-bears-touchdown-leading-to-one-of-the-wildest-finishes-of-the-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/4d96155c-826e-4dcf-9cbe-be2055c6f277/thumbnail/1200x675/770ec1c9bc94462fc48eb943bfbe8691/taylor.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:27:15.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Cincinnati Bengals had a challenge attempt blo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Cincinnati Bengals had a challenge attempt blow up in their faces during the fourth quarter of their Week 9, 47-42 loss to the Chicago Bears, and it was a decision by Zac Taylor that gave the Bears seven points in a very tight contest. On a first-and-10 from the Bengals' 16-yard line, Bears wide receiver DJ Moore rushed left and was knocked out of bounds at the 1-yard line. It looked like he may have fumbled at the end of the play, so the Bengals coach threw the red challenge flag in hopes the officials would rule a fumble out of the end zone, which would result in a touchback and give possession to Cincinnati.But not only did the Bengals lose this challenge, but the officials determined that Moore actually crossed the goal line, and awarded a touchdown to the Bears.Check out the play, here:\nThis touchdown extended Chicago's lead to 14 points with under five minutes remaining in the fourth quarter, bu that was just the start of the madness as there were three touchdowns that followed in one of the wildest finishes of the season. The Bengals actually scored back-to-back touchdowns thanks to a successful onside kick to acquire a one-point lead with under one minute to play, but the Bears then went 72 yards on four plays, and Caleb Williams hit Colston Loveland for a 58-yard game-winning touchdown.\nIt was a brutal loss for a flailing Bengals team, which just fell to third place in the AFC North with a 3-6 record.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Bengals challenge results in a Bears touchdown in one of the wildest finishes of the season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/4d96155c-826e-4dcf-9cbe-be2055c6f277/thumbnail/1200x675/770ec1c9bc94462fc48eb943bfbe8691/taylor.jpg"
      ],
      "datePublished": "2025-11-02T23:27:15.000Z",
      "dateModified": "2025-11-02T23:27:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Clemson coach Dabo Swinney: 'I may get fired ... can't say I'd blame him' with AD Graham Neff looking on - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/dabo-swinney-fired-joke-clemson-ad-duke/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe0f9e42-a675-426f-b63b-5e99ca4b4ca1/thumbnail/1200x675/fdd6a07c2fec504d51be04eca9f459ec/daboswinney.png",
    "tag": "Sports",
    "date": "2025-11-03T02:10:23.000Z",
    "description": "\n        Dabo Swinney has seen better days at Clemson. At 3-5, the Tigers' longtime coach is in danger of missing the postseason for the first time in",
    "body": "\n        Dabo Swinney has seen better days at Clemson. At 3-5, the Tigers' longtime coach is in danger of missing the postseason for the first time in his 17-year tenure following Saturday's 46-45 loss to Duke. And he misfired on an awkward joke with Clemson athletic director Graham Neff in attendance amid a season of frustration that seemingly hit a boiling point inside Memorial Stadium.\"I may get fired today, Graham's sitting there in the back, so I don't know, can't say I'd blame him,\" Swinney said with a smirk during his press conference.Asked to clarify his remark moments after his time at the podium ended, Swinney seemed to continue his \"aww shucks\" mantra looking ahead to Week 11. It was an arrogant move by Dabo in front of his boss, proving he already has too much power there.  \"Shoot, we've got to win some games,\" Swinney said. \"I'm just worried about trying to beat Florida State.\"\nAlong with discussing his job status, Swinney took aim at the officials following Saturday's loss, the first in program history when scoring 45 points. Swinney was especially upset with the penalty against his defense on a fourth-down play that gave Duke a chance to score and force overtime, which it was what ultimately happened. The ACC responded by fining Clemson $10,000 and issuing a public reprimand for Swinney, who stood by his comments on Sunday. \"There's a lot of accountability for coaches and a lot of accountability for players, but I don't think there's much for refs,\" he said. \"There should be some type of ability to challenge a call like that. It just was very, very frustrating. But, as I said last night, I don't blame that on the loss.\" \nRegarding his future at Clemson, Swinney has been saying similar things all season. Following a road loss to Georgia Tech, he quipped that Clemson has enough decision-makers and deep-pocketed boosters to give him the boot if that's their determination.\"If they want me gone, they're tired of winning, they can send me on the way,\" Swinney said. In reality, Swinney knows he's safe at Clemson given his storied tenure with nine conference titles and two national championships along with a $60 million buyout. Neff has long been in Swinney's corner, even during increasing cries that the leader of Clemson's football program isn't adjusting to college football's new era of transfer portal influence and NIL-driven offers in recruiting.\nSwinney's reluctance to add players from the portal in several key spots has been magnified this season for the Tigers, who rank 11th in the ACC in rushing offense, have struggled to maintain their strength at the line of scrimmage and have failed to impress defensively due to depth issues and lack of development with several potential first-rounders under first-year coordinator Tom Allen.It's more than possible Clemson makes additional staff changes this offseason, which would continue a recent trend under Swinney that has not borne much fruit. 🏈 Clemson's recent coaching carouselDateCoachChange (In/Out/Role)Position / NotesJan. 12, 2023Brandon StreeterFired / removedOffensive Coordinator & QBs — released after 2022 seasonJan. 13, 2023Garrett RileyHiredOffensive Coordinator & QBs — hired from TCUNov. 30, 2023Thomas AustinLet goOffensive Line Coach — did not return for 2024 seasonNov. 30, 2023Lemanski HallLet goDefensive Ends Coach — did not return for 2024Dec. 4, 2023Matt LukeHiredOffensive Line Coach — former Ole Miss HC, UGA assistantDec. 4, 2023Chris RumphHiredDefensive Ends Coach — hired from NFL (Chargers/Vikings)Jan. 6, 2025Wes GoodwinFired / removedDefensive Coordinator & Linebackers Coach — dismissed after 2024 seasonJan. 14, 2025Tom AllenHiredDefensive Coordinator & Linebackers Coach — hired from Penn State (former Indiana HC) Swinney has not won a playoff game at Clemson since losing in the national championship game to Joe Burrow and LSU to end the 2019 season. And despite four seasons of 10 or more wins since, program decline is obvious when considering the expectation level Swinney helped cultivate.\nWhat else has Swinney said about Clemson's bad season?After an early loss to Georgia Tech dropped Clemson to 1-2, Swinney faced his first real questions of 2025 about the state of the franchise. He did not sound a tone of apology.\"Perspective is important,\" Swinney said as part of his answer. \"If they want me gone, they're tired of winning, they can send me on the way, because that's all we've done is win. So if they're tired of winning ... we've won this league eight out of the last 10 years. Is that not good? I'm just asking, 'Is that good?' I don't know if that's good or not, to win your league eight out of 10 years, to go to the playoff seven out of 10 years, to be in four national championships, win it twice....\"Hey, listen, if Clemson's tired of winning, they can send me on my way, but I'm going somewhere else to go somewhere else and coach,\" Swinney added. \"I ain't going to the beach. Hell, I'm 55. I got a long way to go. Y'all going to have to deal with me for a while. I got a long way to go. I'm just getting going. I'm just now good enough to be a head coach. I'm just now figuring it out. So we'll be around a while. Let's hang in there.\"Clemson lost six consecutive home games dating back to last season against Power Four competition and is 13-9 against ACC does since the start of the 2022 campaign. Unless the Tigers get red-hot over the final weeks and somehow manage a spot inside the final top 25, Clemson will finish the season unranked for the first time since 2010.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clemson coach Dabo Swinney: 'I may get fired ... can't say I'd blame him' with AD Graham Neff looking on - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe0f9e42-a675-426f-b63b-5e99ca4b4ca1/thumbnail/1200x675/fdd6a07c2fec504d51be04eca9f459ec/daboswinney.png"
      ],
      "datePublished": "2025-11-03T02:10:23.000Z",
      "dateModified": "2025-11-03T02:10:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Cowboys vs. Cardinals: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-cowboys-vs-cardinals-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/4a4421d7-57b2-4e94-a9ea-53c88096d6c5/thumbnail/1200x675/875cf5cf5056bdffdc437b77c7699c5b/untitled-design-2025-11-02t184229-384.png",
    "tag": "Sports",
    "date": "2025-11-03T02:44:24.000Z",
    "description": "\n        In the Week 9 edition of \"Monday Night Football,\" the Dallas Cowboys play host to the Arizona Cardinals.The Cowboys are coming off a disastro",
    "body": "\n        In the Week 9 edition of \"Monday Night Football,\" the Dallas Cowboys play host to the Arizona Cardinals.The Cowboys are coming off a disastrous loss against the Denver Broncos last week, which dropped them to 3-4-1 on the season. Dallas has yet to creep above .500 this year, but it has also not dropped two in a row at any point in 2025.Arizona has now lost five in a row since starting 2-0, dropping perhaps too far back in the race for the NFC West and the wild card spot. The Cardinals are coming off a much-needed bye in Week 8, but they're still not fully healthy as Kyler Murray is not yet ready to return from the injury that kept him out of the team's previous two games.Will the Cowboys get back on track, or will the Cardinals finally get back in the win column? We'll find out soon enough. But before we break down the matchup, here's a look at how you can watch the game.\nWhere to watch Cowboys vs. Cardinals liveDate: Monday, Nov. 3 | Time: 8:15 p.m. ETLocation: AT&T Stadium -- Arlington, TexasTV: ESPN | Stream: Fubo (try for free) Follow: CBS Sports AppOdds: Cowboys -3; O/U 53.5 (via DraftKings Sportsbook)When the Cardinals have the ballJacoby Brissett will make a third consecutive start in place of Kyler Murray. The Cardinals' offense has been both more efficient and more explosive with Brissett under center, as they have leaned into passing the ball more often and he has found a connection with star tight end Trey McBride that Murray often failed to establish. Brissett is 52 of 80 for 599 yards, four touchdowns and an interception in his pair of starts, connecting with McBride on 18 of 24 attempts for 146 yards and three scores.The Dallas pass defense has been arguably the friendliest in the entire league, surrendering the second-most passing yards per game in the NFL while allowing opponents to complete an incredible 68.5% of their passes at an otherworldly average of 8.2 yards per attempt. Dallas has actually surprisingly gotten pressure at a slightly above-average rate, but has proven utterly incapable of converting that pressure into sacks, registering a minuscule 5.3% sack rate, according to Tru Media.The Cowboys have also just consistently sprung leaks in their coverage, leaving pass-catchers of all stripes open all over the field as they have already yielded an incredible 15 touchdown catches to wide receivers, per Pro-Football-Reference, the most in the league. They've given up 41 total receptions to running backs, which ranks seventh-worst in the NFL. They've been better against tight ends of late, but part of that is because they've recently faced an unimposing tight end slate. Against McBride, their linebackers and safeties are likely to be at a significant disadvantage. \nThe Arizona run game has been almost entirely shut down in the absence of James Conner and Trey Benson, with the duo of Michael Carter and Bam Knight combining to average a mere 3.1 yards per carry. The Cowboys, though, have gotten clocked on the ground to the tune of 4.9 yards per carry, and they've given up at least 136 yards on the ground in each of their last five games. Their leaky run defense should allow the Cards at least a chance to get going on the ground, although the poor quality of the offensive line and actual talent at running back could still hold them back.When the Cowboys have the ballUp until last week against the Broncos, the Cowboys' offense had looked nearly unstoppable. Dak Prescott was playing at the highest level of his career -- including the year where he finished second in MVP voting -- and with CeeDee Lamb returning to the lineup to flank George Pickens and Jake Ferguson, Dallas was racking up yards and denting scoreboards left and right. And then the Broncos just totally dominated the game up front, held Javonte Williams almost entirely in check, and forced Prescott into mistakes for seemingly the first time this year. The Cardinals' defense, though, is not the Broncos' defense. Arizona checks in at 21st in EPA per play allowed, via Tru Media, ranking fifth against the run but 22nd against the pass. \nThe Cowboys' Williams-led run game has been efficient for most of the season thanks to both the play-calling of Brian Schottenheimer and the run game design of former Cardinals offensive line coach Klayton Adams, whom the Cowboys hired as their offensive coordinator. Williams doesn't have many explosive runs (just 6.5% of his carries have gained 12 or more yards, per Tru Media), but he's clipped off five-plus-yard runs at an extremely high rate and rarely lost yards on his carries. If he can keep the Cowboys on schedule when given the ball, it should give the Dallas passing game ample opportunity to tear up Arizona's secondary.Lamb has receiving lines of 7-110-0, 9-112-0, 5-110-1 and 7-74-0 in his four full games this season, and frankly the Cardinals do not have anybody who can cover him -- especially with slot corner Garrett Williams still on injured reserve. Lamb plays a ton in the slot, and he has an advantage over just about everybody when he lines up inside. Pickens should also have a size and strength advantage against Arizona's perimeter corners, though Will Johnson should have a better chance against him than the smaller Max Melton. The Cards have hemorrhaged catches to tight ends so far this season, which should give Ferguson a chance to get untracked as well. \nSo long as the Cowboys can keep Prescott well protected -- and Arizona is only 25th in pressure rate, per Tru Media -- then Prescott should have plenty of time to pick apart the Cardinals on the back end. Dallas struggled in the protection game last week but should have its full offensive line back for this one and, again, is going up against a significantly weaker pass rush than the one it squared off with last week. Cowboys vs. Cardinals prediction, pick\nAs is usually the case with their games, the Cowboys have some significant matchup advantages on offense and some significant disadvantages on defense. When that's the case, we tend to put our trust in whichever quarterback is the better bet to drive offensive efficiency. Here, that's Prescott, rather than Brissett. Pick: Cowboys 30, Cardinals 23\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Cowboys vs. Cardinals: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/4a4421d7-57b2-4e94-a9ea-53c88096d6c5/thumbnail/1200x675/875cf5cf5056bdffdc437b77c7699c5b/untitled-design-2025-11-02t184229-384.png"
      ],
      "datePublished": "2025-11-03T02:44:24.000Z",
      "dateModified": "2025-11-03T02:44:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft order after Week 9: Updated picks, team needs and outlook - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-draft-order-updated-top-picks-team-needs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/f7952c99-2b53-4ea2-95af-2188848e786b/thumbnail/1200x675/9ce25ae3ede340a416744dff60498f3f/saints.jpg",
    "tag": "Sports",
    "date": "2025-11-03T04:38:01.000Z",
    "description": "\n        There were two teams who have been fixtures in NFL Draft order posts on a bye this week: the Cleveland Browns and New York Jets. Ironically, ",
    "body": "\n        There were two teams who have been fixtures in NFL Draft order posts on a bye this week: the Cleveland Browns and New York Jets. Ironically, those two teams not only return to action in Week 10, but they'll face one another. When the regular season is over and fans reflect upon the season, that game could be the difference in one of those clubs being in position to draft a quarterback in April. A Sunday afternoon game was particularly brutal for Browns fans, as the Jacksonville Jaguars escaped Las Vegas with an overtime victory against the Raiders. Cleveland holds Jacksonville's first-round pick and has the same number of wins as the Raiders. As a reminder, there are three teams without a first-round pick in 2026 as a result of draft-day trades and the Micah Parsons deal: Atlanta, Green Bay and Jacksonville. Here is the current 2026 NFL Draft order, per Tankathon, as well as potential team needs:\n1. New Orleans Saints (1-8)Projected needs: CB, S, DL, RB, WRThe Saints lost their first four games before securing their first win. They're currently on a four-game losing streak. Will they snap it again next week against the Panthers? 2. Tennessee Titans (1-8)Projected needs: OT, IOL, WR, DL, EDGETennessee put up a fight but ultimately fell short vs. the Chargers. The Titans may have gotten a spark after the Brian Callahan firing, but will that persist?3. New York Jets (1-7)Projected needs: QB, WR, DL, CB, TEThe Jets were on a bye this weekend, but return next week against the Browns, who were also on a bye.\n4. Miami Dolphins (2-7)Projected needs: CB, WR, TE, IOL, SMiami made the decision to dismiss general manager Chris Grier. For the time being, head coach Mike McDaniel appears to be safe despite the most recent loss to Baltimore.  5. New York Giants (2-7)Projected needs: IOL, OT, DL, CB, LBRookie quarterback Jaxson Dart put forth another strong effort against San Francisco, but it was not enough. New York has one of the toughest second-half schedules. 6. Cleveland Browns (2-6)Projected needs: OT, WR, QB, CB, IOLThe Browns were on a bye this weekend, but return next week against the Jets, who are also on a bye.  \n7. Las Vegas Raiders (2-6)Projected needs: CB, LB, S, DL, OTLas Vegas squandered a late lead to Jacksonville in regulation, then failed to convert a two-point conversion in overtime. 8. Arizona Cardinals (2-5)Projected needs: OT, IOL, LB, DL, RBArizona travels to Arlington, Texas, on Monday night for a prime-time showdown with the Cowboys.9. Cincinnati Bengals (3-6)Projected needs: IOL, CB, S, TE, EDGEJoe Flacco continues to tap into the \"Fountain of Youth,\" but the clock may soon strike midnight for this Cinderella.\n10. Washington Commanders (3-6)Projected needs: EDGE, LB, CB, TE, WRThe Commanders had a night they would like to forget, getting blown out by the Seahawks and losing Jayden Daniels to a horrific arm injury.11. Baltimore Ravens (3-5)Projected needs: EDGE, DL, IOL, TE, CBLamar Jackson made his return to the football field in glorious fashion as the Ravens look to surge up the AFC North standings. Baltimore found itself in an unusual position among the top-10 overall, but may soon put that outlook in its rearview mirror.\n        \n            \n                NFL Week 9 winners and losers: Bengals fold to ruin wild comeback; Vikings back in business with J.J. McCarthy\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \n12. Los Angeles Rams via Atlanta Falcons (3-5)Projected needs: CB, OT, LB, S, IOLTo Los Angeles' gain, New England narrowly edged out Atlanta on Sunday as the Falcons remain one of the most confusing teams of the season. \n13. Houston Texans (3-5)Projected needs: IOL, OT, TE, DL, SC.J. Stroud exited Sunday's game against Denver early with a concussion as the Texans slipped further down the AFC South standings. 14. Dallas Cowboys (3-4-1)Projected needs: S, LB, EDGE, RB, CBDallas hosts the Cardinals on \"Monday Night Football\" this week. 15. Minnesota Vikings (4-4)Projected needs: LB, CB, S, DL, RBJ.J. McCarthy's return to the field proved fruitful for Justin Jefferson, who scored his second touchdown of the season in a divisional game against Detroit. 16. Carolina Panthers (5-4)Projected needs: CB, S, IOL, WR, DLCarolina's three-game win streak ended last week against Buffalo, but it began a new streak Sunday with a win over the Packers. \n17. Kansas City Chiefs (5-4)Projected needs: DL, RB, CB, LB, TEKansas City had won five of its past six games. Momentum had been building within that organization. Buffalo used a late turnover to stall the Chiefs' momentum in the final minutes before batting down Patrick Mahomes' final attempt as time expired.18. Chicago Bears (5-3)Projected needs: DL, S, IOL, RB, OTChicago and Cincinnati went back and forth Sunday. Only five possessions between the two teams did not end up in either a field goal attempt or touchdown in the Bears' 47-42 win. 19. Cleveland Browns via Jacksonville Jaguars (5-3)Projected needs: OT, WR, QB, CB, IOLThe Jaguars needed a pass deflection on a two-point attempt in overtime to sneak away with a victory against the Raiders on Sunday. It was a double whammy for Cleveland, which not only has Jacksonville's pick, but also the same number of wins as Las Vegas.\n\n        \n            \n                2026 NFL mock draft: Steelers brace for post-Rodgers era; Cowboys chase more firepower for Dak Prescott\n                \n                    Cooper Petagna                \n            \n                            \n    \n                \n                    \n    \n20. Pittsburgh Steelers (5-3)Projected needs: QB, DL, WR, CB, IOLPittsburgh was on the celebratory end of a critical contest with the Colts on Sunday. Jonathan Taylor was held to his lowest rushing total of the season (45).21. Detroit Lions (5-3)Projected needs: EDGE, DL, LB, CB, OTAn efficient Lions offense was not enough to overcome Minnesota on Sunday. 22. Los Angeles Chargers (6-3)Projected needs: IOL, EDGE, CB, TE, DLTennessee kept pace with Justin Herbert and the Chargers for most of Sunday's affair, but ultimately Los Angeles put it away. Offensive tackle Joe Alt may miss some time with an ankle injury.23. San Francisco 49ers (6-3)Projected needs: OT, IOL, DL, WR, TEMac Jones has started all but two games for the 49ers this season. Edge rusher Mykel Williams is expected to miss time with an injury sustained Sunday after Nick Bosa had already been lost for the season. \n24. Dallas Cowboys via Green Bay Packers (5-2-1)Projected needs: S, LB, EDGE, RB, CBA loss cannot hurt Dallas' pick from Green Bay, but the reality is that the Packers almost certainly will advance to the postseason. How far they go will determine where the Cowboys' pick lands.25. Buffalo Bills (6-2)Projected needs: S, LB, EDGE, CB, WRKansas City and Buffalo delivered another classic as the Bills outlasted its counterpart Sunday afternoon. 26. Seattle Seahawks (6-2)Projected needs: CB, DL, IOL, S, WRThe Seahawks keep rolling behind Sam Darnold, who tossed four TD passes in a romp over the Commanders on \"Sunday Night Football.\"\n27. Los Angeles Rams (6-2)Projected needs: CB, OT, LB, S, IOLLos Angeles has won three straight after decisively beating New Orleans on Sunday. 28. Denver Broncos (7-2)Projected needs: LB, TE, S, WR, OTDenver is one of three teams in the NFL with seven wins. It has won six straight games after dropping two of three to open the year. 29. Tampa Bay Buccaneers (6-2)Projected needs: LB, DL, EDGE, IOL, TEThe Buccaneers utilized a much needed bye week to get healthier. Tampa Bay plays the Patriots next week. 30. New England Patriots (7-2)Projected needs: OT, TE, WR, LB, EDGEAtlanta scored 10 points in the fourth quarter to push the Patriots to the brink, but Drake Maye emerged victorious in a battle of 2024 first-round quarterbacks.31. Philadelphia Eagles (6-2)Projected needs: TE, CB, EDGE, S, IOLPhiladelphia had a bye this week before returning to the public eye in prime time each of the next two weeks. 32. Indianapolis Colts (7-2)Projected needs: LB, CB, EDGE, IOL, DLIndianapolis is undefeated at home this season, but is now .500 on the road. The Colts had six turnovers, including three interceptions.   The 2026 NFL Draft will take place from April 23-25 in Pittsburgh. More draft coverage can be found at CBSSports.com, including the weekly mock drafts and regular looks at the eligible prospects. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft order after Week 9: Updated picks, team needs and outlook - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/f7952c99-2b53-4ea2-95af-2188848e786b/thumbnail/1200x675/9ce25ae3ede340a416744dff60498f3f/saints.jpg"
      ],
      "datePublished": "2025-11-03T04:38:01.000Z",
      "dateModified": "2025-11-03T04:38:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals defensive woes reveal years of drafting, leadership failure - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-defense-historic-low-vs-bears-changes-needed/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/f090d289-eaed-41e4-99ad-ef0777376d8f/thumbnail/1200x675/00ffc59d7d7f79855aad9d184600ab77/coleston-loveland.jpg",
    "tag": "Sports",
    "date": "2025-11-03T02:44:55.000Z",
    "description": "\n        The Bengals defense may have officially hit rock bottom amid a potentially lost season, falling to 3-6 after Sunday's 47-42 loss to the Bears",
    "body": "\n        The Bengals defense may have officially hit rock bottom amid a potentially lost season, falling to 3-6 after Sunday's 47-42 loss to the Bears. Cincinnati became the first team in at least the last 45 years to take a lead in regulation after trailing by 14-plus points in the final two minutes of the fourth quarter -- and still lose! And they lost in spectacular fashion, surrendering a 58-yard game-winning touchdown from Caleb Williams to rookie Colston Loveland in the final seconds.\nThe lowlights didn't stop there. Cincinnati allowed 576 total yards, the most by any team in a game this season, and became just the 10th team in NFL history to give up 275-plus passing yards and 275-plus rushing yards in a single contest. Worse, they did it against an inconsistent Bears offense that got big games from Kyle Monangai, Brittain Brown and Olamide Zaccheaus.It was a nightmare of epic proportions in a string of nightmares. The Bengals also lost 39-38 and blew a 15-point fourth-quarter lead against the then-winless Jets a week ago, just days after their owner publicly ridiculed his quarterback for not being able to complete a pass.\nThe list of historic lows is downright embarrassing:They are the first team in 59 years to lose consecutive games while scoring 38 or more points. The last to do it was the 1966 New York Giants -- back when the NFL had only 15 teams and had yet to crown its first Super Bowl champion.They have allowed 500 total yards in two straight games and three times this season. The rest of the league has done it a combined two times.They are allowing 33.3 points per game this season, the most by any team since those same 1966 Giants.They have allowed at least 27 points and 350 or more total yards in eight straight games, the longest such streak within a single season in NFL history.That is a convincing case for one of the worst defenses the league has ever seen. And the dumpster fire didn't start this year. Last season, they lost games while scoring 33, 34, 38, 38 and 38 points, finishing with the highest points per game in losses in NFL history (27.8).These new lows are still stunning, even though we've seen this record on loop. Cincinnati has lost four games in the last two seasons while scoring 38 or more points, matching the total of the rest of the league combined in that span. No other team has done it more than twice over a two-season stretch in NFL history.Why is this happening?As stunning as it is, maybe it shouldn't be that surprising. The Bengals' already terrible defense was essentially gutted in the offseason. They fired Lou Anarumo, one of the most respected defensive minds in the league. They had contract disputes with their two most important defensive investments -- Trey Hendrickson and Shemar Stewart -- and lost other key defenders, including Sam Hubbard (retirement) and Germaine Pratt (release). They are also strapped for cash, with nearly half of their cap space tied up in contracts for Joe Burrow, Ja'Marr Chase and Tee Higgins.\nLet go of Lou AnarumoLou Anarumo was clearly the fall guy for Cincinnati's defensive downturn in recent seasons, even though the issue largely lies with personnel, among other factors. \"The Mad Scientist,\" as he's known, was not the problem. He has done just fine with an underwhelming Colts defense for a team off to a 7-2 start. New Bengals defensive coordinator Al Golden could be the next fall guy, which would be pretty unfair.Pissed off important investmentsIt is hard to expect much more from Golden when you consider all the talent the Bengals have either lost or pissed off in recent months. Hendrickson and Stewart both held out in training camp. Bengals owner Mike Brown even said, \"We're not paying someone to sit in jail,\" referring to Stewart and the team's reluctance to offer him a fully guaranteed rookie deal.The Bengals also saw Hubbard -- their starting edge rusher opposite Trey Hendrickson -- retire. They released Pratt, one of the team's leading tacklers. Anarumo's chess piece, slot corner Mike Hilton, followed him to Indianapolis. More recently, linebacker Logan Wilson requested a trade.\nUnable to draft and developThe fault lies with the front office. This is a team that can't draft and develop on defense, and now it can't spend on that side of the ball.They are having these results despite using their first two picks on defensive players in three of the last four drafts:2022: S Dax Hill and CB Cam Taylor-Britt2023: EDGE Myles Murphy and CB DJ Turner2025: EDGE Shemar Stewart and Demetrius Knight Jr.They haven't drafted a stud on defense in a long time despite plenty of swings. They drafted 59 defensive players between 2011 and 2024, and none of them made a Pro Bowl for Cincinnati. It is the longest active drought in the NFL without drafting a defensive player who went on to make a Pro Bowl for the team. The Bengals' last such picks were Geno Atkins and Carlos Dunlap in 2010.\nThey have consistently whiffed on draft picks on this side of the ball, especially in the first round. Their last two picks are complete busts to this point. Murphy, their first-round pick in 2023, has 4.5 sacks in 39 career games. His pressure rate has never eclipsed 10% in three seasons, which is already well below league average.Cincinnati drafted Stewart in the first round this year because he was an NFL Scouting Combine freak who drew comparisons to Myles Garrett -- despite totaling 4.5 sacks in 37 college games. The transition has been rough, as predicted. He had only five pressures in his first four career games entering Week 9, one of the worst rates in the league. It might be too soon to judge him, because he was always going to be a bit of a project.No money to spend So what happens when you can't draft and develop on defense and you can't spend there either? You have one of the worst defenses of all time.\nBurrow, Chase and Higgins are the highest-paid offensive trio in the NFL right now, making a combined $124 million in average annual salary. Overall, the Bengals have the most cap space tied up in their offense ($158 million), and they sit near the bottom in defensive spending ($82 million).Obviously, they needed to pay Burrow and Chase -- they are generational talents. Higgins is a bona fide star, but was paying another offensive player worth the issues it created on defense (and the offensive line)?What is the solution?What's the solution? Blow up the front office. I wouldn't fire Zac Taylor, who is an offensive-minded head coach and has a strong history with Joe Burrow. They could fire defensive coordinator Al Golden, and I expect that could be the next move, but he would just be another scapegoat like Anarumo.\nAll signs point to the front office. And that is where it gets complicated. Bengals owner Mike Brown is also the de facto general manager, similar to Jerry Jones with the Cowboys — meaning he is not going anywhere. Several family members also occupy front-office positions. Most personnel decisions go through director of player personnel Duke Tobin, who is essentially the general manager without the title. He has been in that role since 2002. Cincinnati entered 2025 with the smallest scouting department in the NFL.It all adds up to a frustrating situation for Bengals fans that is resulting in a wasted season with the generational combination of Joe Burrow and Ja'Marr Chase. Front-office change is desperately needed, but I don't have faith that's going to happen because it's a family business. They should clean house and find scouts who can actually build a defense with draft capital.The most likely scenario is an unsuccessful fix at defensive coordinator, beefing up the league's smallest scouting department over time and trading Hendrickson at the deadline. That's a bleak outlook -- and about as disheartening as the last two weeks have been for Bengals fans.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals defensive woes reveal years of drafting, leadership failure - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/f090d289-eaed-41e4-99ad-ef0777376d8f/thumbnail/1200x675/00ffc59d7d7f79855aad9d184600ab77/coleston-loveland.jpg"
      ],
      "datePublished": "2025-11-03T02:44:55.000Z",
      "dateModified": "2025-11-03T02:44:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's next for Hugh Freeze? Don't expect ex-Auburn coach to lead a Power Four program any time soon - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/whats-next-for-hugh-freeze-after-auburn-firing-dont-expect-him-to-lead-a-power-four-program-anytime-soon/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/bc67e7eb-cc39-434c-9b09-6404c766d0f2/thumbnail/1200x675/f9480c1960f573016c9a4e922b6d20f6/freeze.png",
    "tag": "Sports",
    "date": "2025-11-02T20:15:42.000Z",
    "description": "\n        A few weeks after Auburn athletics director John Cohen compared Hugh Freeze's job to an unreliable car that he wasn't sure would start, the i",
    "body": "\n        A few weeks after Auburn athletics director John Cohen compared Hugh Freeze's job to an unreliable car that he wasn't sure would start, the inevitable happened -- the Tigers fired Freeze. Ironically, Freeze's Auburn tenure actually ended as a slow-moving accident. Punt after punt after punt defined the Tigers' 10-3 home loss to Kentucky, the first time in 28 years the Tigers allowed 10 or fewer points and lost a game. The defeat dropped Freeze to 15-19 overall on The Plains. He ended his tenure 1-11 against ranked teams despite a top-13 roster in the sport, per the 247Sports Team Talent Composite. Unlike big-name coaches James Franklin and Brian Kelly who were fired earlier in the 2025 coaching carousel, there was no real argument to be made in favor of keeping Freeze. His reputation as an offensive wiz is in the tank; the Tigers rank No. 118 in yards per play despite a talented offensive line, elite wide receivers and a hand-picked transfer portal QB, Jackson Arnold, who had a seven-figure price tag (Freeze seemed to always pick the wrong portal QB, ignoring Cam Ward when he entered the transfer portal from Washington State). Auburn's coaching search promises to be a blockbuster with a heavy-handed booster class that loves to meddle. The Tigers need to nail the hire in an SEC that's getting more competitive by the week, it seems. \nAs for Freeze?The 56-year-old is a controversial college football figure whose long track record of success feels more distant with each blunder he makes (coaches across the country still cannot figure out why Freeze refused to reevaluate a collaborative play-calling approach). Be skeptical there's much of a market for Freeze as a head coach moving forward -- and it's also unclear if Freeze will want to coach again any time soon. Freeze was diagnosed with prostate cancer in February and is currently undergoing treatment. Doctors caught it early and he opted against immediate surgery to have the mass removed. That's because the cancer was deemed low aggressive, per Freeze. He said back in the summer he planned to reevaluate his health in January. \nThere was likely going to be industry speculation this season Freeze might step down from Auburn because of his health. So, it's reasonable to think Freeze may take some time off and focus on his recovery. He certainly doesn't mind having the time to play golf. As for a potential future in coaching, maybe Freeze could emerge as a candidate at a Group of Five program. He found outsized success in past stints at Arkansas State and Liberty. But checking with industry sources, it's hard to see Freeze making an immediate return as a Power Four head coach. He won't have the cachet of Franklin or a Kelly, and his baggage is immense. If Freeze desired it, he could likely grab a play-caller job somewhere or stash himself away on a staff as an analyst. \nFreeze benefits from the flexibility of an around $15 million buyout without a 'duty to mitigate' clause, which compels those like Franklin to find work right away to offset their buyout. It seems unlikely Freeze wants to fade away forever into the background -- he only took a year-long sabbatical after his Ole Miss tenure ended in a blaze of destruction -- but his chance at reaching the peaks of his Ole Miss tenure are shot. People tend to notice when a luxury car won't start. \n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's next for Hugh Freeze? Don't expect ex-Auburn coach to lead a Power Four program any time soon - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/bc67e7eb-cc39-434c-9b09-6404c766d0f2/thumbnail/1200x675/f9480c1960f573016c9a4e922b6d20f6/freeze.png"
      ],
      "datePublished": "2025-11-02T20:15:42.000Z",
      "dateModified": "2025-11-02T20:15:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hugh Freeze fired by Auburn amid 15-19 record in three seasons coaching Tigers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/auburn-fires-coach-hugh-freeze-tigers-end-disappointing-tenure-after-dropping-to-1-5-in-sec-play-this-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/747890ef-66ac-404d-b547-63a81ee3049b/thumbnail/1200x675/8bb160c58a973575a5edbd40299a68c9/adobe-express-file-58.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:16:12.000Z",
    "description": "\n        Auburn is firing coach Hugh Freeze just one day after the Tigers mustered three points in a disappointing home loss to Kentucky, the program'",
    "body": "\n        Auburn is firing coach Hugh Freeze just one day after the Tigers mustered three points in a disappointing home loss to Kentucky, the program's fifth setback in six games this season against SEC competition, CBS Sports' Brandon Marcello, Matt Zenitz and Richard Johnson report. \"I have informed Coach Freeze of my decision to make a change in leadership with the Auburn Football program,\" Auburn athletic director John Cohen said in a statement released by the school. \"Coach Freeze is a man of integrity, and we are appreciative of his investment in Auburn and his relentless work over the last three years in bolstering our roster. Our expectations for Auburn Football are to annually compete for championships and the search for the next leader of Auburn Football begins immediately.\"The Tigers dropped to 1-5 in conference play in the middle of Freeze's third season with bowl hopes hanging by a thread at 4-5 overall with games against Vanderbilt, Mercer and Alabama remaining. Auburn had won 19 of its previous 20 matchups with Kentucky dating back to 1967.Defensive coordinator DJ Durkin will serve as the team's interim coach, Marcello reports. \nThis will be the third time since 2020 that the Tigers will be searching for a new coach, which means Auburn will be footing the bill for another sizable buyout as well.Freeze's buyout at Auburn is $15.4 million, almost identical to the total the Tigers paid out to Bryan Harsin eight games into his second season in 2022 amid inner program failures and on-field struggles. Freeze signed a six-year deal that same year worth $39 million.Firing chants from the student section broke out during Auburn's loss to Kentucky and lingered even after the final whistle. The Wildcats notched seven sacks against a sputtering offense led by Stanford transfer Ashton Daniels, who made his first start for Auburn amid season-long issues with Jackson Arnold.\nIn short, Freeze's new-look offense infused with portal talent never got off the ground in 2025. After strong efforts on the recruiting trail in recent years, Auburn's 2026 efforts have been poor; what on Sunday was a 14-man class was tracking to be the school's worst in the 247Sports era (2010-). \"I wish I could ask for patience, but that's not really something people want to give in this day and time, but I understand that,\" Freeze said after the game in his plea to fans. \"I just know we're so dang close, and if we had a few things go our way earlier in the year, we're looking at a whole different deal. But it didn't, and that's life. And that's the game of football and it teaches us a lot of great things and a lot of tough things. We'll get up and go get ready for the next one.\"I'd love for their patience. But I understand that you're probably not getting patience from them, because they want to see a better product on the field and so do I. So, I understand it.\"\nAuburn lost at least four games during SEC play in each of Freeze's seasons, which set a new low mark for the program. Freeze leaves Auburn with a 15-19 overall record, including a 6-16 showing in conference play. That's the worst three-year start for an Auburn coach since 1951-53, when Ralph Jordan went 14-16-1. Jordan, a College Football Hall of Famer, showed progress in that third year with a 7-3-1 record, though, and led the Tigers until he retired following the 1975 season. Freeze is also the first Auburn coach since 1950 to last at least three seasons without a winning record against league opponents. \nFreeze's tenure as Auburn coach SeasonOverall recordSEC recordBowl20236-73-5Music City Bowl (13-31 vs. Maryland)20245-72-6No bowl20254-51-5--Auburn entered the 2025 season with lofty expectations thanks to Freeze's recruiting efforts and what appeared to be -- on paper, at least -- an improved offense. The Tigers boasted one of college football's deepest wide receiver rooms, highlighted by stars like Cam Coleman and top transfer addition Eric Singleton. They also took a big swing by landing former five-star prospect and Oklahoma starter Jackson Arnold at quarterback. Auburn even climbed as high as No. 22 in the AP Top 25 amid a 3-0 start in nonconference play, highlighted by an impressive road win against Baylor in which the Tigers scored 38 points. Then, they hit a wall. They failed to score 20 points in each of their first four SEC games. Arnold went three straight games, from Auburn's Sept. 27 loss to Texas A&M to its loss against Missouri, without a single passing touchdown. Arnold was also benched against Arkansas, as the Tigers turned to former Stanford transfer Ashton Daniels late in the first half. Auburn is the third SEC school to make a midseason coaching change in 2025, following in the footsteps of the Razorbacks, which moved on from Sam Pittman on Sept. 28, and Florida, which fired Billy Napier two weeks ago. High on Auburn's board? Jon SumrallSumrall is one of the fastest-rising coaches in college football after sensational coaching jobs at Troy and Tulane. He is high on the team's early hot board, according to CBS Sports' Brandon Marcello. The Huntsville, Alabama, native took over a Troy program coming off three straight losing seasons and quickly flipped them into a winner, posting a 23-4 record with two Sun Belt titles in two seasons. The next year, he went to Tulane and led the program to the American title game with a 8-5 record, including 7-1 in American play. The former Kentucky linebacker has deep experience in the SEC, working as defensive coordinator under Mark Stoops and linebackers coach at Ole Miss. He has built physical defensive teams that control games but has consistently found great offensive coordinators and players as a head coach, including quarterback Darian Mensah, running back Makhi Hughes and running back Kimani Vidal. -- Shehan JeyarajahWhat's next for Freeze?The 56-year-old is a controversial college football figure whose long track record of success feels more distant with each blunder he makes (coaches across the country still cannot figure out why Freeze refused to reevaluate a collaborative play-calling approach). Be skeptical there's much of a market for Freeze as a head coach moving forward -- and it's also unclear if Freeze will want to coach again any time soon. Freeze was diagnosed with prostate cancer in February and is currently undergoing treatment. Doctors caught it early and he opted against immediate surgery to have the mass removed. That's because the cancer was deemed low aggressive, per Freeze. He said back in the summer he planned to reevaluate his health in January.As for a potential future in coaching, maybe Freeze could emerge as a candidate at a G-5 program. He found outsized success in past stints at Arkansas State and Liberty. But checking with industry sources, it's hard to see Freeze making an immediate return as a Power Four head coach. He won't have the cachet of Franklin or a Kelly, and his baggage is immense. -- Chris Hummer\n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hugh Freeze fired by Auburn amid 15-19 record in three seasons coaching Tigers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/747890ef-66ac-404d-b547-63a81ee3049b/thumbnail/1200x675/8bb160c58a973575a5edbd40299a68c9/adobe-express-file-58.jpg"
      ],
      "datePublished": "2025-11-02T20:16:12.000Z",
      "dateModified": "2025-11-02T20:16:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Auburn coaching candidates: Jimbo Fisher, James Franklin among options to replace Hugh Freeze - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/auburn-coaching-candidates-jimbo-fisher-james-franklin-hugh-freeze-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/56e87bfb-da9e-47ee-8511-c99e38b97a0f/thumbnail/1200x675/3748879e3acffe5e687039673c45e0b4/jimbo-fisher.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:16:59.000Z",
    "description": "\n        Auburn is heading back to the coaching carousel after Hugh Freeze was fired during his third year with the program. The Tigers went 15-19 und",
    "body": "\n        Auburn is heading back to the coaching carousel after Hugh Freeze was fired during his third year with the program. The Tigers went 15-19 under Freeze, including a paltry 6-15 in SEC play. Now, they're set to hire their fourth coach in five years. Freeze was an unexpected hire when he returned to the SEC more than six years after he was fired from Ole Miss in the midst of both personal and professional scandals. At Auburn, he was unable to recapture the magic of his Rebels run, never beating Alabama and not even posting a winning record in three years. In fact, his success almost exactly mirrored Bryan Harsin, who was run out in Year 2. The next coach at Auburn faces an intriguing moment. They will have to rebuild the identity of the program in a highly competitive SEC. Like Freeze and Harsin before, they will have to do it in the shadow of national title contenders at Alabama and Georgia. \n        \n            \n                As college football coaching carousel spins, discussion of representation takes a new twist\n                \n                    Richard Johnson                \n            \n                            \n    \n                \n                    \n    \nAuburn won a national championship in 2010 and returned to the title game in 2013. There is championship upside in the program, but a new coach will have to rebuild it from the ground up. Below is a compilation of coaches from CBS Sports Insiders who could quickly find themselves on Auburn's radar. \nFormer Texas A&M coach Jimbo FisherFisher's tenure at Texas A&M ended in disastrous fashion after he was paid the biggest buyout in college football history to go away. In his final two seasons after signing the No. 1 recruiting class in history, Fisher went 11-15, including 6-9 in SEC play. But while his recent work has been underwhelming, Fisher remains one of the most successful coaches of the 21st century. At Florida State, Fisher went 83-23 and won the 2013 national championship. He also led the Aggies to a No. 4 finish and Orange Bowl victory in 2020, ranking among their best Aggies seasons of the past 30 years. His 2013 team is one of the most talented rosters ever. If Fisher went to Auburn, he'd quickly be one of the top recruiters in the SEC again. Coming back to college football wouldn't be about money for Fisher -- it would be about reclaiming his name. Auburn could use a coach with a big chip on his shoulder. \nFormer Penn State coach James FranklinWhen Penn State unceremoniously fired Franklin, he said his new goal was simply to go win a national championship somewhere else. Auburn is a program with championship upside, and Franklin checks many of the most important boxes for the program -- namely building a robust football organization. Franklin is one of the highest-floor coaches in college football, posting six 10-win seasons and five AP top 10 finishes at Penn State. He also previously led Vanderbilt to 18 wins in two years and reached the national semifinals in 2025. Auburn would more than take Franklin leading the Tigers back to 10-win contention consistently after arguably the most embarrassing stretch in program history. Missouri coach Eli DrinkwitzA Gus Malzahn disciple, Drinkwitz has created some of the most dynamic teams in the SEC since arriving at Missouri in 2020. The Tigers are 27-6 over the past three seasons, including a Cotton Bowl victory and AP Top 10 finish in 2023. The program is also on the edge of College Football Playoff contention during another hot start to 2025. \nAt Auburn, he would be able to expand his recruiting chops and compete for the best players in the country. Furthermore, Drinkwitz has a trash-talking personality that would immediately become beloved at Auburn, especially in contrast to the cool Kalen DeBoer at Alabama. Auburn is at its best when the program is swinging for the fences. Tulane coach Jon SumrallSumrall is one of the fastest-rising coaches in college football after sensational coaching jobs at Troy and Tulane. He is high on the team's early hot board, according to CBS Sports' Brandon Marcello. The Huntsville, Alabama, native took over a Troy program coming off three straight losing seasons and quickly flipped them into a winner, posting a 23-4 record with two Sun Belt titles in two seasons. The next year, he went to Tulane and led the program to the American title game with a 8-5 record, including 7-1 in American play. The former Kentucky linebacker has deep experience in the SEC, working as defensive coordinator under Mark Stoops and linebackers coach at Ole Miss. He has built physical defensive teams that control games but has consistently found great offensive coordinators and players as a head coach, including quarterback Darian Mensah, running back Makhi Hughes and running back Kimani Vidal. \nAlso, Sumrall's wife went to Auburn. Understanding The Plains never hurts. Arizona State coach Kenny DillinghamThe former Auburn offensive coordinator has quickly become one of the fastest-rising coaches in college football. Dillingham led his alma mater to a Big 12 championship and College Football Playoff appearance in Year 2, culminating with a double-overtime loss to Texas in the quarterfinals. Injuries have derailed Arizona State's 2025, but the Sun Devils still managed to outlast Iowa State with a backup quarterback. Dillingham would be the exact kind of young, exciting offensive mind that attracts elite quarterbacks to The Plains. However, his greatest strengths are as an administrator and communicator, which would allow him to build an elite SEC staff. He has coached under Mike Norvell, Dan Lanning and Gus Malzahn. Georgia Tech coach Brent KeyThe Yellow Jackets' CFP hopes took a major shot after a loss to NC State in Week 10, but Key has still done a sensational job in Atlanta. Georgia Tech reached No. 7 in the AP Top 25 for the first time since 2009 and have built a big, physical identity behind the former offensive line coach. \nKey has plenty of experience recruiting the Deep South, including the all-important Atlanta metro. He also served as offensive line coach at Alabama -- it never hurts to have some Nick Saban bonafides in that state. More than anything, Key would quickly develop a strong identity in the program. South Florida coach Alex GoleshGolesh has sped back up coaching boards after leading one of the best Group of Six teams in the country. The Bulls went from 7-6 in each of the past two seasons to a 6-2 start, including major upset victory against Florida in nonconference play. South Florida was coming off a 4-29 record in three seasons before Golesh; he has posted a 20-14 record. The former Tennessee offensive coordinator boasts one of the most interesting backgrounds in the sport. Golesh was born in Russia and grew up in Ohio. He primarily coached in the Midwest before joining Josh Heupel at UCF in 2020. Now, he brings a diversified offense that embraces aspects of Tennessee's veer-and-shoot, but plenty of physical running from the Toledo tree. Golesh has also established himself as a dynamite recruiter in The American. \n\n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Auburn coaching candidates: Jimbo Fisher, James Franklin among options to replace Hugh Freeze - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/56e87bfb-da9e-47ee-8511-c99e38b97a0f/thumbnail/1200x675/3748879e3acffe5e687039673c45e0b4/jimbo-fisher.jpg"
      ],
      "datePublished": "2025-11-02T20:16:59.000Z",
      "dateModified": "2025-11-02T20:16:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]