[
  {
    "title": "Orioles hiring Craig Albernaz as new manager: Guardians associate manager takes over Baltimore, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/orioles-manager-craig-albernaz/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/645fca44-3df8-4df5-9c6c-c43a7aa9a1fd/thumbnail/1200x675/55f2de5748e44d814489569a321e20fc/albernaz-getty.png",
    "tag": "Sports",
    "date": "2025-10-27T02:13:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Baltimore Orioles are close to hiring Craig Al",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Baltimore Orioles are close to hiring Craig Albernaz as their new manager, ESPN reports. Albernaz, 42, served last season as the Cleveland Guardians' associate manager under Stephen Vogt. Prior to that, Albernaz was major league field coordinator for the Guardians. In earlier years, Albernaz was bullpen coach for the San Francisco Giants and also coached and managed at various levels within the Tampa Bay Rays farm system. As a player, the Massachusetts native spent parts of nine seasons in the minors as a catcher within the Rays and Detroit Tigers organizations. He reached as high as Triple-A. Albernaz inherits an Orioles team that still has a strong core of position players all in their twenties. However, the Orioles despite lots of talent finished a disappointing 75-87 this season and placed last in the American League East. Coming off consecutive postseason berths in 2023 and 2024, expectations were much higher. Those expectations cost manager Brandon Hyde his job in the middle of May. Interim replacement Tony Masolino managed a winning record over the remainder of the season (60-59), but ultimately lead decision-maker Mike Elias decided to go in another direction for dugout leadership. As such, the 2026 season brings with it a certain degree of pressure on both Elias and Albernaz to get the Orioles back into contending mode and win a playoff series for the first time in more than a decade. Elias' lack of aggressiveness in trading prospects for near-term roster needs and the lack of payroll investment from ownership remain impediments. \nNow that the Orioles are poised to name Albernaz to their post, the list of teams in need of managers for 2026 is down to five: the San Diego Padres, Atlanta Braves, Colorado Rockies, Washington Nationals, and Minnesota Twins. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Orioles hiring Craig Albernaz as new manager: Guardians associate manager takes over Baltimore, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/645fca44-3df8-4df5-9c6c-c43a7aa9a1fd/thumbnail/1200x675/55f2de5748e44d814489569a321e20fc/albernaz-getty.png"
      ],
      "datePublished": "2025-10-27T02:13:28.000Z",
      "dateModified": "2025-10-27T02:13:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aaron Rodgers 'disappointed' after losing to Packers; Steelers QB praises Jordan Love's performance - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/aaron-rodgers-disappointed-after-losing-to-packers-steelers-qb-praises-jordan-loves-performance/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/711b8d48-5843-49c1-b2dc-58a5bf9886c6/thumbnail/1200x675/2b1d07f812c44709c1e14b9e83f22ad7/rodgerslove.jpg",
    "tag": "Sports",
    "date": "2025-10-27T06:23:00.000Z",
    "description": "\n        While he didn't want to discuss what was said postgame between himself and Jordan Love, Aaron Rodgers was willing to share his emotions follo",
    "body": "\n        While he didn't want to discuss what was said postgame between himself and Jordan Love, Aaron Rodgers was willing to share his emotions following Sunday night's loss to his former team. Rodgers and the Steelers enjoyed a solid start that led to a 16-7 halftime lead. But the Packers flipped the script in the second half, as Love led the Packers on five scoring drives while completing 20 straight passes. \"Disappointed,\" Rodgers said afterward. \"Disappointed I didn't play better, that we didn't play better, especially in the second half.\" Discipline issues, Rodgers said, and third-down woes were two of the biggest issues the Steelers' offense had on Sunday night. \nPittsburgh's offense, which entered the weekend as the NFL's eighth-ranked unit on third down, was just 1 of 10 on converting in those situations Sunday night. The Steelers' early inability to convert on third down prevented them from taking an even bigger halftime lead as they had to settle for three Chris Boswell field goals. Rodgers attributed some of the third down issues to getting behind the sticks early with either negative plays or penalties. He also said he could have been more accurate on possession downs. The Steelers compounded the issue with multiple senseless penalties, especially DK Metcalf's eye poke of Packers linebacker Quay Walker that cost the Steelers 15 yards. \n\"It's not our style of business, and we can't live like that,\" Steelers coach Mike Tomlin said of his team's unnecessary penalties. Rodgers, who finished the night with 219 yards and two touchdowns on 24 of 36 passing, pointed to the start of the second half as a key turning point in the game. Pittsburgh got the ball to start the second half but was forced to punt after it appeared that the Packers' defense got away with an offsides that if penalized would have given the Steelers a third-and-3 situation. Instead, the Packers got the ball and quickly stole the game's momentum when Love hit Tucker Kraft on a 59-yard completion that set up the first of Green Bay's four second-half touchdowns.  \nSpeaking of Love, Rodgers was clearly impressed with what he was on Sunday night. Love, who became the first Packers quarterback since Brett Favre back in 2007 to complete 20 straight passes in a game, finished the night with 360 yards and three touchdowns on 29 of 37 passing. \"He played fantastic,\" Rodgers said. \"He's had a really nice season. He's been really efficient with the football. He's opportunistic, though I felt like he was very patient tonight. They took the run solutions. He took the check downs, moved in the pocket well. Thought he played really well.\" With regard to his emotions going up against his former team, Rodgers said that it would have been considerably different had Sunday night's game been played at Lambeau Field. Ironically, there were moments where it sounded like the game was being played in Green Bay, as \"Go Pack, Go!\" chants could be heard throughout the game and especially in the second half. \n\"I've heard that chant for 18 years,\" Rodgers said. \"Packer fans travel really well. First time in a while I've used silent count for a home game. That's a credit to those Packers fans.\" Rodgers took time this past week to reflect on his decorated career with the Packers. But after Sunday's game, though, the 41-year-old, four-time league MVP was focused on his current team and what they need to do amid a two-game losing streak and the 7-1 Colts coming to town next Sunday. \"Well, just an honest assessment,\" he said. \"I think, setting feelings aside and being OK with criticism, any position, any player, and being honest about what we need to do to improve. And then, we can't beat ourselves. \n\"I think in the three losses, there's been times where we've had opportunities and we've hurt ourselves with either turnovers or just negative plays. So we've got to cut those out. We've gotta get on the same page on both offense and defense, and keep the faith.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aaron Rodgers 'disappointed' after losing to Packers; Steelers QB praises Jordan Love's performance - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/711b8d48-5843-49c1-b2dc-58a5bf9886c6/thumbnail/1200x675/2b1d07f812c44709c1e14b9e83f22ad7/rodgerslove.jpg"
      ],
      "datePublished": "2025-10-27T06:23:00.000Z",
      "dateModified": "2025-10-27T06:23:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NASCAR playoffs at Martinsville results: William Byron earns walk-off win to make the Championship 4 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nascar/news/nascar-playoffs-at-martinsville-results-william-byron-earns-walk-off-win-to-make-the-championship-4/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/c434a924-d5bd-4d20-9d83-60458041fb7a/thumbnail/1200x675/c23d171257b9748a291799c4041073e1/gettyimages-2243480907.jpg",
    "tag": "Sports",
    "date": "2025-10-27T00:51:32.000Z",
    "description": "\n        RIDGEWAY, Va. -- In a situation where he had to win in order to earn the right to race for his first NASCAR Cup Series championship, William ",
    "body": "\n        RIDGEWAY, Va. -- In a situation where he had to win in order to earn the right to race for his first NASCAR Cup Series championship, William Byron outmuscled Ryan Blaney in the final laps at Martinsville to cap off a dominant day and win the Xfinity 500. Byron, who earned his third win of the season, third at Martinsville and the 16th of his Cup career, overcame a 36 point deficit to the Championship 4 cut line to join Denny Hamlin, Chase Briscoe, and Hendrick Motorsports teammate Kyle Larson in next week's championship race at Phoenix.After two previous potential winning efforts in the Round of 8 went awry late in those races -- colliding with a lapped car coming to pit road at Las Vegas and spinning out of the pack coming to the finish line at Talladega -- Byron made a statement by winning the pole at Martinsville, then leading 304 of 500 laps. But in order to make the Championship 4, Byron had to run down Ryan Blaney in a run to the finish that amounted to a head-to-head fight between drivers who had to win in order to make it to Phoenix.\n        \n            \n                NASCAR playoffs 2025 race schedule, results: Complete list of Cup Series race dates, winners, tracks\n                \n                    Steven Taranto                \n            \n                            \n    \n                \n                    \n    \nByron made his move with 43 laps to go, moving Blaney off of the bottom groove in turn 1 to take the lead. But when a spin by Carson Hocevar brought out the caution with less than 20 laps to go, Byron and his crew had to execute both on their final pit stop and the final restart. They did so, earning the right to try and become a championship team.\n\"Things have a way of working out. God really tests your resilience a lot of times, and we've been tested,\" Byron told NBC Sports. \"Unbelievable. I'm out of breath ... I am just so thankful, excited to see my family, and just celebrate this one. We obviously go to Phoenix and just try to go kick ass there.\n\"You just work so hard, all these guys work so hard, and you put everything into Sundays. And sometimes, you don't get anything in return, and that's been the last couple weeks and honestly throughout the year we've had some close calls. Sometimes life is that way. But you've just got to keep being resilient, and we were, and it just feels damn good.\"Blaney finished second, but it would be all for naught as he, Chase Elliott, Christopher Bell and defending Cup champion Joey Logano were eliminated from championship contention at the end of the Round of 8. Elliott finished third with Ross Chastain fourth, Kyle Larson fifth, Ryan Preece sixth, and then Bell, Logano, Todd Gilliland and Josh Berry rounding out the top 10.After the two were separated by just a single point entering Martinsville, Larson was able to successfully outpoint Bell, becoming the final driver to make the Championship 4 by seven points. But with Byron's win bumping the cut line down, it meant Bell had his heart ripped out for the second year in a row, having entered Martinsville with a 37-point advantage on the cut line only to be eliminated from title contention.\n\"We had good enough track position all day that we were kind of out of the mess, I guess,\" Larson told NBC Sports. \"... Happy for [William], happy for our team, happy for Hendrick Motorsports. This went as good as it could've for us, to score more points than Christopher and then have William or Chase win, too. Glad we can give Mr. H an opportunity next week, and hopefully one of us can win it.\"\"Just seemed  like we were lacking a little bit of long run pace,\" Bell told NBC Sports. \"I felt whenever we  got the balance close at times I could take off on tires and do okay and  make some passes, maintain my position. Then the consistent theme of  the day was just falling backwards as the tires got old.\"We just  weren't strong enough at Martinsville this weekend. We practiced in the  teens, we qualified in the teens, and kind of raced back there most of  the day. I feel content with the results. I think the four going there  are legitimate contenders. Whoever the champion is, it's going to be  well-deserved. The 20 team wasn't good enough.\"\nThe Championship 4 will pit the two Hendrick cars of Byron and Larson against two Joe Gibbs Racing cars driven by Denny Hamlin and Chase Briscoe, both of whom failed to finish on Sunday after suffering engine failures. Of that group, only Larson has previously won the Cup championship, having won the crown in 2021.With three rounds of playoff racing now in the books, next week's NASCAR Cup Series Championship Race at Phoenix Raceway comes down to a pure match race between the four drivers who have made the final round. Whoever among the Championship 4 drivers has the best finish in the Championship Race will become the 2025 NASCAR Cup Series champion.\nXfinity 500 results#24 - William Byron#12 - Ryan Blaney#9 - Chase Elliott#1 - Ross Chastain#5 - Kyle Larson#60 - Ryan Preece#20 - Christopher Bell#22 - Joey Logano#34 - Todd Gilliland#21 - Josh Berry#45 - Tyler Reddick#54 - Ty Gibbs#8 - Kyle Busch#88 - Shane van Gisbergen (R)#2 - Austin Cindric#3 - Austin Dillon#41 - Cole Custer#23 - Bubba Wallace#7 - Justin Haley#6 - Brad Keselowski#42 - John Hunter Nemechek#99 - Daniel Suarez#48 - Alex Bowman#71 - Michael McDowell#38 - Zane Smith#10 - Ty Dillon#47 - Ricky Stenhouse Jr.#16 - A.J. Allmendinger#17 - Chris Buescher#4 - Noah Gragson#77 - Carson Hocevar#51 - Cody Ware#66 - Casey Mears#43 - Erik Jones#11 - Denny Hamlin#35 - Riley Herbst (R)#19 - Chase Briscoe\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NASCAR playoffs at Martinsville results: William Byron earns walk-off win to make the Championship 4 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/c434a924-d5bd-4d20-9d83-60458041fb7a/thumbnail/1200x675/c23d171257b9748a291799c4041073e1/gettyimages-2243480907.jpg"
      ],
      "datePublished": "2025-10-27T00:51:32.000Z",
      "dateModified": "2025-10-27T00:51:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts' Jonathan Taylor makes NFL history vs. Titans while strengthening case for Offensive Player of the Year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-jonathan-taylor-makes-nfl-history-vs-titans-while-strengthening-case-for-offensive-player-of-the-year/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/252bd36c-f625-44e8-846f-c434517c1c95/thumbnail/1200x675/b717fb35d15d5d2f5b3a84596d4d0841/taylorweek8.jpg",
    "tag": "Sports",
    "date": "2025-10-27T00:14:35.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indianapolis Colts are rolling, and Jonathan T",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indianapolis Colts are rolling, and Jonathan Taylor continues to be a big reason why. During Sunday's win over the Titans, Taylor scored on an 80-yard touchdown run that gave the now 7-1 Colts a 24-7 lead early in the third quarter. With the score, Taylor matched Hall of Fame running back Earl Campbell for the fourth-most rushing touchdowns in history for a player in his first 75 games. Fittingly, Taylor's setting-setting score came against the Campbell's former team as the Oilers eventually were re-named shortly after the franchise moved from Houston to Tennessee. Both Taylor and Campbell ran for 63 touchdowns during their first 75 games. \nCampbell's iconic career included being named the NFL's MVP in 1979. While Taylor's current season has been MVP worthy so far, that award will likely elude him as a non-quarterback hasn't won league MVP since 2012, when former running back Adrian Peterson took home the honor after he nearly broke Eric Dickerson's single-season rushing record. \nWhile league MVP may be beyond his reach, Taylor has strengthened his case to win Offensive Player of the Year. He entered Sunday's game as the NFL's leader in rushing yards (697) and touchdown runs (10) while being a key factor in helping guide the Colts to the NFL's best record. Taylor had 149 yards and two touchdowns on just 10 carries on Sunday following his 80-yard scoring jaunt. The league's rushing champion back in 2021, Taylor is also on the precipice of reclaiming his unofficial title as the best player at his position, something Colts coach Shane Steichen feels that his player has already done. \n\"He's the best back in the league right now,\" Steichen recently said of Taylor. \"There's no doubt.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts' Jonathan Taylor makes NFL history vs. Titans while strengthening case for Offensive Player of the Year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/252bd36c-f625-44e8-846f-c434517c1c95/thumbnail/1200x675/b717fb35d15d5d2f5b3a84596d4d0841/taylorweek8.jpg"
      ],
      "datePublished": "2025-10-27T00:14:35.000Z",
      "dateModified": "2025-10-27T00:14:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How scorching starts from Austin Reaves and Luka Dončić could redefine LeBron James' role on new-look Lakers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/how-scorching-starts-from-austin-reaves-and-luka-doncic-could-redefine-lebron-james-role-on-new-look-lakers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/64230b98-bd3c-48c4-b107-92360212f5ef/thumbnail/1200x675/a22be375f4dc5bda98c3af4add57e88a/102625-austinreaves.jpg",
    "tag": "Sports",
    "date": "2025-10-27T05:13:48.000Z",
    "description": "\n        LeBron James was pretty bummed when Luka Dončić missed a free-throw with 3:05 remaining in Friday's win over the Minnesota Timberwolves. It m",
    "body": "\n        LeBron James was pretty bummed when Luka Dončić missed a free-throw with 3:05 remaining in Friday's win over the Minnesota Timberwolves. It meant that Dončić's second free throw would only take him to 49 points, and with the game in hand, he was removed before he could score his 50th. That 50-point marker is rare and special in the NBA. It only happened 18 times last season, and is worth celebrating. When Dončić came up short, the Lakers probably envisioned a pretty long wait before their next chance.That wait lasted all of two days.With Dončić sidelined due to injury along with almost 60% of the total Laker payroll against the Sacramento Kings on Sunday, Austin Reaves exploded for the best game of his career: 51 points, 11 rebounds, nine assists and a badly-needed 127-120 victory with Dončić set to miss at least a week.\n        \n            \n                Luka Dončić injury: Lakers superstar to miss at least a week with left finger sprain, leg contusion\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nLast season, only one team, the Denver Nuggets, had multiple players reach 50 points in a game. The Lakers are a single free-throw away from getting there in their first three games. Oh, and in their season opener, Dončić scored 43. That means the Lakers own the three highest-scoring regulation games by individual players so far in the 2025-26 season. These aren't exactly outlier performances, either. Reaves scored 26 points in the opener and 25 against Minnesota while taking a backseat to Dončić. He averaged just under 23 points per game from February onward last season, and his growth as a professional has been somewhat linear. In four NBA seasons, he's gone from 7.3 to 13 to 15.9 to 20.2 points per game.\nHis assist numbers have ballooned in similar fashion. He has 29 through three games. We're dealing with a tiny sample for the 2025-26 season, of course, and it's obviously been skewed by all of the injuries the Lakers have dealt with. But this is a pretty logical progression based on how Reaves has developed throughout his entire career. He looks ready to compete for an All-Star selection. Dončić is an MVP candidate whose credentials speak for themselves. It's not an exaggeration to suggest that the Lakers could have the NBA's best offensive backcourt.So, that's what they've gotten out of the players who have been healthy. Now we have to address the player who hasn't.The expectation for James' season debut is mid-November as he recovers from sciatica. Historically speaking, though, he likes to hit the ground running. When he returned from his longest absence last season, seven games in March, he played 31 minutes and took 16 shots in his return. When he's back, he'll be back. There probably isn't going to be an easing-in period for the Lakers to tinker with. They're probably going to have to figure out his role in advance.\nAnd that's where things start to get a bit complicated. James has the sixth-highest career usage rate in NBA history. He's led his team in 19 of his 22 NBA seasons, and when he hasn't, he's deferred to Hall of Famers: 2011 Dwyane Wade, 2017 Kyrie Irving, and Dončić last season. That has historically been the proper course of action. If you have LeBron James on your team, why on Earth would you give the ball to anyone else?Well, this Laker team offers the first set of compelling reasons to do so. For one thing, he'll be 41 in December. How many quadragenarians not named LeBron James have you ever seen occupy a significant possession-share within a successful NBA offense? Skinny Luka looks downright unstoppable. Reaves isn't far behind. That was a reasonable expectation coming into the season, because the value they provide is almost exclusively offensive.That isn't the case for James. LeBron is so good with the ball in his hands that we often neglect how great he is at everything else. If he wanted to be a supercharged version of Draymond Green, he'd have no trouble doing so. He's an elite screener and passer, and when he wants to be a killer defender, he's more than capable of doing so -- at least for short stretches. Those are traits the Lakers need far more than on-ball offense. Dončić and Reaves seemingly have that specific area under control.\nThe optimal version of this Laker team, therefore, is one in which James takes a bit of a backseat offensively. He's still LeBron James. He'll still score 18-20 points per night because, well, good luck preventing him from doing so. But more of those points will probably come in transition and off of spot-ups than more direct pick-and-roll creation. James himself has even acknowledged this to an extent.\"I spent a lot of time on my catch-and-shoot 3-pointers,\" James said at media day. \" ... Understanding how can I make the most of when I don't have the ball, either moving into space. Obviously, Luka and AR [Austin Reaves] going to do a lot of time handling the ball. …We have a lot of guys that can handle the ball, so how can I still be effective on a team where I don't have to handle the ball as much?\"JJ Redick has been talking about this since before even the Dončić trade.\"LeBron is one of the smartest players and I think using him as a screener and finding ways to get him the ball in specific spots on the floor where he can be a facilitator and scorer, that's what I mean by being off the ball,\" he explained on the Lowe Post podcast in September of 2024.\nThe groundwork has been laid for this transition for some time. James hardly ever took catch-and-shoot 3s in Miami or Cleveland, but his volume ticked up pretty meaningfully after he signed with the Lakers. It peaked in 2022 and 2023, when he needed to do so to accommodate Russell Westbrook and took as many as 3.5 of them per game. That number has dipped a bit in the ensuing seasons, but the 2.9 he took per game last season still represented a meaningful jump over any of his pre-Laker seasons during the tracking era. Considering he made 42% of them a year ago, it's an adjustment he's equipped to make if he's really prepared to embrace it.But that's the question here. LeBron James has been LeBron James for so long that truly adjusting to playing a different sort of basketball is going to be tricky. When Darvin Ham tried to limit his minutes to preserve his body during the 2023-24 season, James played only 29 minutes on opening night. That's as long as that effort lasted, as he immediately played 35 two nights later and averaged 35.3 for the season as a whole. James can play any conceivable role or style.. Getting him to embrace change has always been more of a struggle. That's understandable when you're arguably the greatest player who's ever lived, but it's going to be one of the keys to this Laker season. When James opted into his contract this offseason, he made it clear that he wants to compete for championships in the twilight of his career. The best hope the Lakers have of doing so is trusting Dončić and Reaves to handle the offense while James takes care of the things they can't.\nThey're soaring to even greater offensive heights than the team hoped. But they're never going to be high-level defenders, and most of their offensive value has to come with the ball in their hands. They're limited. James isn't. He can do practically anything, even if he can't do it as often or as aggressively as he did in his youth. So as his younger teammates ascend, the key to his season will be getting comfortable with the idea of doing the things they can't.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How scorching starts from Austin Reaves and Luka Dončić could redefine LeBron James' role on new-look Lakers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/64230b98-bd3c-48c4-b107-92360212f5ef/thumbnail/1200x675/a22be375f4dc5bda98c3af4add57e88a/102625-austinreaves.jpg"
      ],
      "datePublished": "2025-10-27T05:13:48.000Z",
      "dateModified": "2025-10-27T05:13:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 8 breakouts: Isaiah Davis earns a role worth stashing in leagues now, plus more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-8-breakouts-to-add-on-waiver-wire/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/12/09/208b817c-2441-4695-90e0-d8135831cd41/thumbnail/1200x675/c1838071681a4dc77c7176075929776e/isaiah-davis-new-york-jets-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-10-26T23:15:19.000Z",
    "description": "\n        Week 8 was a return to the household names in Fantasy Football with breakouts from Saquon Barkley, Jonathan Taylor and James Cook, among othe",
    "body": "\n        Week 8 was a return to the household names in Fantasy Football with breakouts from Saquon Barkley, Jonathan Taylor and James Cook, among others. There weren't too many surprises -- but Week 8 of the Fantasy Football season did bring some new players to the forefont with breakout performances that belong on your Fantasy Football radar now. On the Fantasy side, we received more data on how each offense plans to utilize its personnel. Our expectations for backfield touches, targets in the pass game, snap shares, and overall usage are often not met, and that's when we have to pivot.In Week 8, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 9 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Isaiah Davis, RB, Jets Davis showed signs of promise in Week 7 and was placed closely on all our radars at Fantasy Football Today when Breece Hall was limited in practice this week. Hall ended up playing -- and having a dominant game himself -- but Davis continued his upward trajectory. What is most promising about his role moving forward is the work he got in the pass game. The Jets appear to have found a new way to move the ball and it's by using their backs as an extension of the run game. Davis totaled 44 yards receiving on five receptions. He also added 65 yards rushing on just seven carries. 109 total yards on 12 touches -- he is the Jets' second-best playmaking option for touches for as long as Garrett Wilson is sidelined. Troy Franklin, WR, BroncosFranklin racked up 82 receiving yards and a touchdown on five receptions in Week 8. He finished with seven targets and was a clear focal point of the passing game in the first half before the Broncos jumped out to a massive lead. Franklin has struggled to find consistency in Fantasy, but he continues to produce and the Broncos offense is trending up. Xavier Hutchinson, WR, TexansWith Nico Collins (concussion) sidelined for Week 8, the expectation was that Houston's rookie receivers would pick up the slack. While both Jaylin Noel and Jayden Higgins did make their splash plays, Hutchinson was a more consistent piece of the Texans' offensive game plan. Hutchinson finished with six targets and turned them into five receptions for 69 yards and a TD. Hutchinson has been a red zone favorite for C.J. Stroud and will have FLEX appeal if Collins is forced to miss another game in Week 9. \nSamaje Perine, RB, BengalsPerine has taken a bigger role in the Bengals offense of late -- and with Joe Flacco at the helm -- this is an offense you want exposure to. Perine took nine carries for 94 yards and scored a touchdown on a long run. He also added a catch to get him to the 100 yards (total) mark. Perine is a handcuff for Chase Brown but will continue to offer FLEX appeal in the deepest of leagues and in the right matchup.RJ Harvey, RB, BroncosIf Harvey was released in your leagues and he's sitting on the waiver wire -- make sure you amend that fast. Harvey finally looked like the explosive player you drafted him in the middle rounds of your Fantasy drafts to be in Week 8. He scored three touchdowns -- two on the ground and one through the air. Denver is likely to look to use Harvey's explosion as a weapon in their offense more in the second half of the 2025 season. Jayden Higgins, WR, Texans Higgins continues to prove capable of making big plays for the Texans offense in Collins' absence. While he finished with just 34 yards receiving (and a touchdown) on four receptions, he was heavily involved from a volume standpoint. Higgins led the Texans with eight total targets. If Collins misses Week 9, Higgins has FLEX appeal. \nPat Bryant, WR, BroncosLast week we featured Chimere Dike in this column as an up-and-coming third-round rookie draft pick who started to get more involved in his offense of late and cashed in with points (in Week 7). Now, in Week 8, Bryant continues his steady drumbeat of more involvement in the Broncos offense followed up with big plays in the pass game. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 8 breakouts: Isaiah Davis earns a role worth stashing in leagues now, plus more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/12/09/208b817c-2441-4695-90e0-d8135831cd41/thumbnail/1200x675/c1838071681a4dc77c7176075929776e/isaiah-davis-new-york-jets-usatsi.jpg"
      ],
      "datePublished": "2025-10-26T23:15:19.000Z",
      "dateModified": "2025-10-26T23:15:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-NFL star Adrian Peterson arrested in Texas for DWI, unlawful possession of weapon - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ex-nfl-star-adrian-peterson-arrested-in-texas-for-dwi-unlawful-possession-of-weapon/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/8eefc979-bbd9-4cc0-b4ba-693d591e7880/thumbnail/1200x675/2137c8eac701c30323f93d418e28612a/untitled-design-2025-10-26t182350-493.png",
    "tag": "Sports",
    "date": "2025-10-27T01:27:03.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Former NFL running back Adrian Peterson is facing ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Former NFL running back Adrian Peterson is facing multiple charges following his arrest early Sunday in Sugar Land, Texas, according to local police, per KHOU 11. Sugar Land police confirmed with the news station that Peterson was taken into custody around 9:30 a.m. and was charged with DWI and unlawful carrying of a weapon.Police did not release additional details about Peterson's arrest due to an active investigation, per reports. Fort Bend County jail records confirmed Peterson's arrest.Peterson, 40, was arrested earlier this year on similar DWI charges, just hours after leaving Minnesota's 2025 NFL Draft party. Peterson got into a fight with a man over a poker game earlier this summer and tried to cash in on the skirmish after signing a Celebrity Boxing contract, according to TMZ Sports, with his first fight coming against Joe \"Baby Joe\" Castaneda, the person at the center of the May brawl at JokerStars in Houston.No charges were filed from the fight and police were not involved. Video of the incident showed Peterson emerge with a bloody face, but he said the cut came from hitting a chair during the melee.\nPeterson lost his only other boxing match after he was knocked out in 2022 by former NFL running back Le'Veon Bell.The NFL's Rookie of the Year out of Oklahoma in 2007, Peterson rushed for 14,918 and 120 touchdowns over his 15-year career. He played his first 10 seasons in Minnesota before brief stints in New Orleans, Washington, Arizona, Detroit, Tennessee and Seattle. Peterson attempted a comeback following his final NFL season in 2021 after sitting out the 2022 season, but it didn't materialize. The former league MVP was 38 at the time and would've been the oldest running back to play in the NFL in the Super Bowl era, which stretches back to 1966. \nPeterson is from Palestine, Texas, which is three hours north of Sugar Land.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-NFL star Adrian Peterson arrested in Texas for DWI, unlawful possession of weapon - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/8eefc979-bbd9-4cc0-b4ba-693d591e7880/thumbnail/1200x675/2137c8eac701c30323f93d418e28612a/untitled-design-2025-10-26t182350-493.png"
      ],
      "datePublished": "2025-10-27T01:27:03.000Z",
      "dateModified": "2025-10-27T01:27:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cam Skattebo injury: Giants rookie suffers dislocated ankle vs. Eagles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cam-skattebo-injury-giants-rookie-suffers-dislocated-ankle-vs-eagles-carted-off-field/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/385efa7e-56e4-4244-a5b5-c71508c4e692/thumbnail/1200x675/e1914482be0c6e2ed85bf434318e1b8e/cam-skattebo-carted-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-26T23:58:54.000Z",
    "description": "\n        New York Giants rookie running back Cam Skattebo suffered a dislocated ankle in Sunday's 38-20 loss to the Philadelphia Eagles, and the team ",
    "body": "\n        New York Giants rookie running back Cam Skattebo suffered a dislocated ankle in Sunday's 38-20 loss to the Philadelphia Eagles, and the team announced that he is scheduled to undergo surgery Sunday night in Philadelphia but did not offer a timeline for his recovery.Skattebo was carted off the field with an air cast on his left leg with 8:07 left in the first half after he was rolled up on during a tackle. Prior to his exit, Skattebo handled three carries for 12 yards and caught an 18-yard touchdown pass. This is a devastating blow to what has been a remarkable debut season for Skattebo. The Arizona State product was a source of excitement for the Giants' future, along with fellow first-year standout Jaxson Dart, who formed the other half of a prolific backfield after winning the starting quarterback job.\"He's irreplaceable,\" Giants right tackle Jermaine Eluemunor told reporters postgame. \"You can have guys that run the ball really hard, but his energy and what he brings to the table and the way he runs the ball, it's going to be hard to replace. I just pray that he gets healthy and comes back even better next year.\"\n\n        \n            \n                NFL trade deadline rumors: Cowboys made calls for both Maxx Crosby and Trey Hendrickson, but got rejected\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nSkattebo was taken to a Philadelphia-area hospital during the game and was scheduled to undergo surgery Sunday night rather than return home with the team.\"I was devastated,\" rookie quarterback and good friend Jaxson Dart said. \"That's my boy. Seeing him go down and reacting to what happened, it sucks. It's the worst part of this game.\"\nTyrone Tracy Jr. is the next man up in the backfield and figures to return to the starting role he held at the beginning of the year, so long as Skattebo is on the shelf.\nSkattebo racked up 398 yards rushing and five touchdowns, along with 189 yards receiving and a score, across the first seven games of his career. He jumped into the starting lineup three weeks into the campaign and had been one of the Giants' top weapons ever since. His three-touchdown game against the Eagles on Oct. 9 was an early high point of what looks destined to be a prolific career.Skattebo was in the running for the NFL Offensive Rookie of the Year award but will undoubtedly fall out of the race now. He entered Week 8 with the seventh-best odds to win the honor, per FanDuel, at +3000.The outstanding debut campaign is part of an overall terrific year for NFL rookies. Skattebo led all rookies with 587 scrimmage yards through seven games and was one of three rookies to hit the 500-yard mark. Only one first-year player hit that threshold through seven weeks last season, in contrast.\nSkattebo looks like one of the biggest steals of the 2025 NFL Draft. He came off the board in the fourth round but outperformed every other rookie skill position player in total yardage prior to his injury. All-purpose stardom is nothing new for Skattebo, though. He made a late push last season for the Heisman Trophy at Arizona State and finished fifth in the award voting, and that came two years after he shined at Sacramento State as an FCS All-American.Eagles star running back Saquon Barkley, a former Giant, also weighed in on the injury. Barkley suffered his share of injuries during his time in New York.\"From everything I've heard, the type of person he is and how he comes to work through adversity and the mindset he has that got him to this point is going to help him get through it,\" Barkley, who tore his ACL playing for the Giants in 2020, said. \"He's a heck of a back. You could see just how the stadium felt because of the energy he brought. I know those [trainers] over there really well, and they helped me get back from my knee injury, so he's in great hands.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cam Skattebo injury: Giants rookie suffers dislocated ankle vs. Eagles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/385efa7e-56e4-4244-a5b5-c71508c4e692/thumbnail/1200x675/e1914482be0c6e2ed85bf434318e1b8e/cam-skattebo-carted-getty.jpg"
      ],
      "datePublished": "2025-10-26T23:58:54.000Z",
      "dateModified": "2025-10-26T23:58:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With loss to Packers, Aaron Rodgers misses chance to join rare QB club - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/with-loss-to-packers-aaron-rodgers-misses-chance-to-join-rare-qb-club/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/b3503265-fb9c-4dd3-b166-6377cb008b52/thumbnail/1200x675/d9964e4cace36bb32d500b987eb05ad1/aaron-rodgers-steelers.jpg",
    "tag": "Sports",
    "date": "2025-10-27T05:01:03.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Aaron Rodgers stands among the all-time greats in ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Aaron Rodgers stands among the all-time greats in pretty much every single career accomplishment.His four MVPs are second all-time, one behind Peyton Manning. He's top five in passing yards and passing touchdowns. He won a Super Bowl and a Super Bowl MVP. But in Sunday night's 35-25 loss to the Packers, he missed out on adding one more accolade. With a win, he would have been just the fifth quarterback to defeat all 32 current NFL franchises.Considering the Packers and the Steelers are in different conferences -- and more crucially that Rodgers is 41 years old and has said that this will be his final season -- it will likely remain that way.\nThis was Rodgers' first game against his former longtime franchise. He played and beat his other former franchise, the Jets, in Week 1. Though Rodgers didn't play poorly Sunday (219 passing yards, two touchdowns, no interceptions), Pittsburgh's offense managed just one touchdown in the second half, and the defense fell off significantly against Jordan Love (360 passing yards, three touchdowns) after a strong start.Though we'll never say never with Rodgers, it appears the four-quarterback group to beat all 32 teams -- Brett Favre, Tom Brady, Drew Brees and Peyton Manning -- is safe for now. It should also be noted that Fran Tarkenton and Joe Montana beat all 28 teams when the league only had 28 teams.\nRodgers remains on the slightly less-impressive (but still very impressive) list of quarterbacks to beat 31 teams.Quarterbacks to defeat 31 NFL   teamsTeam not defeatedAlex SmithKansas   City ChiefsBen RoethlisbergerPittsburgh   SteelersPatrick MahomesKansas   City ChiefsAaron RodgersGreen   Bay PackersRussell WilsonSeattle   SeahawksMatthew StaffordPittsburgh   SteelersKerry CollinsMiami   Dolphins\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With loss to Packers, Aaron Rodgers misses chance to join rare QB club - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/b3503265-fb9c-4dd3-b166-6377cb008b52/thumbnail/1200x675/d9964e4cace36bb32d500b987eb05ad1/aaron-rodgers-steelers.jpg"
      ],
      "datePublished": "2025-10-27T05:01:03.000Z",
      "dateModified": "2025-10-27T05:01:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kellen Moore doesn't commit to starting QB after benching Spencer Rattler for Tyler Shough - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/kellen-moore-doesnt-commit-to-starting-qb-after-benching-spencer-rattler-for-tyler-shough/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/cec6fc0e-ebe9-4841-86b9-aad02f13ec5a/thumbnail/1200x675/7b22b2dcb3291f3baf584caea0a7aa63/shough.jpg",
    "tag": "Sports",
    "date": "2025-10-27T01:56:22.000Z",
    "description": "\n        The New Orleans Saints were looking for a spark during their eventual, 23-3 Week 8 loss to the Tampa Bay Buccaneers. In the third quarter, fi",
    "body": "\n        The New Orleans Saints were looking for a spark during their eventual, 23-3 Week 8 loss to the Tampa Bay Buccaneers. In the third quarter, first-year coach Kellen Moore made the decision to bench quarterback Spencer Rattler for rookie Tyler Shough.Rattler completed 15 of 21 passes for 136 yards and one interception before being pulled. Shough came in and completed 17 of 30 passes for 128 yards and one interception in his first extended NFL action. \"We just needed to find a way to create something on offense,\" Moore said about Rattler's benching after the game. \"It has more to do with the offense collectively. We're just not executing and playing at a high enough standard and we gotta find a way to move the football consistently, protect the football and score points. This is a pure full offensive evaluation point. We're just not there.\"So, is Moore ready to make a full-time QB switch?\n\"I think we just gotta evaluate this whole thing in the next 48 hours on offense, find the solutions that give us the best chance to win,\" Moore said. \"Tyler went in there and looked the part, he made some plays, the one interception was unfortunate, gave us a chance to convert there, and so we'll obviously make that evaluation here quickly and make some decisions moving forward. But this had more to do with the whole offense just not playing well enough and hopefully trying to generate some form of a spark there.\"Shough, who lost the preseason quarterback battle with Rattler, was selected by the Saints with the No. 40 overall pick in the 2025 NFL Draft. The Louisville product completed 62.7% of his passes for 3,195 yards, 23 touchdowns and six interceptions last season, and left college with a 21-11 career record as starter in games played for Louisville, Texas Tech and Oregon. Despite being a rookie, Shough turned 26 last month. He was one of the more polarizing prospects in this past draft class, with one current NFL head coach reportedly believing Shough was the best quarterback in the entire draft. \nThe Saints offense ranks No. 27 in the NFL with 295 yards of total offense averaged per game, and the 16 points per game New Orleans averages ranks No. 29. It's clear that the Saints have a problem on offense, but it remains to be seen if Moore believes a quarterback swap will be enough to get this team back on track. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kellen Moore doesn't commit to starting QB after benching Spencer Rattler for Tyler Shough - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/cec6fc0e-ebe9-4841-86b9-aad02f13ec5a/thumbnail/1200x675/7b22b2dcb3291f3baf584caea0a7aa63/shough.jpg"
      ],
      "datePublished": "2025-10-27T01:56:22.000Z",
      "dateModified": "2025-10-27T01:56:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jordan Love matches one of Brett Favre's franchise records as Packers defeat Steelers and Aaron Rodgers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jordan-love-matches-one-of-brett-favres-franchise-records-as-packers-defeat-steelers-and-aaron-rodgers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/98c93b99-e3db-4661-b3de-172426f5aa8d/thumbnail/1200x675/6b7505df5d72f91db88cc5516acd9d9f/lovesnf.jpg",
    "tag": "Sports",
    "date": "2025-10-27T06:06:09.000Z",
    "description": "\n        While the pregame hype was centered around Aaron Rodgers, Jordan Love stole the show on Sunday night while leading the Packers to a 35-25 win",
    "body": "\n        While the pregame hype was centered around Aaron Rodgers, Jordan Love stole the show on Sunday night while leading the Packers to a 35-25 win over the Steelers and his former teammate. In a twist of irony, Love's brilliant night included him tying a franchise record with Brett Favre, the Packers' Hall of Fame quarterback whom Rodgers succeeded as Green Bay's QB1 in 2008. During the game, Love tied Favre's 18-year-old franchise record by completing 20 consecutive passes. Ironically, Rodgers was Favre's teammate when Favre completed 20 straight passes during the 2007 season. \"It's definitely special,\" Love told NBC Sports afterward. \"Obviously, I think we faced a little adversity in the first half and bounced back. We knew it was gonna be a hyped-up game all week going against A-Rod. Glad we came in here handled business.\" Love's hot streak helped the Packers turn a 16-7 halftime deficit into a 35-19 lead with just under four minutes to play. He had a lot of success throwing to tight end Tucker Kraft, who caught seven passes for 143 yards and two touchdowns on National Tight Ends Day.\n\"We knew we just had to focus on the details,\" Love said of Green Bay's halftime adjustments. \"Everybody's got to go out there, do their job and just lock in and go out there and make the plays we weren't making in the first half. And we did.\" They certainly did. And while it was a complete team effort, the Packers' dominant second-half performance was keyed by Love, who finished the game with 360 yards on 29 of 37 passing while becoming the first Packers quarterback since Hall of Famer Bart Starr to get a win in Pittsburgh. \nLike Rodgers and Favre, Love spent three years as Rodgers' teammate before getting a chance to lead the Packers' offense. But unlike Rodgers, Love led the Packers to the playoffs during his first season as the team's QB1 that included a stunning upset win over Dallas in the NFC wild-card round. \nLove and the Packers were unable to duplicate that level of success in 2024, however. While they made the playoffs, the Packers were quickly dismissed by the eventual champion Eagles in the first round. Love specifically took a step back that was largely the byproduct of injuries that started during Green Bay's season-opening loss to the Eagles. The 2024 season was also a rough one for Rodgers, who signed with Pittsburgh this offsason after a tumultuous two seasons with the Jets. Rodgers has found new life in Pittsburgh as he looks to cap off his future Hall of Fame career on a positive note. Love is looking to join Rodgers, Favre and Starr as Packers quarterbacks who won the Super Bowl during their age 27 season. While he's still a ways a way from doing that, Love helped that cause on Sunday night as the 5-1-1 Packers maintained their spot atop the NFC North. \nIn the process, Love tied Favre in the history books while denying Rodgers the distinction of becoming the fifth quarterback in history to defeat all 32 teams. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jordan Love matches one of Brett Favre's franchise records as Packers defeat Steelers and Aaron Rodgers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/98c93b99-e3db-4661-b3de-172426f5aa8d/thumbnail/1200x675/6b7505df5d72f91db88cc5516acd9d9f/lovesnf.jpg"
      ],
      "datePublished": "2025-10-27T06:06:09.000Z",
      "dateModified": "2025-10-27T06:06:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why should LSU AD Scott Woodward -- responsible for 2 historic buyouts -- get to make next hire? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/why-should-lsu-ad-scott-woodward-responsible-for-2-historic-buyouts-get-to-make-next-hire/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/8258cc01-8096-49af-a5ab-375cf3d8cb05/thumbnail/1200x675/240532a567abf147f2c5e323b15f9ecd/lsuadscottwoodwardjpg.jpg",
    "tag": "Sports",
    "date": "2025-10-27T02:31:40.000Z",
    "description": "\n        Two years ago, Texas A&M paid Jimbo Fisher more than $70 million to go away, the biggest buyout in the history of college football. On Sunday",
    "body": "\n        Two years ago, Texas A&M paid Jimbo Fisher more than $70 million to go away, the biggest buyout in the history of college football. On Sunday, Brian Kelly reportedly picked up the second-largest buyout ever.Those situations had one person in common: Scott Woodward. The LSU athletic director has a reputation of fishing for splashy hires. During his first stop at Washington, he lured Chris Petersen from Boise State. At Texas A&M, he landed the hire of the century by bringing national champion Fisher to College Station. And after taking the LSU job in 2019, he swung for the fences when he lured Brian Kelly from Notre Dame with a massive 10-year contract. Woodward is a poster child for winning the press conference, imposing his will and handing out some of the craziest contracts ever. But now, for the second time in three years, his obsession with swinging for the fences has a major athletic department reeling. And now, with the board and even governor of Louisiana getting involved, LSU should seriously consider whether Woodward deserves the chance to make a third mistaken hire. Let's turn the clock back to the 2021 coaching carousel for a moment. From the start, it was clear that Woodward -- a native son of Baton Rouge -- was saving his biggest moment for his alma mater. LSU was tied to then-Oklahoma coach Lincoln Riley, to the point that Riley even publicly said he would not go to Baton Rouge. He instead took the USC job. \nThen, it was trying to convince Fisher to go from Texas A&M to LSU. His interest earned Fisher a new monstrous extension -- so technically, not all $70 million in buyout money was Woodward's fault. From there, it was haphazardly big game hunting. Lane Kiffin. Mel Tucker. There was little consideration for taking shots like Georgia defensive coordinator Dan Lanning or Texas A&M defensive coordinator Mike Elko. Hindsight is 20/20 on those candidates, but they're leading some of the best teams in college football in 2025. Finally, in Kelly, Woodward convinced a \"name\" to say yes. The Notre Dame coach was a career northern coach without any history recruiting the south. He was a ball coach and program builder with struggles recruiting at the highest level. In his mind, introducing the recruiting infrastructure would solve his greatest problems; there wasn't much consideration that he was a part of the issue. \nFrom the start, Kelly in the Deep South was a little bit of a joke. He became a meme when he tried to feign a Southern accent, and danced with a recruit. It was a strange look for the longtime coach at Notre Dame, one of the most straight laced programs in the sport. Kelly did have some quick success, leading the Tigers to a 2022 SEC West title and win over Alabama. But from there, cracks started forming in the foundation. In the past two years, the defense declined. When they invested heavily to fix it, the offensive line and running game collapsed. To the contrary, Marcus Freeman, the coach that replaced Kelly at Notre Dame, played for a national championship in 2025. No one in South Bend sweated losing the winningest coach in the history of the program. \nLSU under Kelly never reached serious national championship contention, despite putting elite resources into the 2025 recruiting class. The swing for the fences resulted in another strikeout, and a wildly expensive one at that. Even heading into Sunday, it was viewed as unlikely around the industry that Kelly's job was seriously on the line. Instead, Woodward pulled the plug after a disappointing 49-25 loss to No. 3 Texas A&M at Tiger Stadium that ended with \"Fire Kelly!\" chants across the venue. To be clear, there is value to taking swings and winning the press conference. It can galvanize fans and boosters, bringing much needed support -- financial and otherwise -- to the athletic department. \nBy hiring Petersen, Woodward resurrected Washington's athletic department, turning them into a national contender. Fisher also led Texas A&M to an Orange Bowl victory and AP top-five finish before he was unceremoniously canned. And even though the on-field product ultimately suffered, it galvanized Texas A&M into investing at the top of college football. But entering a competitive coaching market and new era of college football, LSU has to be smarter about managing its search. There are power players in Louisiana who would view the coach at Tulane, Jon Sumrall, as beneath them. They should not. Sumrall is one of the best coaches in America. Not giving him a full vetting would be malpractice. And furthermore, the magnetic power of individual coaches in the sport is waning. More important now is resource, infrastructure and administrative support. Indiana's hiring of Curt Cignetti spurred action, but their ascension to the top of the sport coincides with unprecedented investment in the program. To the contrary, LSU only re-entered the elite tier of player acquisition with the 2024-25 recruiting class. Will the next coach be given top 1% investment? That matters far more than whether you hand him a $12 million contract. \nIt's unclear at this point whether Woodward will lead the coaching search in 2025. Louisiana governor Jeff Landry has already made his voice heard. LSU does not have a permanent school president, only complicating the situation. And certainly, Woodward will feel personal pressure to clean up his mistake and deliver an even bigger result for his hometown program. But if LSU has not learned from Woodward's repeated mistakes, nothing will change. Don't worry about winning the press conference. Just hire a dang good coach. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why should LSU AD Scott Woodward -- responsible for 2 historic buyouts -- get to make next hire? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/8258cc01-8096-49af-a5ab-375cf3d8cb05/thumbnail/1200x675/240532a567abf147f2c5e323b15f9ecd/lsuadscottwoodwardjpg.jpg"
      ],
      "datePublished": "2025-10-27T02:31:40.000Z",
      "dateModified": "2025-10-27T02:31:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the college football coaches fired and hired in 2025 so far - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-coaching-carousel-tracker-grades-analysis-on-coach-changes-2025-26-firings-and-hirings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/e3614dc7-5ac1-485e-a885-ba6d4ceb3ff0/thumbnail/1200x675/c050e43b09148171ff72ba3ca03d0788/getty-brian-kelly-lsu.jpg",
    "tag": "Sports",
    "date": "2025-10-27T00:50:59.000Z",
    "description": "\n\n\n    \n                                    A running list of every open job in what's already been a historic season of turnover\n        \n           ",
    "body": "\n\n\n    \n                                    A running list of every open job in what's already been a historic season of turnover\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 26, 2025\n                            \n                    at\n    8:50 pm ET\n                        \n                •\n            \n            4 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        A record-breaking spin on the coaching carousel is already underway across college football.  We're up to eight openings in the power conferences midway through the 2025 season --  and that doesn't count Stanford, where Frank Reich was named interim coach in March. Only five power jobs came open all of last season, when 30 total jobs (25 in the Group of 6) were filled.  Overall, the two years leading up to this cycle (2025-26) were the most hectic we've seen this century, with a total of 61 programs changing head coaches. That means an incredible 44.9% of FBS teams changed leadership during a two-year span. That number will skyrocket this fall and winter.  \nCBS Sports is tracking every move in the 2025-26 cycle and grading each hire below.       College football coaching carousel    TeamInOutAnalysis\n                            \n    \n                                                \n                    \n    Kenni BurnsKent State fired Kenni Burns  in April for violations of his contract that included use of his personal card for expenses. Burns was a dismal 1-23 in two seasons leading the Flashes, including a 0-12 record in 2024.\n                            \n    \n                                                \n                    \n    Troy TaylorStanford fired Taylor  amid allegations of mistreating female staffers. Taylor posted a 6-18 record in two seasons with the program after coming to Palo Alto after a successful run at Sacramento State. He lost eight of last nine games. The Cardinal hired Frank Reich to serve as interim coach, which reunites him and Stanford general manager Andrew Luck; Reich coached Luck with the Indianapolis Colts for one season in 2018.\n                            \n    \n                                                \n                    \n    DeShaun FosterUCLA fired Foster  only three games into his second season. The former All-American running back with the Bruins fished his tenure with a 5-10 record, including 3-6 in Big Ten matchups.\n                            \n    \n                                                \n                    \n    Brent PryPry's tenure at       Virginia Tech       came to an end  following his team's 0-3 start. The decision came after the Hokies' 45-26 home loss to        Old Dominion       , which was the third straight by double digits. The Hokies were never ranked in the three-plus years of Pry's tenure as coach. Pry's predecessor, Justin Fuente, went 43-31 at Virginia Tech, but was fired after going 10-11 in his final two seasons at the helm.\n                            \n    \n                                                \n                    \n    Mike GundyOklahoma State        ousted Gundy after he spent more than two decades at the helm of the Cowboys. The move ended a tenure that once positioned the program among the Big 12's elite. Gundy, 58, was the second-longest tenured FBS coach. He departed after a steep decline during the past two seasons, including a 3-9 record in 2024 and a 1-2 start to 2025.\n                            \n    \n                                                \n                    \n    Trent BrayOregon State &#xA0;fired Bray seven games into his winless second season leading the program. The Beavers dropped to 0-7 with Week 7's 39-14 loss to Wake Forest  , which marked their fourth double-digit defeat of the year. Bray's first year in his new post got off to a decent start. The Beavers went 4-1 through the first half of the 2024 regular season, with their only loss coming against Oregon, the eventual Big Ten champion. But Oregon State spiraled to 1-6 down the stretch, causing it to miss a bowl game.\n                            \n    \n                                                \n                    \n    Sam PittmanArkansas     '  decision to fire Sam Pittman  came following a 56-13 loss to Notre Dame and a week after the Razorbacks squandered an 18-point lead on the road at       Memphis . Situated on one of college football's hottest seats  entering his sixth season at the program, Pittman finishes 32-34 overall at Arkansas, including a 14-29 mark against SEC competition. Since finishing 9-4 overall and finding a spot inside the final AP Top 25 poll to conclude the 2021 season, the Razorbacks sputtered under Pittman's guidance despite a bevy of coaching staff changes and roster alterations annually in recruiting and through the transfer portal.     \n                            \n    \n                                                \n                    \n    James FranklinPenn State fired Franklin  six games into his 12th season with the Nittany Lions -- amid a disastrous three-game slide. The No. 2 team in the preseason AP Top 25 just two months ago, the Nittany Lions slipped to 0-3 in Big Ten play following a stunning 22-21 home loss to Northwestern in Week 7 -- a game in which they were a three-touchdown favorite. The massive upset was Penn State's second in a row after falling at previously winless UCLA on Oct. 4, making it the first FBS team since 1978 to lose back-to-back games as favorites of at least 20 points.\n                            \n    \n                                                \n                    \n    Trent DilferUAB moved on from Dilfer  six games into his third season with the Blazers. UAB's decision came just one day after the team dropped to 2-4 on the year in a 53-33 loss to FAU. Dilfer was on track for a third straight losing season with the Blazers. All four of their losses this year came by at least 14 points and only one of their wins came against an FBS opponent.\n                            \n    \n                                                \n                    \n    Billy NapierFlorida fired Billy Napier  on Oct. 19 following one of the worst tenures in school history. He was 22-23 in three-plus seasons and managed only a 5-17 record against ranked teams. He was also a combined 1-4 against rivals Florida State and Miami. His replacement will likely have Power Four experience.\n                            \n    \n                                                \n                    \n    Jay NorvellA 2-5 start to the season and a .500 career record in the Mountain West led to  Colorado State firing Jay Norvell  on Oct. 19. Colorado State enters the market a critical moment as it prepares to move from the Mountain West to the Pac-12 next season.\n                            \n    \n                                                \n                    \n    Brian KellyAfter a 5-3 start to a 2025 season that carried national title aspirations coming in, LSU fired Kelly on Oct. 26. A 49-25 loss to Texas A&M in Death Valley in Week 9 was embarrassing enough for the Tigers to make a change a create another lucrative opening on the market. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the college football coaches fired and hired in 2025 so far - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/e3614dc7-5ac1-485e-a885-ba6d4ceb3ff0/thumbnail/1200x675/c050e43b09148171ff72ba3ca03d0788/getty-brian-kelly-lsu.jpg"
      ],
      "datePublished": "2025-10-27T00:50:59.000Z",
      "dateModified": "2025-10-27T00:50:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football's 10 largest coach buyouts of all time: Where Brian Kelly ranks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-footballs-10-largest-coach-buyouts-of-all-time-where-brian-kellys-50-million-lsu-severance-ranks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/c3c537ef-a9b2-42fa-9d12-5eaebd1e6b68/thumbnail/1200x675/a06ea0180db9f3c7d329181fc0b619c7/untitled-design-69.png",
    "tag": "Sports",
    "date": "2025-10-27T02:07:13.000Z",
    "description": "\n        The Brian Kelly era at LSU is over. The Tigers fired their fourth-year coach on Sunday, less than 24 hours after a 49-25 loss to Texas A&M.Wh",
    "body": "\n        The Brian Kelly era at LSU is over. The Tigers fired their fourth-year coach on Sunday, less than 24 hours after a 49-25 loss to Texas A&M.While negotiations are still ongoing between both parties, Kelly's contractual buyout of more than $50 million would be the second largest ever paid to a college football coach -- behind only Jimbo Fisher, who received more than $76 million after being fired by Texas A&M in November 2023.Kelly is due for a massive payout after signing a 10-year contract with LSU in 2021. His salary this season was $9.4 million, and he had six years and $58.2 million remaining on his deal, which ran through 2031. The buyout language in his contract calls for him to be paid 90% of his remaining salary, which totals $52,380,000.Three of the five largest buyouts in college football history have occurred during the 2025 season. The first major firing came when Penn State let go of James Franklin after losing to Northwestern earlier this month. Franklin's buyout ($49 million) ranks just behind Kelly's.\nA week later, Florida fired Billy Napier, who is set to receive more than $21 million after going 22-23 in his three-plus seasons. Napier finished 12-16 in SEC play and 0-14 against ranked opponents away from home.With Kelly out and LSU preparing for another coaching search, here's where his buyout ranks on the all-time list:And then you have Billy Napier, who was fired by Florida just over a week after Franklin. Napier is set to receive a buyout of over $21 million after he went 22-23 during his tenure. Napier finished 12-16 against SEC competition and was 0-14 against ranked opponents away from home.\nWith Kelly fired, and LSU set to embark on a coaching search in the near future, here is where his buyout ranks on the all-time list.\n        \n            \n                LSU coaching candidates: Lane Kiffin, Dabo Swinney among options on hot board to replace Brian Kelly\n                \n                    Chris Hummer                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    1. Jimbo Fisher, Texas A&MBuyout: $76.8 millionNo college football coach has made more money from a firing than Fisher. When Texas A&M dismissed the former Florida State coach six seasons into his tenure, it wasn't a surprise. The Aggies were 6-4 in his final season. Their 9-1 record during the shortened 2020 COVID season was the high point of his tenure, but the program never reached the College Football Playoff.The Aggies took a risk by paying that much to make Fisher go away, but it appears to have paid off. Texas A&M is 8-0 and looks poised to clinch the first CFP berth in program history.\n\n                            \n    \n                                                \n                    \n    2. Brian Kelly, LSUBuyout: $53.8 millionWhen LSU hired Kelly away from Notre Dame during the wild 2021 coaching cycle, it was a bold move. The Tigers hoped he could restore them to national title contention. Two seasons before his arrival, LSU won a national title under Ed Orgeron.But the Kelly hire ultimately didn't justify the investment. LSU missed the CFP in each of his three full seasons and was on track to do so again after losing to Texas A&M. In retrospect, LSU likely regrets handing out such a massive contract for middling results.\n                            \n    \n                                                \n                    \n    3. James Franklin, Penn StateBuyout: $49 millionPenn State entered 2025 with national title hopes after reaching the CFP for the first time in program history the year before. The Nittany Lions returned many of their top offensive players and opened the season ranked No. 2 behind Texas in the preseason AP Top 25.\nAfter consecutive losses to Oregon, UCLA and Northwestern, the administration had seen enough. Franklin went 104-45 during his tenure but consistently underperformed against ranked opponents.\n                            \n    \n                                                \n                    \n    4. Gus Malzahn, AuburnBuyout: $21.4 millionAuburn has been searching for stability since firing Malzahn in 2020. He went 68-35 overall, including 38-27 in SEC play.After a 6-4 finish in 2020, Auburn fired Malzahn and replaced him with Bryan Harsin, who lasted just 21 games. Current coach Hugh Freeze is on the hot seat, meaning the Tigers could be paying another buyout soon.\n\n                            \n    \n                                                \n                    \n    5. Billy Napier, FloridaBuyout: $21.2 millionNapier entered 2025 on the hot seat after narrowly surviving the previous season. Florida finished 8-5 in 2024 and had momentum with star quarterback DJ Lagway taking over full time.That optimism faded quickly. The Gators lost four of their first six games -- including to in-state rivals South Florida and Miami -- and were 3-4 when Napier was fired. Even after beating Mississippi State 23-21 to move to 2-2 in SEC play, the school decided to move on.\n                            \n    \n                                                \n                    \n    6. Charlie Weis, Notre DameBuyout: $18.9 millionNotre Dame fired Weis in 2009 after a 6-6 season. He went 35-27 overall, including a 10-win campaign in 2006.\nIronically, Notre Dame replaced Weis with Kelly, hiring him away from Cincinnati. After stints as an offensive coordinator with the Kansas City Chiefs and Florida, Weis became head coach at Kansas in 2012.\n                            \n    \n                                                \n                    \n    7. Willie Taggart, Florida StateBuyout: $18 millionTaggart's coaching career in the late 2010s was turbulent. He spent one season at Oregon in 2017 before leaving for Florida State, where he was fired after 21 games with a 9-12 record.FSU dismissed Taggart midseason in 2019 after a 4-5 start. The Seminoles also failed to reach a bowl game in his first year, going 5-7.\n\n                            \n    \n                                                \n                    \n    8. Ed Orgeron, LSUBuyout: $16.9 millionKelly isn't the only former LSU coach on this list. Orgeron led LSU to a national title in 2019 behind Heisman Trophy winner Joe Burrow but was fired less than two years later.Orgeron finished 51-20 at LSU, including back-to-back .500 seasons in 2020 and 2021. He hasn't coached since being let go nearly four years ago.\n                            \n    \n                                                \n                    \n    9. Tom Allen, IndianaBuyout: $15.5 millionSome programs regret paying large buyouts; Indiana probably doesn't. The Hoosiers fired Allen after going 33-49 overall, including 2023's 3-9 campaign.\nHis replacement, Curt Cignetti, has transformed the program. Indiana reached the CFP for the first time and is again in the hunt this season.\n                            \n    \n                                                \n                    \n    10. Tom Herman, TexasBuyout: $15.4 millionAfter spending four seasons with Texas, Herman was fired by the program after the 2020 campaign. Herman finished his tenure with a 32-18 record, which included a 10-win season in 2018.Herman was replaced by Steve Sarkisian, who helped return the program back to national title contender status. The Longhorns have reached the CFP in each of the last two seasons under Sarkisian -- something the program wasn't able to do under Herman.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football's 10 largest coach buyouts of all time: Where Brian Kelly ranks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/c3c537ef-a9b2-42fa-9d12-5eaebd1e6b68/thumbnail/1200x675/a06ea0180db9f3c7d329181fc0b619c7/untitled-design-69.png"
      ],
      "datePublished": "2025-10-27T02:07:13.000Z",
      "dateModified": "2025-10-27T02:07:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brian Kelly fired: LSU pays massive buyout despite winning record in 4th season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/brian-kelly-fired-lsu-football-coach-buyout-contract/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/89a40544-ffc5-49e3-84b6-1f7f65073a12/thumbnail/1200x675/b265b64a71cea3f7cb58338f3a53a566/briankellylsu.jpg",
    "tag": "Sports",
    "date": "2025-10-27T03:00:24.000Z",
    "description": "\n        LSU is firing fourth-year coach Brian Kelly, the school announced Sunday evening. The move comes after the Tigers failed to deliver on high e",
    "body": "\n        LSU is firing fourth-year coach Brian Kelly, the school announced Sunday evening. The move comes after the Tigers failed to deliver on high expectations in a disappointing 2025 season. The 64-year-old Kelly is in the midst of a 5-3 season in Baton Rouge. His buyout of $50-plus million will be the second most ever paid to a college football coach.   \"When Coach Kelly arrived at LSU four years ago, we had high hopes that he would lead us to multiple SEC and national championships during his time in Baton Rouge,\" LSU athletic director Scott Woodward said in a statement released by the school. \"Ultimately, the success at the level that LSU demands simply did not materialize, and I made the decision to make a change after last night's game. I am grateful for the ongoing consultations and support of the LSU Board of Supervisors and Interim President Matt Lee in this decision. We wish Coach Kelly and his family the very best in their future endeavors. We will continue to negotiate his separation and will work toward a path that is better for both parties.\"A contentious Sunday of meetings in Baton Rouge culminated in Kelly's exit. CBS Sports had previously reported that Kelly arrived at the football facility in the morning with the expectation making staff changes:Kelly, 64, arrived at the facility around 8:30-8:45 a.m. local time intent on evaluating his staff and, according to sources, exploring significant potential changes to the coaching staff. By early afternoon, though, after a meeting with Woodward that did not go well, according to sources, the conversation around Kelly's future began to change. Multiple staff members told CBS Sports that Kelly left the facility shortly thereafter.The day ends with Kelly's ousting. Running backs coach Frank Wilson will be the interim coach. A 15-day transfer portal window for LSU players will open five days after the Tigers hire their next coach. (the NCAA's single window for this cycle is Jan. 2-16). \nThe high-profile leadership change by Woodward, who made the splashy hire of Kelly in 2021, is the latest in what has already been a whirlwind of a coaching carousel cycle. LSU jumps toward the front of the line of programs seeking a home-run hire, along with Penn State, Florida, Virginia Tech and numerous others at the Power Four level. Woodward, by the way, is the same AD who hired Jimbo Fisher to Texas A&M -- setting the stage for Fisher to receive an all-time-rich $76.8 million buyout. Louisiana governor Jeff Landry was involved in the deliberations, sources told CBS Sports. Landry called out the football program after Saturday night's 49-25 loss to Texas A&M, tweeting that LSU needed to \"rethink their actions to raise ticket prices for next year after tonight's showing!\"Two of the highest-paid buyouts ever have occurred this month.  \n                                                                    CBS Sports Research\n                                                            With its sights set on reaching the College Football Playoff, LSU invested heavily in its roster through the transfer portal and loaded up on talent with the No. 1-ranked class in the cycle, per 247Sports. That recruiting push indicated LSU was all-in on competing for an SEC championship and its first CFP berth of the Kelly era. \nThe Tigers' defense improved significantly with the influx of instant-impact playmakers, but in a reversal from previous years, it was the offense that struggled to hold up its end of the bargain this season. LSU is averaging its fewest points per game since 2009 and its fewest yards per game since 2011. To fall short of lofty expectations, and to do so for a fourth time in as many years, was the final straw for Kelly to end his reign in Baton Rouge. The angst around the LSU program reached palpable levels with the Week 9 loss to No. 3 Texas A&M. Chants of \"Fire Kelly\" echoed throughout Tiger Stadium as LSU squandered a halftime lead and fell in blowout fashion to the Aggies in a 49-25 loss. LSU has a bye this weekend and then plays at rival Alabama. \nLSU's recruiting class for the 2026 cycle ranks No. 11 overall, per 247Sports. In 2025 the Bayou Bengals signed a No. 7 class that ranked higher before the decommitment from No. 1 recruit Bryce Underwood, who has started every game at QB for Michigan this fall. \nKelly's buyout ranks among the largest in college football. Programs have not been deterred by colossal buyouts in this hectic cycle, though, and LSU is the latest to eat a sizable chunk of money to make a change. The athletic department owes Kelly more than $52 million for parting ways with him during the season. The buyout calls for Kelly to receive 90% of the salary owed through the remainder of his contract, which measures $52,380,000 at season's end.   Most expensive buyouts in college football historyRankCoachSchoolBuyout1Jimbo FisherTexas A&M$76.8 million2Brian KellyLSU$53.8 million3James FranklinPenn State$49 million4Gus MalzahnAuburn$21.4 million5Billy NapierFlorida$21.2 million6Charlie WeisNotre Dame$18.9 million7Willie TaggartFlorida State$18 million8Ed OrgeronLSU$16.9 million9Tom AllenIndiana$15.5 million10Tom HermanTexas$15.4 millionBecause LSU fired Kelly in the middle of the campaign, it must also pay him 90% of the remaining $9.4 million salary owed for the 2025 season. Who's next at LSU?Any coaching search that Scott Woodward has his hands on should involve a slew of big-hitters. For better or worse, that's the type of hire he goes after. That's why names like Lane Kiffin and James Franklin are in the list of LSU's candidates, according to CBS Sports' Chris Hummer. Three major wild cards will draw attention, though.\nJimbo Fisher: I know suggesting Fisher here seems absurd. But remember it's Woodward who hired Fisher at Texas A&M and believed in him to such a degree he gave Fisher a historically lucrative contract to lure him from Florida State. Fisher's star has obviously dimmed. But Woodward actively pursued Fisher when he conducted LSU's search in 2021. Fisher has deep ties to LSU and is a national championship-winning coach. It's a marriage that makes a lot of sense if you can ignore Fisher's last two seasons in College Station.Dabo Swinney: Swinney is amid his worst season as Clemson's head coach since 2010. Could Woodward follow his Texas A&M playbook and lure a national champion to Baton Rouge? Swinney is a proven program builder and would seem to fit in at LSU culturally in a way Kelly never managed to. If Swinney wants a fresh start, you could pick much worse places than Baton Rouge to do so. But like Fisher, you must wonder if Swinney would be a sexy enough hire at this point in his career.Nick Saban: It was only earlier this week when Saban said, \"I want to stay retired.\" But if there was a non-Alabama job that could tempt Saban, it'd be LSU, the place he won his first national championship. Would he take the job if offered? Probably not. But Woodward's history tells you he'll at least ask.  Breakthrough season evades Brian Kelly LSU is a proud program with national championship expectations (its three prior coaches won one) and thus faced inherent risk when it hired Kelly ahead of the 2022 season. The longtime Notre Dame coach failed to get over the championship hump at his previous spot and only once reached the CFP. The same troubles followed him to LSU and were ultimately what spelled the end of his tenure. Never did the Tigers win more than nine regular-season games under Kelly's leadership. They generally hovered near SEC title contention but regularly fell just short, losing at least two conference games in each of Kelly's four years at the helm. Particularly frustrating for the Tiger faithful was to see the program fall short of championships despite a terrific run at the quarterback spot with Heisman Trophy-winner Jayden Daniels and future NFL Draft pick Garrett Nussmeier. LSU peaked at No. 3 in the AP Top 25 this season, reaching its highest ranking of the Kelly era. The Tigers climbed into the top 10 in each of his four years, indicating that they often came close to earning a playoff berth but had their hopes dashed by untimely losses. \n Brian Kelly faces crossroads in coaching career One of the biggest questions facing Kelly moving forward is whether he will seek a new job or hit the pause or stop buttons on his career. The 64-year-old may have his pick of multiple jobs given the widespread movement on the coaching carousel but could also emerge as a more attractive target in future cycles if he takes time off. If Kelly were to spend the 2026 season away from the sidelines, it would mark his first year without a head coaching job since 1990, before he made his debut. This is the first time in Kelly's career that he has been fired. He left each of his previous stops -- Grand Valley State, Central Michigan, Cincinnati and Notre Dame -- to accept offers elsewhere. Kelly went 34-14 at LSU and has a career mark of 297-109-2 spanning all of his five jobs. He won two Division II national championships at Grand Valley State and reached the BCS National Championship Game once during his Notre Dame tenure. \n2025 coaching carousel spinning at historic rateKelly is the 12th head coach fired this year and is the 10th in-season. The 10 coaches fired before November is the most in the FBS era (since 1978). Additionally, Kelly is the eighth power conference head coach fired this season. Only four of that variety were canned a year ago. The current number of eight -- and there's a ways to go -- is the most since 2022. LSU is top job available on coaching carouselPrior to Kelly, the three most recent LSU head coaches had all won national championships. That's why it has to top Florida for the best job on the market. As CBS Sports' Shehan Jeyarajah writes:\nThe program has recruited itself in the 21st Century thanks to its almost magical connection to the state of Louisiana, which ranks among the top talent-producing states in the country. Anything you can't find in the state, you can find a short jaunt away to Houston. Prior to Kelly, the last three coaches won national championships with the program. There are some mild questions about whether LSU is prepared to compete at the zenith of monetary investment across college football, but this is a job that doesn't just have championship upside -- they have championship expectations. 247Sports' Brandon Huffman likewise ranks LSU No. 1 among available jobs, saying \"even though the Sunshine State has more talent, LSU keeps whoever it wants home.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brian Kelly fired: LSU pays massive buyout despite winning record in 4th season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/89a40544-ffc5-49e3-84b6-1f7f65073a12/thumbnail/1200x675/b265b64a71cea3f7cb58338f3a53a566/briankellylsu.jpg"
      ],
      "datePublished": "2025-10-27T03:00:24.000Z",
      "dateModified": "2025-10-27T03:00:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]