[
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by targeting Ravens-Dolphins TNF, Marshall-CCU, Bucks-Warriors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-fanduel-promo-code-get-300-bonus-bets-ravens-dolphins-tnf-marshall-ccu-bucks-warriors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:26:28.000Z",
    "description": "\n        The latest FanDuel promo code offers new users $300 in bonus bets if their first wager of $5 or more wins. That offer provides sports bettors",
    "body": "\n        The latest FanDuel promo code offers new users $300 in bonus bets if their first wager of $5 or more wins. That offer provides sports bettors a great opportunity to target Ravens vs. Dolphins on Thursday Night Football, which kicks off at 8:15 p.m. ET. According to the latest NFL odds from FanDuel Sportsbook, the Ravens are favored by 7.5 points, while the over/under for total points scored is 50.5. There are also four NBA games on Thursday's sports schedule, including Warriors vs. Bucks at 8 p.m. ET, and two college football matchups. SportsLine's model is backing Milwaukee covering the spread as 2-point underdogs, and the model is also targeting the over on total points (55.5) on Marshall vs. Coastal Carolina in 54% of simulations. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Best Thursday picksRavens vs. Dolphins: Over 50.5 total points (-110)Marshall vs. Coastal Carolina: Over 55.5 total points (-110)Warriors vs. Bucks (+2.5) (-110)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +581 (risk $100 to win $581). Bet it at FanDuel here:\nRavens vs. Dolphins: Over 50.5 total points (-110)The Ravens are getting Lamar Jackson back, and he'll give this team a massive boost. Baltimore scored at least 38 points in three games this season with Jackson under center. They are averaging 24.9 points per game. The over has cleared in six of the seven games thus far. The Dolphins should also be able to build off their 31-point performance last week. Baltimore's defense is 28th in yards allowed (379.6) and 30th in points allowed (30). The over has cleared in six of the past seven games for Miami, and SportsLine's model expects that to continue, as the over hits in 69% of simulations. Bet the Ravens vs. Dolphins over at FanDuel Sportsbook:Marshall vs. Coastal Carolina: Over 55.5 total points (-110)Junior quarterback Carlos Del Rio-Wilson is a playmaker for Marshall. Del Rio-Wilson completed 74% of his throws for 1,133 passing yards, 347 rushing yards, and 16 total scores. Meanwhile, Coastal Carolina is coming off a season-best 45-point performance. This was their second game with 38-plus points this campaign. SportsLine's model is backing these teams to combine to 60 total points and has the over hitting in 55% of simulations. Bet the Marshall vs. Coastal Carolina over at FanDuel Sportsbook:Warriors vs. Bucks (+2.5) (-110)Milwaukee goes into this contest 4-0 ATS and 2-0 ATS as the home team. In their last outing, the Bucks beat the Knicks by 10 points on their home court. Forward Giannis Antetokounmpo consistently dominates, ranking second in the NBA in both points (36.3) and rebounds (14). SportsLine's model has Milwaukee covering the spread in 62% of simulations. Bet the Bucks to cover at FanDuel Sportsbook:\nWant more NBA picks?You've seen the model's best bets for Thursday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by targeting Ravens-Dolphins TNF, Marshall-CCU, Bucks-Warriors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-30T19:26:28.000Z",
      "dateModified": "2025-10-30T19:26:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why 'annoying' Ryan Rollins is huge X-factor for the Bucks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/ryan-rollins-bucks-stats-role-x-factor/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/711d1f67-b65b-4bb4-b8d8-8fd1b73cb141/thumbnail/1200x675/39a68b269518738d0eeaf4fbc55e8661/ryan-rollins-getty.png",
    "tag": "Sports",
    "date": "2025-10-30T20:01:18.000Z",
    "description": "\n        Late on Tuesday night, after he had led the Milwaukee Bucks to a 121-111 victory over the New York Knicks, and brushed off more questions abo",
    "body": "\n        Late on Tuesday night, after he had led the Milwaukee Bucks to a 121-111 victory over the New York Knicks, and brushed off more questions about trade rumors, Giannis Antetokounmpo said it was \"too early to give compliments\" about the team's new starting point guard, Ryan Rollins. Antetokounmpo then launched into a detailed explanation of Rollins' importance to the team, and the work he's put in to improve on both sides of the ball, which lasted nearly three minutes.\"He's been playing incredible,\" Antetokounmpo said. \"Defensively, he's one of the most annoying guards, probably, in the league. He's making the right reads. He's able to play with me, come off the bench, pretty much does everything. I love playing with him. He's been playing incredible with the team.\"Rollins was a second-round pick back in 2022, and has bounced around the league since then, in part due to his own off-court mistakes. (In Jan. 2024, Rollins was arrested and accused of shoplifting from Target. He later plead guilty to one count of petit larceny.) He appears to have found a home with the Bucks, however, and may be the answer to their backcourt questions.\nAfter Damian Lillard tore his Achilles in the playoffs, the team waived him and stretched his contract, which freed up the cap space to sign Myles Turner. While Turner's arrival helped shore up the Bucks' frontcourt, swapping an All-Star guard for a center left the Bucks' backcourt as thin as it has been since the team became a contender back in 2019. In the summer, general manager Jon Horst decided to take a by-committee approach and re-signed Rollins, Kevin Porter Jr. and Gary Trent Jr., signed Cole Anthony and gave AJ Green an extension. All are solid rotation players, but one of the big questions about the Bucks this season was whether any of them could take another step. The answer will not only help determine how far the team can go in the Eastern Conference, but whether Antetokounmpo sticks around beyond this season. The early signs suggest Rollins may be the one to make a leap. Porter rolled his ankle in the Bucks' season-opening win over the Washington Wizards, and hasn't played since. Rollins replaced him in the starting lineup, and it may be difficult to send him back to the bench once Porter is healthy. \nThrough four games, Rollins is averaging 15.3 points, 3.8 rebounds, 4.3 assists and three steals per game -- good for third in the league -- on 47.6/35/100 shooting splits. Against the Knicks, he poured in a career-high 25 points to go along with four assists and four steals to help the Bucks improve to 3-1. Thus far, the Bucks are 8.2 points per 100 possessions better with Rollins on the floor than when he sits. His on-off splits with Antetokounmpo are particularly interesting.The Bucks have been awesome with Antetokounmpo and Rollins on the floor together \n                                                                    PBPStats.com\n                                                            When Antetokounmpo called Rollins one of the \"most annoying guards\" in the league, he wasn't lying. Rollins is third in the league in steals per game (three) and fourth in deflections (5.5). He is willing and able to pick up opposing ball-handlers fullcourt, and if they aren't ready for that pressure, it's going to be a long night. Even when he isn't getting steals or deflections, his pressure disrupts what other teams are trying to do -- either by forcing them to run extra shot clock or have a secondary ball-handler bring up the ball.\nWatch this possession against the Knicks. He picks Brunson up 90 feet from the basket, makes him turn his back and give the ball up, presses Brunson when he gets the ball back, creates a deflection with high hands, stays attached to Brunson as he takes a tough pull-up, then jumps into the passing lane for a steal as the Knicks tried to save the offensive rebound. \nPerhaps it's no surprise that Rajon Rondo, who is working as a coaching associate with the Bucks on a part-time basis, has become a mentor for Rollins. \"Once I fouled out [in the preseason game] I knew my capabilities defensively,\" Rollins said Tuesday. \"I knew that I could stay in front of these guys and make it tough for them. So I'm not surprised at what I can do, it's just learning and being better at it.\"Here's 90 seconds of Rollins being annoying on defense:\nRollins can guard, and the Bucks want him to focus his efforts on that side of the ball. \"If I had my druthers, I'd want him to keep his defensive intensity, that's more important than anything,\" Bucks coach Doc Rivers said. But as long as Porter remains out -- and perhaps even beyond that point, depending on how the rest of the backcourt is performing -- the Bucks will need Rollins to contribute on both ends. \nRollins' pick-and-roll playmaking has been solid, but not spectacular. On his 53 pick-and-roll possessions, including shots and passes, the Bucks are scoring 1.132 points per possession, which ranks in the 76th percentile in the league, per Synergy Sports. He's shooting 35% from 3-point range, but was 3 of 16 in his first three games before going 4 of 4 against the Knicks. Rollins' 3-point shooting will be a key stat to watch. He shot 40.8% last season on 2.1 attempts per game, but did not have a meaningful amount attempts in the NBA before that. In his two years at Toledo in college, he shot 88 of 278 from behind the arc (31.7%). Playing alongside Antetokounmpo, there will be 3-point opportunities for Rollins. Antetokounmpo was only half-joking when he said it was \"too early to give compliments\" to Rollins. Consistency is major separator in the NBA. Can Rollins keep up this level of play over the course of a full season? If he can, the Bucks will be better than everyone expected prior to the season. \n\"I know my capabilities. I've been saying that for a while now. I just needed the opportunity and the platform to be able to go out there and play through mistakes and play my game,\" Rollins said. \"I feel like I'm doing that now. [But there's] a lot more to do, so [I have to] keep growing.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why 'annoying' Ryan Rollins is huge X-factor for the Bucks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/711d1f67-b65b-4bb4-b8d8-8fd1b73cb141/thumbnail/1200x675/39a68b269518738d0eeaf4fbc55e8661/ryan-rollins-getty.png"
      ],
      "datePublished": "2025-10-30T20:01:18.000Z",
      "dateModified": "2025-10-30T20:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thunder guard Nikola Topić diagnosed with testicular cancer, will undergo chemotherapy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/thunder-guard-nikola-topic-diagnosed-with-testicular-cancer-will-undergo-chemotherapy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/be71d4f2-66cc-47cf-a773-063d7727da68/thumbnail/1200x675/356407e06b47d21e9596e6affbbb0218/nikola-topic.jpg",
    "tag": "Sports",
    "date": "2025-10-30T18:29:10.000Z",
    "description": "\n        Oklahoma City Thunder guard Nikola Topić has been diagnosed with testicular cancer. Thunder general manager Sam Presti shared the news with r",
    "body": "\n        Oklahoma City Thunder guard Nikola Topić has been diagnosed with testicular cancer. Thunder general manager Sam Presti shared the news with reporters on Thursday, giving an update to what was first announced as a testicular procedure on Oct. 6, which was expected to keep him sidelined for at least 4-6 weeks.\"He had a testicular procedure at the very beginning of training camp, that procedure was necessary to determine if Nikola was dealing with a case of testicular cancer,\" Presti said. \"The procedure was necessary in order to biopsy. The results of the biopsy have been returned, and he is dealing with a case of testicular cancer. ... They are extremely positive about his outlook in dealing with the situation ... the treatment option for him right now being recommended by the oncologist is chemotherapy.\"Certainly this goes beyond basketball and the focus now becomes about Topić's general health. Presti shared that Topić didn't want to make this information public until he began treatment, which he now has. While undergoing chemotherapy, Presti said Topić has managed to continue training at the Thunder's practice facility.\n\"He's been in here, he's training, he's working out through this entire process,\" Presti said. \"He's been able to do that, but as we all know, this will be a challenging treatment process to go through.\"Topić was selected with the 12th overall pick in the 2024 NBA Draft by the Thunder. Just months after being a lottery pick, he tore his ACL, forcing him to miss the entirety of the 2024-25 season. He showed great promise this past summer in Summer League, averaging 11 points and 7.3 assists and again showed flashes in his lone preseason performance where he posted 10 points, seven assists and four rebounds.\n\"As far as our expectations for him or anything like that, our only expectation for him is to focus on this,\" Presti said. \"This is his most important priority. He'll be back playing basketball when he's able to, but we're not putting any type of expectations on him. He has our total support, encouragement, love. Guys on the team have been amazing. [Topić] is a really remarkable guy ... He has all the tools that you could ask for somebody to take on and conquer this situation, and we just want to make sure we're addressing it as we can, but also call on everybody to recognize that it's a private matter.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thunder guard Nikola Topić diagnosed with testicular cancer, will undergo chemotherapy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/be71d4f2-66cc-47cf-a773-063d7727da68/thumbnail/1200x675/356407e06b47d21e9596e6affbbb0218/nikola-topic.jpg"
      ],
      "datePublished": "2025-10-30T18:29:10.000Z",
      "dateModified": "2025-10-30T18:29:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana vs. Maryland prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-maryland-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/450d077f-cb28-4b60-9a33-61f083496290/thumbnail/1200x675/c5055d94fb6407c7b3ef7ec6140e0c16/adobe-express-file-63.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:29:28.000Z",
    "description": "\n        No. 2 Indiana looks to keep rolling as it puts its undefeated record on the line Saturday at Maryland. This will be the 14th all-time meeting",
    "body": "\n        No. 2 Indiana looks to keep rolling as it puts its undefeated record on the line Saturday at Maryland. This will be the 14th all-time meeting between the Big Ten foes, with the Hoosiers holding an 8-5 edge in previous matchups.Indiana won 42-28 last season on its way to the College Football Playoff. A victory Saturday would give the Hoosiers a 9-0 start for the second consecutive season under coach Curt Cignetti. Indiana had never started 9-0 in program history before Cignetti arrived ahead of the 2024 season.Cignetti's squad has cruised thus far, including marquee wins over Illinois and No. 6 Oregon, both by at least two possessions. Indiana has won seven of its eight games by double-digit margins.Maryland, meanwhile, is trying to prevent another collapse under coach Mike Locksley. The Terrapins opened the year 4-0, capped by a win against Wisconsin to start Big Ten play, but have since dropped three straight conference games.\nMaryland has never finished with a winning Big Ten record under Locksley. A fourth loss Saturday would make avoiding that outcome extremely difficult.Indiana vs. Maryland: Need to knowA look at Indiana's dominance: Indiana's dominance is approaching historically significant territory. The Hoosiers have a plus-34.5 point differential in 2025 which means that, on average, they are outscoring their opponents by almost five touchdowns and extra points. That leads the FBS. Indiana also led the nation in point differential last season. Georgia also led the nation in point differential from 2021-22, when it won back-to-back national championships. The Bulldogs are the only program in the last 30 years to achieve such a feat. Indiana has a chance to join them. Another Heisman performance for Mendoza?: Indiana quarterback Fernando Mendoza currently has the best odds to win the Heisman Trophy at +185, according to FanDuel Sportsbook. He ranks fifth nationally with 1,923 yards passing and leads all quarterbacks with 27 total touchdowns, 24 of which have come through the air. Though Indiana has not had to play from behind much -- if at all -- he's eclipsed 200 yards passing in all but two games thus far. He'll have a chance to put up some solid numbers against Maryland's pass defense, which ranks 11th in the Big Ten while allowing 227 yards per game.     \nCan Maryland snap the streak?: Maryland has struggled against ranked conference opponents. In fact, the Terrapins have never beat a top-25 Big Ten opponent in league play. You have to go all the way back to 2010, when they were a member of the ACC, to find their last win against a ranked conference foe. That came against Russell Wilson's NC State. Since then, Maryland has lost 42-straight games in that scenario. It's the longest active FBS streak and the fifth-longest such streak all-time.   How to watch Indiana vs. Maryland live  Date: Saturday, Nov. 1 | Time: 3:30 p.m. ET  Location: SECU Stadium -- College Park, MarylandTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ Premium  Indiana vs. Maryland prediction, picks  \nMaryland has kept things close in its last three games, but that doesn't change the fact that said games still resulted in a loss. Maryland's last loss came against UCLA -- the same UCLA team that Indiana just beat 56-6. Results often are not directly translatable in a sport as chaotic as college football, but they certainly can be indicative of what to expect. In this case, it's hard to see Maryland hanging with the scorching-hot Hoosiers. Pick: Indiana -21.5 (-115)\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            IU -22.5\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Maryland\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Maryland\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Maryland\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Maryland\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    Who will win and cover in each Week 10 college football game? Legendary Vegas expert Bruce Marshall is on a 21-7 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana vs. Maryland prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/450d077f-cb28-4b60-9a33-61f083496290/thumbnail/1200x675/c5055d94fb6407c7b3ef7ec6140e0c16/adobe-express-file-63.jpg"
      ],
      "datePublished": "2025-10-30T19:29:28.000Z",
      "dateModified": "2025-10-30T19:29:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Georgia vs. Florida prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/georgia-florida-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/bb52eb6e-ee4b-4082-9bfb-d173c8bd3228/thumbnail/1200x675/338297cc23a83c0e8d8d2b8549b3133e/nate-frazier.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:21:46.000Z",
    "description": "\n        No. 5 Georgia plays Florida in their annual rivalry game in Jacksonville on Saturday. The Bulldogs are winners of three straight, including a",
    "body": "\n        No. 5 Georgia plays Florida in their annual rivalry game in Jacksonville on Saturday. The Bulldogs are winners of three straight, including a 43-35 upset win over No. 5 Ole Miss. Quarterback Gunner Stockton has emerged as a dynamic playmaker, completing 70.5% of his passes with 17 total touchdowns to only one interception.Florida fired coach Billy Napier after its 23-21 win over Mississippi State, only the second FBS win of the season for the Gators. Wide receivers coach Billy Gonzalez is serving as interim coach, with quarterbacks coach Ryan O'Hara promoted to playcaller to replace Napier. The Gators have not won an FBS game away from Gainesville. Georgia has won four straight matchups against Florida, and seven of the last eight under coach Kirby Smart. Last year, Georgia won 34-20 after knocking quarterback DJ Lagway out of the game.   Georgia vs. Florida: Need to know  Return of the run game: Georgia's rushing offense has quietly regressed over the past few years, dropping all the way to No. 102 and 4.06 yards per carry in 2024. Through seven games, the unit is back with a vengeance. Georgia averages more than 190 yards of rushing per game, which is top 40 nationally. The Bulldogs also rank No. 7 in Expected Points Added per Rush. Florida's defense is strong, but Georgia is starting to get back to bullying people in the trenches. Rising wide receivers: Florida's resurgence under Napier -- however brief -- was spearheaded by the emergence of a pair of true freshmen. Dallas Wilson and Vernell Brown III have exploded over the past three games since Wilson returned to the lineup. The duo have combined for 25 catches for 399 yards over the past three games, including three touchdown grabs. If the players were healthy early in the year, perhaps Florida would have still been alive. \nBest on worst: Georgia has been defined by its defense under Smart, but the unit has been somewhat middling in 2025. Specifically, the Bulldogs rank No. 71 nationally in passing defense, giving up more than 222 yards per game. Florida quarterback DJ Lagway is one of the most talented players in the country when healthy, and was able to cause real problems for a similarly talented Texas secondary. If he can continue some of his strong improvement the past three weeks, Florida has a chance.   Where to watch Georgia vs. Florida live  Date: Saturday, Nov. 1 | Time: 3:30 p.m. ET  Location: Everbank Stadium -- Jacksonville, Florida  TV: ABC | Live stream: Fubo (Try for free)  Georgia vs. Florida prediction, picks  \nFlorida will come out juiced against their rival, especially with Billy Gonzalez leading the program. The Gators will take big swings and maybe even build a lead in Jacksonville. However, Georgia is too patient and has too many avenues to win this game for it to last. The Bulldogs will lean on their physical running game and pull away late. The line will be touch-and-go into the fourth quarter, but the Bulldogs can pull away late. Pick: Georgia +7.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            UGA -7.5\n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    Who will win and cover in each Week 10 college football game? Legendary Vegas expert Bruce Marshall is on a 21-7 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Georgia vs. Florida prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/bb52eb6e-ee4b-4082-9bfb-d173c8bd3228/thumbnail/1200x675/338297cc23a83c0e8d8d2b8549b3133e/nate-frazier.jpg"
      ],
      "datePublished": "2025-10-30T19:21:46.000Z",
      "dateModified": "2025-10-30T19:21:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Did Penn State fire James Franklin too soon? Matt Rhule's extension complicates search - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-firing-james-franklin-matt-rhules-extension-complicates-coach-search/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/36d494eb-65a0-465d-8cf8-4396a6af833b/thumbnail/1200x675/007b5640c1951eeedc227c4787684907/james-franklin-psu-1.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:10:17.000Z",
    "description": "\n        Penn State cast the first major stone of the college football season when it fired James Franklin only six weeks into a highly anticipated ca",
    "body": "\n        Penn State cast the first major stone of the college football season when it fired James Franklin only six weeks into a highly anticipated campaign. The Nittany Lions decided that Franklin reached his ceiling with the program, and it was time to look for a new voice -- less than halfway through the season. After two other Big Ten coaches signed extensions to rebuff Penn State's interest, the emotional decision to fire midseason suddenly looks like a gaffe. Indiana coach Curt Cignetti, a Pennsylvania native, quickly signed a contract extension that will likely keep him in Bloomington for the rest of his career. On Thursday, projected top candidate Matt Rhule did the same at Nebraska, keeping him in Lincoln through 2032. And suddenly, for a program that hoped to impose its will on the coaching market, the top candidates are gone. There are potential options on the way up, but few that will move the needle nationally. In the shadow of LSU and Florida swinging for sitting Big Ten and SEC coaches, Penn State seems to have already -- and very publicly -- struck out. \nGranted, moving on from Franklin is a defensible decision on its own. He was in the midst of his 12th season, but holds a 2-21 record against AP top-six opponents, the second-worst mark in FBS history among coaches with at least 20 matchups. Penn State was tired of never breaking through, and it's worth seeing if someone else can turn the tide. And furthermore, the nearly $50 million buyout actually isn't as onerous as it sounds. The contract is believed to be subject to offset language, which means that Penn State could ultimately pay a much smaller amount if he takes another job. The finances could become negligible. But after getting publicly turned down by the two most obvious candidates on the board, the risk is greater than just replacing a coach. By making a change nearly three months before the coaching carousel got into motion, it opened the door for expectations to rise through the roof. \nFranklin was 104-45 at Penn State, including a 2016 Big Ten title. He won 34 games in his final three full seasons with two AP Top 10 finishes. There are few coaches on the market that are clearly positioned to replicate that. Frankly, Florida and LSU are finding themselves in somewhat of the same position, especially if Lane Kiffin decides to stay at Ole Miss. Letting Franklin finish out the season would have both stabilized the roster, and continued recruiting momentum. Since his firing, at least 10 Class of 2026 recruits have decommitted. There won't be a recruiting class to maintain when the next coach arrives. At the end of the year, Penn State could have still made a measured decision to fire Franklin. And furthermore, with the writing on the wall, the university could have encouraged Franklin to search for other opportunities. Virginia Tech, Arkansas and Florida would have happily engaged -- and still might. \nWhile the dynamics of college basketball are different, think back to the John Calipari situation at Kentucky. The program was frustrated with him, and both sides were ready to move on. Arkansas got to sell poaching one of the greatest coaches of the 21st Century. Kentucky got to move on, but went through a normal coaching cycle instead of a prolonged one. After striking out on their top choices, Mark Pope was a reasonable -- if not spectacular -- addition. In year one, he made the Sweet 16. Everyone won in a way that feels more complicated for Penn State now. There are still a few big names left on the board. Texas A&M coach Mike Elko has ties to the Northeast; he also probably has a better job right now, and certainly won't leave before the College Football Playoff. Vanderbilt coach Clark Lea is a rising star and Penn State would be a step up, but he's also coaching at his alma mater. Ditto for Louisville's Jeff Brohm. Missouri's Eli Drinkwitz has been a popular name across the coaching landscape, but he could easily decide to stay in the SEC, or at Mizzou. Will fans applaud taking Duke coach Manny Diaz? Ohio State offensive coordinator Brian Hartline? Dipping into the NFL for Bills offensive coordinator Joe Brady, who has one total year of experience as an on-field FBS assistant coach? \nOr, will Penn State athletic director Pat Kraft tune out the noise and try to make an unorthodox hire? Could coordinators get into the mix, or rising non-power stars like James Madison's Bob Chesney? There are plenty of good coaches, but half the job is selling them to the community, and the donors. Penn State is one of the most unique jobs in the country. It was defined for nearly 50 years by Joe Paterno, one of the greatest coaches in history. After Bill O'Brien stabilized the program, Franklin lasted a dozen years. This job hasn't been on the market in normal circumstances since 1966 -- and even Paterno was an internal promotion. The program tried to send a message by firing Franklin midseason, setting the expectation that the next coach would expect to compete for championships. But after Rhule and Cignetti decided to stay put, that extra runway could prove a liability for a fanbase growing impatient for results. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Did Penn State fire James Franklin too soon? Matt Rhule's extension complicates search - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/36d494eb-65a0-465d-8cf8-4396a6af833b/thumbnail/1200x675/007b5640c1951eeedc227c4787684907/james-franklin-psu-1.jpg"
      ],
      "datePublished": "2025-10-30T19:10:17.000Z",
      "dateModified": "2025-10-30T19:10:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Army vs. Air Force prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/army-air-force-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/412df7f0-492b-4230-8a76-483a0e1c7b52/thumbnail/1200x675/b5ad1f08307f5f993cc842b6ab807c9d/air-force-army-football.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:20:12.000Z",
    "description": "\n        Army (3-4) has a chance to eliminate Air Force (2-5) from contention in the 2025 Commander-in-Chief's Trophy race when it travels to Falcon S",
    "body": "\n        Army (3-4) has a chance to eliminate Air Force (2-5) from contention in the 2025 Commander-in-Chief's Trophy race when it travels to Falcon Stadium on Saturday for a key matchup in one of college football's most storied rivalries. The game kicks off at noon ET on CBS.The Black Knights have controlled the series lately, winning six of the past eight meetings, though this will be their first trip to Colorado Springs since 2019.Army enters with a continued emphasis on its ground attack, led by quarterback Cale Hellums, who has rushed for 10 touchdowns this season -- tied for fourth-most among FBS quarterbacks. Defensively, the Black Knights have dominated the Falcons in recent years, allowing just one touchdown across the past three meetings while forcing 10 turnovers in that span.Air Force counters with sophomore dual-threat quarterback Liam Szarka, who has rushed for 725 yards and nine touchdowns while throwing for more than 1,000 yards this season, emerging as one of the nation's most versatile offensive weapons.\n   Army vs. Air Force: Need to know   Rushing showdown: Army and Air Force rank among the FBS's top four rushing offenses in yards per game. The Black Knights average 275.6 yards per contest, while the Falcons are slightly ahead at 283.7. What stands out, though, is the difference in efficiency against FBS opponents: Air Force (55.4%) ranks third nationally, while Army (49.5%) is tied for 26th.Field general: Army linebacker Andon Thomas leads the defense with 59 total tackles this season. One of the most experienced Black Knights on that side of the ball, the 6-foot, 230-pound senior has 20 starts since the beginning of last season. His presence will be key in slowing Air Force's attack, which has averaged 6.2 yards per carry over its last two games.Historical context: Army has struggled historically in Colorado Springs, winning just four times at Falcon Stadium, most recently in 2017. Air Force leads the all-time series, 38-20-1. This will be Army's first visit to Falcon Stadium since 2019, making it a significant test for the Black Knights as they look to maintain recent success in the series and gain an edge in the Commander-in-Chief's Trophy race.\n   Where to watch Army vs. Air Force live   Date: Saturday, Nov. 1 | Time: 12 p.m. ET   Location: Falcon Stadium -- Colorado Springs, ColoradoTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ Premium   Army vs. Air Force prediction, picks   \nThere isn't an obvious trend to follow, with neither Army nor Air Force being particularly consistent against the spread this season while being on opposite sides of the over/under trends when it comes to totals. But the Falcons showed signs of life recently, finally prevailing for a win against Wyoming in Week 8 to snap a five-game losing skid, which included back-to-back defeats by a field goal. Momentum and historical home-field advantage gives Air Force the slight edge here. Pick: Air Force SUWho will win and cover in each Week 10 college football game? Legendary Vegas expert Bruce Marshall is on a 21-7 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Army vs. Air Force prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/412df7f0-492b-4230-8a76-483a0e1c7b52/thumbnail/1200x675/b5ad1f08307f5f993cc842b6ab807c9d/air-force-army-football.jpg"
      ],
      "datePublished": "2025-10-30T19:20:12.000Z",
      "dateModified": "2025-10-30T19:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens vs. Dolphins odds, prediction, best bets: 'Thursday Night Football' picks by expert on 29-14 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-ravens-dolphins-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/5e023d38-07a9-49af-8234-b56135d5f921/thumbnail/1200x675/7b264e86401c22d96afe99ebcffb836a/derrick-henry-baltimore-ravens.jpg",
    "tag": "Sports",
    "date": "2025-10-30T18:15:27.000Z",
    "description": "\n        Teams looking to salvage their seasons clash on 'Thursday Night Football,' when the Baltimore Ravens battle the Miami Dolphins. Baltimore is ",
    "body": "\n        Teams looking to salvage their seasons clash on 'Thursday Night Football,' when the Baltimore Ravens battle the Miami Dolphins. Baltimore is coming off a 30-16 win over the Chicago Bears on Sunday, while Miami rolled to a 34-10 win at Atlanta. The Ravens (2-5), third in the AFC North, are 0-2 on the road this season. The Dolphins (2-6), third in the AFC East, are 1-2 on their home field in 2025. Baltimore quarterback Lamar Jackson (hamstring) has been a full participant at practice this week and is expected to return after missing the past three games. Tua Tagovailoa (thumb) will also suit up despite being listed on the injury report.Kickoff from Hard Rock Stadium in Miami Gardens, Fla., is set for 8:15 p.m. ET. The Ravens lead the all-time series 11-8, including wins in nine of the past 12 meetings. Baltimore is a 7.5-point favorite in the latest Ravens vs. Dolphins odds from SportsLine consensus, while the over/under for total points scored is 51.5. Baltimore is at -448 on the money line (risk $448 to win $100), with Miami at +345 (risk $100 to win $345). Before you make any Dolphins vs. Ravens picks, be sure to see what SportsLine expert Mike Tierney has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. He is 235-189-13 in his NFL picks the past three seasons, returning $2,505 to $100 players. He hit 61.2% of his ATS picks (61-39-3) last season. Tierney is also 29-14-1 (+1327) on his last 44 picks in Baltimore Ravens games. Anyone following could've seen huge returns. Now, Tierney has set his sights on Ravens vs. Dolphins and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Dolphins vs. Ravens:Ravens vs. Dolphins                 spreadBaltimore -7.5 at DraftKings SportsbookRavens vs. Dolphins                   over/under51.5 pointsRavens vs. Dolphins                   money line Baltimore -448, Miami +345Ravens vs. Dolphins                   picksSee picks at SportsLineRavens vs. Dolphins                   streaming Amazon Prime   Why the Ravens can coverAmong Baltimore's top offensive weapons is running back Derrick Henry. The 10-year veteran has played in seven games this year. He has carried 109 times for 510 yards (4.7 average) and six touchdowns. He has rushed for more than 100 yards in two games, including 122 yards on 24 carries in a 17-3 loss to the Los Angeles Rams on Oct. 12. He is coming off a 21-carry, 71-yard and two-touchdown effort in Sunday's win over the Bears.Third-year veteran wide receiver Zay Flowers leads the Ravens in receptions with 41 for 486 yards and one touchdown. In a 41-40 season-opening loss at Buffalo, he caught seven passes for 143 yards and one touchdown. He had seven catches for 63 yards in Sunday's win over Chicago. In three seasons, he has played in 40 games, making 192 receptions for 2,403 yards and 10 touchdowns. See which team to back at SportsLine. Why the Dolphins can coverSixth-year veteran quarterback Tua Tagovailoa leads the Miami offense. In eight starts, he has completed 159 of 231 passes (68.8%) for 1,518 yards and 15 touchdowns with 10 interceptions for a 90.4 rating. In Sunday's win at Atlanta, he completed 20 of 26 passes (76.9%) for 205 yards and four touchdowns. In a 27-24 loss at Carolina on Oct. 5, he completed 27 of 36 passes for 256 yards and three touchdowns.His top target is wide receiver Jaylen Waddle. In eight games, he has 35 receptions for 504 yards (14.4 average) and four touchdowns. In Sunday's win over the Falcons, he caught five passes for 99 yards and one touchdown. In the loss to Carolina, he had six receptions for 110 yards and a score. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Ravens vs. Dolphins  picksTierney has analyzed Ravens vs. Dolphins from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Dolphins vs. Ravens, and what critical X-factor makes one side of the spread a must-back?. You can head to SportsLine to see his Ravens vs. Dolphins picks. Visit SportsLine now to see which side you need to jump on, all from the expert that is 29-14-1 on his last 44 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens vs. Dolphins odds, prediction, best bets: 'Thursday Night Football' picks by expert on 29-14 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/5e023d38-07a9-49af-8234-b56135d5f921/thumbnail/1200x675/7b264e86401c22d96afe99ebcffb836a/derrick-henry-baltimore-ravens.jpg"
      ],
      "datePublished": "2025-10-30T18:15:27.000Z",
      "dateModified": "2025-10-30T18:15:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Washington State vs. Oregon State prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/washington-state-oregon-state-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/1d3cf161-6e02-488b-9bb2-30c564715b54/thumbnail/1200x675/c1d2b85a2fa668863915d07c24478e7a/gettyimages-2186571209-1.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:15:43.000Z",
    "description": "\n        The two active members of the Pac-12 square off for the first of two regular-season matchups Saturday in Corvallis, Oregon. Familiar foes in ",
    "body": "\n        The two active members of the Pac-12 square off for the first of two regular-season matchups Saturday in Corvallis, Oregon. Familiar foes in Washington State and Oregon State will become even closer in the coming weeks as they conduct a home-and-home for conference supremacy, and the opening leg is set for 7:30 p.m. ET on CBS.The Cougars (4-4) hit the road for the fourth time in five games and seek to move closer to bowl eligibility in Year 1 under coach Jimmy Rogers. The Beavers (1-7), in contrast, are in the midst of a three-game home stand and seek to build momentum on the heels of their first win of the season. Interim coach Robb Akey, who took over after Oregon State fired Trent Bray, led them to a 45-13 win over FCS Lafayette prior to their bye week.Returners from last year's Washington State squad will also likely have vengeance on their minds after the Pacific Northwest rivals delivered a classic in their 2024 matchup. The Cougars fell short in a 41-38 shootout last year as they watched the Beavers win the quasi-Pac-12 championship game in thrilling fashion. They are unquestionably the stronger team this time around, but that was also the case last November.   Washington State vs. Oregon State: Need to know   Let's play two: It's not unprecedented for two teams to face each other twice in a regular season, but it's far from common. New Mexico State was the last program to do so, playing Hawaii twice in 2021 to fill out an independent schedule. Washington State and Oregon State found themselves in similar situations after the mass exodus from the Pac-12 and the expiration of their 2024 scheduling agreement with the Mountain West, forcing them to piece together slates full of nontraditional matchups. The Cougars will host the Beavers on Nov. 29 to close out the regular season, marking their second meeting in a month for the longtime conference companions.\nPlaying up: One hallmark of these teams' unconventional schedules is a string of road matchups against ranked Power Four opponents. Washington State handled those challenges better than Oregon State, nearly pulling off upsets of No. 7 Ole Miss and No. 15 Virginia. The Cougars lost those games on Oct. 11 and Oct. 18 by a combined five points, with their defense leading the way in limiting both opponents to 24 points or fewer.Johnson provides a spark: Oregon State remains a program in flux -- including at quarterback. Maalik Murphy started the first eight games before giving way to backup Gabarri Johnson midway through the most recent contest. A more mobile threat who had previously appeared in rushing packages, Johnson excelled in the 45-13 win over Lafayette in his biggest role of the season. He completed seven of nine passes, ran for 82 yards and totaled two touchdowns to jolt a struggling offense.Defense stiffens: Washington State's defense was gashed for 59 points by both North Texas on Sept. 13 and Washington the following week in the Apple Cup. Since then, the Cougars have looked like a far more disciplined unit. None of their four opponents since that stretch have scored more than three touchdowns. Linebacker Parker McKenna has been central to that turnaround as the team's leading tackler, while edge rusher Isaac Terrell -- who missed last week with an injury -- posted two sacks and four tackles for loss against Ole Miss.\nHand it to Hankerson: Anthony Hankerson entered the season as one of college football's top running backs but struggled to replicate his 2024 success during Oregon State's 0-7 start. That changed dramatically last week. The second-year Beaver set career highs with 204 rushing yards and four touchdowns as Oregon State shredded Lafayette's defense, particularly in the second half.Where to watch Washington State vs. Oregon State liveDate: Saturday, November 1 | Time: 7:30 p.m. ETLocation: Reser Stadium -- Corvallis, OregonTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ Premium   Washington State vs. Oregon State prediction, picks   \nOregon State played its best football of the season last time out, but don't be fooled by the 45-13 victory. Beating up on an FCS opponent is no sure sign of a turnaround, especially given that it took until the second half to pull away. Washington State is the better offensive team in this matchup, its defense seems to have turned a corner and it will have the special teams advantage against one of the worst teams in the country in that regard. The Cougars are better in all three phases than a team simply looking to get across the finish line with its interim staff. Pick: Washington State -3.5\nWho will win and cover in each Week 10 college football game? Legendary Vegas expert Bruce Marshall is on a 21-7 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Washington State vs. Oregon State prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/1d3cf161-6e02-488b-9bb2-30c564715b54/thumbnail/1200x675/c1d2b85a2fa668863915d07c24478e7a/gettyimages-2186571209-1.jpg"
      ],
      "datePublished": "2025-10-30T19:15:43.000Z",
      "dateModified": "2025-10-30T19:15:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dodgers' offensive woes can only be solved by struggling stars figuring it out - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/how-the-dodgers-offense-has-failed-them-in-the-world-series-and-why-potential-lineup-changes-are-limited/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/8928cfac-2c4b-416b-ad96-8ed94294be38/thumbnail/1200x675/83250aec8d6f059893014603eae61548/freddie-freeman-strikes-out-getty.png",
    "tag": "Sports",
    "date": "2025-10-30T18:40:50.000Z",
    "description": "\n        The Los Angeles Dodgers lost to the Toronto Blue Jays on Wednesday night in Game 5 of the 2025 World Seres. The Dodgers, who are hoping to be",
    "body": "\n        The Los Angeles Dodgers lost to the Toronto Blue Jays on Wednesday night in Game 5 of the 2025 World Seres. The Dodgers, who are hoping to become MLB's first repeat champion since the 1998-2000 New York Yankees, are now in a 3-2 hole in the best-of-seven series. Historically, MLB teams to find themselves in that spot have then lost the series around 70% of the time. In other words, the Dodgers are facing some long odds as the series shifts back to Toronto for Game 6 (and potentially Game 7).If the Dodgers end up falling short in their bid to repeat, they'll have an unexpected culprit to blame: their offense. Everyone knew the Dodgers bullpen, which tied for the second most meltdowns during the regular season, was a weakness entering the World Series. But no one anticipated that the Dodgers offense, led by stars like Shohei Ohtani and Mookie Betts, would serve as one, too.After all, these Dodgers led the National League in runs scored and finished second in the majors in park-adjusted offense during the regular season. Yet through five World Series games, the Dodgers have mustered a .651 team-wide OPS and 18 runs in five games. To think: that 3.60 runs per game rate is more kind than the reality of the situation; factor in Game 3's marathon length, and the Dodgers are actually averaging about three runs per nine innings thus far in the World Series. No wonder they trail.Dodgers offenseR/GOPSHR%K%Regular season5.09.7683.9%21.9%Playoffs overall4.27.7283.4%24.3%World Series3.60.6513.7%25.3%\"It doesn't feel great. You clearly see those guys finding ways to get hits, move the baseball forward, and we're not doing a good job of it,\" manager Dave Roberts said after Game 5. \"We've got to make some adjustments. We have seen [Game 6 starter Kevin Gausman] a ton, a lot of our guys have seen him, so we just got to continue to -- I just think we just got to come in fresh, and we've been -- again, like I said, we've been in elimination games, a core group of these guys, and we got to find a way to win a game. That's it.\"Just what's hampering Los Angeles' star-studded nine? Scroll with us as we check in on some slumping key contributors and ponder if there are any changes they could make ahead of Game 6.1. Ohtani's contributions have been great, but concentrated There's no denying that Ohtani's statistics for the World Series are phenomenal. In the first five games, he's batted .316/.500/.895 with three home runs, five runs batted in, and more walks than strikeouts. The catch is that most of the damage was concentrated within Game 3 and Game 3 alone.Ohtani splitHXBHRBI+ROPSOverall65101.395Without Game 3214.569For those wth short memories: Ohtani notched four extra-base hits (including two home runs) and reached base a record nine times as part of the Dodgers win. It's hard to rail too hard against someone who authored arguably the most impressive offensive performance in World Series history, but the numbers bear out that Ohtani has otherwise had a limited impact on this set:You may recall earlier in the postseason how the Philadelphia Phillies and Milwaukee Brewers gameplanned to have Ohtani face as many lefty sinkerballers as they could. Not so here. Through five games, the only pitchers he's faced more than twice are Blue Jays starters Trey Yesavage, Kevin Gausman, Shane Bieber and reliever Eric Lauer, who was tasked with bulk work in Game 3. The Blue Jays' approach seems more focused on limiting Ohtani's exposure to fastballs. So far this series, he's a fastball less than every three pitches. Sliders, curveballs, and sweepers, conversely, account for roughly 40% of his pitches faced.2. Betts, Freeman, Smith underperformingThe Blue Jays haven't let Ohtani beat them outside of Game 3. They haven't let the Dodgers' other stars do it, either. Shortstop Mookie Betts, first baseman Freddie Freeman, and catcher Will Smith have combined for a .704 OPS this postseason and a .633 mark in the World Series. Those numbers are well beneath their .824 regular season showing -- to think, that's with Betts having a relatively down year.SplitRegular season OPSPostseason OPSMookie Betts.732.648Freddie Freeman.869.781Will Smith.901.684All three.824.704Freeman and Smith, for their parts, have been tagging the ball. They've each hammered more than 43% of their batted balls for exit velocities of 95 mph or higher. Those two have combined for four outs on balls that had an expected batting average of around .300 or better, suggesting they've been the victims of some bad luck. It happens, especially in small samples against good defensive clubs.Betts can't take similar solace. He's put 18 balls into play during the World Series, and 11 of them have had launch angles either above 40 degrees or below minus-10 degrees. In other words, when Betts is connecting he's either skying the ball straight up or drilling into directly into the dirt. Neither of those trajectories tend to result in hits or positive outcomes. It's clear that he's off, either with his mechanics or with his mindset, something Roberts seemed to confirm.\"I think he's pressing,\" Roberts said after Game 5. \"Hopefully, the off day, find a way to get away from it, and then go out there and just kind of focus on one game and be good for one game, go out there and compete. But I think you can see, you know, there's a little anxiousness in there.\"\n        \n            \n                'I've just been terrible': Inside Mookie Betts' shocking struggles that have stalled the Dodgers' offense\n                \n                    Julian McWilliams                \n            \n                            \n    \n                \n                    \n    \n3. Lineup changes possible, if limitedYou may wonder if the Dodgers should try mixing up their lineup, in terms of personnel or arrangement. It's something that Roberts conceded he may contemplating heading into Game 6.\"It's kind of whatever I feel is best to take down Gausman,\" Roberts said after Game 5. \"So I'm not sure if it's Mookie in the 2, Mookie in the 3, Freddie in the 3. I'm not sure. But at the end of the day, regardless of who we run out there or what construct, we still got to take good at-bats, all of us. And so that's what I'm betting on.\"Realistically, Roberts has only so many dials to turn and levers to pull.Only five Dodgers have an OPS above .750 this postseason, and two of those are backup catcher Ben Rortvedt and outfielder Alex Call. Rortvedt is, obviously, not going to get the nod ahead of Smith, leaving him with no pathway into the lineup. Call received a start in Game 5, going hitless with a walk. The other three players are Ohtani, Freeman, and Teoscar Hernández -- three of Los Angeles' top five hitters on any given night, alongside Betts and Smith. Roberts already moved Smith up from fourth to second (and Betts and Freeman down a spot each) in Game 5. Might he again drop Betts in Game 6? It's to be seen.Even if the Dodgers wanted to tinker with their starting nine by swapping in other performers, they lack for options. Teams aren't allowed to make roster moves during a round except for in the case of an injury. That means the Dodgers are limited to who they have on their bench. Who might that be? Rortvedt, who again has no way into the lineup other than starting over Smith; Call or fellow outfielder Andy Pages (mired in a lengthy skid); infielder Miguel Rojas; or two players, in Hyeseong Kim and Justin Dean, who haven't taken an in-game plate appearance in an MLB game since Sept. 28 and Aug. 26 respectively. \nRoberts sticking with his traditional starters isn't because of some blind loyalty -- it's out of necessity. This bunch was good enough to get the Dodgers to this point. Now, it's to be seen if they can rediscover that form before they lose their hard-earned chance at history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dodgers' offensive woes can only be solved by struggling stars figuring it out - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/8928cfac-2c4b-416b-ad96-8ed94294be38/thumbnail/1200x675/83250aec8d6f059893014603eae61548/freddie-freeman-strikes-out-getty.png"
      ],
      "datePublished": "2025-10-30T18:40:50.000Z",
      "dateModified": "2025-10-30T18:40:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Dodgers are now World Series underdogs, but they still have one big advantage - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-pitching-world-series-yoshinobu-yamamoto-shohei-ohtani-blue-jays/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/314d19c4-2dac-4f95-8bfe-cc1be6e3443a/thumbnail/1200x675/82dd1dac4343171aa1a24f82ac23585a/dodgers-pitchers-yamamoto-ohtani-getty.png",
    "tag": "Sports",
    "date": "2025-10-30T17:57:08.000Z",
    "description": "\n        The Los Angeles Dodgers lost to the Toronto Blue Jays on Wednesday in Game 5 of the World Series. The Dodgers, who are hoping to become MLB's",
    "body": "\n        The Los Angeles Dodgers lost to the Toronto Blue Jays on Wednesday in Game 5 of the World Series. The Dodgers, who are hoping to become MLB's first repeat champion since the New York Yankees won the 1998-2000 Fall Classics, are now down 3-2 in the best-of-seven series and without any margin for error. The Blue Jays, conversely, are another victory from claiming their first championship since 1993.The odds are not in the Dodgers' favor, empirically or theoretically. Roughly 70% of MLB teams to trail a best-of-seven set by a 3-2 margin have then lost the series. That only makes sense when you do the math yourself. Affording the Dodgers a 55% chance to win each game -- and that's generous -- would give them a 30% chance at winning both. Drop those odds to a coin flip, and they're looking at a 25% probability of running the table and repeating. It's not a great situation to be in either way.If there is a silver lining for the Dodgers, it's this: the remaining structure of the World Series should empower them to eliminate their biggest weakness: a leaky bullpen that tied for the second-most meltdowns during the regular season. The playoffs haven't been much better:Dodgers pitchersPostseason IPPostseason ERAPostseason K/BBStarters95.22.543.70Relievers49.14.561.23Manager Dave Roberts has had to navigate a quagmire throughout October. The disparity between the quality of his rotation and bullpen is such that he's made the logical call to lean on the former -- even as those pitchers have risked overexposure from working three-plus times through the opposing lineup. That's left him in an uncomfortable spot. If Roberts keeps a starter in too long, he'll be second-guessed, but if he removes a starter too early, he'll be second-guessed. Ain't managing fun?Roberts will still face that consideration in Game 6, and a potential Game 7, but the circumstances are different. Now, instead of picking between middle-relief options if a move is required in the fifth or sixth inning, Roberts can prioritize getting as many frames as possible from his four starting pitchers: Yoshinobu Yamamoto, Tyler Glasnow, Shohei Ohtani, and Blake Snell.\nPitcherProjected Game 6 roleProjected Game 7 roleYamamotoStarterRelief, if neededGlasnowRelief if needed (Game 7 starter)StarterOhtaniRelief if neededRelief if neededSnellNone (Game 5 starter)Relief if needed (throw day)Yamamoto and Glasnow, the projected starters, can work in bulk. Yamamoto has already thrown two complete games this postseason, including one in World Series Game 2 in Toronto. Roberts can then sub in Ohtani and/or Snell in accordance with their throw days (usually two days after a pitcher's start). There is no tomorrow if the Dodgers lose Game 6, and there is no tomorrow period in the event of a Game 7. That allows Roberts to push those starters a little further in relief than he might if this were the LCS round.Combined with Roberts' willingness to let his starters work deep -- every starter except Glasnow has averaged more than six innings per pop in the playoffs, and Yamamoto has cleared seven -- that could present scenarios where the Dodgers are only calling upon one traditional reliever, if any. Obviously that doesn't guarantee anything -- a starter in either role could have a bad night, or the offense could continue to no-show -- but it does put the Dodgers in a better situation than if they were trying to piece together four or five innings from a relief unit that hasn't gotten the job done on a steady basis. In fact, the Dodgers might be wise to limit their bullpen exposure so that only right-hander Roki Sasaki, L.A.'s postseason closer, is in Roberts' circle of trust.The one consideration the Dodgers ought to think about is how to best deploy Ohtani -- as in, would it make more sense to have him start any game they intend to deploy him within, that way he doesn't have to bother attempting to warm up while still being part of the lineup. \nWhatever the case, the Dodgers can take solace in this much: if they lose this series, it may not be because of their middle relievers falling apart.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Dodgers are now World Series underdogs, but they still have one big advantage - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/314d19c4-2dac-4f95-8bfe-cc1be6e3443a/thumbnail/1200x675/82dd1dac4343171aa1a24f82ac23585a/dodgers-pitchers-yamamoto-ohtani-getty.png"
      ],
      "datePublished": "2025-10-30T17:57:08.000Z",
      "dateModified": "2025-10-30T17:57:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dolphins vs. Ravens odds, line, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-ravens-prediction-odds-line-time-thursday-night-football-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/02/fa7b87b1-e703-4bcc-90de-32089f7e85c7/thumbnail/1200x675/4832fdcc8947590d585ca973318f60b6/lamar-jackson.jpg",
    "tag": "Sports",
    "date": "2025-10-30T17:21:43.000Z",
    "description": "\n        AFC squads coming off much-needed victories will kick off NFL Week 9 when the Miami Dolphins host the Baltimore Ravens on 'Thursday Night Foo",
    "body": "\n        AFC squads coming off much-needed victories will kick off NFL Week 9 when the Miami Dolphins host the Baltimore Ravens on 'Thursday Night Football.' Baltimore (2-5) ended a four-game skid with a 30-16 win over Chicago on Sunday, while Miami (2-6) had lost three in a row before beating Atlanta, 34-10, in Week 8. Both teams currently sit in third place in their respective divisions, and the Ravens are 9-3 versus the Dolphins over their last 12 meetings. Lamar Jackson (hamstring) is expected to play after being sidelined since Week 4, as is Tua Tagovailoa (thumb) despite being on the injury report.Kickoff is at 8:15 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla. Baltimore prevailed, 56-19, when the teams last met in 2023. The latest Dolphins vs. Ravens odds have Baltimore as 7.5-point road favorites as the line has held steady since opening. The over/under for total points is 51.5. Baltimore is at -448 on the money line (risk $448 to win $100), with Miami at +345 (risk $100 to win $345). Before making any Ravens vs. Dolphins picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Now, the model has zeroed in on Miami vs. Baltimore. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Ravens vs. Dolphins:Dolphins vs. Ravens         spreadBaltimore -7.5 at DraftKings SportsbookDolphins vs. Ravens       over/under51.5 pointsDolphins vs. Ravens             money line Baltimore -448, Miami +345Dolphins vs. Ravens            picksSee picks at SportsLineDolphins vs. Ravens     streaming Amazon PrimeWhy the Ravens can coverThe Ravens team that was a preseason Super Bowl contender finally showed up on Sunday in their two-touchdown victory over a Bears team that had won four straight. The team played turnover-free ball, rushed for 177 yards and two touchdowns, and the defense allowed a season-low of 16 points. Baltimore kept Chicago out of the endzone through the air, marking the first time the Ravens have held an opponent without a passing touchdown in 2025, and the 96 rushing yards allowed by the Ravens were the second-fewest they've given up all year.Even with Jackson missing over half of the offensive snaps this year, Baltimore still ranks second in yards per rush (5.3). Derrick Henry moved into sole possession of fifth place on the all-time rushing touchdowns list versus Chicago, passing Bears legend Walter Payton, and he should find similar success versus Miami's defense, which allows the fourth-most yards per carry. The Dolphins passing defense is even more exploitable, as it's given up the highest completion percentage, has the fewest interceptions and has allowed the second-highest passer rating. See which team to back at SportsLine. Why the Dolphins can coverDespite being 2-4 straight up over their last six games, the Dolphins are 4-2 versus the spread during this span. They're coming off their best performance on both sides of the ball, scoring a season-high of 34 points and allowing a season-low of 10 points in a win over Atlanta. The team still has playmakers even without Tyreek Hill, as De'Von Achane has at least 91 scrimmage yards or a touchdown in nine straight games, while Jaylen Waddle has at least 95 receiving yards in three of his last four.Those playmakers can take advantage of a Baltimore defense which hasn't played up to the franchise's standards. The Ravens rank in the bottom five in points allowed, yards allowed, passing defense and third-down defense. Only one team has allowed more rushing scores than Baltimore, and opponents have scored in an NFL-high of 52.7% of possessions versus it. Tua Tagovailoa should have all day to pick apart Baltimore's secondary as the Ravens have the second-fewest sacks on the year. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code to get $300 in bonus bets after placing a $5 wager:How to make Ravens vs. Dolphins picksFor the NFL Week 9 'Thursday Night Football' game of Dolphins vs. Ravens, the model is leaning Over the total, projecting 61 total points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine.Who wins Ravens vs. Dolphins, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Dolphins vs. Ravens spread you need to jump, all from the model that is 45-28 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dolphins vs. Ravens odds, line, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/02/fa7b87b1-e703-4bcc-90de-32089f7e85c7/thumbnail/1200x675/4832fdcc8947590d585ca973318f60b6/lamar-jackson.jpg"
      ],
      "datePublished": "2025-10-30T17:21:43.000Z",
      "dateModified": "2025-10-30T17:21:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Houston vs. Louisiana Tech live stream, where to watch online, CBS Sports Network channel finder, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/sam-houston-vs-louisiana-tech-live-stream-where-to-watch-online-cbs-sports-network-channel-finder-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/45492ad7-c755-4a7b-87dc-f88829a87a5d/thumbnail/1200x675/48fc0797445b259177b27c1695ebecf8/sam-houston-state-1.jpg",
    "tag": "Sports",
    "date": "2025-10-30T17:35:46.000Z",
    "description": "\n        CBS Sports Network is set for a packed Week 10 of college football, featuring six games across four days that could shake up various conferen",
    "body": "\n        CBS Sports Network is set for a packed Week 10 of college football, featuring six games across four days that could shake up various conference standings and postseason positioning. From pivotal Conference USA clashes to high-stakes Mountain West showdowns, the week offers must-watch matchups.The week kicks off Wednesday night as Missouri State hosts FIU, marking the first meeting between the two programs. The Bears are coming off a thrilling 24-17 overtime win at New Mexico State, giving them back-to-back victories against FBS opponents for the first time.You can bet college football games this week at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager. Click here:Friday night, Sam Houston travels to face Louisiana Tech, as the Bearkats attempt to avoid an eight-game losing streak to open the season while the Bulldogs look to rebound from consecutive losses to conference contenders.\nSaturday features four more key matchups. UAB heads to East Hartford to take on UConn, as the Blazers aim for consecutive wins for the first time in more than 1,500 days. Later Saturday, Liberty hosts Delaware, looking to extend its C-USA title hunt with a third straight win.The week closes with two Mountain West matchups: San Diego State faces Wyoming at Snapdragon Stadium, where the Aztecs' dominant defense will challenge one of the conference's lower-scoring offenses, and Hawaii travels to San Jose State in a battle between two of the conference's top quarterbacks.CBS Sports Network will carry all six games, with full viewing info, betting lines and key storylines to follow as Week 10 unfolds.\nAll times Eastern | Odds via SportsLine consensusSam Houston vs. Louisiana TechDate: Friday, Oct. 31 | Time: 8 p.m.Location: Joe Aillet Stadium -- Ruston, LouisianaTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: Louisiana Tech -16.5 | Will the Bulldogs cover? Check out SportsLine's Week 10 projections hereIt continues to be a difficult season for Sam Houston (0-7) and first-year coach Phil Longo. The seven-game losing streak to start the season is one defeat shy of matching the program's start in 2023, the Bearkats' first year in the FBS. As for Louisiana Tech (4-3), it's trying to climb back above .500 in conference play after consecutive losses to C-USA title contenders. Quarterback Blake Baker set career highs in completions (31), pass attempts (45) and passing yards (340) in last week's overtime loss to Western Kentucky. He could have another big game against a Sam Houston pass defense that ranks last in C-USA this season.UAB vs. UConnDate: Saturday, Nov. 1 | Time: 12 p.m.Location: Pratt & Whitney Stadium at Rentschler Field -- East Hartford, ConnecticutTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: UConn -11.5 | Will the Huskies cover? Check out SportsLine's Week 10 projections here\nUAB (3-4) had an extra week to savor its upset win against Memphis under interim coach Alex Mortensen, but now returns off a bye for a road trip to UConn (5-3), which saw its four-game winning streak snapped in a double-overtime loss at Rice last Saturday. When the Blazers take the field in Week 10, it'll be more than 1,500 days since they last won consecutive games in a season. Huskies quarterback Joe Fagnano remains the only FBS player with at least 210 pass attempts and zero interceptions this season.Delaware vs. LibertyDate: Saturday, Nov. 1 | Time: 3:30 p.m.Location: Williams Stadium -- Lynchburg, VirginiaTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: Liberty -3.5 | Will the Flames cover? Check out SportsLine's Week 10 projections hereAlthough Liberty (3-4) still has an overall losing record, the Flames are in the C-USA title hunt with a chance to string together their third consecutive win when hosting Delaware (4-3). A healthy Ethan Vasko has energized the Liberty offense after scoring a season-high 30 points in a win at New Mexico State in Week 8. The Flames will need another strong showing to keep pace with Delaware and quarterback Nick Minicucci, arguably the top passer in C-USA this season.\nWyoming vs. San Diego StateDate: Saturday, Nov. 1 | Time: 7 p.m.Location: Snapdragon Stadium -- San Diego, CaliforniaTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: San Diego State -11.5 | Will the Aztecs cover? Check out SportsLine's Week 10 projections hereSan Diego State (6-1) could be a serious College Football Playoff contender if they keep up a dominant defensive performance. The Aztecs got their third shutout of the season last week at Fresno State and now face a Wyoming (4-4) offense that is third-worst in the Mountain West in points per game (21.0). The Cowboys have a respectable defense of their own, allowing just 19.8 points per game, which is second in the conference behind San Diego State.Hawaii vs. San Jose StateDate: Saturday, Nov. 1 | Time: 7 p.m.Location: CEFCU Stadium -- San Jose, CaliforniaTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: San Jose State -2.5 | Will the Spartans cover? Check out SportsLine's Week 10 projections here\nHawaii (6-2) is already bowl eligible for the first time in five seasons as fourth-year coach Timmy Chang has built one of the program's most balanced and explosive teams. Redshirt freshman quarterback Micah Alejado ranks 10th nationally in passing yards per game (292.8) as he prepares to face San Jose State (2-5) and its experienced quarterback Walker Eget. The veteran passer ranks fifth in the FBS in passing yards per game (307.0) and hasn't thrown an interception since Week 2 at Texas.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Houston vs. Louisiana Tech live stream, where to watch online, CBS Sports Network channel finder, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/45492ad7-c755-4a7b-87dc-f88829a87a5d/thumbnail/1200x675/48fc0797445b259177b27c1695ebecf8/sam-houston-state-1.jpg"
      ],
      "datePublished": "2025-10-30T17:35:46.000Z",
      "dateModified": "2025-10-30T17:35:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn State coaching candidates: Mike Elko leads options after Matt Rhule signs Nebraska extension - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-coaching-candidates-search-mike-elko-jeff-brohm-matt-rhule-nebraska-extension/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/892790df-4e6e-4461-b511-4052e0cc259e/thumbnail/1200x675/aaf5ebb257d5a58380e6460e40c847bf/mike-elko.png",
    "tag": "Sports",
    "date": "2025-10-30T17:10:42.000Z",
    "description": "\n        Penn State's coaching search could already be shifting in new directions after two prominent potential candidates, Indiana's Curt Cignetti an",
    "body": "\n        Penn State's coaching search could already be shifting in new directions after two prominent potential candidates, Indiana's Curt Cignetti and Nebraska's Matt Rhule, signed contract extensions that all but took them out of contention. The Nittany Lions are seeking a new leader after firing James Franklin a little more than two weeks ago, ending a 12-year tenure defined by steady success but mounting frustration in big games.Once a preseason national championship hopeful, Penn State stumbled with three straight losses -- including setbacks to Northwestern and UCLA -- prompting athletic director Pat Kraft to make arguably the biggest move yet in the 2025 coaching carousel.With Rhule and Cignetti staying put in the Big Ten, the program's focus could turn to established winners such as Texas A&M's Mike Elko and Iowa State's Matt Campbell, among others expected to draw early interest. Whoever lands in State College will inherit a stable, well-resourced program -- and the pressure to take the next step in the Big Ten's upper tier.\n        \n            \n                Matt Rhule contract extension: Nebraska coach inks new deal amid speculation of Penn State move\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nTexas A&M coach Mike ElkoSimilar to Rhule, Mike Elko has built a reputation for stabilizing programs in short order. After posting a 16-9 record in two seasons at Duke, he returned to Texas A&M and has the Aggies trending toward a College Football Playoff breakthrough after the Jimbo Fisher era. Known for his defensive background and detail-oriented approach, Elko would bring a disciplined identity to a Penn State team that often fell short in big moments under James Franklin. There's also a regional tie -- Elko is a Penn graduate with deep roots in the Northeast.\nBuffalo Bills offensive coordinator Joe BradyJoe Brady's name still carries weight from his breakout 2019 season at LSU, when he helped engineer one of the most explosive offenses in college football history. Now in charge of the Buffalo Bills offense, he has continued to work with elite quarterback talent in Josh Allen. Penn State could see Brady as a high-upside swing if it prioritizes offensive innovation and quarterback development after Drew Allar's stalled progress. And the move isn't too far from Upstate New York down to Happy Valley.Louisville coach Jeff BrohmWould Jeff Brohm be willing to leave his alma mater and take on the pressures at Penn State? Brohm has proven he can win with less, first at Purdue, where he led the program to a Big Ten Championship Game appearance, and now at Louisville, where he quickly turned the Cardinals into an ACC contender. His track record developing quarterbacks and producing efficient offenses fits what Penn State needs to reach the next level.Iowa State coach Matt CampbellIt would not be a coaching carousel cycle without Matt Campell hearing his name floated as a candidate for a big-time job. He is a mainstay on hot boards, particularly in the Big Ten, but has yet to leave Iowa State amid a terrific decade-long run. Campbell is responsible for essentially all of the best seasons in Cyclones history and is fresh off his second trip to the Big 12 title game. He redefined the ceiling of Iowa State football and could do the same at Penn State if given the opportunity. \n\n        \n            \n                The failure to develop QB Drew Allar sealed James Franklin's fate at Penn State\n                \n                    Brian Dohn                \n            \n                            \n    \n                \n                    \n    \n \tDuke coach Manny Diaz It was just two years ago that Manny Diaz was an integral part of the Penn State coaching staff. He built a pair of outstanding units as the Nittany Lions' defensive coordinator and in 2023 was a Broyles Award semifinalist in that role. Diaz's head coaching background is a bit of a mixed bag as he struggled to get Miami off the ground from 2019-21 but has Duke playing great football through one and a half seasons with the Blue Devils. The familiarity factor, as well as the proven schematic and recruiting ability at Penn State, could earn him another stint in Happy Valley.  \tKansas coach Lance Leipold Lance Leipold was a home-run hire for Kansas and had his name floated for bigger jobs as a result of his impressive run with the Jayhawks. Kansas was arguably the most downtrodden power conference program when he took the job but it is now far more respectable and has been competitive against the rest of the Big 12 throughout Leipold's tenure, peaking in 2023 with a nine-win season. The ability to win at multiple levels makes Leipold a highly respected name in the industry. Six Division III national championships, two MAC Championship Game appearances at Buffalo and a good run at Kansas is quite the track record and one that should eventually earn him a look at a top program. \n \tVanderbilt coach Clark Lea Penn State is no stranger to the Vanderbilt pipeline. It plucked Franklin out of Nashville after his historic three-year run with the Commodores, so it is only natural for the latest Vanderbilt coaching prodigy to emerge as a name to watch. Clark Lea is Vanderbilt's most successful coach since Franklin and has the program on pace for one of its best campaigns of all time -- one year after delivering its first winning season since Franklin's 9-4 year in 2013. Perhaps Franklin's shortcomings are too fresh for Penn State to consider hiring another Vanderbilt coach. But Lea is a terrific candidate who is quickly earning a look at a premier program.  \tUNLV coach Dan Mullen Things ended poorly at Florida, but Dan Mullen hit the double-digit win mark with the Gators twice in four years and guided them to an SEC East crown in 2020. He also accounted for four of the 10 best seasons in Mississippi State history. And after three years away from the sidelines, Mullen is back and hit the ground running in his return to coaching with a 6-0 start at UNLV. Mullen is a Pennsylvania native with enough qualifications to get back into a Power Four program. The Nittany Lions might make the call. \n    \n                                        \n    If you want all of the latest Penn State coaching search news and info, there's no better place than Lions247.  It's the most trusted source for intel on the Nittany Lions and has the largest and most dedicated community of Penn State fans. The team of insiders with over 20 years of experience will tell you what's happening before it happens. Sign up for a VIP membership now and unlock all of the intel, info, analysis and more as the Lions search for its next head coach for the first time in over a decade. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State coaching candidates: Mike Elko leads options after Matt Rhule signs Nebraska extension - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/892790df-4e6e-4461-b511-4052e0cc259e/thumbnail/1200x675/aaf5ebb257d5a58380e6460e40c847bf/mike-elko.png"
      ],
      "datePublished": "2025-10-30T17:10:42.000Z",
      "dateModified": "2025-10-30T17:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing Dolphins-Ravens under, Bucks, Thunder - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-betmgm-bonus-code-cbssports-get-150-bonus-dolphins-ravens-under-bucks-thunder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-30T19:35:18.000Z",
    "description": "\n        Sports bettors have another full slate of action, providing another great opportunity to use the latest BetMGM bonus code CBSSPORTS to receiv",
    "body": "\n        Sports bettors have another full slate of action, providing another great opportunity to use the latest BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins as a new user. The Miami Dolphins host the Baltimore Ravens on Thursday Night Football at 8:15 p.m. ET, and the NBA features four matchups, including Wizards vs. Thunder and Warriors vs. Bucks at 8 p.m. ET. Picks from all three of those games are among our NBA and NFL best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every NFL game 10,000 times. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024.   The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. Since its inception, it has also generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its NFL betting, college football betting or NBA betting picks at sportsbooks and on betting sites could have seen strong returns.Thursday's best bets at BetMGMUnder 52 points in Dolphins vs. Ravens (-118) Bucks +3.5 vs. Warriors (-115)Thunder -15.5 vs. Wizards (-110)Combining these three picks into a Thursday NBA and NFL parlay at BetMGM would result in a payout of +581 (risk $100 to win $581). Bet it at BetMGM here:\nUnder 52 points in Dolphins vs. Ravens (-118)\"Lamar Jackson is expected to be back for the Ravens in this matchup, which is contributing to this total being in the 50s. I don't think that's giving credit to the Ravens defense getting healthy coming out of their bye in Week 7,\" CBS Sports Gambling and Fantasy editor R.J. White said. \"The Dolphins offense doesn't seem like it has nearly as much to worry about as Chicago last week for Baltimore, and I see it as unlikely that Tua Tagovailoa strings together two good games in a row. I expect the Ravens' offensive gameplan to be a bit conservative with Jackson returning from injury as they stick to running the ball and keeping the clock moving. This total is about 2-3 points too high for me.\" Back the Under at BetMGM Sportsbook now:Bucks +3.5 vs. Warriors (-115)\"First time leaving the West Coast for the Dubs so I'm a little befuddled at this number. Giannis Antetokounmpo has been truly unstoppable,\" SportsLine handicapper Matt Severance said. \"I definitely looked at Giannis' PRA, but it's absurd: 51.5. And he probably goes Over, but I'm not capable of playing an Over on that. Naturally, make sure of lineups before any play.\" Back the Bucks at BetMGM Sportsbook now:Thunder -15.5 vs. Wizards (-110)After a 68-win season and a championship, the Thunder are off to a 5-0 start. Meanwhile, the Wizards improbably blew an 18-point lead against the 76ers to lose in overtime and drop to 1-3 on Tuesday. They're back in the tank again after getting blitzed by the NBA draft lottery last season and their roster full of youngsters is no match for the best team in the NBA. The model predicts that the Thunder cover in 65% of simulations. Back the Thunder at BetMGM Sportsbook now:\nWant more NBA picks for this week?You've seen some of the model's best bets for Thursday. Now, get against the spread, total and money-line picks for every NBA game on the schedule, all from the model that's simulated every game 10,000 times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing Dolphins-Ravens under, Bucks, Thunder - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-30T19:35:18.000Z",
      "dateModified": "2025-10-30T19:35:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]