[
  {
    "title": "Mauricio Pochettino praises USMNT for 'playing the way that we plan to play' in friendly draw with Ecuador - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/mauricio-pochettino-praises-usmnt-for-playing-the-way-that-we-plan-to-play-in-friendly-draw-with-ecuador/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/11/ab6c5667-89a4-480a-8287-549979464018/thumbnail/1200x675/b7401472c824da5200b8f7cabc8a2164/uas.jpg",
    "tag": "Sports",
    "date": "2025-10-11T09:24:45.000Z",
    "description": "AUSTIN, Texas -- The day before the U.S. men's national team's friendly against Ecuador, head coach Mauricio Pochettino wasted no time reminding everyone that his focus for the time being is performance...",
    "body": "\n        AUSTIN, Texas -- The day before the U.S. men's national team's friendly against Ecuador, head coach Mauricio Pochettino wasted no time reminding everyone that his focus for the time being is performance rather than results. He got a game that encapsulated that exact sentiment on Friday night at Q2 Stadium, where the USMNT came from behind and settled for a 1-1 draw, showcasing some genuine signs of progress and lending credence to Pochettino's idea that the team is, at long last, trending in the right direction.Pochettino's first year in the job was marked by unimpressive -- and at times, uninspiring -- results, but as he celebrates a year in the role, the USMNT have traded a sense of doom and gloom for some downright normalcy. In some sense, they were merely the latest victims of Ecuador's egregiously defensive approach that saw them finish second in CONMEBOL's World Cup qualifying competition despite scoring just 14 goals in 18 games, the 35-year-old (or ageless) Enner Valencia nicking a goal from a quick counterattack before the half-hour mark. The U.S. team were not exactly perfect throughout, the midfield trio of Weston McKennie, Tanner Tessman and Aidan Morris not always clicking after months away from a group with a new look, while the hosts were a little bit wasteful in attack as the game continued. None of the USMNT's issues on Friday evening, though, seemed atypical of a team that still has eight months to go before the opening game of the World Cup.As Pochettino marks his first anniversary, the stamp he is beginning to leave on the team is clear and was on full display against Ecuador. While a newfound competitiveness for playing time was apparent from the moment the roster dropped last week, Pochettino's version of the USMNT has a tactical flexibility that the previous iteration under his predecessor Gregg Berhalter did not. The back three he debuted in last month's friendlies against South Korea and Japan returned against Ecuador, this time with some new tweaks -- or specifically, a different look in and out of possession.\"I think we keep, now, playing the way that we plan to play,\" Pochettino said after the match. \"I think we defend with a back four, two midfielders and three and one and of course, the 'keeper -- 1-4-2-3-1 -- but then our formation building from [the] back, we [were] building with three, two and then five.\"\nThe personnel choices were equally as intriguing, with Miles Robinson joining mainstays Chris Richards and Tim Ream at center back while Max Arfsten and Tim Weah balanced each other out in respective roles on the left and right flanks. Weah described his role pre-match as the one of the \"fake wingback,\" simply explaining afterward that \"I would be doing less defending 'cause Miles was covering the whole time so that was pretty much it and in the attack, I was playing like a normal winger.\" Pochettino noted how Arfsten, a more traditional fullback, and Weah's distinct styles added new layers to Friday's game plan.\"That is about hav[ing] different dimensions but that change depends on, also, the position of how we want to attack, how we want to use the channels, how we want to be vigilant if [the opponents] play with one striker, two strikers,\" Pochettino said.\"That is really important and we start to see how [to] change the set-up depend[ing] on the height [of the defensive line] of the opposition -- low block, medium block -- or when you are in the opposite half, different situations can happen. My appreciation, my opinion on his performance is that I think he did well. He did well when he was a winger trying to go in the diagonal to try to create chances. He had a few shots from the outside of the box and then when he was like a wingback because, [Pervis] Estupinan first and then when [Yaimar] Medina [was switched] in, to force him to defend a little bit closer than Miles and then close to [substitute] Alex Freeman.\"There was still a mixed bag element from the USMNT, the team openly admitting that they could have turned more of their 11 shots into clear-cut opportunities. That said, there was a clear idea at play. Each time the USMNT had the ball -- which was often in a game in which they had nearly 65% possession -- the emphasis was to attack as quickly and cohesively as possible. Their attacking outing was also impressive in its own right considering the circumstances -- Sebastian Beccacece's Ecuador conceded just five goals in 18 World Cup qualification matches and it is not all that hard to envision a reality in which a more clinical USMNT would have scored multiple goals against them. Even if a draw is a fair enough result for both sides, the game started to tilt in the U.S.' favor in the second half.\n\"We started to look the fresher team as the game wore on and listen, as someone who's been on the other side of that, you know and you smell that,\" Ream said. \"You're like, okay, these guys … are starting to be a little bit gassed and you actually feel more energized and it allows you to get on top of them more and start making more little plays, being connected better. I think we were connected pretty well in the first half but even closer connections in the second half and I'll tell you what, it takes a toll on teams and it did that today.\"This version of the team felt incomplete in part because Christian Pulisic, Antonee Robinson and Tyler Adams were not in the starting lineup for varying reasons -- Pulisic came on as a substitute and Robinson is not fully fit yet, while Adams did not make the trip as he and his wife await the birth of their second child. None of this comes as a surprise at this point and there are still questions to be answered about what the USMNT is capable of if those players are not on the field, especially Adams. The puzzle pieces feel like they are starting to finally come together, though, with a handful of standout individual performances headlined by Malik Tillman, who continued to prove his worth as one of Pochettino's breakouts with the assist to the USMNT's second-half goal. The credit for that, in the end, went to Folarin Balogun, who has two goals and one assist in his three games under Pochettino so far, reasserting himself once again as Pochettino's go-to No. 9.The normalcy of the moment was not lost on Pochettino, either.\"I think the performance was a very, very serious performance, very professional,\" he said. \"I think what works the most is that we are here talking about actions, concepts, formations, things like this that for me, after one year, I am so, so, so happy that we don't talk about other things like commitment, attitude or things that normally in the past we were talking [about]. I think that this is a massive step up because I think we need to forget that always, win or lose, it depends [on] our performance. If we are better and [if] we make sure we are better than our opponent, we can win. If we don't show that, it's because it's a soccer problem, not [that] it's another problem that is dangerous when these types of things happen in a team.\"\n            "
  },
  {
    "title": "How A'ja Wilson's leadership fueled the most impressive season of a player already in the GOAT conversation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/how-aja-wilsons-leadership-fueled-the-most-impressive-season-of-a-player-already-in-the-goat-conversation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/11/54459a81-249f-4c4b-8603-4fca2de7070d/thumbnail/1200x675/f42f1cfb3960d6118330afcbc7f7f438/untitled-design-56.png",
    "tag": "Sports",
    "date": "2025-10-11T05:35:37.000Z",
    "description": "By the time the buzzer sounded in Phoenix on Friday night and the Las Vegas Aces sealed their WNBA Finals sweep over the Phoenix Mercury to win their third championship in four years, there was no doubt who...",
    "body": "\n        By the time the buzzer sounded in Phoenix on Friday night and the Las Vegas Aces sealed their WNBA Finals sweep over the Phoenix Mercury to win their third championship in four years, there was no doubt who would be named Finals MVP.It was A'ja Wilson's trophy, given at the culmination of A'ja Wilson's season, smack dab in the middle of the A'ja Wilson era of women's basketball. It is hard to have a true GOAT conversation while a player is in the prime of their career, but it's certainly clear you can't start that conversation without mentioning Wilson -- and it feels inevitable that one day soon her name it going to end it, too.But there will be time for those debates, short as they may be. For now I feel confident saying this: This was the most impressive season of her already HOF-worthy career. And it's not because led the league in points (23.4), blocks (2.3) and efficiency (29.2), was second in rebounds (10.2) and fourth in steals (1.6). Or because she led the Aces on a 16-game winning streak to close out the regular season. Or because she won the MVP award last month, passing Lisa Leslie, Lauren Jackson and Sheryl Swoopes to become the first four-time MVP in WNBA history. Or because she averaged 26.5 points, 10.1 rebounds, 3.3 assists, 2.5 blocks and 2.1 steals per game this postseason, career highs in every category except rebounds. Or because she hit one of the most iconic game-winning shots in Finals history on Wednesday night to put the Aces up 3-0 in the series. Or because she became the first player in the WNBA or NBA to win the scoring title, MVP, Defensive Player of the Year and Finals MVP in the same year.Sure, those things count. But what really set her season apart was her leadership.\nI'm not the only one saying this. Las Vegas head coach Becky Hammon praised Wilson's leadership before the MVP presentation last month, recalling that during the \"embarrassing moments\" this season, Wilson started taking her teammates aside one by one and pouring into them. \"This is the result of all the work that you don't get to see,\" Hammon said. \"You know, she's just a tireless worker, and where she took us this year from where we were -- if there was a leadership trophy, you know, this is the MVP skills trophy, but she has led tremendously through some really rough waters.\"All championship teams talk about their struggles in dramatically wrought terms. But Hammon and the Aces aren't exaggerating when recalling their low points in 2025. The Aces spent the first few months of the season teetering around the .500 mark, and things hit rock bottom on Aug. 2 when they lost by 53 points at home to the Minnesota Lynx to drop to 14-14. At that point, Napheesa Collier was the runaway favorite for MVP, too.\nESPN's Michael Voepel reported that after that 53-point loss, Wilson sent her teammates a text that set the tone for the rest of the season: \"If you weren't embarrassed from yesterday, then don't come into this gym. You're not needed or wanted here. We need the mindset to shift, because that was embarrassing.\"But she didn't just address them as a group and digitally; she found a way to speak the truth to each of them and bring out the best of them in the process.According to point guard Chelsea Gray, in the first half of the season Wilson told her bluntly, \"There's no way I should ever have more assists than you.\" As reported by ESPN's Katie Barnes, before that remark, Gray was averaging just 4.3 assists per game; the rest of the season Gray averaged 7.1 assists per game. This postseason Gray averaged 7.5 assists per game, a career high for the 32-year-old point guard who now has four WNBA championships to her name – three with Wilson and the Aces, and one from 2016 with the Los Angeles Sparks.\nIt says a lot about Wilson's character not only that she was willing to call out one of the best point guards in WNBA history, but that she had built up enough trust and clout with Gray over the years for Gray to truly listen to her and not just get defensive.And it says even more that she seems to have that level of trust and clout with every member of the team. Twenty-five-year-old forward NaLyssa Smith was traded to the Aces from the Dallas Wings midseason. She had never played with Wilson before, but had long been a fan -- cameras caught Wilson giving Smith advice and encouragement on the court during a preseason game at the start of the year when the two were still on opposing teams.Wilson immediately took Smith under her wing after the trade, helping her adapt to the team by giving her tips, motivating her throughout the game and making sure she stayed mentally focused. That investment paid off. Smith played some of the best basketball of her career this summer and played a key role in the Aces' turnaround.\nBut in my opinion, the most impressive display of her leadership came in a video shared by the Aces' social media team after Wilson won her MVP award. In the video, Wilson was surprised by hand-written notes of congratulations from each of her teammates. She sobbed as she read each and every one out loud -- and after listening to them all, I don't blame her.One by one, her teammates showered words of praise at Wilson, words that go far beyond generic teammate talk.\"I remember last year, you mentioned how you wanted to be a better leader in your last press conference. I just wanted to tell you that you're the best leader I've ever had, and I'm so blessed to compete with you,\" Dana Evans, a reserve point guard in her first season with the Aces, wrote.\n\"People can talk all day about what you are as a basketball player, because you're the best. But I want to tell you how much you mean to people as a human,\" Kierstan Bell, who just finished her fourth year with the Aces, said. \"You show up every single day and make it known that you will run through a wall for the people you love, which is why there's no doubt if I would ever do the same for you.\"Megan Gustafson added that Wilson is \"truly one of the best leaders I've ever witnessed. When you go, we go.\" Kia Stokes wrote, \"You are the definition of a humble superstar, a leader by example, and someone who is selfless.\" Jewell Loyd said, \"To be your teammate is a privilege, but to be your friend is a blessing. The way you serve and show up for your people is a testament to your character.\" Jackie Young wrote, \"I thank you for challenging me to get out of my shell and always believing in me and cussing me out when I needed it.\" Cheyenne Parker-Tyus, who gave birth to her second child this season, said, \"The way you carry yourself is truly top tier, and I pray that my daughter has the same amount of love, strength and greatness that you show every day as a true leader and a champion.\"And Smith shone light on why exactly Wilson's leadership is so effective: \"The kind of person you are, the kind of leader you are makes me want to go harder every day, not just for myself, but because my favorite player believes in me. ... I thank you every day from the bottom of my heart for being the person you are to me and helping me love basketball again.\"\nEven more moving than the words themselves was Wilson's reaction to each name that she read and each compliment she absorbed. Her obsession and adoration for each of her teammates was palpable through the screen.\"This team, oh, man, I would never get tired of talking about this team and my teammates. They are, they're my heartbeat, they're my heartstrings. They are the reason why I love coming into work every single day, and I'm just so appreciative to be able to call them my teammates, my sisters, my road dogs, my partner, anything in between. I'm blessed. I'm really blessed,\" she said.It's not unusual to see stars get along with teammates, or gush about them in big moments. But to see a superstar at Wilson's level have such a genuine connection with her entire roster, top to bottom, is truly rare. Ultimately, that's what sets Wilson apart from everyone else. Her greatness comes with accountability, not dramatics. Her confidence lifts people up, it doesn't tear people down. She knows how important she is to her team and to the game as a whole, but seems to truly believe that everyone in her orbit has the same import. \nThis season put Wilson to the test like no other. And she didn't just pass, she made sure everyone around her did, too. That belongs on her GOAT resume, too. \n            "
  },
  {
    "title": "Computer model locks in free college football picks, best bets for Week 7 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-week-7-college-football-free-bets-betting-odds-picks-model-backing-oregon-georgia-on-saturday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/b9554f2b-2494-4b0d-b1fe-c2fd906750cb/thumbnail/1200x675/b5cfe798b3a7b195ce2e0be6f4b15b1c/gunner-stockton-georgia-bulldogs.jpg",
    "tag": "Sports",
    "date": "2025-10-10T22:06:22.000Z",
    "description": "College football fans will be treated to several star-studded showdowns on Saturday, including No. 1 Ohio State vs. No. 17 Illinois, No. 7 Indiana vs. No. 3 Oregon and No. 6 Oklahoma vs. Texas. The Oregon vs....",
    "body": "\n        College football fans will be treated to several star-studded showdowns on Saturday, including No. 1 Ohio State vs. No. 17 Illinois, No. 7 Indiana vs. No. 3 Oregon and No. 6 Oklahoma vs. Texas. The Oregon vs. Indiana matchup features two undefeated Big Ten teams with championship aspirations. According to the latest Week 7 college football odds, the Ducks are favored by 7.5 points at home, while the over/under for total points scored is 55.5. SportsLine's model is backing Oregon, which has won 18 consecutive games at home, to cover the spread in 59% of simulations. The model is also backing Georgia (-3.5) to cover the spread at Auburn, while the Over (57.5) hits 57% of the time in Michigan vs. USC. Before locking in your Week 7 college football picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also target the all-new DraftKings promo code, which offers $200 in bonus bets if your first bet of $5 or more wins:  The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns, and new users can also target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:Week 7 college football best bets for Saturday, Oct. 11 (odds subject to change): Oregon (-7.5) vs. IndianaGeorgia (-3.5) vs. AuburnOver 57.5 points in Michigan vs. USCCombining the model's three picks into a Week 7 college football parlay would result in a payout of +612 (risk $100 to win $612). Bet it now at Caesars Sportsbook: Oregon -7.5 vs. IndianaOregon is 18-0 in its last 18 games played at home, and the Ducks are 16-1 in their past 17 games against an opponent from the Big Ten. Indiana features the nation's third-ranked scoring defense, giving up 9.60 points per game this season, but the Hoosiers have yet to face an offense as explosive as Oregon's. The Ducks are scoring 46.6 points per game, and quarterback Dante Moore is a Heisman Trophy candidate with 1,210 passing yards, 14 touchdowns and just one interception. The model is projecting Oregon to cover the spread in 59% of simulations, providing clear value on the spread. Georgia -3.5 vs. AuburnGeorgia has dominated this rivalry in recent years, winning eight straight against the Tigers. The Bulldogs are 18-2 in their past 20 games on the road and are 9-3 against the spread in their last 12 meetings against Auburn. SportsLine's model is backing Georgia to cover the spread in 61% of simulations, targeting the Bulldogs as one of its top Week 7 college football picks. Over 57.5 points in Michigan vs. USCTwo historic programs are set to collide when USC hosts Michigan at 7:30 p.m. ET. Michigan is coming off a 24-10 win over Wisconsin, while USC suffered a 34-32 setback against Illinois in its last outing. Despite the defeat, the Trojans are averaging 48.4 points per game, which ranks third in the nation. The total has gone Over in seven of USC's last eight games at home, and SportsLine's model is projecting these teams will combine for 62 points on Saturday, helping the Over hit in 57% of simulations.Want more Week 7 college football picks?You've seen the model's Week 7 college football best bets for Saturday. Now, get against the spread, total and money line picks for every Week 7 CFB game here, all from the model that's simulated every game 10,000 times. \n            "
  },
  {
    "title": "USF vs. North Texas prediction, odds, Friday college football picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/south-florida-north-texas-prediction-odds-line-2025-college-football-week-7-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/f0fbc862-f490-4cc5-b7e3-ac2d9f45bfaf/thumbnail/1200x675/4f8aa55c61cf39d0537ba66e346cc257/byrum-brown-south-florida-bulls-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-10T20:24:01.000Z",
    "description": "Two of the top teams in the American Conference clash when the 24th-ranked South Florida Bulls meet the North Texas Mean Green on Friday night. USF is coming off a 54-26 win over Charlotte on Oct. 3, while...",
    "body": "\n        Two of the top teams in the American Conference clash when the 24th-ranked South Florida Bulls meet the North Texas Mean Green on Friday night. USF is coming off a 54-26 win over Charlotte on Oct. 3, while North Texas downed South Alabama 36-22 on Sept. 27. The Bulls (4-1, 1-0 American), who have won two in a row, are 1-1 on the road this season. The Mean Green (5-0, 1-0 American), who have outscored their opponents 224-100, are 3-0 on their home field in 2025.Kickoff from DATCU Stadium in Denton, Texas, is at 7:30 p.m. ET. South Florida leads the all-time series 2-0. The Mean Green are 2.5-point favorites in the latest South Florida vs. North Texas odds, while the over/under for total points scored is 67.5 via SportsLine consensus. Before making any North Texas vs. South Florida picks, check out the college football predictions from the SportsLine Projection Model. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on South Florida vs. North Texas. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for North Texas vs. South Florida:South Florida vs. North Texas                                         spreadNorth Texas -2.5 at DraftKings SportsbookSouth Florida vs. North Texas                                                   over/under67.5 pointsSouth Florida vs. North Texas                                                   money line North Texas -131, USF +110South Florida vs. North Texas                                           picksSee picks at SportsLineSouth Florida vs. North Texas                                             streaming Fubo (Try for free)  Why South Florida can coverSenior quarterback Byrum Brown powers the Bulls' offense. In five starts, he has completed 92 of 150 passes (61.3%) for 1,194 yards and 10 touchdowns with four interceptions. He has also carried 64 times for 282 yards (4.4 average) and three touchdowns. In last Friday's win over Charlotte, he completed 19 of 34 passes (55.9%) for 211 yards and four touchdowns with two interceptions.His top target is senior wide receiver Chas Nimrod, who is in his first year with the program. He spent the last two seasons at Tennessee. In five games, he has 19 receptions for 421 yards (22.2 average) and three touchdowns. In a 63-14 win over South   Carolina State, he had four receptions for 119 yards (29.8 average) and two touchdowns. See which team to back at SportsLine. Why North Texas can coverHelping lead the Mean Green is redshirt freshman quarterback Drew Mestemaker. In five games, he has completed 106 of 156 passes (67.9%) for 1,247 yards and 11 touchdowns with zero interceptions. In a 51-0 season-opening win over Lamar, he completed 24 of 32 passes (75%) for 329 yards and three touchdowns. In a 45-38 overtime win over Army on Sept. 20, he completed 26 of 36 passes (72.2%) for 249 yards and one touchdown.North Texas has a one-two punch at running back with sophomore Makenzie McGill II and freshman Caleb Hawkins. McGill leads the Mean Green in rushing, carrying 63 times for 318 yards (5.0 average) and four touchdowns. McGill has surpassed 100 yards rushing in two games. Hawkins, meanwhile, has carried 42 times for 307 yards (7.3 average) and seven touchdowns. He carried 16 times for 140 yards (8.8 average) and two touchdowns in the win over South Alabama. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make South Florida vs. North Texas picksSportsLine's model is going Over on the total, projecting 73 combined points. It also says one side of the spread hits in well over 60% of simulations.     You can only get the pick at SportsLine. So who wins North Texas vs. South Florida, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the South Florida vs. North Texas spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            "
  },
  {
    "title": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/11/17afc9d9-9e84-4997-a6a5-b3d0069fc45a/thumbnail/1200x675/27f924e9938a588501eb84dc6a2911b4/mlb-bracket-lcs-mariners.jpg",
    "tag": "Sports",
    "date": "2025-10-11T05:25:46.000Z",
    "description": "Five teams remain in the 2025 MLB playoff bracket, and the final LCS spot will be determined on Saturday. On Friday, the Mariners punched their ticket to their first ALCS since 2001, eliminating the Tigers in...",
    "body": "\n        Five teams remain in the 2025 MLB playoff bracket, and the final LCS spot will be determined on Saturday. On Friday, the Mariners punched their ticket to their first ALCS since 2001, eliminating the Tigers in 15 innings in a winner-take-all ALDS Game 5. Jorge Polanco hit a walk-off single to score the winning run in the longest winner-take-all game in MLB playoff history. On Thursday, the reigning champion Dodgers knocked out the Phillies in a tense, extra-inning affair that was decided on a walk-off error. The Cubs, meanwhile, blew past the Brewers at Wrigley Field to force a winner-take-all NLDS Game 5. Those two sides will play for an NLCS berth on Saturday night.The Blue Jays became the first team to make the LCS round on Wednesday, as they knocked out the Yankees in ALDS Game 4. The Jays are in the ALCS for the first time since 2016, and they're looking for their first World Series berth since 1993.The Brewers, Blue Jays, Phillies and Mariners all earned first-round byes this season, but the Cubs, Yankees, Dodgers and Tigers all needed to win Wild Card Series to get here. The Dodgers completed a two-game sweep of the Reds, while the Cubs, Yankees and Tigers all needed three games to advance and knock out the Padres, Red Sox and Guardians, respectively.\nThe best-of-five League Division Series could run through Saturday, and the 2025 World Series begins on Oct. 24. Below is a look at the full 2025 MLB playoff bracket.2025 MLB playoff bracket\n                                                                    Keytron Jordan, CBS Sports\n                                                            2025 MLB playoff schedule, TV channelAll games on ESPN, ABC, Fox and FS1 are streaming on fubo (Try for free). All times Eastern.* = if neededDivision Series scheduleSaturday, Oct. 4NLDS Game 1: Brewers 9, Cubs 3 ALDS Game 1: Blue Jays 10, Yankees 1 NLDS Game 1: Dodgers 5, Phillies 3 ALDS Game 1: Tigers 3, Mariners 2 (11) \nSunday, Oct. 5ALDS Game 2: Blue Jays 13, Yankees 7 ALDS Game 2: Mariners 3, Tigers 2 Monday, Oct. 6NLDS Game 2: Dodgers 4, Phillies 3 NLDS Game 2: Brewers 7, Cubs 3 Tuesday, Oct. 7ALDS Game 3: Mariners 8, Tigers 4 ALDS Game 3: Yankees 9, Blue Jays 6\nWednesday, Oct. 8ALDS Game 4: Tigers 9, Mariners 3NLDS Game 3: Cubs 4, Brewers 3 ALDS Game 4: Blue Jays 5, Yankees 2 (Toronto wins series 3-1)NLDS Game 3: Phillies 8, Dodgers 2Thursday, Oct. 9NLDS Game 4: Dodgers 2, Phillies 1 (11) (Los Angeles wins series 3-1) NLDS Game 4: Cubs 6, Brewers 0 (Series tied 2-2)Friday, Oct. 10ALDS Game 5: Mariners 3, Tigers 2 (15) (Seattle wins series 3-2)Saturday, Oct. 11NLDS Game 5: Brewers vs. Cubs, 8:08 p.m. | TBSChampionship SeriesSunday, Oct. 12ALCS Game 1: Blue Jays vs. Mariners, 8:03 p.m. | Fox/fuboMonday, Oct. 13ALCS Game 2: Blue Jays vs. Mariners, 4:38 or 5:03 p.m. | Fox/fuboNLCS Game 1: Brewers/Cubs vs. Dodgers, 7:08 or 8:08 p.m. | TBS\nTuesday, Oct. 14NLCS Game 2: Brewers/Cubs vs. Dodgers, 8:08 p.m. | TBSWednesday, Oct. 15ALCS Game 3: Mariners vs. Blue JaysThursday, Oct. 16NLCS Game 3: Dodgers vs. Brewers/CubsALCS Game 4: Mariners vs. Blue JaysFriday, Oct. 17NLCS Game 4: Dodgers vs. Brewers/CubsALCS Game 5*: Mariners vs. Blue JaysSaturday, Oct. 18NLCS Game 5*: Dodgers vs. Brewers/CubsSunday, Oct. 19ALCS Game 6*: Blue Jays vs. MarinersMonday, Oct. 20NLCS Game 6*: Brewers/Cubs vs. DodgersALCS Game 7*: Blue Jays vs. Mariners\nTuesday, Oct. 21NLCS Game 7*: Brewers/Cubs vs. DodgersWorld SeriesFriday, Oct. 24World Series Game 1Saturday, Oct. 25World Series Game 2Monday, Oct. 27World Series Game 3Tuesday, Oct. 28World Series Game 4Wednesday, Oct. 29World Series Game 5*Friday, Oct. 31World Series Game 6*Saturday, Nov. 1World Series Game 7*Wild Card Series scoresTuesday, Sept. 30AL Wild Card Series Game 1: Tigers 2, Guardians 1NL Wild Card Series Game 1: Cubs 3, Padres 1 AL Wild Card Series Game 1: Red Sox 3, Yankees 1 NL Wild Card Series Game 1: Dodgers 10, Reds 5Wednesday, Oct. 1AL Wild Card Series Game 2: Guardians 6, TigersNL Wild Card Series Game 2: Padres 3, Cubs 0AL Wild Card Series Game 2: Yankees 4, Red Sox 3NL Wild Card Series Game 2: Dodgers 8, Reds 4 (Los Angeles wins 2-0)Thursday, Oct. 2AL Wild Card Series Game 3: Tigers 6, Guardians 3 (Detroit wins 2-1)NL Wild Card Series Game 3: Cubs 3, Padres 1 (Chicago wins 2-1)AL Wild Card Series Game 3: Yankees 4, Red Sox 0 (New York wins 2-1)\n            "
  },
  {
    "title": "Fantasy Football Week 6 Sleepers: Caleb Williams looks to have a big bounce-back game vs. Washington - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-6-sleepers-caleb-williams-looks-to-have-a-big-bounce-back-game-vs-washington/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/16/f9701804-30e5-4d49-9317-4accdced83fa/thumbnail/1200x675/9885d5b6b5d4913cf6e6f06d198cf63b/caleb-williams-bears-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-11T05:00:13.000Z",
    "description": "Under-the-radar players who could give your lineup an edge in Week...",
    "body": "\n\n\n    \n                                    Under-the-radar players who could give your lineup an edge in Week 6\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 10, 2025\n                            \n                    at\n    5:34 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        One of the biggest questions for Week 6 is who will be the best running back for the Chargers with Omarion Hampton (ankle) on injured reserve. As of Friday afternoon, we don't have a definitive answer out of Kimani Vidal and Hassan Haskins, which is frustrating.  And the Chargers, so far, haven't helped us out.  \"It's their time to shine,\" Chargers coach Jim Harbaugh said.  \"There's great opportunity for others to really make a name for themselves in this league,\" added Chargers offensive coordinator Greg Roman. \"It's what they've been dreaming about since they were a kid. That's the exciting part of it.\"  For Week 6, I'm listing Vidal and Haskins both as sleepers, and both are worth using as flex options given the matchup with the Dolphins. There's room for both to be productive in this game at Miami.  The Dolphins are No. 6 in most Fantasy points allowed to opposing running backs. And Miami has allowed a running back to score at least 12.8 PPR points in every game this season.  We'll see if Vidal or Haskins can follow suit. Or it could just be the Justin Herbert show since he should torch the Dolphins this week.  If given the choice, I'll lean Vidal slightly over Haskins, but I'm hopeful we get an answer coming out of this game on who will lead the Chargers backfield until Hampton returns. Eventually, we could get a No. 2 Fantasy running back in all leagues.   But for this week, given the uncertainty, Vidal and Haskins are just flex options at best against the Dolphins. Now, let's see the other sleepers I'm targeting for Week 6.\n\n        Week 6 Sleepers\n    \n\n    \n    \n                            \n                    Week 6 Preview\n                \n                            \n                    Sleepers\n                \n                    \n            Sleeper QBs\n    \n                    \n    \n                                        \n        \n                 \n                        CHI\n                    \n                         \n                        Chicago\n                    \n                                            • #18\n                                            \n                                            Age: 23\n                                                                        • Experience: 2 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        WAS\n                                    \n                                \n                                \n                                    WAS -4.5\n                                    O/U 49.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS QB\n                                \n                                23rd\n                            \n                                                                                                                                                                                                                        \n                                \n                                    QB RNK\n                                \n                                10th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                95%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        PAYDS\n                                    \n                                    927\n                                \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    110\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    9\n                                \n                                                            \n                                    \n                                        INT\n                                    \n                                    2\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    24.5\n                                \n                                                    \n                                    \n                    \n                    \n                Williams had his worst Fantasy outing of the season in Week 4 at Las Vegas with 13.8 points, which snapped a three-game streak where he scored at least 20.9 points. Coming off Chicago's bye in Week 5, Williams should get back on track against the Commanders, who have allowed three of the past four quarterbacks to score at least 22.7 Fantasy points. Last year, Williams faced Washington in Week 8 and scored just 9.9 Fantasy points in the game where the Bears lost on a Hail Mary. Williams will be much better in the rematch this week and has top-10 upside in all leagues.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        IND\n                    \n                         \n                        Indianapolis\n                    \n                                            • #17\n                                            \n                                            Age: 28\n                                                                        • Experience: 7 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        ARI\n                                    \n                                \n                                \n                                    IND -7\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS QB\n                                \n                                5th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    QB RNK\n                                \n                                15th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                96%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        PAYDS\n                                    \n                                    1290\n                                \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    56\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    9\n                                \n                                                            \n                                    \n                                        INT\n                                    \n                                    2\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    21.4\n                                \n                                                    \n                                    \n                    \n                    \n                Jones had another solid outing in Week 5 against the Raiders with 212 passing yards and two touchdowns, and he scored 20.7 Fantasy points. He's now scored at least 20 Fantasy points in all three home games this season and is averaging 25.7 points in Indianapolis this year. The Cardinals have only allowed one quarterback to score more than 18.1 Fantasy points this season, but they've had the easiest schedule this season of opposing passers with Spencer Rattler, Bryce Young, Mac Jones, Sam Darnold and Cam Ward. I like Jones as a low-end No. 1 Fantasy quarterback in all leagues at home this week.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        SEA\n                    \n                         \n                        Seattle\n                    \n                                            • #14\n                                            \n                                            Age: 28\n                                                                        • Experience: 8 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        JAC\n                                    \n                                \n                                \n                                    SEA -1.5\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS QB\n                                \n                                22nd\n                            \n                                                                                                                                                                                                                        \n                                \n                                    QB RNK\n                                \n                                16th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                65%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        PAYDS\n                                    \n                                    1246\n                                \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    38\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    9\n                                \n                                                            \n                                    \n                                        INT\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    19.9\n                                \n                                                    \n                                    \n                    \n                    \n                Darnold finally had the breakout game we were waiting for with 35.6 Fantasy points against Tampa Bay in Week 5, and he had a season-high 34 pass attempts. I hope he continues to throw more because that will help his production, and he has scored at least 18.1 Fantasy points in four games in a row. The Jaguars allow an average of 39.4 pass attempts per game this year, which bodes well for Darnold, and three of the past four opposing quarterbacks against Jacksonville have scored at least 21.7 Fantasy points, including two in a row with Brock Purdy and Patrick Mahomes. I like Darnold as a low-end No. 1 Fantasy quarterback in all leagues this week.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        SF\n                    \n                         \n                        San Francisco\n                    \n                                            • #10\n                                            \n                                            Age: 27\n                                                                        • Experience: 5 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        TB\n                                    \n                                \n                                \n                                    TB -3\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS QB\n                                \n                                26th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    QB RNK\n                                \n                                13th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                20%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        PAYDS\n                                    \n                                    905\n                                \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    10\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    6\n                                \n                                                            \n                                    \n                                        INT\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    23\n                                \n                                                    \n                                    \n                    \n                    \n                Jones will start again in Week 6 at Tampa Bay with Brock Purdy (toe) injured, and Jones has been a solid replacement option so far, with at least 26.2 Fantasy points in two of three starts. The Buccaneers are beat up defensively and come into this game at No. 8 in most Fantasy points allowed to opposing quarterbacks. Three quarterbacks in a row have scored at least 20.7 Fantasy points against Tampa Bay, including Jalen Hurts and Sam Darnold each scoring at least 23.4 points. We'll see if Jones gets help in the receiving corps with Jauan Jennings (toe) potentially back -- Ricky Pearsall (knee) is out -- but I'll still trust Jones as a low-end starter in all leagues even if Jennings remains out in this matchup.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        CAR\n                    \n                         \n                        Carolina\n                    \n                                            • #9\n                                            \n                                            Age: 24\n                                                                        • Experience: 3 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        DAL\n                                    \n                                \n                                \n                                    DAL -3\n                                    O/U 49.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS QB\n                                \n                                32nd\n                            \n                                                                                                                                                                                                                        \n                                \n                                    QB RNK\n                                \n                                18th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                39%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        PAYDS\n                                    \n                                    951\n                                \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    54\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    8\n                                \n                                                            \n                                    \n                                        INT\n                                    \n                                    4\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    15.5\n                                \n                                                    \n                                    \n                    \n                    \n                Young only has one game this season with more than 16 Fantasy points, but he has the chance to be a low-end starter in all leagues in Week 6, given the matchup against Dallas. The Cowboys are No. 1 in most Fantasy points allowed to opposing quarterbacks, and every quarterback this season has scored at least 24.3 Fantasy points against Dallas. And the past four opponents against the Cowboys have all passed for at least 283 yards and two touchdowns (Russell Wilson, Caleb Williams, Jordan Love and Justin Fields). Hopefully, Young will follow suit in Week 6.\n            \n            \n\nSleeper RBs\n    \n                    \n    \n                                        \n        \n                 \n                        ARI\n                    \n                         \n                        Arizona\n                    \n                                            • #22\n                                            \n                                            Age: 26\n                                                                        • Experience: 4 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        IND\n                                    \n                                \n                                \n                                    IND -7\n                                    O/U 47\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS RB\n                                \n                                5th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    RB RNK\n                                \n                                24th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                89%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    52\n                                \n                                                            \n                                    \n                                        REC\n                                    \n                                    5\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    22\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    9.2\n                                \n                                                    \n                                    \n                    \n                    \n                We found out in Week 5 against the Titans that Carter is the replacement option for Trey Benson (knee), and Carter should continue in that role in Week 6, especially after Emari Demercado had the unfortunate fumble at the goal line. Carter has a tough matchup in Week 6 at the Colts, but a running back has scored at least 12.4 PPR points against Indianapolis in every game this season. And I like that Carter had five catches on five targets against Tennessee, which is something that will hopefully continue against the Colts. Carter should be considered a high-end flex in all leagues.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        NE\n                    \n                         \n                        New England\n                    \n                                            • #38\n                                            \n                                            Age: 27\n                                                                        • Experience: 5 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        NO\n                                    \n                                \n                                \n                                    NE -3.5\n                                    O/U 46\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS RB\n                                \n                                24th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    RB RNK\n                                \n                                29th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                93%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    139\n                                \n                                                            \n                                    \n                                        REC\n                                    \n                                    13\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    154\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    2\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    10.1\n                                \n                                                    \n                                    \n                    \n                    \n                Stevenson and TreVeyon Henderson should both benefit with Antonio Gibson (knee) out for the season, and both are worth using as flex options against the Saints, who are No. 10 in most Fantasy points allowed to opposing running backs. A running back has scored at least 14.4 PPR points against New Orleans in every game this season, and Stevenson is most likely to reach that threshold with his touchdown potential. He's also scored at least 14.7 PPR points in two of his past four games coming into Week 6. Henderson will hopefully start to get more work with Gibson out, and it would be great if the Patriots featured him in this matchup.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        SEA\n                    \n                         \n                        Seattle\n                    \n                                            • #26\n                                            \n                                            Age: 24\n                                                                        • Experience: 3 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        JAC\n                                    \n                                \n                                \n                                    SEA -1.5\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS RB\n                                \n                                18th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    RB RNK\n                                \n                                31st\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                93%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    132\n                                \n                                                            \n                                    \n                                        REC\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    17\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    9\n                                \n                                                    \n                                    \n                    \n                    \n                Kenneth Walker III should be considered a No. 2 Fantasy running back in all leagues, but I like Charbonnet as a flex. He's scored a touchdown in each of his past two games against Arizona and Tampa Bay, and he has 21 carries for 75 yards over that span, along with three catches for 17 yards on four targets. The Jaguars have allowed a running back to score at least 18.7 PPR points in each of their past two games, and Charbonnet could be a quality Fantasy option if he scores a touchdown for the third game in a row.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        LAR\n                    \n                         \n                        L.A. Rams\n                    \n                                            • #22\n                                            \n                                            Age: 24\n                                                                        • Experience: 2 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        BAL\n                                    \n                                \n                                \n                                    LAR -7.5\n                                    O/U 44.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS RB\n                                \n                                31st\n                            \n                                                                                                                                                                                                                        \n                                \n                                    RB RNK\n                                \n                                43rd\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                44%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    133\n                                \n                                                            \n                                    \n                                        REC\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    9\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    4.7\n                                \n                                                    \n                                    \n                    \n                    \n                Corum is a desperation play in Week 6 with the hope he gets back to helping Kyren Williams in the Rams backfield. He played a season-low six snaps in Week 5 against San Francisco and finished with one carry for 13 yards and no catches on two targets. Prior to that outing, Corum had 17 carries for 74 yards and two catches for minus-5 yards on four targets in his two previous games. This week, Corum could help the Rams beat up the Ravens, who are No. 2 in most Fantasy points allowed to opposing running backs. Eight running backs in five games against Baltimore have scored at least 10.1 PPR points, and Corum could be a low-end flex in this matchup on the road.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        DEN\n                    \n                         \n                        Denver\n                    \n                                            • #37\n                                            \n                                            Age: 24\n                                                                        • Experience: Rookie\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        NYJ\n                                    \n                                \n                                \n                                    DEN -7.5\n                                    O/U 43.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS RB\n                                \n                                22nd\n                            \n                                                                                                                                                                                                                        \n                                \n                                    RB RNK\n                                \n                                35th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                92%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        RUYDS\n                                    \n                                    150\n                                \n                                                            \n                                    \n                                        REC\n                                    \n                                    12\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    87\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    8.4\n                                \n                                                    \n                                    \n                    \n                    \n                J.K. Dobbins is worth starting as a No. 2 Fantasy running back in all leagues, but I like Harvey as a flex given the matchup against the Jets. This could be a similar game for Harvey like the one we saw in Week 4 against Cincinnati when he had 14 carries for 58 yards and four catches for 40 yards and a touchdown on five targets. The Jets have allowed a running back to score at least 13.9 PPR points in every game this season, and if the Broncos are playing with a lead in this game in London, we could see Harvey getting some production late in the fourth quarter.\n            \n            \n\nSleeper WRs\n    \n                    \n    \n                                        \n        \n                 \n                        TEN\n                    \n                         \n                        Tennessee\n                    \n                                            \n                                            Age: 30\n                                                                        • Experience: 7 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        LV\n                                    \n                                \n                                \n                                    LV -4.5\n                                    O/U 41.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS WR\n                                \n                                29th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    WR RNK\n                                \n                                32nd\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                80%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    15\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    34\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    272\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    0\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    8.4\n                                \n                                                    \n                                    \n                    \n                    \n                Ridley finally had a breakout game with Cam Ward in Week 5 at Arizona with five catches for 131 yards on 10 targets, and I'm hoping he can build off that performance in Week 6 against the Raiders. Las Vegas is No. 4 in most Fantasy points allowed to opposing receivers, and six guys have scored at least 14.6 PPR points against the Raiders this year. Ridley and Elic Ayomanor are worth using as No. 3 Fantasy receivers in the majority of leagues, given this matchup on the road.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        LV\n                    \n                         \n                        Las Vegas\n                    \n                                            • #16\n                                            \n                                            Age: 28\n                                                                        • Experience: 7 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        TEN\n                                    \n                                \n                                \n                                    LV -4.5\n                                    O/U 41.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS WR\n                                \n                                25th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    WR RNK\n                                \n                                23rd\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                97%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    25\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    39\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    290\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    0\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    10.8\n                                \n                                                    \n                                    \n                    \n                    \n                Meyers has been a disappointment in each of the past three games against Washington, Chicago, and Indianapolis, and he scored 9.3 PPR points or less in each of those outings. But I like that he has 13 targets in his past two games against the Bears and Colts, and Brock Bowers (knee) is still banged up. This is a good matchup for Meyers against the Titans, who are No. 8 in most Fantasy points allowed to opposing receivers, and five guys have scored at least 13.8 PPR points against Tennessee this season. I consider Meyers a low-end No. 2 Fantasy receiver in the majority of leagues, and you can also use Tre Tucker as a No. 3 receiver in Week 6.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        GB\n                    \n                         \n                        Green Bay\n                    \n                                            • #87\n                                            \n                                            Age: 25\n                                                                        • Experience: 4 yrs.\n                                                \n        \n    \n    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    13\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    19\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    179\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    4\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    13.7\n                                \n                                                    \n                                    \n                    \n                    \n                The last time we saw Doubs in Week 4 at Dallas, he had six catches for 58 yards and three touchdowns on eight targets. We hope he can build off that performance after the Packers bye in Week 5, and this is a great matchup against the Bengals. Cincinnati is No. 9 in most Fantasy points allowed to opposing receivers, and seven guys have scored at least 12.9 PPR points against the Bengals this season. Doubs should be considered a high-end No. 3 Fantasy receiver in the majority of leagues, and Matthew Golden is also worth using as a sleeper as well in this matchup.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        DEN\n                    \n                         \n                        Denver\n                    \n                                            • #11\n                                            \n                                            Age: 22\n                                                                        • Experience: 2 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        NYJ\n                                    \n                                \n                                \n                                    DEN -7.5\n                                    O/U 43.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS WR\n                                \n                                14th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    WR RNK\n                                \n                                39th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                38%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    21\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    32\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    231\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    10.6\n                                \n                                                    \n                                    \n                    \n                    \n                Franklin and Marvin Mims have the chance to help Fantasy managers this week based on what secondary receivers have done against the Jets this year. While Sauce Gardner will likely shadow Courtland Sutton -- I still consider Sutton a No. 2 Fantasy receiver in the majority of leagues -- Franklin or Mims could benefit like Calvin Austin III, Emeka Egbuka and Ryan Flournoy, who each scored at least 14.5 PPR points against the Jets. I'll lean toward Franklin over Mims, and Franklin has 13 targets in his past two games. He could be a nice surprise for the Broncos in this game in London.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        TB\n                    \n                         \n                        Tampa Bay\n                    \n                                            • #17\n                                            \n                                            Age: 32\n                                                                        • Experience: 10 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        SF\n                                    \n                                \n                                \n                                    TB -3.5\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS WR\n                                \n                                11th\n                            \n                                                                                                                                                    \n                                \n                                    WR RNK\n                                \n                                NR\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                4%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    17\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    24\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    191\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    1\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    8.5\n                                \n                                                    \n                                    \n                    \n                    \n                Mike Evans (hamstring) and Chris Godwin (leg) are out in Week 6 against San Francisco, which should put Sterling in a prominent role alongside Emeka Egbuka. Shepard has scored at least 11.9 PPR points in two of his past three games, and he's worth using as a No. 3 receiver in PPR leagues. This game should be a high-scoring affair with the 49ers, and Baker Mayfield will likely need Shepard to make plays with Evans and Godwin out.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        KC\n                    \n                         \n                        Kansas City\n                    \n                                            • #80\n                                            \n                                            Age: 25\n                                                                        • Experience: 4 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        DET\n                                    \n                                \n                                \n                                    KC -2.5\n                                    O/U 52.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS WR\n                                \n                                26th\n                            \n                                                                                                                                                    \n                                \n                                    WR RNK\n                                \n                                NR\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                62%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    13\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    25\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    272\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    11.6\n                                \n                                                    \n                                    \n                    \n                    \n                Thornton comes into Week 6 against the Lions having scored at least 12 PPR points in three of his past four games. He will likely need a big play to help his Fantasy production, and he just had three catches for 90 yards on five targets in Week 5 at Jacksonville. The Lions are No. 7 in most Fantasy points allowed to opposing receivers, and Thornton should get some opportunities down the field from Patrick Mahomes in this matchup. He's a boom-or-bust No. 3 Fantasy receiver in all leagues for Week 6.\n            \n            \n\nSleeper TEs\n    \n                    \n    \n                                        \n        \n                 \n                        NE\n                    \n                         \n                        New England\n                    \n                                            • #85\n                                            \n                                            Age: 30\n                                                                        • Experience: 10 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        NO\n                                    \n                                \n                                \n                                    NE -3.5\n                                    O/U 46\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS TE\n                                \n                                27th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    TE RNK\n                                \n                                11th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                87%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    17\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    28\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    250\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    12\n                                \n                                                    \n                                    \n                    \n                    \n                Henry had a down game in Week 5 at Buffalo with two catches for 46 yards on four targets, but I'm hopeful he'll bounce back in Week 6 at the Saints. New Orleans is No. 6 in most Fantasy points allowed to opposing tight ends, and the Saints have allowed three touchdowns to tight ends in the past two weeks against Dalton Kincaid and Theo Johnson (two). For the season, five tight ends have scored at least 9.2 PPR points against New Orleans, and Henry is worth using as a low-end starter in all leagues.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        SF\n                    \n                         \n                        San Francisco\n                    \n                                            • #88\n                                            \n                                            Age: 26\n                                                                        • Experience: 3 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    @\n                                \n                                \n                                    \n                                        TB\n                                    \n                                \n                                \n                                    TB -3.5\n                                    O/U 47.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS TE\n                                \n                                21st\n                            \n                                                                                                                                                                                                                        \n                                \n                                    TE RNK\n                                \n                                13th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                59%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    19\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    27\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    166\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    3\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    10.7\n                                \n                                                    \n                                    \n                    \n                    \n                George Kittle (hamstring) and Ricky Pearsall (knee) remain out for the 49ers in Week 6 against Tampa Bay, and we'll see what happens with Jauan Jennings (ankle). Even if Jennings plays, I expect Tonges to remain in a prominent role, and he had 10 catches for 99 yards and two touchdowns on 16 targets in his past two games against Jacksonville and the Rams. Tampa Bay has allowed four touchdowns to Dallas Goedert and A.J. Barner in the past two games, and Tonges should be considered a low-end No. 1 Fantasy tight end in all leagues in this matchup.\n            \n            \n\n\n    \n                    \n    \n                                        \n        \n                 \n                        LV\n                    \n                         \n                        Las Vegas\n                    \n                                            • #87\n                                            \n                                            Age: 24\n                                                                        • Experience: 3 yrs.\n                                                \n        \n    \n    \n        \n                            \n                                                                                                                    \n                            \n                                \n                                    Weekly Breakdown\n                                \n                            \n                        \n                                        \n                                                                                                                                \n                                                                    \n                                        MATCHUP\n                                    \n                                                                \n                                    vs\n                                \n                                \n                                    \n                                        TEN\n                                    \n                                \n                                \n                                    LV -4.5\n                                    O/U 41.5\n                                \n                            \n                                                                                                                                                                                                                        \n                                \n                                    OPP VS TE\n                                \n                                9th\n                            \n                                                                                                                                                                                                                        \n                                \n                                    TE RNK\n                                \n                                24th\n                            \n                                                        \n                                \n                                    ROSTERED\n                                \n                                3%\n                            \n                                            \n                \n                    \n        \n                \n                                            \n                            \n                                \n                                    YTD Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        REC\n                                    \n                                    6\n                                \n                                                            \n                                    \n                                        TAR\n                                    \n                                    7\n                                \n                                                            \n                                    \n                                        REYDS\n                                    \n                                    47\n                                \n                                                            \n                                    \n                                        TD\n                                    \n                                    0\n                                \n                                                            \n                                    \n                                        FPTS/G\n                                    \n                                    3.6\n                                \n                                                    \n                                    \n                    \n                    \n                Brock Bowers (knee) will miss his second game in a row for the Raiders in Week 6, but this will be the first game Mayer has played without Bowers this season since Mayer was out for the past two weeks with a concussion. Mayer looked good in Week 1 in tandem with Bowers against the Patriots with four catches for 38 yards on four targets, and he could be a significant part of the gameplan as the primary tight end against the Titans. I like Mayer as a streaming option in all leagues with Bowers out.\n            \n            \n\nDefense/Special TeamsColts (vs. ARI) Browns (at PIT) Raiders (vs. TEN)KickerWil Lutz (vs. NYJ) Mike Badgley (vs. ARI) Chris Boswell (vs. CLE)\n            \n    \n\n        \n\n    \n            \n    \n            \n\n                    \n         Now Playing \n                    \n    \n                                        \n            \n                        \n                                                            \n                                    \n    \n                                                                                                    \n                                    \n                                                                                    \n                                                                                                    Jamey's 2025 Week 6 Sleepers \n                                                                                            \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     1 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 6 PPR Cheat Sheet\n                                                                                                                                                \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     3 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 6 lineup decisions\n                                                                                                                                                \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     19 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 6 Start 'Em & Sit 'Em\n                                                                                                                                                \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     1 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                                                \n                    \n            \n                        "
  },
  {
    "title": "Cowboys RB Miles Sanders out for season with knee and ankle injuries; Jaydon Blue climbs depth chart - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-rb-miles-sanders-out-for-season-with-knee-and-ankle-injuries-jaydon-blue-climbs-depth-chart/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/e3127c75-78ab-4185-a357-0b9448821e21/thumbnail/1200x675/ca6d22a64f4501a682be7bc2d1aecbc9/adobe-express-file-18.jpg",
    "tag": "Sports",
    "date": "2025-10-10T22:22:57.000Z",
    "description": "Imagn Images                                    Dallas Cowboys running back Miles Sanders will miss the remainder of the season due to injury, Cowboys executive vice president Stephen Jones said Friday on...",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Dallas Cowboys running back Miles Sanders will miss the remainder of the season due to injury, Cowboys executive vice president Stephen Jones said Friday on 105.3 The Fan. The team will move Sanders to the season-ending injured reserve as he deals with knee and ankle issues. According to ESPN's Todd Archer, it is the knee ailment that will keep Sanders on the shelf for the rest of the year as he is set to undergo a chondral tissue graft surgery. It is the same procedure Cowboys cornerback Trevon Diggs had in January.Sanders did not play in Week 5 against the New York Jets, and while he attempted to practice on Wednesday, he left the session early. Sanders also missed time in training camp with a bruised knee and sat out of a preseason game with a shoulder issue.\"Unfortunately, at the end of the day, attrition will get you,\" Jones said. \"We just found out we're going to lose Sanders for the year, our running back. These things have a way of spots opening up.\"Sanders joined the Cowboys in March as a free agent. He signed a one-year deal after being cut by the Carolina Panthers two seasons into a four-year contract. Sanders enjoyed a prolific run with the Philadelphia Eagles before his Panthers tenure and for his career boasts 4,462 rushing yards and 24 touchdowns.\nJaydon Blue to climb Cowboys depth chartWhile Sanders' injury is a blow to the Cowboys' running back group, it does also provide an opportunity for rookie ballcarrier Jaydon Blue, who made his NFL debut last week in Sanders' absence. The Texas product and fifth-round pick handled four carries for seven yards but could see a larger role in the weeks to come.Javonte Williams remains the featured back in the Dallas offense and already has 447 yards and five touchdowns to his name this season. Blue will form a one-two-punch with the fifth-year veteran as the Cowboys seek to maintain the NFL's most productive offense by yardage.\n\"We're so fired up about what Jaydon Blue can do for this offense,\" Jones said. \"He's got rare explosiveness. I know Coach Schottenheimer and his offensive staff are going to certainly continue to figure out the best way to use him. I think he's really going to bring something to this offense at the running back position that we haven't had. As much as I respect and think a lot of Sanders, I think at the end of the day, Blue can really bring some more juice to this offense.\"\n            \n    "
  },
  {
    "title": "WWE Crown Jewel 2025 predictions, expert picks, card time, date - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-crown-jewel-2025-predictions-expert-picks-card-time-date/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/cce3eb82-0f3f-4fcd-856b-c385a8c63d69/thumbnail/1200x675/78189f30247bf6b477cb2ffcb195cb91/cody-rhodes-seth-rollins-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-11T00:00:48.000Z",
    "description": "On Saturday, WWE Crown Jewel takes place outside Saudi Arabia for the first time since the event's inception. This year's event will be held in Perth, Australia, though it will operate under the same format...",
    "body": "\n        On Saturday, WWE Crown Jewel takes place outside Saudi Arabia for the first time since the event's inception. This year's event will be held in Perth, Australia, though it will operate under the same format as last year's Crown Jewel.That means two headline matches featuring WWE's top champions. On the men's side, undisputed WWE champion Cody Rhodes will take on world heavyweight champion Seth Rollins. For the women, world champion Iyo Sky will face WWE women's champion Tiffany Stratton. The winners of those matches will win the ceremonial Crown Jewel championship, taking home a ring for their victory.In addition, John Cena returns for one of his final appearances when he takes on AJ Styles as the two revisit one of the promotion's top rivalries of the 2010s. Cena has been out of action since Wrestlepalooza and only has a handful of appearances booked through the end of the year, when he is expected to retire. Styles, meanwhile, also recently said he expects to retire by the end of 2026.Plus, roman Reigns makes his return to a PPV card when he takes on Bronson Reed in n Australian Street Fight. And Asuka and Kairi Sane are set to team up and face Iyo Sky and Rhea Ripley.\n\n        \n            \n                John Cena admits his WWE heel turn failed: 'I went out there and bombed'\n                \n                    Shakiel Mahjouri                \n            \n                            \n    \n                \n                    \n    \nWith so many big matches set for the event, let's take a look at what the CBS Sports pro wrestling experts think will happen when the action goes down in Perth.2025 WWE Crown Jewel predictionsMen's Crown Jewel Championship -- Cody Rhodes vs. Seth Rollins: The Crown Jewel stipulation is tailor-made for Rhodes to lose. It's meaningless in the grand scheme of things. Rhodes solidified himself as a top draw by repeatedly beating Rollins upon his return to WWE. It's about time Rollins got one over on \"The American Nightmare.\" On Raw, CM Punk teased that he respects Rhodes too much to get involved in his business, suggesting The Vision's numbers game could get the better of the son of a son of a plumber. Pick: Seth Rollins wins -- Shakiel MahjouriMaybe I lean too heavily into what would be most interesting rather than what WWE is likely to do. Rhodes having Rollins' number and causing a crisis of confidence for The Vision's leader is interesting; Rollins winning with the assistance of Bronson Reed and Bron Breakker is not. Similarly, Rollins winning on his own doesn't really do much for how the story of The Vision is being constructed. Paul Heyman already sent a message to Rollins that a loss was unacceptable and would make him question the decision to back Rollins over Roman Reigns. Would Breakker be content to sit behind a man who can't get the job done against Rhodes? The most interesting option is for Rhodes to win, so that's what WWE should do. Pick: Cody Rhodes wins -- Brent Brookhouse\nWomen's Crown Jewel Championship -- Tiffany Stratton vs. Stephanie Vaquer: Vaquer is a fresh champion who needs to continue building credibility as a main event-level star. Stratton has had a good run with her title, so a loss isn't particularly damaging in the same way it would be for Vaquer. That makes for some pretty simple math that just says to give Vaquer the victory. Pick: Stephanie Vaquer wins -- Brookhouse (also Mahjouri)John Cena vs. AJ Styles: Cena vs. Styles is the most deserving farewell tour match requiring the least storyline build. They had shockingly great matches at the height of their rivalry. That's enough to warrant one last tango. It's just a shame most of Cena's retirement tour has been half-baked. Cena's loss to Brock Lesnar at Wrestlepalooza really deflated fans. It's unlikely he takes another clean loss with his final match fast approaching. Styles, who recently said he'd retire next year, doesn't have much to gain by beating Cena. All anyone wants to see is one more solid outing from one of the most surprising hit feuds in WWE history. Pick: John Cena wins -- Mahjouri (also Brookhouse)Roman Reigns vs. Bronson Reed: Reigns matches are so rare that it makes the results fairly predictable. Reed has been around to give Reigns someone he can defeat to stay around the title picture without actually being in it. It's hard to imagine Reed being given a win over Reigns. What purpose would that serve? To set up a third Reigns vs. Reed match? That doesn't seem like a good way to use Reigns moving forward. That should mean a win for Reigns so he can move on to Breakker. Pick: Roman Reigns wins -- Brookhouse (also Mahjouri)\nRhea Ripley & Iyo Sky vs. The Kabuki Warriors (Asuka & Kairi Sane): Ripley and Sky are bigger stars than The Kabuki Warriors. Plain and simple. It doesn't seem WWE has much planned long-term for the villainous duo, at least not enough to give them a win over two of the women's division's biggest stars. This match is mostly an excuse to get Ripley in front of her home fans. Expect \"Mami\" to pick up a big win for her fellow Aussies. Pick: Rhea Ripley & Iyo Sky win -- Mahjouri (also Brookhouse)\n            "
  },
  {
    "title": "Brother of Nikola Jokić pleads guilty to punching fan during 2024 Nuggets playoff game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/brother-of-nikola-jokic-pleads-guilty-to-punching-fan-during-2024-nuggets-playoff-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/46fdc3dc-6dd9-4563-b357-53e2f850c1ac/thumbnail/1200x675/524a638e6ae10c12d5ce49edebfec477/strahinja-jokic-g-1.jpg",
    "tag": "Sports",
    "date": "2025-10-10T21:45:45.000Z",
    "description": "Getty Images                                    Strahinja Jokić, the older brother of Denver Nuggets star Nikola Jokić, pleaded guilty Friday to charges stemming from a fight that occurred during an NBA...",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Strahinja Jokić, the older brother of Denver Nuggets star Nikola Jokić, pleaded guilty Friday to charges stemming from a fight that occurred during an NBA playoff game in April 2024. He pleaded guilty to one count of trespassing and one count of disorderly conduct. He was sentenced to one year of probation.The incident drew widespread attention after a short video of the altercation circulated on social media following the Nuggets' Game 2 win against the Los Angeles Lakers last postseason. The clip, which was later cited in a police statement of probable cause, appeared to show a verbal exchange between the Jokić brothers and a fan before one of the brothers struck the man in the face.\nInvestigators identified Strahinja Jokić as the person who threw the punch. According to police documents, he told officers he \"felt he'd done nothing wrong because he was 'defending an older man that he has known for a long time.'\"The older Jokić was initially charged with third-degree assault but ultimately pleaded guilty to lesser offenses as part of a resolution to the case. The incident did not involve his younger brother, Nikola, who was on the court at the time of the playoff game.\nJokić's older brothers, Strahinja and Nemanja, are regular fixtures courtside at Nuggets games and have been protective presences throughout Nikola's career. It's not the first time Strahinja has faced legal trouble in Denver. In 2019, he was arrested for allegedly choking and pushing a woman during an altercation inside an apartment. He was charged with second-degree assault, false imprisonment and obstruction of phone service, later pleading guilty in 2020 to felony trespassing and a misdemeanor count of obstruction. The remaining charges were dismissed.The Jokić brothers have also been involved in several public incidents tied to Nikola's on-court altercations. In 2021, they traded social media messages with NBA players Marcus Morris and Markieff Morris after a scuffle between Nikola and Markieff during a game against the Miami Heat. That same year, video surfaced of Strahinja and Nemanja shouting at Phoenix Suns players from the stands following a hard foul involving Nikola during the playoffs.\nWhile Nikola Jokić has largely stayed clear of controversy, his brothers' passionate support has at times drawn attention away from the three-time MVP's dominance on the court.\n            \n    "
  },
  {
    "title": "Use FanDuel promo code, get $300 bonus bets for Tigers-Mariners, South Florida-North Texas betting on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-fanduel-promo-code-get-300-bonus-bets-tigers-mariners-south-florida-north-texas-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-10T21:12:10.000Z",
    "description": "Game 5 of the ALDS takes center stage as the Detroit Tigers and Seattle Mariners collide on Friday at 8:08 p.m. ET, providing new users an opportunity to use the latest FanDuel promo code, which offers new...",
    "body": "\n        Game 5 of the ALDS takes center stage as the Detroit Tigers and Seattle Mariners collide on Friday at 8:08 p.m. ET, providing new users an opportunity to use the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. The Tigers are -118 moneyline favorites, according to the latest MLB odds at FanDuel Sportsbook, while the over/under for total runs scored is 6.SportsLine's model is projecting the over to cash in 62% of simulations. The model's best bets also include the over for total points (66.5) in South Florida vs. North Texas, which hits in 59% of simulations. Meanwhile, SportsLine's model is also backing Colorado State (+6.5) to cover the spread against Fresno State. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best Friday picksTigers vs. Mariners: Over 6 total runs (-110)South Florida vs. North Texas: Over 66.5 total points (-115)Colorado State (+6.5) vs. Fresno State (-110) Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +563 (risk $100 to win $563). Bet it at FanDuel here:Tigers vs. Mariners: Over 6 total runs (-110)These teams have scored over 5.5 total runs in the last two games of the series. During the regular season, these teams were neck and neck in terms of runs scored. The Mariners ranked 10th (4.71) and the Tigers were 11th (4.64) in team runs per game. The model expects these teams will combine for 8.2 total runs and has the over cashing in 66% of simulations.  South Florida vs. North Texas: Over 66.5 total points (-115)South Florida is averaging 40.6 total points per game, as senior quarterback Byrum Brown is making plays with his arm and legs. Brown has 1,194 passing yards and 10 passing touchdowns. He's also leading the team in rushing yards (282) with three rushing scores. North Texas is logging 44.8 points per game, and freshman quarterback Drew Mestemaker completed 67% of his passes for 1,247 passing yards with 11 touchdowns and zero interceptions. SportsLine's model predicts these teams will combine for 73 total points and has the over cashing in 59% of simulations. Bet it at FanDuel now:Colorado State (+6.5) vs. Fresno State (-110)This Mountain West contest features two teams that have been playing since 1992. Colorado State leads the all-time series 10-6, with the Rams winning three of the last five games. This season, Colorado State is 2-1 ATS as the underdog. Meanwhile, Fresno State is 0-2 ATS in conference games. SportsLine's model predicts that Colorado State covers the spread in 55% of simulations. Bet it at FanDuel here:Want more CFB picks?You've seen the model's best bets for Friday. Now, get against the spread, total and money-line picks for every CFB game here, all from the model that's simulated every game 10,000 times. \n            "
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus for Mariners vs. Tigers, college football on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/betmgm-bonus-code-cbssports-150-bonus-mariners-tigers-college-football-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-10T21:08:29.000Z",
    "description": "The sports calendar is filling up and it's an ideal time to use BetMGM bonus code CBSSPORTS, which offers up to $1,500 in bonus bets if your first bet loses or $150 in bonus bets if your first $10 wager wins....",
    "body": "\n        The sports calendar is filling up and it's an ideal time to use BetMGM bonus code CBSSPORTS, which offers up to $1,500 in bonus bets if your first bet loses or $150 in bonus bets if your first $10 wager wins. The 2025 MLB Playoffs continue on Friday with a Game 5 in the ALDS between the Mariners and Tigers at 8:08 p.m. ET. Then there are also three games on the Friday college football schedule, including a huge AAC matchup between North Texas and No. 24 South Florida at 7:30 p.m. ET and a Big Ten battle between Washington and Rutgers at 9 p.m. ET.Picks from two of those games are among our Friday college football and MLB best bets on BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every game 10,000 times. The model is on a sizzling 41-21 run on top-rated NFL picks dating back to 2024. It also entered the second week of the 2025 MLB playoffs a profitable 35-29 on top-rated MLB money-line picks this season and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its betting picks at sportsbooks and on betting sites could have seen strong returns.  Best Friday CFB and MLB predictions at BetMGMNorth Texas -2.5 vs. South Florida (-105)Mariners +100 vs. TigersColorado State +6.5 vs. Fresno State (-110)Combining these three picks into a Friday college football and MLB parlay at BetMGM would result in a payout of +647 (risk $100 to win $647). Bet it at BetMGM here:North Texas -2.5 vs. South Florida (-105)The Bulls are the ranked team in this matchup but North Texas was in the \"others receiving votes\" category of the AP Top 25 and is off to a perfect 5-0 start with a signature 59-10 beatdown of Washington State. Eric Morris is clearly finding traction in his third season, as the Mean Green rank eighth in FBS in scoring (44.8 ppg) entering the week. Meanwhile, South Florida also had a signature win over Florida, but that might have been more about the Gators (2-3). The model has North Texas covering in 64% of simulations.Mariners +100 vs. Tigers\"This game represents a potential redemption opportunity for Tarik Skubal, who struggled in last year's Game 5 against Cleveland, allowing five runs in a crushing defeat. The Mariners have solved Tarik Skubal three times in four tries this season, including twice at home. His 5.91 ERA is the highest against any team with a minimum of 10 innings pitched this season,\" SportsLine handicapper Jeff Hochman said. \"Seattle has thrived at T-Mobile Park with a 100-62 record over the past two seasons - the third-best home mark in baseball. George Kirby has always pitched better at home (3.10 ERA) than on the road (4.14) over his four-year career. Skubal is a \"beast\" who has logged 209.3 IP this season. Give me the home underdog in this winner-take-all affair.\"Colorado State +6.5 vs. Fresno State (-110)Colorado State is desperate to turn its season around after losing four of its first five games. The Rams are coming off their highest-scoring game of the campaign, racking up 24 points against San Diego State last week. Freshman running back Jalen Dupree had 103 rushing yards on 16 carries, averaging 6.4 yards per carry. Fresno State narrowly escaped with a 23-21 win at Hawaii in its most recent road game. The model predicts Colorado State covers in 55% of simulations.Want more CFB and MLB picks for Friday, October 10?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for every NFL game on the Week 6 schedule, all from the model that's simulated every game 10,000 times. Also at SportsLine:You can also see weekend MLB picks from legendary handicapper Bruce Marshall, who is 172-157-3 (+3061) over his last 332 MLB picks. See his best bets right here. \n            "
  },
  {
    "title": "WWE Crown Jewel 2025: Start time, where to watch and live stream tonight - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-crown-jewel-2025-start-time-where-to-watch-and-live-stream-tonight/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/2ecf8f8a-501e-4884-8f4e-ab9e2dea0f97/thumbnail/1200x675/87a622a32d905b2d29cd87538cb78892/stephanie-vaquer-tiffany-stratton-wwe-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-11T09:00:47.000Z",
    "description": "WWE                                    WWE Crown Jewel goes down on Saturday from RAC Arena in Perth, Australia. This year's edition of the event will be the first time a Crown Jewel card has been held...",
    "body": "\n    \n    \n                    \n                WWE\n            \n            \n    \n        WWE Crown Jewel goes down on Saturday from RAC Arena in Perth, Australia. This year's edition of the event will be the first time a Crown Jewel card has been held outside of Saudi Arabia.The symbolic Crown Jewel championship will be on the line for both the men and the women. For the men, it will be undisputed WWE champion Cody Rhodes against world heavyweight champion Seth Rollins. On the women's side, women's world champion Stephanie Vaquer will take on WWE women's champion Tiffany Stratton.In other big matches scheduled for the card, John Cena will make one of the final stops on his retirement tour when he faces old rival AJ Styles, while Roman Reigns will battle Bronson Reed in an Australian Street Fight.Finally, former women's world champions Iyo Sky and Rhea Ripley will team together to face Sky's former friends, Asuka and Kairi Sane of The Kabuki Warriors.\n\n        \n            \n                WWE Crown Jewel 2025 predictions, start time, card, matches, expert picks, date for event in Australia\n                \n                    Brent Brookhouse                \n            \n                            \n    \n                \n                    \n    \nThe action goes down in the morning for fans in the United States, meaning you'll have to get up early to catch the action live.Below is how you can catch all the action on Saturday morning.\nWatch 2025 WWE Crown JewelDate: Saturday, Oct. 11Location: RAC Arena -- Perth, AustraliaStart time: 8 a.m. ETWatch live: ESPN Unlimited (subscription required)2025 WWE Crown Jewel match cardMen's Crown Jewel Championship -- Cody Rhodes vs. Seth RollinsWomen's Crown Jewel Championship -- Stephanie Vaquer vs. Tiffany StrattonJohn Cena vs. AJ StylesRhea Ripley & Iyo Sky vs. The Kabuki Warriors (Asuka & Kairi Sane)Roman Reigns vs. Bronson Reed (Australian Street Fight)\n            \n    "
  },
  {
    "title": "NFL DFS picks, lineup advice from proven daily Fantasy optimizer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-optimizer-strategy-week-6-lineup-advice-draftkings-fanduel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/09/b5703d46-087b-4966-9a4f-2f44d47e58cb/thumbnail/1200x675/f84293bc837d220992127f07e9c4b953/dak-prescott-cowboys-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-10T22:23:03.000Z",
    "description": "Developing a successful NFL DFS strategy can take many forms, but one of the most common approaches is focusing on games with the highest projected point totals when identifying top NFL DFS picks and building...",
    "body": "\n        Developing a successful NFL DFS strategy can take many forms, but one of the most common approaches is focusing on games with the highest projected point totals when identifying top NFL DFS picks and building NFL DFS stacks.The highest over/under in the NFL odds for the Sunday main slate is 49.5 in the Cowboys vs. Panthers matchup. Other potential high-scoring matchups on Sunday include 49ers vs. Buccaneers, Seahawks vs. Jaguars, and Colts vs. Cardinals. Thus, you can expect stars like Dak Prescott, Tetairoa McMillan, Christian McCaffrey and Jonathan Taylor to be core players in many NFL DFS lineups. Players of that caliber, however, will set back your NFL DFS salary cap, forcing you to search for more potential NFL DFS sleepers and NFL DFS values. Should players like Daniel Jones or Baker Mayfield find their way into your quarterback slot for Sunday's main slate? Will underperforming players like Ja'Marr Chase and Tee Higgins finally live up to their price tags on NFL DFS sites? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, where they can pick at Underdog and get $100 in site credits after making a $5 wager:The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool for sports betting apps.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 6 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 6 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is Cowboys quarterback Dak Prescott ($6,500 on DraftKings and $8,000 on FanDuel). The former fourth-round pick out of Mississippi State had his 2024 season shortened by injury, but he still managed to throw for 1,978 yards with 11 touchdowns and eight interceptions in eight games, finishing with an 86.0 passer rating. In 2025, he has rebounded with one of his most efficient starts in years.Through five weeks, Prescott has 1,356 passing yards, 10 touchdowns, and just three interceptions. The 32-year-old has regained his rhythm as the leader of the Cowboys' offense, showcasing improved decision-making and accuracy. His ability to extend plays and deliver under pressure has been a major factor in keeping Dallas competitive early in the season. See who else to pick here.The optimizer's NFL DFS strategy also includes rostering Rams running back Kyren Williams ($6,300 on DraftKings and $8,400 on FanDuel). The former fifth-round pick out of Notre Dame burst onto the 2024 season as the Rams' every-down workhorse, carrying the ball 316 times for 1,299 yards and scoring 14 rushing touchdowns, while also adding 34 catches for 182 receiving yards. His volume and versatility marked him as one of L.A.'s most reliable offensive weapons. In 2025, he's off to a another solid start. Through five weeks, he's already logged 82 carries for 368 yards (4.5 yards per carry) with one rushing score, and chipped in as a receiver with 16 catches for 118 yards and three receiving touchdowns. Despite sharing some of the workload with Blake Corum, Williams remains the focal point of the backfield and has even secured a three-year, $33 million contract extension from the Rams. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to build Sunday Week 6 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            "
  },
  {
    "title": "Jaron 'Boots' Ennis vs. Uisma Lima fight predictions, odds, undercard, preview, start time, where to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jaron-boots-ennis-vs-uisma-lima-fight-predictions-odds-undercard-preview-start-time-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/5e47c110-a17b-4525-8482-89fbdcb9c594/thumbnail/1200x675/e4b1ff7182ae32576c3be3162f548527/jaron-boots-ennis-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-10T21:53:24.000Z",
    "description": "Jaron \"Boots\" Ennis returns to the ring on Saturday at Xfinity Mobile Arena in Philadelphia, looking to continue his ascent as one of boxing's top American stars. While Ennis is facing Uisma Lima, much of the...",
    "body": "\n        Jaron \"Boots\" Ennis returns to the ring on Saturday at Xfinity Mobile Arena in Philadelphia, looking to continue his ascent as one of boxing's top American stars. While Ennis is facing Uisma Lima, much of the attention during fight week has been on a potential fight between Ennis and Vergil Ortiz in 2026.Understandably, many are overlooking Lima (14-1, 10 KO) as a legitimate challenge to Ennis (34-0, 30 KO). After all, Lima's toughest fight came in 2023 against Aaron McKenna in a bout McKenna won by a near shutout on the scorecards. While Lima, an Angolan fighter competing out of Portugal, has traveled the world picking up solid wins in Germany, Canada and South Africa since that defeat, Ennis represents an entirely different level of opposition from the likes of Shervantaigh Koopman.The real drama in this fight comes from Ennis fighting at junior middleweight for the first time in his career. Ennis had fought to the top of the welterweight division, capturing the IBF and WBA world titles before making the decision to move up to 154 pounds.Lima is a legitimate 154-pound fighter, having long plied his trade in the division. Lima's time in the division makes him a fair opponent for Ennis' first fight at the weight, but expectations are for Ennis, a -3000 favorite, to get the win before attention shifts to the potential fight with Ortiz.Ennis' promoter, Eddie Hearn of Matchroom Boxing, recently told ESPN that both sides want to get the fight done.\n\"We want the biggest fights after Saturday, and for me, the one that makes the most sense and the one that has been negotiated is Vergil Ortiz,\" Hearn said. \"We sat in a room with Golden Boy and DAZN, we worked out the deal structure, and in his deal extension with us Boots signed for that fight with Ortiz.\"Hearn went on to say that Golden Boy told him they wanted Ortiz to get through his fight against Erickson Lubin on Nov. 8 before negotiating terms for a fight with Ennis.Let's take a look at the rest of the card with the latest odds from DraftKings Sportsbook before getting to a prediction and expert pick on the main event.\nEnnis vs. Lima fight card, oddsJaron Ennis -3000 vs. Uisma Lima +1200, junior middleweightsAlexis Barriere -125 vs. Guido Vianello +100, heavyweightsTahmir Smalls -800 vs. Jose Roman Vazquez +500, welterweightsPredictionThere are always some questions when a fighter moves to a new weight class. Ennis' skills do appear as though they'll translate just fine moving up to 154 pounds. He's technically solid, strong and with good power. Lima is a solid fighter who should be able to give Ennis plenty of rounds as an intro to junior middleweight, but likely not much more. Then again, with Philadelphia is reeling after the Eagles, Flyers and Phillies all lost on Thursday, can Ennis break the curse for his hometown fans? Yes, he can -- and will, likely becoming the first man to stop Lima. Pick: Jaron Ennis via TKO8\n            "
  },
  {
    "title": "Washington vs. Rutgers predictions, odds, Friday college football picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/washington-rutgers-prediction-odds-line-2025-college-football-week-7-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/28894795-5ff3-4743-b5e6-cdcc034d4ce5/thumbnail/1200x675/4842a871252ad2cc2cf6b24d5ae49ed5/demond-williams-washington-huskies-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-10T22:00:45.000Z",
    "description": "The Washington Huskies look to win their second game in a row when they take on the Rutgers Scarlet Knights in Big Ten action on Friday night. Rutgers is coming off a 31-28 loss at Minnesota on Sept. 27,...",
    "body": "\n        The Washington Huskies look to win their second game in a row when they take on the Rutgers Scarlet Knights in Big Ten action on Friday night. Rutgers is coming off a 31-28 loss at Minnesota on Sept. 27, while Washington defeated Maryland 24-20 last Saturday. The Scarlet Knights (3-2, 0-2 Big Ten), who have lost two in a row, are 0-1 on the road this season. The Huskies (4-1, 1-1 Big Ten), who are 4-0 against unranked opponents, are 2-1 on their home field in 2025.Kickoff from Husky Stadium in Seattle is at 9 p.m. ET. Washington leads the all-time series 2-1, with Rutgers winning 21-18 last year. The Huskies are 10-point favorites in the latest Rutgers vs. Washington odds, while the over/under for total points scored is 61.5 via SportsLine consensus. Before making any Washington vs. Rutgers picks, check out the college football predictions from the SportsLine Projection Model. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Rutgers vs. Washington. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Washington vs. Rutgers:Rutgers vs. Washington                                                 spreadWashington -10 at DraftKings SportsbookRutgers vs. Washington                                                           over/under61.5 pointsRutgers vs. Washington                                                           money line Washington -397, Rutgers +313Rutgers vs. Washington                                                   picksSee picks at SportsLineRutgers vs. Washington                                                     streaming Fubo (Try for free)  Why Washington can coverSophomore quarterback Demond Williams Jr. is off to red-hot start to his season. In five games, he has completed 96 of 131 passes (73.3%) for 1,226 yards and eight touchdowns with one interception. He has also carried 61 times for 246 yards and two touchdowns. In last week's 20-point rally to defeat Maryland, he completed 28 of 41 passes (68.3%) for 275 yards and two touchdowns with one interception.Senior running back Jonah Coleman powers the Washington ground attack. In five games, he has carried 82 times for 474 yards (5.8 average) and 10 touchdowns. He also has 19 receptions for 223 yards (11.7 average) and one touchdown. In a 70-10 win over UC-Davis on Sept. 6, he carried 15 times for 111 yards (7.4 average) and five touchdowns. See which team to back at SportsLine. Why Rutgers can coverSenior quarterback Athan Kaliakmanis is in his second season with the Scarlet Knights after playing two seasons at Minnesota. In five games this year, he has completed 107 of 159 passes (67.3%) for 1,399 yards and nine touchdowns with two interceptions. He has also rushed for two touchdowns. In last week's loss to Minnesota, he completed 21 of 34 passes (61.8%) for 249 yards and two touchdowns with one interception.Sophomore running back Antwan Raymond is another key to the Rutgers offense. In five games this season, he has carried 87 times for 471 yards (5.4 average) and nine touchdowns. He also has four receptions for 42 yards, including a long of 17. In the loss to the Gophers, he carried 26 times for 161 yards (6.2 average) and two touchdowns. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Rutgers vs. Washington picksSportsLine's model is going Under on the total, projecting 56 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Washington vs. Rutgers, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Rutgers vs. Washington spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            "
  }
]