[
  {
    "title": "Computer model locks in Broncos vs. Texans picks, score prediction, SGP for NFL Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-texans-where-to-watch-nfl-week-9-betting-odds-score-prediction-sportsbook-promos-apps-sgp/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/e8c9db2e-4719-443a-9cc8-8bd0ae216134/thumbnail/1200x675/b8352ffd6f2f1a0accee77c7da8476e9/bo-nix-j-k-dobbins-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-01T20:27:27.000Z",
    "description": "\n        Two playoff teams from last season meet up in Week 9 action as the Houston Texans host the Denver Broncos. Houston got off to a slow start to",
    "body": "\n        Two playoff teams from last season meet up in Week 9 action as the Houston Texans host the Denver Broncos. Houston got off to a slow start to the year, especially on offense, and finds itself 3-4 entering this matchup with the Broncos. Denver is 6-2, good for first place in a loaded AFC West thanks to a five-game win streak that includes three one-score victories. Kickoff from NRG Stadium is set for 1 p.m. ET, and the Texans are 1.5-point favorites, according to the latest Broncos vs. Texans odds. The over/under for total points scored is 39.5. The Texans are -126 money line favorites (risk $126 to win $100), while the Broncos are +106 underdogs (wager $100 to win $106). Before you make any Broncos vs. Texans picks, make sure to check out what the SportsLine Projection Model has to say. Click here to bet Broncos vs. Texans at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Broncos vs. TexansBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  Just click hereWhere to watch Broncos vs. Texans on SundayWhen: Sunday, Nov. 2Time: 1 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppBroncos vs. Texans betting previewOdds: Texans -1.5, over/under 39.5The Texans have been Under machines this year, with that side of the total hitting in five of their seven games. Houston's offense has been better of late, scoring 26 or more points in three of its last four games, but combine an inconsistent offense with one of the best defenses in the NFL and you get the recipe for a lot of Unders. Denver has also leaned towards the Under this year, with that side hitting in five of eight games. The Broncos had arguably the best defense in the league last year, and while that unit isn't quite as dominant, it still ranks in the top five of yards and points allowed per game. Click here to bet Broncos vs. Texans at FanDuel Sportsbook, where new users get $300 in bonus bets if their first bet of at least $5 wins:Broncos vs. Texans SGPUnder 39.5 (-105, DraftKings)Broncos +1.5 (-108, DraftKings)J.K. Dobbins anytime touchdown (+175, DraftKings)Final odds: +934 at DraftKings (wager $100 to win $934)Model's Broncos vs. Texans score prediction, picksGiven both of these teams' leaning Under all season long, it's not too much of a surprise to see that the SportsLine Projection Model, which simulates every NFL game 10,000 times, is leaning that way as well. The Under hits in nearly 60% of model simulations despite this being the lowest total of the entire Week 9 slate. Both defenses rank in the top five in yards and points allowed per game this year. Broncos vs. Texans score prediction: Texans 19, Broncos 18Want more Week 9 NFL picks?You've seen the model's best bets for Denver Broncos vs. Houston Texans. Now, get against the spread, total and money-line picks for every Week 9 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Broncos vs. Texans picks, score prediction, SGP for NFL Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/e8c9db2e-4719-443a-9cc8-8bd0ae216134/thumbnail/1200x675/b8352ffd6f2f1a0accee77c7da8476e9/bo-nix-j-k-dobbins-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2025-11-01T20:27:27.000Z",
      "dateModified": "2025-11-01T20:27:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC Fight Night results: Steve Garcia batters David Onama for first-round TKO - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-results-steve-garcia-david-onama-first-round-knockout/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/2851f439-811b-4273-b2f4-200b300a7d5e/thumbnail/1200x675/0c04c4a592a220d2b2e8dd70aee34ddd/steve-garcia-ufc-winner.jpg",
    "tag": "Sports",
    "date": "2025-11-02T02:07:34.000Z",
    "description": "\n        If the UFC featherweight division is looking for a new contender, veteran Steve Garcia just put his name in the hat. The 33-year-old Garcia e",
    "body": "\n        If the UFC featherweight division is looking for a new contender, veteran Steve Garcia just put his name in the hat. The 33-year-old Garcia extended his win streak to seven, including six by stoppage, with a ferocious first-round TKO of David Onama in a battle of top-15 ranked fighters at 145 pounds on Saturday. The fight served as the main event of a UFC Fight Night card from the UFC Apex in Las Vegas. Garcia (19-5), a native of Albuquerque, New Mexico, made quick work of his first headlining opportunity by jumping all over Onama (14-3) early in this matchup of southpaws with volume punching and combinations.  \"Again, I said this before, my dad [trainer Steve Garcia Sr.] told me to be violent in here, so that's what he got,\" Garcia said. \"My dad asked me, so I tried to deliver.\"\nGarcia briefly dropped Onama early with a clean left hand and never backed off applying pressure as his wobbled foe struggled to take shelter. A pair of uppercuts briefly dropped Onama a second time along the cage before Garcia backed him up again with kicks to the body. Shortly after, Garcia scored a third knockdown with more clean punches and jumped all over the fallen Onama, a 31-year-old from Uganda, with ground-and-pound until referee Herb Dean stopped the fight at 3:34 of Round 1. \n\"In here, this is kill or be killed. That's, at least, how I do it,\" Garcia said. \"I was telling [Onama] inside the cage, 'I'm going to get you so you better be ready.' I don't get paid by the hour, I get paid by the minute so I make sure I finish my opponents if it presents itself.\"\nGarcia's win streak comes after having lost two of his first three UFC fights. Not only does Garcia have 15 knockouts in 19 pro wins, he recorded the eighth first-round finish of his 12-year career. \"I'm a kid from Albuquerque who didn't have a lot going on in his life,\" Garcia said. \"I had a prayer when I was 15 years old and today was one of my answers. I wanted to make something of myself. I came to UFC and went on this long fight streak. I asked God to make me something and told him I would do the work. He's the most consistent thing in my life and I couldn't do this without him.\"Onama snapped a four-fight win streak as he suffered his first defeat since an all-action majority decision loss to Nate Landwehr in 2022.\nAfter the fight, Garcia looked to make a big splash by calling out an elite name and former champion from one division above.  \"I'm going to throw a little curveball in there. I want the Rocky Balboa story and I want Max Holloway for the BMF title,\" Garcia said.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night results: Steve Garcia batters David Onama for first-round TKO - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/2851f439-811b-4273-b2f4-200b300a7d5e/thumbnail/1200x675/0c04c4a592a220d2b2e8dd70aee34ddd/steve-garcia-ufc-winner.jpg"
      ],
      "datePublished": "2025-11-02T02:07:34.000Z",
      "dateModified": "2025-11-02T02:07:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inter Miami vs. Nashville SC: MLS Cup Playoff matchup set for decisive Game 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/lionel-messi-inter-miami-nashville-sc-result-mls-cup-playoffs-game-2/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/1d50f7d0-18ee-4d39-8329-cad4baccad5c/thumbnail/1200x675/d091b380245705faeff05aa704d75530/messi-6.jpg",
    "tag": "Sports",
    "date": "2025-11-02T02:18:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After an embarrassing first-round elimination in t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After an embarrassing first-round elimination in the MLS Cup Playoffs last season, Inter Miami find themselves in the exact same tricky situation. A year after their shock elimination to Atlanta United in the opening round, the Herons will go to a decisive Game 3 for a second straight year in their opening series, this time facing Nashville SC. Inter Miami fell 2-1 in Game 2 on Saturday night in Tennessee.A 3-1 win in Game 1 saw all the momentum shift to Lionel Messi and company after the Argentine scored two goals. But with the rain coming down in Nashville, a slow start doomed Javier Mascherano's side, who gave the hosts a penalty kick within the first 10 minutes and conceded again right before halftime. Messi, who just signed a contract extension with the club, did scored a late consolation goal, but it won't matter ahead of their Friday night meeting in Fort Lauderdale for Game 3.Both teams finished with 10 shots, with Nashville putting five on target. Inter Miami put four of theirs on target and completed 226 more passes than the hosts, who defended well with their physicality and were able to see out the game with patience passing and quality spacing, not letting Miami's aging attackers to do much.\nAnother first-round elimination would mean a serious blow to the Herons' plans and Mascherano's tenure as coach, having fully expected to claim an MLS Cup this season with their high-powered attack, boosted by the summer addition of Argentina international Rodrigo de Paul. Last season, the club moved on from Tata Martino shortly after the loss to Atlanta United. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inter Miami vs. Nashville SC: MLS Cup Playoff matchup set for decisive Game 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/1d50f7d0-18ee-4d39-8329-cad4baccad5c/thumbnail/1200x675/d091b380245705faeff05aa704d75530/messi-6.jpg"
      ],
      "datePublished": "2025-11-02T02:18:28.000Z",
      "dateModified": "2025-11-02T02:18:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dylan Raiola injury: Nebraska QB exits game vs. USC with ankle issue - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/dylan-raiola-ankle-injury-nebraska-qb-exits-game-vs-usc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/11c9699e-8d73-4146-854a-c32cb09bd334/thumbnail/1200x675/4089cddbf94ab4dd841ea52b232cd144/untitled-design-77.png",
    "tag": "Sports",
    "date": "2025-11-02T02:16:52.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Nebraska star quarterback Dylan Raiola exited in t",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Nebraska star quarterback Dylan Raiola exited in the third quarter of Saturday's game against USC and did not return on his team's next offensive possession. Raiola appeared to suffer an ankle injury on the play where he was sacked -- which led to a fumble recovery by USC.Raiola's backup, TJ Lateef, a former three-star prospect in the 2025 recruiting cycle by 247Sports, replaced Raiola. Before exiting the game, Raiola completed 10 of 15 attempts for 91 yards and a touchdown. The Cornhuskers opened the game with an impressive 14-play drive that was capped with a 14-yard touchdown pass from Raiola to Dane Key.Here is the play in which Raiola suffered the injury.\nRaiola, a five-star quarterback from the 2024 recruiting cycle in the 247Sports rankings, has Nebraska off to a 6-2 start in his second season with the program. During the 2024 campaign, Raiola threw for 2,819 yards and 13 touchdowns. He led the program to a 7-6 record and a win over Boston College in the Pinstripe Bowl.\nComing into the weekend, Raiola had thrown for 1,909 yards and 17 touchdowns to just six interceptions. He has thrown at least one touchdown pass in eight of Nebraska's nine games this season.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dylan Raiola injury: Nebraska QB exits game vs. USC with ankle issue - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/11c9699e-8d73-4146-854a-c32cb09bd334/thumbnail/1200x675/4089cddbf94ab4dd841ea52b232cd144/untitled-design-77.png"
      ],
      "datePublished": "2025-11-02T02:16:52.000Z",
      "dateModified": "2025-11-02T02:16:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sherrone Moore buyout, contract details as Michigan football coach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/sherrone-moore-buyout-contract-michigan-football-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/f1d1d92f-6c09-41d6-aabc-aa7c99529abf/thumbnail/1200x675/5de9ce00c564e197f55653a378e86598/sherrone-moore.jpg",
    "tag": "Sports",
    "date": "2025-11-02T01:42:52.000Z",
    "description": "\n        Sherrone Moore's tenure as Michigan's coach has featured some incredible highs, most notably a pair of victories over hated rival Ohio State,",
    "body": "\n        Sherrone Moore's tenure as Michigan's coach has featured some incredible highs, most notably a pair of victories over hated rival Ohio State, but the Wolverines have also struggled to make themselves legitimate contenders in the Big Ten due to an offense that hasn't been up to par. Given Moore is an offensive coach, that's a considerable concern for Michigan fans who haven't been impressed by their output in big games. Their early road losses this season at Oklahoma and USC saw the Wolverines' offense sputter, scoring just 13 points in each contest. The 6-2 Wolverines won by 11 against arch-rival Michigan State last week and are currently in a dogfight with Purdue at home. Michigan is a 21.5-point favorite vs. Purdue. With star freshman Bryce Underwood now under center, the expectation for a more explosive passing attack hasn't materialized in their biggest games, and the temperature has steadily risen for Moore's seat in Ann Arbor. That hit a fever pitch on Saturday night when the Wolverines found themselves locked in a defensive struggle at home with a Purdue team that hasn't won a Big Ten game since 2023. Another poor offensive performance led to Wolverines fans wondering if it might be time to make a change, and the cost to do so wouldn't be anything close to what we've seen a number of other big programs shell out to get rid of a coach this season. Sherrone Moore buyout, contract detailsMoore's contract pays him $5.5 million in base salary and additional compensation annually, running through 2029 -- with a $500,000 retention bonus each season. His buyout is 75% of the base and additional compensation for the remainder of his contract. \nThat means if Moore was fired during the 2025 campaign, Michigan would pay him $16.5 million (including what he's been paid already this season), and if they fire him after this season, they would owe him $12.375 million for the final three years of his contract. Moore's contract also includes the obligation to seek alternative employment, where any amount earned there will offset Michigan's buyout payments. For Michigan, that is a relative drop in the bucket. With NCAA penalties having already been handed out for the sign-stealing scandal, if the Wolverines want to re-enter the coaching carousel, Moore's buyout is a minor impediment to doing so. The biggest possible concern with firing Moore wouldn't be money, but instead would be whether Underwood would explore options in the transfer portal due to a coaching change. The new reality of college football is that, like in the pros, you probably need to at least discuss a coaching change with your top stars to take their temperature on bringing in a new staff. \nIf Michigan is confident in their star quarterback sticking around, then Moore may need to finish with a flourish this season. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sherrone Moore buyout, contract details as Michigan football coach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/f1d1d92f-6c09-41d6-aabc-aa7c99529abf/thumbnail/1200x675/5de9ce00c564e197f55653a378e86598/sherrone-moore.jpg"
      ],
      "datePublished": "2025-11-02T01:42:52.000Z",
      "dateModified": "2025-11-02T01:42:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Clemson's Dabo Swinney rips refs after loss to Duke: 'One of the worst calls' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/clemson-tigers-dabo-swinney-officiating-loss-duke-pass-interference/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/32a7202f-4873-4905-a5fe-c78bcecfd2ee/thumbnail/1200x675/b9ae3daa3fba46751625dd5165d10ea0/dabo-swinney-mad-getty.png",
    "tag": "Sports",
    "date": "2025-11-01T22:27:07.000Z",
    "description": "\n        Duke picked up its first road win over Clemson since 1980, a 46-45 shootout, on Saturday, but the Blue Devils' game-winning drive was kept al",
    "body": "\n        Duke picked up its first road win over Clemson since 1980, a 46-45 shootout, on Saturday, but the Blue Devils' game-winning drive was kept alive by a controversial call. In his postgame press conference, an incredulous Dabo Swinney was still flabbergasted by a late pass interference call that helped Duke pull out the win.With under a minute remaining in the game, Duke faced fourth down while trailing by a touchdown. Blue Devils quarterback Darian Mensah lofted up a prayer over the middle of the field, and it fell harmlessly to the ground after receiver Que'Sean Brown collided with Clemson defensive back Avieon Terrell. Despite Brown pushing Terrell to the ground on the play, the officials flagged the latter for defensive pass interference. Swinney called it \"one of the worst calls\" he's ever seen. \nThe penalty gave Duke new life, and Nate Sheppard found the end zone on the next play with 40 seconds to go. And rather than play for the tie, the Blue Devils went for two and the lead. They converted and then the defense held on to seal the 46-45 win.\n        \n            \n                Bowl season in jeopardy for Clemson: Tigers' postseason hopes take hit as season bottoms out in loss to Duke\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nAfter the loss, which dropped Clemson to 3-5 on the year, Swinney put that pass interference penalty among the worst he's witnessed in his three decades as a coach.\n\"I don't even know what to say about the last call,\" Swinney said. \"You all saw it. Shouldn't have come down to that. We had plenty of opportunities to win the game, but that's one of the worst calls I've ever seen in a game ever in my entire coaching career. Ever. I don't really know what else to say.\"I don't wanna make that a deal because we should've won the game. We had plenty of opportunities to win the game. But you fight your butt off, you scratch and claw to get in a situation like that. Then you have a call like that. Man, that's just more salt in the wound.\"When he first saw the play live, Swinney thought it was offensive pass interference. Then he realized the call was going against his Tigers.\n\"I saw OPI,\" Swinney said. \"What'd you see? ... That's what I thought the call was. I was shocked there wasn't a flag. Then when there was a flag, I was like, 'Oh good, they called OPI.' It didn't go our way. They must've seen something I didn't see.\"The penalty may have been questionable, but Clemson made plenty of mistakes of its own. The pass defense was abysmal, allowing Mensah to throw for 361 yards and causing Swinney to melt down on the sideline right before halftime. The Tigers also surrendered a 100-yard kickoff return after taking the lead early in the third quarter.After beginning the season ranked inside the top five, Clemson will have to win three of its last four games just to reach bowl eligibility. The Tigers will try to get back in the win column next week against Florida State.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clemson's Dabo Swinney rips refs after loss to Duke: 'One of the worst calls' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/32a7202f-4873-4905-a5fe-c78bcecfd2ee/thumbnail/1200x675/b9ae3daa3fba46751625dd5165d10ea0/dabo-swinney-mad-getty.png"
      ],
      "datePublished": "2025-11-01T22:27:07.000Z",
      "dateModified": "2025-11-01T22:27:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas QB Arch Manning explains viral traffic stop after win over Vanderbilt - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arch-manning-viral-traffic-stop-texas-vanderbilt-police/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/89f0f047-1410-40d7-bd5a-838fcbbe987f/thumbnail/1200x675/284c896d2fed9aee4df0ecb8415f37ab/arch-manning.jpg",
    "tag": "Sports",
    "date": "2025-11-01T22:06:53.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Texas quarterback Arch Manning had quite the week.",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Texas quarterback Arch Manning had quite the week. It started with him in concussion protocol after a rough hit the week before against Mississippi State. Then it took another turn when he was caught in a viral photo at a traffic stop before he finished the week by leading the No. 20 Longhorns to a 34-31 win over No. 9 Vanderbilt on Saturday. The photo, which surfaced earlier in the week, appeared to show Manning pulled over near campus in a black GMC Denali. After throwing for three touchdowns in the win, he laughed off the moment and explained what happened.\"It was a crosswalk that was solid red. I didn't think there was anyone around so I went,\" Manning said, via CBS Sports' Chris Hummer. \"I guess there was someone around.\"\nBetween concussion check-ins and a run-in with campus police, the sophomore still managed one of his best performances of the season -- completing 25 of 33 passes for 328 yards with no interceptions.\n\"I do think he's grown up,\" Texas coach Steve Sarkisian said postgame. \"He just looks so much more mature. He looks so much more poised. He looks so much more confident and he's got a lot more trust in those guys around him. I think that continuity of playing with him more and more and more. Just his ability to manage the game, change protections and work the shot-clock and take the shots when they're there and check the ball down when the check-downs were there. ... Very proud of him.  It's been a long year.  He's been through a lot and so for him to have some of the success he's having right now -- he deserves it.\"Manning had been cleared to play Friday after spending much of the week in concussion protocol. He sustained the injury in last week's 45-38 overtime win when his helmet hit the turf on a 13-yard scramble late in the game. He was evaluated immediately and did not return.Sarkisian told ESPN's Molly McGrath Friday afternoon that Manning had not experienced any setbacks or symptoms during the week, and was set to meet with doctors Saturday morning for a final evaluation before kickoff. \nBy the end of the week, he had passed all tests and was removed from the injury report, setting up his strong return Saturday -- a timely boost as Texas notched its second top-10 win and stayed firmly in the SEC title hunt.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas QB Arch Manning explains viral traffic stop after win over Vanderbilt - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/89f0f047-1410-40d7-bd5a-838fcbbe987f/thumbnail/1200x675/284c896d2fed9aee4df0ecb8415f37ab/arch-manning.jpg"
      ],
      "datePublished": "2025-11-01T22:06:53.000Z",
      "dateModified": "2025-11-01T22:06:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaire Alexander trade: Eagles pick up veteran DB in swap with Ravens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-trade-jaire-alexander-veteran-corner-in-deal-with-ravens-nfl-trade-deadline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/ba6767ca-6664-4c9e-8262-3c5ba6ea8903/thumbnail/1200x675/585e9138190340a0a9409705c794bd97/jaire-alexander.jpg",
    "tag": "Sports",
    "date": "2025-11-01T21:45:39.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        For the second time this week, the Philadelphia Ea",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        For the second time this week, the Philadelphia Eagles have made a trade for a veteran defensive back, this time acquiring Jaire Alexander from the Ravens for a late-round draft pick swap, the team announced on Saturday.The Eagles will send a 2026 sixth rounder to Baltimore for Alexander and a 2027 seventh round pick, as they continue trying to bolster their secondary ahead of Tuesday's trade deadline. Earlier in the week, Philadelphia traded for Jets corner Michael Carter II to fill a need in the slot and now add Alexander to provide further depth on the perimeter. The Eagles have been in the middle of the pack this season in pass defense and clearly felt their secondary was their biggest area of need coming into the deadline. While Alexander is a big name for long-time NFL fans given his All-Pro credentials in Green Bay, he hasn't been that same player of late and shouldn't be expected to be a major impact player in the Philly secondary. \nAlexander has not been part of the Ravens' regular rotation after signing in Baltimore this offseason, appearing in just two games and tallying four tackles on the year. Alexander was an inactive for the Ravens' win in Miami on Thursday night, and now they flip him to Philadelphia to recoup a late-round pick. Alexander will hope a fresh start can allow him to find a more comfortable role as a reserve in Philly after not panning out as hoped in Baltimore. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaire Alexander trade: Eagles pick up veteran DB in swap with Ravens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/ba6767ca-6664-4c9e-8262-3c5ba6ea8903/thumbnail/1200x675/585e9138190340a0a9409705c794bd97/jaire-alexander.jpg"
      ],
      "datePublished": "2025-11-01T21:45:39.000Z",
      "dateModified": "2025-11-01T21:45:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bulls off to best start since 1996 as Josh Giddey finally finds an offense that fits - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/bulls-josh-giddey-5-0-best-start/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/e1996d47-cda6-4da2-98c8-93a6e947af7d/thumbnail/1200x675/42ef29b554d132f9fc2928fc7539ab00/giddey-getty.png",
    "tag": "Sports",
    "date": "2025-11-01T23:17:39.000Z",
    "description": "\n        When Josh Giddey averaged better than 20 points, nine rebounds and eight assists on 45% 3-point shooting over the final 25 games of last seas",
    "body": "\n        When Josh Giddey averaged better than 20 points, nine rebounds and eight assists on 45% 3-point shooting over the final 25 games of last season, nobody knew quite what to make of it. On the one hand, his shooting had improved every year in the league, especially with time to take aim, and his creative talents were never really in question as long as he had control of an offense, an opportunity the Bulls were able to give him that he was never going to get in Oklahoma City.On the other hand, the last six weeks of the NBA regular-season calendar often produces some dicey data. Not every team is, shall we say, fully committed to putting its best product on the floor at this point, though it should be noted that pretty much every team Chicago faced down the stretch was still battling for playoff positioning. Still, even the Bulls didn't know how much to trust what they'd seen from Giddey, who was a restricted free agent entering the summer and didn't get a deal closed until the second week of September -- a four-year, $100 million swing that, at this moment, looks like a home run for a Chicago team that is off to a 5-0 start for the first time since 1996. \nGiddey is not an NBA alpha in any sort of traditional sense. He's not particularly athletic or fast; he can, at times, look like he's about one step from turning clumsy. He doesn't generate one-on-one advantages if a blow-by or in-your-bag step-back is the standard. But he's bigger than just about any guard he faces at 6-foot-7 and knows how to bump his way into the paint and continue downhill as a scorer or passer through contact. Until the end of last season, that was always the problem with Giddey. If he wasn't pushing in the open floor, his lack of shooting allowed defenses to sag on him, negating the physical advantages he can create in tighter quarters with a shoulder here or a hip there. It was particularly a problem off ball, where he could basically be ignored. But this shooting has been going on long enough -- 61 for his last 135 from 3 dating back to Feb. 1 of last season -- that we have to consider the possibility that it's real (he also shot the 3 well at the Olympics; a shorter international line, but still). \nAnd if that's the case, Giddey, as the only player in the league putting up at least 22 points, eight rebounds and eight assists on 40% 3-point shooting so far, becomes a perfect captain for an inclusive offense that is designed around his strengths. It was all on display in a career-best scoring night against the Knicks on Friday. \nLong mired in play-in perpetuity, the Bulls might really be on to something here. Giddey (who, let's be honest, felt like an almost laughable return for what was long one of the league's most valuable trade assets in Alex Caruso) is only 23 years old. And he's not alone. The Bulls play nine guys double-digit minutes, and seven of them are 25 or younger. When 20-point scorer Coby White comes back, it'll be 10. Six of them are scoring at least 11 PPG, and Patrick Williams is at 9.2. Nikola Vučević is on a tear to start the year. Matas Buzelis is a walking highlight. Pretty much everyone can shoot, pass and dribble, allowing for a flow that has produced a league-high 30.6 assists per game. \nAgain, this is the perfect setup for Giddey, who isn't suited to stationary offense. Nobody on the Bulls, in fact, is going to take over a game, or even a possession, on his own. They rely on pace and hot potato passing to expose defenses in rotation little by little until an advantage attained by committee emerges. It sometimes takes a while. The Bulls score 10.2 PPG in the final four seconds of the shot clock, third most in the league. When it's working, it looks like this. That's not a shot Giddey has traditionally had, but he's 7 for 14 on catch-and-shoot 3s this year after sitting just under 39% on such shots last season. That changes everything as it weaponizes him off ball, where he is already a solid cutter and catch-and-go driver. If now you have to stay spaced to account for him in the half court and close out honestly to him in rotation, he's going to continue getting into the teeth of defenses en route, potentially, to his first All-Star selection. \n\"I'm in a place where I'm wanted,\" Giddey said Friday of his situation with the Bulls. \"I love being here. I'm happy here. I think having confidence from your teammates and coaches to trust me to go out there and make plays, that's what you kind of need as a player. When you have the belief of everyone around you, it propels you in the right direction.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bulls off to best start since 1996 as Josh Giddey finally finds an offense that fits - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/e1996d47-cda6-4da2-98c8-93a6e947af7d/thumbnail/1200x675/42ef29b554d132f9fc2928fc7539ab00/giddey-getty.png"
      ],
      "datePublished": "2025-11-01T23:17:39.000Z",
      "dateModified": "2025-11-01T23:17:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Carolina vs. Ole Miss odds, line, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-south-carolina-prediction-odds-line-time-2025-college-football-week-10-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/737c1a0c-10b6-42ae-8341-d8f9a93e492d/thumbnail/1200x675/67c18087ef0d722c4be32d3be267734d/usatsi-27357636-trinidad-chambliss-ole-miss-qb-pregame-2025-1920.jpg",
    "tag": "Sports",
    "date": "2025-11-01T21:15:36.000Z",
    "description": "\n        The seventh-ranked Ole Miss Rebels look to stay in the SEC championship race when they battle the South Carolina Gamecocks in a key matchup o",
    "body": "\n        The seventh-ranked Ole Miss Rebels look to stay in the SEC championship race when they battle the South Carolina Gamecocks in a key matchup on Saturday. The Gamecocks are coming off a 29-22 loss to Alabama, while Ole Miss downed Oklahoma 34-26 on Oct. 25. The Gamecocks (3-5, 1-5 SEC), who are 13th in the conference, have lost three in a row. The Rebels (7-1, 4-1 SEC), who are tied for third in the league, are 5-0 on their home field in 2025.Kickoff from Vaught-Hemingway Stadium in Oxford, Miss., is at 7 p.m. ET. The Rebels are 12.5-point favorites in the latest South Carolina vs. Ole Miss odds, while the over/under for total points scored is 55.5 via SportsLine consensus. Before making any Ole Miss vs. South Carolina picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on South Carolina vs. Ole Miss. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Ole Miss vs. South Carolina:South Carolina vs. Ole Miss                                 spreadOle Miss -12.5 at DraftKings SportsbookSouth Carolina vs. Ole Miss                             over/under55.5 pointsSouth Carolina vs. Ole Miss                                                                                                                                             money line Ole Miss -483, South Carolina +368South Carolina vs. Ole Miss                                                                                                                                     picksSee picks at SportsLineSouth Carolina vs. Ole Miss                                                                                                                                       streaming Fubo (Try for free)  Why Ole Miss can coverSenior quarterback Trinidad Chambliss has been dominant for the Rebels. In eight games, he has completed 128 of 210 passes (61%) for 1,864 yards and nine touchdowns with one interception. He has also rushed 82 times for 376 yards (4.6 average) and five touchdowns. He has thrown for 300 or more yards in four games, including 315 yards and one touchdown on 24 of 44 passing in the win over Oklahoma. He also carried 12 times for 53 yards in that game.Sophomore running back Kewan Lacy powers the ground attack. In eight games, he has carried 165 times for 696 yards (4.2 average) and 12 touchdowns. He has also 18 receptions for 114 yards, including a long of 22. In a 24-21 win over Washington  State, he carried 24 times for 142 yards, while catching two passes for 19 yards. In a 63-7 win over Georgia State on Aug. 30, he carried 16 times for 108 yards and three touchdowns. See which team to back at SportsLine. Why South Carolina can coverSophomore quarterback LaNorris Sellers is a dual threat on offense. In eight games this season, he has completed 108 of 171 passes (63.2%) for 1,356 yards and six touchdowns with three interceptions. He has also carried 102 times for 175 yards (1.7 average) and two touchdowns. In the loss to Alabama, he completed 18 of 32 passes for 222 yards and one touchdown with one interception, while rushing 18 times for 67 yards and one score.One of Sellers' top targets in the passing game is sophomore wide receiver Vandrevius Jacobs. He began his collegiate career at Florida State, but has played the last two seasons at South   Carolina. In six games this year, he has 21 receptions for 343 yards (16.3 average) and two touchdowns. In a 35-13 win over Kentucky on Sept. 27, he caught five passes for 108 yards, including a long of 59. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Ole Miss vs. South Carolina picksSportsLine's model is going Under on the total, projecting 49 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins South Carolina vs. Ole Miss, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the South Carolina vs. Ole MIss spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Carolina vs. Ole Miss odds, line, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/737c1a0c-10b6-42ae-8341-d8f9a93e492d/thumbnail/1200x675/67c18087ef0d722c4be32d3be267734d/usatsi-27357636-trinidad-chambliss-ole-miss-qb-pregame-2025-1920.jpg"
      ],
      "datePublished": "2025-11-01T21:15:36.000Z",
      "dateModified": "2025-11-01T21:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grizzlies suspend Ja Morant one game after clash with coach Tuomas Iliaso - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/ja-morant-grizzlies-suspension-coaching-staff-clash/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/06c10560-0bec-4c3b-9462-6ad2b08694d9/thumbnail/1200x675/6bc9da0dc8a603b78744fd35e59fea71/morant-iisalo.jpg",
    "tag": "Sports",
    "date": "2025-11-01T20:36:34.000Z",
    "description": "\n        The Memphis Grizzlies suspended Ja Morant one game for conduct detrimental to the team. The looming absence comes after Morant challenged coa",
    "body": "\n        The Memphis Grizzlies suspended Ja Morant one game for conduct detrimental to the team. The looming absence comes after Morant challenged coach Tuomas Iliaso's leadership in an exchange after Friday's 117-112 loss to the Los Angeles Lakers. Morant also made pointed postgame comments about the Grizzlies' coaching staff in the wake of the defeat in NBA Cup group stage action.Morant will miss Sunday's game against the Toronto Raptors as a result, and the suspension will cost him $272,042 -- 1/145 of his more than $39 million salary.Much of the focus coming out of the loss was on Morant's rough performance. The All-Star guard finished the game with eight points and seven assists in 31 minutes. He went just 3-of-14 from the field and was a complete non-factor down the stretch.After the game, Morant was asked about his performance and what could've gone better for him. He told reporters multiple times to \"go ask the coaching staff.\" When asked how the Grizzlies could've gotten a different outcome, Morant said \"according to them, probably don't play me, honestly. That's what basically the message was. It's cool.\" \nThere has never been a less convincing delivery of \"it's cool\" in history than Morant gives here, as he is clearly extremely frustrated with the coaches. It wasn't just that Morant had a rough shooting night, it was the lack of effort from a player known for bringing energy to the floor that was most concerning for Grizzlies fans. It was noticeable enough that Blake Griffin called it out on the Amazon postgame show. \nThe Grizzlies fired Taylor Jenkins as coach at the end of last season, turning things over to Iisalo, which was notable after Jenkins shifted to an offensive scheme early last season that went away from Morant's preferred style. After trading Desmond Bane this summer, it seemed like they were once again going to put the focus again on Morant as the offensive engine, but that's clearly not going according to plan for any of the parties involved. \nAt 3-3, it's not been a disastrous start to the season, but the Grizzlies' three wins have all come against some of the league's worst teams early -- the Phoenix Suns, Indiana Pacers and New Orleans Pelicans. Against playoff caliber teams, they've been outclassed and if Iisalo and the staff were trying to set the tone by being hard on their star player, it doesn't seem to be well received by Morant, who seems to feel isolated and unwanted at the moment. That's not a great place to be as a new coaching staff, and Morant's comments Friday night will undoubtedly catch the attention of teams around the league who will be monitoring whether those frustrations fade or build. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grizzlies suspend Ja Morant one game after clash with coach Tuomas Iliaso - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/06c10560-0bec-4c3b-9462-6ad2b08694d9/thumbnail/1200x675/6bc9da0dc8a603b78744fd35e59fea71/morant-iisalo.jpg"
      ],
      "datePublished": "2025-11-01T20:36:34.000Z",
      "dateModified": "2025-11-01T20:36:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Georgia Tech upset by NC State diminishing ACC's College Football Playoff outlook - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/georgia-tech-upset-nc-state-college-football-playoff-outlook-acc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/378358ef-5d7b-446a-aa5b-27e86624ebac/thumbnail/1200x675/5847f2299a2d454292dc71316a5912be/georgia-tech.png",
    "tag": "Sports",
    "date": "2025-11-02T03:12:10.000Z",
    "description": "\n        After several close ACC wins this season for unbeaten Georgia Tech, the dam finally broke defensively during Saturday night's 48-36 loss at N",
    "body": "\n        After several close ACC wins this season for unbeaten Georgia Tech, the dam finally broke defensively during Saturday night's 48-36 loss at NC State, the second stunner in conference play to highlight Week 10 following SMU's overtime triumph over Miami.The Wolfpack had the Yellow Jackets on the ropes throughout the second half, countering every punch with uppercuts in the form of touchdowns of their own through red-hot quarterback CJ Bailey and a big-play offense playing without two of its top talents -- tailback Hollywood Smothers and tight end Justin Joly.NC State piled up 583 yards of total offense -- including a career-best 196 yards rushing from Duke Scott -- and sent Georgia Tech (8-1, 5-1) to a resounding first setback. Virginia (8-1, 5-0) is the ACC's lone remaining unbeaten in conference play and clinches a spot in the conference championship game with wins over Wake Forest, Duke (5-3, 4-1) and Virginia Tech to finish out the regular season.With Georgia Tech's unexpected loss, the ACC likely will not have a team inside the top 10 of the College Football Playoff Rankings when the selection committee unveils its first top 25 on Tuesday night unless the Hurricanes (6-2, 2-2) get the benefit of the doubt since they've posted three wins over ranked teams.\nLouisville (7-1, 4-1) and SMU each have one loss in conference play, but one of those two will be eliminated from reaching the title game when they meet on Nov. 22 in Dallas. That leaves one-loss Virginia and Duke, who play one another on Nov. 15, to try and fill the other side of the equation in the first weekend of December.The best Georgia Tech can finish is in a multi-team tie for first, and then it would come down to various tiebreakers under the ACC's policy, that was enacted in 2023 with conference expansion.With the selection committee's new strength of schedule metric set to debut this week, the ACC will be far lower than the SEC and Big Ten in the pecking order and likely the Big 12, as well. Virginia's lone ranked win this fall came against Florida State, while Georgia Tech beat Clemson for its quality win and Louisville beat Miami.\nThe ACC champion gets an automatic bid to the playoff, but those in the mix for one of seven available at-large spots will be battling against the likes of the SEC and Big Ten's runner-up, others within those leagues with double-digit victories and a potential 10-win Notre Dame. Best-case for a two-bid scenario for the ACC would be Georgia Tech beating Georgia in Atlanta during rivalry weekend, but losing the following weekend against one of these one-loss in conference challengers. That would mean the Yellow Jackets are 11-2 overall with a pair of ranked wins, and could let the chips fall where they may with the selection committee during at-large deliberations.SMU earned the ACC's second bid in last year's first year of expansion after losing its second game of the season to Clemson in the league title game, but this time around, it's going to take mass chaos the rest of the month outside of the conference to warrant inclusion for a league's second selection.\nThis is partly why ACC commissioner Jim Phillips was a strong advocate for further expansion over the summer, knowing his league was a bit top-heavy and needed strong showings from its preseason elites to get there. Instead, Clemson has flatlined, Florida State has struggled and Miami has lost two of its last three games after starting 6-0.There will be no microphone holding this time around for the conference it appears, unless much falls in the ACC's favor over the final weeks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Georgia Tech upset by NC State diminishing ACC's College Football Playoff outlook - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/378358ef-5d7b-446a-aa5b-27e86624ebac/thumbnail/1200x675/5847f2299a2d454292dc71316a5912be/georgia-tech.png"
      ],
      "datePublished": "2025-11-02T03:12:10.000Z",
      "dateModified": "2025-11-02T03:12:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oklahoma vs. Tennessee prediction, odds, picks, Week 10 college football best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tennessee-oklahoma-prediction-odds-time-2025-college-football-week-10-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/3c2b287d-e02a-4a6a-8ae6-b4c54f3ec9c1/thumbnail/1200x675/a40a89ed8c7e8437b11d0f60044a3918/joey-aguilar.png",
    "tag": "Sports",
    "date": "2025-11-01T21:00:45.000Z",
    "description": "\n        A top-20 SEC matchup features the No. 18 Oklahoma Sooners (6-2) and the No. 14 Tennessee Volunteers (6-2) battling on Saturday afternoon. The",
    "body": "\n        A top-20 SEC matchup features the No. 18 Oklahoma Sooners (6-2) and the No. 14 Tennessee Volunteers (6-2) battling on Saturday afternoon. The Sooners have lost two of their last three games, falling 34-26 to Ole Miss in Week 9. Tennessee defeated Kentucky 56-34. on the road last week. Oklahoma leads the all-time series 3-2, but the Volunteers beat the Sooners 25-15 in 2024 in Tennessee coach Josh Heupel's return to his alma mater. Starting linebacker Arion Carter is questionable for Tennessee. Kickoff from Neyland Stadium in Knoxville, Tenn., is at 7:30 p.m. ET. The Volunteers are 2.5-point favorites in the latest Oklahoma vs. Tennessee odds, while the over/under for total points scored is 55.5. Before making any Tennessee vs. Oklahoma picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Oklahoma vs. Tennessee. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Oklahoma vs. Tennessee:Oklahoma vs. Tennessee spreadTennessee -2.5Oklahoma vs. Tennessee over/under55.5 pointsOklahoma vs. Tennessee                       money line Volunteers -144, Sooners +121Oklahoma vs. Tennessee               picksSee picks at SportsLineOklahoma vs. Tennessee                 streaming Fubo (Try for free)  Why Oklahoma can coverTennessee's defense has struggled this season without some of its top cornerbacks, and OU quarterback John Mateer has the ability to extend plays with his feet when needed, giving them a dual-threat under center. This season, he has 1,790 passing yards, 226 rushing yards and 13 total touchdowns. Junior receiver Isaiah Sategna III has been his top target. He has 624 receiving yards and five touchdowns this season. Last week against Ole Miss, Sategna III had a season-high 131 receiving yards and a score. Meanwhile, freshman running back Tory Blaylock has logged 401 rushing yards and four rushing touchdowns. Oklahoma is 2-0 ATS as the road team this season as well. See which team to back at SportsLine. Why Tennessee can coverSenior quarterback Joey Aguilar has strong arm and can push the ball downfield. Aguilar has 2,344 passing yards and 18 passing touchdowns. In his last outing, he went 20-of-26 for 396 passing yards and three passing scores. Junior receiver Chris Brazzell II is seventh in the nation in receiving yards (740) with 43 catches and eight touchdowns. The Texas native has gone over 100 receiving yards in three games this campaign. On Oct. 25 versus Kentucky, Brazzell II reeled in four passes for 138 receiving yards and a score. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Oklahoma vs. Tennessee picksSportsLine's model is going under on the total, projecting 52 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Oklahoma vs. Tennessee, and which side of the spread is the better value? Visit SportsLine now to see which side of the Oklahoma vs. Tennessee spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oklahoma vs. Tennessee prediction, odds, picks, Week 10 college football best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/3c2b287d-e02a-4a6a-8ae6-b4c54f3ec9c1/thumbnail/1200x675/a40a89ed8c7e8437b11d0f60044a3918/joey-aguilar.png"
      ],
      "datePublished": "2025-11-01T21:00:45.000Z",
      "dateModified": "2025-11-01T21:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deion Sanders' Colorado tenure may not have a path forward - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/after-boisterous-talk-deion-sanders-colorado-fairytale-coming-to-close-after-consecutive-35-point-losses/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/d6b6d4fa-d526-4b1b-933e-8e020026d4ba/thumbnail/1200x675/d758304968fb14f9ad8800a64f8946e0/deion-sanders-coach-1.jpg",
    "tag": "Sports",
    "date": "2025-11-02T03:57:41.000Z",
    "description": "\n        Deion Sanders made plenty of outlandish claims when he took the head coaching job at Colorado. Nearly three years later, most of them came to",
    "body": "\n        Deion Sanders made plenty of outlandish claims when he took the head coaching job at Colorado. Nearly three years later, most of them came to fruition. Sanders produced a once-in-a-generation Heisman winner (Travis Hunter) and helped his son (Shedeur Sanders) become an NFL Draft pick. He recorded the most wins in a season at Colorado since 2016 and drew more eyeballs than almost any other program in the sport. On Saturday, Shedeur was back in town to see his father during the Cleveland Browns' bye week. Instead of a triumphant return, it only emphasized how much has changed in Boulder in only a year. One week after getting blasted by Utah, Colorado lost 52-17 against Arizona. The Buffaloes have been outscored 81-7 in the first half of games over the past two weeks, ending their chances before they started. Losing badly to Utah is one thing -- the Utes are one of the Big 12's premier programs. An Arizona squad that came into Week 10 1-3 in Big 12 play is a little tougher to swallow. \nAfter the loss to Utah, Sanders told his team that the book was out on how to beat them, especially by blitzing quarterback Kaidon Salter and an inconsistent offensive line. If there is a plan, Arizona followed it to perfection, with a fan exodus from Folsom Field before the second half even started. The Wildcats forced a punt and a fumble as the Buffs ended the first quarter with minus-12 yards. They scored five touchdowns in seven drives with only one punt. They took a 38-7 lead into halftime with a pair of forced turnovers and 212 yards passing from quarterback Noah Fifita alone. Highly-rated freshman Julian Lewis came off the bench and threw a fun touchdown, but that was about it for positive moments. And ultimately, that's the greatest tragedy of the 2025 season for Colorado. They're no longer even entertaining. \nHeading into the weekend, Colorado ranks No. 15 in the Big 12 in both total offense and defense. They're 13th in scoring defense and 14th in scoring offense. They only have one total player that ranks top 100 nationally in passing, rushing or receiving. They're just not very good at anything. And because of the sheer number of transfers, Colorado isn't especially young. Especially in the trenches, the vast majority of top trench contributors are gone after this season. This was supposed to be a year to keep the train rolling, but instead it's flown off the tracks. Why should Lewis or highly-touted tackle Jordan Seaton even return to the program next year? Many have pointed out that Sanders took over a 1-11 team, which is true. That said, the season is a little misleading for its unique depths. Previously, Colorado reached at least four wins in every season since 2014. With West Virginia suddenly streaking, the Buffaloes have a battle just to reach 4-8 again. The performances the Buffs put together over the last two weeks have compared with the lowest moments of the 21st Century. \nColorado has only lost by at least five touchdowns in consecutive weeks once in the past decade. It was during the 1-11 season. After another crushing loss, add 2025 to the list. So now what? According to BuffStampede publisher Adam Munsterteiger, staff changes are on the way. New portal adds too. \"There has been a lack of leadership in the locker room this season, and that showed itself in Salt Lake City,\" Munsterteiger told CBS Sports' Brad Crawford. \"Sanders has shown a willingness to make tough decisions and changes with his coaching staff previously. I would expect there to be adjustments to his staff in the near future, whether that comes in the next month or after the season.\"\nBut how attractive is the situation for people coming in? Sanders' first offensive coordinator, Sean Lewis, was pushed out midseason. His first defensive coordinator, Charles Kelly, left after a year. Now, offensive coordinator Pat Shumur and defensive coordinator Robert Livingstone are both on the hot seat. And when a new coach comes in, there's no telling who's even on the roster. Colorado brought in 104 new players in the last two classes alone. Thirty-eight players on the roster are listed as seniors or graduates, not counting a potential exodus. There's no guarantee that better players are on the way, especially without the allure of either a nine-win season -- or the chance to play with future NFL stars. So most likely, Sanders will be back in 2026 with a new collection of potential coaches and players. And for the fourth year in a row, Colorado will ride the roulette and hope that this roll is the one that lands on black. \nGranted, Sanders could make the choice to step away for health reasons. Sanders battled through bladder cancer over the offseason and has dealt with serious blood clots across his coaching career. No one would fault him for prioritizing his family and health, if he decided to make that choice. At the same time, Sanders signed a five-year, $54 million contract before the season. The number is more than he made across his entire NFL career. Colorado couldn't realistically fire Sanders regardless because of the fan backlash, but a $33 million buyout also makes it cost-prohibitive. Let's be clear, regardless of what happens from here. \"Coach Prime\" won. I was at the press conference after his shocking win over TCU in 2023, when he confronted several reporters and asked if they believed. He accomplished things in 2024 that few thought were possible. \nSanders went from assisting at a local private school in DFW to winning big at Jackson State and Colorado. Hunter's exploits will go down in college football history. When you tell the story of \"Deion,\" his crazy decision to jump into coaching and doing things no one has ever seen. Maybe the legend will get even bigger when it's told in a few decades. The best ones do. But now, the Colorado fairytale is over. Reality is coming. And unless Sanders has another superstar family member waiting in the wings, it's hard to see a way out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deion Sanders' Colorado tenure may not have a path forward - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/d6b6d4fa-d526-4b1b-933e-8e020026d4ba/thumbnail/1200x675/d758304968fb14f9ad8800a64f8946e0/deion-sanders-coach-1.jpg"
      ],
      "datePublished": "2025-11-02T03:57:41.000Z",
      "dateModified": "2025-11-02T03:57:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL expert picks, odds, predictions, player props, betting advice for Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-odds-lines-best-bets-week-9-2025-expert-predictions-spread-parlays-player-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/08/47f0f520-93a8-431f-89ea-f3b75b48568a/thumbnail/1200x675/9197a6564946a182eacddd96d8573b28/caleb-williams-bears-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-11-02T02:17:38.000Z",
    "description": "\n        Approaching the midpoint of the regular season with NFL Week 9, we're finally starting to see some NFL betting trends emerge in regard to the",
    "body": "\n        Approaching the midpoint of the regular season with NFL Week 9, we're finally starting to see some NFL betting trends emerge in regard to the spread. Favorites have covered in 57.5% of games, while home favorites are at almost 59%. The Week 9 NFL odds have just six of the 14 games with the home team favored, but you can lean into these trends with your Week 9 NFL bets. Among the home favorites are the Lions (-8.5) versus Minnesota, the Packers (-13.5) against Carolina and the Rams (-14) versus New Orleans, as the Saints will see QB Tyler Shough making his first career start. Despite those large NFL spreads, not every home favorite is giving a touchdown or more. Texans vs. Broncos has Houston as 1.5-point favorites as Denver comes to town for a matchup of top-five defenses. Whether you prefer to make Week 9 NFL predictions on contests with narrow lines or large ones, having optimal NFL betting advice from proven experts is essential. Before locking in any Week 9 NFL picks or NFL prop bets, be sure to check out the Week 9 NFL best bets and predictions from SportsLine's red-hot Vegas experts.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:SportsLine has more than 40 hand-picked Vegas experts who excel in multiple spots. The NFL, however, is a strength for the site as SportsLine currently has five total experts who are on NFL runs that have returned $860 or more for $100 players and one who has returned more than $2,100. Anybody following could have seen huge returns. Now, with the Week 9 NFL schedule quickly approaching, SportsLine's top NFL betting experts are already locking in their picks. Go to SportsLine to see them all now.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 9 expert NFL prop picks from Matt SeveranceSeverance is a high-volume handicapper who returned over $2,010 for $100 players over the last two NFL seasons and is 47-26 (+889) over his last 73 NFL picks. One of his top NFL player props for Week 9 is Chicago going Under 27.5 points (-122) at the Cincinnati Bengals on Sunday at 1 p.m. ET.\"I'm well aware of how bad that Bengals defense is. But I've watched the Bears forever. I'm not saying I can count off the top of my head how many times they have scored at least 28 points in a road game, but I'm probably not far off as it's not that many. Remember the last time: Oct. 5, 2023 at Washington. Would I go any lower on this (a couple of 26.5s on our board)? Nope. But the Cincy defense can't possibly play worse after allowing 39 points to the Jets and ex-Bear Justin Fields.\" You can see all of Severance's NFL picks here.You can also use the latest FanDuel promo code to get $300 in bonus bets instantly:Top Week 9 NFL expert picks from Sia NejadAn expert and analyst across multiple sports, Nejad is 145-106-5 (+2123) on NFL bets since 2023. He is 4-1 (+278) over his last five NFL picks and is backing Green Bay (-13.5) to cover at home versus Carolina in a Sunday 1 p.m. ET kickoff.\"This line continues to be on the move and I'm going to go ahead and lock it in. Packers are at home and they're up against either Bryce Young or Andy Dalton behind an injury ravaged offensive line. That same offensive line undertook additional injuries on Sunday against the Bills. The Packers offense looks to be clicking off the bye and is getting healthier at the skill positions. I like the Packers to pull away and I'm not as worried about a back door cover regardless of who plays QB for Carolina.\" See all of Neajd's NFL picks here.Top Week 9 NFL expert picks from Bruce MarshallA legendary expert who was synonymous with The Gold Sheet, the famed sports betting newsletter, Marshall has over 40 years of handicapping experience. He is 18-8 (+899) over his last 26 NFL ATS picks and is 5-1 over his last ATS picks in Colts games. He is backing Indianapolis (-3.5) to cover at Pittsburgh on Sunday at 1 p.m. ET.\"Aaron Rodgers is not quite past his sell-by date, but his receivers aren't making enough difficult catches, too reliant upon DK Metcalf (especially if TE Pat Freiermuth is out). It was the defense, however, that alarmed vs. the Packers, as Sunday night became target practice for Jordan Love. Meanwhile the Colts are doing everything right in their 7-1 break from the gate, with Jonathan Taylor supplying the thunder on the ground and Daniel Jones the lightning thru the air.\" See all of Marshall's NFL picks at SportsLine.How to make Week 9 NFL against the spread picksSportsLine's team of experts also includes R.J. White, who is the site's all-time leading NFL expert and is one of this season's top experts as well, returning more than $1,000 on his past 156 picks. He has eight more picks on the board, including backing an underdog versus a team with a \"major issue\" in regard to injuries. You can find out who his NFL picks are this week here.If you are looking for NFL picks, NFL props, or NFL best bets for Week 9, SportsLine has you covered with its proven team of experts. Visit SportsLine now to see who which teams you should back in Week 9, all from a staff that includes five experts who are on NFL runs that have returned $860 or more for $100 players.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL expert picks, odds, predictions, player props, betting advice for Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/08/47f0f520-93a8-431f-89ea-f3b75b48568a/thumbnail/1200x675/9197a6564946a182eacddd96d8573b28/caleb-williams-bears-imagn-images-2.jpg"
      ],
      "datePublished": "2025-11-02T02:17:38.000Z",
      "dateModified": "2025-11-02T02:17:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]