[
  {
    "title": "Computer model locks in Vikings vs. Giants picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-giants-where-to-watch-nfl-week-16-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/b627e3b4-e60f-4655-8ea4-6fc2d5c7a8d3/thumbnail/1200x675/242da2fdfd5ce4c6ad080606d6a25571/dart.jpg",
    "tag": "Sports",
    "date": "2025-12-20T19:23:53.000Z",
    "description": "\nA pair of NFC teams that have been eliminated from the postseason square off Sunday when the Minnesota Vikings visit the New York Giants in NFL Week ",
    "body": "\nA pair of NFC teams that have been eliminated from the postseason square off Sunday when the Minnesota Vikings visit the New York Giants in NFL Week 16. Minnesota (6-8) has won consecutive games but fell from playoff contention despite a 34-26 victory against the Cowboys last week. The Giants (2-11) have lost eight in a row, including a 29-21 setback to the Commanders last week, but their only two victories have come at home.Kickoff from MetLife Stadium is set for 1 p.m. ET. The Vikings are 3-point road favorites, according to the latest Vikings vs. Giants odds from DraftKings, while the over/under for total points scored is 43.5. Before you make any Giants vs. Vikings picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Vikings vs. Giants on SundayWhen: Sunday, Dec. 21Time: 1 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppVikings vs. Giants betting previewOdds: Vikings -3, Over/Under 43.5The Vikings are 13th in the league in scoring defense (21.9 points per game), but the Giants are 29th (28.3), and both teams struggle to score, ranking in the bottom third. With the totals typically set pretty low, the Giants are 9-5 to the Over (8-1 in the past nine) and Minnesota is 8-6 (1-5 in the past six). They have been pretty average against the spread, with the Vikings 6-8 ATS and New York 7-7 ATS. The Vikings have won five of the past six meetings (4-2 ATS).Vikings vs. Giants SGPGiants +3Giants MLJaxson Dart Over 196.5 passing yards Bet it at DraftKings:\nModel's Vikings vs. Giants score prediction, picksThe model has the Giants winning outright 53% of the time, making them a good play at plus-money. They're covering the spread in 58% of simulations. The SportsLine Projection Model has Dart throwing for 244.3 yards to easily clear his prop line number. The rookie is averaging 200 passing yards per game in nine starts and has topped this number in two of the past three.Vikings vs. Giants score prediction: Giants 23, Vikings 21\nWant more Week 16 NFL picks?You've seen the model's best bets for Minnesota Vikings vs. New York Giants. Now, get against the spread, total and money-line picks for every Week 16 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Vikings vs. Giants picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/b627e3b4-e60f-4655-8ea4-6fc2d5c7a8d3/thumbnail/1200x675/242da2fdfd5ce4c6ad080606d6a25571/dart.jpg"
      ],
      "datePublished": "2025-12-20T19:23:53.000Z",
      "dateModified": "2025-12-20T19:23:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Ravens prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-ravens-prediction-odds-time-week-16-sunday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/6cd98797-2865-4031-8886-f789c63c2c03/thumbnail/1200x675/76fc8e885136ddd6ec13270688f4ad55/drake.jpg",
    "tag": "Sports",
    "date": "2025-12-20T19:15:42.000Z",
    "description": "\nAFC contenders will meet on 'Sunday Night Football' when the New England Patriots visit the Baltimore Ravens. The Pats (11-3) saw their 10-game winni",
    "body": "\nAFC contenders will meet on 'Sunday Night Football' when the New England Patriots visit the Baltimore Ravens. The Pats (11-3) saw their 10-game winning streak come to an end in Week 15 when they fell to Buffalo, 35-31. The Ravens (7-7) defeated Cincinnati, 24-0, on Sunday, which ended a two-game losing streak. New England can clinch a playoff berth with a victory, which would put it in the postseason for the first time since 2021.Kickoff is at 8:20 p.m. ET from M&T Bank Stadium in Baltimore. The Ravens won the last matchup, 37-26, back in 2022. The latest Ravens vs. Patriots  odds have Baltimore as 3-point favorites, while the over/under for total points scored is 48.5 via DraftKings Sportsbook. Before making any Patriots vs. Ravens picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Ravens vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends for Patriots vs. Ravens:Ravens vs. Patriots                                                                  spreadRavens -3 at DraftKings SportsbookRavens vs. Patriots              over/under48.5 pointsRavens vs. Patriots                                                                                                                                                                              money line Baltimore -160, New England +133Ravens vs. Patriots                                                                                                                                                                      picksSee picks at SportsLineRavens vs. Patriots                                                                                                                                                                        streaming Fubo (Try for free)  \nWhy the Patriots can coverNo AFC team has a better spread record than New England at 9-5, and the team has also covered in five of six away games. Meanwhile, no team in the NFL has a worse spread record than Baltimore at 5-9, and the Ravens have failed to cover in four of their last five contests. On the field, the Pats have incredible balance, ranking No. 7 in both scoring offense and scoring defense, and the team is coming off a season-high of 246 rushing yards on Sunday. Baltimore's run defense is exploitable this year as after ranking No. 1 versus the run in 2024, the team is just 15th this season. In addition to New England's backs, QB Drake Maye could also take advantage of Baltimore's run defense after he had 43 yards and two TDs on the ground last week. See which team to back at SportsLine. Why the Ravens can coverThe elite Ravens defense which has always been associated with the franchise returned last week as Baltimore pitched its first shutout in over seven years. That came versus a Bengals offense which had scored 30-plus in three straight Joe Burrow starts, while the Patriots offense has issues scoring in the redzone. It ranks 24th in redzone scoring, while the Patriots are dead last in redzone defense as just about every team which gets inside their 20-yard-line ends up with a touchdown instead of a field goal. Baltimore leads the NFL with 5.2 yards per carry, and Lamar Jackson had four passing touchdowns, plus 100-plus yards and a score on the ground, the last time he faced the Pats. See which team to back at SportsLine.How to make Patriots vs. Ravens picksSportsLine's model has simulated Ravens vs. Patriots  10,000 times is going Over on the total, projecting 52 combined points. It also says one side of the spread hits in well over 50% of simulations.         You can only get the pick at SportsLine. So who wins Patriots vs. Ravens, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Ravens vs. Patriots spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Ravens prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/6cd98797-2865-4031-8886-f789c63c2c03/thumbnail/1200x675/76fc8e885136ddd6ec13270688f4ad55/drake.jpg"
      ],
      "datePublished": "2025-12-20T19:15:42.000Z",
      "dateModified": "2025-12-20T19:15:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bengals vs. Dolphins picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-dolphins-where-to-watch-nfl-week-16-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/917ff098-0f6d-4e70-98f2-6597888abdc7/thumbnail/1200x675/ab0a075d87d9c8dadd90260d861d0156/quinn-ewers.jpg",
    "tag": "Sports",
    "date": "2025-12-20T18:51:13.000Z",
    "description": "\nThe Miami Dolphins will make a major change in their offense when they host the Cincinnati Bengals in Week 16. Head coach Mike McDaniel announced ear",
    "body": "\nThe Miami Dolphins will make a major change in their offense when they host the Cincinnati Bengals in Week 16. Head coach Mike McDaniel announced earlier this week that usual starter Tua Tagovailoa will be benched in favor of rookie Quinn Ewers, with Tagovailoa not even serving as the backup. There has been much speculation that the Dolphins could finally move on from the inconsistent and oft-injured Tagovailoa, and the move to Ewers could be the first step in that process. The Dolphins have been eliminated from playoff contention, as have the Bengals, with rumors swirling that star QB Joe Burrow is unhappy with the franchise. Kickoff from Hard Rock Stadium is set for 1 p.m. ET on CBS and Paramount+. The Bengals are 4.5-point favorites, per the latest Bengals vs. Dolphins odds from DraftKings, while the over/under for total points scored is 47.5. Before making any Bengals vs. Dolphins picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Bengals vs. Dolphins on SundayWhen: Sunday, Dec. 21Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppBengals vs. Dolphins betting previewOdds: Bengals -4.5, over/under 47.5Cincinnati is 6-8 against the spread and 8-6 to the Over. Miami is 7-7 ATS and 7-7 to the Over. The Bengals had covered three straight before last week's 24-0 shutout loss to the Ravens. The Under has hit in four of the last five Dolphins games.Bengals vs. Dolphins SGPBengals +4.5Jaylen Waddle anytime touchdown scorerQuinn Ewers Over 0.5 interceptions thrownBet it at DraftKings:\nModel's Bengals vs. Dolphins score prediction, picksThe model has limited data to work with now that Ewers is getting the start, but it does have the Dolphins covering in 53% of its simulations. Miami wins outright in 43% of the sims, giving the Dolphins some money line betting value. The Over hits in 58% of the simulations.Bengals vs. Dolphins score prediction: Bengals 28, Dolphins 25\nWant more Week 16 NFL picks?You've seen the model's best bets for Cincinnati Bengals vs. Miami Dolphins. Now, get against the spread, total and money-line picks for every Week 16 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bengals vs. Dolphins picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/917ff098-0f6d-4e70-98f2-6597888abdc7/thumbnail/1200x675/ab0a075d87d9c8dadd90260d861d0156/quinn-ewers.jpg"
      ],
      "datePublished": "2025-12-20T18:51:13.000Z",
      "dateModified": "2025-12-20T18:51:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Jets vs. Saints picks, score prediction for NFL Week 16 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-saints-where-to-watch-nfl-week-16-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/85b632df-555d-4391-abec-20f6b1055858/thumbnail/1200x675/64dd9aaa46eb6c4f8f96bacd655211cf/saints-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-20T18:44:35.000Z",
    "description": "\nA pair of last-place teams square off in Week 16 action as the New Orleans Saints welcome the New York Jets to town as both teams aim to finish the y",
    "body": "\nA pair of last-place teams square off in Week 16 action as the New Orleans Saints welcome the New York Jets to town as both teams aim to finish the year on high notes under their respective rookie head coaches. It's been tough sledding for both sides, with New York 3-11 and having started three quarterbacks due to injury and poor play, while New Orleans has turned things over to rookie Tyler Shough as the Saints try to see if he's the guy moving forward. Kickoff from Caesars Superdome is set for 1 p.m. ET on CBS and Paramount+. The Saints are 4.5-point favorites, per the latest Jets vs. Saints odds from DraftKings, while the over/under for total points scored is 40.5. Before making any Saints vs. Jets picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Jets vs. Saints on SundayWhen: Sunday, Dec. 21Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppJets vs. Saints betting previewOdds: Saints -4.5, over/under 40.5The Jets have seen some low totals throughout the year, and they've leaned to the Over as a result, going 9-5 to the Over. The Saints have been far worse there, going 4-10 to the Over this year. New York has gone .500 against the spread this year at 7-7, while New Orleans is just a tick worse at 6-8 ATS.Jets vs. Saints SGPSaints -4.5Over 40.5Saints first half total points Over 10.5Bet it at DraftKings:\nModel's Jets vs. Saints score prediction, picksThe model's strongest play here is with the total, as it projects a higher-scoring game than the total would indicate. The Over hits in 62% of simulations, good for a rare 'A' grade. The model also has issued a 'B' grade for Saints -4.5 as New Orleans covers 53% of the time. Jets vs. Saints score prediction: Saints 27, Jets 21\nWant more Week 16 NFL picks?You've seen the model's best bets for New York Jets vs. New Orleans Saints. Now, get against the spread, total and money-line picks for every Week 16 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Jets vs. Saints picks, score prediction for NFL Week 16 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/85b632df-555d-4391-abec-20f6b1055858/thumbnail/1200x675/64dd9aaa46eb6c4f8f96bacd655211cf/saints-imagn.jpg"
      ],
      "datePublished": "2025-12-20T18:44:35.000Z",
      "dateModified": "2025-12-20T18:44:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. Commanders prediction, odds, time: NFL Week 16 Saturday picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-commanders-prediction-odds-line-spread-start-time-nfl-week-16-saturday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/80d06b8a-6326-4c7a-97e8-d017ade23792/thumbnail/1200x675/c28dc5195bddb05a42ce7b8b0c1e5715/jalen-hurts-philadelphia-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-20T20:06:48.000Z",
    "description": "\nThe Philadelphia Eagles can clinch the NFC East when they visit the rival Washington Commanders in an NFL Week 16 Saturday matchup. Philly (9-5) ende",
    "body": "\nThe Philadelphia Eagles can clinch the NFC East when they visit the rival Washington Commanders in an NFL Week 16 Saturday matchup. Philly (9-5) ended a three-game losing streak with a 31-0 shutout victory over the Las Vegas Raiders on Sunday. Washington (4-10) ended an eight-game losing streak by defeating the New York Giants, 29-21, in Week 15. Jayden Daniels (elbow) and Laremy Tunsil (oblique) are the most notable absences for Washington. Philadelphia will be without Lane Thomas (foot) and Jalen Carter (shoulders).Kickoff is at 5 p.m. ET from Northwest Stadium in Landover, Md. Philadelphia is the 7-point favorite in the latest Eagles vs. Commanders odds, while the over/under for total points scored is 44.5 via DraftKings Sportsbook. Before making any Commanders vs. Eagles picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Commanders vs. Eagles. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Eagles vs. Commanders:Commanders vs. Eagles                                                                     spreadPhiladelphia -7 at DraftKings SportsbookCommanders vs. Eagles                 over/under44.5 pointsCommanders vs. Eagles                                                                                                                                                                                 money line Philadelphia -379, Washington +296Commanders vs. Eagles                                                                                                                                                                        picksSee picks at SportsLineCommanders vs. Eagles                                                                                                                                                                           streaming Fubo (Try for free)   \nWhy the Eagles can coverThe last time these teams met -- in the 2025 NFC Championship Game -- Philly put 55 points on the scoreboard, which is the most in NFL history in any conference title game. Additionally, Philadelphia has owned this rivalry since Jalen Hurts entered the picture, as the team is 6-1 versus Washington in games Hurts starts and finishes, with the quarterback having 16 total touchdowns versus two interceptions. The Eagles' defense is also coming off its best performance in shutting out Vegas, and now it gets to face a Commanders team onto its backup quarterback, and one which doesn't have a defense to make up for Daniels' absence. Washington is No. 31 in total defense, with additional bottom-five rankings versus the run, versus the pass and in the red zone. See which team to back at SportsLine. Why the Commanders can coverWashington is coming off scoring its second-most points (29) of the season on Sunday, and it still has a potent rushing attack even without Daniels. The Commanders boast the No. 4 rushing offense, averaging 141.8 yards over their last four games, and stopping the ground game is an issue for the Eagles. They are No. 22 in stopping the run, having allowed 165.3 yards over their last three games, and Philly can also be sloppy with the ball, having committed nine turnovers over their last four games. Also, Washington has covered in two of its last three games overall, while Philly is just 1-3 ATS in divisional games this year. See which team to back at SportsLine.How to make Eagles vs. Commanders picksSportsLine's model has simulated Commanders vs. Eagles 10,000 times and is going Over on the total, projecting 47 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Eagles vs. Commanders, and which side of the spread is the better value? Visit SportsLine now to see which side of the Commanders vs. Eagles spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. Commanders prediction, odds, time: NFL Week 16 Saturday picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/80d06b8a-6326-4c7a-97e8-d017ade23792/thumbnail/1200x675/c28dc5195bddb05a42ce7b8b0c1e5715/jalen-hurts-philadelphia-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-12-20T20:06:48.000Z",
      "dateModified": "2025-12-20T20:06:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers vs. Bears prediction, odds, time, spread: Saturday Week 16 NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-bears-prediction-odds-spread-start-time-week-16-nfl-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/e4842db6-cbd5-4e26-a2e1-a25ed79ba717/thumbnail/1200x675/90fb9f5be21b2611e162447f25f1f8ee/jordan-love-green-bay-packers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-20T16:30:43.000Z",
    "description": "\nControl of the NFC North will be on the line when the Green Bay Packers battle the Chicago Bears on Saturday night. Chicago moved back into first pla",
    "body": "\nControl of the NFC North will be on the line when the Green Bay Packers battle the Chicago Bears on Saturday night. Chicago moved back into first place on Sunday when the Bears defeated the Cleveland Browns 31-3, while Green Bay dropped a 34-26 decision to the Denver Broncos. The Packers (9-4-1), who are 4-0 within the division, are 4-2-1 on the road this season. The Bears (10-4), who are 1-3 in the division, are 5-1 on their home field in 2025. Both teams are dealing with a substantial injury list. Green Bay lost Micah Parsons (knee) for the season last week. The Bears won't have Rome Odunze (foot) or Luther Burden III (ankle), while D'Andrew Swift (groin) and Cole Kmet (ankle/knee) are among the players listed as questonable. Kickoff from Soldier Field in Chicago is set for 8:20 p.m. ET. Chicago is a 1.5-point favorite in the latest Packers vs. Bears odds, while the over/under for total points scored is 45.5 via DraftKings Sportsbook. Before making any Bears vs. Packers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Packers vs. Bears. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Bears vs. Packers:Packers vs. Bears                                                                     spreadChicago -1.5 at DraftKings SportsbookPackers vs. Bears                 over/under45.5 pointsPackers vs. Bears                                                                                                                                                                                 money line Chicago -117, Green Bay -102Packers vs. Bears                                                                                                                                                                         picksSee picks at SportsLinePackers vs. Bears                                                                                                                                                                           streaming Fubo (Try for free)   \nWhy the Packers can coverQuarterback Jordan Love continues to play at a high level. In 14 games, he has completed 66.4% of his passes for 3,304 yards and 23 touchdowns with six interceptions and a 101.9 rating. He has also rushed 45 times for 192 yards (4.3 average) with two explosive runs of 20 or more yards, including a long of 25. In a 31-24 win at Detroit on Thanksgiving Day, he completed 18 of 30 passes for 234 yards and four touchdowns.Also helping power the Packers' offense is running back Josh Jacobs (questionable, knee/ankle) In 13 games, Jacobs has carried 218 times for 890 yards (4.1 average) and 13 touchdowns. He has three explosive plays of 20 yards or more, including a long of 40, with 53 first-down conversions. He also has 33 receptions for 270 yards and one touchdown. See which team to back at SportsLine. Why the Bears can coverSecond-year quarterback Caleb Williams leads the Chicago offense. In 14 starts this season, he has completed 58% of his passes for 3,150 yards and 21 touchdowns with six interceptions and an 88.8 rating. He has also carried 68 times for 334 yards (4.9 average) and three touchdowns. In the win over the Browns, he completed 17 of 28 passes for 242 yards and two touchdowns.Running back D'Andre Swift (questionable, groin) powers the rushing attack. In 13 games, he has carried 191 times for 935 yards (4.9 average) and seven touchdowns. He also has 29 receptions for 254 yards and one touchdown. In a 24-15 win at Philadelphia on Nov. 28, he carried 18 times for 125 yards (6.9 average) and one touchdown. He carried 18 times for 98 yards and two touchdowns in the win over Cleveland. See which team to back at SportsLine.How to make Packers vs. Bears picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits almost 60% of the time.         You can only get the pick at SportsLine. So who wins Packers vs. Bears, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Packers vs. Bears spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers vs. Bears prediction, odds, time, spread: Saturday Week 16 NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/e4842db6-cbd5-4e26-a2e1-a25ed79ba717/thumbnail/1200x675/90fb9f5be21b2611e162447f25f1f8ee/jordan-love-green-bay-packers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-20T16:30:43.000Z",
      "dateModified": "2025-12-20T16:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bills vs. Browns picks, score prediction for NFL Week 16 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-browns-where-to-watch-nfl-week-16-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/2b406bd0-df19-4f80-b8f6-0cb52e180044/thumbnail/1200x675/107ae7f7ef19b137b638be5093526c82/cook.jpg",
    "tag": "Sports",
    "date": "2025-12-20T18:17:45.000Z",
    "description": "\nThe Buffalo Bills still have a lot to play for, but the Cleveland Browns can only play spoiler on Sunday when the teams meet in NFL Week 16. The Bill",
    "body": "\nThe Buffalo Bills still have a lot to play for, but the Cleveland Browns can only play spoiler on Sunday when the teams meet in NFL Week 16. The Bills (10-4) still have hopes of retaining the AFC East title and an outside shot at the AFC's top seed, but they sit a game behind the Patriots in the division with three games left. The Browns (3-11) are looking at another high draft pick, but quarterback Shedeur Sanders is sure to put up a fight to prove he has a future in Cleveland.    Kickoff from Huntington Bank Field is set for 1 p.m. ET on CBS and Paramount+. The Bills are 10.5-point favorites in the latest Bills vs. Browns odds at DraftKings, and the over/under for total points scored is 41.5. Before you make any Browns vs. Bills picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Bills vs. Browns on SundayWhen: Sunday, Dec. 21Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppBills vs. Browns betting previewOdds: Bills -10.5, Over/Under 41.5Cleveland is 5-9 against the spread after failing to cover in 11 straight to end last season. The Bills are 7-7 ATS but have beaten the Browns in five of the past seven meetings (5-1-1 ATS). Both teams are 7-7 on the over/under, but Cleveland is 5-3 to the Over in its past eight. Only one of those totals was over 38 points, when their 32-13 loss to the Patriots went Over the 40.5 total. No Bills total has been set below 44, and they went Over 49.5 and 55 the past two weeks. Both teams allow more than 23 points per game, but Cleveland scores 16 points (fourth-fewest in NFL) and Buffalo averages 29.4 (third-most).   Bills vs. Browns SGPBrowns -10.5Shedeur Sanders Over 174.5 passing yardsJames Cook Over 87.5 rushing yards Bet it at DraftKings:\nModel's Bills vs. Browns score prediction, picksThe model sees some value in backing the Bills on the money line, giving it a 'B' grade, as they are winning outright in 25% of simulations as +461 underdogs. The Bills are covering 51% of the time, and there is a slight lean to the Over, which is hitting in half the simulations. The SportsLine props projections peg Sanders for 221.8 yards, well over his total at DraftKings. The rookie is averaging 225 passing yards in his four starts. Cook has topped 100 rushing yards in three of his past four games, and the model projects him for 105 yards.Bills vs. Browns score prediction: Bills 27, Browns 16\nWant more Week 16 NFL picks?You've seen the model's best bets for Buffalo Bills vs. Cleveland Browns. Now, get against the spread, total and money-line picks for every Week 16 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bills vs. Browns picks, score prediction for NFL Week 16 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/2b406bd0-df19-4f80-b8f6-0cb52e180044/thumbnail/1200x675/107ae7f7ef19b137b638be5093526c82/cook.jpg"
      ],
      "datePublished": "2025-12-20T18:17:45.000Z",
      "dateModified": "2025-12-20T18:17:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami vs. Texas A&M prediction, odds, spread: 2025 College Football Playoff first-round expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-college-football-playoff-first-round-odds-prediction-texas-a-m-miami-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/f503be3b-094b-43fa-9621-94a3f1fabac2/thumbnail/1200x675/6ff6aee8eeb73d0c17aa113a48e1428a/rueben-bain-miami-hurricanes-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-20T16:03:57.000Z",
    "description": "\n        The 10th-ranked Miami (Fla.) Hurricanes face the seventh-ranked Texas A&M Aggies in a first-round 2025 College Football Playoff matchup on Sa",
    "body": "\n        The 10th-ranked Miami (Fla.) Hurricanes face the seventh-ranked Texas A&M Aggies in a first-round 2025 College Football Playoff matchup on Saturday. Miami finished its season with a 38-7 win at Pittsburgh on Nov. 29, while Texas A&M dropped a 27-17 decision at Texas on Nov. 28. Miami (10-2), who finished tied with four other teams for second in the ACC at 6-2, have won four games in a row. The Aggies (11-1), who tied for first with three other teams in the SEC at 7-1, have outscored their opponents by 173 points.Kickoff from Kyle Field in College Station, Texas, is set for noon ET. The Aggies are 3-point favorites in the latest Miami vs. Texas A&M odds from SportsLine consensus, while the over/under for total points scored is 48.5. Before making any Texas A&M vs. Miami picks, make sure you check out what SportsLine expert, Matt Severance, has to say. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:Severance is a well-connected writer and high-volume handicapper who has worked in the industry since 2005. He enters the weekend as SportsLine's No. 1 college football expert as he's on a 62-39-1 run, returning $1,126 to $100 players. Anyone who has followed him could be way up. Now Severance has set his sights on Miami vs. Texas A&M and just locked in his picks and CFP predictions. You can head to SportsLine now to see Severance's picks. Here are the FBS college football odds and trends for Miami vs. Texas A&M:Miami vs. Texas A&M                                                                                                                             spreadTexas A&M -3Miami vs. Texas A&M                                                                                                                         over/under48.5 pointsMiami vs. Texas A&M                                                                                                                                                                                                                                         money line Texas A&M -145, Miami +123Miami vs. Texas A&M                                                                                                                                                                                                                                 picksSee picks at SportsLineMiami vs. Texas A&M                                                                                                                                                                                                                                   streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. Why Texas A&M can coverSophomore Marcel Reed helps lead the Aggies' attack. In 12 games, the dual-threat quarterback has completed 61.8% of his passes for 2,932 yards and 25 touchdowns with 10 interceptions. He has also rushed 89 times for 466 yards (5.2 average) and six touchdowns. In a 49-25 win at LSU on Oct. 25, he completed 12 of 21 passes for 202 yards, while rushing 13 times for 108 yards and two touchdowns.His top weapon in the passing game is junior wide receiver KC Concepcion. In 12 games, he has 57 receptions for 886 yards (15.5 average) and nine touchdowns. He has also rushed eight times for 63 yards (7.9 average) and one touchdown. In a 31-9 win over Mississippi State on Oct. 4, he caught four passes for 61 yards and two scores. See which team to back at SportsLine.Why Miami can cover Senior quarterback Carson Beck powers the Hurricanes' offense. He has completed 74.7% of his passes for 3,072 yards and 25 touchdowns with 10 interceptions and a 165.8 rating. He has also rushed for one score. In the win over Pittsburgh, he completed 23 of 29 passes for 267 yards and three touchdowns with one interception. He completed 27 of 32 passes for 320 yards and four touchdowns in a 34-17 win at Virginia Tech on Nov. 22.Miami's top wide receiver is freshman Malachi Toney. In 12 games, he has 84 receptions for 970 yards and seven touchdowns. He has also rushed 17 times for 89 yards and a score. In the win over Pittsburgh, he caught 13 passes for 126 yards and one touchdown. He had 12 receptions for 146 yards and one score in the win at Virginia Tech. See which team to back at SportsLine.How to make Miami vs. Texas A&M picksSeverance is leaning Under on the total (48.5 points). He's also found a critical x-factor that has him jumping on one side of the spread. You can see what it is at SportsLine.Who wins Miami vs. Texas A&M, and what critical x-factor makes one side of the spread hit hard? Visit SportsLine now to find out, all from the top-ranked expert who is on a 62-39 roll on college football picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami vs. Texas A&M prediction, odds, spread: 2025 College Football Playoff first-round expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/f503be3b-094b-43fa-9621-94a3f1fabac2/thumbnail/1200x675/6ff6aee8eeb73d0c17aa113a48e1428a/rueben-bain-miami-hurricanes-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-20T16:03:57.000Z",
      "dateModified": "2025-12-20T16:03:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ole Miss vs. Tulane prediction, odds: 2025 College Football Playoff picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-tulane-prediction-odds-2025-college-football-playoff-first-round-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/325319c0-f994-4c47-b318-59efbe7d38a0/thumbnail/1200x675/6af042e7ecee29e48e92239819893d2d/trinidad-chambliss-ole-miss-rebels-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-20T17:58:44.000Z",
    "description": "\n        The 11th-seeded Tulane Green Wave will take on No. 6 Ole Miss Rebels in a 2025 College Football Playoff first-round matchup on Saturday. Tula",
    "body": "\n        The 11th-seeded Tulane Green Wave will take on No. 6 Ole Miss Rebels in a 2025 College Football Playoff first-round matchup on Saturday. Tulane won the AAC title with a 34-21 win over North Texas on Dec. 5, while Ole Miss finished the regular season with a 38-19 win at Mississippi State. The Green Wave (11-2), who finished 7-1 in the American, are 2-1 against ranked opponents this season. The Rebels (11-1), who finished tied for first in the SEC at 7-1, are 2-1 against ranked foes in 2025. These teams met in the regular season on Sept. 20 and Ole Miss won 45-10, easily covering as 10.5-point favorites. Jon Sumrall, who has taken the Florida job, will still coach for Tulane in this game. Pete Golding has taken over for Ole Miss after Lane Kiffin's departure to LSU. Kickoff from Vaught-Hemingway Stadium in Oxford, Miss., is at 3:30 p.m. ET. The Rebels are 17-point favorites in the latest Tulane vs. Ole Miss odds, while the over/under for total points scored is 57.5. Before making any Ole Miss vs. Tulane picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Tulane vs. Ole Miss. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Ole Miss vs. Tulae:Tulane vs. Ole Miss                                                                                                                                 spreadOle Miss -17 at DraftKings SportsbookTulane vs. Ole Miss                                                                                                                             over/under57.5 pointsTulane vs. Ole Miss                                                                                                                                                                                                                                             money line Ole Miss -935, Tulane +609Tulane vs. Ole Miss                                                                                                                                                                                                                                     picksSee picks at SportsLineTulane vs. Ole Miss                                                                                                                                                                                                                                       streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. Why Ole Miss can coverThe Rebels are led by senior quarterback Trinidad Chambliss. In 12 games, he has completed 65.5% of his passes for 3,016 yards and 18 touchdowns with three interceptions. He has also rushed 118 times for 470 yards (4.0 average) and six touchdowns. In the September win over Tulane, he completed 17 of 27 passes for 307 yards and two touchdowns.Sophomore running back Kewan Lacy powers the Rebels' rushing attack. In 12 games, he has carried 258 times for 1,279 yards (5.0 average) and 20 touchdowns. In the win over Mississippi State, he carried 27 times for 143 yards and one touchdown. In a 34-24 win over Florida on Nov. 15, he carried 31 times for 224 yards and three scores. See which team to back at SportsLine.Why Tulane can cover Junior quarterback Jake Retzlaff leads the Green Wave offense. In 13 games, he has completed 62.4% of his passes for 2,862 yards and 14 touchdowns with six interceptions. He has also carried 118 times for 610 yards (5.2 average) and 16 touchdowns. In a 38-32 win at Memphis on Nov. 7, he completed 16 of 23 passes for 332 yards and three touchdowns, while rushing 10 times for 43 yards and a score. The top pass catcher is junior wide receiver Shazz Preston. He leads the team with 38 receptions for 598 yards (15.7 average) and four touchdowns. In the win over Memphis, he caught three passes for 85 yards and two touchdowns, including a long of 65. In a 24-17 win over Army on Oct. 18, he caught five passes for 86 yards and a score. See which team to back at SportsLine.How to make Tulane vs. Ole Miss picksSportsLine's model is going Over on the total. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.  So who wins Ole Miss vs. Tulane, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Tulane vs. Ole Miss spread to jump on, all from the advanced model that's up on its top-ranked money-line picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ole Miss vs. Tulane prediction, odds: 2025 College Football Playoff picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/325319c0-f994-4c47-b318-59efbe7d38a0/thumbnail/1200x675/6af042e7ecee29e48e92239819893d2d/trinidad-chambliss-ole-miss-rebels-imagn-images.jpg"
      ],
      "datePublished": "2025-12-20T17:58:44.000Z",
      "dateModified": "2025-12-20T17:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff betting line movement, including Tulane at Ole Miss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/line-movements-for-college-football-playoff-including-tulane-at-ole-miss/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/3f6dfeb6-35fd-4721-a7c5-7c8185fd9263/thumbnail/1200x675/da84129724300a25d84ece96d16285ec/usatsi-27131450-1-1.jpg",
    "tag": "Sports",
    "date": "2025-12-20T17:22:55.000Z",
    "description": "\n        The College Football Playoff is officially in full swing after kicking off with an Alabama comeback win over Oklahoma Friday night after the ",
    "body": "\n        The College Football Playoff is officially in full swing after kicking off with an Alabama comeback win over Oklahoma Friday night after the Tide fell behind 17-0 early before rallying to a 34-24 win, earning them a date with Indiana in the Rose Bowl. The rest of the first round continues Saturday, including a rematch of a game we saw a few months ago. Ole Miss hosts Tulane, which won the AAC to punch its ticket to the playoff, and back in September, the Rebels dominated en route to a 45-10 win. Things have changed mightily since then, however, as the Green Wave won all but one game since then while the Rebels now have a new head coach. Lane Kiffin left Ole Miss for LSU ahead of the Rebels' CFP run, and the university promoted defensive coordinator Pete Golding to the full-time head coach position. And for good measure, Tulane is also in the midst of a coaching change with Jon Sumrall going to Florida once the Green Wave's season is over. The Rebels opened as 16-point favorites at top sportsbooks, but they're now favored by 17.5.Bet the College Football Playoff, including Oklahoma vs. Alabama, at DraftKings Sportsbook, where new users get $200 in bonus bets. Click here to sign up:So what should you make of that line movement? Is it a market correction or an overreaction? Here's a look at the point spread and line movement for Saturday's CFP games. All times Eastern.Bet College Football Playoff games at FanDuel Sportsbook, where new users get $150 in bonus bets. Click here:No. 11 Tulane at No. 6 Ole Miss (3:30 p.m. Saturday)Open: Ole Miss -16Last week: Ole Miss -17.5Current: Ole Miss -17.5Back on Sept. 20, the Rebels took care of the Green Wave with a 35-point win in Oxford, and the game wasn't even as close as that score may suggest. Ole Miss had 548 yards of offense to Tulane's 282, and the Rebels had a 45-3 lead before giving up a late score with just over three minutes left in the fourth quarter. Ole Miss winning by 35 is a big reason why early money came in on the Rebels despite the team having a new head coach for this postseason run after Kiffin's departure. Obviously, bettors don't believe Kiffin is worth 19 points on the point spread. No. 12 James Madison at No. 5 Oregon (7:30 p.m. Saturday)Open: Oregon -20Last week: Oregon -21.5Current: Oregon -20.5This is the kind of game in which the Ducks usually roll. Since Dan Lanning took over as coach in 2022, Oregon is 10-0 against non-major conference teams, with an average margin of victory of 36.3 points per game. However, this game may be a little different. First, James Madison is not your run-of-the-mill Group of Five team. The Dukes can run the ball (245.8 rushing yards per game, sixth in the country) and stop the run (76.2 rushing yards allowed per game, second in the nation). Also, even if this game gets out of hand, will the Ducks want to keep running their starters out there knowing they have a quarterfinal matchup against Texas Tech ahead? Oregon deserves to be a big favorite against a team that's losing coach Bob Chesney to UCLA after the season, but a backdoor cover is a possibility.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff betting line movement, including Tulane at Ole Miss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/3f6dfeb6-35fd-4721-a7c5-7c8185fd9263/thumbnail/1200x675/da84129724300a25d84ece96d16285ec/usatsi-27131450-1-1.jpg"
      ],
      "datePublished": "2025-12-20T17:22:55.000Z",
      "dateModified": "2025-12-20T17:22:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Commanders vs. Eagles where to watch: Kickoff time, TV, live stream, odds, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-vs-eagles-where-to-watch-pick-odds-prediction-saturday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/66ecdd6b-6568-4bd7-a805-31b7d49015d1/thumbnail/1200x675/9a8e4e8b6539e0670a642751d95873e8/gettyimages-2252295355.jpg",
    "tag": "Sports",
    "date": "2025-12-20T18:08:01.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Can Philly make it back-to-back victories and clinch the NFC East?\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 20, 2025\n                            \n                    at\n    1:07 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        In a game with a special Saturday evening kickoff in Week 16, the Washington Commanders play host to the division rival Philadelphia Eagles.Washington enters this game without its starting quarterback (Jayden Daniels), having captured a win last week after previously losing eight in a row. The Commanders have backslid tremendously after their remarkable season last year, and are now playing out the string and fighting for draft positioning.\nPhiladelphia, meanwhile, broke its own three-game losing streak with a win a week ago. The Eagles' playoff positioning is still pretty safe thanks to their sizable division lead and remaining schedule (which features two games against this Washington team in the final three weeks), but they surely want to get themselves fully back on track before they head into the postseason.Will the Eagles make it back to back wins, or will the Commanders pull off a surprising upset? We'll find out soon enough. But before we break down some key storylines, here's a look at how you can watch the game. Where to watch Commanders vs. EaglesDate: Saturday, Dec. 20 | Time: 5 p.m. ETLocation: Northwest Stadium (Landover, Maryland)TV: FOX | Streaming: Fubo (Try for free) Follow: CBS Sports AppOdds: Eagles -6.5, O/U 44.5 via DraftKings SportsbookKey StorylinesPlayoff picture. The Eagles are 9-5 and enter this game 2.5 games ahead of the Cowboys in the division race. In other words, the Eagles clinch the division if they come away with a win here. They're also one game behind the Bears in the race for the No. 2 seed in the NFC, but they'll need to finish with a better record than Chicago in order to win that race because the Bears beat them a few weeks ago. That likely means the Eagles need to win out in order to move up from their current slot as the third seed in the conference.Jayden Daniels injury. Daniels will miss his eighth game of the season here, giving way to Marcus Mariota once again. He's also out for the remainder of the year. After the way his rookie season went, everything that's happened this year has been depressing. It probably makes sense for Washington to hold him out, even with the injury being to his non-throwing elbow, but not being able to see him go up against this Eagles defense is a missed opportunity for football fans.Eagles offense. The Eagles dropped 387 yards, 27 first downs and 31 points on the Raiders last week. Considering they had been averaging 317.4 yards, 16.2 first downs and 16.2 points in their five games since their Week 9 bye, it was an extraordinarily welcome development. Lane Johnson remains out, but Landon Dickerson will play, and that should help them maintain some of what they were able to accomplish last week. Jalen Hurts, Saquon Barkley, A.J. Brown, DeVonta Smith and Dallas Goedert should be able to feat on a weak defense here.Prediction\nPhiladelphia seemed to get back on track offensively against the Raiders last week. While you might be saying \"yeah but that was against the Raiders defense,\" I would like to introduce you to the Commanders defense, which is not much better. I can't say I trust Marcus Mariota and the Washington offense enough to hang with Philly -- even with Jalen Carter still out. \nPick: Eagles 27, Commanders 16\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Commanders vs. Eagles where to watch: Kickoff time, TV, live stream, odds, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/66ecdd6b-6568-4bd7-a805-31b7d49015d1/thumbnail/1200x675/9a8e4e8b6539e0670a642751d95873e8/gettyimages-2252295355.jpg"
      ],
      "datePublished": "2025-12-20T18:08:01.000Z",
      "dateModified": "2025-12-20T18:08:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mets poach top international prospect from Yankees, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/yankees-international-prospect-mets-scouting/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/d0a293f0-e637-44e0-8eb5-7abf2f7b68b3/thumbnail/1200x675/a51723f49a20eb3acae47764cef3742c/generic-mets-logo-g.jpg",
    "tag": "Sports",
    "date": "2025-12-20T16:33:52.000Z",
    "description": "\n        Dominican shortstop Wandy Asigen, one of the top prospects for the 2026 international signing period, will sign with the New York Mets after ",
    "body": "\n        Dominican shortstop Wandy Asigen, one of the top prospects for the 2026 international signing period, will sign with the New York Mets after previously agreeing to a deal with the New York Yankees, reports Baseball America. Asigen's signing bonus is expected to be in the $3.8 million range. The 2026 signing period opens on Jan. 15. The Yankees and Asigen had a verbal agreement in place, which is common in international amateur free agency, even though such agreements are technically against the rules. New York cut ties with international scouting director Donny Rowland in November; however, at that point, Asigen backed out of his agreement and shopped around for a new deal, per the New York Post.\"His  contract had expired, so just like everything else, you've got to make  some very difficult decisions,\" Yankees GM Brian Cashman said about Rowland last month (via MLB.com). \"I've been involved with  Donny Rowland for a long time. But fork in the road, contract had  expired, and so I made the difficult decision to look for a different  lead voice in that chair.\"Asigen's situation is similar to that of a college recruit who changes his commitment after the head coach is fired. It is not uncommon for teams to back out of verbal agreements -- the Los Angeles Dodgers backed out of several deals to save their bonus pool money for Roki Sasaki last offseason -- though it's not often a player backs out of a deal, especially a top-ranked one like Asigen. \n\n        \n            \n                Dodgers rack up record-smashing $169 million luxury tax bill; Blue Jays, Yankees among eight others paying CBT\n                \n                    Mike Axisa                \n            \n                            \n    \n                \n                    \n    \nMLB Pipeline ranks Asigen, 16, as the second best prospect for the 2026 international signing period. Here's their scouting report:Asigen has been heralded as having arguably the most advanced  offensive profile among his class ... He has ripped off 110+ mph exit velocities  and is repeatedly able to find the barrel during in-game action. Asigen  has a knack for creating loft from his frame, something that should  allow him to continue to tap into his above-average power as he  continues to fill out. The quickness of his hands has evaluators excited  about the future potential impact he can have with the bat. \tDefensively,  many of those same actions work in his favor. While his arm is merely  average at this stage, he performs many of the quick-twitch movements  that evaluators look for when projecting a young player's ability to  stick at shortstop. Asigen has a nose for the ball and his wheels –  which have been clocked at 6.5 seconds on 60-yard dash times – allow him  to cover tons of ground laterally. \tThe annual international signing period is separate from the posting windows for Japanese league veterans Tatsuya Imai, Munetaka Murakami, and Kazuma Okamoto. Those players are all at least 25 years old and therefore able to sign a contract of any size. The international signing period applies to players under 25, the vast majority of whom are amateur players in Latin America. Teams are given a set bonus pool each international signing period. They can trade for an additional 60% of their bonus pool, but the pool is a hard cap. Small market teams have the largest 2026 bonus pool at just over $8 million, per Baseball America. The Mets and Yankees both have a $5.44 million bonus pool, so the Mets are giving most of their bonus money to Asigen. \nThe Yankees cut ties with Rowland after years of big-money misses in international free agency. From 2017-23, they gave out eight bonuses of at least $1 million, and only Jasson Domínguez and Kevin Alcántara (traded for Anthony Rizzo in 2021) have reached the big leagues. Five of the other six have yet to play above Single-A. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mets poach top international prospect from Yankees, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/d0a293f0-e637-44e0-8eb5-7abf2f7b68b3/thumbnail/1200x675/a51723f49a20eb3acae47764cef3742c/generic-mets-logo-g.jpg"
      ],
      "datePublished": "2025-12-20T16:33:52.000Z",
      "dateModified": "2025-12-20T16:33:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Miami vs. Texas A&M: Live stream, TV channel and time for CFP game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-texas-a-m-where-to-watch-time-date-channel-cfp-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/e4ce89fa-9c1a-451a-992f-91142d16cb06/thumbnail/1200x675/605cac89c9a6aa84b3591c514872c0ea/marcel-reed.jpg",
    "tag": "Sports",
    "date": "2025-12-20T17:00:49.000Z",
    "description": "\n        Saturday brings us one of the most anticipated first-round matchups of the College Football Playoff when No. 10 Miami visits No. 7 Texas A&M,",
    "body": "\n        Saturday brings us one of the most anticipated first-round matchups of the College Football Playoff when No. 10 Miami visits No. 7 Texas A&M, as both programs make their playoff debuts. The Hurricanes arrive after sneaking into the field as the final at-large bid following a late surge that left little margin for error. Texas A&M, meanwhile, used its three-week break to reset after closing the regular season with its only loss coming against Texas.Kyle Field has been a fortress this season, with the Aggies unbeaten at home, though some of their most impressive wins came away from College Station. Miami enters playing arguably its best football of the year, emerging as one of the nation's most dominant teams since Week 11 while effectively playing for its postseason life.The programs are no strangers, having split a home-and-home series in 2022 and 2023. Results against common opponents this season offer little separation: Miami beat Notre Dame and Florida by a combined 22 points, while Texas A&M topped the same two by 18 -- including a dramatic 41-40 win in South Bend.Follow along with live updates, highlight and analysis on Saturday as Miami battles Texas A&M in a first-round CFP showdown. \nWhere to watch Miami vs. Texas A&M liveDate: Saturday, Dec. 20 | Time: 12 p.m. ETLocation: Kyle Field -- College Station, TexasTV: ABC | Live stream: Fubo (Try for free)Miami vs. Texas A&M: Players to watchMarcel Reed, QB, Texas A&M: Reed was a legitimate Heisman Trophy contender before the Aggies' only loss of the season at Texas to close the regular season. In his first year as a full-time starter, he completed 61.8% of his passes for 2,932 yards and 25 touchdowns with 10 interceptions. Reed is also Texas A&M's second-leading rusher with 466 yards and six touchdowns on 89 carries, making him a dual-threat quarterback who can impact the game both through the air and on the ground.KC Concepcion, WR, Texas A&M: The Aggies' offense is loaded with weapons, and Concepcion has quickly emerged as the top target. The transfer from NC State made an immediate impact in his first season in College Station, tying for an SEC-leading nine touchdown catches while totaling 886 receiving yards. His counterpart Mario Craver complements him well, adding 825 yards and four touchdowns on the season, giving Texas A&M a dynamic duo that can stretch defenses.\nCashius Howell, DL, Texas A&M: A CBS Sports' first-team All-America selection, Howell finds himself in elite company as the first Aggies' defender to post 11.5 sacks in a season since Myles Garrett in 2014. He led the SEC in that category in 2025.Carson Beck, QB, Miami: Beck has been somewhat unstoppable recently, topping Power Four quarterbacks since Week 11 with 12 touchdown passes while completing nearly 80% of his throws. Miami's strong season has leaned heavily on his steady decision-making -- the Hurricanes are 8-0 when he limits interceptions to fewer than two, but slip to 1-2 when he tosses multiple interceptions.Malachi Toney, WR, Miami: Few newcomers to college football made a louder first impression than Toney did this season. Once an under-the-radar three-star recruit, he quickly became central to Miami's offense, stacking 84 receptions -- the sixth-most in the nation -- and leading the ACC with seven receiving touchdowns. His impact extended well beyond the passing game, as his speed translates to gadget runs and special teams duties.\nRueben Bain Jr., EDGE, Miami: The ACC Defensive Player of the Year, Bain is a projected first-round pick for the 2026 NFL Draft. He has 37 total tackles, including 7.5 for loss with 4.5 sacks, an interception and a forced fumble this season.Miami vs. Texas A&M prediction, pick\nThis really does feel like a coin-flip game, but Miami has enough subtle edges to make a strong case for the road upset. Both teams boast elite pass-protecting offensive lines and disruptive defensive fronts capable of affecting the quarterback, so clean execution will matter most. There's understandable concern about Carson Beck's history with turnovers in a hostile environment, yet Texas A&M hasn't consistently capitalized on those mistakes, with the second-fewest interceptions forced (3) this season in the FBS. If Miami protects the football -- something it has done well in big moments -- the Hurricanes' ability to create takeaways and manufacture explosive plays could be the deciding factor. Pick: Miami +3.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Miami vs. Texas A&M: Live stream, TV channel and time for CFP game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/e4ce89fa-9c1a-451a-992f-91142d16cb06/thumbnail/1200x675/605cac89c9a6aa84b3591c514872c0ea/marcel-reed.jpg"
      ],
      "datePublished": "2025-12-20T17:00:49.000Z",
      "dateModified": "2025-12-20T17:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Miami vs. Texas A&M: TV channel, stream, odds, prediction, pick for CFP game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-texas-a-m-prediction-picks-odds-cfp-first-round-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/e314668b-f73d-48ba-8667-13e682ce848d/thumbnail/1200x675/bae5526ac5bb7b00b290831180ebadec/miami.jpg",
    "tag": "Sports",
    "date": "2025-12-20T16:45:33.000Z",
    "description": "\n        No. 7 Texas A&M will play host to No. 10 Miami in a first-round matchup of the College Football Playoff at Kyle Field with some pivotal stake",
    "body": "\n        No. 7 Texas A&M will play host to No. 10 Miami in a first-round matchup of the College Football Playoff at Kyle Field with some pivotal stakes. The Aggies are fresh off a 11-1 season, the most wins for the program since 2012. However, Texas A&M struggled in its final regular-season game -- a loss against rival Texas. Miami started the 2025 season on fire, but had to recover after losing games to Louisville and SMU by a combined nine points midseason. The losses cost them a shot at playing for the ACC title, but blazing through the month of November was enough to deliver them their first College Football Playoff appearance as the final team in. Texas A&M and Miami have played five teams, including a recent home-and-home series in 2022-23. The Hurricanes won 48-33 in their most recent matchup, the second game for Miami offensive coordinator Shannon Dawson. However, the matchup will look much different with Mike Elko now leading Texas A&M. Follow along with live updates, highlight and analysis on Saturday as Miami battles Texas A&M in a first-round CFP showdown. \n  Miami vs. Texas A&M: Need to know  War in the trenches: Miami and Texas A&M come into the matchup boasting some of the top trench play of any teams in the playoff. Hurricanes offensive lineman Francis Mauigoa leads a unit that allowed only 11 total sacks this year. The Aggies were close behind at 12, both ranking top 11 nationally. But, Texas A&M also leads the nation with 41 sacks behind All-American defensive end Cashius Howell, and Miami had 34. The chess match between the lines will be the matchup of the weekend. Star receivers: Texas A&M invested heavily into its wide receiver corps and the unit has carried the program to new heights. Transfers KC Concepcion and Mario Craver each posted at least 50 catches for 800 yards, and others like Ashton Bethel-Roman and tight end Nate Boerkircher have each come up big in major moments. Few teams are built to win outside in, but the Aggies have that kind of ability. All eyes on Bain: If the Heisman was given in September, Miami defensive end Rueben Bain Jr. might have walked away with it. The defensive end was unbelievable, wreaking havoc and making disruptive plays during a 5-0 start. However, both his production and grading have fallen off precipitously. Bain posted 1.5 sacks in the season finale against Pittsburgh; could he wake up in the season's most important moments? \n  Where to watch Miami vs. Texas A&M live  Date: Saturday, Dec. 20 | Time: 12 p.m. ET  Location: Kyle Field -- College Station, Texas  TV: ABC | Live stream: Fubo (Start watching, save $20!)  Miami vs. Texas A&M prediction, picks  \nThe matchup between Texas A&M and Miami is a true heavyweight battle. Both teams have the upside to win the national championship if things break right, and the first round will be an important stress test. Miami quarterback Carson Beck has the experience edge, but Texas A&M's offense has an explosive component that will prove to be the difference in College Station. Pick: Texas A&M -3.5\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            A&M -3.5\n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    Who will win and cover in each college football bowl and playoff game? SportsLine's computer model just simulated each matchup 10,000 times and has revealed its picks. Visit SportsLine now to see all its college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Miami vs. Texas A&M: TV channel, stream, odds, prediction, pick for CFP game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/e314668b-f73d-48ba-8667-13e682ce848d/thumbnail/1200x675/bae5526ac5bb7b00b290831180ebadec/miami.jpg"
      ],
      "datePublished": "2025-12-20T16:45:33.000Z",
      "dateModified": "2025-12-20T16:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best NFL Week 16 picks and predictions: ATS picks, upsets and score projections - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/last-minute-nfl-week-16-picks-can-the-bears-fend-off-the-packers-in-nfc-north-clash/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/74a7dfd8-00a9-4ce2-b2fd-2cdf56aee474/thumbnail/1200x675/230957ec34b2d01bf9672da849251a02/getty-caleb-williams-bears.jpg",
    "tag": "Sports",
    "date": "2025-12-20T18:08:50.000Z",
    "description": "\n        The NFL is getting good. Don't take my word for it, as we're coming off arguably the game of the year on Thursday night when the Seattle Seah",
    "body": "\n        The NFL is getting good. Don't take my word for it, as we're coming off arguably the game of the year on Thursday night when the Seattle Seahawks rallied to defeat the Los Angeles Rams in overtime. That victory punched Seattle's ticket to the playoffs, and as we turn our attention to the rest of the Week 16 slate, numerous teams are facing win-and-in playoff clinching scenarios. For instance, the New England Patriots and San Francisco 49ers simply need to win their matchup to ensure they'll have their hat in the ring for a Lombardi Trophy. Meanwhile, the Philadelphia Eagles can clinch the NFC East with a win, and a handful of other clubs need just a little luck to fall their way to clinch this weekend as well. That makes it a wildly entertaining slate not only to watch, but bet on. As we gear up for Week 16, which includes a doubleheader on Saturday, let's make sure you're sorted and have your wagers lined up before kickoff. Below, you can find our best bets of the week, along with picks for every game remaining on the slate. All odds via DraftKings Sportsbook.Green Bay Packers at Chicago BearsSaturday, 8:20 p.m. ET (Fox | Fubo, try for free)\nLosing Micah Parsons for the season due to a torn ACL is a gut punch for the Packers. The star pass rusher had 12.5 sacks on the season (tied for third-most in the NFL), and his absence completely changes how we look at the club's chances of making a Super Bowl run. It also changes how opposing offenses game plan against them, and should make life wildly easier for Caleb Williams and Co. as they look to keep hold of the NFC North crown. \nThese two rivals played a tight matchup at Lambeau Field just a few weeks ago, and I think Williams will be much better at Soldier Field this time around. The Bears quarterback has a better passer rating at home compared to his production on the road (99.2 vs. 81.6), along with a superior yards per attempt average (7.35 vs. 6.53) and TD-INT ratio (11-1 vs. 10-5).Meanwhile, the Packers' defense (even with Parsons) has been entirely different on the road. Away from Lambeau, Green Bay is giving up 25.6 points per game compared to just 14.6 points per game it surrenders at home. The Packers are also just 2-5 ATS on the road this season -- a 28.6% cover rate that is tied for the third-lowest in the NFL. The Bears take this one to keep control of the NFC North entering Week 17. Projected score: Bears 28, Packers 26The pick: Bears -1.5\n        \n            \n                NFL playoff picture: Ranking the 10 most important games shaping the 2025 postseason\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nNew York Jets at New Orleans SaintsSunday, 1 p.m. ET (CBS | Paramount+)\nLadies and gentlemen, the Saints have found a quarterback. Tyler Shough has turned it on in recent weeks, to the point where he may be playing himself into being the franchise's starter for 2026 and forcing the front office to punt on looking at the position this offseason. In his six starts this season, Shough is completing 69% of his throws and has a 92.1 passer rating. More recently, he's led New Orleans to back-to-back wins against division rivals in the Buccaneers and Panthers.\nNow, he's going up against a Jets defense that just allowed Trevor Lawrence to post six total touchdowns (five passing and one rushing), which led to the firing of defensive coordinator Steve Wilks. Shough shouldn't face much resistance this week, which could make it very hard for undrafted rookie Brady Cook to keep up in his second career start. Projected score: Saints 26, Jets 17The pick: Saints -6.5Tampa Bay Buccaneers at Carolina PanthersSunday, 1 p.m. ET (Fox | Fubo, try for free)\nBoth of these teams are coming off fourth-quarter collapses in Week 15, so neither is instilling a ton of confidence at this point in the NFC South race. That said, I think Tampa Bay is in a worse way. The club has lost five of its past six games and allowed 29.3 points per game over that stretch. On the year, the defense is 30th in passing yards per game allowed (246.9 yards) and in red zone efficiency (72.2% touchdown rate). Baker Mayfield has also struggled quite a bit on the road, owning a 1-3 record over his last four road starts while throwing for more interceptions (four) than touchdowns (three).All that has me fading the Bucs in this pivotal matchup, particularly with Carolina 9-1 ATS in its past 10 games as a home underdog. Bryce Young is also a much better quarterback at home, coming into this game with a 4-1 record at Bank of America Stadium this season with a 67.7% completion rate and a 98.5 passer rating. \nProjected score: Panthers 24, Buccaneers 21The pick: Panthers +3Jacksonville Jaguars at Denver BroncosSunday, 4:05 p.m. ET (Fox | Fubo, try for free)\nI don't know what it is, but I just can't get myself to buy the Jaguars quite yet. Sure, Trevor Lawrence's production last week was spectacular, and he leads the NFL in yards per attempt (8.6) and passing touchdowns (13) over the club's five-game winning streak. However, when you look at Jacksonville's opponents, it's hard to come away entirely impressed. For instance, the six-touchdown game in Week 15 came against the Jets.This Broncos defense is an entirely different animal, and the unit comes into this week with 58 sacks on the season (most by any team through 13 games since the 2000 Saints). Denver is also a perfect 7-0 straight-up at home this season, further emphasizing how tough of an out it has become overall. If the Jaguars can pull this off, I'll start looking at them differently, but I'm not expecting that to be the case. Projected score: Broncos 24, Jaguars 20The pick: Broncos -3.5San Francisco 49ers at Indianapolis ColtsMonday, 8:15 p.m. ET (ESPN | Fubo, try for free)\nWe faded Philip Rivers and the Colts hard last week against Seattle, and the 44-year-old made us pay, nearly pulling off the outright upset. While that made for a nice story, I think the Seahawks were caught not taking Rivers and Co. seriously and looking ahead to their massive matchup with the Rams on Thursday.\nI expect Kyle Shanahan and Robert Saleh to dial up things that'll make Rivers' life much more difficult than it was last week. As for the Niners, they are one of the sleeping giants in the NFC playoff picture. They've won four straight games by 10-plus points, and Brock Purdy has started to round into form. San Francisco is also 3-0 straight-up and ATS in prime-time games this season. Projected score: 49ers 30, Colts 19The pick: 49ers -5.5Rest of the bunchEagles at Commanders (Saturday)Projected score: Eagles 28, Commanders 17The pick: Eagles -7Bills at BrownsProjected score: Bills 27, Browns 16The pick: Bills -10.5Chargers at CowboysProjected score: Chargers 27, Cowboys 23The pick: Chargers +1.5\nChiefs at TitansProjected score: Chiefs 23, Titans 21The pick: Titans +3Bengals at DolphinsProjected score: Bengals 28, Dolphins 17The pick: Bengals -4.5Vikings at GiantsProjected score: Vikings 24, Giants 20The pick: Vikings -2.5Falcons at CardinalsProjected score: Falcons 27, Cardinals 23The pick: Falcons -3Steelers at LionsProjected score: Lions 30, Steelers 20The pick: Lions -7Raiders at TexansProjected score: Texans 30, Raiders 14The pick: Texans -14.5Patriots at RavensProjected score: Patriots 27, Ravens 24The pick: Patriots +3\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best NFL Week 16 picks and predictions: ATS picks, upsets and score projections - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/74a7dfd8-00a9-4ce2-b2fd-2cdf56aee474/thumbnail/1200x675/230957ec34b2d01bf9672da849251a02/getty-caleb-williams-bears.jpg"
      ],
      "datePublished": "2025-12-20T18:08:50.000Z",
      "dateModified": "2025-12-20T18:08:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]