[
  {
    "title": "2026 Genesis Invitational leaderboard: Rory McIlroy stellar, Scottie Scheffler not - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-leaderboard-2026-thursday-rory-mcilroy-scottie-scheffler/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/7b34ae19-6dde-42b4-b272-e89178576d82/thumbnail/1200x675/ccd867475d0ac5ff0d8095e0acf0b90e/rory-mcilroy-genesis-1-g.jpg",
    "tag": "Sports",
    "date": "2026-02-20T02:55:39.000Z",
    "description": "\n        On a day at Riviera Country Club that featured everything from a deluge of rain to a 3-hour weather delay to wind gusts hovering around 30 mi",
    "body": "\n        On a day at Riviera Country Club that featured everything from a deluge of rain to a 3-hour weather delay to wind gusts hovering around 30 miles per hour, a man who has done just about everything in the game of golf rose to the top of the leaderboard. Rory McIlroy was nearly flawless in the first round of the 2026 Genesis Invitational, shooting his lowest-ever score across the first 18 holes at Riviera with a 5-under 66 to sit one stroke behind Aaron Rai.Round 1 was suspended due to darkness with the likes of world No. 1 Scottie Scheffler, Xander Schauffele and Jordan Spieth all needing to complete the majority of their back nines on Friday when play resumes at 7 a.m. PT.Scheffler will take the interruption in stride as he was 5 over through 10 holes, 11 strokes off the lead and tied for last place when play was called. It's the third straight week in which the best player in the game has slipped out of the gate.McIlroy, meanwhile, was among the first players on the golf course; as such, he was able to finish his first round. He now looks to do what neither tournament host Tiger Woods nor legend Jack Nicklaus accomplished in their careers: win at the historic venue that is Riviera. On the line is not only the trophy and a signature event purse but the five-time major champion reaching the 30-win mark on the PGA Tour.\n\"I've definitely got more comfortable playing in conditions like this over the past few years as I've gotten more comfortable in controlling my ball flight, and controlling my ball flight taking a lot more club, hitting the ball low,\" McIlroy said. \"I've started to just really enjoy this style of golf. \"If you had asked me 10 years ago, I didn't enjoy these conditions, but it's been a shift in a mindset and maybe just a continuation of trying to build upon the skill set that I have. Then, when it does get to conditions like this, I'm a lot more prepared. I wouldn't say I enjoy them, but I can certainly handle them better.\"If McIlroy plays the next 54 holes in the same manner as his first 18, he will win this tournament. Battling and overcoming the conditions, he played golf in its truest essence -- flighting drives depending on the wind direction, leaving himself with easy leaves and taking care of the scoring holes.\nAttacking the early portions of both nines, McIlroy started his round emphatically, making birdie on three of his first four holes to propel himself to the top of the leaderboard. His birdie on the newly lengthened par-3 4th came right out of the rain delay as his first stroke produced a 30-foot birdie.\nOnce the rain subsided, wind entered the equation, and McIlroy answered masterfully. Showing off every tool in his belt, the 36-year-old headlined his grouping that featured another round in the 60s from Tommy Fleetwood -- the Englishman has broken 70 in 20 straight PGA Tour rounds -- and a nifty 68 from last week's winner Collin Morikawa. \"Just trying to keep the same mindset essentially,\" Morikawa said. \"You don't want to get too relaxed, but you also want to kind of find that zone to go out and play golf. A long day, a lot of back and forth kind of rain, no rain, a lot of wind, no wind. Just was able to get the ball in the hole, which was kind of the whole goal.\"\nLeader1. Aaron Rai (-6): Known as a Point A to Point B type of player, Rai kept everything in front of him on Thursday, and he was rewarded with a stellar performance on the greens. The Englishman opened with an eagle, tacked on six more birdies and made putts from nearly 80 feet on No. 9, 7 feet on No. 11, 21 feet on No. 13, 12 feet on No. 15 and finally 7 feet on No. 16. He will have a chance to extend his lead Friday morning as he starts his day on the par-5 17th.ContendersT2. Rory McIlroy, Jacob Bridgeman (-5)4. Ryan Fox (-4)T5. Pierceson Coody, Akshay Bhatia, Collin Morikawa, Aldrich Potgieter, Max Greyserman, Si Woo Kim, Marco Penge (-3)T12. Jhonattan Vegas, Taylor Pendrith, Maverick McNealy, Viktor Hovland, Hideki Matsuyama, Tommy Fleetwood, Ryo Hisatsune, Harry Hall (-2)Only two weeks into his PGA Tour season, and Hovland is already searching for answers with his driver. He may have found them on Thursday. Missing only two fairways, the Norwegian looked noticeably more comfortable with the big stick in hand and was sensational from tee to green. He will need to clean up his play on and around the green as all three bogeys were courtesy of some sloppy play in that area, but if his full swing is in order, he should love his placement.\n\"You might have seen the band drill that I was messing around with now. It's still trying to serve the same purpose, but I feel like that actually made it easier for me to find something tangible that I could take out on the golf course,\" Hovland said. \"Trying to just get a little bit wider in the downswing, not trying to pull my arms as close to me. That's what the floaties were for, trying to get some space in the downswing. It was just hard to feel that when I took the floaties away. \"But the band, because it forces your body to push against the tension, and then when you take it away, it's like, 'Wow, that's what it's supposed to feel like.' We're not quite all there yet, even though this is a great round of golf, but that was a huge step in the right direction.\"\nScheffler's Thursday struggles continueIt was an inauspicious start from the world No. 1 on the first hole as Scheffler found the surface on the easy par 5 only to need three putts and walk off the green with a par. That ultimately told the tale of his day as Scheffler never made it easy on himself.\nWith two bogeys in his first six holes, he started to head even further south on the leaderboard when he made a head-scratching double bogey on No. 8, which featured another three-putt. He turned in 4 over, made an ugly bogey on the devilish, short par-4 10th and made par on another scoring chance on the par-5 11th to put a bow on his day.Like the last three weeks, Scheffler faces a long climb back, and unlike last week, he will be staring the cutline directly in the face as the top 50 players and ties (as well as those within 10 strokes of the leader) will secure tee times over the weekend.2026 Genesis Invitational updated odds, picksOdds via DraftKings SportsbookRory McIlroy: +350Aaron Rai: 10-1Si Woo Kim: 13-1Jacob Bridgeman: 15-1Collin Morikawa: 15-1Tommy Fleetwood: 18-1Hideki Matsuyama: 19-1Scheffler is at 26-1, if that tickles your fancy, but instead, we will look at someone else on the golf course with holes remaining in his first round: Matt Fitzpatrick at 36-1. The Englishman is 1 under, through 15 holes and will have a couple of scoring chances coming in Friday morning. He made nothing on the greens Thursday, so if his fortunes change, he will make up some ground.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Genesis Invitational leaderboard: Rory McIlroy stellar, Scottie Scheffler not - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/7b34ae19-6dde-42b4-b272-e89178576d82/thumbnail/1200x675/ccd867475d0ac5ff0d8095e0acf0b90e/rory-mcilroy-genesis-1-g.jpg"
      ],
      "datePublished": "2026-02-20T02:55:39.000Z",
      "dateModified": "2026-02-20T02:55:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png",
    "tag": "Sports",
    "date": "2026-02-20T02:30:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA has already exceeded its overall medal tally, now at 27, and stands to add to both the overall count and possibly even the gold medal count. A win over Slovakia on Friday would assure the U.S. men's hockey team of some type of medal as it would advance to Sunday's final.On Thursday, figure skater Alysa Liu, 20, became the first American woman to take home a singles gold in 24 years and the U.S. women's hockey team rallied from a 1-0 third period deficit to a 2-1 overtime victory over rival Canada to reach the top of the podium for the first time in eight years. And speedskater Jordan Stolz added to his collection of two previous gold medals with a silver in the men's 1,500 meters.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Entering these Games, Norway had won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    1681034\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    912627\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    951226\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    68519\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    67316\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    66315\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    64414\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    58821\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    58518\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    571224\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    45615\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    33410\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    3216\n            \n        \n    \n        GBR\n    \n    \n        Great Britain\n    \n\n    3003\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    2237\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    2204\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    2114\n            \n        \n    \n        ESP\n    \n    \n        Spain\n    \n\n    1012\n            \n        \n    \n        BRA\n    \n    \n        Brazil\n    \n\n    1001\n            \n        \n    \n        KAZ\n    \n    \n        Kazakhstan\n    \n\n    1001\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0314\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0213\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0145\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0112\n            \n        \n    \n        GEO\n    \n    \n        Georgia\n    \n\n    0101\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png"
      ],
      "datePublished": "2026-02-20T02:30:04.000Z",
      "dateModified": "2026-02-20T02:30:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026 schedule: Where to watch U.S. men's hockey vs. Slovakia - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/0d3fb888-0491-4e9b-8395-b5a0334f68ed/thumbnail/1200x675/768980be55083ecf2d14b3dfa24bb99b/usa-hockey-getty.png",
    "tag": "Sports",
    "date": "2026-02-20T00:39:16.000Z",
    "description": "\n        The 2026 Milan Cortina Winter Olympics are beginning to wrap up with less than a week of action to go. On this final Friday of the Games, the",
    "body": "\n        The 2026 Milan Cortina Winter Olympics are beginning to wrap up with less than a week of action to go. On this final Friday of the Games, there are exciting events from ice hockey to short track speed skating.The U.S. men's hockey team will face Slovakia in the semifinals at 3:10 p.m. as they eye the gold medal game. Team USA defeated Sweden 2-1 in the quarterfinals in a game that took overtime while Slovakia is coming off a 6-2 win over Germany. The U.S. men's team is after its first gold medal since the \"Miracle on Ice\" in 1980.Elsewhere, Kristen Santos-Griswold is competing in the short track speed skating 1500m event, with the medal event coming after the quarterfinal and semifinal -- all on Friday.The men's biathlon 15km mass start medal event will feature Campbell Wright, the two-time runner-up at last year's Biathlon World Championships.\nQuinn Dehlinger is another American athlete with a chance to medal as he competes in the freestyle skiing men's aerials. In the 2023 and 2025 world championships, he came in second place. Elana Meyers Taylor already had an emotional win in the women's monobob, earning her first gold medal and her sixth medal overall. At 41, she is the oldest bobsled medalist since 1956. She will compete in the bobsleigh two-women alongside 23-year-old Jadin O'Brien with a chance to add more hardware to her collection. Kaillie Humphries and Kaysha Love are other Americans to watch in the event. \n        \n            \n                2026 Winter Olympics medal count: Keep track of Team USA's quest for gold in Italy\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nThe Milan Cortina Games will run through Sunday, Feb. 22, and in total 119 events will take place with 245 medals handed out to the athletes. Fans can find the action on NBC and its streaming service, Peacock, with an account or a cable login.\nThe Winter Games have eight main sports, with 16 disciplines. With so many events to keep up with, it can get overwhelming, but that's where we step in with the overall medal tracker and daily schedule.Winter Olympics schedule for Friday, Feb. 20SportEventTimeMedal Event?BobsleighFour-Man Official Training Heats 5 & 64 a.m.NoFreestyle SkiingWomen's Ski Cross Qualifying to Finals4 a.m. - 8 a.m.YesCurlingWomen's Semifinals, Canada vs. Sweden, United States vs. Switzerland8:05 a.m.NoBiathlonMen's 15km Mass Start8:15 a.m.YesSpeed SkatingWomen's 1500m10:30 a.m.YesIce HockeyMen's Semifinals, Canada vs. Finland10:40 a.m.NoBobsleighTwo-Woman Heats 1 & 2 12 p.m.NoCurlingMen's Bronze Medal Match, Norway vs. Switzerland1:05 p.m.YesFreestyle SkiingMen's Halfpipe1:30 p.m.YesShort Track Speed SkatingWomen's 1500m Quarterfinals to Final; Men's 5000m Relay Finals2:15 p.m. - 4:30 p.m.YesIce HockeyMen's Semifinals, United States vs. Slovakia3:10 p.m.No\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule: Where to watch U.S. men's hockey vs. Slovakia - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/0d3fb888-0491-4e9b-8395-b5a0334f68ed/thumbnail/1200x675/768980be55083ecf2d14b3dfa24bb99b/usa-hockey-getty.png"
      ],
      "datePublished": "2026-02-20T00:39:16.000Z",
      "dateModified": "2026-02-20T00:39:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-thursday-february-19-basketball-parlay-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-19T22:17:07.000Z",
    "description": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (",
    "body": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (-1.5), Celtics (-5.5) vs. Warriors and Nuggets (-4.5) vs. Clippers. The largest NBA spread of the day has Cleveland as 15.5-point favorites over Brooklyn, as the Cavs covered in four of their last five games heading into the NBA All-Star break.What are the NBA best bets for Thursday, and which combination of picks should you target in a Thursday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model exited the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.  \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +450. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $100 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Thursday, Feb. 19After simulating every game 10,000 times, the model is backing the Los Angeles Clippers (+4.5) to cover the spread against the Denver Nuggets at 10:30 p.m. ET. The Nuggets look for the season sweep over the Clippers, after posting a 130-116 win in Los Angeles on Nov. 12 and a 122-109 victory at Denver on Jan. 30. The Nuggets will be without Aaron Gordon (hamstring) and Peyton Watson (hamstring) and failed to cover in three of their last four heading into the All-Star break. Meanwhile, Los Angeles has won three of the last four meetings at home against Denver.\nVeteran forward Kawhi Leonard powers the Clippers' offense. In 41 games, all starts, he is averaging 27.9 points, 6.4 rebounds, 3.7 assists and 2.1 steals in 32.8 minutes. He registered a double-double with 27 points and 12 rebounds in a 105-102 win over the Houston Rockets on Feb. 11 and is coming off an epic All-Star Game performance with 31 of the 48 points for USA Stripes against Team World.The model is projecting four Nuggets players to score 10.7 points or more, led by Nikola Jokic's 27.5 points. The Clippers, meanwhile, are projected to be led by Leonard's 30.5 points as five Los Angeles players score 10.2 points or more. The model is backing Los Angeles to cover nearly 70% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Thursday, Feb. 19The model also has locked in two more picks, including backing a team to win in nearly 80% of model simulations. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Thursday, and which best bets should you target for a chance at a payout of over +450? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-19T22:17:07.000Z",
      "dateModified": "2026-02-19T22:17:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-anti-tanking-rule-changes-next-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T00:27:30.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tank",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tanking issues intensified throughout the All-Star break and will result in tangible changes starting next season. Commissioner Adam Silver informed the NBA's general managers on Thursday that the league plans on making anti-tanking rule adjustments to take effect in the 2026-27 season, according to ESPN.While the league has yet to announce the exact measures it will take to combat tanking, it reportedly discussed over the last month seven potential rule changes. Some of the proposals reflect those suggested by fans in recent weeks as tanking became the NBA's most hot-button topic.The seven potential rule changes are as follows:Allowing protection of first-round draft picks only for selections in the top four or outside the top 14Freezing lottery odds at the trade deadline or laterPreventing teams to pick in the top four in consecutive years and/or after consecutive bottom-three finishesDisallowing teams to pick in the top four the year after reaching the conference finalsAllocating lottery odds based on two-year rolling recordsExtending the lottery to include all play-in teamsFlattening the odds for all lottery teamsAll of the proposals would reduce the incentive to intentionally tumble down the standings. Presently, the lower a team finishes, the higher odds it has in the draft lottery.\nAccording to ESPN, Mike Krzyzewski -- who serves as senior adviser to basketball operations -- was among those at Thursday's meeting with general managers who suggested that the league take steps to curb tanking attempts. Silver himself addressed the issue at his All-Star media availability last weekend and noted an increased prevalence of tanking.Phoenix Suns owner Mat Ishbia also called for \"massive changes\" in a social media post Thursday, calling tanking \"losing behavior.\"The current system is ripe for tanking behavior, and teams are becoming increasingly blatant in their attempts to maximize lottery odds. Last week, the NBA issued a $500,000 fine to the Utah Jazz for conduct detrimental to the league after investigating their lineup management in Feb. 7 and Feb. 9 games against the Orlando Magic and Miami Heat. The Jazz pulled star players Lauri Markkanen and Jaren Jackson Jr. prior to the start of the fourth quarter and did not reinsert them into the games despite holding leads.\nThe NBA also fined the Pacers $100,000 for violating the Player Participation Policy during a Feb. 3 contest against the Jazz after an investigation found that Pascal Siakam and two other starters who sat out could have participated under the league's medical standard.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg"
      ],
      "datePublished": "2026-02-20T00:27:30.000Z",
      "dateModified": "2026-02-20T00:27:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Teddy Bridgewater bill' moves step closer to law after passage by Florida Senate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/florida-senate-passes-teddy-bridgewater-bill-high-school-coaches/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/b5412b4c-c336-4217-a1ce-a3e895873232/thumbnail/1200x675/b51ec82d955b570cf0257652fc65c0b8/gettyimages-2247377456-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T04:09:24.000Z",
    "description": "\n        Following an incident that led NFL quarterback Teddy Bridgewater to be suspended from his high school coaching duties, the Florida Senate pas",
    "body": "\n        Following an incident that led NFL quarterback Teddy Bridgewater to be suspended from his high school coaching duties, the Florida Senate passed a bill that would make his infraction legal. According to Local 10 News, The \"Teddy Bridgewater bill\" allows high school head coaches to use personal funds to provide financial assistance to their players, so long as they report what they spend.The Florida High School Athletic Association suspended Bridgewater in September for the rest of the 2025-26 school year for providing impermissible benefits to athletes. Bridgewater coached Miami Northwestern High School football in 2024 and was set to lead the team in 2025 before he left the school to sign with the Tampa Bay Buccaneers.Northwestern suspended Bridgewater in July after he revealed in a social media post that he spent $700 a week on Uber rides for his players during the 2024 season. He also acknowledged covering transportation, team-branded clothing, meals and recovery-related expenses at combined costs of about $27,000. Bridgewater in that post asked for donations to the Northwestern football program.If Senate Bill 178 becomes law, coaches in Florida would be permitted to make such personal expenditures. A similar bill is also currently moving through the Florida House.\"I'm protective, and I'm a father first before anything,\" Bridgewater said last season upon signing with the Buccaneers. \"And when I decided to coach, those players became my sons. And I wanted to make sure that I just protected them in the best way that I can. I think that's what came about.\n\"Miami Northwestern's in a tough neighborhood and sometimes things can happen when the kids are walking home and things like that. So I was just trying to protect them and give them a ride home instead of having to take those dangerous walks.\"Bridgewater took the coaching job after announcing his retirement from the NFL in February 2024, and he led Northwestern to a Florida Class 3A state championship in his first and only season at the helm. His team went 12-2 and rolled through the playoffs with relative ease, leading to his selection as the Florida Dairy Farmers Coach of the Year.Bridgewater returned to the NFL after that championship season and signed with the Detroit Lions for the final weeks of the 2024 campaign. He played in a divisional round game in the 2024 playoffs during that brief stint. Bridgewater also logged four games of action in 2025 with the Buccaneers, good for his most since 2022. He attempted just 15 passes in a backup role behind Baker Mayfield.\nWhile his coaching suspension will expire this summer, it is unclear whether Bridgewater intends to return to the sidelines at Northwestern. If he instead spends next season back on another NFL roster, the former first-round pick would embark on Year 13 in the league.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Teddy Bridgewater bill' moves step closer to law after passage by Florida Senate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/b5412b4c-c336-4217-a1ce-a3e895873232/thumbnail/1200x675/b51ec82d955b570cf0257652fc65c0b8/gettyimages-2247377456-1.jpg"
      ],
      "datePublished": "2026-02-20T04:09:24.000Z",
      "dateModified": "2026-02-20T04:09:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/alysa-liu-2026-winter-olympics-gold-medal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:57:04.000Z",
    "description": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland nati",
    "body": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland native delivered an electrifying performance during the women's free skate program on Thursday to surge atop the podium.   Liu started the day in third place after posting a 76.59 short program score behind Japan's Ami Nakai and Kaori Sakamoto. As the third-to-last skater of the event, Liu put together a near flawless program while skating to Donna Summer's \"MacArthur Park.\" She received roars from the crowd as she skated with confidence and ease. The positivity exuded off of her with every jump and artistic sequence, culminating with a career-best score of 226.79.\nLiu posted a whopping 150.20 score in the free skate, but had to wait out the programs of Sakamoto and Nakai to learn her fate. However, minor deductions to both Japanese skaters ensured Liu would walk away with gold. Her free skate program was nearly three points higher than the silver medalist, Sakamoto.\"Being able to do it my way on the big stage like this has been my dream,\" Liu said after winning gold, via NBC News. \"I got to do it in my short [program] in the team event and I got to do it tonight in the free skate. I'm just over the moon. I'm the luckiest girl ever, and I'm really grateful.\"   \nLiu finished with a combined score of 226.79, while her American teammates Amber Glenn and Isabeau Levito finished fifth and 12th, respectively. Liu became the first American woman to win an individual gold since Sarah Hughes in 2002 and the eighth American woman overall to accomplish that feat. Earlier in these Games, Liu and Glenn helped the Americans win team gold.NameShort programFree skatingTotal scoreAlysa Liu (USA) 🥇 \t\t\t\t \t\t\t\t \t\t\t\t76.59 \t\t\t\t \t\t\t\t \t\t\t\t150.20 \t\t\t\t \t\t\t\t \t\t\t\t226.79 \t\t\t\t \t\t\t\t \t\t\t\tKaori Sakamoto (JPN) 🥈 \t\t\t\t \t\t\t\t \t\t\t\t77.23 \t\t\t\t \t\t\t\t \t\t\t\t147.67 \t\t\t\t \t\t\t\t \t\t\t\t224.90 \t\t\t\t \t\t\t\t \t\t\t\tAmi Nakai (JPN) 🥉 \t\t\t\t \t\t\t\t \t\t\t\t78.71 \t\t\t\t \t\t\t\t \t\t\t\t140.45 \t\t\t\t \t\t\t\t \t\t\t\t219.16 \t\t\t\t \t\t\t\t \t\t\t\tMone Chiba (JPN) \t\t\t\t \t\t\t\t \t\t\t\t74.00 \t\t\t\t \t\t\t\t \t\t\t\t143.88 \t\t\t\t \t\t\t\t \t\t\t\t217.88 \t\t\t\t \t\t\t\t \t\t\t\tAmber Glenn (USA) \t\t\t\t \t\t\t\t \t\t\t\t67.39 \t\t\t\t \t\t\t\t \t\t\t\t147.52 \t\t\t\t \t\t\t\t \t\t\t\t214.91 \t\t\t\t \t\t\t\t \t\t\t\tAt no point during Liu's performance did she appear to be bothered by the pressure. Even after she received her score, it was all smiles.    No shocked reaction, no tears of joy. Just pure happiness.      A remarkable comeback for Alysa Liu   It's the perfect storybook ending for Liu, who briefly -- and abruptly -- retired from figure skating in 2022 at the age of 16. At the time, as the COVID-19 pandemic forced the cancellation of everything from school classes to entire professional sports seasons, Liu's local rink in the Bay Area closed. That provided her something she hadn't had since she started skating at five years old: a break. That forced break from skating made the idea of leaving the sport forever enticing to Liu, and so she walked away.   This wasn't just any figure skater who decided to call it a career. Liu is a prodigy. She began competing in major competitions at the age of 10. By 13, she became the youngest U.S. women's national champion ever. At 14, Liu became the youngest skater to win two senior national titles. In 2019, she became the first U.S. female figure skater to land a quadruple jump in an international competition.   Liu was at the peak of her powers. But she was satisfied with everything she had accomplished at the time, and decided to move on.   \"It was a crucial time in my life,\" Liu told 60 Minutes in an interview before the Olympics began. \"I was 16 and college was coming up. Like, I wanted to do so much. I went to Nepal and I trekked to Everest Base Camp. Me and my friends would do tons of road trips. I was really just livin' it up. I would say it was my best life.\"   \nBut after two years of quality time with friends and family, and traveling around the world, Liu got the itch to compete again. In 2024 she made her triumphant return, and surprised many in her ability to essentially pick right back up where she left things with no skill loss.   If Liu was to return, though, she wanted to do things differently.   \"I get to pick my own program music,\" Liu said. \"I get to help with the creative process of the program. If I feel like I'm skating too much, I'll back down. If I feel like I'm not skating enough I'll ramp it up. No one's gonna starve me or tell me what I can and can't eat.\"   \n        \n            \n                2026 Winter Olympics: American figure skater Alysa Liu is an unconventional talent on an improbable path\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nHer coach, Phillip DiGuglielmo, said she returned to the sport a better skater.    \"For many years she was dropped off at the rink,\" DiGuglielmo said. \"She was told what to do. Now she comes in, and it is all collaborative.\"   Since returning in 2024, Liu became a world champion in 2025. That made her the first American woman to win a world title since since Kimmie Meissner in 2006. Liu career has reached new heights in ways she never expected -- she's a gold medalist on the biggest stage. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg"
      ],
      "datePublished": "2026-02-19T23:57:04.000Z",
      "dateModified": "2026-02-19T23:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FIU vs. Liberty prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/fiu-liberty-odds-prediction-time-2026-college-basketball-picks-february-19/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/179b134c-31f4-4ad3-92a1-e7aa31c9ec69/thumbnail/1200x675/355ca615fca6cbcb7d98ee65f6c3ffee/usatsi-27789464.jpg",
    "tag": "Sports",
    "date": "2026-02-19T21:30:04.000Z",
    "description": "\n        A Conference USA matchup on Thursday's college basketball schedule features the Liberty Flames putting their undefeated CUSA record on the li",
    "body": "\n        A Conference USA matchup on Thursday's college basketball schedule features the Liberty Flames putting their undefeated CUSA record on the line versus the FIU Panthers on CBS Sports Network. Liberty (22-3, 14-0 CUSA) is riding a 16-game win streak and is coming off a Saturday victory over UTEP by a 73-64 score. FIU (12-13, 5-9 CUSA) has lost two of its last three but defeated Louisiana Tech, 77-64, in its most recent contest on Feb. 14. The Flames are 5-2 all-time versus the Panthers.Tipoff is at 6 p.m. ET from the Liberty Arena in Lynchburg, Va. Liberty has won the last three meetings, including an overtime win on Dec. 28. The Flames are 11.5-point favorites in the latest Liberty vs. FIU odds from DraftKings Sportsbook, while the over/under for total points scored is 152.5. The Flames are at -719 on the money line (risk $719 to win $100). Before making any FIU vs. Liberty picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 16 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on a 13-7 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Liberty vs. FIU 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for FIU vs. Liberty:Liberty vs. FIU                                            spread:    Liberty -11.5 at DraftKings SportsbookLiberty vs. FIU                                                                                                                                                                                                                           over/under:    152.5 pointsLiberty vs. FIU                                                                                                     money line:    Liberty -719, FIU +511Liberty vs. FIU                                                                                                                                                                                                                                                        picks:    See picks at SportsLineLiberty vs. FIU                                                                                                                                                                                                                                                        streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top FIU vs. Liberty predictionsSportsLine's model has simulated Liberty vs. FIU   10,000 times and is going Over on the total (152.5 points). The Over is a combined 25-19 for the teams this season, which includes their December matchup being one of the highest-scoring games of the entire 2025-26 college basketball season. Liberty prevailed 97-94 as the 191 total points easily eclipsed the game's O/U of 152.5.FIU has gone over in three of its last four road games, while Liberty has gone over in four of its last five contests overall. These are two of the four-highest scoring teams in Conference USA, while FIU is just as giving on the other end of the court as no CUSA squad gives up more points per game than the Flames. The model projects 154 combined points as the Over hits in 56.8% of simulations.How to make Liberty vs. FIU   picksThe model also says one side of the spread hits 70% of the time. You can only see that pick at SportsLine.So who wins FIU vs. Liberty, and which side of the spread hits 70% of the time? Visit SportsLine now to see which side of the Liberty vs. FIU spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIU vs. Liberty prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/179b134c-31f4-4ad3-92a1-e7aa31c9ec69/thumbnail/1200x675/355ca615fca6cbcb7d98ee65f6c3ffee/usatsi-27789464.jpg"
      ],
      "datePublished": "2026-02-19T21:30:04.000Z",
      "dateModified": "2026-02-19T21:30:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Hilary Knight breaks U.S. women's hockey scoring record vs. Canada - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-hilary-knight-usa-womens-hockey-scoring-record-canada/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/159ee2f4-cfd8-474b-b162-97de9c3b4476/thumbnail/1200x675/22caa0cd4d55f3f3d0a549709b2c07a8/hilary-knight-goal.png",
    "tag": "Sports",
    "date": "2026-02-19T21:12:34.000Z",
    "description": "\n        Hilary Knight has cemented herself as the greatest Olympic scorer in U.S. women's hockey history. And she did it in dramatic fashion. Knight ",
    "body": "\n        Hilary Knight has cemented herself as the greatest Olympic scorer in U.S. women's hockey history. And she did it in dramatic fashion. Knight scored the 15th goal of her Olympic career against Canada in Thursday's goal medal game, tying the score at 1-1 with just 2:04 left in regulation and opening the door for her team to win the gold medal on Megan Keller's golden goal in overtime.Knight broke the American women's record for career goals previously held by Natalie Darwitz and Katie King. In the process, she also broke the record for most career Olympic points in U.S. women's hockey history. Now at 33 points, she broke the record previously held by Jenny Potter (32 points -- 11 goals, 21 assists). Knight entered the final with 14 goals and 18 assists. \nKnight is already an American hockey icon with no qualifiers needed. From an international perspective, no U.S. player is more decorated than Knight, who won her second gold medal and fifth Olympic medal overall -- another U.S. record. Additionally, Knight is now the third Olympic hockey player in history with five medals to his or her name.Throughout her career, Knight has racked up 12 gold medals and eight silver medals between the Olympics and World Championships. In 115 career games with the U.S., Knight has piled up 81 goals and 70 assists.\n\n        \n            \n                2026 Winter Olympics: U.S. women's hockey team finishes incredible run, takes gold with OT win over Canada\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nIn addition to being a USA Hockey legend, Knight is also one of the greatest players in University of Wisconsin history. In four years with the Badgers, Knight totaled 143 goals, which still stands as the program record for men and women. Knight also led Wisconsin to national championships in 2009 and 2011.In less than three full seasons with the Professional Women's Hockey League, Knight has made her mark there as well. In 2024-25, Knight was tied for the league lead in points with 29 as a member of the Boston Fleet. This season, while captaining the Seattle Torrent in their inaugural season, Knight is tied for sixth in the league with seven assists.\nKnight, 36, doesn't need to add anything else to her resume. Her accolades are already spilling off the page as it is and a place in the Hockey Hall of Fame awaits Knight when her career is over.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Hilary Knight breaks U.S. women's hockey scoring record vs. Canada - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/159ee2f4-cfd8-474b-b162-97de9c3b4476/thumbnail/1200x675/22caa0cd4d55f3f3d0a549709b2c07a8/hilary-knight-goal.png"
      ],
      "datePublished": "2026-02-19T21:12:34.000Z",
      "dateModified": "2026-02-19T21:12:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-womens-champions-league-ranking-quarterfinalists-barcelona-real-madrid-chelsea-arsenal-lyonnes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:23:40.000Z",
    "description": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount",
    "body": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount+. After rewriting the tournament script with an 18-team Swiss model league phase, now just eight teams are left in the hunt for Europe's biggest prize. The newly shifted format of the competition produced exciting results, with some lopsided wins, exciting come-from-behind draws to salvage a point, and 181 goals during the league phase. Now it's time to plan for the quarterfinals. The quarterfinals will feature perennial powerhouses FC Barcelona and OL Lyonnes. The two sides dominated their opposition, and a three-goal differential proved the ultimate difference-maker in the standings heading into the quarterfinal phase. Manchester United and Arsenal join Chelsea FC as dominating English clubs in the next round, alongside Bayern Munich, Real Madrid, and Wolfsburg.Which teams are surging and which look untested? Time look at the results, the matchups and to rank the final eight Champions League teams:\nPlayoff resultsReal Madrid 2, Paris FC 0 (Real win 5-2 on aggregateArsenal 3, OH Leuven 1 (Arsenal win 7-1 on aggregate)Wolfsburg 2, Juventus 0 (Wolfsburg win 4-2 on aggregate)Man United 2, Atletico Madrid 0 (United win 5-0 on aggregate)Quarterfinal matchupsWatch all the action live on Paramount+.First legs to be played March 24-25, and second legs April 1-2Man United vs. Bayern MunichReal Madrid vs. BarcelonaArsenal vs. ChelseaWolfsburg vs. Lyon1. FC Barcelona  It's no secret that the Catalonians remain the team to beat in this tournament, topping the league phase with a plus-17 goal differential, and an opening 7-1 annihilation of Bayern Munich that sent defiant alarms throughout the competition. Carolina Graham Hansen, Alexia Putellas, alongside Claudia Pina and rising star Vicky Lopez, are getting it done flawlessly, with Aitana Bonmati on the sidelines with a leg injury.\n2. OL Lyonnes The eight-time winners flexed their champion experience, matched Barcelona's 16 points in the league phase, and showed they can put games away and rally from behind. Melchie Dumornay has officially reintroduced herself as a Ballon d'Or candidate with four goals (two braces) against Arsenal and Manchester United. Dumornay, alongside Kadidiatou Diani, Marie Antoinette Katoto, and Tabitha Chawinga, form an attacking quartet that strikes fear into every backline they face.3. Arsenal   The current title holders had a rocky start to their tournament but are now in solid form and back in familiar territory, the quarterfinals. Peaking at the right time is just part of the equation; scoring 88% of their open play goals off sequences in as few passes as possible makes them a dangerous side to face as the stakes get higher. New acquisition Olivia Smith is getting more lethal, and Alessia Russo is showing she's as reliable as ever in front of goal.4. Manchester UnitedDon't call them nervous newcomers, because the Red Devils keep proving they belong. They carried themselves with defensive performances in the league phase, and showed they know how to score during the knockout playoffs. Goalkeeper Phallon Tulis-Joyce of the U.S. women's national team and center back duo Dominique Jenssen and Maya Le Tissier have become a formidable defensive trio in front of goal.  \n5. Chelsea FCThe Blues earned a straight bye to the quarterfinals out of the league phase with four wins and two draws, and they matched Barcelona's 20 goals scored. They've hit a snag in form domestically, but there's no better reset than a run at the Champions League. The gradual return of Sam Kerr after a lengthy ACL absence adds another dimension to an attack highlighted by Alyssa Thompson's quick rise and skill on offense.6. Bayern MunichIt's tough to rank Bayern Munich outside of the top five but the beauty of a knockout phase highlights the more current form of other clubs, and while they earned their bye through to the quarterfinals after an embarrassing opening 7-1 loss to Barcelona, they won't be as battle tested when they go up against a rising Manchester United in the next round. 7. Real MadridAnother team that was difficult to put this low due to their recent efforts, but Real Madrid's too close for comfort performances combined with a quarterfinal match against their domestic rivals Barcelona, will force some adjusments.  Hopefully, they won't be too dramatic of changes, as Caroline Weir and Linda Caicedo are delivering right when it matters.\n8. VfL Wolfsburg The former two-time champions have quietly built their way back into the quarterfinal round. Veteran Alexandra Popp is still a game changer, with Lineth Beerensteyn and Janina Minge shifting as impact players game to game. The group performance has been fairly mixed, whether that's due to an attack that can sometimes generate, combined with a defence that can also concede. It highlights inconsistency, and that's not who you want to play heading into a quarterfinal against OL Lyonnes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg"
      ],
      "datePublished": "2026-02-19T23:23:40.000Z",
      "dateModified": "2026-02-19T23:23:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-racism-vinicius-jr-investigation-real-madrid-what-to-know-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:00:49.000Z",
    "description": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forwa",
    "body": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forward. Ahead of Real Madrid and Benfica meeting at the Santiago Bernabeu on Feb. 25 in the UEFA Champions League playoffs second leg, there's a matter that needs to be sorted out due to a current UEFA investigation into an incident between Real Madrid winger Vinicius Junior and Benfica winger Gianluca Prestianni from Tuesday. An alleged racial incident caused the match to be stopped while the referee reviewed what happened, and it has now been moved to an investigation by UEFA to determine the next steps. Both teams are maintaining that their side of the story is the correct one, and here's what to know so far:What happened?After Vinicius Junior scored the winning goal in Real Madrid's 1-0 victory over Benfica in the playoff first leg, the match had to come to a stop due to alleged racial abuse. As he does many times when he scores, Vinicius went to the corner flag to celebrate while dancing, for which he was yellow carded, while objects from the stands also rained down onto the pitch. Benfica weren't happy with this, and Argentine winger Gianluca Prestianni raised his shirt to cover his mouth while speaking to the Brazilian.While it's officially unknown what Prestianni said, he was alleged to have called Vinicius a 'mono' which is the Spanish word for monkey. Vinicius reported the incident to referee Francois Letexier, who paused the match while sorting out the situation as per UEFA's three-step procedure for referees to act against incidents where racism is believed to have taken place.Since it wasn't clear what was said by Prestianni, the referee could only investigate the matter before deciding on a course of appropriate action, which in this case was resuming the match, but the incident is still subject to further investigation once the match is complete.\nUEFA released a statement calling for that investigation, which so far, Real Madrid has complied with:\"A UEFA Ethics and Disciplinary Inspector has been appointed to investigate allegations of discriminatory behaviour during the UEFA Champions League 2025/2026 knock-out play-off match between SL Benfica and Real Madrid CF on 17 February 2026.Further information regarding this matter will be made available in due course,\" the statement read.What's Real Madrid saying?In a statement on Thursday, Real Madrid confirmed that they submitted all the evidence that they have to comply with UEFA's investigation.\n\"Real Madrid C. F. announces that today it has submitted all available evidence to UEFA regarding the incidents that occurred last Tuesday, February 17, during the Champions League match our team played in Lisbon against SL Benfica. Our club has actively collaborated with the investigation opened by UEFA following the unacceptable episodes of racism experienced during that match.Real Madrid appreciates the unanimous support, backing, and affection that our player Vinicius Jr. has received from all areas of the global football community. Real Madrid will continue working, in collaboration with all institutions, to eradicate racism, violence, and hate in sports and society.\"What are Benfica saying?Benfica are supporting Prestianni's statement that what Vinicius said he heard was not what was actually said. There has yet to be an update of their compliance with the investigation, but with the two teams meeting next Wednesday to decide the tie, this is on a compressed timeline.\"The Club reaffirms, clearly and unequivocally, its historical and unwavering commitment to defending the values of equality , respect , and inclusion , which align with the core values of its foundation and which have Eusébio as their greatest symbol.Sport Lisboa e Benfica reiterates that it fully supports and believes in the version presented by the player Gianluca Prestianni , whose conduct while serving the Club has always been guided by respect for opponents, institutions, and the principles that define Benfica's identity. The Club regrets the defamation campaign to which the player has been subjected.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg"
      ],
      "datePublished": "2026-02-19T20:00:49.000Z",
      "dateModified": "2026-02-19T20:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's Wright pushing for Premier League promotion at Coventry, World Cup spot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/haji-wright-usmnt-coventry-city-world-cup-2026-usa-soccer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/dd9922c3-46f9-4321-8554-8b7d109bb5c3/thumbnail/1200x675/5f0c6b6e563c9c2ec41663574fe8b8fb/conventry-city.jpg",
    "tag": "Sports",
    "date": "2026-02-19T21:03:18.000Z",
    "description": "\n        Despite leading the Championship, 2026 hasn't been kind to Frank Lampard's Coventry City, with the Sky Blues taking only 11 points from eight",
    "body": "\n        Despite leading the Championship, 2026 hasn't been kind to Frank Lampard's Coventry City, with the Sky Blues taking only 11 points from eight matches played in the new year. But in a massive clash atop the table with Middlesbrough, the hottest team in the division, American striker Haji Wright showed that he has what it takes to push for automatic promotion to the Premier League by emerging as a hat trick hero in a 3-1 victory to stay in the drivers seat for winning the Championship after last season's disappointment left Coventry within seconds of a place in the promotion playoff final. Being knocked out by Sunderland via a Dan Ballard goal in the 122nd minute of extra time has only motivated the Sky Blues to avoid needing the playoff altogether. Wright's form has been an important part of that. He's now up to 13 goals and one assist in Championship play while securing his first hat trick of the season and second as a member of Coventry City. Wright is also only two goals behind Swansea City's Zan Vipotnik for the Championship Golden Boot race. A striker who has scored 12 or more goals in five consecutive seasons, Wright is becoming the picture of consistency while finding a true home with Coventry after stops in Germany, the Netherlands, Denmark, and Turkiye along the way.\n        \n            \n                WATCH: USMNT's Folarin Balogun punishes PSG, scores two crucial Champions League goals for AS Monaco\n                \n                    Chuck Booth                \n            \n                            \n    \n                \n                    \n    \nTaking a look at the shot map from the match last weekend, it's clear how involved Wright was, as his expected goals of 1.5 were higher than Middlesbrough's entire team xG of 1.08, and without Wright, Coventry's attack struggled to generate chances in the match -- not that they needed many.\n                                                                    CBS Sports\n                                                            Considering timing, there's almost no better moment for Wright to find his form. He now has five goals in 2026 as he looks to lead Coventry to the Premier League for the first time since the 2000-01 season while also pushing for a spot on the United States World Cup squad after being a surprise inclusion in 2022. Friendlies facing Belgium and Portugal are right around the corner at the end of March, and Wright is making sure that USMNT manager Mauricio Pochettino won't be able to leave him out of the squad.\nWright's first goal was created by his movement as he made it easy for Jack Rudoni to pick out a run before making no mistake, slotting it past Middlesbrough keeper Solomon Brynn.\nThe second was one that showed off his finishing chops. Getting on the run and doing something that he enjoys, playing on the back shoulder of the defense, Wright knew that he had the chance to beat the defense before delivering a devastating finish to double the lead for his side.\nHe'd complete the day from the penalty spot for the hat trick, securing all three points. There's plenty left to do but 32 games into the season, the Sky Blues have a six-point lead for automatic promotion although Ipswich Town have two games in hand which could see them draw within two points of Lampard's men. In all, 14 matches remain in the season so we're fully in the home stretch and Coventry will need Wright to keep up his form as the Premier League potentially awaits.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's Wright pushing for Premier League promotion at Coventry, World Cup spot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/dd9922c3-46f9-4321-8554-8b7d109bb5c3/thumbnail/1200x675/5f0c6b6e563c9c2ec41663574fe8b8fb/conventry-city.jpg"
      ],
      "datePublished": "2026-02-19T21:03:18.000Z",
      "dateModified": "2026-02-19T21:03:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Rockets-Hornets, Celtics-Warriors, college hoops on Thursday, Feb. 19 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-rockets-vs-hornets-celtics-vs-warriors-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/965cc817-09cd-4f8d-be2e-d20a8fd67ed7/thumbnail/1200x675/ae453794d2f0e16d31ccaae2d845cf21/kon-knueppel-charlotte-hornets-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:30:43.000Z",
    "description": "\nThe Charlotte Hornets entered the NBA All-Star break as one of the hottest teams in the league. They're hoping to pick up where they left off prior t",
    "body": "\nThe Charlotte Hornets entered the NBA All-Star break as one of the hottest teams in the league. They're hoping to pick up where they left off prior to the week-long hiatus.Charlotte (26-29) seeks its 11th win in 12 contests when it hosts the Houston Rockets (33-20) at the Spectrum Center on Thursday at 7 p.m. ET as the 2025-26 NBA season resumes. The Hornets were 12 games under .500 before beginning a nine-game winning streak on Jan. 22. Their run ended with a 110-104 home loss to the Detroit Pistons, but they edged the Atlanta Hawks 110-107 in their final outing before the break.One of Charlotte's triumphs during its longest winning streak since a nine-gamer in 1998-99 was a 109-99 win at Houston on Feb. 5. Rookie Kon Knueppel led the team in that contest with 24 points and LaMelo Ball added 20 as five members of the Hornets scored in double figures.Nine other games are on Thursday's NBA schedule, including a matchup between the Boston Celtics (35-19) and Golden State Warriors (29-26) at 10 p.m. ET at the Chase Center in San Francisco. The Celtics, who have won six of their last seven contests, and Warriors are squaring off for the first time in 2025-26 after having split their two-game series each of the last four seasons.In another intriguing clash, the Denver Nuggets (35-20) visit the Intuit Dome in Inglewood, Cal. to take on the Los Angeles Clippers (26-28) at 10:30 p.m. ET. The Nuggets won each of the first two meetings between the teams this season and four straight in the all-time series. The college basketball slate is loaded with games, with one being an America East Conference showdown between Vermont (17-10) and UMBC (16-8) at 6 p.m. ET at Chesapeake Employers Insurance Arena in Catonsville, Md. The Retrievers are riding a four-game winning streak, while the Catamounts have won three in a row and are looking to sweep the season series after having posted a 64-55 home victory on Jan. 29.The Rockets are 4.5-point favorites against the Hornets in the latest consensus NBA odds, while the Celtics are 5.5-point favorites over the Warriors. The Nuggets are 4.5-point favorites versus the Clippers and Vermont is a 1.5-point favorite against UMBC.Below is a snapshot of what to watch and bet for Thursday, Feb. 19. All times EasternNBA best bets, where to watchRockets at HornetsTime: 7 p.m. | Location: Charlotte, N.C. | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine pick -- Model: Over 216.5 (-109)Neither team is an offensive juggernaut, as the Hornets are 15th in the NBA in scoring with an average of 115.7 points and the Rockets are tied for 20th at 114.6 per game. When they met in Houston earlier this month, they combined for 208 points. However, the SportsLine Projection Model believes the clubs will be at the top of their game after the lengthy break as the Over hits in more than 64% of its simulations.Celtics at WarriorsTime: 10 p.m. | Location: San Francisco | TV: Prime Video\nSportsLine picks -- Model: Over 211.5 (-110) | Expert: Celtics -5 (-114, Bruce Marshall)The Celtics are averaging 115.3 points this season and recorded 124 against the Chicago Bulls in their final game before the All-Star break after failing to reach triple digits in their previous two contests. The Warriors nearly reached their 115.5-point average in both of their last two outings, scoring 114 in a victory over the Memphis Grizzlies and 113 in a loss to San Antonio. The SportsLine Projection Model sees both teams performing close to their norm as its simulations say the Over hits 68% of the time. SportsLine expert Bruce Marshall (35-22, +1083 on his last 57 NBA against-the-spread picks) likes the Celtics to cover the spread against a Golden State squad that remains without superstar Steph Curry (knee).Nuggets at ClippersTime: 10:30 p.m. | Location: Inglewood, Cal. | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 226.5 (-107) | Expert: Nuggets -3.5 (-112, Jeff Hochman)The Nuggets lead the NBA in scoring with an average of 120.4 points and have eclipsed that total in five of their last seven games. These teams went Over the projected total for Thursday's matchup in each of their first two meetings this season, combining for 246 and 231 points. The SportsLine Projection Model sees no reason for that trend to continue as the Over hits in 68% of its simulations. The Nuggets went 7-3 against the spread in their first game after the All-Star break over the last 10 seasons, and SportsLine expert Jeff Hochman (7-2-1, +580 on his last 10 ATS picks involving Denver) thinks they'll cover again this time around.CBB best bets, where to watchVermont at UMBCTime: 6 p.m. | Location: Catonsville, Md. | TV: ESPN+ | Stream: Fubo (Try for free)\nSportsLine picks -- Model: UMBC +104 | Expert: UMBC +1.5 (-115, Larry Hartstein)UMBC possesses the best home record in the America East Conference at 9-2 and has won five straight contests on its own court. Seven of the Catamounts' 10 losses this season have come away from the Roy L. Patrick Gymnasium in Burlington. The Retrievers have posted victories in 10 of their last 12 outings, and the SportsLine Projection Model thinks they'll keep rolling as its simulations have them defeating Vermont 68% of the time. SportsLine expert Larry Hartstein (17-11-1, +458 on his last 29 college basketball ATS picks) agrees and likes UMBC to cover the spread, which it did in each of its four games since losing at Vermont late last month.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Rockets-Hornets, Celtics-Warriors, college hoops on Thursday, Feb. 19 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/965cc817-09cd-4f8d-be2e-d20a8fd67ed7/thumbnail/1200x675/ae453794d2f0e16d31ccaae2d845cf21/kon-knueppel-charlotte-hornets-imagn-images.jpg"
      ],
      "datePublished": "2026-02-19T20:30:43.000Z",
      "dateModified": "2026-02-19T20:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suns owner Mat Ishbia calls out tanking in NBA: 'Losing behavior done by losers' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-owner-mat-ishbia-tanking-nba/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/26f100ea-de97-4250-a570-9576d6374c15/thumbnail/1200x675/9bb2051a3f531a7a8e6ebec6c8c1e46a/mat-ishbia-suns.jpg",
    "tag": "Sports",
    "date": "2026-02-19T19:23:02.000Z",
    "description": "\n        Tanking has been the hot button topic around the NBA, and team owners have now gotten in on the conversation. Phoenix Suns owner Mat Ishbia h",
    "body": "\n        Tanking has been the hot button topic around the NBA, and team owners have now gotten in on the conversation. Phoenix Suns owner Mat Ishbia had some strong words on social media about the prospect of teams tanking around the league to better position themselves for one of the top draft prospects coming out of college.\"This is ridiculous! Tanking is losing behavior done by losers,\" Ishbia wrote on X. \"Purposely losing is something nobody should want to be associated with. Embarrassing for the league and for the organizations. And the talk about this as a 'strategy' is ridiculous.\"The topic of tanking was ever-present during All-Star weekend, with league commissioner Adam Silver saying during his annual press conference that the tanking has been \"worse\" this year compared to seasons past. \"Are we seeing behavior that is worse this year than we've seen in recent memory?\" Silver asked rhetorically. \"Yes, in my view. Which is what led to those fines. And not just the fines, but my statement that we're going to be looking more closely at the totality of all the circumstances this season in terms of teams' behavior and very intentionally wanted teams to be on notice.\"\n        \n            \n                Mark Cuban explains why NBA 'should embrace tanking,' prioritize fans in wake of Adam Silver's remarks\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nSilver handed down a hefty $500,000 fine to the Utah Jazz for holding out players in the fourth quarter in close games in an effort to lose games. A $100,000 fine was also given to the Indiana Pacers for holding healthy players out of games entirely. \nThe fine given to the Jazz was among the largest we've ever seen, and was clearly supposed to serve as a message to the rest of the league about their tanking tactics. Will it change things? Probably not. But Ishbia thinks \"massive changes\" need to happen to curb this behavior.\"If you are a bad team, you get a good pick,\" Ishbia wrote on social media. \"That makes sense. But purposely shutting down players and purposely losing games is a disgrace and impacts the integrity of whole league.   This is much worse than any prop bet scandal. This is throwing games strategically. Horrible for fans that pay to watch and cheer on their team. And horrible for all the real teams that are competing for playoff spots.\"\"Awful behavior that Adam Silver and the NBA will need to stop with massive changes, and I have complete confidence that with his leadership, he will fix it. Those of us in a position of influence need to speak out… the only \"strategy\" is doing right by fans, players, and the NBA community.\"Ishbia didn't offer any options for what should be done to stop this blatant tanking, but his thoughts are in direct opposition to what Dallas Mavericks minority owner Mark Cuban thinks on the topic. Cuban also took to social media recently to say that the NBA should \"embrace tanking,\" as it's one of the proven ways for teams to improve their championship hopes. That's especially true of small market teams -- like the Jazz -- who will never be able to outpace teams like the Los Angeles Lakers or New York Knicks in trying to sign top-tier free agents simply because the team exists in Utah and not a market like Los Angeles or New York.We'll see if the league tries to make any meaningful changes to limit tanking, but it's been an unsolvable problem for years now. And in a year where the draft is loaded with elite talent, of course every team is going to prioritize their draft positioning over getting the No. 8 spot in the playoffs just to get swept. It's a situation the league created by awarding the worst team with the top pick in the past and then flattening the odds to allow several teams a more equal shot at landing that top pick.\nSo unless there's drastic, sweeping changes, tanking isn't going anywhere.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns owner Mat Ishbia calls out tanking in NBA: 'Losing behavior done by losers' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/26f100ea-de97-4250-a570-9576d6374c15/thumbnail/1200x675/9bb2051a3f531a7a8e6ebec6c8c1e46a/mat-ishbia-suns.jpg"
      ],
      "datePublished": "2026-02-19T19:23:02.000Z",
      "dateModified": "2026-02-19T19:23:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball betting: Expert's value bets to reach Final Four, win title - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-betting-expert-shares-best-value-bets-to-reach-final-four-win-national-championship/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/85813885-e5db-4962-9460-41f699f56fe8/thumbnail/1200x675/1cae435a60d79f8024c246f984620ea3/michigan-basketball.jpg",
    "tag": "Sports",
    "date": "2026-02-19T22:12:34.000Z",
    "description": "\n        Selection Sunday is right around the corner, and NCAA Tournament odds are tightening. While most bettors gravitate toward picking the nationa",
    "body": "\n        Selection Sunday is right around the corner, and NCAA Tournament odds are tightening. While most bettors gravitate toward picking the national champion, targeting teams to make the Final Four can be a smarter strategy. Those wagers pay out after just three wins, and you can spread your bets across multiple teams to increase your chances. Championship bets still have strong appeal, particularly if you're drawn to a longshot or a team peaking at the right time. Combining both types of wagers covers you if a team gets hot and advances, while also putting you in line for the largest payout if they win it all. Below are my favorite \"value\" picks in each market. I left Michigan at -150 to make the Final Four off my list, even though they have the ability to win it all, as you'll see below. Keep an eye out for roster changes -- one major injury can ruin a bet. All odds via DraftKings.  Bet on college basketball at DraftKings, where new users get $200 in bonus bets if their first wager of $5 or more wins:Best value picks to reach the Final FourFlorida Gators (+250)The defending national champions are currently \"on a heater,\" winning 12 of their last 13 games -- most by double-digit margins. Todd Golden has constructed arguably the best frontcourt depth in the country with Alex Condon, Rueben Chinyelu and Thomas Haugh. February is when Florida's momentum traditionally builds. They are currently a top-six KenPom squad, and the addition of transfer Boogie Fland has stabilized a backcourt that previously struggled with turnovers. The Gators are overwhelming -1200 favorites to win the SEC regular-season title, which says a lot about how dominant they've been all year. They have size, depth, and athleticism at every position, and they play with a confidence you can feel. This group is built for a deep March run once again, and I wouldn't bet against them.UConn Huskies (+400)The Huskies look set for a No. 2 seed, but their makeup screams deep tournament run. Even with a few recent losses, UConn's defense is still top-notch, and Dan Hurley has proven he can get a team rolling in March -- just look at those 12 straight covers during their back-to-back title runs. The veteran trio of Alex Karaban, Silas Demary Jr. and Solo Ball gives them experience and leadership. UConn's path through the Big East is also less brutal than what teams in the Big 12 or Big Ten face. At +400, you're really putting your faith in coaching and rebounding -- two things that tend to matter most this time of year. Why not pick them to win it all? Their 69.8% free-throw shooting worries me. Against the best, that's the kind of detail that can end a season.Kansas Jayhawks (+550)A month ago, Kansas struggled with consistency, but Bill Self has refined his rotations to lead the team on an eight-game winning streak. The Jayhawks possess an elite defensive efficiency (Rank 9) and a senior-heavy lineup that brings necessary experience to the tournament. At +550, this is a high-value \"buy low\" opportunity. The Jayhawks' ceiling is contingent on the health of star freshman Darryn Peterson, but they have proven they can win without him, including an upset of previously unbeaten Arizona. If Peterson is fully healthy by March, grabbing 5.5-to-1 odds on a Bill Self-coached team to win three games feels like tremendous value.Saint Louis Billikens (+2800)If you're looking for a big return on a small bet, Saint Louis is the ultimate Cinderella candidate. Led by Robbie Avila -- nicknamed \"Larry Nerd\" -- the team holds the 23rd spot in KenPom and boasts an offense that hits threes at a 40% rate while dominating at the rim. The path won't be easy for this mid-major, but they excel in the mid-range, protect the ball, and rarely make costly mistakes. At +2800, picking Saint Louis is a bold move that could shake up the tournament. I called them a dark horse on the Early Edge, and I stand by it. With odds like these, it's worth a shot -- especially since we haven't seen a true dark horse make a deep run in quite some time.Pick any of these teams to reach the Final Four at FanDuel, where new users can get $100 in bonus bets if their first bet of $5 or more wins:Top value picks to win national championshipMichigan Wolverines (+320)Michigan has become the standout team of the 2025-26 season, currently sitting atop the NET, RPI, and KenPom rankings. Under Dusty May, the Wolverines lead the nation in scoring margin (+22.5) and have posted a flawless 10-0 record in Quad 1 games. Michigan's impressive size and relentless pace present a challenge for any opponent across a full 40 minutes. Yaxel Lendeborg spearheads a Wolverines transition offense that relentlessly pushes the pace and averages 90.6 points per game.As the consensus pick for the No. 1 overall seed, Michigan is well positioned for the smoothest route to Indianapolis. I would be surprised if they don't reach the Final Four, and the +320 odds to win the championship offer solid value.Florida Gators (+1300)The Florida Gators enter the final stretch of the season as one of the most compelling value plays on the board at +1300. As the reigning national champions, Todd Golden's squad has demonstrated the talent and tactical depth required to become the first back-to-back winners since UConn's 2023-24 run. By betting Florida at +1300 now, you are securing a premium price on a team that ranks as a top-five unit in advanced efficiency since the start of conference play and possesses the most physical frontcourt in the tournament field. This line will not last much longer, so get down ASAP.Illinois Fighting Illini (+1300)I love the value this team offers at its current odds. The main reason to back the Illini is their historically efficient offense. Illinois owns the nation's top adjusted offensive efficiency rating, according to both KenPom and Bart Torvik. Averaging 84.8 points per game, they deploy a system that wears down opponents with up-tempo transition play and elite floor spacing. Even in their losses -- including two in overtime -- the games have been close. Illinois features a remarkable mix of freshman talent that has consistently exceeded expectations. Consistency on defense has been Illinois' only major flaw this season. However, the return of senior guard Kylan Boswell from a fractured hand has fundamentally changed the team's defensive profile. In his first game back, Boswell spearheaded an elite defensive effort that held Indiana to just 40.8% shooting and 25% from the 3-point line. Since his return, Illinois has jumped to No. 23 nationally in defensive efficiency, creating the balanced \"top 25 offense/top 25 defense\" profile that historically characterizes national champions. By betting on Illinois at +1300 now, you are securing value on a team that currently possesses the best offense in college basketball and is just now reaching full defensive health at the perfect time for a March run. While Illinois is also available at +250 to make the Final Four, this current wager offers superior value.Bet on the college basketball national championship futures at Caesars Sportsbook, where new users can get a first bet match up to $250 in bonus bets with promo code CBSSPORTS250BM:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball betting: Expert's value bets to reach Final Four, win title - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/85813885-e5db-4962-9460-41f699f56fe8/thumbnail/1200x675/1cae435a60d79f8024c246f984620ea3/michigan-basketball.jpg"
      ],
      "datePublished": "2026-02-19T22:12:34.000Z",
      "dateModified": "2026-02-19T22:12:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]