[
  {
    "title": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-anti-tanking-rule-changes-next-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T00:27:30.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tank",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tanking issues intensified throughout the All-Star break and will result in tangible changes starting next season. Commissioner Adam Silver informed the NBA's general managers on Thursday that the league plans on making anti-tanking rule adjustments to take effect in the 2026-27 season, according to ESPN.While the league has yet to announce the exact measures it will take to combat tanking, it reportedly discussed over the last month seven potential rule changes. Some of the proposals reflect those suggested by fans in recent weeks as tanking became the NBA's most hot-button topic.The seven potential rule changes are as follows:Allowing protection of first-round draft picks only for selections in the top four or outside the top 14Freezing lottery odds at the trade deadline or laterPreventing teams to pick in the top four in consecutive years and/or after consecutive bottom-three finishesDisallowing teams to pick in the top four the year after reaching the conference finalsAllocating lottery odds based on two-year rolling recordsExtending the lottery to include all play-in teamsFlattening the odds for all lottery teamsAll of the proposals would reduce the incentive to intentionally tumble down the standings. Presently, the lower a team finishes, the higher odds it has in the draft lottery.\nAccording to ESPN, Mike Krzyzewski -- who serves as senior adviser to basketball operations -- was among those at Thursday's meeting with general managers who suggested that the league take steps to curb tanking attempts. Silver himself addressed the issue at his All-Star media availability last weekend and noted an increased prevalence of tanking.Phoenix Suns owner Mat Ishbia also called for \"massive changes\" in a social media post Thursday, calling tanking \"losing behavior.\"The current system is ripe for tanking behavior, and teams are becoming increasingly blatant in their attempts to maximize lottery odds. Last week, the NBA issued a $500,000 fine to the Utah Jazz for conduct detrimental to the league after investigating their lineup management in Feb. 7 and Feb. 9 games against the Orlando Magic and Miami Heat. The Jazz pulled star players Lauri Markkanen and Jaren Jackson Jr. prior to the start of the fourth quarter and did not reinsert them into the games despite holding leads.\nThe NBA also fined the Pacers $100,000 for violating the Player Participation Policy during a Feb. 3 contest against the Jazz after an investigation found that Pascal Siakam and two other starters who sat out could have participated under the league's medical standard.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg"
      ],
      "datePublished": "2026-02-20T00:27:30.000Z",
      "dateModified": "2026-02-20T00:27:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026 schedule: Where to watch U.S. men's hockey vs. Slovakia - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/0d3fb888-0491-4e9b-8395-b5a0334f68ed/thumbnail/1200x675/768980be55083ecf2d14b3dfa24bb99b/usa-hockey-getty.png",
    "tag": "Sports",
    "date": "2026-02-20T00:39:16.000Z",
    "description": "\n        The 2026 Milan Cortina Winter Olympics are beginning to wrap up with less than a week of action to go. On this final Friday of the Games, the",
    "body": "\n        The 2026 Milan Cortina Winter Olympics are beginning to wrap up with less than a week of action to go. On this final Friday of the Games, there are exciting events from ice hockey to short track speed skating.The U.S. men's hockey team will face Slovakia in the semifinals at 3:10 p.m. as they eye the gold medal game. Team USA defeated Sweden 2-1 in the quarterfinals in a game that took overtime while Slovakia is coming off a 6-2 win over Germany. The U.S. men's team is after its first gold medal since the \"Miracle on Ice\" in 1980.Elsewhere, Kristen Santos-Griswold is competing in the short track speed skating 1500m event, with the medal event coming after the quarterfinal and semifinal -- all on Friday.The men's biathlon 15km mass start medal event will feature Campbell Wright, the two-time runner-up at last year's Biathlon World Championships.\nQuinn Dehlinger is another American athlete with a chance to medal as he competes in the freestyle skiing men's aerials. In the 2023 and 2025 world championships, he came in second place. Elana Meyers Taylor already had an emotional win in the women's monobob, earning her first gold medal and her sixth medal overall. At 41, she is the oldest bobsled medalist since 1956. She will compete in the bobsleigh two-women alongside 23-year-old Jadin O'Brien with a chance to add more hardware to her collection. Kaillie Humphries and Kaysha Love are other Americans to watch in the event. \n        \n            \n                2026 Winter Olympics medal count: Keep track of Team USA's quest for gold in Italy\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nThe Milan Cortina Games will run through Sunday, Feb. 22, and in total 119 events will take place with 245 medals handed out to the athletes. Fans can find the action on NBC and its streaming service, Peacock, with an account or a cable login.\nThe Winter Games have eight main sports, with 16 disciplines. With so many events to keep up with, it can get overwhelming, but that's where we step in with the overall medal tracker and daily schedule.Winter Olympics schedule for Friday, Feb. 20SportEventTimeMedal Event?BobsleighFour-Man Official Training Heats 5 & 64 a.m.NoFreestyle SkiingWomen's Ski Cross Qualifying to Finals4 a.m. - 8 a.m.YesCurlingWomen's Semifinals, Canada vs. Sweden, United States vs. Switzerland8:05 a.m.NoBiathlonMen's 15km Mass Start8:15 a.m.YesSpeed SkatingWomen's 1500m10:30 a.m.YesIce HockeyMen's Semifinals, Canada vs. Finland10:40 a.m.NoBobsleighTwo-Woman Heats 1 & 2 12 p.m.NoCurlingMen's Bronze Medal Match, Norway vs. Switzerland1:05 p.m.YesFreestyle SkiingMen's Halfpipe1:30 p.m.YesShort Track Speed SkatingWomen's 1500m Quarterfinals to Final; Men's 5000m Relay Finals2:15 p.m. - 4:30 p.m.YesIce HockeyMen's Semifinals, United States vs. Slovakia3:10 p.m.No\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule: Where to watch U.S. men's hockey vs. Slovakia - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/0d3fb888-0491-4e9b-8395-b5a0334f68ed/thumbnail/1200x675/768980be55083ecf2d14b3dfa24bb99b/usa-hockey-getty.png"
      ],
      "datePublished": "2026-02-20T00:39:16.000Z",
      "dateModified": "2026-02-20T00:39:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 in bonus bets by targeting Knicks-Pistons, Warriors-Celtics on Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-200-bonus-bets-knicks-pistons-warriors-celtics-thursday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:08:30.000Z",
    "description": "\n        The NBA season continues following the All-Star break, providing top matchups to utilize the latest DraftKings promo code, which offers $200 ",
    "body": "\n        The NBA season continues following the All-Star break, providing top matchups to utilize the latest DraftKings promo code, which offers $200 in bonus bets if your first $5 bet wins. Thursday features a 10-game NBA schedule, including a potential Eastern Conference finals preview with the New York Knicks hosting the Detroit Pistons at 7:30 p.m. ET. One of the SportsLine Projection Model's top picks from the entire Thursday NBA slate comes from Pistons vs. Knicks, backing the Knicks to cover as 4.5-point favorites for its NBA best bets at DraftKings. The Knicks have won eight of their last 10 at home against Detroit, and the over/under for Pistons vs. Knicks is 219.5, down two from the opening line. The model is also backing Over 213.5 total points for Celtics vs. Warriors for its Thursday NBA best bets at DraftKings. One of SportsLine's top experts has also locked in a college basketball best bet on Vermont vs. UMBC at 6 p.m. ET. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model exited the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Thursday best bets at DraftKings SportsbookUMBC (+1.5) vs. Vermont (-122) Knicks (-4.5) vs. Pistons (-105)Celtics vs. Warriors: Over 213.5 total points (-110)Combining the three picks into a Thursday parlay at DraftKings would result in a payout of +578 (risk $100 to win $578). Bet it at DraftKings here: (Odds subject to change):\nUMBC (+1.5) vs. Vermont (-122)\"The Retrievers have won and covered four straight since a 64-55 loss to these same Catamounts,\" SportsLine expert Larry Hartstein said. \"In that game, UMBC trailed by two with under two minutes left. But the Retrievers could not overcome 6-of-26 shooting from beyond the arc. At home, I expect the Retrievers to shoot better. They're 5-0 SU (3-2 ATS) in America East home games, including knocking off first-place NJIT 87-74. UMBC does a great job of winning the free-throw battle (outscored conference foes 184-106) and that should prove critical Thursday. Back UMBC to cover at DraftKings here:Knicks (-4.5) vs. Pistons (-105)The veteran Knicks' squad should be well rested following the NBA All-Star break, and they resume the season at home, where New York went 19-9 against the spread heading into the break. The Pistons have a six-game advantage over the Knicks in the standings. However, after losing their first two matchups of the year in Detroit, this is a chance for New York to showcase its Madison Square Garden dominance against the top seed in the East in a potential postseason preview. The Knicks went 10-2 over their final 12 games before the All-Star break, capping it with a 49-point win over the 76ers in the final game. Meanwhile, the Pistons remain without big men Jalen Duren and Isaiah Stewart due to suspensions. The model projects the Knicks to cover in 67% of simulations. Back the Knicks to cover at DraftKings here:Celtics vs. Warriors: Over 213.5 total points (-110)The Over hit in each of Golden State's final two games before the All-Star break, despite playing without Stephen Curry (knee), who remains out on Thursday. The Over is also 9-5 over the last 14 Warriors games. Boston is coming off a 124-105 win over the Celtics in its final game before the break, also going Over the total set for that game and this number. The Celtics have the No. 2 scoring defense at 108.4 ppg allowed, with Golden State 10th at 113.7 ppg allowed, but they've gone over this number in six straight head-to-head matchups despite often ranking toward the top of the league in total defense during that span. The model projects the Over to hit in 68% of simulations. Back the Over at DraftKings here:\nWant more NBA and college basketball picks on Thursday?You've seen some of the model's Thursday best bets. Now, get against the spread, total and money-line picks for all games, including the NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 in bonus bets by targeting Knicks-Pistons, Warriors-Celtics on Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg"
      ],
      "datePublished": "2026-02-19T23:08:30.000Z",
      "dateModified": "2026-02-19T23:08:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NCAA March Madness Bracket Preview 2026: Where to watch, live stream, channel as current top 16 seeds unveiled - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ncaa-march-madness-bracket-preview-2026-current-top-16-seeds-unveiled-where-to-watch-live-stream-channel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/1aee7e30-92b9-4360-aacc-48fb0c41cd00/thumbnail/1200x675/065b693f19718ddb9e4e45f2ceef323b/gettyimages-2074386326-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:10:51.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NCAA March Madness Bracket Preview will give c",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NCAA March Madness Bracket Preview will give college basketball fans a peek at who is in contention to land a top seed in the 2026 NCAA Tournament on Saturday. With Selection Sunday less than a month away, fans can tune in at 12:30 p.m. ET on CBS and Paramount+ to get a look at how the top 16 teams in the bracket stack up entering the day's action.NCAA Division I Men's Basketball Committee Chair Keith Gill will join CBS analysts Clark Kellogg, Wally Szczerbiak and Seth Davis in studio along with host Adam Zucker to break down where things stand as college basketball's regular season hits the home stretch.Last year, three of the No. 1 seeds in the early bracket reveal remained the same on Selection Sunday. The only team that dropped from the No. 1 line was Alabama. Houston replaced the Crimson Tide on the No. 1 seed line. All four No. 1 seeds reached the Final Four last season for the second time in the history of the tournament.\nHistory suggests that if you're one of the 16 teams in the early bracket reveal, you will remain a top-four seed on Selection Sunday. The only two teams that dropped out of the top 16 last season were Michigan (No. 4 to No. 5 seed) and Kansas (No. 4 to No. 7). \nHeading into the weekend, Michigan is the projected No. 1 overall seed in CBS Sports' latest Bracketology model projections. Duke, Arizona and Houston are the other No. 1 seeds in the latest projections. Notably, Duke and Michigan play each other on Saturday, which is sure to have massive implications on the team that ultimately earns the No. 1 overall seed in the NCAA Tournament.The 30-minute bracket preview comes before a Big 12 showdown between No. 8 Kansas and Cincinnati on CBS at 1 p.m. \nWhere to watch NCAA March Madness Bracket Preview Date: Saturday, Feb. 21 | Time: 12:30 p.m. ETTV: CBS | Streaming on Paramount+ Premium (Try It Free)   Extended TV coverage: CBS Sports Network, 1 p.m. ET\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NCAA March Madness Bracket Preview 2026: Where to watch, live stream, channel as current top 16 seeds unveiled - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/1aee7e30-92b9-4360-aacc-48fb0c41cd00/thumbnail/1200x675/065b693f19718ddb9e4e45f2ceef323b/gettyimages-2074386326-1.jpg"
      ],
      "datePublished": "2026-02-19T23:10:51.000Z",
      "dateModified": "2026-02-19T23:10:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/alysa-liu-2026-winter-olympics-gold-medal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:57:04.000Z",
    "description": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland nati",
    "body": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland native delivered an electrifying performance during the women's free skate program on Thursday to surge atop the podium.   Liu started the day in third place after posting a 76.59 short program score behind Japan's Ami Nakai and Kaori Sakamoto. As the third-to-last skater of the event, Liu put together a near flawless program while skating to Donna Summer's \"MacArthur Park.\" She received roars from the crowd as she skated with confidence and ease. The positivity exuded off of her with every jump and artistic sequence, culminating with a career-best score of 226.79.\nLiu posted a whopping 150.20 score in the free skate, but had to wait out the programs of Sakamoto and Nakai to learn her fate. However, minor deductions to both Japanese skaters ensured Liu would walk away with gold. Her free skate program was nearly three points higher than the silver medalist, Sakamoto.\"Being able to do it my way on the big stage like this has been my dream,\" Liu said after winning gold, via NBC News. \"I got to do it in my short [program] in the team event and I got to do it tonight in the free skate. I'm just over the moon. I'm the luckiest girl ever, and I'm really grateful.\"   \nLiu finished with a combined score of 226.79, while her American teammates Amber Glenn and Isabeau Levito finished fifth and 12th, respectively. Liu became the first American woman to win an individual gold since Sarah Hughes in 2002 and the eighth American woman overall to accomplish that feat. Earlier in these Games, Liu and Glenn helped the Americans win team gold.NameShort programFree skatingTotal scoreAlysa Liu (USA) 🥇 \t\t\t\t \t\t\t\t \t\t\t\t76.59 \t\t\t\t \t\t\t\t \t\t\t\t150.20 \t\t\t\t \t\t\t\t \t\t\t\t226.79 \t\t\t\t \t\t\t\t \t\t\t\tKaori Sakamoto (JPN) 🥈 \t\t\t\t \t\t\t\t \t\t\t\t77.23 \t\t\t\t \t\t\t\t \t\t\t\t147.67 \t\t\t\t \t\t\t\t \t\t\t\t224.90 \t\t\t\t \t\t\t\t \t\t\t\tAmi Nakai (JPN) 🥉 \t\t\t\t \t\t\t\t \t\t\t\t78.71 \t\t\t\t \t\t\t\t \t\t\t\t140.45 \t\t\t\t \t\t\t\t \t\t\t\t219.16 \t\t\t\t \t\t\t\t \t\t\t\tMone Chiba (JPN) \t\t\t\t \t\t\t\t \t\t\t\t74.00 \t\t\t\t \t\t\t\t \t\t\t\t143.88 \t\t\t\t \t\t\t\t \t\t\t\t217.88 \t\t\t\t \t\t\t\t \t\t\t\tAmber Glenn (USA) \t\t\t\t \t\t\t\t \t\t\t\t67.39 \t\t\t\t \t\t\t\t \t\t\t\t147.52 \t\t\t\t \t\t\t\t \t\t\t\t214.91 \t\t\t\t \t\t\t\t \t\t\t\tAt no point during Liu's performance did she appear to be bothered by the pressure. Even after she received her score, it was all smiles.    No shocked reaction, no tears of joy. Just pure happiness.      A remarkable comeback for Alysa Liu   It's the perfect storybook ending for Liu, who briefly -- and abruptly -- retired from figure skating in 2022 at the age of 16. At the time, as the COVID-19 pandemic forced the cancellation of everything from school classes to entire professional sports seasons, Liu's local rink in the Bay Area closed. That provided her something she hadn't had since she started skating at five years old: a break. That forced break from skating made the idea of leaving the sport forever enticing to Liu, and so she walked away.   This wasn't just any figure skater who decided to call it a career. Liu is a prodigy. She began competing in major competitions at the age of 10. By 13, she became the youngest U.S. women's national champion ever. At 14, Liu became the youngest skater to win two senior national titles. In 2019, she became the first U.S. female figure skater to land a quadruple jump in an international competition.   Liu was at the peak of her powers. But she was satisfied with everything she had accomplished at the time, and decided to move on.   \"It was a crucial time in my life,\" Liu told 60 Minutes in an interview before the Olympics began. \"I was 16 and college was coming up. Like, I wanted to do so much. I went to Nepal and I trekked to Everest Base Camp. Me and my friends would do tons of road trips. I was really just livin' it up. I would say it was my best life.\"   \nBut after two years of quality time with friends and family, and traveling around the world, Liu got the itch to compete again. In 2024 she made her triumphant return, and surprised many in her ability to essentially pick right back up where she left things with no skill loss.   If Liu was to return, though, she wanted to do things differently.   \"I get to pick my own program music,\" Liu said. \"I get to help with the creative process of the program. If I feel like I'm skating too much, I'll back down. If I feel like I'm not skating enough I'll ramp it up. No one's gonna starve me or tell me what I can and can't eat.\"   \n        \n            \n                2026 Winter Olympics: American figure skater Alysa Liu is an unconventional talent on an improbable path\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nHer coach, Phillip DiGuglielmo, said she returned to the sport a better skater.    \"For many years she was dropped off at the rink,\" DiGuglielmo said. \"She was told what to do. Now she comes in, and it is all collaborative.\"   Since returning in 2024, Liu became a world champion in 2025. That made her the first American woman to win a world title since since Kimmie Meissner in 2006. Liu career has reached new heights in ways she never expected -- she's a gold medalist on the biggest stage. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg"
      ],
      "datePublished": "2026-02-19T23:57:04.000Z",
      "dateModified": "2026-02-19T23:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-womens-champions-league-ranking-quarterfinalists-barcelona-real-madrid-chelsea-arsenal-lyonnes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:23:40.000Z",
    "description": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount",
    "body": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount+. After rewriting the tournament script with an 18-team Swiss model league phase, now just eight teams are left in the hunt for Europe's biggest prize. The newly shifted format of the competition produced exciting results, with some lopsided wins, exciting come-from-behind draws to salvage a point, and 181 goals during the league phase. Now it's time to plan for the quarterfinals. The quarterfinals will feature perennial powerhouses FC Barcelona and OL Lyonnes. The two sides dominated their opposition, and a three-goal differential proved the ultimate difference-maker in the standings heading into the quarterfinal phase. Manchester United and Arsenal join Chelsea FC as dominating English clubs in the next round, alongside Bayern Munich, Real Madrid, and Wolfsburg.Which teams are surging and which look untested? Time look at the results, the matchups and to rank the final eight Champions League teams:\nPlayoff resultsReal Madrid 2, Paris FC 0 (Real win 5-2 on aggregateArsenal 3, OH Leuven 1 (Arsenal win 7-1 on aggregate)Wolfsburg 2, Juventus 0 (Wolfsburg win 4-2 on aggregate)Man United 2, Atletico Madrid 0 (United win 5-0 on aggregate)Quarterfinal matchupsWatch all the action live on Paramount+.First legs to be played March 24-25, and second legs April 1-2Man United vs. Bayern MunichReal Madrid vs. BarcelonaArsenal vs. ChelseaWolfsburg vs. Lyon1. FC Barcelona  It's no secret that the Catalonians remain the team to beat in this tournament, topping the league phase with a plus-17 goal differential, and an opening 7-1 annihilation of Bayern Munich that sent defiant alarms throughout the competition. Carolina Graham Hansen, Alexia Putellas, alongside Claudia Pina and rising star Vicky Lopez, are getting it done flawlessly, with Aitana Bonmati on the sidelines with a leg injury.\n2. OL Lyonnes The eight-time winners flexed their champion experience, matched Barcelona's 16 points in the league phase, and showed they can put games away and rally from behind. Melchie Dumornay has officially reintroduced herself as a Ballon d'Or candidate with four goals (two braces) against Arsenal and Manchester United. Dumornay, alongside Kadidiatou Diani, Marie Antoinette Katoto, and Tabitha Chawinga, form an attacking quartet that strikes fear into every backline they face.3. Arsenal   The current title holders had a rocky start to their tournament but are now in solid form and back in familiar territory, the quarterfinals. Peaking at the right time is just part of the equation; scoring 88% of their open play goals off sequences in as few passes as possible makes them a dangerous side to face as the stakes get higher. New acquisition Olivia Smith is getting more lethal, and Alessia Russo is showing she's as reliable as ever in front of goal.4. Manchester UnitedDon't call them nervous newcomers, because the Red Devils keep proving they belong. They carried themselves with defensive performances in the league phase, and showed they know how to score during the knockout playoffs. Goalkeeper Phallon Tulis-Joyce of the U.S. women's national team and center back duo Dominique Jenssen and Maya Le Tissier have become a formidable defensive trio in front of goal.  \n5. Chelsea FCThe Blues earned a straight bye to the quarterfinals out of the league phase with four wins and two draws, and they matched Barcelona's 20 goals scored. They've hit a snag in form domestically, but there's no better reset than a run at the Champions League. The gradual return of Sam Kerr after a lengthy ACL absence adds another dimension to an attack highlighted by Alyssa Thompson's quick rise and skill on offense.6. Bayern MunichIt's tough to rank Bayern Munich outside of the top five but the beauty of a knockout phase highlights the more current form of other clubs, and while they earned their bye through to the quarterfinals after an embarrassing opening 7-1 loss to Barcelona, they won't be as battle tested when they go up against a rising Manchester United in the next round. 7. Real MadridAnother team that was difficult to put this low due to their recent efforts, but Real Madrid's too close for comfort performances combined with a quarterfinal match against their domestic rivals Barcelona, will force some adjusments.  Hopefully, they won't be too dramatic of changes, as Caroline Weir and Linda Caicedo are delivering right when it matters.\n8. VfL Wolfsburg The former two-time champions have quietly built their way back into the quarterfinal round. Veteran Alexandra Popp is still a game changer, with Lineth Beerensteyn and Janina Minge shifting as impact players game to game. The group performance has been fairly mixed, whether that's due to an attack that can sometimes generate, combined with a defence that can also concede. It highlights inconsistency, and that's not who you want to play heading into a quarterfinal against OL Lyonnes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg"
      ],
      "datePublished": "2026-02-19T23:23:40.000Z",
      "dateModified": "2026-02-19T23:23:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USA vs. Canada hockey: Megan Keller scores winning goal in OT, gives U.S. gold medal - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/megan-keller-goal-team-usa-canada-gold-medal-2026-winter-olympics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/14906f65-b392-4b7c-baa3-728b71591ad0/thumbnail/1200x675/4fc8a2790ed7970a249066ace4e66205/megan-keller-goal-getty.png",
    "tag": "Sports",
    "date": "2026-02-19T21:50:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The United States women's hockey team is golden. M",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The United States women's hockey team is golden. Megan Keller put home the game-winning goal in the 2026 Milano Cortina Winter Olympics gold-medal contest against rival Canada in overtime, placing Team USA on top in a 2-1 thriller on Thursday. Keller made a fantastic move to get past defender Claire Thompson and pushed the puck past Ann-Renée Desbiens for the clinching goal to conclude the women's hockey tournament at the Games. Keller's teammates scrambled to embrace her after she secured Team USA's first gold medal since the 2018 Pyeongchang Games.\nKeller became just the fourth player, woman or man, and first American to score an overtime goal in an Olympic gold-medal game. She joined Canada's Sidney Crosby (2010 vs. USA) and Marie-Philip Poulin (2014 vs. USA) and Russia's Kirill Kaprizov (2018 vs. Germany) as the only players to do so.These Olympics are Keller's third with the national team. The Boston College product, who plays professionally with the PWHL's Boston Fleet, finished the Olympic tournament tied with Team USA's Caroline Harvey as the competition's leading scorer with nine points. Her three goals were the most of any defender in the tournament.\nKeller's clutch goal put the finishing touches on a riveting comeback effort from the Americans, who trailed 1-0 with just over two minutes to play in regulation. Hilary Knight leveled the score with 2:04 on the clock in the third period, setting the stage for a golden-goal situation in overtime. Knight's game-tying goal made her the all-time scoring leader in U.S. Olympic women's hockey history.The United States has medaled at every Olympics since women's hockey became an official sport in 1998. This first-place finish is the third in Team USA history.The victory also improved the United States' record against Canada in Olympic gold-medal games to 3-4. The bordering nations have met in the championship in all but one tournament, and Team USA reigned victorious in two of the last three.\nThursday's match was just the second time in the tournament that the Americans needed more than one goal to win a game. They cruised through the competition with five consecutive shutouts after surrendering one goal in the preliminary round opener. The two goals they scored against Canada were their fewest in a game all Olympics, but both scores will live on in United States hockey lore.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USA vs. Canada hockey: Megan Keller scores winning goal in OT, gives U.S. gold medal - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/14906f65-b392-4b7c-baa3-728b71591ad0/thumbnail/1200x675/4fc8a2790ed7970a249066ace4e66205/megan-keller-goal-getty.png"
      ],
      "datePublished": "2026-02-19T21:50:00.000Z",
      "dateModified": "2026-02-19T21:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NCAA pausing talks on NCAA Tournament expansion as president voices support - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ncaa-president-tournament-expansion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/9e5dae67-06a1-4d7c-a475-bca213e7379a/thumbnail/1200x675/5720ff61ddbb0d9a865a068eae2795a6/charlie-baker.png",
    "tag": "Sports",
    "date": "2026-02-19T21:28:03.000Z",
    "description": "\n        INDIANAPOLIS -- Will the NCAA Tournament expand in 2027? Maybe, maybe not, but we know we won't have an answer in the immediate future. On Th",
    "body": "\n        INDIANAPOLIS -- Will the NCAA Tournament expand in 2027? Maybe, maybe not, but we know we won't have an answer in the immediate future. On Thursday, NCAA senior vice president Dan Gavitt told reporters participating in the mock selection committee exercise that talks on expansion will be paused, with an answer not coming until after the 2026 NCAA Tournament at the earliest.Earlier on Thursday, NCAA president Charlie Baker neglected to answer an expansion question when asked Thursday morning at the organization's headquarters. Baker met with 10 members of the media and wrapped the informal interview session by reinforcing his opinion: he would prefer to see March Madness expand. \"I think there's some very good reasons to expand the tournament, so I would like to see it expand,\" Baker said. \nThe NCAA's men's and women's basketball committees have been debating and deliberating the concept of expanding their 68-team tournaments for close to four years now. The general public -- and much of the sports media -- stands opposed to the idea of watering down one of the country's most treasured sporting events. \"For now, we're still talking to the various players in this one,\" Baker said. \"You have to remember that some of the folks we're talking to are going through some pretty interesting corporate conversations of their own. And I think for us, we accept and acknowledge that, but we're still talking.\"Baker added that, regardless of what decision is made, the NCAA Tournament will remain with its 32-team automatic-qualifier format (which has never been in jeopardy of changing) in addition to the at-large bids that fill up the field. Baker is of the belief that the 36 at-large cutoff is too small for the number of teams that should get a crack on the biggest stage in the sport. \n\"That leaves 36 spots,\" Baker said. \"That means you're going to leave a bunch of the top 50 teams out of the tournament, right? ... I mean, couple years ago I was kind of bummed when Seton Hall and Indiana State didn't get in the tournament, because they both had quality wins and quality schedules. ... The more you do to create opportunities for the so-called bubble teams each year to get into the tournament, first of all, it puts some other really good teams that probably might belong there. But it also protects the AQs, right? Because I don't want to end up in a situation where people say we need to do something about the AQs because we're keeping too many good teams out of the tournament.\" CBS Sports asked Baker how much it would presumably cost the NCAA to add 16 more schools to the men's and women's tournaments. The cost element has been one of the biggest blockades in the past three years to expansion efforts.\"I think we can figure out how to pay for it. I'm not worried about that,\" Baker said. \nWhen pressed on the cost in terms of how many millions of dollars the NCAA is projecting to add to its expenses, Baker neglected to give more specifics. He was also asked what his expectation was for the 2027 NCAA Tournament and he declined to go on the record with a prediction. If the NCAA is going to opt to expand for 2027, a decision is expected in the coming weeks.In addition to expansion talk, Baker spoke at length about the challenges of player eligibility and the constant battles the NCAA has been faced with in regard to rosters, NIL regulations and more. He noted the NCAA has a much better track record in court than is often reflected in the media.\n\"We win a lot more of those cases than we lose,\" he said.The NCAA provided the statistics: Since December of 2024, there have been 56 lawsuits filed in eligibility cases. Thirty of those 56 have seen denials for the plaintiffs and 12 have been granted. There are seven still going at the state court level now and five are pending. A local judge recently ruled against Charles Bediako's case at Alabama, while Trinidad Chambliss recently logged a victory in court to give him a sixth year of eligibility. Baker also said the NCAA is having conversations and bracing for the possibility that a few college football players might try to explore options to return to their college teams, should they fail to make NFL teams at training camps in the summer of 2026.\"It's certainly something we've been talking with folks about it,\" Baker said. \"The basketball piece is just different than the football piece for a whole bunch of reasons, but it's certainly something we're discussing.\"\nOn the topic of eventual collective bargaining, Baker was passionate that it's probably not happening or feasible.\"You'd have to get a federal law passed to do that, first of all,\" he said. \"Secondly, student athletes don't want to do that. And third, when everybody says [to collectively bargain] they don't talk about are scholarships now taxable under that arrangement? Does this apply to all the kids in college sports? Because if it does, you can have kids in college sports who are going to have to write checks to their schools to pay for all the benefits they currently get, they don't get taxed on that become benefits that are taxable because they're employees. There's a lot to that issue that nobody ever talks about. ... Saying that is a simple answer to this is not a legitimate response.\" The NCAA has undergone massive changes in the past five years, and Baker has been a proponent for modernizing the 120-year-old organization. For all the progress that has been made with NIL legislation and player empowerment, profound problems still exist and, judging by Baker's comments on Thursday, seem unlikely to be resolved in any major, tangible way in 2026.\n\"People get paid a lot of money to crystal ball this stuff,\" Baker said. \"It's a hard crystal ball, because so much of it is often driven by outside elements and circumstances, which in some cases are totally unpredictable.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NCAA pausing talks on NCAA Tournament expansion as president voices support - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/9e5dae67-06a1-4d7c-a475-bca213e7379a/thumbnail/1200x675/5720ff61ddbb0d9a865a068eae2795a6/charlie-baker.png"
      ],
      "datePublished": "2026-02-19T21:28:03.000Z",
      "dateModified": "2026-02-19T21:28:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Team USA men's hockey in semis: Schedule, scores, standings at 2026 Winter Olympics - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-us-mens-hockey-schedule-results-standings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/c0fa6b00-597a-41a3-85d3-9a37b0122bb2/thumbnail/1200x675/6ebd9b512718a334fa4294478355b3ed/gettyimages-2260796268-2.jpg",
    "tag": "Sports",
    "date": "2026-02-20T00:14:49.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After sneaking past Sweden with an overtime goal f",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After sneaking past Sweden with an overtime goal from Quinn Hughes in the quarterfinals, Team USA will take on Slovakia in the Olympic semifinals. The U.S. hasn't been to the gold medal game since 2010, and it has a great chance to end that drought on Friday.Through its first four games of the tournament, the U.S. has been somewhat inconsistent, but the team has shown the ability to elevate its game at the right time. The American defensemen have played a big role in keeping them alive, especially Hughes, who is tied for the team lead in points with six.Goaltender Connor Hellebuyck has allowed just three goals in three starts, and his save percentage of .957 leads all Olympians, as does his 0.98 GAA. Hellebuyck was especially sharp against Sweden, and he's a big reason why Slovakia should have a tough time putting a crooked number on the scoreboard.Up front, the top three U.S. centers have all had their moment to shine. Jack Eichel has played a great two-way game in each contest, Auston Matthews is tied with Hughes for the team lead in scoring and Dylan Larkin was one of the heroes against Sweden.When it comes to the Slovakian roster, their star power begins and ends with Montreal Canadiens winger Juraj Slafkovsky. He has seven points in four games and seems to be involved on every big goal the Slovaks score. The real surprise of the tournament has been Slovakian goalie Samuel Hlavaj, who boasts a .932 save percentage and will present a challenge for the American offense.Since NHL players first went to the Olympics in 1998, the Americans have never medaled outside of North America. Will that change in Italy?\nU.S. men's hockey scheduleAll times EasternPreliminary roundThursday, Feb. 12: USA 5, Latvia 1Saturday, Feb. 14: USA 6, Denmark 3Sunday, Feb. 15: USA 5, Germany 1QuarterfinalWednesday, Feb. 18: USA 2, Sweden 1 (OT)SemifinalUSA vs. Slovakia | Friday, Feb. 20 | 3:10 p.m. | NBCBronze medal game\nTBD vs. TBD | Saturday, Feb. 21 | 2:10 p.m. | TBDGold medal gameTBD vs. TBD | Sunday, Feb. 22 | 8:10 a.m. | TBD\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Team USA men's hockey in semis: Schedule, scores, standings at 2026 Winter Olympics - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/c0fa6b00-597a-41a3-85d3-9a37b0122bb2/thumbnail/1200x675/6ebd9b512718a334fa4294478355b3ed/gettyimages-2260796268-2.jpg"
      ],
      "datePublished": "2026-02-20T00:14:49.000Z",
      "dateModified": "2026-02-20T00:14:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLS superlatives: Who is stopping Lionel Messi from winning MVP? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/mls-superlatives-lionel-messi-mvp-mls-cup-inter-miami-timo-werner/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/3df254e0-6d8d-47b8-961e-2c6aa30075d6/thumbnail/1200x675/e3a41556200d1c2e7e9cb090bfb3d2df/inter-miami-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:10:54.000Z",
    "description": "\n        Back like it never left, another MLS season is right around the corner after Inter Miami lifted the first MLS Cup in their history in Decembe",
    "body": "\n        Back like it never left, another MLS season is right around the corner after Inter Miami lifted the first MLS Cup in their history in December and will now look to back it up with another one. But with teams around the league improving and a break for the FIFA World Cup in the middle of the season, defending the crown will be no easy task. The addition of Mexican striker German Berterame has improved the squad, but other teams in the Eastern Conference, such as Nashville SC and Orlando City SC, have also made moves to come within striking distance of the Herons.Ahead of the season is always a good time to take a look at who will win the league awards, even if MLS may be one of the most unpredictable leagues in the world, while also taking some fun looks into the crystal ball. So let's get to it:Most Valuable Player - Lionel Messi (Inter Miami CF)Lionel Messi is going for the three-peat as MVP after already becoming the first player in league history to win the award in back-to-back seasons. On one hand, it may feel as if this award has gotten boring since Messi also came close to winning it in only a half-season of play when he first joined the Herons, but no player in the league is coming close to the Argentine's production with Inter Miami. With German Berterame joining from Monterrey, Messi will also have a new partner in attack, and they've shown some chemistry in preseason play. Until proven otherwise, this award is Messi's to lose, and while some like Heung-min Son and Anders Dreyer will do the best they can to take it away from him, if the Messi that has shown up for Miami so far does what's expected in a World Cup year, look out.Seriously, Messi is one of one.\n                                                                    CBS Sports\n                                                            Golden Boot: German Berterame (Inter Miami CF)I don't love taking newcomers for Golden Boot due to needing to fit into a team and learning a new league, but thanks to Concacaf Champions Cup and Leagues Cup, Berterame doesn't have as much of a learning curve as someone coming from abroad due to playing against MLS teams on a regular basis. Scoring 13 goals and assisting three more with Monterrey before departing, Berterame will thrive with the service from Messi, which can make his +2700 odds to win it seem like a bargain. He'll have competition from Messi as well as Sam Surridge and Son in what will be a serious race for the league's top scorer, but the stage is set to succeed.\nMLS Cup champions: Inter Miami CFLike the MVP award, we've got Inter Miami going back-to-back as MLS Cup champions. Sergio Busquets and Jordi Alba may have retired, but in adding Dayne St. Clair from Minnesota United, the defense will improve in the long run. There's also the addition of Sergio Reguillon, which will add dynamism going both ways at left back, and the newness of opening a new stadium, Miami Freedom Park, will only add more energy to help the Herons reach their goal of defending the first MLS Cup title in club history. They'll have opposition, but through Messi, all things are possible.Best signing: Cristian Espinoza (Nashville SC)While a strange set of circumstances led Espinoza to Nashville, his Concacaf Champions Cup debut has already shown a small glimpse of what they'll be getting. Immediately after entering the match, Hany Mukhtar, Surridge, and Espinoza all combined for a quickfire goal for Nashville. We'll be seeing quite a lot of that as Espinoza has been one of the best creators in all of MLS despite playing for a struggling Earthquakes side. B.J. Callaghan has already raised expectations in Nashville, and now having a true third option in attack will help his side reach them as this is an improved side that will make things happen. The days may be behind us of Nashville being a defensive side who are grinding out matches; they're able to take games on their terms.\n                                                                    CBS Sports\n                                                            Worst signing: Timo Werner (San Jose Earthquakes)It may have been a free transfer that brought Timo Werner from RB Leipzig, but when San Jose are replacing Josef Martinez and Cristian Arango with a striker who has scored a total of four goals in the last four seasons is a clear downgrade. The one benefit is that Werner has fresh legs from his lack of playing time over the years, and his speed could give him space when faced against MLS defenses, but it's hard to see this working out. D.C. United get an honorable mention in spending to bring Louis Munteanu from CFR Cluj in Romania, but on potential, he's only 23 and can be molded, while Werner is firmly in his prime age-wise with plenty to prove.\nTeam to watch: Nashville SC After lifting the first trophy in club history by winning the Lamar Hunt U.S. Open Cup in 2025, this season is a time to push for more. Nashville will take part in the Leagues Cup, Concacaf Champions Cup, and MLS play, and with an improved roster, they'll be able to compete on all fronts. In the Eastern Conference, Nashville are the team who have the best chance of knocking out Miami on the way to MLS Cup.MLS Newcomer of the Year: Iago (Orlando City SC CB from Flamengo)One of the most talented young defenders in Brazil, Iago, joining from Flamengo, will be set to anchor Orlando's defense. A member of the Brazil youth national teams, he brings extensive experience to MLS despite only being 20. Oscar Pareja has been one of the best around at improving the performance of young players, and in a quick period, Iago will be able to shine as a defender in MLS. Even if he doesn't net MLS Newcomer of the Year, Iago will be in the running for being the young player of the year, topping the 22 Under 22 list.Supporters' Shield Winners: Orlando City SCTo win the Supporters' Shield, it takes a mix of circumstances, and like the Philadelphia Union last season, Orlando City SC not taking part in the Concacaf Champions Cup will give them more room to rotate and keep their squad fresh for MLS matches. Losing Alex Freeman to Villarreal is quite a loss, but in adding Griffin Dorese, they'll have enough to get by, considering the improvements elsewhere in the roster. There was a serious effort to add from the Brazilian Serie A, with Luis Otavio and Tiago also joining, so Oscar Pareja has a talented roster that can push to win the east.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLS superlatives: Who is stopping Lionel Messi from winning MVP? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/3df254e0-6d8d-47b8-961e-2c6aa30075d6/thumbnail/1200x675/e3a41556200d1c2e7e9cb090bfb3d2df/inter-miami-1.jpg"
      ],
      "datePublished": "2026-02-19T20:10:54.000Z",
      "dateModified": "2026-02-19T20:10:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's Wright pushing for Premier League promotion at Coventry, World Cup spot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/haji-wright-usmnt-coventry-city-world-cup-2026-usa-soccer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/dd9922c3-46f9-4321-8554-8b7d109bb5c3/thumbnail/1200x675/5f0c6b6e563c9c2ec41663574fe8b8fb/conventry-city.jpg",
    "tag": "Sports",
    "date": "2026-02-19T21:03:18.000Z",
    "description": "\n        Despite leading the Championship, 2026 hasn't been kind to Frank Lampard's Coventry City, with the Sky Blues taking only 11 points from eight",
    "body": "\n        Despite leading the Championship, 2026 hasn't been kind to Frank Lampard's Coventry City, with the Sky Blues taking only 11 points from eight matches played in the new year. But in a massive clash atop the table with Middlesbrough, the hottest team in the division, American striker Haji Wright showed that he has what it takes to push for automatic promotion to the Premier League by emerging as a hat trick hero in a 3-1 victory to stay in the drivers seat for winning the Championship after last season's disappointment left Coventry within seconds of a place in the promotion playoff final. Being knocked out by Sunderland via a Dan Ballard goal in the 122nd minute of extra time has only motivated the Sky Blues to avoid needing the playoff altogether. Wright's form has been an important part of that. He's now up to 13 goals and one assist in Championship play while securing his first hat trick of the season and second as a member of Coventry City. Wright is also only two goals behind Swansea City's Zan Vipotnik for the Championship Golden Boot race. A striker who has scored 12 or more goals in five consecutive seasons, Wright is becoming the picture of consistency while finding a true home with Coventry after stops in Germany, the Netherlands, Denmark, and Turkiye along the way.\n        \n            \n                WATCH: USMNT's Folarin Balogun punishes PSG, scores two crucial Champions League goals for AS Monaco\n                \n                    Chuck Booth                \n            \n                            \n    \n                \n                    \n    \nTaking a look at the shot map from the match last weekend, it's clear how involved Wright was, as his expected goals of 1.5 were higher than Middlesbrough's entire team xG of 1.08, and without Wright, Coventry's attack struggled to generate chances in the match -- not that they needed many.\n                                                                    CBS Sports\n                                                            Considering timing, there's almost no better moment for Wright to find his form. He now has five goals in 2026 as he looks to lead Coventry to the Premier League for the first time since the 2000-01 season while also pushing for a spot on the United States World Cup squad after being a surprise inclusion in 2022. Friendlies facing Belgium and Portugal are right around the corner at the end of March, and Wright is making sure that USMNT manager Mauricio Pochettino won't be able to leave him out of the squad.\nWright's first goal was created by his movement as he made it easy for Jack Rudoni to pick out a run before making no mistake, slotting it past Middlesbrough keeper Solomon Brynn.\nThe second was one that showed off his finishing chops. Getting on the run and doing something that he enjoys, playing on the back shoulder of the defense, Wright knew that he had the chance to beat the defense before delivering a devastating finish to double the lead for his side.\nHe'd complete the day from the penalty spot for the hat trick, securing all three points. There's plenty left to do but 32 games into the season, the Sky Blues have a six-point lead for automatic promotion although Ipswich Town have two games in hand which could see them draw within two points of Lampard's men. In all, 14 matches remain in the season so we're fully in the home stretch and Coventry will need Wright to keep up his form as the Premier League potentially awaits.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's Wright pushing for Premier League promotion at Coventry, World Cup spot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/dd9922c3-46f9-4321-8554-8b7d109bb5c3/thumbnail/1200x675/5f0c6b6e563c9c2ec41663574fe8b8fb/conventry-city.jpg"
      ],
      "datePublished": "2026-02-19T21:03:18.000Z",
      "dateModified": "2026-02-19T21:03:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-racism-vinicius-jr-investigation-real-madrid-what-to-know-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:00:49.000Z",
    "description": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forwa",
    "body": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forward. Ahead of Real Madrid and Benfica meeting at the Santiago Bernabeu on Feb. 25 in the UEFA Champions League playoffs second leg, there's a matter that needs to be sorted out due to a current UEFA investigation into an incident between Real Madrid winger Vinicius Junior and Benfica winger Gianluca Prestianni from Tuesday. An alleged racial incident caused the match to be stopped while the referee reviewed what happened, and it has now been moved to an investigation by UEFA to determine the next steps. Both teams are maintaining that their side of the story is the correct one, and here's what to know so far:What happened?After Vinicius Junior scored the winning goal in Real Madrid's 1-0 victory over Benfica in the playoff first leg, the match had to come to a stop due to alleged racial abuse. As he does many times when he scores, Vinicius went to the corner flag to celebrate while dancing, for which he was yellow carded, while objects from the stands also rained down onto the pitch. Benfica weren't happy with this, and Argentine winger Gianluca Prestianni raised his shirt to cover his mouth while speaking to the Brazilian.While it's officially unknown what Prestianni said, he was alleged to have called Vinicius a 'mono' which is the Spanish word for monkey. Vinicius reported the incident to referee Francois Letexier, who paused the match while sorting out the situation as per UEFA's three-step procedure for referees to act against incidents where racism is believed to have taken place.Since it wasn't clear what was said by Prestianni, the referee could only investigate the matter before deciding on a course of appropriate action, which in this case was resuming the match, but the incident is still subject to further investigation once the match is complete.\nUEFA released a statement calling for that investigation, which so far, Real Madrid has complied with:\"A UEFA Ethics and Disciplinary Inspector has been appointed to investigate allegations of discriminatory behaviour during the UEFA Champions League 2025/2026 knock-out play-off match between SL Benfica and Real Madrid CF on 17 February 2026.Further information regarding this matter will be made available in due course,\" the statement read.What's Real Madrid saying?In a statement on Thursday, Real Madrid confirmed that they submitted all the evidence that they have to comply with UEFA's investigation.\n\"Real Madrid C. F. announces that today it has submitted all available evidence to UEFA regarding the incidents that occurred last Tuesday, February 17, during the Champions League match our team played in Lisbon against SL Benfica. Our club has actively collaborated with the investigation opened by UEFA following the unacceptable episodes of racism experienced during that match.Real Madrid appreciates the unanimous support, backing, and affection that our player Vinicius Jr. has received from all areas of the global football community. Real Madrid will continue working, in collaboration with all institutions, to eradicate racism, violence, and hate in sports and society.\"What are Benfica saying?Benfica are supporting Prestianni's statement that what Vinicius said he heard was not what was actually said. There has yet to be an update of their compliance with the investigation, but with the two teams meeting next Wednesday to decide the tie, this is on a compressed timeline.\"The Club reaffirms, clearly and unequivocally, its historical and unwavering commitment to defending the values of equality , respect , and inclusion , which align with the core values of its foundation and which have Eusébio as their greatest symbol.Sport Lisboa e Benfica reiterates that it fully supports and believes in the version presented by the player Gianluca Prestianni , whose conduct while serving the Club has always been guided by respect for opponents, institutions, and the principles that define Benfica's identity. The Club regrets the defamation campaign to which the player has been subjected.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg"
      ],
      "datePublished": "2026-02-19T20:00:49.000Z",
      "dateModified": "2026-02-19T20:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-thursday-february-19-basketball-parlay-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-19T22:17:07.000Z",
    "description": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (",
    "body": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (-1.5), Celtics (-5.5) vs. Warriors and Nuggets (-4.5) vs. Clippers. The largest NBA spread of the day has Cleveland as 15.5-point favorites over Brooklyn, as the Cavs covered in four of their last five games heading into the NBA All-Star break.What are the NBA best bets for Thursday, and which combination of picks should you target in a Thursday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model exited the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.  \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +450. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $100 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Thursday, Feb. 19After simulating every game 10,000 times, the model is backing the Los Angeles Clippers (+4.5) to cover the spread against the Denver Nuggets at 10:30 p.m. ET. The Nuggets look for the season sweep over the Clippers, after posting a 130-116 win in Los Angeles on Nov. 12 and a 122-109 victory at Denver on Jan. 30. The Nuggets will be without Aaron Gordon (hamstring) and Peyton Watson (hamstring) and failed to cover in three of their last four heading into the All-Star break. Meanwhile, Los Angeles has won three of the last four meetings at home against Denver.\nVeteran forward Kawhi Leonard powers the Clippers' offense. In 41 games, all starts, he is averaging 27.9 points, 6.4 rebounds, 3.7 assists and 2.1 steals in 32.8 minutes. He registered a double-double with 27 points and 12 rebounds in a 105-102 win over the Houston Rockets on Feb. 11 and is coming off an epic All-Star Game performance with 31 of the 48 points for USA Stripes against Team World.The model is projecting four Nuggets players to score 10.7 points or more, led by Nikola Jokic's 27.5 points. The Clippers, meanwhile, are projected to be led by Leonard's 30.5 points as five Los Angeles players score 10.2 points or more. The model is backing Los Angeles to cover nearly 70% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Thursday, Feb. 19The model also has locked in two more picks, including backing a team to win in nearly 80% of model simulations. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Thursday, and which best bets should you target for a chance at a payout of over +450? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-19T22:17:07.000Z",
      "dateModified": "2026-02-19T22:17:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is NBA tanking good for? Lakers, 76ers among playoff hopefuls with easiest matchups down the stretch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-tanking-lakers-76ers-playoff-hopefuls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/4d88efac-6ec8-4df6-92b3-18594f463081/thumbnail/1200x675/50b666f837907fb68bcdc927e6d94395/luka-kings-imagn.png",
    "tag": "Sports",
    "date": "2026-02-19T19:38:56.000Z",
    "description": "\n        With the trade deadline and All-Star break in the rearview mirror and NBA action resuming Thursday night, the stretch run is upon us. Every t",
    "body": "\n        With the trade deadline and All-Star break in the rearview mirror and NBA action resuming Thursday night, the stretch run is upon us. Every team has between 26 and 29 games remaining, and of course, there is a wide disparity in the difficult of those remaining schedules. This will certainly factor, perhaps heavily, into the various postseason races and ultimately the final picture. Just as an example, if the Thunder are going to hold off the charging Spurs for the West's top seed, they'll have to do so while navigating the league's second-toughest remaining slate. The Cavs, meanwhile, are within striking distance of the East's No. 2 seed and have the league's fifth-easiest stretch-run schedule, while Boston, currently two games up on Cleveland, is saddled with the fifth-toughest. A big part of all this is of course the tanking issue that everyone is talking about right now. If you're a team fighting for playoff positioning, the more games you have left against teams actively trying to lose the better. \n\n        \n            \n                Eight best storylines for NBA stretch run: Is Jayson Tatum coming back? Can Spurs jump OKC? MVP up for grabs?\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nSo first, let's identify the teams that are, no matter what method of deception they choose to hopefully avoid punishment, in the unmitigated business of tanking for the best lottery odds possible the rest of the way. Washington WizardsIndiana PacersBrooklyn NetsSacramento KingsUtah JazzDallas MavericksThose six are unquestioned. They have absolutely no incentive to win a single game the rest of the way. Add to that the Grizzlies and Bucks, the latter of whom should be, and probably will be, an increasingly egregious tanker moving forward (their only valuable asset moving forward, either as a building block for a post-Giannis future or as part of a trade package to try to keep Giannis), and take out the Pelicans who don't own their '26 pick, and you have eight tanking teams. So, which contenders/postseason hopefuls have the most remaining games against these teams? Here's a look at the Eastern Conference. \nPLAYOFF HOPEFULS \t\t\t\tTANKING OPPONENTS \t\t\t\t76ers \t\t\t\t9 \t\t\t\tHawks \t\t\t\t9 \t\t\t\tHornets \t\t\t\t9 \t\t\t\tCavaliers \t\t\t\t9 \t\t\t\tKnicks \t\t\t\t8 \t\t\t\tMagic \t\t\t\t8 \t\t\t\tRaptors \t\t\t\t8 \t\t\t\tHeat \t\t\t\t7 \t\t\t\tPistons \t\t\t\t7 \t\t\t\tCeltics \t\t\t\t4 \t\t\t\tYou can see how much this could end up impacting the playoff picture. Take the Celtics, for instance. They enter their final 28 games with a one-game lead over the No. 3 Knicks and a two-game lead over the No. 4 Cavs (in the loss column), but while Boston has just four games left against tanking teams the Knicks have eight and the Cavs have nine.  Now let's look at the West.  PLAYOFF HOPEFULS \t\t\t\tTANKING OPPONENTS \t\t\t\tTrail Blazers \t\t\t\t10 \t\t\t\tWarriors \t\t\t\t9 \t\t\t\tClippers \t\t\t\t8 \t\t\t\tLakers \t\t\t\t8 \t\t\t\tRockets \t\t\t\t7 \t\t\t\tSpurs \t\t\t\t7 \t\t\t\tThunder \t\t\t\t7 \t\t\t\tSuns \t\t\t\t7 \t\t\t\tNuggets \t\t\t\t6 \t\t\t\tTimberwolves \t\t\t\t5 \t\t\t\tAgain, you can see the potential impact here. The Timberwolves are only one game back of the Lakers, but the Lakers have three more tank opponents left than Minnesota. The Suns are only two losses back of the Wolves for the final playoff spot and they have two more tank games left than Minnesota.  In theory, these should be pretty much guaranteed wins and having more of them is a big deal and one of the real downstream effects of nearly a third of the league being incentivized to lose the rest of the way.If Adam Silver wants this to stop, he's going to have to drastically alter the draft system, if not scrap it totally and treat incoming rookies just like every other free agent, though that idea comes with a lot of unintended pitfalls of its own. There's no great answer here, but know this: Until someone figures one out, it is always going to be the smart play for these lower-class teams to drop in the standings and rise in the lottery, and we're going to be seeing a lot of this over these six weeks. Think about it: If you're one of these eight teams with either no shot to even make the play-in or battling for a No. 10 seed, the simple truth of the matter is that every win over these next six weeks is, in fact, a loss. The benefit of possibly landing a superstar rookie who could completely reshape your franchise's trajectory over the next decade plus is just too great in comparison to winning a few more games and possibly making the play-in tournament. Just look at the Mavericks last year. They were one win from making the playoffs. Had they beaten Memphis, they wouldn't have had any lottery balls in the hopper. But they lost that game, giving them a 1.8% chance to land the top overall pick, and I'll be damned if it didn't happen. Now they have Cooper Flagg. The Sixers lost 29 of their final 33 games last year and it yielded them VJ Edgecombe. It's a no-brainer. Lose now to win later. All these teams are going to do it, and it's not just going to effect the ultimate lottery order. It's likely going to impact the playoff picture in a meaningful way. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is NBA tanking good for? Lakers, 76ers among playoff hopefuls with easiest matchups down the stretch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/4d88efac-6ec8-4df6-92b3-18594f463081/thumbnail/1200x675/50b666f837907fb68bcdc927e6d94395/luka-kings-imagn.png"
      ],
      "datePublished": "2026-02-19T19:38:56.000Z",
      "dateModified": "2026-02-19T19:38:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League scenarios: What each playoff team needs to make round of 16 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-scenarios-permutations-real-madrid-psg-newcastle-monaco-inter/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/f2688983-9f8a-4857-9415-7d0257e3bb3e/thumbnail/1200x675/aa894d4c00e9564a99276a5fd98f06c4/mbappe-4.jpg",
    "tag": "Sports",
    "date": "2026-02-19T17:43:14.000Z",
    "description": "\n\n\n    \n                                    The results needed for the likes of Real Madrid and PSG are straightforward, but for teams like Inter, not",
    "body": "\n\n\n    \n                                    The results needed for the likes of Real Madrid and PSG are straightforward, but for teams like Inter, not so much\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 19, 2026\n                            \n                    at\n    12:43 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        We're halfway through the knockout stage of the Champions League as the round of 16 is closer to being set. Some big scorelines from Newcastle United and Galatasaray will have them feeling good, but they can't be overconfident, as no lead is safe in knockout soccer. Meanwhile, Inter could fall to a Bodo/Glimt side that have already brushed aside Atletico Madrid and Manchester City in the competition. There's still much to play for in the second legs of these ties, and you can catch all the action on Paramount+ for those matches next Tuesday and Wednesday, as well as the rest of the competition throughout the spring. If any of the games are level on aggregate at the end of regulation, they will go to two 15-minute periods of extra time before a penalty shootout if they are still level. But let's take a look at the upcoming schedule and what each team needs to advance to the next round.Knockout stage scheduleAll times Eastern, All matches available on Paramount+Tuesday, Feb. 24\nAtletico Madrid vs. Club Brugge, 12:45 p.m.Bayer Leverkusen vs. Olympiacos, 3 p.m.Inter vs. Bodo/Glimt, 3 p.m.Newcastle United vs. Qarabag, 3 p.m.Wednesday, Feb. 25Atalanta vs. Dortmund, 12:45 p.m.Galatasaray vs. Juventus, 3 p.m.PSG vs. Monaco, 3 p.m.Real Madrid vs. Benfica, 3 p.m.Galatasaray vs. JuventusFirst leg score: Galatasaray 5, Juventus 2Galatasaray advance: As long as they don't lose by more than two goals in Turin.Juventus advance: If they win by four or more goals.The tie goes to extra time/penalties: If Juventus win by three goals.Benfica vs. Real Madrid First Leg score: Benfica 0, Real Madrid 1Real Madrid advance: if they maintain a one goal advantage over Benfica.Benfica advance: If they defeat Real Madrid by more than one goal.The tie goes to extra time/penalties: If Benfica win by one goal.Monaco vs. Paris Saint-Germain First leg score: Monaco 2, PSG 3PSG advance: If they maintain a one goal advantage over Monaco.Monaco advance: If they defeat PSG by more than one goal.The tie goes to extra time/penalties: If Monaco win by one goal.Borussia Dortmund vs. AtalantaFirst leg score: Dortmund 2, Atalanta 0Borussia Dortmund advance: As long as they don't lose by more than one goal.Atalanta advance: If they win by three or more goals.The tie goes to extra time/penalties: If Atalanta win by two goals.Qarabag vs. Newcastle UnitedFirst leg score: Qarabag 1, Newcastle United 6Newcastle United advance: As long as they don't lose by more than four goals. Qarabag advance: If they win by six or more goals.The tie goes to extra time/penalties: If Qarabag win by five goals.Bodo/Glimt vs. InterFirst leg score: Bodo/Glimt 3, Inter 1Bodo/Glimt advance: As long as they don't lose by more than one goal.Inter advance: If they win by three or more goals.The tie goes to extra time/ penalties: If Inter win by two goals.Club Brugge vs. Atletico MadridFirst leg score: Club Brugge 3, Atletico Madrid 3Who goes through? The winner of this tie will advance to the round of 16.What is they tie? A draw will see the tie go to extra time/penalties.Olympiacos vs. Bayer LeverkusenFirst leg score: Olympiacos vs. Bayer Leverkusen 2Bayer Leverkusen advance: As long as they don't lose by more than one goal.Olympiacos: If they win by three or more goals.The tie goes to extra time/ penalties: If Olympiacos wins by two goals.\n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League scenarios: What each playoff team needs to make round of 16 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/f2688983-9f8a-4857-9415-7d0257e3bb3e/thumbnail/1200x675/aa894d4c00e9564a99276a5fd98f06c4/mbappe-4.jpg"
      ],
      "datePublished": "2026-02-19T17:43:14.000Z",
      "dateModified": "2026-02-19T17:43:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]