[
  {
    "title": "Lakers vs. Spurs prediction, odds, time, spread: 2026 NBA picks for Wednesday from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lakers-spurs-odds-prediction-spread-line-time-2026-nba-picks-january-7/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/482cef61-d59a-4518-aae2-a4e04f92f9a7/thumbnail/1200x675/e02b0578b7e0260c21a7819e169f630d/luka-doncic-los-angeles-lakers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-08T00:00:50.000Z",
    "description": "\n        A Western Conference matchup on Wednesday's NBA schedule has the Los Angeles Lakers visiting the San Antonio Spurs. The Lakers (23-11) have w",
    "body": "\n        A Western Conference matchup on Wednesday's NBA schedule has the Los Angeles Lakers visiting the San Antonio Spurs. The Lakers (23-11) have won three in a row, including a 111-103 victory over New Orleans on Tuesday. San Antonio (25-11) has lost back-to-back outings, including a 106-105 defeat to Memphis on Tuesday. LeBron James (sciatica, foot) is listed as questionable, while Austin Reaves (calf) and Rui Hachimura (calf) are both out for Los Angels. San Antonio lists Victor Wembanyama (knee) as questionable, while Devin Vassell (adductor) is out. Tipoff is at 9:30 p.m. ET from Frost Bank Center in San Antonio. The teams have split their two meetings this season. San Antonio is a 7.5-point favorite in the latest Lakers vs. Spurs odds per SportsLine consensus, while the over/under is 235.5 points. Before making any Spurs vs. Lakers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Spurs vs. Lakers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Lakers vs. Spurs: Spurs vs. Lakers spread:    Spurs -7.5 at DraftKings SportsbookSpurs vs. Lakers over/under:    235.5 pointsSpurs vs. Lakers money line:    Spurs -293, Lakers +236Spurs vs. Lakers picks:    See picks at SportsLineSpurs vs. Lakers streaming:Fubo (Try for free)  New users can check out the latest FanDuel promo code to get $300 in bonus bets if your initial $5 wager wins:How to make Lakers vs. Spurs picksAfter 10,000 simulations of Spurs vs. Lakers, SportsLine's model is going Under on the total (235.5 points). The total has not been reached in each of the last three Spurs games, while the Under has also hit in each of the Lakers last two contests. Not only that for San Antonio, but it has seen the Under go 9-2 over its last 11, and one can't forget this is the second night of a back-to-back for both teams. That's played a factor in Spurs games as the Under is 4-1 in such situations this season.The Lakers haven't reached the total in each of their last five road games, and the team will be shorthanded on Wednesday with Reaves (calf) definitely out, while James may sit as well as he hasn't played a back-to-back this entire season. The teams are projected to combine for 232 points as the Under hits in well over 50% of simulations.The model also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Lakers vs. Spurs, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Spurs vs. Lakers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lakers vs. Spurs prediction, odds, time, spread: 2026 NBA picks for Wednesday from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/482cef61-d59a-4518-aae2-a4e04f92f9a7/thumbnail/1200x675/e02b0578b7e0260c21a7819e169f630d/luka-doncic-los-angeles-lakers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-08T00:00:50.000Z",
      "dateModified": "2026-01-08T00:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals College Football Playoff semifinal picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-playoff-semifinal-picks-best-bets-odds-predictions-model-backing-oregon/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/06/2e4b22d9-2d3a-404d-b7a8-617535404b13/thumbnail/1200x675/2d6ba76456807fb173d2793398748eab/dante-moore-oregon.jpg",
    "tag": "Sports",
    "date": "2026-01-07T23:37:01.000Z",
    "description": "\n        A trip to the national championship is on the line when the College Football Playoff semifinals take place on Thursday and Friday. The first ",
    "body": "\n        A trip to the national championship is on the line when the College Football Playoff semifinals take place on Thursday and Friday. The first matchup of the CFP semifinals will feature the No. 6 Ole Miss Rebels taking on the No. 10 Miami Hurricanes on Thursday at 7:30 p.m. ET. The Hurricanes, who are 4-1 in their last five meetings against an opponent from the SEC, are favored by 3.5 points, according to the latest college football odds. On Friday, a Big Ten battle unfolds when the No. 1 Indiana Hoosiers take on the No. 5 Oregon Ducks at 7:30 p.m. ET. The Hoosiers won the first meeting of the season, 30-20, and Indiana is favored by four points this time around. Before locking in your College Football Playoff semifinal picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also target the latest DraftKings promo code, which offers $300 in bonus bets if your first $5 bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:College football best bets for CFP semifinals (odds subject to change): Ole Miss vs. Miami: Over 51.5 pointsOregon (+4) vs. IndianaOregon vs. Indiana: Under 46.5 pointsCombining the model's three picks into a college football parlay would result in a payout of +604 (risk $100 to win $604). Bet it now at Caesars Sportsbook: Ole Miss vs. Miami: Over 51.5 Ole Miss's explosive offense was on full display in the Rebels' 39-34 win over the Georgia Bulldogs. Quarterback Trinidad Chambliss threw for 362 yards and two touchdowns, while running back Kewan Lacy rushed for 98 yards and two scores. Miami is coming off a hard-fought 24-14 win over Ohio State, but the Hurricanes' offense could find success against an Ole Miss defense that gave up 4.9 yards per play against Georgia. In addition, the total has gone Over in six of the last seven games in which Ole Miss was the underdog. SportsLine's model is projecting these teams will combine for 57 points on Thursday, helping the Over hit in 59% of simulations. Bet on Ole Miss vs. Miami at DraftKings Sportsbook, where new users can get $300 in bonus bets if your first bet of at least $5 wins.Oregon (+4) vs. IndianaBoth defenses were disruptive in the quarterfinals, with Oregon posting a shutout against Texas Tech and Indiana holding Alabama to just three points. These two foes squared off on Oct. 11, with Indiana walking away with a 30-20 victory on the road. Oregon has reeled off eight consecutive wins since then, and the Ducks are 4-1 against the spread in their last five games. According to the model's projections, Oregon suffers a 24-22 defeat, but the Ducks cover the spread 56% of the time. Bet on Oregon vs. Indiana at FanDuel Sportsbook, where new users can bet $5, get $300 in bonus bets if your bet wins. Indiana vs. Oregon: Under 46.5 pointsBoth of these defenses have been playing spectacularly in recent weeks. Oregon has given up 16 or fewer points in six of its past eight games, which includes shutting out Texas Tech in the quarterfinals, while Indiana has conceded 10 points or fewer in six of its last seven contests. These two teams combined to go 8/28 on 3rd-down conversions in the first meeting, and SportsLine's model is projecting another defensive battle as these teams combine for 45 points on Friday, helping the Under hit in 54% of simulations. Bet on Indiana vs. Oregon at bet365, where new users can get $200 in bonus bets after placing a first wager of $5 or more.Want more college football picks?You've seen the model's College Football Playoff semifinal best bets. Now, get against the spread, total and money line picks for every game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals College Football Playoff semifinal picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/06/2e4b22d9-2d3a-404d-b7a8-617535404b13/thumbnail/1200x675/2d6ba76456807fb173d2793398748eab/dante-moore-oregon.jpg"
      ],
      "datePublished": "2026-01-07T23:37:01.000Z",
      "dateModified": "2026-01-07T23:37:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuggets vs. Celtics prediction, odds, time: 2026 NBA picks for Wednesday, Jan. 7 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nuggets-celtics-odds-prediction-line-time-2026-nba-picks-wednesday-january-7/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/30/ea7fad1d-414d-4fa5-843c-4b8bc54f59f0/thumbnail/1200x675/3c949653999be98fcb9eec0e655827c1/jaylen-brown-boston-celtics-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-07T22:30:40.000Z",
    "description": "\n        The Boston Celtics look to stay hot when they take on the injury-plagued Denver Nuggets in a key matchup on Wednesday night. Denver is coming",
    "body": "\n        The Boston Celtics look to stay hot when they take on the injury-plagued Denver Nuggets in a key matchup on Wednesday night. Denver is coming off a 125-124 win at Philadelphia on Monday, while Boston stopped Chicago 115-101 that same night. The Nuggets (24-12), who are second in the Northwest Division, are 14-7 on the road this season. The Celtics (23-12), who are first in the Atlantic Division, are 11-5 on their home court. Jonas Valanciunas (calf), Nikola Jokic (knee) and Cameron Johnson (knee) are all out for Denver. Jamal Murray (ankle), Tim Hardaway Jr. (illness), Aaron Gordon (hamstring) and Christian Braun (ankle) have all been upgraded from questionable to probable.Tipoff from TD Garden in Boston is set for 7 p.m. ET. Boston is a 9.5-point favorite in the latest Nuggets vs. Celtics odds from DraftKings Sportsbook, while the over/under for total points scored is 230.5. Before making any Nuggets vs. Celtics picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    \nNow, the model has simulated Nuggets vs. Celtics 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. Nuggets:Nuggets vs. Celtics                                                     spread:    Boston -9.5 at DraftKings    Nuggets vs. Celtics                                                                   over/under:    230.5 pointsNuggets vs. Celtics                                                                   money line:    Denver +298, Boston -377Nuggets vs. Celtics                                                                   picks:    See picks at SportsLineNuggets vs. Celtics                                                                   streaming:Fubo (Try for free) New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Nuggets vs. Celtics picksSportsLine's model is going Over on the total (231.5 points). The total has gone over in four of the last seven head-to-head meetings. The Over has also hit in six of the last eight Nuggets games. The SportsLine model is projecting Denver's Jamal Murray -- if he's able to go -- to score 24.2 points on average and be one of four Nuggets players to score 11.9 or more points. Boston's Jaylen Brown, meanwhile, is projected to have 30.1 points as five Celtics players score 11.7 points or more.It has also generated an against-the-spread pick that hits in nearly 70% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. Nuggets, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Nuggets vs. Celtics spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuggets vs. Celtics prediction, odds, time: 2026 NBA picks for Wednesday, Jan. 7 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/30/ea7fad1d-414d-4fa5-843c-4b8bc54f59f0/thumbnail/1200x675/3c949653999be98fcb9eec0e655827c1/jaylen-brown-boston-celtics-imagn-images.jpg"
      ],
      "datePublished": "2026-01-07T22:30:40.000Z",
      "dateModified": "2026-01-07T22:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wild Card Weekend NFL odds, betting lines, spread, predictions: Picks from 10,000 computer sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-wild-card-weekend-odds-lines-spreads-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-07T22:41:19.000Z",
    "description": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be high",
    "body": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be highly sought after with NFL picks. Meanwhile, Green Bay is riding a four-game losing streak and is a 1.5-point favorite against the Bears on Saturday night, per the latest Wild Card Weekend NFL odds.Those two split their regular season matchups as they'll tangle in the postseason for just the third time ever. The NFL line for that game matches Bills vs. Jaguars (+1.5) as the slimmest of the Wild Card Weekend NFL spreads, while the largest has the Rams favored by 10.5 points over the Panthers. Other spreads include 49ers vs. Eagles (-4.5), Chargers vs. Patriots (-3.5) and Steelers vs. Texans (-3). All of the updated Wild Card Weekend NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Wild Card Weekend NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Wild Card Weekend NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Wild Card Weekend NFL predictionsOne of the model's strongest Wild Card Weekend NFL picks is the Steelers (+3, 39.5) covering at Houston on Monday night at 8 p.m. ET. These teams have the same 9-8 spread record, but Pittsburgh is 4-1 ATS over its last five, while Houston has failed to cover in two of its last three. While Houston has an elite defense, it allowed its most points (30) all year in Week 18 to a Colts team with a fourth-string rookie quarterback, which is no comparison to an Aaron Rodgers-led unit getting back a rested DK Metcalf. As for C.J. Stroud, he is 0-2 on the road in his playoffs career, failing to account for a touchdown in either loss. The Steelers are forecasted to cover over 50% of the time, with the Over hitting in well over 50% of simulations. See which other teams to pick here, and bet the Steelers using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make Wild Card NFL picksThe model has also made the call on who wins and covers in every other game on the Wild Card Weekend NFL schedule and just revealed three teams projected to outright win over 60% of the time, potentially giving you a huge payday. You can only get every pick for every game at SportsLine, and for a limited time, get your first month at SportsLine for just $1 using promo code CHAMPIONSHIP.So what Wild Card NFL picks can you make with confidence, and which three picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Wild Card Weekend NFL betting odds, lines, live spreads, scoresGet Wild Card NFL picks at SportsLineGameSpreadTotalPicksRams at Panthers (Saturday)LAR -10.546.5SEE  PICKS HEREPackers at Bears (Saturday)GB -1.545.5SEE  PICKS HEREBills at JaguarsBUF -1.551.5SEE  PICKS HERE49ers at EaglesPHI -4.544.5SEE  PICKS HEREChargers at PatriotsNE -3.546.5SEE  PICKS HERETexans at Steelers (Monday)HOU -339.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild Card Weekend NFL odds, betting lines, spread, predictions: Picks from 10,000 computer sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-07T22:41:19.000Z",
      "dateModified": "2026-01-07T22:41:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League picks: Arsenal vs. Liverpool prediction, odds, expert bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-vs-liverpool-prediction-odds-picks-for-premier-league-match-on-thursday-jan-8/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/00e5a5c7-898d-4da1-a0ea-2cbc993570e4/thumbnail/1200x675/d02c98f6b7694da058c157fbdd7cdd25/sakanew.jpg",
    "tag": "Sports",
    "date": "2026-01-07T22:44:02.000Z",
    "description": "\nArsenal are 14 points clear of Liverpool in the Premier League table when the two sides meet on Thursday, Jan. 8 in the second matchup of the year be",
    "body": "\nArsenal are 14 points clear of Liverpool in the Premier League table when the two sides meet on Thursday, Jan. 8 in the second matchup of the year between them. Liverpool are one of two clubs to defeat Arsenal in domestic play, though the Gunners have been able to pull away from most of the league in an effort to capture the club's first EPL title since 2003-04. Arsenal enter this match on a five-game winning streak while Liverpool have drawn their last two matches after winning three in a row.Kickoff from Emirates Stadium in London is set for 3 p.m. ET. Arsenal are -180 favorites (wager $180 to win $100) in the latest Arsenal vs. Liverpool odds at DraftKings Sportsbook while Liverpool are +475 underdogs (wager $100 to win $475). A draw is priced at +330 and the total is set at 2.5 (Over -135, Under +105). You can find the latest projections for Arsenal vs. Liverpool at SportsLine but before locking in any bets, you should see where soccer expert Jon Eimer is leaning towards for this high-stakes clash.Eimer finished 2023 as SportsLine's No. 1 soccer expert, posting a 248-234-12 (+25.93 units) record on SportsLine article picks. Eimer has been red-hot in 2025, posting a profit in multiple leagues, including the Premier League, Champions League, La Liga and more. Anyone following his soccer betting picks at sportsbooks and on betting apps could have seen huge returns.  Here are Eimer's best bets and analysis for Arsenal vs. Liverpool on Thursday.Arsenal vs. Liverpool best betsArsenal money line and Over 1.5 goals (-120): 1uBoth teams to score (-120): 1uExact score: Arsenal 3-1 (+1200): 1uManchester City keep dropping pointsArsenal have been motivated all season as the team is pressing towards a long overdue EPL title. The team, however, has found some additional motivation as Manchester City keep dropping points. The Citizens have now dropped points from a winning position in back-to-back fixtures. We watched them lose two points after a draw to Chelsea, followed by a 1-1 draw to Brighton.This means that a victory against Liverpool would put Arsenal a full nine points ahead of the next best team on the table. Arsenal will look to be as aggressive as ever knowing the importance of three points against a club as big as Liverpool.Liverpool's key absencesLiverpool have put together a strong run of performances as they are unbeaten in the last nine matches. While they are not losing, they still don't look like their usual dominate self, having dropped points to Fulham and Leeds. They barely beat Wolves 2-1. This team is struggling to find form and their injuries and international duties aren't helping.Alexander Isak and Hugo Ekitike are both out in this match due to injury while Mo Salah is still gone for AFCON duties. The lack of a clear goalscorer and a leaky backline means that Liverpool are in for a rough time against the best club in Europe. I still believe Liverpool will score as Arsenal have conceded in four of their last five but ultimately, this should be a comfortable three points for the Gunners.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League picks: Arsenal vs. Liverpool prediction, odds, expert bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/00e5a5c7-898d-4da1-a0ea-2cbc993570e4/thumbnail/1200x675/d02c98f6b7694da058c157fbdd7cdd25/sakanew.jpg"
      ],
      "datePublished": "2026-01-07T22:44:02.000Z",
      "dateModified": "2026-01-07T22:44:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, TV, streaming every round from wild card to Super Bowl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg",
    "tag": "Sports",
    "date": "2026-01-07T23:12:27.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                    ",
    "body": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 7, 2026\n                            \n                    at\n    6:12 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports Design\n            \n            \n    \n        After one of the wildest seasons in NFL history, the playoffs are finally here. This year's postseason won't have Patrick Mahomes and the Chiefs or Lamar Jackson and the Ravens, but there will still be plenty of familiar faces. The Eagles are in the playoffs for the fifth straight season and they'll be looking to become the first NFC team in 31 years to repeat as Super Bowl champion. Jalen Hurts is one of just two quarterbacks in the playoffs this year who has won a Super Bowl along with Matthew Stafford and Aaron Rodgers. The Steelers quarterback actually has more career playoff wins than every other QB in the AFC playoff field combined. There are also plenty of new faces in the postseason this year, including six teams that didn't make the playoffs last year with the Seahawks, 49ers, Panthers, Bears, Patriots and Jaguars all getting in. The final five teams in that group all lost at least 11 games last year before rebounding to make the postseason this year. The Panthers are in playoffs for the first time since 2017 and they'll be kicking off the postseason this year by hosting the Saturday afternoon game. With that in mind, let's get to the full playoff schedule. \n        \n            \n                Renner's 2026 NFL mock draft 6.0: Raiders, Jets land QBs with top picks; Ty Simpson to Super Bowl contender\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \nWild Card WeekendSaturday, Jan. 10(5) Rams at (4) Panthers, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Packers at (2) Bears, 8 p.m. ET (Amazon Prime)Sunday, Jan. 11(6) Bills at (3) Jaguars, 1 p.m. ET (CBS) (Stream on Paramount+)(6) 49ers at (3) Eagles, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Chargers at (2) Patriots, 8 p.m. ET (NBC)Monday, Jan. 12(5) Texans at (4) Steelers, 8 p.m. ET (ESPN/ABC) (Stream: Fubo -- try for free)Divisional RoundSaturday, Jan. 17AFC or NFC divisional matchup, 4:30 p.m. ET AFC or NFC divisional matchup, 8 p.m. ETSunday, Jan. 18AFC or NFC divisional matchup, 3 p.m. ETAFC or NFC divisional matchup, 6:30 p.m. ETNote: The winner of the Monday night game in the wild card round will play on Sunday in the divisional round. The Broncos and Seahawks will both host a game in the divisional round after getting a bye in the wild card round. Championship SundaySunday, Jan. 25\nAFC Championship, 3 p.m. ET (CBS)NFC Championship, 6:30 p.m. ET (Fox)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, TV, streaming every round from wild card to Super Bowl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg"
      ],
      "datePublished": "2026-01-07T23:12:27.000Z",
      "dateModified": "2026-01-07T23:12:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shedeur Sanders' home burglary update: Three arrested for stealing $200K in property - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/shedeur-sanders-home-burglary-update-three-arrested-for-stealing-200k-in-property-from-browns-qbs-house/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/af17fe88-6881-4d24-a043-175bd7496824/thumbnail/1200x675/6c039cf9126973a7ec25f55a40a99a60/gettyimages-2254656416-2.jpg",
    "tag": "Sports",
    "date": "2026-01-08T00:02:36.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Medina County Sheriff's Office in Ohio has arr",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Medina County Sheriff's Office in Ohio has arrested three suspects in connection with the burglary of Shedeur Sanders' home on Nov. 16. The trio -- along with a fourth suspect -- are accused of stealing $200,000 in property from the Cleveland Browns quarterback during his NFL debut in Week 11.While Sanders was getting his first taste of NFL action, three suspects allegedly entered Sanders' home wearing masks and gloves shortly before 7 p.m. and made off with roughly $200,000 in property. A fourth suspect was driving the vehicle that transported the group. While three of those suspects are now in custody, one more remains at large with an active warrant out for his arrest.Sanders is far from the only high-profile NFL player who has been burglarized during a game. In 2024, the homes of Patrick Mahomes and Travis Kelce were robbed during a game. Additionally, Joe Burrow's house was broken into during a \"Monday Night Football\" game.On the day his home was robbed, Sanders replaced an injured Dillon Gabriel against the Baltimore Ravens. In his first NFL game, Sanders completed four of his 16 passing attempts for 47 yards and an interception. Sanders remained the Browns' starting quarterback for the rest of the season, completing 56.6% of his passes for 1,400 yards, seven touchdowns and 10 interceptions.\nSanders and the entire Browns organization is entering a new era this offseason after the firing of coach Kevin Stefanski, who spent six seasons with the team.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shedeur Sanders' home burglary update: Three arrested for stealing $200K in property - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/af17fe88-6881-4d24-a043-175bd7496824/thumbnail/1200x675/6c039cf9126973a7ec25f55a40a99a60/gettyimages-2254656416-2.jpg"
      ],
      "datePublished": "2026-01-08T00:02:36.000Z",
      "dateModified": "2026-01-08T00:02:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Todd Bowles will be back as Buccaneers coach in 2026, but staff changes appear likely - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/todd-bowles-will-be-back-as-buccaneers-coach-but-changes-will-reportedly-be-made-to-his-staff/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/d74a6e22-863b-40bf-94bb-2b6e0c233d20/thumbnail/1200x675/cc4f4806e376e54240f3eec1f528694c/bowles.jpg",
    "tag": "Sports",
    "date": "2026-01-07T21:54:37.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tampa Bay Buccaneers coach Todd Bowles told report",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tampa Bay Buccaneers coach Todd Bowles told reporters on Monday that he has earned the chance to remain as the Bucs lead man in 2026 following an 8-9 campaign, pointing to his three straight division titles as a reason why. On Wednesday, we learned that Bowles will indeed be back for his fifth season, per CBS Sports NFL insider Jonathan Jones.Bowles reportedly met with the Glazer family on Tuesday, and conducted interviews with his coaching staff on Wednesday. He also told the Tampa Bay Times that there will be some changes made to his coaching staff. This season marks the first time that the Bucs missed the playoffs in the Bowles era. Tampa Bay started the 2025 campaign 6-2 and looked like it had an MVP frontrunner in quarterback Baker Mayfield. However, after their Week 9 bye, the Bucs lost seven of their remaining nine games. That includes four straight losses from Weeks 14-17 to the New Orleans Saints, Atlanta Falcons, Carolina Panthers and Miami Dolphins. \nThat four-week stretch was a tough one that ultimately decided the Bucs' season. In Week 15, Bowles' defense allowed Kirk Cousins to convert a fourth-and-14 late in the fourth quarter to set up a Falcons game-winning field goal. In Week 16, Mayfield threw an interception while attempting to lead a game-winning drive against the Panthers. Then in Week 17, the Buccaneers were upset yet again, allowing rookie quarterback Quinn Ewers to earn his first career win in the Dolphins' 20-17 victory. The Buccaneers did defeat Carolina in a Week 18 showdown last Saturday, but the Falcons' victory over the Saints on Sunday gave the three-way NFC South tiebreaker to the Panthers, who will host the Los Angeles Rams in wild-card weekend.Bowles previously signed a three-year extension that runs through 2028, and has gone 35-33 in his four seasons as coach. That includes a 1-3 record in the playoffs. Jones had reported that this losing season was unlikely to spell the end of the Bowles era in Tampa.\n\"I understand their frustrations, and I understand our own frustrations, as well,\" Bowles said on Monday. \"It's well warranted and well warranted within the building, as well.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Todd Bowles will be back as Buccaneers coach in 2026, but staff changes appear likely - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/d74a6e22-863b-40bf-94bb-2b6e0c233d20/thumbnail/1200x675/cc4f4806e376e54240f3eec1f528694c/bowles.jpg"
      ],
      "datePublished": "2026-01-07T21:54:37.000Z",
      "dateModified": "2026-01-07T21:54:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Continuity amid chaos: How Ole Miss overcame staff turmoil to reach CFP semifinals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-thrived-lane-kiffin-exit-staff-turmoil-cfp-semifinals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/03bc3675-ba08-46ff-9541-25fd6f46d982/thumbnail/1200x675/298ee9eae98dd1d7222934087fc93562/pete-golding.jpg",
    "tag": "Sports",
    "date": "2026-01-07T20:00:46.000Z",
    "description": "\n        SCOTTSDALE, Arizona -- The busiest coaching staff in college football is shorthanded and tired, frustrated and confused. But no one at Ole Mi",
    "body": "\n        SCOTTSDALE, Arizona -- The busiest coaching staff in college football is shorthanded and tired, frustrated and confused. But no one at Ole Miss is complaining.   The Rebels play Miami in the Fiesta Bowl on Thursday with a spot in the national championship game on the line. It's easily the biggest moment in the program's history, and yet another chapter from the most chaotic 40 days the school has ever endured. The first domino fell more than a month ago, when Lane Kiffin went turncoat and bolted for LSU on the eve of the College Football Playoff, taking six assistants with him. Signing day came and went. Some LSU-bound assistants split time between the Tigers and Rebels, hopping private flights between Oxford and Baton Rouge. The transfer portal opened. Ole Miss kept winning -- twice -- in the playoff. Hectic? Absolutely. Take it from veteran coach Joe Judge, a former NFL head coach and assistant for the New England Patriots, now tasked with overseeing the Rebels' offensive operations. \n\"My nextdoor neighbor was Aaron Hernandez,\" Judge deadpanned Tuesday. \"I know this is still more chaotic.\" Ole Miss' situation obviously isn't as serious as the night helicopters circled Judge's Massachusetts neighborhood searching for Hernandez, the former New England tight end who was wanted and convicted for murder. But Judge's point was clear: the constant attention surrounding Kiffin's exit has been little more than background noise -- perceived by outsiders as a distraction, but treated internally as anything but. And yet Ole Miss arrives in Arizona with just one loss, a regular-season defeat it avenged with a 39-34 upset of Georgia in the quarterfinals last week. \nNewly elevated coach Pete Golding, now 2-0 in the CFP, bristles at the notion that Kiffin's absence -- along with four assistants -- has left the Rebels compromised. Only LSU-bound offensive coordinator Charlie Weis Jr. and running backs coach Kevin Smith remain with the team this week, but Ole Miss is hardly short on bodies. Thirteen assistants attended an offensive meeting Tuesday. Nine have been with the team all season. Even Frank Wilson, the former LSU interim coach hired to become Ole Miss' next running backs coach, was in the room. Golding made it clear Wednesday that he's tired of the narrative. \"There's been too much invested in that and it's been aligned correctly that one person is not going to impact something so drastically,\" Golding said Wednesday. \"If it is, it's probably not built right. If one coach in any sport can determine the outcome, he probably doesn't have a very good staff. If one player can determine the outcome, we probably didn't recruit and create the right depth. Or we didn't prepare them to be ready for his opportunity. It's a team game. There's so many people that go into it.  \"The timing of when it happened, in my opinion, couldn't happen at a better time for the players because everything was already in place. Everything was on the track. It's headed the right direction. We got really good players. There's already a culture created. They knew the expectation. The only thing that was different is who is running them out of the tunnel. And to be honest with you, I don't think the players give a damn who runs them out of the tunnel.\" \n\n        \n            \n                Ole Miss QB Trinidad Chambliss' unbelievable rise from Division II backup to College Football Playoff hero\n                \n                    Shehan Jeyarajah                \n            \n                            \n    \n                \n                    \n    \nStill, the grind hasn't stopped. Weis Jr. left Oxford after practice Monday to host LSU recruits alongside Kiffin in Baton Rouge, returned to Ole Miss late that night, then boarded the team plane Tuesday for Phoenix. By Tuesday afternoon, Weis, Judge and the Rebels' quarterbacks were in a Scottsdale hotel meeting room laughing about the absurdity of it all. \"We think we're the only people that can handle what's going on,\" quarterback Trinidad Chambliss said. \"I don't think this has ever happened in college football where part of your coaching staff is kinda with another team.\" Weis' split-screen existence -- recruiting for LSU while preparing Ole Miss for the playoff -- has demanded creativity and constant communication. \n\"So between scripting on the plane and having phone calls and talking about notes from practice and making corrections through FaceTime, it's been a different process for all of us, but we all work together very well,\" Judge said. \"And Charlie's done a terrific job through his entire process. I can't say enough about Charlie in terms of who he is as a person, what he's doing as a coach. \"This is a challenge many people haven't had to have. Now, luckily for him, his father had this challenge, right?\" Indeed, like father, like son. Charlie Weis Jr.'s father famously split time between the New England Patriots and Notre Dame for seven weeks in late 2004 after being hired as the Irish's head coach, all while coordinating an offense that went on to win a Super Bowl. \nOle Miss wouldn't mind a repeat in the family lineage. Weis Jr.'s offense has averaged 40 points in two CFP games, and Chambliss threw for a season-high 362 yards against Georgia last week. From the outside, the chaos doesn't seem to be slowing anything down, a point not lost on Miami offensive coordinator Shannon Dawson. \"The times in my life I've been the most chaotic, it's galvanized people together,\" he said. \"And I think it works opposite of what normal people think it works. It gives you a theme, it gives you a reason to bond together and it gives you a message of, 'Hey, everybody's against our ass.' It works completely the opposite of the mental thing people think it does. The chaos, a lot of times, is good, because then you can't see the distractions that are really the ones that hurt you, like the ones right in front of your face.\" Thursday night inside State Farm Stadium, none of the noise will matter. Ole Miss must slow Miami's nation-leading pass rush, score points and contain the Hurricanes' playmakers like quarterback Carson Beck, freshman All-American receiver Malachi Toney and punishing running back Mark Fletcher Jr. \n\"To be able to navigate all this during this time and still have the type of success that (Golding) is having, man, it's off the charts. It's awesome,\" said Miami coach Mario Cristobal. Asked if he had a message for Kiffin or anyone doubting the Rebels, Golding didn't hesitate: he focused on the players. After all, the system has long been in place, and now it's up to the players to follow their routine.  \"They care about their plan,\" he said. \"They care about getting held accountable and how they're going to prepare. And they care about people who care about them. That's been the message our players have created. I don't have s*** to say to anybody else.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Continuity amid chaos: How Ole Miss overcame staff turmoil to reach CFP semifinals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/03bc3675-ba08-46ff-9541-25fd6f46d982/thumbnail/1200x675/298ee9eae98dd1d7222934087fc93562/pete-golding.jpg"
      ],
      "datePublished": "2026-01-07T20:00:46.000Z",
      "dateModified": "2026-01-07T20:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FIFA 2026 World Cup game schedule: Times, groups, bracket - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/2026-world-cup-schedule-time-location-groups-bracket-usmnt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/06/a9b17e7a-17c9-472b-99be-eaa1de6133dd/thumbnail/1200x675/611a033ff4ddcb25f4130deca940f6d5/untitled-design-2025-12-06t123444-007.png",
    "tag": "Sports",
    "date": "2026-01-07T20:07:44.000Z",
    "description": "\n        The 2026 World Cup is getting closer and with the draw in the rear view mirror, the official schedule has now been locked in by FIFA. FIFA Pr",
    "body": "\n        The 2026 World Cup is getting closer and with the draw in the rear view mirror, the official schedule has now been locked in by FIFA. FIFA President Gianni Infantino, joined by former soccer stars such as Ronaldo Nazario, Francesco Totti and Hristo Stoichkov announced the match schedule for the 104 matches that will take place in the United States, Canada and Mexico next summer, including venues and kick-off times for the 48 teams involved in the tournament. However, the final version of the match schedule will be only available in March, once the FIFA and European play-off tournaments have taken place and the final six slots have been filled. Here's what you need to know ahead of the summer of 2026: Bet the World Cup at DraftKings, where new users receive a special sign-up bonus:USMNT's path at the World CupThe United States will face Australia, the team they beat 2-1 in October's friendly and Paraguay, the team they beat 2-1 in November's matchup while the last team Mauricio Pochettino's will play will only be known later in March as it will come out of the playoffs between Romania, Slovakia, Kosovo and Turikye, a team the USMNT played in a 2-1 loss in June.\n        \n            \n                2026 World Cup draw winners and losers: USMNT's Mauricio Pochettino a clear winner; Netherlands get tough draw\n                \n                    James Benge                \n            \n                            \n    \n                \n                    \n    \nGroups in fullGroup A: Mexico, Korea Republic, South Africa, UEFA Playoff D (Denmark/North Macedonia/Czechia/Republic of Ireland)Group B: Canada, Switzerland, Qatar, UEFA Playoff A (Italy/Northern Ireland/Wales/Bosnia and Herzegovina)Group C: Brazil, Morocco, Scotland, HaitiGroup D: USA, Australia, Paraguay, UEFA Playoff D (Turkiye/Romania/Slovakia/Kosovo)Group E: Germany, Ecuador, Ivory Coast, CuracaoGroup F: Netherlands, Japan, Tunisia, UEFA Playoff B (Sweden/Ukraine/Poland/Albania)Group G: Belgium, Iran, Egypt, New ZealandGroup H: Spain, Uruguay, Saudi Arabia, Cabo VerdeGroup I: France, Senegal, Norway, Intercontinental Playoff 2 (Iraq/Bolivia/Suriname)Group J: Argentina, Austria, Algeria, JordanGroup K: Portugal, Colombia, Uzbekistan, Intercontinental Playoff 1 (DR Congo/Jamaica/New Caledonia)Group L: England, Croatia, Panama, GhanaMake your World Cup picks at Bet365, where new users can score a special deal:Full scheduleAll times U.S./EasternGroup StageThursday, 11 June 20263 p.m. Mexico vs. South Africa, Group A -- Mexico City10 p.m. South Korea vs. UEFA Playoff D, Group A -- Guadalajara\nFriday, 12 June 20263 p.m. Canada vs. UEFA Playoff A, Group B -- Toronto 9 p.m. USMNT vs. Paraguay, Group D -- Los AngelesSaturday, 13 June 20263 p.m. Qatar vs. Switzerland, Group B - San Francisco 6 p.m. Brazil vs. Morocco, Group C - New York City9 p.m. Haiti vs. Scotland, Group C - Boston12 a.m. Australia vs. UEFA Playoff C, Group D - VancouverSunday, 14 June 20261 p.m. Germany vs. Curacao, Group E - Houston4 p.m. Netherlands vs. Japan, Group F - Dallas7 p.m. Ivory Coast vs. Ecuador, Group E - Philadelphia10 p.m. UEFA Playoff B vs. Tunisia, Group F - Monterrey\nMonday, 15 June 202612 p.m. Spain vs. Cabo Verde, Group H - Atlanta3 p.m. Belgium vs. Egypt, Group G - Seattle6 p.m. Saudi Arabia vs. Uruguay – Group H - Miami9 p.m. Iran vs. New Zeland – Group G - Los AngelesTuesday, 16 June 20263 p.m. France vs. Senegal, Group I - New York New Jersey6 p.m. Intercontinental Playoff 2 vs. Norway, Group I - Boston9 p.m. Argentina vs. Algeria, Group J - Kansas City12 a.m. Austria vs. Jordan – Group J - San Francisco Bay AreaWednesday, 17 June 20261 p.m. Portugal vs. Intercontinental Playoff 1, Group K - Houston4 p.m. England vs. Croatia, Group L - Dallas7 p.m. Ghana vs. Panama, Group L - Toronto10 p.m. Uzbekistan vs. Colombia, Group K - Mexico City\nThursday, 18 June 202612 p.m. UEFA Playoff D vs. South Africa, Group A - Atlanta3 p.m. Switzerland vs. UEFA Playoff A, Group B - Los Angeles6 p.m. Canada vs. Qatar, Group B - Vancouver9 p.m. Mexico vs. South Korea, Group A - GuadalajaraFriday, 19 June 20263 p.m. USMNT vs. Australia, Group D - Seattle6 p.m. Scotland vs. Morocco, Group C - Boston9 p.m. Brazil vs. Haiti, Group C - Philadelphia12 a.m. UEFA Playoff C vs. Paraguay, Group D - San FranciscoSaturday, 20 June 20261 p.m. Netherlands vs. UEFA Playoff B, Group F - Houston4 p.m. Germany vs. Ivory Coast, Group E - Toronto8 p.m. Ecuador vs. Curacao, Group E - Kansas City12 a.m. Tunisia vs. Japan, Group F - Monterrey\nSunday, 21 June 202612 p.m. Spain vs. Saudi Arabia, Group H - Atlanta3 p.m. Belgium vs. Iran, Group G - Los Angeles6 p.m. Uruguay vs. Cabo Verde, Group H - Miami9 p.m. New Zeland vs. Egypt, Group G - VancouverMonday, 22 June 20261 p.m. Argentina vs. Austria, Group J - Dallas5 p.m. France vs. Intercontinental Playoff 2, Group I - Philadelphia8 p.m. Norway vs. Senegal, Group I - New York City11 p.m. Jordan vs. Algeria, Group J - San FranciscoTuesday, 23 June 20261 p.m. Portugal vs. Uzbekistan, Group K - Houston4 p.m. England vs Ghana, Group L - Boston7 p.m. Panama vs. Croatia, Group L - Toronto10 p.m. Colombia vs. Intercontinental Playoff 1, Group K - Guadalajara\nWednesday, 24 June 20263 p.m. Switzerland vs. Canada, Group B - Vancouver3 p.m. UEFA Playoff A vs. Qatar, Group B - Seattle6 p.m. Scotland vs. Brazil, Group C - Miami6 p.m. Morocco vs. Haiti, Group C - Atlanta9 p.m. UEFA Playoff D vs. Mexico, Group A - Mexico City9 p.m. South Africa vs. South Korea, Group A - MonterreyThursday, 25 June 20264 p.m. Ecuador vs. Germany, Group E - New York City4 p.m. Curacao vs. Ivory Coast, Group E - Philadelphia7 p.m. Tunisia vs. Netherlands, Group F - Kansas City 7 p.m. Japan vs. UEFA Playoff B, Group F - Dallas 10 p.m. UEFA Playoff C vs. USMNT, Group D - Los Angeles10 p.m. Paraguay vs. Australia, Group D - San FranciscoFriday, 26 June 20263 p.m. Norway vs. France, Group I - Boston3 p.m. Senegal vs. Intercontinental Playoff 2, Group I - Toronto8 p.m. Uruguay vs. Spain, Group H - Guadalajara8 p.m. Cabo Verde vs. Saudi Arabia, Group H - Houston11 p.m. New Zeland vs. Belgium, Group G - Vancouver11 p.m. Egypt vs. Iran, Group G - Seattle \nSaturday, 27 June 20265 p.m. Panama vs. England, Group L - New York City5 p.m. Croatia vs. Ghana, Group L - Philadelphia Stadium7:30 p.m. Colombia vs. Portugal – Group K - Miami Stadium7:30 p.m. Intercontinental Playoff 1 vs. Uzbekistan – Group K - Atlanta Stadium10 p.m. Jordan vs. Argentina – Group J -  Dallas Stadium10 p.m. Algeria vs. Austria – Group J - Kansas City StadiumRound of 32Match 73: Runner-up Group A vs Runner-up Group B – Los AngelesMatch 74: Winner Group E vs Best 3rd place Group A/B/C/D/F – BostonMatch 75: Winner Group F vs Runner-up Group C – Monterrey Match 76: Winner Group C vs Runner-up Group F – HoustonMatch 77: Winner Group I vs Best 3rd place Group C/D/F/G/H – New York CityMatch 78: Runner-up Group E vs Runner-up Group I – DallasMatch 79: Winner Group A vs Best 3rd place Group C/E/F/H/I – Mexico CityMatch 80: Winner Group L vs Best 3rd place Group E/H/I/J/K – AtlantaMatch 81: Winner Group D vs Best 3rd place Group B/E/F/I/J – San FranciscoMatch 82;: Winner Group G vs Best 3rd place Group A/E/H/I/J – SeattleMatch 83: Runner-up Group K vs Runner-up Group L – TorontoMatch 84: Winner Group H vs Runner-up Group J – Los AngelesMatch 85: Winner Group B vs Best 3rd place Group E/F/G/I/J – Vancouver Match 86: Winner Group J vs Runner-up Group H – MiamiMatch 87: Winner Group K vs Best 3rd place Group D/E/I/J/L – Kansas CityMatch 88: Runner-up Group D vs Runner-up Group G – Dallas Round of 16Match 89: Match 74 winner vs. Match 77 winner – Philadelphia Match 90: Match 73 winner vs. Match 75 winner – Houston Match 91: Match 76 winner vs. Match 78 winner – New York City Match 92: Match 79 winner vs. Match 80 winner – Mexico City Match 93: March 83 winner vs. Match 84 winner – Dallas Match 94: Match 81 winner vs. Match 82 winner – Seattle Match 95: Match 86 winner vs. Match 88 winner – AtlantaMatch 96: Match 85 winner vs. Match 87 winner – VancouverQuarterfinalsMatch 97: Match 89 winner vs. Match 90 winner – Boston Match 98: Match 93 winner vs. Match 94 winner – Los Angeles Match 99: Match 91 winner vs March 92 winner – Miami Match 100: Match 95 winner vs. Match 96 winner – Kansas City SemifinalsWinner 97 vs. Winner 98 – DallasWinner 99 vs. Winner 100 – AtlantaThird placeJuly 18, 2026: Semifinal losers – MiamiFinalJuly 19, 2026: Semifinal winners at New York New Jersey Stadium\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIFA 2026 World Cup game schedule: Times, groups, bracket - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/06/a9b17e7a-17c9-472b-99be-eaa1de6133dd/thumbnail/1200x675/611a033ff4ddcb25f4130deca940f6d5/untitled-design-2025-12-06t123444-007.png"
      ],
      "datePublished": "2026-01-07T20:07:44.000Z",
      "dateModified": "2026-01-07T20:07:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL predictions: Here is every AFC's team's best path to Super Bowl LX - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-model-forecasts-best-path-opponents-for-every-afc-team-to-reach-super-bowl-lx/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/6825d854-5d76-4b87-a3d0-c7169fef6fbe/thumbnail/1200x675/54f975c177fccff5524522d8ba0f0e24/bo-nix-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-07T22:29:40.000Z",
    "description": "\nFor just the second time in seven years, the AFC will have a team other than the Kansas City Chiefs as its representative in NFL's championship game.",
    "body": "\nFor just the second time in seven years, the AFC will have a team other than the Kansas City Chiefs as its representative in NFL's championship game. The road to Super Bowl LX begins with Wild Card Weekend but will not be traveled by the Chiefs, who appeared in the \"big game\" five of the last six seasons but posted a 6-11 record this campaign and failed to qualify for the playoffs for the first time since 2014.The Denver Broncos (14-3) finished as the No. 1 seed in the conference and received a first-round bye. Two AFC wild card games take place Sunday, with the third-seeded Jacksonville Jaguars (13-4) hosting the No. 6 Buffalo Bills (12-5) on CBS at 1 p.m. ET and the seventh-seeded Los Angeles Chargers (11-6) visiting the No. 2 New England Patriots (14-3) at 8 p.m. ET. Wild Card Weekend concludes Monday night as the No. 4 Pittsburgh Steelers (10-7) host the fifth-seeded Houston Texans (12-5) at 8:15 p.m. ET.Denver is the favorite to win the Vince Lombardi Trophy among the AFC teams as it is listed at +650 at DraftKings Sportsbook. However, the Broncos are only the third favorite to win the \"big game\" behind a pair of NFC West rivals, as the top-seeded Seattle Seahawks are +330 and the No. 5 Los Angeles Rams are +425.The SportsLine Inside the Lines team and its projection model have crunched the numbers and have a slightly different take. The model, which simulates every NFL game 10,000 times, has Denver winning the championship in 16.2% of its simulations, second only to Seattle (22.3%).The ITL team's model has identified each AFC team's most favorable paths to Santa Clara on Feb. 8. Here they are:Denver BroncosAs the No. 1 seed, Denver needs only two victories to make its first trip to the \"big game\" since 2015, when it defeated the Carolina Panthers 24-10 in Super Bowl 50 for its third championship. The Broncos will play their first playoff game - and should they win it, also their second - at home, where they went 7-1 during the regular season.The model gives Denver more than a 53% chance to defeat every other AFC team in the postseason and a better than 52% chance to beat four of the seven NFC clubs in the \"big game.\" It says the Broncos should be pulling for the Chargers to upset the Patriots on Sunday, as it feels Denver has the best chance to post a win against Jim Harbaugh's squad (65.1%) than any other team in the conference. Conversely, the model views Jacksonville (46.5%) as the AFC club most likely to knock off the Broncos, especially since the Jaguars posted a 34-20 victory at Denver in Week 16.Seattle is the obvious team the Broncos - and every other AFC club - would want to avoid in the Super Bowl should they get there, and the model's simulations have them beating the Seahawks a mere 42.5% of the time. It also doesn't like their chances against two other clubs as they defeat the defending champions Philadelphia Eagles in only 46.7% of the simulations, even though Denver won 21-17 in the City of Brotherly Love in Week 5, and the Rams just 47.2% of the time.OPPONENTBRONCOS' AVERAGE WIN %New England Patriots54.4Jacksonville Jaguars53.5Pittsburgh Steelers62.7Houston Texans57.2Buffalo Bills57.4Los Angeles Chargers65.1New England Patriots\nAfter back-to-back 4-13 seasons under two different head coaches, the Patriots made an incredible turnaround in their first year with Mike Vrabel at the helm and ended Buffalo's five-year reign in the AFC East. They only faced two of the conference's other six playoff teams during the regular season, however, and went 1-2 against them.The model says Patriots got the second-best matchup they could in the wild card round, as they defeat the Chargers in 61.5% of simulations. They'll be hoping Buffalo and Pittsburgh emerge victorious this weekend, which would set up a meeting with the Steelers in the divisional round. According to the model, New England's best matchup in the AFC is against Pittsburgh, which it defeats 62.2% of the time in the simulations.Since Seattle is the worst Super Bowl matchup for every AFC team, the Patriots - like Denver - should want to avoid the Eagles and Rams the most if they make it to Santa Clara. The model says New England defeats Philadelphia in just 47.4% of its simulations and the Rams 47.6% of the time.OPPONENTPATRIOTS' AVERAGE WIN %Denver Broncos45.6Jacksonville Jaguars50.5Pittsburgh Steelers62.2Houston Texans53.0Buffalo Bills55.7Los Angeles Chargers61.5Jacksonville Jaguars\nThe Jaguars enter the postseason with an eight-game winning streak and went 3-1 against AFC playoff teams during the regular season. During the eight-game run, Jacksonville became the lone club to defeat Denver at Empower Field in 2025.According to the model, the Jaguars have favorable matchups against every team in the conference other than the Broncos and Patriots, defeating all four in at least 51% of its simulations. The model also says the AFC South champions get past every NFC club not named the Seahawks more than 50% of the time, with Philadelphia (49.8%) giving them the most difficult battle.OPPONENTJAGUARS' AVERAGE WIN %Denver Broncos46.5New England Patriots49.5Pittsburgh Steelers65.6Houston Texans59.9Buffalo Bills51.0Los Angeles Chargers66.5Pittsburgh Steelers\nThe model is not a big supporter of the Steelers, who won four of their last five regular season games and edged the Baltimore Ravens 26-24 in a drama-filled finale to capture their first AFC North title since 2020. Pittsburgh went 1-5 against all NFL playoff teams this campaign and lost two of three versus AFC clubs, although the lone victory was recorded in New England in Week 3.The Steelers have unfavorable matchups with every team in their conference except the Chargers, whom they beat in almost 60% of the model's simulations. Surprisingly, those simulations say Pittsburgh defeats two NFC clubs more than 50% of the time, with Carolina (64.8%) being its most preferred opponent in the Super Bowl and Chicago (51%) coming in second.OPPONENTSTEELERS' AVERAGE WIN %Denver Broncos37.3New England Patriots37.8Jacksonville Jaguars34.4Houston Texans48.6Buffalo Bills48.4Los Angeles Chargers59.7Houston TexansWhile Jacksonville is red hot as it enters the postseason, the Texans are downright sizzling. Houston, which began the regular season with a three-game losing streak, won its final nine contests and finished just one game behind the Jaguars in its quest for a third consecutive AFC South title.The Texans posted wins against three of the four AFC playoff teams they faced in 2025, and the model believes two of those clubs (Bills and Chargers) provide their best matchups in the postseason. Its simulations say Houston defeats both the Chargers (67.3%) and Buffalo (63.4%) more than 63% of the time while giving the Texans a 51.4% chance to beat Pittsburgh, their actual opponent in the wild card round.Like the Jaguars, Houston has a better than 50% chance to win against every NFC playoff team other than Seattle in the \"big game,\" according to the model. It says Carolina (69.4%), Chicago (58.1%) and San Francisco (57.2%) are the clubs the Texans should hope to meet in Santa Clara should they get there.OPPONENTTEXANS' AVERAGE WIN %Denver Broncos42.8New England Patriots47.0Jacksonville Jaguars40.1Pittsburgh Steelers51.4Buffalo Bills63.4Los Angeles Chargers67.3Buffalo BillsThe Bills won five of their final six regular season contests but still were unable to overtake New England and win their sixth consecutive AFC East title. Still, with Kansas City and Baltimore failing to reach the postseason, reigning NFL MVP Josh Allen will feel immense pressure to lead Buffalo to its first Super Bowl appearance since its unprecedented four-year run from 1990-93.Only two matchups are favorable for the Bills in the AFC playoffs, as they defeat the Chargers in 67.6% of the model's simulations and the Steelers 51.6% of the time. If Buffalo manages to get over the hump and make it to Santa Clara, the model says it would have unfavorable matchups against the NFC's big three in Seattle (41.9%), Philadelphia (45.9%) and the Rams (46.6%).OPPONENTBILLS' AVERAGE WIN %Denver Broncos42.6New England Patriots44.3Jacksonville Jaguars49.0Pittsburgh Steelers51.6Houston Texans36.6Los Angeles Chargers67.6Los Angeles ChargersThe Chargers still were in the hunt for their first AFC West title since 2009, when they resided in San Diego, before ending the regular season with losses to the Texans and Broncos. They also were defeated by the Jaguars in Week 11 before going on their bye and then reeling off four consecutive victories.As expected for a No. 7 seed, the Chargers don't have a favorable matchup in the AFC playoffs as the model's simulations give them a better than 39% chance against only the Steelers. Should the club become the first seventh seed to make it to the Super Bowl, the only opponent the model sees them beating in the Panthers (61.3%).OPPONENTCHARGERS' AVERAGE WIN %Denver Broncos34.9New England Patriots38.5Jacksonville Jaguars33.5Pittsburgh Steelers40.3Houston Texans32.7Buffalo Bills32.4\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL predictions: Here is every AFC's team's best path to Super Bowl LX - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/6825d854-5d76-4b87-a3d0-c7169fef6fbe/thumbnail/1200x675/54f975c177fccff5524522d8ba0f0e24/bo-nix-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2026-01-07T22:29:40.000Z",
      "dateModified": "2026-01-07T22:29:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jim Harbaugh says brother will be a head coach next season: 'Just hope it's in the NFC' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jim-harbaugh-john-john-harbaugh-ravens-coach-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/4d7f8f09-edda-4c3c-b88b-b728024ee4ab/thumbnail/1200x675/ea5c08fda21fcdbefae9424f1df43693/john-harbaugh-jim-harbaugh.jpg",
    "tag": "Sports",
    "date": "2026-01-07T21:37:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Less than an hour after John Harbaugh got fired by",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Less than an hour after John Harbaugh got fired by the Baltimore Ravens, his agent had reportedly fielded calls from seven different teams. That should have been no surprise considering his resume -- 180 regular-season wins, 12 playoff trips and a Super Bowl in 18 seasons -- and he certainly won't need any good PR to boost his stock.His brother gave him some anyway.\"John Harbaugh's the best coach I know, best coach I've ever seen,\" Los Angeles Chargers coach Jim Harbaugh said Wednesday. \"And you may say 'OK, I'm his brother so I might be biased,' but then you have somebody like Tony Dungy ... Wouldn't we all like that? Wouldn't we all like somebody like Tony Dungy, especially Tony Dungy himself, to say that? It's great, seeing that kind of outpouring of support and just so cool to see all my brother's accomplishments and be recognized for that. As I told him, whatever team he goes to is gonna be formidable. I just hope it's in the NFC.\"Dungy took to social media Tuesday night to defend John Harbaugh and criticize Baltimore for the firing.\n\"He'll be a head coach next year,\" Jim Harbaugh said of his brother. \"We'll be playing against him in some form or fashion, and like I said, I hope that's in the NFC.\"Harbaugh added he was surprised Baltimore made the decision it did and that his brother's next team will be getting \"a gift.\"Currently, there are six head-coach opening outside Baltimore:\nNew York GiantsTennessee TitansAtlanta FalconsLas Vegas RaidersCleveland BrownsArizona CardinalsWhile John Harbaugh begins his job search, Jim Harbaugh is in the middle of playoff preparation: The Chargers visit the New England Patriots in the Wild Card Round.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jim Harbaugh says brother will be a head coach next season: 'Just hope it's in the NFC' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/4d7f8f09-edda-4c3c-b88b-b728024ee4ab/thumbnail/1200x675/ea5c08fda21fcdbefae9424f1df43693/john-harbaugh-jim-harbaugh.jpg"
      ],
      "datePublished": "2026-01-07T21:37:55.000Z",
      "dateModified": "2026-01-07T21:37:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Edward Cabrera trade: Where do Cubs turn for offense? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/edward-cabrera-trade-cubs-kyle-tucker-cody-bellinger-alex-bregman-bo-bichette/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/b88f644b-1f38-4858-9fbf-821c910369ac/thumbnail/1200x675/43a7da2bbd330c1d9b3fb240df1b3bfb/bellinger-getty-1.png",
    "tag": "Sports",
    "date": "2026-01-07T21:55:14.000Z",
    "description": "\n        The Chicago Cubs in 2025 made the playoffs for the first time in a while and advanced a round, but coming in second place in the NL Central t",
    "body": "\n        The Chicago Cubs in 2025 made the playoffs for the first time in a while and advanced a round, but coming in second place in the NL Central to the Milwaukee Brewers and then losing the NLDS to that same Brewers team should be filed under \"not good enough.\" In light of that, this is a big offseason for club president Jed Hoyer. On Wednesday, the Cubs finally struck a big blow, landing potential frontline starter Edward Cabrera from the Marlins.That's a good move. It could even be a big move. Is it good enough? Let's examine where things stand with the North Siders.\n        \n            \n                Edward Cabrera trade: Cubs acquire Marlins frontline starter for top outfield prospect\n                \n                    Dayn Perry                \n            \n                            \n    \n                \n                    \n    \nThe rotationThis should be set. There are three potential frontline starters in Cabrera, Matthew Boyd and Cade Horton. Cabrera has ace-caliber stuff at times and finally made a career-high 26 starts last season in 137 ⅔ innings, striking out 150. Boyd ran out of gas late last season -- his first full season since returning from Tommy John surgery -- but had a 2.34 ERA through his first 22 starts. Horton was 11-4 with a 2.67 ERA in 118 innings as a rookie.\nThis isn't a stable of 200-inning guys, at least not yet, so the Cubs need depth. They've got it. Shota Imanaga returns and he's flashed frontline upside at times. Veteran righty Jameson Taillon is back as well. Colin Rea can serve as a swingman but made 27 starts last season and is a fine sixth starter. Past those six, there's Justin Steele, who will return from Tommy John surgery at some point. Remember, he had a 3.10 ERA in 78 starts from 2022-24. Javier Assad is also a swingman type like Rea. That's eight options for starting pitchers down the stretch and, if everything breaks right, four frontline starters for a playoff rotation in Horton, Cabrera, Steele and Boyd with Imanaga as a fallback.My expectation is the Cubs are done looking for starting pitching now after the Cabrera acquisition. This is a good stable with the upside being one of the most productive rotations in baseball. \nWhat's next? The Cubs had a robust offense in the first three months last season before it sputtered down the stretch. What made the Cubs great in the first half was the emergence of Pete Crow-Armstrong as a big-time power hitter, Kyle Tucker doing Kyle Tucker things and Seiya Suzuki posting the best several months of his life. In the second half, PCA struggled, Tucker dealt with injuries and the worst slump of his career and the streaky Suzuki reverted to the bad part of the streakiness. As the 2026 roster stands today, the Cubs have a good number of quality hitters -- to varying degrees -- who aren't superstar-caliber bats like Michael Busch, Dansby Swanson, Ian Happ and Nico Hoerner along with supporting cast types like Carson Kelly/Miguel Amaya (the catchers) and Matt Shaw. The front office is relying on Shaw taking a big leap forward, Moisés Ballesteros becoming a monster DH and Suzuki and PCA hitting all year like they did in the first half. Still, there are plenty of questions in there from a team looking to win the division and make a deep playoff run. \nAnother middle-of-the-order bat would sure make things look more promising. The Cubs have been attached in rumors to free agent infielders Bo Bichette and Alex Bregman. Tucker remains a free agent, as does former Cubs outfielder Cody Bellinger. How might things fit?The infieldBusch is firmly entrenched at first, as is Swanson at short. Hoerner, at second, was one of the best \"glue guys\" in baseball last year, but trade rumors are circulating because he's only signed through 2026. Shaw was good in the second half and could come back at third. This is to say that the Cubs aren't desperately in need of filling an infield hole. Grabbing someone from outside the organization would be an effort to upgrade the team. The weak link there right now is clearly Shaw and that's where Bregman comes in. Shaw could then be traded or become a utility backup (he could play third to rest Bregman, play second to rest Hoerner or Swanson -- with Hoerner playing shortstop when Swanson sits, etc.). \nBichette's fit is slightly trickier. He played second base for the Blue Jays at the end of the season; would he do the same for the Cubs, leaving Shaw at third (and Hoerner either on the bench or traded)? What about third base to replace Shaw?Regardless, either Bregman or Bichette would be a big get for the offense, especially if they did so while holding onto Hoerner. The outfieldFor ease, we'll include the DH role here too. Remember, last season with Tucker in the fold, the Cubs set up with Happ in left field, PCA in center and Tucker in right while Suzuki was the primary DH. If the Cubs don't bring in another outfielder, it looks like Happ-PCA-Suzuki is the outfield set up with Ballesteros taking over as the primary DH. \nIf the Cubs fail to bring in an infielder like Bregman or Bichette, perhaps they turn their attention to the outfield, especially with Owen Caissie now gone as part of the Cabrera trade. Tucker would make sense, but the Cubs' front office -- whether it's Hoyer or ownership -- seems content to operate as a middle-market team. This is to say, Tucker's demands on the free agent market appear too rich for the Cubs' blood. This could leave an opening for a Bellinger reunion. He was great in 2023 and pretty good in 2024 before the Cubs traded him to make room for Tucker. He's coming off his best year since his 2019 MVP season. \nWould the Cubs bring Bellinger back to beef up their lineup? I think this only becomes a discussion if they miss out on both Bregman and Bichette. If you look at a potential lineup right now, though, it sure seems like they could use another big bopper in the middle: 1. Michael Busch, 1B2. Nico Hoerner, 2B3. Ian Happ, LF4. Seiya Suzuki, RF5. Pete Crow-Armstrong, CF6. Dansby Swanson, SS7. Moisés Ballesteros, DH8. Carson Kelly, C9. Matt Shaw, 3B\nIt's pretty good. It just seems like, come the middle of October, we'd be saying once again that it wasn't good enough. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Edward Cabrera trade: Where do Cubs turn for offense? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/b88f644b-1f38-4858-9fbf-821c910369ac/thumbnail/1200x675/43a7da2bbd330c1d9b3fb240df1b3bfb/bellinger-getty-1.png"
      ],
      "datePublished": "2026-01-07T21:55:14.000Z",
      "dateModified": "2026-01-07T21:55:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions, best bets today: This Wednesday parlay returns over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-wednesday-january-7-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/f75c52d7-f942-4ce2-9e7e-3d670d4ee082/thumbnail/1200x675/63f43b2872ab726dcf18893a84149c33/jaylen-brown-boston-celtics-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-07T21:30:41.000Z",
    "description": "\n        Wednesday will feature a 12-game NBA schedule. Among the notable NBA odds include Bulls vs. Pistons (-9.5), Nuggets vs. Celtics (-9.5), Magic",
    "body": "\n        Wednesday will feature a 12-game NBA schedule. Among the notable NBA odds include Bulls vs. Pistons (-9.5), Nuggets vs. Celtics (-9.5), Magic vs. Nets (+2.5), Clippers vs. Knicks (-4.5), Suns vs. Grizzlies (+4.5), Lakers vs. Spurs (-7.5) and Bucks vs. Warriors (-5.5). Boston looks to extend its winning streak to five games, while the Knicks look to snap a four-game losing skid.  What are the NBA best bets for Wednesday, and which combination of picks should you target in a Wednesday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Wednesday, Jan. 7After simulating every game 10,000 times, the model is backing the Celtics (-9.5) to cover the spread against the Nuggets in Boston at 7 p.m. ET. The Nuggets have lost seven of their last 10 meetings with the Celtics, including each of the last two games. \nThe model is projecting five Celtics players to score 11.7 points or more, led by Jaylen Brown's 30.1 points. The Nuggets meanwhile, have lost four of six and are still without Nikola Jokic (knee) and several other key contributors, so the model is backing Boston despite laying 9.5 points on Wednesday. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Wednesday, Jan. 7The model also has locked in two more picks, including another bet that hits nearly 70% of the time. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Wednesday, and which best bets should you target for a chance at a payout of over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions, best bets today: This Wednesday parlay returns over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/f75c52d7-f942-4ce2-9e7e-3d670d4ee082/thumbnail/1200x675/63f43b2872ab726dcf18893a84149c33/jaylen-brown-boston-celtics-imagn-images.jpg"
      ],
      "datePublished": "2026-01-07T21:30:41.000Z",
      "dateModified": "2026-01-07T21:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Wild Card Weekend picks, AI-generated score predictions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-wild-card-weekend-2026-picks-ai-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/ab027391-c0db-4d56-94d5-6ba0ba15ccc9/thumbnail/1200x675/da0060ff17ceb999cf023272f19350af/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-07T21:44:08.000Z",
    "description": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston T",
    "body": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston Texans and Pittsburgh Steelers. Monday's matchup will pit quarterback C.J. Stroud and the Houston Texans against 21-year veteran Aaron Rodgers and the Pittsburgh Steelers. The Texans are favored by 3 points at DraftKings Sportsbook.Sunday's other largest spreads include Rams (-10.5) vs. Panthers, 49ers vs. Eagles (-4.5) and Chargers vs. Patriots (-3.5). The smallest spreads in Wild Card Weekend include Packers (-1.5) vs. Bears and Bills (-1.5) vs. Jaguars. Before making any 2026 Wild Card Weekend NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Wild Card Weekend NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all six games. You can only see the AI predictions for the 2026 Wild Card Weekend NFL schedule here.Top 2026 Wild Card Weekend NFL AI picksAfter analyzing every game in Wild Card Weekend, the AI says the Steelers (+3, 39.5), who outlasted Baltimore in Week 18 to win the AFC North, cover in a tight loss. \nThe Texans have gone over in three of their last four games, while the over has hit in four of the last five Steelers games. Pittsburgh has won four of the last six meetings with Houston and is expected to cover in a close game. The Steelers, who will get receiver DK Metcalf back from suspension, are looking to win their first playoff game since reaching the AFC Championship Game in 2016. Houston won the last meeting, 30-6, on Oct. 1, 2023. SportsLine AI rates the Steelers as a B money line pick and also predicts a 22-21 Texans win on average. See its other 2026 Wild Card Weekend football predictions and football picks at SportsLine, and bet the Steelers at DraftKings here:\nHow to make 2026 Wild Card Weekend NFL picksIn addition, the AI PickBot has generated three highly-coveted A picks for 2026 Wild Card Weekend. You need to see the AI's NFL picks before making any 2026 Wild Card Weekend NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 Wild Card Weekend NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Wild Card Weekend picks, AI-generated score predictions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/ab027391-c0db-4d56-94d5-6ba0ba15ccc9/thumbnail/1200x675/da0060ff17ceb999cf023272f19350af/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-07T21:44:08.000Z",
      "dateModified": "2026-01-07T21:44:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]