[
  {
    "title": "UFC 325 odds, main fight card, predictions: MMA expert reveals picks for Volkanovski vs. Lopes picks, other fights - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-325-odds-lines-predictions-fight-card-time-volkanovski-lopes-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/22c07cf3-1f0e-444c-ab34-fb66a756b1d4/thumbnail/1200x675/b2644e62272d82d32e06c0320e4af00f/diego-lopes-ufc-mma-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-31T23:44:08.000Z",
    "description": "\n        Champion Alexander Volkanovski battles second-ranked Diego Lopes for the UFC featherweight championship in the main event at UFC 325: Volkano",
    "body": "\n        Champion Alexander Volkanovski battles second-ranked Diego Lopes for the UFC featherweight championship in the main event at UFC 325: Volkanovski vs. Lopes 2 on Saturday at Qudos Bank Arena in Sydney Olympic Park, Australia. The preliminaries are set to begin at 7 p.m. ET, with the main card at approximately 9 p.m. ET on Paramount+. Volkanovski is coming off a unanimous decision win over Lopes at UFC 314 last April. The bout was for the vacant UFC featherweight championship and earned Fight of the Night honors.Volkanovski is a -148 favorite (risk $148 to win $100), while Lopes comes back at +124 in the latest UFC 325 odds at DraftKings Sportsbook. The co-main event features a lightweight bout between sixth-ranked Dan Hooker (+295) vs. eighth-ranked Benoit Saint Denis (-375). Before finalizing any UFC 325 picks, make sure you see the MMA predictions and betting advice from SportsLine expert Kyle Marley.Bet UFC 325 at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:Over the past three-plus years, $100 bettors who have followed Marley's picks are up nearly $10,000, and since May 2018, he has returned well over $21,000. The accomplished MMA analyst has provided consistent winners for SportsLine members for the past five years. His accomplishments include hitting five consecutive main-event underdog winners in 2020 following the UFC's brief pause in action because of the pandemic. He also went 7-4 on his picks at the last UFC card. Anyone who has followed Marley could be way up.\nNow, Marley has studied Alexander Volkanovski vs. Diego Lopes 2 from every angle and revealed his top betting picks and best bets. Head to SportsLine to see them.UFC is now on Paramount+: Here's how to watch every eventPay-Per-View just got knocked out. Stream EVERY UFC numbered event and UFC Fight Night live, at no additional cost, with your Paramount+ subscription. You can also watch pre-fight docuseries, full-length replays, archived fights from years past and more. It's time to say goodbye to Pay-Per-View and hello to Paramount+. Click here to get started now.Volkanovski vs. Lopes preview Volkanovski, 37, is a two-time featherweight division champion. Prior to joining UFC, Volkanovski competed as a professional boxer, winning his only fight by unanimous decision over Dillon Bargero on April 17, 2015. He enters at No. 5 in the UFC men's pound-for-pound rankings. He is the first Australian-born fighter to win a UFC title.\nVolkanovski has compiled a 27-4 all-time record, including 13 wins by knockout, three by submission and 11 by decision. In his four losses, he has been knocked out three times, while losing one bout by decision. Australian MMA named him the 2025 Male Next Level Fighter of the Year. He is the oldest fighter in history to win the UFC featherweight championship at 36 years, 195 days. Check out SportsLine to see his picks and analysis.Lopes, 31, began his professional career in 2012, when he made his debut at It's Time Combat 1 in Manaus, Brazil. He also fought in Mexico and eventually joined the LUX Fight League in October 2018. He was invited to compete in Dana White's Contender Series 37 in 2021. Although he lost to Joanderson Brito, Lopes was eventually signed by the UFC.He made his UFC debut at UFC 288, losing by unanimous decision to Movsar Evloev, but earning Fight of the Night honors. He has won six of his last seven fights since. In 34 career matches, Lopes has compiled a 27-7 overall record. He has 11 wins by knockout, 12 by submission and four by decision. You can only see his picks and analysis at SportsLine. \nNew users can also claim the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:UFC 325 predictionsOne of of Marley's UFC 325 picks: He is backing Billy Elekana (-258) to win via decision against Junior Tafa. \"Tafa might get the striking match that he needs here, but I'm sure Elekana could run through him with wrestling if he wants, because Tafa is that bad on the ground,\" Marley said. \"Elekana can win a striking match here as well, but that is just going to be a closer fight, and he put himself at risk of getting knocked out. I hope he wrestles, but give me Elekana to win a decision.\" See who else to back here.\nHow to make UFC 325 picks Marley has strong picks for Volkanovski vs. Lopes 2 and every other bout on the UFC 325 card. He's also backing a fighter who is \"the better overall fighter,\" to emerge with a big victory. He's sharing who it is only at SportsLine.Who wins Volkanovski vs. Lopes, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $21,000 on his UFC picks since May 19, 2018, and find out.UFC 325 main fight card, odds See picks at SportsLine.(Odds from DraftKings and subject to change)Alexander Volkanovski (-148) vs. Diego Lopes (+124)Dan Hooker (+295) vs. Benoit Saint Denis (-375)Rafael Fiziev (-122) vs. Mauricio Ruffy (+102)Tai Tuivasa (+260) vs. Tallison Teixeira (-325)Quillan Salkilld (-1000) vs. Jamie Mullarkey (+676)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 odds, main fight card, predictions: MMA expert reveals picks for Volkanovski vs. Lopes picks, other fights - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/22c07cf3-1f0e-444c-ab34-fb66a756b1d4/thumbnail/1200x675/b2644e62272d82d32e06c0320e4af00f/diego-lopes-ufc-mma-imagn-images.jpg"
      ],
      "datePublished": "2026-01-31T23:44:08.000Z",
      "dateModified": "2026-01-31T23:44:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 odds, lines, fight card, predictions: Volkanovski vs. Lopes 2 picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-325-odds-props-main-fight-card-volkanovski-lopes-2-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/32f0d8c2-32a8-476d-8a34-cfdb705411ab/thumbnail/1200x675/9dd449b7026506f0be80542ce309eef6/volkanovski-lopes-ufc-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-31T23:29:13.000Z",
    "description": "\n        UFC 325 will see the promotion head Down Under as the star-studded event takes place from Sydney, Australia on Saturday. The main card begins",
    "body": "\n        UFC 325 will see the promotion head Down Under as the star-studded event takes place from Sydney, Australia on Saturday. The main card begins at 9 p.m. ET and will stream on Paramount+, with Qudos Bank Arena playing host. Many UFC 325 bets will center on the main event of Volkanovski vs. Lopes 2, which is a featherweight championship rematch. Reigning two-time champion Alexander Volkanovski (27-4) will look for another victory over challenger, Diego Lopes (27-7), after the former prevailed via decision at UFC 314 last April.The latest UFC 325 odds have Volkanovski as the -148 favorite (risk $148 to win $100) as the Aussie will have the backing of the home crowd. Lopes, the No. 2 ranked featherweight, comes in at +124 (risk $100 to win $124). The co-main event is a lightweight battle between No. 6 Dan Hooker (+295) and No. 8 Benoit Saint-Denis (-375). Before locking in any UFC 325 picks, make sure you see the MMA predictions and betting advice from Mike McClure's proven computer model.New users wanting to bet on UFC 325 can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:McClure's UFC model runs 10,000 simulations for every fight. Each simulation plays out the fight round-by-round, accounting for dynamic win probability that shifts based on fighter attributes, round-by-round finish calculations with KO/submission timing, accumulating damage factors that increase finish likelihood in later rounds and fighter-specific finishing tendencies such as power punchers vs grapplers vs decision fighters.\nThe model backtested against more than 500 fights from 2023-25 and showed more than 18 units of profit — a 6.1% ROI on UFC betting. It also got off to a hot start for the new era of UFC on Paramount+, hitting both Justin Gaethe to win outright (+195) and the Over in total rounds in the main event at UFC 324.Now, the model has analyzed Volkanovski vs. Lopes 2               from every angle and revealed its top betting picks and best bets. Head to SportsLine to see them. UFC is now on Paramount+: Here's how to watch every eventPay-Per-View just got knocked out. Stream EVERY UFC numbered event and UFC Fight Night live, at no additional cost, with your Paramount+ subscription. You can also watch pre-fight docuseries, full-length replays, archived fights from years past and more. It's time to say goodbye to Pay-Per-View and hello to Paramount+. Click here to get started now.\nVolkanovski vs. Lopes 2   preview The first Australian-born fighter to win UFC gold, the 36-year-old Volkanovski is also the oldest fighter in UFC history to win the featherweight championship. He was honored by topping the promotion's pound-for-pound rankings in both 2022 and 2023, and at one point he had an 11-fight win streak within the featherweight division. While he has just a 2-3 record over his last five bouts, two of those came when Volkanovski stepped up in weight class and challenged Islam Makhachev for the UFC Lightweight Championship, losing both bouts to Makhachev.The other defeat saw the Aussie drop the featherweight title to Ilia Topuria in Feb. 2024. However, he then won the vacant UFC Featherweight Championship in his next bout, which was the first match with Lopes. Volkanovski won via unanimous decision as he landed more than twice as many significant strikes (158) than his opponent landed total strikes (71). That was the 11th decision victory of Volkanovski's MMA career, as he also has 13 KOs and three submission triumphs. Check out SportsLine to see the model's picks and analysis.The 31-year-old Lopes has youth on his side versus Volkanovski, in addition to five inches over his 5-foot-6 opponent. A native of Brazil, Lopes has a BJJ background and signed with UFC in 2023. After dropping his first fight, he then went on a five-bout winning streak, earning Performance of the Night twice during that span. That led to his first title shot versus Volkanovski at UFC 314 in April 2025, and though the Brazilian came up short, the bout was awarded Fight of the Night.\nWhile Volkanovski has been idle since then, Lopes took a fight against Jean Silva, a fellow Brazilian who was ranked and had recorded five straight finish victories. Lopes prevailed in that September 2025 bout via TKO with a spinning elbow and punches. That was his 11th knockout victory, to go along with 12 submissions and four wins via decision. Neither Lopes nor Volkanovski have ever lost via submission, though both have tasted defeat by knockout and on the scorecards. You can only see the model's UFC 325 picks and analysis at SportsLine. UFC 325: Volkanovski vs. Lopes 2   predictionsOne of the model's top UFC 325 picks: It is backing Mauricio Ruffy at +102 (+6.0% edge) against Rafael Fiziev. \"From a stylistic perspective, this is a clash between Ruffy, who profiles as a technical fighter, and Fiziev, who operates primarily as a power striker,\" McClure said. \"There's a reasonable chance we see a finish here -- our model projects a 57% stoppage rate with knockout or TKO being the most common method at 47%. This is a modest edge on the favorite, but playable at this price. The model sees Ruffy as slightly more likely to win than the market suggests.\" See who else to back here. \nYou can make this pick at FanDuel, where new users can also check out the latest FanDuel promo code and get $200 in bonus bets instantly at FanDuel if your $5 bet wins. How to make UFC 325: Volkanovski vs. Lopes 2   picksThe model has strong picks for Volkanovski vs. Lopes 2   and other bouts on the UFC 325 card. It is also backing a +600 sleeper to win outright. You can see who it is only at SportsLine.Who wins UFC 325: Volkanovski vs. Lopes 2, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the advanced model which showed a 6.1% ROI from over 500 fights from 2023-25, and find out.\nUFC 325 main fight card, odds See picks at SportsLine.(Odds from DraftKings and subject to change)Alexander Volkanovski (-148) vs. Diego Lopes (+124)Dan Hooker (+295) vs. Benoit Saint Denis (-375)Rafael Fiziev (-122) vs. Mauricio Ruffy (+102)Tai Tuivasa (+260) vs. Tallison Teixeira (-325)Quillan Salkilld (-1000) vs. Jamie Mullarkey (+676)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 odds, lines, fight card, predictions: Volkanovski vs. Lopes 2 picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/32f0d8c2-32a8-476d-8a34-cfdb705411ab/thumbnail/1200x675/9dd449b7026506f0be80542ce309eef6/volkanovski-lopes-ufc-imagn-images.jpg"
      ],
      "datePublished": "2026-01-31T23:29:13.000Z",
      "dateModified": "2026-01-31T23:29:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mauricio Ruffy scores brutal knockout of Rafael Fiziev at UFC 325 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-results-highlights-mauricio-ruffy-rafael-fiziev-knockout/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/4fb8cb9a-8734-43c0-ab58-d9418e7714b3/thumbnail/1200x675/a48204ae6c3312afdef15d4a8b80d1cb/mauricio-ruffy-fiziev-action-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T04:07:15.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Mauricio Ruffy has always been an elite knockout t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Mauricio Ruffy has always been an elite knockout threat. What he sometimes lacked was elite composure. At UFC 325, Ruffy showed off the championship composure that comes from training with UFC featherweight champ Alexander Volkanovski. Ruffy collided with fellow striker Rafael Fizev on Saturday. It was a pivotal fight for Ruffy, who was coming off his first UFC loss against Benoit Saint Denis. Ruffy's demise in that fight was his urgency to force a memorable finish. Against Fiziev, he took his time. Fiziev looked good earlier, pressuring Ruffy to the fence and lighting him up with kicks. Ruffy started refreshingly slow and found his groove towards the end of Round 1. Follow live updates on UFC 325: Alexander Volkanovski vs. Diego Lopes as event debuts on Paramount+That slow escalation served him well. Ruffy started taking control of the fight in the second frame. In the last minute, he blasted Fiziev with an ultra-precise right cross. The punch sounded like a baseball bat, putting Fiziev in immediate trouble. Fiziev barely survived the initial onslaught of strikes, but fell over immediately after getting to his feet. The referee intervened with 30-seconds left in the second round.\nPost-fight, Ruffy called out Paddy Pimblett and Conor McGregor.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mauricio Ruffy scores brutal knockout of Rafael Fiziev at UFC 325 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/4fb8cb9a-8734-43c0-ab58-d9418e7714b3/thumbnail/1200x675/a48204ae6c3312afdef15d4a8b80d1cb/mauricio-ruffy-fiziev-action-325.jpg"
      ],
      "datePublished": "2026-02-01T04:07:15.000Z",
      "dateModified": "2026-02-01T04:07:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giannis and Curry on same team? Why potential pairing could save Warriors' season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/stephen-curry-giannis-antetokounmpo-nba-trade-warriors-bucks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/7061e87f-953a-4103-a227-84b2fa295930/thumbnail/1200x675/77e2f46ff81ec6e16fc1f30500f1cf6d/curry-giannis.jpg",
    "tag": "Sports",
    "date": "2026-01-31T20:24:50.000Z",
    "description": "\n        If the Golden State Warriors somehow swing a trade-deadline blockbuster for Giannis Antetokounmpo, the two-timeline plan will turn back into ",
    "body": "\n        If the Golden State Warriors somehow swing a trade-deadline blockbuster for Giannis Antetokounmpo, the two-timeline plan will turn back into one and it will have all been worth it. For years, the Warriors, like plenty of other potential suitors, have regarded Giannis as the \"white whale\" catch for which they were hoarding a boatload of assets. Well, that's not entirely true. The Warriors have also been hoarding assets because Joe Lacob believes he has been the author of this dynasty all along, and when the day comes, he's obsessed with proving he can write an equally successful sequel. But if ever there was a player that would convince him to back off this save-for-the-future stance and go all YOLO, it's Giannis. And now that he's actually available, the Warriors, according to ESPN's Anthony Slater, are willing to go all in to get a blockbuster done ahead of next Thursday's 3 p.m. ET trade deadline. \n        \n            \n                Ranking Giannis Antetokounmpo trade packages: Who can make best deadline offer?\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nThat means, potentially, unprotected first-round picks in 2026, 2028 and 2032, a top-20 protected pick in 2030 and a 2031 swap. On top of that, Jonathan Kuminga, who Slater reports the Bucks have expressed interest in since the summer, and Brandin Podziemski, who, again according to Slater, could \"nudge the needle\" in the direction of a deal. \nIt's a major package. Probably better than any other realistic deadline suitor can offer. Those future picks, particularly in 2030, 2031 and 2032, could become very valuable in a post-Curry world. He'll be well past 40 by then. Maybe retired. Giannis, even if he stays with the Warriors longer, would be out of his prime, too. Sure, the Warriors would have money with Curry and Draymond Green potentially off the books and could, theoretically, build another winner via free agency in Giannis's later years. But all future picks are a bet, and all things considered, this would be a pretty good one for the Bucks to take. The Warriors have to evaluate their risk in a deal like this, too. Give up all your picks and fire the Kuminga bullet and then an aging Curry or Giannis or Green gets hurt, just like Jimmy Butler did? It's over. Not just now, but for the future, too. It's a big bet. But it's worth it, as Curry and Antetokounmpo would be a once-in-a-lifetime pairing. \nOn their own, Giannis is the fiercest rim attacker in the world, as Curry is the greatest 3-point shooter to ever live. Those two gravitational forces together -- Giannis sucking defenses in, Curry pulling them out -- present what might be an unsolvable defensive dilemma. The same was thought of the Giannis-Damian Lillard pairing, but the difference between Lillard and Curry is that Curry operates off the ball. That wasn't natural for Lillard. He's not the mover Curry is. Nobody in the history of the game has been. It was, in hindsight, a backwards pairing. Maximizing Lillard meant taking Giannis off the ball, where his shooting deficiencies become a greater handicap. Giving the ball to Giannis marginalized Lillard. There would be no such tradeoff with Curry and Giannis. Curry is a rim attacker's dream, dragging paranoid defenders everywhere he moves in bunches. Good luck building that Giannis wall in the paint without Curry killing you from deep. And vice versa. It's the same model that made Curry and Butler so good together, the driver and the shooter sitting shotgun. Giannis is just several levels up from Butler. \nTo be fair, there would be issues. Giannis and Green together are a spacing cramp. You don't have to guard either of them on the perimeter. The Warriors do not want to devolve into a give-it-to-Giannis-and-let-him-bulldoze-his-way-to-the-rim offense, but how comfortable, and ultimately effective, would Giannis be in a movement-based system that requires the highest of anticipatory and improvisational instincts? Giannis' feel for the game has grown greatly. He can make the 4-on-3 reads if he's in two-man actions with a double-teamed Curry. But he's certainly not the most natural of short rollers. And where would that leave Green? If he's not the one orchestrating offense, he holds zero value as a floor spacer and would be left to impact possessions in the cracks with screens and cuts. He's smart. He can do it. It's not optimal for him. \n        \n            \n                Warriors' Draymond Green not concerned about possible trade as Giannis rumors swirl: 'I ain't losing no sleep'\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nIn the end, however, the power of the Curry-Giannis pairing would be so overwhelming that nothing else might matter. Let Draymond run the defense, which has been a top five unit for stretches of the season. Quentin Post and Al Horford can space the floor as centers. Kuminga wasn't playing anyway. The depth would still largely be there. \nRemember, the Warriors were very possibly headed for the conference finals last season before Curry got hurt. They went 22-5 with Curry and Butler in the lineup together down the stretch. This sort of inside-out dynamic has already been proven, and, again, Butler, for all the connectivity he brings to the table, isn't anywhere near the sheer physical force that Giannis is. Who knows if this will happen? The Bucks can probably spark a bigger bidding war in the summer, when more teams have more ammo to fire. But it's clear that Giannis wants to get this done now, and if you think that doesn't matter, then you haven't been paying attention to how the NBA works. Golden State has a serious offer. The Bucks are likely mulling it, and others, over as we speak. If it actually happens and Curry and Giannis end up in the same uniform, a Warriors season that looked like it ended with Butler's injury will start anew with the beginning of a marriage made in basketball heaven. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giannis and Curry on same team? Why potential pairing could save Warriors' season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/7061e87f-953a-4103-a227-84b2fa295930/thumbnail/1200x675/77e2f46ff81ec6e16fc1f30500f1cf6d/curry-giannis.jpg"
      ],
      "datePublished": "2026-01-31T20:24:50.000Z",
      "dateModified": "2026-01-31T20:24:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl 2026: Patriots' Drake Maye could become all-time great, his college coach says - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-drake-maye-patriots-seahawks-mack-brown/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/cb32d7a4-83e4-4bc5-ab36-9cafcd6357d2/thumbnail/1200x675/4d6a4ac839918b010dba3ed0ce862599/maye.png",
    "tag": "Sports",
    "date": "2026-01-31T19:40:23.000Z",
    "description": "\n        Former North Carolina football coach Mack Brown is not surprised by New England Patriots quarterback Drake Maye's early success in his NFL ca",
    "body": "\n        Former North Carolina football coach Mack Brown is not surprised by New England Patriots quarterback Drake Maye's early success in his NFL career, punctuated by his upcoming appearance in Super Bowl LX against the Seattle Seahawks.Brown convinced the Charlotte, North Carolina, native to back away from his commitment to Alabama in 2020 and instead sign with the Tar Heels, where Maye became a two-year starter, leaving his mark with 62 touchdown passes over 26 career starts with Brown as his coach.The Patriots selected Maye at No. 3 overall in the 2024 cycle and now, he's a win away from bringing New England its first title since the Bill Belichick and Tom Brady era. Brown isn't surprised by his success.\"I told scouts when they would come through that he's a Super Bowl guy, He'll win a Super Bowl,\" Brown told WRAL this week. \"I didn't know he was going to have a chance to be the second youngest guy to ever do it.\"\n\n        \n            \n                Where does Drake Maye's sophomore season rank among the greatest second-year QB seasons in NFL history?\n                \n                    Douglas Clawson                \n            \n                            \n    \n                \n                    \n    \nBrown has coached several all-timers at the college level, particularly Vince Young and Colt McCoy at Texas. He believes Maye is on a path to surpass many of the sport's greats.\"I think Drake has the upside right now that, I hope he wins this one, if he doesn't, then there's another Super Bowl out there for Drake,\" Brown said. \"I think Drake will go down not only being one of the best that I've ever coached, but one of the best to ever play.\"Brown won a national championship at Texas thanks to Young's heroics on offense, but couldn't maximize his time with the Tar Heels during Maye's tenure. North Carolina went 17-10 overall during Maye's starts, including an appearance in the ACC title game in 2022.\nOne of five MVP finalists this season, Maye led the NFL in completion percentage (72%) and yards per attempt (8.9) while also finishing near the top of the league in passing yards per game (258.5) and touchdown passes (31).To be at his best against the Seahawks, Maye — who did not practice Friday due to illness — will try and offer his norm while battling through a shoulder injury. Patriots coach Mike Vrabel is not worried about Maye being limited -- for now.\"I try not to have a whole lot of concern,\" Vrabel said. \"I just want to try to prepare the football team, make sure that everybody's ready, that we all have a plan, not to surprise anybody and make sure that our guys are focusing on the first and second down plan.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl 2026: Patriots' Drake Maye could become all-time great, his college coach says - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/cb32d7a4-83e4-4bc5-ab36-9cafcd6357d2/thumbnail/1200x675/4d6a4ac839918b010dba3ed0ce862599/maye.png"
      ],
      "datePublished": "2026-01-31T19:40:23.000Z",
      "dateModified": "2026-01-31T19:40:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 fight card predictions: Expert picks for Alexander Volkanovski vs. Diego Lopes 2 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-fight-card-predictions-expert-picks-alexander-volkanovski-vs-diego-lopes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/bae2ae99-4c47-4645-9d6d-61a171a26cfe/thumbnail/1200x675/b3c9afd3529f36e068e7368c02aa9a46/alexander-volkanovski-diego-lopes-presser-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T01:30:45.000Z",
    "description": "\n        Alexander Volkanovski looks to make the first defense of his second reign as featherweight champion in the main event of Saturday's UFC 325. ",
    "body": "\n        Alexander Volkanovski looks to make the first defense of his second reign as featherweight champion in the main event of Saturday's UFC 325. Sanding across from Volkanovski will be the man he defeated to win the vacant title, Diego Lopes.The championship rematch headlines a solid card of fights from Sydney, Australia. UFC 325 also marks the second event in the landmark seven-year media rights deal between UFC and Paramount Skydance and will, as with all UFC cards moving forward, stream live on Paramount+ for just the cost of a standard subscription.Sign up for Paramount+ and watch UFC 325 live on Saturday night for no additional fee -- every UFC numbered event and UFC Fight Night is included with the price of your subscription! Plans start as low as $8.99/month or $89.99/year!Volkanovski kicks off his second title reign with a rematch of the man he earned the championship against. Volk defeated Lopes last April to claim the title left vacant by Ilia Topuria when he moved up to lightweight. Topuria just so happened to knock out Volkanovski for the title originally. \nFollow live updates on UFC 325: Alexander Volkanovski vs. Diego Lopes as event debuts on Paramount+There's fun action fights to be found all over this event. Rafael Fiziev and Mauricio Ruffy are sure to deliver the goods when they clash in a lightweight contest on the main card. Plus, fan favorite Tai Tuivasa is always willing to lay it all on the line when he enters the Octagon. He gets a stiff test from rising contender Tallison Teixeira. And the main card opener could give us another highlight to remember when Quillan Salkilld returns to take on veteran Jamie Mullarkey. Salkilld scored a pair of incredible knockouts in 2025 that left fans speechless, including a head kick of Nasrat Haqparast that earn CBS Sports' KO of the Year.Bet UFC 325 at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:\nWith so much happening on Saturday night, let's look closer at the full fight card with the latest odds before we get to our staff predictions and picks for the PPV portion of the festivities that you can consider before hitting the sportsbooks.UFC 325 fight card, oddsOdds via DraftKings Sportsbook (as of Jan. 29)Alexander Volkanovski (c) -148 vs. Diego Lopes +124, featherweight titleBenoit Saint Denis -310 vs. Dan Hooker +250, lightweightsRafael Fiziev -120 vs. Mauricio Ruffy +100, lightweightsTallison Teixeira -345 vs. Tai Tuivasa +275, heavyweightsQuillan Salkilld -1050 vs. Jamie Mullarkey +675, lightweightsBilly Elekana -250  vs. Junior Tafa +205, light heavyweightsCam Rowston -360 vs. Cody Brundage +285, middleweightsJacob Malkoun -162 vs. Torrez Finney, +136 middleweightsJonathan Micallef -135 vs. Oban Elliott +114, welterweightsYizha -205 vs. Kaan Olfi +170, featherweightsDom Mar Fan -148 vs. Sangwook Kim +124, lightweightsSebastian Szalay -135 vs. Keiichiro Nakamura +114, featherweightsSulangrangbo -250 vs. Lawrence Liu +205, bantamweightsUFC 325 predictions, picksWith such a massive main event on tap, the crew at CBS Sports went ahead with predictions and picks for the main card from Brian Campbell, Brent Brookhouse, Shakiel Mahjouri, Michael Mormile and Brandon Wise.   CampbellBrookhouseMahjouriMormileWiseVolkanovski vs. LopesLopesVolkanovskiVolkanovskiVolkanovskiVolkanovskiHooker vs. Saint DenisSaint DenisSaint DenisSaint DenisSaint DenisSaint DenisFiziev vs. RuffyRuffyFizievFizievFizievFizievTeixeira vs. TuivasaTuivasaTeixeiraTuivasaTeixeiraTeixeiraSalkilld vs. MullarkeySalkilldSalkilldSalkilldSalkilldSalkilldRecords to date 2-34-14-13-22-3Alexander Volkanovski vs. Diego Lopes predictionsCampbell: Volkanovski appeared to turn back the clock last April when he captured the vacant title by outpointing Lopes. But an honest Lopes, who still managed to drop Volkanovski, admitted after the fight that he failed to follow his corner's gameplan and got caught simply following his opponent around in hopes of a knockout. Expect a more seasoned and more dangerous Lopes in the rematch. Not only did he rely on grappling and the traps he set with striking to ultimately finish Jean Silva last September, he has been working relentlessly on rounding out his game. If Lopes does a better job cutting off the cage and using both his size and the threat of the takedown to make the 37-year-old Volkanovski feel his age, this should be a very different fight. And while Volkanovski's chin did hold up during their first fight despite having been fresh off of back-to-back knockout losses, his time at the top may be running out. Lopes via TKO3\nBrookhouse: It's hard to believe that this fight plays out much differently than the first fight unless Volkanovski has aged considerably in the past year. Yes, 37 is old for a fighter, especially a featherweight, but Volkanovski is a uniquely skilled tactician in his ability to not only prepare, but execute a gameplan. I don't see any reason to think that losses to Islam Makhachev and Ilia Topuria signal a fighter is \"done\" at an elite level, simply that he ran into two of the best fighters on the planet in their prime. Lopes doesn't have a reliable takedown game, which means that this is a striking battle, and Volkanovski is great at working angles and finding timing. Yes, Lopes did hurt Volkanovski in the first fight, but that came in between Volkanovski clearly controlling the rest of the action. I simply don't believe that Lopes can out-gameplan and outexecute Volkanovski. Volkanovski via UDMahjouri: If this fight were a year from now, I'd pick Lopes in a heartbeat. The challenger has every physical advantage over the champ: height, reach, durability, and power. Lopes' inexperience cost him the first fight. Volkanovski showcased why he's a featherweight GOAT. He controlled the lead outside foot positioning, feinted brilliantly, and significantly outstruck Lopes. The champ pitched a near-perfect game, yet still gave up one or two rounds to Lopes' power. That's the worry here. Lopes' physical gifts will become a bigger factor as he narrows the technical gaps. The question is whether Lopes can cover enough distance in nine months to beat Volkanovski. It will be a much closer second fight, but Volkanovski should have enough in the tank to win a narrow decision. Volkanovski via UDMormile: Volkanovski UDWise: Volkanovski via UDDan Hooker vs. Benoit Saint Denis predictionsCampbell: Reformed following a pair of TKO defeats, Saint Denis has looked like a completely different fighter in three walks to the Octagon under the tutelage of new coach Nicholas Ott, which produced a trio of stoppage wins in 2025. The task at hand against Hooker on Saturday will be for 'BSD' to ignore the urge to throw caution to the wind off the start and get into a full-blown slugfest. Saint Denis is at his best when he balances patience and grappling with the threat of his powerful striking. And considering Hooker was finished in less than two rounds by Arman Tsarukyan just two months ago, this could be the perfect catapult for the French \"God of War\" to score a systematic stoppage victory and enter the top five at 155 pounds. Hooker is always game for battle, but his one-dimensional style has caught up with him on the elite level. Saint Denis via KO2\nBrookhouse: As long as Saint Denis remains solid in his approach and doesn't willingly engage in a brawl, this is his fight to lose. Hooker is a fighter who leaves a lot of defensive openings in his wide-open attacking style. Saint Denis has the ability to hurt Hooker on the feet in those exchanges, but would be well served to look to grapple and put Hooker on the floor. If Saint Denis can work from on top, he can damage Hooker with strikes to eventually set up a submission. Saint Denis via SUB2Mahjouri: Hooker has no designs on changing his style. He's hell-bent on action, and it'll cost him against on Saturday. Neither man has perfect durability, but Hooker has more wear and tear. That's concerning against Saint Denis, the younger and arguably more powerful fighter. Saint Denis looks revitalized working with top middleweight contender Nassourine Imavov. The French special forces soldier has the natural gifts and evolving skillset to make short work of Hooker. It's imperative, however, that he doesn't abandon his defense. Hooker can still crack and will catch Saint Denis if he's not careful. Saint Denis via KO2Mormile: Saint Denis via submissionWise: Saint Denis via TKO3Rafael Fiziev vs. Mauricio Ruffy predictionsCampbell: Urgency is the name of the game in this top 15 matchup at lightweight as both fighters can desperately use a big win to further propel themselves back into contention. Ruffy, who suffered a humbling submission defeat at the hands of Saint Denis last September in a fight that exposed his lack of a grappling game, moved from the Fighting Nerds camp in Brazil to train with Volkanovski in Australia. Fiziev, meanwhile, who snapped a three-fight losing skid last June when he took a decision from Ignacio Bahamondes, is finally healthy and looking to put a pair of decision defeats to new interim champion Justin Gaethje behind him. That means this fight has all the potential to be a fun striking match over three rounds and one that is very evenly contested. If Ruffy can add the threat of wrestling, it could be the difference. Ruffy via UD\nBrookhouse: If anyone can add wrestling threats to this fight, it's Fiziev. Ruffy has never scored a takedown in the UFC and he was taken down three times while being dominated by Saint Denis. Fiziev, meanwhile, has scored six takedowns in his two most recent fights, including two against Justin Gaethje. In a fairly even battle of strikers, though Ruffy may be a bit more dynamic in his angles and shot selection, one fighter having the edge in grappling is enough to tilt the fight on paper. While either man could catch the other on the feet, Fiziev's new confidence in his wrestling gives me some comfort in siding with him. Fiziev via UDMahjouri: This might be an even more compelling action fight than the co-main event. Fiziev and Ruffy are on the cusp of entering the lightweight elite. Fiziev is a first-class Muay Thai striker with an improving wrestling game. Ruffy, a textbook KO artist, recently migrated from the Fighting Nerds to featherweight champ Volkanovski's camp. I was prepared to count Fiziev out, but I think he's a victim of bad luck. His three UFC losses are a majority decision to Justin Gaethje, a freak knee injury against Mateusz Gamrot and a close rematch against Gaethje, which he took on two weeks' notice after a year-and-a-half layoff from the aforementioned injury. Fiziev showed signs of life in a bounce-back win against Ignacio Bahamondes, complementing his striking with newfound wrestling. Ruffy might revolutionize himself with Team Volkanovski, but I'll need to see the results before assessing his future. Fiziev via UDMormile: Fiziev via UDWise: Fiziev via UDWho wins Volkanovski vs. Lopes, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $21,000 on his UFC picks since May 19, 2018, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 fight card predictions: Expert picks for Alexander Volkanovski vs. Diego Lopes 2 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/bae2ae99-4c47-4645-9d6d-61a171a26cfe/thumbnail/1200x675/b3c9afd3529f36e068e7368c02aa9a46/alexander-volkanovski-diego-lopes-presser-325.jpg"
      ],
      "datePublished": "2026-02-01T01:30:45.000Z",
      "dateModified": "2026-02-01T01:30:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch UFC 325: Alexander Volkanovski vs. Diego Lopes start time, stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-alexander-volkanovski-diego-lopes-where-to-watch-stream-paramount/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/fb5e23cd-1f5b-4e3f-9690-93c4d6f186e6/thumbnail/1200x675/dcfe15ba20ec98cc3ac8d8725bf55b19/ufc-paramount-general-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-01T01:00:51.000Z",
    "description": "\n        Just one week after UFC debuted on Paramount+ in Las Vegas for UFC 324, the promotion heads Down Under for UFC 325 in Sydney, Australia. Desp",
    "body": "\n        Just one week after UFC debuted on Paramount+ in Las Vegas for UFC 324, the promotion heads Down Under for UFC 325 in Sydney, Australia. Despite taking place on the other side of the world, the fight card will utilize the standard start times. Early preliminary fights begin at 5 p.m. ET before the main card gets underway at 9 p.m. In the UFC 325 main event, featherweight champion Alexander Volkanovski takes on challenger Diego Lopes with the title on the line. The two battled for the vacant strap last April when Volkanovski earned a unanimous decision to kick off his second reign as champion at 145 pounds.Follow live updates on UFC 325: Alexander Volkanovski vs. Diego Lopes as event debuts on Paramount+Lopes took a short detour between Volkanovski fights. Lopes, who graduated from UFC debutant to title challenger in two years, is coming off a knockout win over Jean Silva that was in the running for CBS Sports' 2025 Fight of the Year. Lopes is an impressive dual threat who captured fans' attention with his ability to knock people out or submit them with equal efficacy. \nSign up for Paramount+ and WATCH UFC 325 LIVE for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription. Plans start as low as $8.99/month or $89.99/year!The new era of UFC is well underway, and you do not want to miss a moment of it. CBS Sports is here to ensure you have everything you need to know about UFC 325 and how to watch UFC numbered events, UFC Fight Nights, archives and much more on Paramount+.How to watch UFC 325 on Paramount+All times EasternDate: Saturday, Jan. 31 | Location: Qudos Bank Arena -- Sydney, AustraliaStart times: Pre-show: 4 p.m. | Early prelims -- 5 p.m. | Prelims -- 7 p.m. | Main card -- 9 p.m.Watch live: Subscribe to Paramount+\nSubscribe to watch UFC on Paramount+Paramount+ is the new home of UFC. All 13 UFC numbered events and 30 UFC Fight Nights will stream exclusively on the service for the next seven years through 2033. It is a monumental move that makes UFC more accessible to fans than ever before.All Paramount+ subscribers -- Premium and Essential -- can stream an extensive archive of UFC content, including a deep library of past UFC fights on demand, iconic bouts, features on champions and UFC legends, series like UFC Embedded and UFC Countdown, exclusive interviews with athletes, previews of every numbered event with CBS Sports experts and much more.How much does Paramount+ cost?There are two available subscription plans that can be purchased monthly or annually for additional savings. UFC numbered events, UFC Fight Nights and UFC archival content are available on both plans, as is the NFL on CBS, UCL games, March Madness, the Big Ten and hundreds of other sporting events each year.\nMost important: There is no additional fee to watch UFC on Paramount+ events live and/or on demand. Everything is included with the price of your subscription. Say goodbye to pay-per-view! Plus, Paramount+ subscribers in the U.S. can stream events in English, Spanish or Portuguese. Paramount+ PremiumParamount+ Essential$13.99/month, $139.99/year (save $27.89!)$8.99/month, $89.99/year (save $17.89!)No ads^Ad supportedGet all of SHOWTIMEGet select SHOWTIME seriesWatch in 4K UHD, Dolby Vision or HDR10Download movies and showsStream CBS live -- more sports and eventsMost popular Paramount+ plan^ Plans include trailers & sponsorship (or similar). Live TV has ads.What else is included on Paramount+?The Essential and Premium plans each allow subscribers to watch more than 40,000 episodes and movies and stream content on three devices at once, including Paramount+ originals like Landman and 1923, new release films like Top Gun: Maverick and The Naked Gun, popular and classic films like Gladiator and The Wolf of Wall Street, and the catalogs of Comedy Central (featuring South Park), Nickelodeon, MTV, BET and beyond.What devices support Paramount+?Stream Paramount+ on any device listed here! For more information, including supported models or operating systems, visit the Paramount+ FAQ: Computer, Apple TV, iPhone and iPad, Apple Vision Pro, Android TV, Android phone and tablet, Chromecast, Cox Contour bo, DISH Hopper 3 with Hopper Plus, DIRECTV Gemini, Fire TV/Tablet, GoogleTV, Portal TV, PlayStation 4 and 5, Roku, Samsung TV, Vizio TV, LG TV, VIDAA TV, Xbox, Xfinity and Xumo.UFC 325 fight card, oddsOdds via DraftKings Sportsbook (as of Jan. 29)Alexander Volkanovski (c) -148 vs. Diego Lopes +124, featherweight titleBenoit Saint Denis -310 vs. Dan Hooker +250, lightweightsRafael Fiziev -120 vs. Mauricio Ruffy +100, lightweightsTallison Teixeira -345 vs. Tai Tuivasa +275, heavyweightsQuillan Salkilld -1050 vs. Jamie Mullarkey +675, lightweightsBilly Elekana -250  vs. Junior Tafa +205, light heavyweightsCam Rowston -360 vs. Cody Brundage +285, middleweightsJacob Malkoun -162 vs. Torrez Finney, +136 middleweightsJonathan Micallef -135 vs. Oban Elliott +114, welterweightsYizha -205 vs. Kaan Olfi +170, featherweightsDom Mar Fan -148 vs. Sangwook Kim +124, lightweightsSebastian Szalay -135 vs. Keiichiro Nakamura +114, featherweightsSulangrangbo -250 vs. Lawrence Liu +205, bantamweightsWhat is the UFC event schedule in 2026?Three UFC numbered events and six UFC Fight Nights have already been announced through the first three months of 2026. Additional events will be announced as the year progresses with the UFC schedule updating regularly. Every event will be available along with your Paramount+ subscription.Will any UFC events air on CBS?Yes, select UFC numbered events will also air live on CBS in 2026. That means you will be able to watch those events on your TV through your local CBS station using cable, satellite or a digital antenna. It has not yet been announced when UFC will air on CBS.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch UFC 325: Alexander Volkanovski vs. Diego Lopes start time, stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/fb5e23cd-1f5b-4e3f-9690-93c4d6f186e6/thumbnail/1200x675/dcfe15ba20ec98cc3ac8d8725bf55b19/ufc-paramount-general-2026.jpg"
      ],
      "datePublished": "2026-02-01T01:00:51.000Z",
      "dateModified": "2026-02-01T01:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Draymond Green not concerned about possible trade as Giannis-Warriors rumors swirl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-trade-rumors-giannis-antetokounmpo-bucks-warriors-draymond-green/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/824a47e3-1f52-4027-8465-76754a4504c7/thumbnail/1200x675/c8d2086ac4d89ac508195d68f3e50341/gettyimages-2256529168-2.jpg",
    "tag": "Sports",
    "date": "2026-01-31T20:15:16.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA trade deadline can be a source of anxiety ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA trade deadline can be a source of anxiety for many players, but Draymond Green isn't one of them. Despite rumors that the Golden State Warriors are aggressively pursuing Milwaukee Bucks star Giannis Antetokounmpo, Green is taking a more laid-back approach when it comes to his future with the team.Following the Warriors' loss to the Detroit Pistons on Friday night, Green was asked is he is concerned about being traded before the Feb. 5 deadline. The veteran said he's been around long enough to know that trades are just part of life in the NBA.\"I've been here for 16 years now,\" Green said. \"I have no reason to sit and worry about leaving. If I'm traded, that's part of the business. I ain't losing no sleep, though. I slept great last night. Incredible.\"\nIf the Warriors are going to pull off a blockbuster deal for Antetokounmpo, they'll have to make the money work. The 35-year-old Green is making just shy of $26 million this season, and he has one more year left on his current contract at the same price. That does make him a possible trade chip, but the Warriors have other players who could be included in a deal for Antetokounmpo.CBS Sports' Brad Botkin put together the best trade package that each of the top Antetokounmpo suitors could make. Green wasn't included in that hypothetical deal, and the injured Jimmy Butler was the cap casualty in that instance. Jonathan Kuminga is another player who could be on his way to Milwaukee if Golden State wanted to take a big swing.\n\n        \n            \n                Once-in-a-lifetime pairing: Stephen Curry and Giannis Antetokounmpo would be a match made in basketball heaven\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nThe Warriors drafted Green with the No. 35 overall pick in the 2012 NBA Draft, and he's been with the team ever since. Throughout his 16 seasons, Green has played a pivotal role in four NBA championships, and he's earned NBA All-Defensive team honors nine times. This season, Green is averaging 8.4 points, 5.7 rebounds and 5.5 assists while shooting 41.6% from the field.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Draymond Green not concerned about possible trade as Giannis-Warriors rumors swirl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/824a47e3-1f52-4027-8465-76754a4504c7/thumbnail/1200x675/c8d2086ac4d89ac508195d68f3e50341/gettyimages-2256529168-2.jpg"
      ],
      "datePublished": "2026-01-31T20:15:16.000Z",
      "dateModified": "2026-01-31T20:15:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas basketball looks elite with Darryn Peterson, but health stands in the way - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-basketball-vs-byu-darryn-peterson-shines-as-health-looms-large/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/85e0c38b-64be-4053-a074-633a648770d8/thumbnail/1200x675/7f3ba365c4a9778a93b856d71b08d921/darrynpetersonkansas.jpg",
    "tag": "Sports",
    "date": "2026-02-01T02:20:48.000Z",
    "description": "\n        LAWRENCE, Kan. -- It was one of the most anticipated games at Allen Fieldhouse in the past few years, a matchup of the projected top two NBA ",
    "body": "\n        LAWRENCE, Kan. -- It was one of the most anticipated games at Allen Fieldhouse in the past few years, a matchup of the projected top two NBA Draft picks and 2025's No. 1-and No. 2-ranked high school players, Darryn Peterson of Kansas and AJ Dybantsa of BYU, in a key game for the Big 12 title race. Saturday marked just the fourth time in the internet rankings era that 247Sports' top two high schoolers had faced off as college freshmen. Even a building as historic as the Fieldhouse had never seen a matchup like this.The crowd was appropriate for the event. ESPN's College Gameday came to Lawrence, Kansas legend Paul Pierce and 2026's top-ranked player Tyran Stokes of Seattle (Wash.) Rainier Beach showed up for the spectacle, and the usually raucous Allen Fieldhouse crowd was in full throat well before tipoff.Answers were expected to be given on Saturday. Can either Kansas or BYU seriously contend for a Big 12 title and eventually a Final Four berth? Should Peterson -- who has missed half the season with various injuries -- or college basketball's second-leading scorer, Dybantsa, be considered the favorite for the No. 1 pick in June's NBA Draft?\nAfter running out to a huge early lead and holding on for dear life as BYU senior Richie Saunders unleashed a 33-point scoring barrage, Kansas cleared a big hurdle to move to 6-2 in the Big 12 with a 90-82 win.With 18 first-half points, Peterson showed why 247Sports ranked him No. 1 in high school and why he's the slight favorite to go No. 1 in June. For the first 20 minutes, he made the Fieldhouse his playground, drilling effortless 3s, scoring at will off the dribble and making big-time plays on the defensive end. With just over two minutes remaining in the half, he nearly took the roof off the place with a contested jam on a drive down the right side of the lane. It was everything that Kansas fans wanted to see as they built a 53-33 halftime lead.\nThen Bill Self and the Kansas faithful saw what they'd rather not see again. Just a few minutes into the second half, their star freshman checked himself out of the game and never returned due to cramping issues that have plagued him all year. Peterson has played in 11 of Kansas 21 games and, if he misses the next game as a result of any possible injury from Saturday, it will mark the fourth time his availability has toggled from yes to no. \nThe continued uncertainty around Peterson's status is a serious concern for a Kansas team that, with him at full health, has a legitimate Final Four ceiling. Since its 2022 national championship, Kansas has yet to make to to the NCAA Tournament's second weekend. \"That was the real DP there, you guys haven't seen it like we have,\" Self said of Peterson's 18 points and three steals in the first half. \"It's just unfortunate that we didn't see it for 40 minutes.\"(The dunk) was athletic and it was off a sprained ankle, so that was good to see. He showed a lot in his bag in the first half.\"\nPeterson is already one of the most prolific scorers in Kansas single-season history.  \n                                                                    CBS Sports Research\n                                                            On the other side, Dybantsa came out slow. Often matched up with Kansas big man Flory Bidunga, Dybantsa seemed to be bothered a bit by the length and quickness, and he had some difficulties finding his spots. As he's done all year, he was able to get things going a bit in the second half to finish with 17 points.\"I thought he was OK,\" BYU coach Kevin Young said. \"He was holding the ball a little too much in the first half. I thought he was better in the second half. He was driving and getting to his spots and looking for some of those turnarounds, and I thought he did a good job of kicking the basketball out. \"I'm not crying over spilled milk or anything, but the guy leads the country in fouls drawn and got to the line four times tonight. I thought there were times where he could have been fouled that they missed, but that's life and you have to keep playing. All in all, it was, I thought, a game for him that he handled well relative to all of the outside noise.\"\nThere is some bright side for Kansas when it comes to Peterson's continued cramping issues. Senior guard Melvin Council continues to come up big in big moments, and freshman big man Bryson Tiller is coming along and had his best game of the year, notching 21 points -- including a trio of first-half triples -- and grabbing seven rebounds.Now 16-5, this Kansas group is coming together as it prepares to face Texas Tech next. But if they're going to compete at the highest level and really compete for titles, they need their most dynamic player to be available, and nobody knows that better than Self.\"We can be competitive, but for us to actually have a chance to do anything that I would consider to be special, we need everybody healthy,\" Self said. \n\"It's disappointing that he couldn't go because of cramps. He didn't cramp last game, but he did today, and I certainly hope we can figure that out. But it tells me that we may not be consistently where some teams play night in and night out, but on any night, we can play with anybody.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas basketball looks elite with Darryn Peterson, but health stands in the way - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/85e0c38b-64be-4053-a074-633a648770d8/thumbnail/1200x675/7f3ba365c4a9778a93b856d71b08d921/darrynpetersonkansas.jpg"
      ],
      "datePublished": "2026-02-01T02:20:48.000Z",
      "dateModified": "2026-02-01T02:20:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas vs. BYU reaction: Supporting stars steal show - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-byu-aj-dybantsa-darryn-peterson-score-analysis-game-recap/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/a7317f7c-cef7-4bd9-9961-8d58b7d3c71b/thumbnail/1200x675/0db79e989280ebc12cc7ae4aa24949e1/usatsi-28131120-1.jpg",
    "tag": "Sports",
    "date": "2026-02-01T01:38:55.000Z",
    "description": "\n        Kansas vs. BYU was billed as a generational prospect duel between presumptive top 2026 NBA Draft picks Darryn Peterson and AJ Dybantsa. Inste",
    "body": "\n        Kansas vs. BYU was billed as a generational prospect duel between presumptive top 2026 NBA Draft picks Darryn Peterson and AJ Dybantsa. Instead gave way to recurring plot lines that have defined each team's season. No. 14 Kansas, celebrating the 1,000th game at Allen Fieldhouse, emerged with a 90-82 victory over No. 13 BYU -- but it was far from a perfect night. The eye-popping Peterson was an unguardable phenomenon in the first half, looking every bit the No. 1 prospect, before sitting out most of the second half with leg cramps. Injuries and ailments have unfortunately been the story of Peterson's one and only season in Lawrence; Peterson has been splendid in the games he's played, but he's missed 10 games and long chunks of all 11 contests he's suited up for.BYU, meanwhile, was obliterated in the first half, but in part because of Peterson's absence, the Cougars again roared in the second half, like they did against UConn in November, against Clemson in December and at Arizona last Monday. Comeback attempts are compelling, but BYU is 1-3 in the games we just listed (only beating Clemson). Peterson and Dybantsa didn't have a chance to go blow-for-blow in crunch time, but lessons were still learned. Let's dive into the top takeaways.\n\n        \n            \n                Michigan uses big second-half rally to beat Michigan State for first time in Breslin Center since 2018\n                \n                    Cameron Salerno                \n            \n                            \n    \n                \n                    \n    \nKansas' depth is starting to round into formIf the basketball gods are kind and Peterson is allowed to ever play a full game, Kansas has the supporting cast in order to do some serious damage. Redshirt freshman Bryson Tiller has been outstanding and this was his best showing yet. The big, physical forward delivered 21 points, seven rebounds and a block to propel KU to its 16th victory of the season.It's been a bit of a rollercoaster for Tiller in conference play, but he's rounding into serious form. He's all of 6-foot-11, so Kansas' interior defense is a fortress when he's on the floor next to the lean, mean, shot-blocking machine that is Bidunga. But Tiller made BYU's defense pay for swarming the paint and leaving him open. He confidently splashed three triples after downright refusing to shoot 3-pointers for long stretches in January. That proved to be the difference in the game, and changes the complexion of this Kansas club in March.The Peterson-Tiller-Melvin Council-Tre White-Flory Bidunga  lineup has terrific positional size at all five spots with tons of talent. It gave BYU fits, and Good Tiller transforms Kansas into a terrifying March draw.\nWith the victory the Jayhawks are expected to move up from a No. 4 seed to a No. 3 seed when the CBS Sports Bracketology model is updated Sunday. BYU is expected to remain a No. 4 seed in the latest bracket projection.Council adds to his burgeoning Kansas loreNo transfer has changed the tenor of a team quite like Kansas' Council, the spindly guard from Rochester who last played at St. Bonaventure. The raucous student section barks at his beck and call. When Kansas was teetering without Peterson in the second half, it was Council who had an in-your-eyehole trey, a steal and a layup, and a late-game, pull-up jumper from the elbow to stem the tide once and for all.Council totaled 15 points, six rebounds, six dimes and just one turnover. Council is beloved by this program, and he's wrapped his arms around them just as tightly. \nPeterson is the best player on this team. Bidunga is the Defensive Player of the Year on this club. Council is the soul.Inside Self's latest magic trickKansas chose to sic Bidunga -- its starting center -- on Dybantsa. The move worked brilliantly. Dybantsa balked a bit at the early assignment, almost like he was caught off guard a bit at the idea that a center, not a wing, was the choice to shadow him. Dybantsa attempted just two shots in the first 12+ minutes of regulation. By that point, BYU was already in a 20-point hole. As you'd expect, the brilliant Dybantsa got it going in the second half and finished with 17 points. But Bidunga's length and athleticism certainly gave him problems whenever they got matched up one-on-one. \nSaunders stars for BYU in losing effort It's unfortunate that it came in a loss, but that was an absurd showing from Saunders. The veteran BYU guard erupted for 33 points -- 24 in the second half -- to breathe life into BYU. Saunders' barrage of off-movement treys, slice-and-dice cuts, relentless offensive rebounding and all-out hustle should be a valuable lesson that sticks in the brains of the dozens of NBA decision-makers that crammed into Allen Fieldhouse for the Dybantsa-Peterson show.Thirty-three points, 10 rebounds, two steals and one block on that type of stage? Saunders just guaranteed his spot in the 2026 NBA Draft. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas vs. BYU reaction: Supporting stars steal show - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/a7317f7c-cef7-4bd9-9961-8d58b7d3c71b/thumbnail/1200x675/0db79e989280ebc12cc7ae4aa24949e1/usatsi-28131120-1.jpg"
      ],
      "datePublished": "2026-02-01T01:38:55.000Z",
      "dateModified": "2026-02-01T01:38:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FIFA Women's Champions Cup: How to watch Gotham vs. ASFAR, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/fifa-womens-champions-cup-live-stream-how-to-watch-arsenal-gotham-corinthians/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/fa18c6bb-d5a2-4e21-b417-dd22c6a21c03/thumbnail/1200x675/73a520dfc3ccec5992d36d2f107b6d09/gotham-fc-nwsl.jpg",
    "tag": "Sports",
    "date": "2026-02-01T03:55:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first-ever winner of the FIFA Women's Champion",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first-ever winner of the FIFA Women's Champions Cup will be crowned on Sunday as Corinthians and Arsenal meet at the Emirates Stadium in London. You can catch all the action on CBS Sports Golazo Network as this continental competition takes place. Arsenal booked their place in the tournament by winning the UEFA Women's Champions League over Barcelona before defeating Moroccan side ASFAR in the semifinals. Corinthians are the holders of the CONMEBOL Copa Libertadores Femenina where they defeated Deportivo Cali before getting past the Concacaf representatives, NY/NJ Gotham FC.How to watch Arsenal vs. CorinthiansDate: Sunday, Feb. 1 | Time: 1 p.m. ETLocation: Emirates Stadium -- LondonTV: CBS Sports Golazo Network While Arsenal and Corinthians meet for the title, Gotham and ASFAR will meet in the third-place game, which is also on Sunday. Arsenal got a little healthier during their semifinal game as Choe Kelly returned from a two-month injury absence in the 77th minute, and having her for the final versus an organized Corinthians side will be important. \"It's hard even talking about it, because we know how difficult this game will be,\" Corinthians midfielder Duda Sampaio said. \"It will be one of the hardest games of my career. We know how great Arsenal is in Europe, and we are doing our best to be ready to make another great game, just like we did in the semis.\" Corinthians have already shown that South American soccer needs to be respected after defeating Gotham despite the NWSL side holding most of the possession, and that will be a similar game plan that they'll need to stay in the match against Arsenal. The winner will receive $2.3 million which is the largest ever payout in a women's soccer tournament, while the runners-up receive $1 million, so the financial incentives are also important here.\nIt's the first meeting between Arsenal and Corinthians, and the Gunners will have the backing of home support for the match.How to watch Gotham FC vs. ASFARDate: Sunday, Feb. 1 | Time: 9:45 a.m. ETLocation: Emirates Stadium -- LondonTV: CBS Sports Golazo Network \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIFA Women's Champions Cup: How to watch Gotham vs. ASFAR, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/fa18c6bb-d5a2-4e21-b417-dd22c6a21c03/thumbnail/1200x675/73a520dfc3ccec5992d36d2f107b6d09/gotham-fc-nwsl.jpg"
      ],
      "datePublished": "2026-02-01T03:55:00.000Z",
      "dateModified": "2026-02-01T03:55:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luis Arraez signs with Giants: Three-time batting champ joins San Francisco as free agent - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/luis-arraez-signs-san-francisco-giants-second-baseman/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/c0c96b38-8aba-4c7e-a21f-d72bcb5929c9/thumbnail/1200x675/529641b926fc64568aa441805d935e7e/luis-arraez-padres.jpg",
    "tag": "Sports",
    "date": "2026-02-01T01:43:15.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The San Francisco Giants have agreed to terms on a",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The San Francisco Giants have agreed to terms on a one-year pact with free-agent infielder Luis Arraez, according to ESPN. Arraez is expected to earn $12 million and play second base, per El Extrabase.Arraez, 28, is a three-time All-Star honoree and Batting Title winner. Over the past three seasons, he's batted .319/.355/.416 (111 OPS+) with seven home runs and eight stolen bases on average. Last year, he hit .292/.327/.392 (99 OPS+) while striking out in a career-low 3.1% of his plate appearances.\nNevertheless, Arraez's unidimensional offensive game and lack of true defensive or positional value landed him at No. 44 on CBS Sports' offseason rankings of the winter's top 50 free agents. Here's part of what we wrote at the time:\nArraez is a unidimensional player. He doesn't walk or run often and he can't field or slug. He's a pure singles merchant who excels at putting the pine on the cowhide, to the extent that he connected on nearly 95% of his swings. That's an incredible skill, it's just not one that's profitable anymore for teams or individual players. Of course, it only takes one club with an outmoded perspective -- or a half-understanding of why the Blue Jays enjoyed so much success this season -- for Arraez to land a more lucrative deal than expected.Arraez joins a Giants team that went 81-81 last season while giving at least 40 second-base appearances to Tyler Fitzgerald, Casey Schmitt, and Christian Koss. Collectively, San Francisco's second basemen hit .217/.273/.343 with 14 home runs. Arraez should be an upgrade at the plate. The question, then, is how large the advantage will remain when defense is factored into the equation.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luis Arraez signs with Giants: Three-time batting champ joins San Francisco as free agent - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/c0c96b38-8aba-4c7e-a21f-d72bcb5929c9/thumbnail/1200x675/529641b926fc64568aa441805d935e7e/luis-arraez-padres.jpg"
      ],
      "datePublished": "2026-02-01T01:43:15.000Z",
      "dateModified": "2026-02-01T01:43:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tuskegee coach handcuffed, escorted off court by police after loss to Morehouse - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/hbcu-basketball-tuskegee-morehouse-coach-handcuffed/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/5a1278eb-3bf5-443c-b350-e9dfe4ade6db/thumbnail/1200x675/4eda5b54e0303d651e95148452f303c0/usatsi-25427325-1.jpg",
    "tag": "Sports",
    "date": "2026-02-01T02:43:30.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Tuskegee University coach Benjy Taylor was handcuf",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Tuskegee University coach Benjy Taylor was handcuffed and escorted off the floor by police after his team's 77-69 loss Saturday at Morehouse College in a shocking sequence that punctuated a hard-fought battle between the two Division II HBCU rivals. The incident, caught on video, took place after Taylor and an individual wearing a police uniform shared a brief exchange, which quickly escalated as the officer grabbed his handcuffs from his belt and put them on Taylor.HBCU Gameday reported that football players from Morehouse came onto the floor following the game's conclusion, which prompted Taylor to approach security over its handling of the situation. Tuskegee AD Reginald Ruffin told HBCU Gameday that Taylor was simply trying to make sure conference-mandated security protocols were being enforced and that Taylor was concerned about a security breach.\"I am at a loss for words and I am upset about how I was violated and treated today,\" Taylor told the Field of 68. \"For my players, my family and people of Tuskegee to witness that is heartbreaking for me. I was simply trying to get the football team out of the handshake line as they were following right behind me and the team yelling obscenities!  It was a very dangerous situation.\"\nVideo of the incident shows Taylor in a state of bewilderment as he appears to react in real-time to being told he is being handcuffed. His shock quickly turned into a smile, seemingly laughing at how outrageous the situation was.\nTaylor was later released and was able to make the trip back home on the Tuskegee team bus.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tuskegee coach handcuffed, escorted off court by police after loss to Morehouse - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/5a1278eb-3bf5-443c-b350-e9dfe4ade6db/thumbnail/1200x675/4eda5b54e0303d651e95148452f303c0/usatsi-25427325-1.jpg"
      ],
      "datePublished": "2026-02-01T02:43:30.000Z",
      "dateModified": "2026-02-01T02:43:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dave Roberts says Dodgers' Shohei Ohtani won't pitch for Team Japan in WBC - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-shohei-ohtani-pitch-team-japan-world-baseball-classic-dave-roberts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/3b3ee423-532c-4e87-98ea-6af532d11876/thumbnail/1200x675/6770761af41ea9c9026abd4bd153d377/ohtani.jpg",
    "tag": "Sports",
    "date": "2026-01-31T22:25:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shohei Ohtani will not pitch for Team Japan during",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shohei Ohtani will not pitch for Team Japan during the upcoming World Baseball Classic, Los Angeles Dodgers manager Dave Roberts told reporters (including the California Post) during Saturday's fanfest event. Roberts said Ohtani made the call and that the Dodgers would have supported him if he had chosen to pitch for Japan. (WBC pool play is slated to begin on March 4.)It's worth noting that Roberts' comments came shortly after Ohtani painted a different picture of his pitching status. Ohtani told reporters he remained undecided, reserving judgment until he begins ramping up over the coming weeks.Ohtani is still expected to suit up for Team Japan as a designated hitter, with Dodgers teammate Yoshinobu Yamamoto slotting in as the staff ace.\n\"Wearing a Japanese uniform once again fills me with a deep sense of pride and responsibility,\" Yamamoto said in a Team Japan-issued statement. \"I've trained hard this offseason to be in the best possible condition for the WBC. Together, with great teammates and a dependable coaching staff, we'll unite as one and aim for the top.\"The Dodgers' other Japanese star, right-hander Roki Sasaki, was not named as part of Team Japan's roster. Sasaki had an uneven rookie season in MLB, including a prolonged absence due to injury. However, he did find success in a relief role during the playoffs.\nOhtani, 31, is coming off an eventful season that saw him hit .282/.392/.622 (179 OPS+) with 55 home runs and 20 stolen bases. He tallied 6.6 Wins Above Replacement as a hitter alone. He also made his return to the mound following elbow surgery. In 14 regular-season starts, he compiled a 2.87 ERA (145 ERA+) and a 6.89 strikeout-to-walk ratio. His contributions as a pitcher were worth an estimated 1.1 Wins Above Replacement, per the calculations housed at Baseball Reference.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dave Roberts says Dodgers' Shohei Ohtani won't pitch for Team Japan in WBC - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/3b3ee423-532c-4e87-98ea-6af532d11876/thumbnail/1200x675/6770761af41ea9c9026abd4bd153d377/ohtani.jpg"
      ],
      "datePublished": "2026-01-31T22:25:00.000Z",
      "dateModified": "2026-01-31T22:25:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Teofimo Lopez vs. Shakur Stevenson: Fight start time, PPV price - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/teofimo-lopez-vs-shakur-stevenson-fight-start-time-where-to-watch-live-stream-ppv-price/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/b27a4755-b744-4ceb-ba17-33927159737a/thumbnail/1200x675/a25a1ad316055de321e4354a8dddc61d/teofimo-lopez-shakur-stevenson-weighins.jpg",
    "tag": "Sports",
    "date": "2026-02-01T01:00:59.000Z",
    "description": "\n    \n    \n                    \n                Matchroom Boxing\n            \n            \n    \n        Boxing fans are getting a treat early in the y",
    "body": "\n    \n    \n                    \n                Matchroom Boxing\n            \n            \n    \n        Boxing fans are getting a treat early in the year, with a megafight between Teofimo Lopez Jr. and Shakur Stevenson set for Saturday at New York's historic Madison Square Garden. Lopez's WBO and Ring junior welterweight titles will be on the line as WBC lightweight champion Stevenson moves up in weight.Lopez started his career 16-0 and was unified lightweight champion before a shocking upset loss to George Kambosos Jr. in November 2021. Since that defeat, Lopez has rattled off six consecutive wins, on occasion barely eking out victories against fighters he was expected to handle easily, and at other times looking like the elite fighter he has the tools to be.Follow live updates of Teofimo Lopez Jr. vs. Shakur Stevenson with our live blogStevenson is undefeated in his career, having been unified champion at junior lightweight before moving to lightweight, where he has successfully defended his title three times. The biggest knock on Stevenson has been a tendency to play it way too safe and put in some boring showings despite an extremely high skill level. Stevenson did his best to shake that reputation off in his most recent fight, a dominant showing against William Zepeda in which Stevenson chose to stand toe-to-toe with a dangerous opponent and won nearly every exchange.\nAlso on the card on Saturday, Keyshawn Davis makes his move up to junior welterweight where he takes on Jamaine Ortiz. Davis is coming off a successful run as WBC lightweight champion, but he lost his title on the scales before his scheduled fight last year against Edwin De Los Santos when he missed weight by four pounds. Plus Bruce \"Shu Shu\" Carrington defends his WBC featherweight title against Carlos Castro.Check out how you can watch the action on Saturday night below, but be sure to check out our staff predictions and expert picks for the main event as well.Where to watch Lopez vs. StevensonDate: Saturday, Jan. 31 | Location: Madison Square Garden -- New York Start time: 6 p.m. ETWhere to watch: DAZN PPV | Price: $69.99Fight card, oddsOdds via DraftKings Sportsbook\nShakur Stevenson -300 vs. Teofimo Lopez (c) +230, WBO and Ring junior welterweight titleKeyshawn Davis -700 vs. Jamaine Ortiz +450, junior welterweightsBruce Carrington (c) -800 vs. Carlos Castro +500, WBC featherweight titleWho wins Teofimo Lopez vs. Shakur Stevenson on Saturday, and which pick should you target for a huge payday? Visit SportsLine now to see Josh Nagel's best bets for the Saturday, Jan. 31, super lightweight title bout, all from the combat sports specialist who has covered the sport for more than 20 years, and find out.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Teofimo Lopez vs. Shakur Stevenson: Fight start time, PPV price - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/b27a4755-b744-4ceb-ba17-33927159737a/thumbnail/1200x675/a25a1ad316055de321e4354a8dddc61d/teofimo-lopez-shakur-stevenson-weighins.jpg"
      ],
      "datePublished": "2026-02-01T01:00:59.000Z",
      "dateModified": "2026-02-01T01:00:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]