[
  {
    "title": "How to bet on the Olympics: 2026 Winter Olympics betting guide - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/winter-olympics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/04/fc93b61d-00ae-49ad-a802-b4183da5d723/thumbnail/1200x675/acac6351cdacb2d7e4d77121575b3bb9/milano-cortina-olympics.jpg",
    "tag": "Sports",
    "date": "2026-02-16T12:20:27.000Z",
    "description": "\n        This Olympics betting guide covers where sports bettors can wager on the 2026 Winter Olympics in Italy, along with popular betting markets an",
    "body": "\n        This Olympics betting guide covers where sports bettors can wager on the 2026 Winter Olympics in Italy, along with popular betting markets and select gold medal odds.Where to bet on the 2026 Winter OlympicsHere are some available sportsbook promos new users can receive when signing up for a sportsbook and wagering on the 2026 Winter Olympics.BrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus bets if your bet winsJust click hereFanDuelBet $5, get $100 in bonus bets if your bet winsJust click hereCaesarsFirst Bet Matched up to $250 in bonus bets, Win or Lose CBSSPORTS250BMBetMGMUp to $1,500 in bonus bets back if your first bet losesCBSSPORTSFanatics10 x $100 Bet Match in FanCashCBSFANbet365Bet $5, get $150 in bonus bets instantlyCBSBET365Betting on the Winter OlympicsWith 116 medal events across 16 sports, there's no shortage of action set for the 2026 Winter Olympics. There are a few events that are more popular than others, however, and those make for the most popular bet types. Here's a quick breakdown of some of the more noteworthy games, events, athletes and more that bettors can wager on at sportsbooks.Bet on the Winter Olympics at DraftKings Sportsbook here:Most gold medals/medal countWhile individuals and teams compete for gold in their respective sports and events, countries are also looking for bragging rights when it comes to how often they win. As such, one of the more popular bet types for the Olympics is which country will win the most gold medals. Entering the games, Norway is the odds-on favorite to win the most gold medals in Italy, with Germany, the United States and Canada rounding out the top four in various orders depending on the sportsbook. Norway is -160 to win the most gold medals at DraftKings, as of Feb. 3. The Norwegians took home the most gold medals in the 2022 Winter Olympics as well. There are also over/under betting options for total gold medals won by a country, with Norway's line set at 16.5 and the United States' at 12.5.Ice HockeyArguably the most popular event of each Winter Olympics is ice hockey, with tournaments for both men and women teams.The men's tournament consists largely of star NHL players who will take a break from the professional game to suit up for their respective countries. In fact, this is the first time since 2014 that NHL players will participate in the Olympics. Finland is the defending champion, having won the gold back in 2022 in Beijing. Russia won in 2018 and Canada won in both 2010 and 2014. The United States has medaled just twice since the turn of the century – silver in 2010 and 2002 – and hasn't won gold since the \"Miracle On Ice\" back in 1980. Canada, which won the 4 Nations Face-Off last year, is the betting favorite to win the gold this year at -140, per DraftKings odds as of Feb. 16, followed by the United States (+200), Finland (+1300), and Sweden(+1300). Bettors can wager on the gold medal-winning nation as well as specific games and matchups, and they can also wager on teams to win any medal. Canada is -1000 to earn a medal at DraftKings, the US is -350, and Finland is -115. Bettors can also wager on which nation will win the silver and bronze medals. Other bet types, such as goal spread, the over/under for total goals scored, which teams will advance past the group stage and more are also available for bettors to wager on.Women's ice hockey debuted at the Winter Olympics in 1998, and since then, the United States and Canada have won every gold medal and all but one silver medal. Canada entered 2026 as the reigning champs after winning gold in 2022 over the US, which had won in 2018. Many of the top PWHL players are taking part in this event, and the United States are -330 favorites at DraftKings to win gold. Canada is +225, and the next-closest nation is Sweden at +8000.CurlingAnother popular sport at the Winter Olympics is curling, referred to affectionately as \"chess on ice\" for the importance of strategic short- and long-term planning in matches. There are three formats at the Olympics, with men's and women's tournaments consisting of four-player teams, as well as mixed doubles, where teams consist of one man and one woman. With curling, you can wager on individual matches between two teams, as well as which team will win the gold medal in a specific format. After a three-Olympic run of gold medals between 2006 and 2014, Canada gave way to the United States in 2018 and Sweden in 2022 in the men's competition. Great Britain won gold in the women's event in 2022 after Sweden had won gold in three of the previous four games. Great Britain's men's team is the +137 favorite at bet365 – as of Feb. 16 – to win gold this year, while Sweden's women's team is around +160. Bet on the Winter Olympics at FanDuel here:Winter Olympic OddsHockey, curling and Alpine skiing are hardly the only events taking place at the 2026 Winter Olympics, which means there are plenty of other wagers that bettors can make. The bobsleigh events are always fun to watch, with racers competing to finish with the fastest times in their sleds down a steep ice track, with incredible precision needed as they fly around sharp corners at incredibly fast speeds. One interesting wrinkle with the Winter Olympics is that women have a special \"monobob\" competition, which is where there is just one racer per sled. Typical bobsleigh contests consist of two or four racers per sled. As of Feb. 16, the top contenders in the monobob competition are Germany's Laura Nolte, who is -290 to win gold, per DraftKings odds, while Kaillie Armbruster Humphries is +370.The biathlon is a combination of cross-country skiing and rifle shooting, and Italy's Tommaso Giacomel and France's Eric Perrot are the tied favorites at +425 on DraftKings to win the men's 15km mass start. Just behind the favorites is Strula Holm Laegreid of Norway (+600). Norway, however, is the -140 favorite in the 4x7.5km relay, followed by France (+100) and Sweden (+1500).Bet on the Winter Olympics at BetMGM here:Winter Olympic betting strategyWith so many different events, countries and athletes participating in the 2026 Winter Olympics, there are a ton of different Olympics betting strategies you can choose from.One option is to specialize in one or two sports or events. Here, you could really narrow down your research on fewer events and prioritize wagering there. This strategy could work very well for a hockey fan, for instance, if they follow the NHL and international play closely and/or have seen specific country vs. country matchups, such as Canada winning the 4 Nations Face-Off last year over the United States, Finland and Sweden. In general, it's important to do research before placing wagers. It's a little different with the Olympics, however, given it happens every four years and you don't always have the same participants as the last game. But looking at past success is important for Olympics betting for a few reasons. If a specific athlete or team had success in the past and are competing once again, it stands to reason that they will be competitive once again. On the flip side, however, an athlete or team consisting of older veterans may be on the downslope, so to speak, of their careers and could be at risk of being usurped by younger competitors. As is the case whenever placing wagers, bettors should always shop around for the best lines. If you think that a country is undervalued in a specific event at one sportsbook, try finding longer odds for that nation to win the gold in that sport at a different book. You don't have to place all of your bets at one sportsbook, so shopping around for the best odds and lines is an ideal way to maximize your potential profits. Bet on the Winter Olympics at Fanatics now:Responsible gamingBettors should always practice responsible gaming when placing bets. Utilize responsible gaming tools and resources at sportsbooks, such as deposit and wager limits, activity alerts and, if necessary, timeout or self-exclusion options. Bettors who require more assistance can also find contact information on different sportsbook apps and sites for local and national helplines like 1-800-GAMBLER (call or text 24/7).FAQCan you bet on the Winter Olympics?Yes, you can bet on the Winter Olympics at different sportsbooks on a variety of different events, as well as which country will secure the most gold medals. Which sportsbooks offer betting on the Olympics?Sportsbooks like DraftKings, FanDuel, BetMGM, Caesars, Fanatics and bet365 all offer betting on the Winter Olympics.Where can you find Olympic betting odds?You can find Olympic betting odds at any sportsbook that offers bets on the 2026 Winter Olympics, such as DraftKings, FanDuel, BetMGM, Caesars, Fanatics and bet365.When can I bet on the Winter Olympics?You can place wagers on the Winter Olympics at any time on a variety of different markets, including specific events and which country will win the most gold medals.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to bet on the Olympics: 2026 Winter Olympics betting guide - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/04/fc93b61d-00ae-49ad-a802-b4183da5d723/thumbnail/1200x675/acac6351cdacb2d7e4d77121575b3bb9/milano-cortina-olympics.jpg"
      ],
      "datePublished": "2026-02-16T12:20:27.000Z",
      "dateModified": "2026-02-16T12:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crab Sports promo code for 2026: 100% first bet profit boost up to $500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/crab-sports-promo-code/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/b81e28dd-67f2-4eee-9b3c-04af7e5bb02d/thumbnail/1200x675/c5360f8e749f3d0378ac881b27a202cd/crab-sports.png",
    "tag": "Sports",
    "date": "2026-02-16T10:24:02.000Z",
    "description": "\n        Available for Maryland users only, Crab Sports is fairly new to the sports betting market in the state, having obtained its license to operat",
    "body": "\n        Available for Maryland users only, Crab Sports is fairly new to the sports betting market in the state, having obtained its license to operate in 2023. Though the website and app offer fewer features compared to national competitors, Crab Sports offers a local and homegrown experience for those in the state who prefer it. Claim your Crab Sports promo code here:Despite more limited betting and banking options compared to other sportsbooks, Crab Sports' introductory offer of a 100% first bet profit boost (up to $500) with promo code CBSSPORTS caters more to the smaller players looking to build their initial bankroll. The player can win up to a $500 profit if their first straight, parlay, or Same Game Parlay (SGP) wager hits. We'll analyze the top features of this sportsbook and why Maryland residents and visitors should be interested in playing on Crab Sports.Crab Sports promo code: CBSSPORTS for a 100% first bet profit boostUsing promo code CBSSPORTS, new users have the opportunity to double their winnings via a 100% profit boost up to $500. The new player on Crab Sports must wager a minimum of $25 and a maximum of $500 for this promotion. Regardless of the initial bet, the maximum winnings on this first wager is $500. If the bet loses, no additional first-time deposit bonuses will be awarded.Terms and conditions for this Crab Sports welcome bonusNew players may risk between $25 and $500 on this welcome offer 100% profit boost.All bet types are eligible including straight wagers, parlays, and SGPs.If the first bet wins, the player's winnings will be doubled up to a $500 max profit regardless of the wager.If the first bet loses, the player will receive no additional first-time bonus.The first wager must total at least -125 odds or longer.Must be 21 or older and physically located in Maryland when wagering. Sign up here:How does the Crab Sports promo compare to other sports betting app bonus offers?Crab Sports offers a competitive initial offer for Maryland residents, giving new users the chance to win up to $500 in cash with a successful first bet. Here's how their offer stacks up against the best sportsbook promos from around the industry.SportsbookBonus OfferPromo CodeCrab Sports100% profit boost on first bet up to $500CBSSPORTSDraftKingsBet $5, get $200 in bonus bets if your first bet winsNone requiredFanDuelBet $5, get $100 in bonus bets if your first bet winsNone requiredFanatics10 x $100 Bet Match in FanCash CBSFANBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsFirst Bet Matched up to $250 as a Bonus Bet, Win or LoseCBS20Xbet365Bet $5, get $150 in bonus bets win or loseCBSBET365Types of welcome promosFanDuel and DraftKings offer bet and get offers where the customer must win the first wager to receive the bonus bets (which expire after seven days). bet365 offers a similar bet and get welcome bonus, but the player will receive their bonus bets regardless of the outcome of their initial wager.BetMGM's offer of a no sweat bet up to $1500 essentially gives the customer a do-over if their first bet loses. However, the no sweat bet is paid in bonus bets, so if that second bet hits, the player will not receive the stake, only the winnings.Crab Sports' introductory offer most resembles Caesars, where a 100% profit boost is available to new customers. The difference is that Caesars offers 20 100% profit boosts (with a max. stake of $25 each) while Crab Sports gives new users one chance to go big up to $500.How to sign up for Crab Sports and claim the promo codeThose looking to sign up for CrabSports and claim this offer can follow these outlined steps:1.   Click on the link in this article to begin the process.2.   Click the SIGNUP button to start registration.3.   Fill in your personal details including name, email, address, and date of birth.4.   The next screen will ask for your address and last four digits of your Social Security number.5.   When prompted on the third screen, enter Crab Sports promo code CBSSPORTS.6.   Configure 2 Factor Authentication.7.   Make your first deposit. You can use the various deposit methods including debit card, credit card, or bank transfer.8.   Place your first wager up to $500 to redeem your 100% profit boost. How to place a bet on Crab SportsPlacing a straight wager is relatively straightforward on Crab Sports, with the user needing to click on the sport, game, and market of their choosing before selecting the dollar amount and placing the bet. For parlays and round robins, tabs appear in the betting slip, making this process easy. For SGPs, it's a bit trickier compared to most other sportsbooks. A user must click on the game of choice, followed by the Same Game Parlay option, select multiple plays, and click Add to Betslip before placing the wager. Multiple SGPs are able to be combined into parlays. Get started now:Crab Sports promo and bonuses for existing usersLike most sportsbooks, Crab Sports features promotions for existing users that can enhance the value of their bets. With both profit boosts and no sweat options, there is plenty for Maryland users to enjoy after the initial welcome bonus.Deposit matchesOccasionally, sportsbooks offer deposit matches in which the user must deposit a required amount or more before receiving additional funds via cash or bonus bets. Most sportsbooks will require the deposit + bonus amount to be wagered before requesting a withdrawal. For Crab Sports, after the first bet, all cash winnings may be withdrawn as any no sweat bets aren't considered cash.No Sweat Bet tokensUsers can apply a token where, if the selected bet loses, the player will get a refund in the form of a free bet, which is not redeemable for cash.Boosted OddsGenerally, two-leg Same Game Parlays are where the sportsbook will enhance the odds to make it more enticing to bettors.Profit boosts / SGP profit boostsLike most sportsbooks, Crab Sports offers profit boosts for parlays and occasionally straight wagers. Some profit boosts incentivize adding more legs to the parlay for a greater boost.Crab Sports user experienceThe user experience at Crab Sports is friendly as the sportsbook relies on a simplistic design where the odds pop due to a different color scheme than the rest of the text. The menus are easy to follow and choosing a sport or game is no more difficult than at any other sportsbook. User InterfaceThe design of the site is appealing with several variations of blue mixed with a grey color scheme, with black, white, and blue text. I like that the odds pop on the site, with a larger font and navy-blue text against a grey background. While the design looks a bit antiquated compared to the national competition, I can't say that it's a deterrent by any means from playing on the site.Crab Sports Home Screen LayoutOn desktop, the home screen features rotating banners with promotions and top games for that night. Live betting is prominently featured in the center with the games from around the world currently in play. On the left side, Links, Popular, and All Sports give the user plenty of menu options, as does a bar with each sport's icon towards the top. The My Selections tab on the right is visible throughout so you can see which picks you have selected. Overall, Crab Sports provides a clean look and is easily navigable on computers.On mobile, the home screen shows the sport icons at the very top, followed by rotating banners, and the live games. The menus at the bottom include Home, A-Z Sports, an icon to view your selections, Live, and My Bets. Once again, a very clean design for users and easy to navigate for both new and experienced players.Sportsbook app design, speed, functionalitySimilar to the desktop site, the odds pop on the app with larger navy-blue text against a lighter background. The functionality works similarly to the desktop site and lag doesn't seem to be an issue in my testing. But it's hard to compare Crab Sports' app to the feature-rich national brands such as DraftKings and FanDuel.For players who know what they want to bet when coming to the site, Crab Sports provides a fine experience. But if you're looking to browse random odds and categories, you have to go game-by-game at Crab Sports vs. menu items showing all games on several other sites.Geolocation issues can be common on any sportsbook app, but in most cases, has not been a major complaint of Crab Sports customers thus far. Sign up here:Crab Sports app vs. desktop site (ratings as of February 16, 2026)App store ratings·   \tApple App Store (iOS): 4.2/5 stars (246 reviews)·   \tGoogle Play (Android): 3.7/5 stars (65 reviews)Variety of sports & betting markets on Crab SportsSportMarkets OfferedBaseballMoney lines, run lines, totals, props, futuresBasketballSpread, money lines, totals, props, futuresBoxingMoney lines, moneyline 3-way, method of victory, round betting, go the distanceCyclingWinner, futuresDartsMoney lines, match betting, legs, correct score, 180sEsportsMoney lines, spreads, totals, correct scoreFloorballMoney lines, spreads, totals, correct scoreFootball (American)Money lines, point spread, totals, props, futuresGolfFutures, head-to-heads, propsHockey (Ice)Money lines, point spread, totals, props, futuresHorse / EquestrianMoney lines, top finishesLacrosseMoney lines, point spread, totals, props, futuresMMA / Combat SportsMoney lines, futures, winning method, round totalsMotor RacingFutures, winner, props, specials, finishing positionRugbyMoney lines, point spread, totals, props, futuresSkiingMoney lines, top finishes, futuresSnooker / PoolMoney lines, top finishes, futuresSoccerMoney lines, Asian Handicap, goal spreads, totals, props, futuresTable TennisMoney lines, spreads, set betting, total points, correct scoreTennisMoney lines, set betting, correct score, total match games, futures, totalsVolleyballMoney lines, spreads, set betting, total points, correct scoreQuality of oddsIn terms of the standard money line, spread, and totals, Crab Sports is comparable to most other sportsbooks. When it comes to props, though, the selections are much fewer compared to the larger sportsbooks, which allow more customization as compared to just over/under a set yardage or hits total for example.The Same Game Parlay builder seems like a first-generation version of what we see on the likes of DraftKings, FanDuel, and Fanatics now and can be tedious. You must click on the builder before adding SGP picks, which is a feature of the past on most books. There have been customer reviews stating that live betting cashout offers don't compare favorably to most other sportsbooks, with early cashout offers seemingly lower than other books.Crab Sports key betting featuresCrab Sports offers many of the same betting features found in most apps, including:Early CashoutWhile its offers are not as financially friendly as some of the larger sportsbooks, Crab Sports does offer the ability for users to get out of eligible bets before their conclusion with a profit or loss.Live BettingCrab Sports gives Maryland users the opportunity to bet during just about any sporting event while in progress. Odds changes are easy to note with green and red arrows upon any line movement.SGP generationNot only can users create SGPs, they may parlay multiple SGPs, albeit each one must be created separately. For eligible games, a Same Game Parlay button appears which must be selected before options are chosen.How to track your bets on Crab SportsOn desktop, the My Selection tab on the right side of the page makes it easy to follow along with your bets. The My Bets tab allows you to view your existing wagers. On the app, the icon of a ticket in the center at the bottom makes it easy for players to make their selections. To track selections on the app, My Bets on the bottom right is the place to click.Crab Sports customer supportIn addition to comprehensive help, rules, and FAQ pages, users with an issue may email support@crabsports.com, with the response time usually within an hour or two. Crab Sports does not feature a live chat as most other sportsbooks offer.Crab Sports responsible gaming toolsAt the bottom of the page on both desktop and mobile, users can click on the Responsible Gambling section.The sections on that page's FAQ include:How to play responsiblyWhat is Problem Gambling?What support is available?What tools can you use to manage your gambling?Voluntary ExclusionUnderage GamblingLinks on the page for gambling help resources include:MD Gambling HelpMD Problem GamblingMD LotteryMaryland State Lottery & Gaming Control AgencyNational Council on Problem GamblingGamblers AnonymousGam-AnonInternational Center for Responsible Gaming988 Suicide & Crising Lifeline Crab Sports banking methodsCrab Sports offers a number of ways for customers to deposit and withdraw money.Deposit methodsThese deposit methods are available for most users.Quick deposit methodsFeesProcess timeMin. depositOnline Banking (via Plaid)$0Instant$10Debit Card (VISA, Mastercard, Discover)$0Instant$10Credit Card ((VISA, Mastercard, Discover)$0Instant$10Withdrawal methodsHere are the primary ways to withdraw money at Crab Sports.Withdrawal optionProcess TimeMax withdrawalOnline Banking (via Plaid)1-2 business daysUnknownDebit Card (VISA, Mastercard, Discover)1-2 business daysUnknownCrab Sports review: Final verdictFor Maryland users, Crab Sports is a fine alternative to the national sportsbooks. The design is simplistic but the interface is easy to use. If you're looking for the bells and whistles of additional menus, a search function, and more individual player betting options, then this isn't the right sportsbook for you. But if you're located in the state and want to take advantage of the generous signup offer, Crab Sports is worth a long look.The app works well and betting pregame or during the live action is easy. Betting SGPs is slower than at other sportsbooks, but at least it is still possible. There are limited options for deposits / withdrawals and the customer support is only via email. This sportsbook does not offer a rewards program as of now. Nonetheless, I recommend giving Crab Sports a shot if you're in Maryland.Honest feedback for how Crab Sports can improveEnhance Same Game Parlay betting: Compared to other sportsbooks, betting SGPs is slow. Clicking on multiple lines / props from the same game should automatically trigger an SGP, whereas now it only works if you press a specific button.Offer more menus for betting selected markets: Similar to BetMGM who also falls short in this category, Crab Sports should create menus so users don't have to click on each game separately to add a certain market.More deposit and withdrawal options: It seems almost standard that options such as PayPal and Venmo, which allow seamless money transfers, should be allowed at every sportsbook. This is a necessary addition in due time for Crab Sports.Crab Sports FAQHow do you get the Crab Sports promo?Use promo code CBSSPORTS on the third page of the registration screen and deposit up to $500 to receive a 100% profit boost on your first wager.How long do Crab Sports withdrawals take?Generally 1-2 business days, if not faster for withdrawals via debit card and online banking.Can you cash out bonus bets on Crab Sports?No, all bonus bets must be played through before attempting to redeem them for cash.How do you contact Crab Sports?Email support@crabsports.com with any questions or inquiries.Do you need a promo code for Crab Sports?Yes, use promo code CBSSPORTS when initially signing up.Does Crab Sports have a good rewards program?To date, there has been no mention of a rewards program for Crab Sports.Where is Crab Sports available?You may only play on Crab Sports if you're physically located in Maryland and are 21 years of age or older.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crab Sports promo code for 2026: 100% first bet profit boost up to $500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/b81e28dd-67f2-4eee-9b3c-04af7e5bb02d/thumbnail/1200x675/c5360f8e749f3d0378ac881b27a202cd/crab-sports.png"
      ],
      "datePublished": "2026-02-16T10:24:02.000Z",
      "dateModified": "2026-02-16T10:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Borgata Promo Code: Bet $20 & Get $100 in Bonus Bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/borgata-promo-code/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/27/39cd82fe-9afa-4218-b587-802e92ced40e/thumbnail/1200x675/5ebbce03cdf31de8876f1660f377e33b/borgata-promo-code-and-review.jpg",
    "tag": "Sports",
    "date": "2026-02-16T10:15:33.000Z",
    "description": "\n        The latest Borgata Sportsbook promo code unlocks for New Jersey players a bet $20, get $100 in bonus bets welcome offer. While there are many",
    "body": "\n        The latest Borgata Sportsbook promo code unlocks for New Jersey players a bet $20, get $100 in bonus bets welcome offer. While there are many national brands in the sports betting space, there's always something nice about having a local product for local users. And for sports bettors in the state of New Jersey, that local product is Borgata Sportsbook, available exclusively to New Jersey users. In this review, we'll walk you through Borgata Sportsbook, its features, and overall user experience for bettors looking to wager on sports in New Jersey for NHL, NBA and college basketball.While Borgata Sportsbook is only available in New Jersey, users in NJ and Pennsylvania can access Borgata's online casino.Borgata promo code review and detailsAs of February 2026, new customers at Borgata Sportsbook can receive $100 instantly in bonus bets when they create an account and place a first wager of at least $20 on any game. The $100 in bonus bets may be used to place another bet at Borgata Sportsbook, may not be withdrawn or cashed out by participants, and are forfeited when used to place another bet. Bonus Bets expire within seven days of being acquired.  Borgata Sportsbook promo terms & conditions Borgata Sportsbook's new user promo is available to users who have never created a Borgata account beforeNew users must be 21 or older and located in the state of New JerseyBonus bets will be received upon a first wager of at least $20Bonus bets will expire after seven daysBonus bets cannot be withdrawn or cashed out and are forfeited when used to place another bet.Bonus bets are lost if bets placed with such credits do not win. How does the Borgata promo compare to other sportsbook promos? By comparison, here is a look at some of the best sportsbook promos offered by national sportsbook brands. SportsbookBonus offerPromo codeBorgataBet $20, Get $100 in bonus bets instantly \t\t\t\t \t\t\t\tCBSB100FanDuel \t\t\t\t \t\t\t\tBet $5, Get $100 in bonus bets if your first bet wins \t\t\t\t \t\t\t\tNo code required \t\t\t\tDraftKings \t\t\t\t \t\t\t\tBet $5, get $200 in bonus bets if your first bet winsNo code required \t\t\t\tBetMGM \t\t\t\t \t\t\t\tUp to $1,500 in bonus bets back if your first bet loses \t\t\t\t \t\t\t\tCBSSPORTS \t\t\t\tCaesars \t\t\t\t \t\t\t\tFirst Bet Matched up to $250 as a Bonus Bet Win or Lose \t\t\t\t \t\t\t\tCBS250BMFanatics \t\t\t\t \t\t\t\t10 x $100 Bet Match in FanCash CBSFANbet365 \t\t\t\t \t\t\t\tBet $5, Get $150 in bonus bets win or loseCBSBET365 \t\t\t\t \t\t\t\t Types of welcome promos  The welcome promo offered to new Borgata Sportsbook customers is a conditional \"bet-and-get\" style promo. With these types of  promotions, you generally need to place a bet of at least a certain  amount to receive a certain amount of bonus bets, but in this case, there is no condition of winning the initial bet, as is the case at some sportsbooks. These welcome promos are  considered to be geared towards beginners or smaller bettors, and they're a great way to maximize the winnings and satisfaction of the user's initial experience. These welcome promos are considered to be geared towards beginners or smaller bettors, and they're a great way to maximize the winnings and satisfaction of the user's initial experience. The FanDuel promo code, DraftKings promo code, Caesars promo code and bet365 bonus offer all follow this format.The BetMGM bonus code  follows the \"first bet offer\" style of promo. You can bet up to $1,500  on your first bet and get it back as bonus bets if you lose.The Fanatics Sportsbook promo code  has its own unique structure. Bet insurance is FanCash back if your wager loses, but instead of having the insurance only apply to your first  bet with the sportsbook, Fanatics gives you bet insurance in FanCash on one wager each day for 10 consecutive days after account creation, up to $200 in FanCash per day. That's up to $2,000 in total FanCash after 10 days.  How to sign up for Borgata Sportsbook and claim the promo (Note: Borgata Sportsbook is currently only available to users in the state of New Jersey.) Click the CLAIM BONUS button on this page and download the Borgata Sportsbook app or click hereSign up and register your accountDeposit at least $20 into your accountPlace your first wager of at least $20Receive $100 in bonus bets instantly How to place a bet on Borgata Sportsbook Betting on Borgata Sportsbook is a simple and straightforward process that resembles most other major sportsbooks. Simply select a bet that you want to wager on, and it'll instantly appear on your betslip where you can then enter the amount of money you want to wager.  Let's suppose I want to bet on Christopher Bell to win this weekend's NASCAR race at +1000 odds. If I choose to place Bell on my betslip, I'll then be given the opportunity to place my wager (In this case, a $10 bet would pay me $100 if Bell wins) and file my bet. The whole process is easy and, quite frankly, foolproof.  Additional promos and bonuses In addition to the welcome promo we've covered, Borgata Sportsbook also offers its existing users several offers and promotions. Best promos for existing users this weekNHL Hat Trick Jackpot: Opt in to the Hat Trick Jackpot promotion and place a $10+ anytime goal scorer bet, up to one eligible bet per game. If your player scores 3+ goals during that game, you'll win a share of $10,000 in Bonus Bets.NHL No Sweat Token: Get bonus bets back if your hockey wager loses. Any Sport Parlay Boost: Boost your potential payout on a winning parlay in any sport.   Cash Out Feature Whether you place a straight bet or parlay, Borgata Sportsbook offers you the option of cashing out early and collecting your winnings even when the final outcome of the bet has yet to be determined. The amount that can be collected is based on the current results of the game, and this can be a useful feature considering how quickly things can change in any given sport.  Daily Odds Boost With the daily odds boosts offered by Borgata Sportsbook, you can place bets at a slightly enhanced price, maximizing your potential winnings at no additional out-of-pocket cost. Borgata Sportsbook user experience Much like other sportsbooks in the industry, Borgata Sportsbook offers an intuitive user experience that makes betting easy, whether through their app or through their desktop site. As part of Borgata Online's overall casino, the desktop site gives users easy access to the other gaming options offered by Borgata, including casino games, arcade games, poker and more. Naturally, Borgata's betting markets include football, baseball, basketball and hockey in addition to other sports like soccer, tennis, and MMA. But there's a great deal of sports to bet on beyond that, including Aussie Rules football, badminton, biathlon, boxing, cricket, cycling, darts, golf, handball, lacrosse, NASCAR, Formula 1 and other motorsports (including IndyCar, NHRA, etc.), rugby league, rugby union, snooker, softball, table tennis and volleyball.Borgata app design, speed, functionalityThe Borgata Sportsbook app offers a streamlined, user-friendly betting experience designed for both casual and seasoned bettors. It features an intuitive interface with quick navigation to popular markets, live betting options, and regularly updated odds. The app's integration with Borgata's rewards program allows users to earn points with every wager, which can be redeemed for bonuses or perks at Borgata properties.Performance is generally smooth, with fast load times and minimal lag, and the app supports secure payment options for deposits and withdrawals. Overall, it delivers a polished mobile experience that mirrors the brand's reputation for quality in the betting space.Borgata app vs. desktop site (ratings as of February 16, 2026)Apple App Store (iOS): 4.7/5 stars (2,509 reviews)Google Play (Android): 3.9/5 stars (127 reviews)While the Borgata Sportsbook app and the Borgata website provide access to the same betting markets, odds, and promotions, the main difference lies in convenience and layout. The app is optimized for mobile use, allowing bettors to place wagers quickly from anywhere and receive instant push notifications for score updates or bet results.The betting site, on the other hand, offers a more expansive view of available markets and is better suited for in-depth browsing, especially when managing multiple bets or exploring detailed statistics on a larger screen.In essence, the app prioritizes portability and speed, while the website offers a more spacious, desktop-friendly betting environment.   Borgata Sportsbook responsible gambling tools Borgata Sportsbook offers GameSense as a resource to its users, outlining ways to make sure gambling remains a fun activity while also offering help for those struggling with a gambling problem. In promoting responsible gambling, Borgata Online has adopted the following principles: Gambling should be a fun activity and enjoyed as a form of entertainment. Borgata Online is committed to embedding Responsible Gambling across all Company activities. Borgata Online recognizes that, while the vast majority of individuals  are able to enjoy gambling in a responsible and healthy way, some  individuals unfortunately experience problems related to their gambling. Borgata Online believes in the power of informed choice to prevent  gambling-related harm, and provides responsible gambling tools,  responsible gambling information, odds, and resources to empower its  customers to make appropriate choices related to their gambling.Borgata Online stands by its customers and will make every reasonable  effort to assist those who are experiencing gambling-related problems. Borgata Online believes in a shared responsibility approach to  addressing problem gambling and is committed to working with government,  academia, problem gambling treatment and advocacy groups, the  communities in which we operate, and our customers to promote  responsible gambling and address problem gambling. Borgata Online is committed to evaluating and continuously improving its responsible gambling program and initiatives.Borgata Sportsbook offers several national and state resources for problem gambling, including the New Jersey Problem Gambling Hotline at 1-800-GAMBLER.  Borgata Sportsbook banking methods Here is a look at the deposit and withdrawal methods available for users at Borgata. While there are reviews for both deposits and withdrawals, users should see their transactions processed within the given times. Deposit MethodDeposit TypePayment Processing TimeVisaVisa Fast Funds - Debit card/Prepaid cardWithin 30 minutesMastercardMastercard Send - Debit cardWithin 30 minutesPayPaleWalletWithin 30 minutesVenmoeWalletWithin 30 minutesApple PayeWalletWithin 30 minutesVIP PreferredBank TransferWithin 30 minutesOnline BankingBank TransferWithin 30 minutesInstant BankingBank TransferWithin 30 minutesPlay+ PrepaidCardPrepaid CardWithin 30 minutesBorgata Casino cageCashInstantlyWithdrawal MethodWithdrawal TypePayment Processing TimeVisaVisa Fast Funds - Debit card/Prepaid cardWithin 24 hoursMastercardMastercard Send - Debit card1-3 business daysPayPaleWalletWithin 24 hoursVenmoeWalletWithin 24 hoursApple PayeWallet1-3 business daysVIP PreferredBank Transfer2-4 business daysOnline BankingBank Transfer2-4 business daysInstant BankingBank Transfer2-4 business daysPlay+ PrepaidCardPrepaid CardWithin 24 hoursBorgata Casino cageCashWithin 10-12 hoursCheck by Mail - applicable in NJCheck7-21 business daysBorgata Sportsbook FAQ How do you get Borgata Sportsbook's promo? After registering for a Borgata Sportsbook account, deposit and make a bet of at least $20 to instantly receive $100 in bonus bets with promo code CBSB100.  Where is Borgata Sportsbook available? Borgata Sportsbook is currently available exclusively to users in the state of New Jersey.  How can you contact Borgata Sportsbook? Borgata Sportsbook offers a 24/7 customer support chat, and you may also email Borgata Sportsbook via their website.  Who owns Borgata Sportsbook? Borgata Sportsbook is a property of BetMGM. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Borgata Promo Code: Bet $20 & Get $100 in Bonus Bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/07/27/39cd82fe-9afa-4218-b587-802e92ced40e/thumbnail/1200x675/5ebbce03cdf31de8876f1660f377e33b/borgata-promo-code-and-review.jpg"
      ],
      "datePublished": "2026-02-16T10:15:33.000Z",
      "dateModified": "2026-02-16T10:15:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami University's NCAA Tournament selection scenarios: Can Redhawks get in with one loss? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-miami-universitys-ncaa-tournament-selection-scenarios-redhawks-bracketology/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/c207dccd-1ea4-4d8c-ad40-9e57285e5317/thumbnail/1200x675/0bb6420519f5df22ccb2a9a381c2bb4c/usatsi-28234082.jpg",
    "tag": "Sports",
    "date": "2026-02-16T16:25:28.000Z",
    "description": "\n        It's important to draw a distinction between resume metrics and predictive metrics when talking about a team like Miami University and the NC",
    "body": "\n        It's important to draw a distinction between resume metrics and predictive metrics when talking about a team like Miami University and the NCAA Tournament bubble. Selection decisions are closely tied to your resume and what you've accomplished, which is a good thing for Miami. The cries are already coming: \"but Miami hasn't even played a Quad 1 game.\"Despite the fact that it has played zero Quad 1 games and is just 2-0 in Quad 2, there is a metric on official NCAA team sheets that acknowledges the brilliance of Miami's 25-0 start.It's called Wins Against Bubble (WAB), and it calculates how the average bubble team would perform against your schedule. With a 1.92 WAB, the Redhawks are recognized for having nearly two more victories than the average bubble team would against their slate.If Miami doesn't win the MAC Tournament and needs an at-large ticket to the Big Dance, WAB will be one of its best friends. The Redhawks rank No. 34 in WAB entering Tuesday night's game at UMass, which appears to be the most challenging of six regular season games left on their slate. That's within at-large territory. Where it gets tricky is that any loss against MAC opposition carries a significant WAB penalty.\nHere are all the Selection Sunday scenarios for Miami as it heads down this the stretch with its first NCAA Tournament appearance since 2007 in sight.NCAA Tournament selection scenarios for Miami UniversityThe simple scenario (win MAC Tournament) Record: Between 28-6 and 34-0 Confidence level: It's a partyLikely WAB range: Doesn't matterBust out the balloons and hire a caterer for the watch party. Miami can go 6-0 to close the regular season, 0-6 or something in between. It doesn't matter, so long as the Redhawks are cutting down the nets inside Cleveland's Rocket Arena at the end of the MAC Tournament on March 14. \nWinning the MAC Tournament is the only 100% guaranteed path to the Big Dance, and it won't be easy. The MAC isn't one of the handful of conferences now offering automatic byes to the semifinals for its top two seeds. The Redhawks will have to win three games in three days against a field consisting exclusively of the league's top eight teams.Many of the players on this Miami team were part of a gutting 76-74 loss to Akron in last year's MAC Tournament title game in which the Zips rallied late to stun the Redhawks. That should only provide more motivation as Miami seeks its first conference tournament title since 2007.\n        \n            \n                Bracketology: Iowa State vs. Houston game will impact No. 1 seed race for NCAA Tournament\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nThe MAC Madness scenarioSelection Sunday record: 31-1, 32-1 or 33-1Confidence level: optimisticLikely WAB range: 35-43\nMiami could still feel reasonably hopeful about making the Big Dance if it entered the MAC Tournament 31-0 and then dropped a game. While on some level it could matter who the loss came against, the Redhawks would still enter Selection Sunday with a WAB ranking in the at-large realm, regardless of who was responsible for handing them their first defeat.A loss on a neutral floor in the MAC Tournament would likely come with a WAB cost of around 0.80. If Miami lost 0.80 in WAB today, it would drop the Redhawks from No. 34 in the metric to No. 42.The team with the best WAB ranking left out of last year's field was West Virginia, which arrived at Selection Sunday at No. 43 in the WAB. The 2025 selection process was the first to utilize WAB, so there isn't a trove of past precedents to rely upon. But WVU's exclusion last year sets a benchmark for Miami to aim for: don't fall to No. 43.\nFinishing the regular season undefeated and then losing in the MAC Tournament would likely be good enough to keep the Redhawks in the upper 30s or lower 40s of WAB, which would be enough for them to enter Selection Sunday with some cautious optimism.Double defeat scenarioSelection Sunday record: 30-2, 31-2 or 32-2Confidence level: nervousLikely WAB range: 43-52The double defeat scenario involves Miami losing one regular-season game, in addition to a MAC Tournament game. \nThis would not be advisable, as it would likely lead to Miami's Selection Sunday WAB ranking landing in the mid-40s, at best. However, in this scenario, the opponent for the conference tournament loss could make a difference. If it's a high-end Quad 2 loss against Akron in the title game, then it would be less costly.The team with the worst WAB ranking selected to last year's field was Xavier, which was among the Last Four In at No. 49 in WAB. However, the Musketeers counterbalanced their lagging resume metrics with a predictive metrics profile hovering around 40th nationally. Miami University does not have good predictive metrics to fall back upon. So slipping out of the low-to-mid 40s in WAB would make things dicey. If Miami loses twice, a slip of that magnitude is likely, and it would make Selection Sunday uncomfortable.\nThree-loss scenarioSelection Sunday record: 29-3, 30-3, 31-3Confidence level: bracing for disappointmentLikely WAB range: 50-60A 4-2 finish to the regular season, combined with a loss in the MAC Tournament, would decimate Miami's at-large chances. In this scenario, the best conceivable outcome would be that the Redhawks lose in the MAC Tournament title game against Akron in a heartbreaking way that tugs on the heartstrings of committee members. But it would be a tough case to make. With three losses on its ledger, Miami would almost certainly lag behind other bubble teams in resume metrics. Remember, it's not just about win-loss record. It's about the totality of your resume. WAB does a good job of quantifying that, and it wouldn't be on Miami's side if the Redhawks lost three times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami University's NCAA Tournament selection scenarios: Can Redhawks get in with one loss? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/c207dccd-1ea4-4d8c-ad40-9e57285e5317/thumbnail/1200x675/0bb6420519f5df22ccb2a9a381c2bb4c/usatsi-28234082.jpg"
      ],
      "datePublished": "2026-02-16T16:25:28.000Z",
      "dateModified": "2026-02-16T16:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Belichick betting big on transfer QBs at UNC as FCS standout joins loaded room - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/bill-belichick-qb-shakeup-north-carolina-taron-dickens-transfer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/72110ca1-9ce8-40b3-8577-536429453846/thumbnail/1200x675/f2670fcdbf8918e322a6bdbba6152fcb/bb2.png",
    "tag": "Sports",
    "date": "2026-02-16T16:24:39.000Z",
    "description": "\n        In an effort to revamp North Carolina's offense ahead of the 2026 season, Bill Belichick has added to his quarterback room, landing his third",
    "body": "\n        In an effort to revamp North Carolina's offense ahead of the 2026 season, Bill Belichick has added to his quarterback room, landing his third transfer this cycle in Western Carolina's Taron Dickens. An FCS record-breaker for the Catamounts, Dickens joins Maryland's Billy Edwards and Texas A&M's Miles O'Neill in Chapel Hill as new additions at quarterback following a position overhaul and hiring Bobby Petrino as offensive coordinator. Dickens set an FCS record during a win over Wofford last season with 46 consecutive completions during a 53-of-56, 378-yard, three-touchdown performance. His 94.6 completion percentage was also the highest completion percentage in a game in FCS history.One of the most exciting players in the country who flew under the radar a bit given his stance in the FCS ranks, Dickens finished runner-up in final Walter Payton Award voting, which is given to the FCS offensive player of the year. Dickens threw for 3,508 yards, 38 touchdowns and two interceptions over nine starts with a 74.2% completion rate -- eye-popping numbers that led to his portal intentions in November.The 5-foot-11, 180-pound Miami native was rated as three-star transfer by 247Sports and will be one of five scholarship quarterbacks vying for the starting job in the spring for the Tar Heels. North Carolina went 4-8 last season in Belichick's first campaign with inconsistent quarterback play, leading to three signal callers leaving the program for the portal: Gio Lopez (Wake Forest), Bryce Baker (Virginia Tech) and Max Johnson (Georgia Southern).\nBelichick fired offensive coordinator Freddie Kitchens in December as part of sweeping changes made to his coaching staff after a disappointing debut. Petrino's tempo-driven spread system should provide the Tar Heels with explosive play opportunities and his track record for developing quarterbacks at various career stops is notable.\n        \n            \n                College football first-year coach grades: Bill Belichick gets 'D' after rough season at North Carolina\n                \n                    John Talty                \n            \n                            \n    \n                \n                    \n    \nNorth Carolina opens spring practice March 4 with what's expected to be a wide-open quarterback competition. Edwards started at Maryland during the 2024 season, finishing with 2,881 yards and 15 touchdown passes before tearing a ligament in his knee during last season's opener.O'Neill served as Texas A&M's backup to College Football Playoff-bound Marcel Reed and played sparingly last fall. The Tar Heels also welcome early enrollee Travis Burgess and bring back 2025 signee Au'Tori Newkirk.\nBelichick betting on transfer QBsIt's not hyperbole to say the Tar Heels were anemic offensively last season. North Carolina ranked 119th nationally in scoring (19.3 points per game), 129th in total offense (288.8 yards per game) and 97th in third-down conversions (36.9%).The addition of Dickens provides Petrino with another talent to assess at quarterback next month and beyond as the Tar Heels determine a depth chart ahead of 2026. Five of Petrino's former quarterbacks have been drafted, most notably Lamar Jackson (Louisville), and there's a chance he adds another with Taylen Green (Arkansas) in April.Arkansas ranked fourth in the SEC in total offense last season under Petrino's tutelage at 454.8 yards per game and fifth in scoring (32.9 points). Green rushed for 777 yards and eight touchdowns, continuing what has become a staple strength of Petrino-coached schemes -- mobility at the quarterback position.\nDickens showed escapability last season at Western Carolina and could be answer to the Tar Heels' money-down woes if he wins the job. Individual top-end performances for Dickens last season included a 624-yard, six-touchdown outing against Samford and 551 yards passing along with seven scores against Mercer.Dickens is presumably the last of 20 transfers this cycle for the Tar Heels, who have 51 new players overall with a roster in transition. Belichick said last month that North Carolina will have considerably more \"continuity\" in 2026 thanks to several returning talents and expects improvement in Year 2 with better communication, training and technique.The upside at quarterback depends largely on Edwards' knee, Dickens' transition to the ACC and what North Carolina brings with its offensive line. When he was healthy as Maryland's starter as a junior in 2024, Edwards finished second in the Big Ten in passing yards per game, including a 373-yard performance during a win over USC -- and that came behind a front that ranked near the bottom of the conference.\nMuch like the quarterback depth chart, North Carolina's offensive line two-deep will be all new through the portal and 2026 signing class. The rebuild will be fast-tracked this spring, and Belichick hopes Petrino and his new crop of signal callers can make it happen.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Belichick betting big on transfer QBs at UNC as FCS standout joins loaded room - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/72110ca1-9ce8-40b3-8577-536429453846/thumbnail/1200x675/f2670fcdbf8918e322a6bdbba6152fcb/bb2.png"
      ],
      "datePublished": "2026-02-16T16:24:39.000Z",
      "dateModified": "2026-02-16T16:24:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dolphins to release Bradley Chubb, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-bradley-chubb/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/fd621b9d-828c-47d5-814f-d69c8628eb28/thumbnail/1200x675/27417b469199424eabde080e1d44730b/chubb.jpg",
    "tag": "Sports",
    "date": "2026-02-16T15:13:50.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Dolphins' new front office faces some to",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Dolphins' new front office faces some tough decisions with the inherited roster. One is pass rusher Bradley Chubb, whom the franchise decided to release, according to NFL Media. Chubb, who turns 30 in June, had two more years remaining on his contract, and carried cap hits north of $31.2 million in both 2026 and 2027, according to Spotrac. An immediate release saves Miami $7,343,500 in 2026, but comes with a $23,859,239 dead cap hit. If Chubb is given the post-June 1 designation, the $23.8 million dead cap hit would be spread over 2026 and 2027.The Dolphins traded for Chubb during the 2022 season, sending the Denver Broncos a first-round pick, a future fourth-round pick and running back Chase Edmonds for his services. Miami also received a future fifth-round pick in the deal. In Chubb's first full season with the Dolphins in 2023, he recorded a career-high 73 combined tackles, 11 sacks, 22 QB hits and tied for the league lead with six forced fumbles before suffering a torn ACL in Week 17. He sat out the 2024 season to recover, and returned in 2025 to record 47 tackles, 8.5 sacks and 20 QB hits. Miami reportedly received trade calls for Chubb during this year's trade deadline, but decided to deal pass rusher Jaelan Phillips instead. It's worth mentioning that Miami \"mutually parted ways\" with general manager Chris Grier just days before the Nov. 4 deadline.\nThe former No. 5 overall pick out of NC State recorded 48 sacks over 90 career games, and should have a market now that he's a free agent. With the Dolphins coming to a decision on Chubb, all eyes turn to quarterback Tua Tagovailoa, and what Miami will decide to do with him. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dolphins to release Bradley Chubb, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/fd621b9d-828c-47d5-814f-d69c8628eb28/thumbnail/1200x675/27417b469199424eabde080e1d44730b/chubb.jpg"
      ],
      "datePublished": "2026-02-16T15:13:50.000Z",
      "dateModified": "2026-02-16T15:13:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/14/3f7b9eec-6993-4521-871f-ce74b95d3edf/thumbnail/1200x675/6fe0cabefabb5eb1bc7cc48602fb8c51/stolz-gold-getty.png",
    "tag": "Sports",
    "date": "2026-02-16T13:23:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA will try to improve upon those numbers in 2026, and they have some golden opportunities to do just that. Both the men's and women's hockey team should be in the running for a gold medal, Jordan Stolz is a favorite in speed skating, Chloe Kim is hitting the halfpipe in snowboarding and Mikaela Shiffrin will once again be on the ski slopes. And figure skaters Alysa Liu and Ilia Malinin have high potential to reach the podium.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Norway has won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    127726\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    841022\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    65112\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    58417\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    55111\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    47415\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    46615\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    46313\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    4239\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    35917\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    3115\n            \n        \n    \n        GBR\n    \n    \n        Great Britain\n    \n\n    3003\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    2204\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    2114\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    14510\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    1236\n            \n        \n    \n        BRA\n    \n    \n        Brazil\n    \n\n    1001\n            \n        \n    \n        KAZ\n    \n    \n        Kazakhstan\n    \n\n    1001\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    0224\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0213\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0112\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0112\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0033\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/14/3f7b9eec-6993-4521-871f-ce74b95d3edf/thumbnail/1200x675/6fe0cabefabb5eb1bc7cc48602fb8c51/stolz-gold-getty.png"
      ],
      "datePublished": "2026-02-16T13:23:55.000Z",
      "dateModified": "2026-02-16T13:23:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026 schedule: Where to watch Team USA play Sweden in women's hockey - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/b219a2c7-f296-4c46-885c-f011d7ce05e9/thumbnail/1200x675/ed6f34f3471fff298efcf2f9209efc08/untitled-design-2026-02-15t163139-257.png",
    "tag": "Sports",
    "date": "2026-02-16T00:45:37.000Z",
    "description": "\n\n\n    \n                                    Plus, there's more round-robin curling action and several ski jumping medal events\n        \n              ",
    "body": "\n\n\n    \n                                    Plus, there's more round-robin curling action and several ski jumping medal events\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                            \n                            \n    Feb 15, 2026\n                            \n                    at\n    7:43 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Monday's action at the 2026 Milan Cortina Olympics features six medal events, the women's hockey semifinals and a big day for speed skating.The headliner for the United States on Monday is the women's hockey team, which faces Sweden in a semifinal matchup. The U.S. cruised through its preliminary-round games, racking up a 15-1 goal differential across three games, and carried that over in a 6-0 quarterfinal win over Italy. Five different players found the net for the U.S. against the hosts, with Kendall Coyne doing so twice.The U.S. women's curling team, meanwhile, will look to continue its strong showing in round-robin play against Italy. The U.S. is currently second behind Sweden, with the top four teams advancing to the semifinals.\nAlso, medals will go out in the figure skating pair skate, where two U.S. pairs enter the free skate with work to do to get on the podium after Sunday's short program. \n        \n            \n                2026 Winter Olympics medal count: Keep track of Team USA's quest for gold in Italy\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nThe Milan Cortina Games will run through Sunday, Feb. 22, and in total of 119 events will take place with 245 medals handed out to the athletes. Fans can find the action on NBC and their streaming service Peacock, with an account or a cable login.\nThe Winter Games have eight main sports, with 16 disciplines. With so many events to keep up with, it can get overwhelming, but that's where we step in with the overall medal tracker and daily schedule.Winter Olympics schedule for Monday, Feb. 16SportEventTimeMedal Event?CurlingWomen's Round Robin: Sweden vs. Switzerland, China vs. Canada, Denmark   vs. Great Britain3:05 a.m.NoAlpine   SkiingMen's   Slalom Run 14   a.m.NoBobsledMen's   2-man Heat 14   a.m.NoSpeed   SkatingWomen's   1,000m quarterfinals5   a.m.NoSpeed   SkatingMen's   500m heats5:17   a.m.NoBobsledMen's   2-man Heat 25:57   a.m.NoSpeed   SkatingWomen's   1,000m semifinals5:57   a.m.NoSpeed   SkatingWomen's   1,000m Final6:47   a.m.YesAlpine SkiingMen's Slalom Run 27:30 a.m.YesCurlingMen's Round Robin: Great Britain vs. Norway, Czechia vs.   Canada, Sweden vs. Germany, Italy vs. China8:05 a.m.NoIce HockeyWomen's Semifinals: United States vs.   Sweden10:40 a.m.NoSki JumpingMens Super Team - Trial Round12:00 p.m.NoBobsledWomen's Monobob Heat 31 p.m.NoCurlingWomen's Round Robin: United States vs.   Italy, Korea vs. China, Switzerland vs. Great   Britain, Japan vs. Canada1:05 p.m.NoFreestyle SkiingWomen's Big Air Final1:30 p.m.YesSki JumpingMen's Super Team - 2nd Round1:50 p.m.NoFigure SkatingPair Skating - Free Skating2 p.m.YesSki JumpingMen's Super Team - Final Round2:30 p.m.YesBobsledWomen's Monobob Heat 43:06 p.m.YesIce HockeyWomen's Semifinals: Canada vs. Switzerland3:10 p.m.No\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule: Where to watch Team USA play Sweden in women's hockey - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/b219a2c7-f296-4c46-885c-f011d7ce05e9/thumbnail/1200x675/ed6f34f3471fff298efcf2f9209efc08/untitled-design-2026-02-15t163139-257.png"
      ],
      "datePublished": "2026-02-16T00:45:37.000Z",
      "dateModified": "2026-02-16T00:45:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1: How Big Ten race could be shaken up during Tuesday's slate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-top-25-and-1-michigan-big-ten-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/26016f6f-3a6a-45a9-8d56-a7196cd89462/thumbnail/1200x675/afb61ee65b2b4c9f89e843846b3409c0/top-25-1.jpg",
    "tag": "Sports",
    "date": "2026-02-16T15:15:20.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports Graphic\n            \n            \n    \n        Michigan remains No. 1 in the CBS Sports Top",
    "body": "\n    \n    \n                    \n                CBS Sports Graphic\n            \n            \n    \n        Michigan remains No. 1 in the CBS Sports Top 25 And 1 daily college basketball rankings for the seventh consecutive day, and the Wolverines are currently projected in computers to win the Big Ten regular-season championships by multiple games.That's likely how things will unfold.But Tuesday will be a big and busy night in the conference -- and, if things go a certain way, we could wake up Wednesday with the top six teams in the Big Ten all within two games of each other. Here's what would need to take place for that to happen: If Purdue beats Michigan on Tuesday, and if Michigan State beats UCLA, and if Wisconsin beats Ohio State, and if Nebraska beats Iowa, then the top six teams in the Big Ten would be within two games of each other in the loss column of the conference standings on Wednesday morning.To be clear, each of those games going that way isn't a likely scenario -- but they are all reasonable outcomes. According to KenPom.com, Purdue is only projected as a 2-point underdog to Michigan, Michigan State is projected as a 9-point favorite against UCLA, Wisconsin is only projected as a 1-point underdog at Ohio State and Nebraska is projected as a 1-point favorite at Iowa. Point being -- there's nothing crazy about Purdue, Michigan State, Wisconsin and Nebraska winning those games Tuesday.If they do, the Big Ten standings will look like this:     1. Michigan: 14-2     T-2. Illinois: 12-3     T-2. Purdue: 12-3     T-2. Nebraska: 12-3     T-5. Michigan State: 11-4     T-5. Wisconsin: 11-4\nAll six of those teams are in Monday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings. Michigan is No. 1. Purdue is No. 7. Nebraska is No. 8. Illinois is No. 10. Michigan State is No. 15. And Wisconsin is No. 26.Top 25 And 1 rankings\n        Biggest Movers\n    RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Michigan\n                                \n                            Yaxel Lendeborg finished with 17 points and eight rebounds in Saturday's 86-56 win over UCLA. The Wolverines' next game is Tuesday at Purdue.\n                        \n                            --\n                        \n                            24-1\n                        \n                                2\n                            \n                                    UConn\n                                \n                            Solo Ball finished with 20 points and six rebounds in Saturday's 79-75 win over Georgetown. The Huskies next game is Wednesday against Creighton.\n                        \n                            --\n                        \n                            24-2\n                        \n                                3\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 18 points and eight rebounds in Saturday's 67-54 win over Clemson. The Blue Devils next game is Monday against Syracuse.\n                        \n                            --\n                        \n                            23-2\n                        \n                                4\n                            \n                                    Arizona\n                                \n                            Jaden Bradley missed 10 of the 14 shots he attempted in Saturday's 78-75 overtime loss to Texas Tech. The Wildcats' next game is Wednesday against BYU.\n                        \n                            --\n                        \n                            23-2\n                        \n                                5\n                            \n                                    Houston\n                                \n                            Emanuel Sharp finished with 23 points and six rebounds in Saturday's 78-64 win over Kansas State. The Cougars' next game is Monday at Iowa State.\n                        \n                            --\n                        \n                            23-2\n                        \n                                6\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic finished with 18 points and three rebounds in Saturday's 74-56 win over Kansas. The Cyclones' next game is Monday against Houston.\n                        \n                            --\n                        \n                            22-3\n                        \n                                7\n                            \n                                    Purdue\n                                \n                            C.J. Cox finished with 14 points and two rebounds in Saturday's 78-57 win at Iowa. The Boilermakers' next game is Tuesday against Michigan.\n                        \n                            --\n                        \n                            21-4\n                        \n                                8\n                            \n                                    Nebraska\n                                \n                            Pryce Sandfort finished with 29 points and six rebounds in Saturday's 68-49 win over Northwestern. The Cornhuskers' next game is Tuesday at Iowa.\n                        \n                            --\n                        \n                            22-3\n                        \n                                9\n                            \n                                    Kansas\n                                \n                            Darryn Peterson missed seven of the 10 shots he attempted in Saturday's 74-56 loss at Iowa State. The Jayhawks' next game is Wednesday at Oklahoma State.\n                        \n                            --\n                        \n                            19-6\n                        \n                                10\n                            \n                                    Illinois\n                                \n                            David Mirkovic finished with 25 points and seven rebounds in Sunday's 71-51 win over Indiana. The Illini's next game is Wednesday at USC.\n                        \n                            --\n                        \n                            21-5\n                        \n                                11\n                            \n                                    Gonzaga\n                                \n                            Graham Ike finished with 21 points and 15 rebounds in Saturday's 94-86 win at Santa Clara. The Zags' next game is Wednesday at San Francisco.\n                        \n                            --\n                        \n                            25-2\n                        \n                                12\n                            \n                                    Florida\n                                \n                            Xaivian Lee finished with 22 points and three assists in Saturday's 92-83 win over Kentucky. The Gators' next game is Tuesday against South Carolina.\n                        \n                            --\n                        \n                            19-6\n                        \n                                13\n                            \n                                    Virginia\n                                \n                            Malik Thomas finished with 13 points and six rebounds in Saturday's 70-66 win over Ohio State. The Cavaliers' next game is Wednesday at Georgia Tech.\n                        \n                            --\n                        \n                            22-3\n                        \n                                14\n                            \n                                    Vanderbilt\n                                \n                            Tyler Nickel finished with 25 points and three rebounds in Saturday's 82-69 win over Texas A&M. The Commodores' next game is Wednesday at Missouri.\n                        \n                            --\n                        \n                            21-4\n                        \n                                15\n                            \n                                    Michigan St.\n                                \n                            Jeremy Fears Jr. finished with 26 points and 15 assists in Saturday's 85-82 overtime win over Illinois. The Spartans' next game is Friday at Wisconsin.\n                        \n                            --\n                        \n                            20-5\n                        \n                                16\n                            \n                                    Texas Tech\n                                \n                            JT Toppin finished with 31 points and 13 rebounds in Saturday's 78-75 overtime win at Arizona. The Red Raiders' next game is Tuesday at Arizona State.\n                        \n                            --\n                        \n                            19-6\n                        \n                                17\n                            \n                                    St. John's\n                                \n                            Dylan Darling finished with 23 points and eight rebounds in Saturday's 79-69 win at Providence. The Red Storm's next game is Wednesday at Marquette.\n                        \n                            --\n                        \n                            20-5\n                        \n                                18\n                            \n                                    Arkansas\n                                \n                            Darius Acuff finished with 31 points and seven assists in Saturday's 88-75 win over Auburn. The Razorbacks' next game is Wednesday at Alabama.\n                        \n                            --\n                        \n                            19-6\n                        \n                                19\n                            \n                                    Saint Louis\n                                \n                            Trey Green finished with 14 points and six rebounds in Friday's 86-59 win at Loyola Chicago. The Billikens' next game is Tuesday at Rhode Island.\n                        \n                            --\n                        \n                            24-1\n                        \n                                20\n                            \n                                    N. Carolina\n                                \n                            Seth Trimble finished with 19 points and three rebounds in Saturday's 79-65 win over Pitt. The Tar Heels' next game is Tuesday at NC State.\n                        \n                            --\n                        \n                            20-5\n                        \n                                21\n                            \n                                    Louisville\n                                \n                            Mikel Brown Jr. finished with 29 points and six assists in Saturday's 82-71 win over Baylor. The Cardinals' next game is Tuesday at SMU.\n                        \n                            --\n                        \n                            19-6\n                        \n                                22\n                            \n                                    Clemson\n                                \n                            Jestin Porter missed six of the eight shots he attempted in Saturday's 67-54 loss at Duke. The Tigers' next game is Wednesday at Wake Forest.\n                        \n                            --\n                        \n                            20-6\n                        \n                                23\n                            \n                                    Miami (Ohio)\n                                \n                            Brant Byers finished with 21 points and six rebounds in Friday's 90-74 win over Ohio. The RedHawks' next game is Tuesday at UMass.\n                        \n                            --\n                        \n                            25-0\n                        \n                                24\n                            \n                                    BYU\n                                \n                            Robert Wright III finished with 39 points and four assists in Saturday's 90-86 overtime win over Colorado. The Cougars' next game is Wednesday at Arizona.\n                        \n                            --\n                        \n                            19-6\n                        \n                                25\n                            \n                                    Alabama\n                                \n                            Aden Holloway finished with 20 points and four rebounds in Saturday's 89-75 win over South Carolina. The Crimson Tide's next game is Wednesday against Arkansas.\n                        \n                            --\n                        \n                            18-7\n                        \n                                26\n                            \n                                    Wisconsin\n                                \n                            Nick Boyd finished with 29 points and four assists in Friday's  92-71 win over Michigan State. The Badgers' next game is Tuesday at Ohio State.\n                        \n                            --\n                        \n                            18-7\n                        \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1: How Big Ten race could be shaken up during Tuesday's slate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/26016f6f-3a6a-45a9-8d56-a7196cd89462/thumbnail/1200x675/afb61ee65b2b4c9f89e843846b3409c0/top-25-1.jpg"
      ],
      "datePublished": "2026-02-16T15:15:20.000Z",
      "dateModified": "2026-02-16T15:15:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology: Houston vs. Iowa State carries No. 1 seed implications - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-bracketology-ncaa-tournament-iowa-state-vs-houston-no-1-seeds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/d84e212b-95cf-4c06-bc48-3f72155c5c29/thumbnail/1200x675/67d6ae98cae24dca79aa983084525311/bracketology.jpg",
    "tag": "Sports",
    "date": "2026-02-16T14:49:52.000Z",
    "description": "\n        A blockbuster week of college basketball is getting off to a must-see start on Monday night with a battle between Houston and Iowa State. The",
    "body": "\n        A blockbuster week of college basketball is getting off to a must-see start on Monday night with a battle between Houston and Iowa State. The Big 12 showdown brings both immediate and longterm ramifications for the No. 1 seed line in the NCAA Tournament, which begins one month from Tuesday.Houston enters as the fourth No. 1 seed in the CBS Sports Bracketology model and can validate that with a statement road win inside one of college basketball's most hostile environments. A win would be the most impressive victories of the season for the Cougars, who lag slightly behind UConn in resume-based metrics.The Huskies are right on Houston's heels for the fourth No. 1 overall seed with victories over high-caliber opponents like Illinois, Kansas and Florida on a rock-solid resume. The Cougars have beaten quality foes like Arkansas and Texas Tech, and they won at BYU before the Cougars lost Richie Saunders for the season.But this would be different. Winning at Iowa State would be worth a whopping 0.90 points in WAB (Wins Above Bubble), which is a vital measure of what a team has actually accomplished. That would be Houston's most valuable win of the year and a sign that the Cougars are true national title contenders.\nHere is a look at how things stand along the top two seed lines entering the week.  Bracketology top seeds       \t \t \t \t \tSeedMidwestEastWestSouthNo. 1                                                     \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    No. 2                                                     \n                            \n    \n                                                \n                    \n    \n        \n                            UConn\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Illinois\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Purdue\n                    \n    \n    Check out the full field of 68 at the CBS Sports Bracketology hub.Conference breakdownThe SEC continues to lead the way with 11 total bids in the CBS Sports Bracketology model. However, the league does not have a No. 1 seed or a No. 2 seed, and a handful of SEC squads are living life on the bubble. Missouri and Georgia are among the \"Last Four In,\" while Texas A&M is on a four-game losing streak and has slipped to a No. 10 seed.Auburn is also on a four-game losing streak and is down to a No. 9 seed. A four-game winning streak has helped insulate Texas, but the Longhorns are only a No. 9 seed. With three weeks left in the regular season, the SEC's bubble teams will need to thread the needle if the conference is going to get 11 teams into the Big Dance. Here is the rundown of the current tally from each multi-bid league.\nSEC: 11 Big Ten: 10Big 12: 8ACC: 8Big East: 3Mountain West: 2WCC: 2Rematch rulesAmid conference consolidation and the proliferation of nonconference matchups between high-major schools, the NCAA Tournament Selection Committee faces challenges when it comes to avoiding regular-season rematches. The 2025 NCAA Tournament bracket featured three potential second-round games between conference teams, although none of them came to fruition. The committee will still seek to minimize conference meetings and nonconference rematches, and our model is coded to do the same. However, NCAA bracketing principles permit games between conference teams in the second round, so long as the teams in question played each other just once before the NCAA Tournament. For conference teams that met twice prior to the NCAA Tournament, principles state they should not meet prior to the Sweet 16. If the teams played three times, NCAA bracketing principles state they should not play before the Elite Eight.With regard to rematches of nonconference games, NCAA bracketing principles state that they should be avoided \"in the First Four and first round.\" The committee will also \"attempt to avoid\" nonconference rematches in the second round. But the committee has historically prioritized keeping teams on their natural seed line over changing their seed line for the sake of avoiding a rematch. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology: Houston vs. Iowa State carries No. 1 seed implications - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/d84e212b-95cf-4c06-bc48-3f72155c5c29/thumbnail/1200x675/67d6ae98cae24dca79aa983084525311/bracketology.jpg"
      ],
      "datePublished": "2026-02-16T14:49:52.000Z",
      "dateModified": "2026-02-16T14:49:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers updates: What pending Aaron Rodgers decision means for QB Will Howard - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-updates-aaron-rodgers-will-howard/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/8fefa44d-f79e-464c-b3fc-51f713f99dc5/thumbnail/1200x675/a8b27096a8aebad611683bf14dc0b2cf/rodgers.png",
    "tag": "Sports",
    "date": "2026-02-16T14:26:09.000Z",
    "description": "\n        The likelihood of Aaron Rodgers returning to the Pittsburgh Steelers for the 2026 season is high, according to recent ESPN reporting. First-y",
    "body": "\n        The likelihood of Aaron Rodgers returning to the Pittsburgh Steelers for the 2026 season is high, according to recent ESPN reporting. First-year coach Mike McCarthy said he would welcome his former signal caller back in the fold after the pair won a Super Bowl with the Green Bay Packers and Rodgers would be far less of a worry than Mason Rudolph or Will Howard taking first-team reps.There is a waiting game, however, that could stretch several months. Similar to last offseason, Rodgers is not rushing his decision on a potential re-signing and will assess all that comes with playing a 22nd NFL season along with other landing spots if there's a fit — albeit unlikely.ESPN's Jeremy Fowler reported Saturday there's no timeline on Rodgers' decision. The team is encouraged by the continued development of Howard, a 2025 sixth-round pick, and there are additional avenues in play if the four-time MVP moves on.\"Both sides are open to a potential return,\" Fowler said over the weekend during a TV appearance. \"Aaron Rodgers tends to take his time on such matters, so I don't expect a swift resolution, but head coach Mike McCarthy likes Aaron Rodgers, of course, from his time in Green Bay. He is a bridge option for them. They've looked hard at quarterbacks in the 2026 draft, so they certainly could draft one.\"\nRodgers threw for 3,322 yards, 24 touchdowns and seven interceptions as a free-agent signing following two forgettable years with the New York Jets.Given McCarthy's encouraging belief that Howard has \"tremendous upside,\" another year with Rodgers would give the former Ohio State national champion extensive time to battle for the job in 2027. Rudolph heads into the final season of a two-year deal signed last offseason and would likely start ahead of Howard. Pittsburgh potentially taking a quarterback in April is on the table, but this year's crop lacks depth once beyond projected No. 1 overall pick Fernando Mendoza out of Indiana and Alabama's Ty Simpson, the top two-rated passers, per CBS Sports' prospect rankings. Ole Miss quarterback Trinidad Chambliss earning an injunction for another season of college football takes another talented player off the board at the position.\nIf the Steelers get an answer from Rodgers ahead of the draft, quarterback room worries for 2026 are non-existent for Pittsburgh's coaching staff. Rodgers is well-versed in McCarthy's system and Howard gets ample time to study and improve under a new offensive guru.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers updates: What pending Aaron Rodgers decision means for QB Will Howard - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/8fefa44d-f79e-464c-b3fc-51f713f99dc5/thumbnail/1200x675/a8b27096a8aebad611683bf14dc0b2cf/rodgers.png"
      ],
      "datePublished": "2026-02-16T14:26:09.000Z",
      "dateModified": "2026-02-16T14:26:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zuffa Boxing 03 results, highlights: Efe Ajagba scores knockout of Charles Martin - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/zuffa-boxing-03-results-highlights-efe-ajagba-charles-martin/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/999c567b-50f5-484d-a335-9872c4afe044/thumbnail/1200x675/b309fa4ebb78e0b3d5ad1920a1df4d1b/ajagba-martin-action-zuffa.jpg",
    "tag": "Sports",
    "date": "2026-02-16T03:59:56.000Z",
    "description": "\n        Efe Ajagba signed with Zuffa Boxing after a frustrating draw against Martin Bakole that many observers believed Ajagba deserved to win. On Su",
    "body": "\n        Efe Ajagba signed with Zuffa Boxing after a frustrating draw against Martin Bakole that many observers believed Ajagba deserved to win. On Sunday, Ajagba made good on a new opportunity with new promoters, finishing former IBF heavyweight champion Charles Martin with a fourth-round TKO.Martin controlled much of the action through the first three rounds, moving around the perimeter of the ring and forcing Ajagba to come to him. Ajagba didn't utilize a jab while trying to close distance, allowing Martin to land counters and avoid the predictable right hands from Ajagba.For all of Martin's success, heavyweight is a division where things can change in an instant, and that's exactly what happened in Round 3. With Martin moving along the ropes once again, Ajagba landed a heavy right hand that put Martin on the canvas. Martin beat the count and survived the round, but was right back down in the opening 30 seconds of the fourth round, again from a right hand.Ajagba remained patient, hunting down Martin and continuing to land flurries of big shots until the referee was forced to jump in and halt the bout at the 1:11 mark of Round 4.\nZuffa Boxing's heavyweight division is very much still in development, but Ajagba entered the fight on the fringes of the top 10 in the world, and a big knockout win over a former world champion cements him as a man who will likely be competing for Zuffa's heavyweight title in the future.Let's take a look at what else happened at Zuffa Boxing 03.Umar Dzambekov def. Ahmed Elbiali via KO, Round 2Dzambekov dominated a fight that was expected to be one of the best of the night. In the opening frame, Dzambekov was able to work a pinpoint jab and straight, often dipping down to the body with his shots. It was clear from the early moments that the skill differential was massive and that Elbiali's only chance was likely to land a single, fight-changing shot.Unfortunately for Elbiali, that big shot came from Dzambekov. As Elbiali attempted to move forward through Dzambekov's shots, Dzambekov landed a crushing uppercut that sent Elbiali's eyes rolling up into his head as he crashed to the canvas. Elbiali's feet were twitching as the referee began his count, making it clear the fight was over in that moment.\nDzambekov looked like a man with all of the skills to be one of the major players on the still-developing Zuffa Boxing roster. And a fight with Radivoje Kalajdzic could be a huge one for Zuffa Boxing's light heavyweight division.\nJaybrio Pe Benito def. Abel Mejia via TKO, Round 3The main card got off to a wild start as Pe Benito scored a massive upset knockout of Mejia in the third round of their lightweight bout. The fight got off to a fast start with both men landing meaningful shots in toe-to-toe exchanges before things took a massive turn in the second round. As the two exchanged again, Pe Benito landed a short left hook that sent Mejia to the canvas.Mejia beat the referee's count and the bell sounded to end the round. Mejia was not given a chance to get back on track in the third round, as Pe Benito landed a crushing straight right hand that sent Mejia back to the canvas. Mejia again rose to his feet, but this time was unsteady and the referee was forced to halt the action less than a minute into the round.\nPe Benito was a big underdog at +500 but now owns one of the biggest knockouts in Zuffa Boxing's short history, though maybe not quite as thunderous as Dzambekov's uppercut one fight later.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zuffa Boxing 03 results, highlights: Efe Ajagba scores knockout of Charles Martin - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/999c567b-50f5-484d-a335-9872c4afe044/thumbnail/1200x675/b309fa4ebb78e0b3d5ad1920a1df4d1b/ajagba-martin-action-zuffa.jpg"
      ],
      "datePublished": "2026-02-16T03:59:56.000Z",
      "dateModified": "2026-02-16T03:59:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barcelona look to get back on track after blowout loss, catch Real Madrid - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/barcelona-vs-girona-preview-la-liga-lamine-yamal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/31899d86-529d-4db7-9fdc-464c4b57cb54/thumbnail/1200x675/abf08d1baecc93bf7792729003f51784/fcb-12.jpg",
    "tag": "Sports",
    "date": "2026-02-16T04:48:27.000Z",
    "description": "\nBarcelona are still very much in charge of LaLiga's title race, especially so ahead of a trip to Girona in a match that feels like a classic mismatch",
    "body": "\nBarcelona are still very much in charge of LaLiga's title race, especially so ahead of a trip to Girona in a match that feels like a classic mismatch poised to showcase their dominance in Spain's top flight. There are questions that loom large for Barcelona, though, especially with Thursday's defeat to Atletico Madrid still top of mind.Hansi Flick's side return to play for the first time since a startling 4-0 defeat to Atleti in the first leg of the Copa del Rey semifinals, one in which Atleti unrelentingly exposed Barcelona's weaknesses – perhaps because those vulnerabilities have been easy to spot over the course of the season. Barcelona's defensive shakiness has been a defining feature since Flick took over at the start of the 2024-25 season, a frailty usually overcome by a mighty attack. It is an approach that guided them to the domestic double last season but is not foolproof. It may come as little surprise that a team like Atleti could find a way through Barcelona's porous defense but there have been openings for a wide range of opponents including Club Brugge, who Barcelona tied 3-3 with in the UEFA Champions League, and Slavia Praha, who kept things nervy despite losing 4-2 in the end.It perhaps comes as little surprise, then, that Flick's all gas, no breaks strategy is under scrutiny as Barcelona return to league play on Monday. Players reportedly told Flick that he should adjust his tactical preferences occasionally in the wake of the loss to Atleti, according to The AThletic, especially when the likes of Raphinha and Pedri are unavailable to pitch in from an attacking standpoint. Flick, meanwhile, took issue with the players' intensity levels during the first half.How to watch Girona vs. Barcelona, oddsDate: Monday, Feb. 15 | Time: 3 p.m. ETLocation: Estadi Montilivi -- Girona, SpainTV: ESPN2 | Live stream: ESPN SelectOdds: Girona +600; Draw +470; Barcelona -290Monday's trip to Girona may not provide the answer but as the season progresses, Flick once again faces an existential question about whether or not his preferred style has its limits. The visitors will be the oddsmakers' favorites to take all three points at Girona, in large part because the opponents have their own defensive woes. Girona have conceded 37 goals so far this season, three fewer than the league's worst team in that regard, Levante, putting them just two points above the relegation zone heading into Monday's match. They may like their chances against Barcelona's chaotic back line but even then, Girona are not known for their goalscoring ability – only four teams have fewer than their 22 goals in LaLiga this season.It makes for a favorable situation for Barcelona, who need a win to restore their one point lead over Real Madrid atop the table. Again, though, they are likely to be understaffed – Marcus Rashford and Pedri are dealing with injuries that will keep them out of Monday's match, while there are still question marks around Raphinha's availability. The Brazil international has not played since a win against Elche on January 31 while dealing with a short-term issue, but he did train Friday and could make a much-waited return on Monday.How many minutes he will be able to play is currently unclear, though his importance to the team certainly is not. Ferran Torres, Lamine Yamal and Robert Lewandowski have held down the fort well with 10-plus goals each across all competitions but Raphinha has an oversized impact for Barcelona when he is available. He has 13 goals and five assists in all competitions, a sizable output for someone who has only been able to play 22 games so far this season, almost irreplaceable even though he has spent large chunks of the campaign on the sidelines. Case in point – they have lost just five matches in all competitions this season and Raphinha did not start in any of them, only coming off the bench in one of those matches.Raphinha's return will be a welcome one for Flick and company, who will prefer to call upon him as the push for silverware enters its final stages, and serves as a stark reminder that a closely-contested title race could very much be decided by fine margins, something the comeback of an impactful player should be very helpful with.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barcelona look to get back on track after blowout loss, catch Real Madrid - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/31899d86-529d-4db7-9fdc-464c4b57cb54/thumbnail/1200x675/abf08d1baecc93bf7792729003f51784/fcb-12.jpg"
      ],
      "datePublished": "2026-02-16T04:48:27.000Z",
      "dateModified": "2026-02-16T04:48:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas State fires coach Jerome Tang days after viral video rant - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-state-jerome-tang-wildcats-coach-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/a62b25dc-cf44-45f4-8700-ee111cedd292/thumbnail/1200x675/99d6b675d08cd64851ccd27dcd756eac/jerometangoutkstate.jpg",
    "tag": "Sports",
    "date": "2026-02-16T03:46:45.000Z",
    "description": "\n        Kansas State fired fourth-year basketball coach Jerome Tang on Sunday, a source told CBS Sports. Athletic director Gene Taylor subsequently r",
    "body": "\n        Kansas State fired fourth-year basketball coach Jerome Tang on Sunday, a source told CBS Sports. Athletic director Gene Taylor subsequently revealed late Sunday night he made the decision to fire Tang following K-State's loss at houston on Saturday. The move comes less than four days after Tang's postgame rant went viral following an embarrassing 91-62 home loss to Cincinnati on Thursday. a\"This was a decision that was made in the best interest of our university and men's basketball program,\" Taylor said in a statement. \"Recent public comments and conduct, in addition to the program's overall direction, have not aligned with K-State's standards for supporting student-athletes and representing the university. We wish coach Tang and his family all the best moving forward.\"  The Wildcats are 10-15 and in the midst of their second-worst season in the past 20-plus years. Kansas State ranks 101st at KenPom.com and is 1-11 in the Big 12. The team is headed toward a second straight sub-.500 season despite being one of the bigger spenders in the transfer portal the past two offseasons. \nKansas State will attempt to fire Tang for cause. Tang has a buyout of more than $18 million, per the terms of his contract, but Taylor believes Tang's public criticisms of the players and the response that press conference spurred in the national media violated the terms of his contract.Tang released a statement disputing Kansas State's assessment of the program.\"I am deeply disappointed with the university's decision and strongly disagree with the characterization of my termination.  I have always acted with integrity and faithfully fulfilled my responsibilities as head coach,\" Tang said. \"I am grateful to the players, staff, and fans who make this program so special. I remain proud of what we built together and confident that I have always acted in the best interests of the university and our student-athletes.\"  Associate head coach Matthew Driscoll has been named interim head coach for the rest of the season. \nLISTEN: Matt Norlander breaks down Tang's final days at K-State on this emergency edition of the Eye on College Basketball podcast.Tang went 71-57 in less than four seasons on the job, including a 29-39 mark in the Big 12. He was hired in 2022 and an immediate success: He guided the Wildcats to the Elite Eight with a No. 3 seed and finished 26-10 thanks to the dynamic duo of point guard Markquis Nowell and forward Keyontae Johnson. Nowell's 19 assists in a Sweet 16 victory vs. Michigan State at Madison Square Garden set both an NCAA Tournament record and an optimistic tone for the Tang era, but it's been a litany of letdowns ever since.K-State is coming off a 78-64 loss at No. 3 Houston on Saturday. Tang had the players' names removed from the back of their jerseys for that game in a questionable move that followed his criticism of KSU players following the Wildcats' loss to the Bearcats.  \n\"This was embarrassing,\" Tang said Wednesday night at his press conference. \"These dudes do not deserve to wear this uniform. There will be very few of them in it next year. I'm embarrassed for the university, I'm embarrassed for our fans, our student section. It is just ridiculous.\"That's the quote that has Tang's legal team and Kansas State's lawyers set to battle in the weeks ahead. If K-State wins, it won't pay Tang another dime. If it loses, Tang will have more than $18.5 million coming his way. There is also the realistic possibility that the parties wind up settling somewhere in the wide gulf between those two numbers.\n                            \n    \n                                                \n                    \n    GoPowerCat's team of Kansas State insiders are providing on-the-ground updates on every development and insider scoop surrounding the Wildcats. Sign up for a VIP membership now and join the conversation to experience the power of the GoPowerCat community where fans connect and get even more insider information from our experts on staff!\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas State fires coach Jerome Tang days after viral video rant - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/a62b25dc-cf44-45f4-8700-ee111cedd292/thumbnail/1200x675/99d6b675d08cd64851ccd27dcd756eac/jerometangoutkstate.jpg"
      ],
      "datePublished": "2026-02-16T03:46:45.000Z",
      "dateModified": "2026-02-16T03:46:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winners and losers of revitalized NBA All-Star Game: Kawhi goes off, Wemby makes mark, KAT gets picked on - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/winners-losers-nba-all-star-game-kawhi-leonard-victor-wembanyama/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/189475ab-a50f-4505-8a8d-4c246403a8e9/thumbnail/1200x675/a4410905e0b2337f5c343670b2dfc5c4/kawhi-asg-getty-1.png",
    "tag": "Sports",
    "date": "2026-02-16T03:05:22.000Z",
    "description": "\n        The NBA All-Star Game is officially back. After years of embarrassing efforts, even by exhibition game standards, the players finally deliver",
    "body": "\n        The NBA All-Star Game is officially back. After years of embarrassing efforts, even by exhibition game standards, the players finally delivered a showcase that they, and the league, can be proud of -- even if the championship game of the new Team USA vs. Team World format was a bit of a dud. The USA Stars, the younger roster of American All-Stars, destroyed Team Stripes, to more veteran American group, 47-21, in the championship to lift the trophy after a thrilling round-robin series. Anthony Edwards, who poured in 32 points across Team Stars' three games, was named MVP, becoming the first Minnesota Timberwolves player to earn the honor since Kevin Garnett in 2003. After a fun night of action inside the Intuit Dome, here's a look at the winners and losers from the 2026 All-Star Game. Winner: Victor WembanyamaIn the lead up to Sunday's showcase, the French phenom made it clear that he was not happy with what the event had turned into in recent years, and was going to do his best to change it. \n\"I want to push the great players of this sport to play in the All-Star game just as hard as I will,\" Wembanyama said in January. \"We'll see how it goes, but if they don't play hard, I'll do it without them.\"He expanded on those thoughts on Saturday. \"Exclamation-point plays, playing in a solid manner and sharing the ball with energy,\" Wembanyama said, when asked how he planned to set a competitive tone. \"If you share that energy, people feel like they have a responsibility to share it back to you.\"\nWembanyama walked the walk right from the opening tip of the first game. Within the first two minutes, he threw down a huge slam, scored the first seven points for Team World and swatted a Jalen Duren attempt into the crowd. When Team World lost the opener in overtime because of a bad defensive rotation, he threw his hands up and stormed off the court like he had just lost a playoff game. \nEveryone else followed suit. \"I ain't gonna lie, Wemby set the tone,\" Anthony Edwards said. \"He came out and played hard, so it's hard not to match that.\" Winner: The NBABetween all of the tanking discourse, some of Adam Silver's comments during his Saturday press conference and a disastrous All-Star Saturday Night, the league was facing more public criticism than it had in a long time. As an entity, the last thing the NBA needed was another lifeless All-Star Game. Instead, the players delivered the most memorable mid-season showcase since 2020, and one of the most competitive events ever. \nThe first three games of the round robin format were awesome and all went down to the wire. Team Stars defeated Team World in overtime of Game 1 on a game-ending 3-pointer by Scottie BarnesTeam Stripes defeated Team Stars in Game 2 on a buzzer-beating 3-pointer by De'Aaron FoxTeam Stripes defeated Team World in Game 3 on a last-second 3-pointer by Kawhi LeonardThe championship turned into a rout, as the much younger Team Stars cruised past the veteran-filled Team Stripes, who seemed to be out of gas. The last few minutes of that contest looked a lot like the previous All-Star Games. But even though the night ended on a low, the overall product was much better than anyone expected, and spared the league another wave of criticism. Loser: The championship gameAs mentioned, the new All-Star Game format pitting the best American players against the best international players was working to perfection through the round robin format, thanks to a big assist from Wembanyama. \nThe two American squads, Team Stars and Team Stripes, advanced to the championship, and everything was set up for a thrilling conclusion to the best All-Star Game in years. So, of course, we got a blowout. The younger Team Stars had way more juice left in their legs, and they jumped out to an early double-digit lead. Team Stripes briefly gave itself some hope with back-to-back 3s from LeBron James and Jalen Brunson to cut the deficit down to nine with seven minutes to play, but never got closer. While the night was an overall success, the way it ended was definitely a bummer. \nWinner: Kawhi LeonardLeonard has had a strange six months. During the offseason, Leonard was the subject of an investigative report by Pablo Torre that alleged the Clippers star had received $28 million via a fradulent marketing agreement that allowed his team to circumvent the salary cap. The NBA's investigation into the matter has not yet concluded. Shortly after the season got underway, Leonard was forced to the sidelines for nearly three weeks with ankle and foot sprains. The Clippers went 2-8 without him, part of a disastrous start to the season for the team, which was expecting to get back to the playoffs. A few days before Christmas, Leonard began one of the best stretches of his career, which included three 40-point outings in the span of five games, including a career-high 55 points in a win over the Eastern Conference-leading Detroit Pistons. The hot streak kicked off a stunning turnaround for the Clippers, who went from 6-21 to 26-28 in the span of two months to climb into Play-In Tournament position in the Western Conference. \nDespite an incredible last few weeks, Leonard wasn't initially named to the game, but eventually made it as an injury replacement. He proved to be a wise pick by Silver, and put on an incredible show in front of the Clippers fans on Sunday, as he helped Team Stripes reach the championship game. In Game 3 of the round-robin format, Leonard poured in 31 of Team Stripes' 48 points on 11-of-13 shooting from the field, including a 6-of-7 effort from 3-point range, and hit a game-winning triple over Karl-Anthony Towns (more on that later) in the closing seconds. Leonard's 12-minute bonanza was one of the best parts of the night, and was yet another reminder that when he's healthy, there are few better players in the world. \n\"It was great. Happy that Adam [Silver] let me in. That's what the home crowd wanted to see. I'm glad I was able to do something in that game,\" Leonard said. \nWinner: Anthony EdwardsEarlier this weekend, Edwards was blunt when asked for his thoughts on the state of the All-Star Game (\"It is what it is at this point\") and whether the new format would make a difference (\"No\"). But by the end of the first game, Edwards had changed his tune. \"I ain't gonna lie, Wemby set the tone,\" Edwards said. \"He came out and played hard, so it's hard not to match that.\" Edwards can at times appear aloof and \"too cool for school\" during press conferences, but on the court he's one of the league's most fierce competitors. It's unlikely that he went into Sunday night with a plan to play hard, but once Wembanyama had laid down a marker, he couldn't help but respond. \n\"Yeah, [Wembanyama] set the tone, man, and it woke me up, for sure,\" Edwards added after the game. Edwards had 13 points in Game 1, 11 points in Game 2 and eight points in the championship, for a total of 32 on the night, and was named All-Star MVP for his efforts. \nLoser: Karl-Anthony TownsTowns spends all season hearing about his defensive deficiencies, and how they might prevent the New York Knicks from winning a championship. All-Star Weekend is supposed to be a respite from that sort of talk, but somehow Towns found himself on the receiving end of even more criticism. \nGame 1 between Team World and Team Stars went to overtime, and instead of putting any time on the clock, a winning score of five points was set. Team World was up 3-2, and should have been playing a no-3s defense, but Towns for some reason rotated into the paint to try and stop Jalen Duren, which left Scottie Barnes wide open from behind the arc. Duren found Barnes for the game-winning shot. \nIn Game 3 between Team World and Team Stripes, the score was tied in the closing seconds when Towns got switched onto Leonard. Towns actually played pretty good defense, but Leonard drained a game-winning 3 right in his face. \nPoor Towns. The first time anyone has been expected to show any sort of effort on that end of the floor in the All-Star Game and he immediately finds himself on a defensive lowlight reel.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winners and losers of revitalized NBA All-Star Game: Kawhi goes off, Wemby makes mark, KAT gets picked on - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/189475ab-a50f-4505-8a8d-4c246403a8e9/thumbnail/1200x675/a4410905e0b2337f5c343670b2dfc5c4/kawhi-asg-getty-1.png"
      ],
      "datePublished": "2026-02-16T03:05:22.000Z",
      "dateModified": "2026-02-16T03:05:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]