[
  {
    "title": "2026 Genesis Invitational leaderboard: Rory McIlroy keeps rolling, Scottie Scheffler makes cut - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-leaderboard-2026-friday-rory-mcilroy-scottie-scheffler/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/b89784a7-cddd-47bb-a8a2-ee4c08d1a94b/thumbnail/1200x675/6844ec85653d459b69e0823bb83700d3/rory.jpg",
    "tag": "Sports",
    "date": "2026-02-21T01:44:36.000Z",
    "description": "\n        A rain-soaked Thursday in Los Angeles gave way to much improved conditions on a marathon Friday at Riviera Country Club. Thirty players had t",
    "body": "\n        A rain-soaked Thursday in Los Angeles gave way to much improved conditions on a marathon Friday at Riviera Country Club. Thirty players had to complete their first round action starting at 7 a.m., while the second round got going 40 minutes later in an effort to get back on schedule going into the weekend. Among those who had to come back early were Xander Schauffele and Scottie Scheffler, who were moving in different directions on the leaderboard in one of the week's marquee groups. In calm, soft conditions early on Friday, Schauffele came out attacking to post a 3-under 68. After a short 38-minute turnaround from ending Round 1 to starting Round 2, he backed it up in the afternoon with a 6-under 65 to get into the top 5 at 9 under heading into the weekend. Scheffler, meanwhile, was trying to dig himself out of a hole he created for himself on Thursday when he went 5 over in his first 10 holes. He got two of those shots back in the morning to wrap up his first round, but needed a strong close on Friday afternoon just to make the cut. Even as a signature event, the Genesis has a cut for those outside the top-50 and ties -- and those within 10 shots of the lead. Scheffler birdied the par-5 17th to get to even par for the week, and then needed a 6-footer to save par on No. 18 just to make the weekend inside that top 50. \nThat extended his Tour-best made cut streak to 68 consecutive events, but required far more of a grind than he'd like in a limited field event. \nWhile Scheffler and Schauffele had to play 26 holes on Friday, Rory McIlroy was able to enjoy a normal turnaround after a strong 5-under 66 on Thursday in tough conditions. He did himself one better on Friday with a 6-under 65 to keep himself one shot off the lead heading into the weekend. McIlroy's improved ball-striking over the last year has been on display over the first two rounds, as he's third in the field in strokes gained on approach. His ability to flight shots and play with trajectories was critical in his first round in difficult conditions, and also allowed him to come home strong as winds picked up on Friday afternoon. What's been most impressive from McIlroy has been the consistency, especially after a wild week at Pebble Beach that saw him make a ton of birdies but also a lot of double bogeys (or worse). \n\"I said this at the start of the week, there's no Pacific Ocean to hit it into around this golf course, so that helps,\" McIlroy said after his second round. \"Even like I hit a wild tee shot on [No.] 15, 40 yards left of the fairway, but it's OK. It's a different type of golf this week, different setup. I still hit some loose shots, but the course setup is in a way that you can get away with it a little bit more. But I've hit it well, I've controlled my distance well for the most part, and I've holed some nice putts from sort of inside eight feet for pars when I've needed to.\" Being able to bomb it 333 yards off the tee also doesn't hurt -- nor does being fourth in strokes gained putting through two rounds. \nAs McIlroy has made his priorities known for his career at this point, a win at an iconic venue like Riviera Country Club -- in Tiger Woods' event, no less -- would undoubtedly carry some added weight for the future Hall of Famer. McIlroy noted last year how meaningful it was to win at a course like Pebble Beach, and adding another of California's legendary courses a year later would be a strong addition to his résumé. \nMcIlroy's strong efforts in the first two rounds put him in solo third at 11 under, just one shot back of the surprising tandem of Jacob Bridgeman and Marco Penge at the top of the leaderboard. The leaders1. Marco Penge, Jacob Bridgeman (-12)Penge was the best player on the DP World Tour last year not named Rory McIlroy, and after a tough start to his PGA Tour career with two missed cuts and a T64 last week, he's showing his full talents at Riviera. Penge is an exceptionally long hitter and leads the field in strokes gained off the tee this week, but he's been red-hot with the putter as well and has shown impressive touch with the irons for a player with his swing speeds. He won multiple times a year ago on the DP World Tour, but will now have to deal with some different nerves in the final group on the weekend of a signature event. Joining him will be Jacob Bridgeman, who has quietly made strong finishes on the PGA Tour a habit. Bridgeman has four top-20s to start his 2026 season and is coming off a 2025 season where he made the Tour Championship for the first time -- thanks to a pair of top-20s in the first two Playoff events. Bridgeman's calling card is his putter, and he's lapping the field on the greens to start this week with 7.4 strokes gained putting. The question for Bridgeman will be if his long game can hold up on the weekend and create enough opportunities to score -- as he couldn't quite keep up with the weekend scoring last week at Pebble Beach in a similar position. \nOther contenders3. Rory McIlroy (-11)T4. Xander Schauffele, Adam Scott (-9)T6. Max Greyserman, Min Woo Lee (-8)T8. Tommy Fleetwood, Matt Fitzpatrick, Wyndham Clark, Kurt Kitayama (-7)T12. Max Homa and three others (-6)T15. Jordan Spieth, Collin Morikawa and two others (-5)McIlroy and Schauffele will be tight in the rear view of Penge and Bridgeman on Saturday as they try to stay in position for their first PGA Tour victories, and that'll provide a significant test for their nerve. After an incredibly uneven week of play at Pebble Beach, McIlroy looks much more in control of his golf ball at Riviera -- with ball-striking reminiscent of what he used to win last year at Pebble. Schauffele, meanwhile, looks to be gaining confidence in his game by the day, and appeared quite comfortable shaping shots and playing aggressive in the soft conditions presented on Friday. When he's playing with that confidence, he's extremely dangerous and is looking to get back in the winner's circle for the first time since 2024. \nScott put together the round of the day with an 8-under 63 -- which included a closing bogey -- but as a former winner at Riviera, he has to be considered a threat on the weekend to become the second 45-year-old winner on the PGA Tour this season. Lurking further back in the pack are some others who have performed well to start 2026. Tommy Fleetwood continues to stack rounds in the 60s and moved into the top 10 with a 66 on Friday. Min Woo Lee came one shot away from a playoff last week and is carrying that positive momentum into his play this week. Matt Fitzpatrick has been sniffing around leaderboards since Phoenix and is once again heading into the weekend in contention. Then there's Max Homa, Jordan Spieth and last week's winner Collin Morikawa back at 5 under. Homa is a former winner here and is desperate for a strong finish on a course where he's performed well. Spieth continues to show signs of positive form, particularly with the putter, which provides optimism a breakout win could be coming. Morikawa, fresh off snapping his own winless streak at Pebble Beach, is playing solid golf again, but he (and Spieth) will need another super Saturday like he had a week ago if he's going to get in contention. \nNotable players to miss the cutSam Burns (+1)Maverick McNealy (+1)Russell Henley (+2)Chris Gotterup (+3)Justin Rose (+3)Keegan Bradley (+3)Jason Day (+5)Two of the five winners on the PGA Tour this season will miss the weekend at Riviera, as Gotterup and Rose struggled in L.A. It's also surprising to see Henley, McNealy and Burns fall off the pace and miss the cut after they've shown strong form to start the year as well. Updated 2026 Genesis Invitational odds, picksRory McIlroy (+185)Jacob Bridgeman (+380)Marco Penge (5-1)Xander Schauffele (15/2)Adam Scott (13-1)Tommy Fleetwood (17-1)Min Woo Lee (20-1)The way McIlroy is hitting his irons and with the expectation that the course firms up some as the week goes on, he is the rightful favorite here and I don't think his odds will get worse after Saturday's third round. I do think Schauffele presents some value at 15/2 with the way he's striking it as well, and of the group a bit further back, Lee's confidence right now means he's a threat to go low and get himself in real contention on Sunday. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Genesis Invitational leaderboard: Rory McIlroy keeps rolling, Scottie Scheffler makes cut - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/b89784a7-cddd-47bb-a8a2-ee4c08d1a94b/thumbnail/1200x675/6844ec85653d459b69e0823bb83700d3/rory.jpg"
      ],
      "datePublished": "2026-02-21T01:44:36.000Z",
      "dateModified": "2026-02-21T01:44:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WWE Elimination Chamber: Matches, card, date, rumors for annual event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-elimination-chamber-2026-card-matches-rumors-date-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-21T03:33:47.000Z",
    "description": "\n        CM Punk is coming home. \"The Second City Saint\" returns to Chicago for WWE Elimination Chamber on Feb. 28. Punk defends his world heavyweight",
    "body": "\n        CM Punk is coming home. \"The Second City Saint\" returns to Chicago for WWE Elimination Chamber on Feb. 28. Punk defends his world heavyweight title against Finn Balor, plus two superstars will punch their tickets to WrestleMania 42.Punk has his hands full as the world heavyweight champion. He'll rematch Finn Balor at Elimination Chamber, the last major stop before WrestleMania. If he leaves Chicago with his champion status intact, Royal Rumble winner Roman Reigns awaits him in Las Vegas.Plus, Punk's wife, AJ Lee, returns for her first singles match in over a decade when she takes on Becky Lynch for the women's intercontinental championship.Elimination Chamber's two titular matches will also take place. The superstars who emerge from their respective steel structures victorious will earn world title matches at WrestleMania. Randy Orton, LA Knight and Cody Rhodes are among those who've qualified for a shot at the undisputed WWE title. Tiffany Stratton, Rhea Ripley, Alexa Bliss and Asuka will compete with two other women for a shot at one of the two women's world titles as Royal Rumble winner Liv Morgan has still yet to make her decision on who she will face.\nTake a look below at the confirmed matches for Elimination Chamber and take a glance at the crystal ball of what may come. The event streams live on ESPN Unlimited on Feb. 28 with the main card starting at 6 p.m. ET.2026 WWE Elimination Chamber matchesWorld Heavyweight Championship -- CM Punk (c) vs. Finn Balor: Balor returned to the main event scene after Judgment Day ally Liv Morgan accused him of complacency. Balor fell short of defeating the world heavyweight champion in Balor's home nation of Ireland. The respect Punk and Balor showed each other after the match fizzled out after Balor was denied a rematch by Raw general manager Adam Pearce. Balor took matters into his own hands, attacking Punk and provoking the champ into granting him a rematch.Elimination Chamber match -- Randy Orton vs. LA Knight vs. Cody Rhodes vs. Je'Von Evans vs. Trick Williams vs. TBA: An undisputed WWE title shot awaits the winner of the men's Elimination Chamber match. Orton qualified by beating Aleister Black and Solo Sikoa in a triple threat match. Knight defeated Austin Theory and Penta to earn his spot. After Rhodes earned his spot with a win over Jacob Fatu and Sami Zayn, Evans became the biggest surprise entrant in the match by defeating Gunther and Dominik Mysterio on Raw. Williams earned the penultimate spot by beating Carmelo Hayes and Damian Priest.\nWomen's Intercontinental Championship -- Becky Lynch (c) vs. AJ Lee: Punk isn't the only adored superstar coming home to Chicago. Lee seeks to join her husband as an active champion at Elimination Chamber. Lynch proposed the match, but only agreed to defend her women's intercontinental title after Lee refused to wrestle her otherwise. Lee is 2-0 against Lynch since ending her 10-year retirement, beating her in a mixed tag team match and in WarGames.Elimination Chamber match -- Rhea Ripley vs. Tiffany Stratton vs. Alexa Bliss vs. Asuka vs. Kiana James vs. TBA: Stratton advanced to the Elimination Chamber by beating Lash Legend and Chelsea Green on SmackDown. Ripley qualified by overcoming Lyra Valkyria and Ivy Nile on Raw. Bliss defeated Giulia and Zelina Vega to grab a spot in the match, and was joined by Asuka, who defeated Bayley and Nattie. James snuck a pinfall over Charlotte Flair in their match with Nia Jax.2026 WWE Elimination Chamber predictionsUndisputed WWE Championship -- Drew McIntyre (c) vs. Jacob Fatu: WWE subverted expectations by booking Rhodes and Fatu in the same Elimination Chamber qualifying match. All signs pointed to an eventual triple threat match between them and McIntyre. Rhodes is still the favorite to challenge McIntyre at WrestleMania. Maybe Fatu loses his qualifying match and earns a separate title shot against McIntyre. It seems odd to reward Fatu with a title opportunity if he loses his upcoming qualifier match. Whatever direction WWE takes, expect Fatu to orbit McIntyre in the next few months.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WWE Elimination Chamber: Matches, card, date, rumors for annual event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg"
      ],
      "datePublished": "2026-02-21T03:33:47.000Z",
      "dateModified": "2026-02-21T03:33:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC Fight Night predictions -- Sean Strickland vs. Anthony Hernandez: Fight card, picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-sean-strickland-anthony-hernandez-predictions-odds-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/2a91954e-c340-4a31-b07a-2e54162b1436/thumbnail/1200x675/7ff8e492330665d11fa81ea9265d95d7/anthony-hernandez-houston-weighin.jpg",
    "tag": "Sports",
    "date": "2026-02-21T14:48:50.000Z",
    "description": "\n        A middleweight title shot could be at stake for the winner of Saturday's UFC Fight Night main event in Houston. Former UFC champion Sean Stri",
    "body": "\n        A middleweight title shot could be at stake for the winner of Saturday's UFC Fight Night main event in Houston. Former UFC champion Sean Strickland looks to bounce back against red-hot contender Anthony Hernandez.Strickland (29-7) has a new path to the middleweight title after Khamzat Chiamev became champion. Strickland was unlikely to get a third crack at Dricus du Plessis after two failed attempts. But Chimaev vs. Strickland is a fresh matchup. Between Strickland's No. 3 middleweight ranking and name value, it's feasible he could sneak ahead of the more deserving title challenger Nassourdine Imavov. Strickland has to beat Hernandez before those conversations can start. Oddsmakers think that's a tall task; Strickland disagrees.\"He has been steamrolling guys that I could f---ing write a clinic on,\"  Strickland told CBS Sports' Brian Campbell before the fight. \"So, no, he's not [on my level].\"Sign up for Paramount+ and Watch UFC Fight Night: Strickland vs. Hernandez for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription! Plans start as low as $8.99/month or $89.99/year!\nHernandez (15-2, 1 NC) is ready for his breakout moment after taking the long road through the division. \"Fluffy\" was won eight consecutive fights with six finishes. He's days away from potentially having the third longest middleweight win streak in UFC history. Beating Strickland would be the biggest accomplishment of his career, and puts him on par with Imavov as the most deserving middleweight title challenger. In fact, \"Fluffy\" would arguably have a better case than Imavov, boasting a longer win streak and just as many wins over former UFC champs.\"I think if you beat a former champ, that really makes a statement  because everybody is really good here,\" Hernandez said. \"Someone who has already done that  shit, you go out there and take him out? You are sitting in a really  good place.\"  Bet UFC Fight Night at DraftKings and get $300 in bonus bets if your first $5 bet wins:\nUFC Fight Night also features two perennial contenders looking to protect their places in the pecking order. Geoff Neal (No. 12) battles the tenacious Uros Medic, and Dan Ige (No. 14) tries to snap Melquizael Costa's five-fight win streak. Both veterans approach fight night renewed after overcoming personal health issues. For Neal, a five-year battle with substance abuse. For Ige, eye injuries before the Patricio Pitbull fight. \"I didn't have the energy for anything. I didn't prepare right. The weight cuts were terrible,\" Neal told CBS sports this week. \"There was a point before all that shit happen, I'd run for an hour at a seven mile pace. I'm knocking out eight point six miles in an hour. I'm trying to get back to the old me.\"\"I had trauma to my eyes,\" Ige said. \"My mindset going into that fight was, 'I don't know if I'll ever fight again.' I didn't know what I was dealing with. I didn't want a way out of the fight. I knew if I went to a doctor, they would tell me not to fight. That's my ego and my pride. I've battled with that for a long time. I probably should've addressed it, but I didn't... It's something I've always battled, but I'm getting better with it. I have a better relationship with myself and my thoughts. Things are night and day different.\" \nElsewhere on the undercard, ranked heavyweights are set to collide when Ante Delija and Serghei Spivac face off. Delija is looking to bounce back from a surprising knockout loss to rising contender Waldo Cortes Acosta in November. Prior to that, Delija scored two first-round knockouts in his first two UFC appearances. And an interesting UFC debut is set at welterweight when Josiah Harrell takes on Jacobe Smith. Harrell was scheduled to make his promotional debut at UFC 290 against Jack Della Maddalena, but during his fight week medical screening, doctors discovered he had Moyamoya, a rare brain disease that causes the arteries supplying blood to the brain to become narrowed or blocked. Now, nearly three years later, he gets his chance to make a first impression.Let's take a look at the rest of the fight card with the latest odds from DraftKings before getting to a prediction and expert pick on the main event below.UFC Fight Night card, oddsFavoriteUnderdogWeightclassAnthony Hernandez -278Sean Strickland +225MiddleweightGeoff Neal -218Uros Medic +180WelterweightMelquizael Costa -218Dan Ige +180FeatherweightAnte Delija -142Sergehi Spivac +120HeavyweightJacobe Smith -310Josiah Harrell +250WelterweightMichel Pereira -155Zach Reese +130MiddleweightUFC Fight Night viewing informationDate: Feb. 21 | Start time: 8 p.m. ETLocation: Toyota Center -- HoustonStream: Paramount+ (subscribe now for as little as $8.99 per month)PredictionSean Strickland vs. Anthony Hernandez: I'm surprised with how far apart the odds are. Hernandez is taking a meaningful step up in competition against arguably the division's most frustrating defensive fighter. Strickland has elite experience and is uniquely equipped to limit his opponent's offense. Hernandez also has serious gaps in his defensive striking that Strickland can exploit. That being said, I'll side with the rising tide. Hernandez is a menace when he has grappling control and half guard on the ground. Strickland did a fantastic job stuffing du Plessis' takedowns and getting off the mat quickly. \"Fluffy\" lacks DDP's physicality, but makes up for it with tenacious chain wrestling and far better top control. Hernandez will have a tough time taking Strickland down. When he does, he'll make the most of it. Enough to win a close decision against a former champ who can certainly play spoiler. Pick: Hernandez via Split DecisionWho wins Strickland vs. Hernandez, and which UFC best bet of over +500 should you be all over? Visit SportsLine now to get detailed picks and analysis from the advanced model which showed a 6.1% ROI from over 500 fights from 2023-25, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night predictions -- Sean Strickland vs. Anthony Hernandez: Fight card, picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/2a91954e-c340-4a31-b07a-2e54162b1436/thumbnail/1200x675/7ff8e492330665d11fa81ea9265d95d7/anthony-hernandez-houston-weighin.jpg"
      ],
      "datePublished": "2026-02-21T14:48:50.000Z",
      "dateModified": "2026-02-21T14:48:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Mazeroski dies at 89: Pirates legend hit walk-off HR to win 1960 World Series - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/bill-mazeroski-dies-pirates-legend-home-run-game-7-1960-world-series/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/d72abdd8-bdc6-4dc5-8464-68ff8a04a682/thumbnail/1200x675/ff1352ad3c13350f545f460113ea2cb6/bill.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:07:18.000Z",
    "description": "\n        Hall of Fame second baseman and Pittsburgh Pirates legend Bill Mazeroski, author of one of the greatest home runs in baseball history, died o",
    "body": "\n        Hall of Fame second baseman and Pittsburgh Pirates legend Bill Mazeroski, author of one of the greatest home runs in baseball history, died on Friday, the team announced. He was 89. Mazeroski's walk-off home run against the New York Yankees at Forbes Field in Game 7 of the 1960 World Series gave Pittsburgh its first title since 1925.Here is Mazeroski's historic blast:\n\"Everyone across the Pirates organization is deeply saddened by the loss of Bill Mazeroski,\" Pirates chairman Bob Nutting said in a statement. \"Maz was one of a kind -- a true Pirates legend, a National Baseball Hall of Famer and one of the finest defensive second basemen the game has ever seen. His name will always be tied to the biggest home run in baseball history and the 1960 World Series championship, but I will remember him most for the person he was: humble, gracious and proud to be a Pirate.\"I feel fortunate to have spent time with Maz over the years. Welcoming him and his family back to Pittsburgh as part of the inaugural Pirates Hall of Fame class in 2022 was a special moment for all of us. Our hearts are with his sons, Darren and David and the entire Mazeroski family. Maz was a great man who will be deeply missed.\"\"Bill  Mazeroski was synonymous with one of the greatest home runs in baseball  history for more  than 65 years,\" MLB Commissioner Rob Manfred said in a statement. \"... Bill's lifetime of hard work and humility was a perfect illustration  of the city he represented  on the diamond. On behalf of Major League Baseball, I extend my  deepest condolences to Bill's family, his friends across our game, and  all the loyal fans of Pittsburgh.\"\nMazeroski went 8 for 25 (.320) with two home runs and 5 RBI in the 1960 World Series. Despite his Game 7 walk-off home run, he was not named World Series MVP that year. The award went to Yankees' second baseman Bobby Richardson, who went 11 for 30 (.367) with 12 RBI in the seven games. Richardson remains the only player to win World Series MVP on the losing team.  Although he is best remembered for his World Series-winning homer, Mazeroski was one of the greatest defensive second basemen to ever play. He was an eight-time Gold Glove winner and is still the all-time leader in double plays turned by a second baseman. He led National League second basemen in assists nine times, double plays eight times, and put outs five times.Mazeroski, an Ohio native, originally signed with the Pirates as an amateur free agent prior to the 1954 season. He reached the big leagues in 1956 and was Pittsburgh's starting second baseman as a 20-year-old in 1957. Mazeroski played in 10 All-Star Games and received MVP votes in 1958 and 1966. He finished eighth in the MVP voting as a 21-year-old in 1958.\nDuring his offensive peak from 1957-62, Mazeroski hit .269/.307/.397 and averaged 12 home runs per season. That was better than the second base standards of the era. Mazeroski played his entire 17-year career with the Pirates from 1956-72 and retired with 2,016 hits and 138 home runs. He won a second World Series ring with the 1971 Pirates.Mazeroski spent the then-maximum 15 years on the Baseball Writers Association of America's Hall of Fame ballot from 1978-92. He peaked at 42.3% of the vote in 1992, short of the 75% needed for induction. The Veterans Committee voted Mazeroski into the Hall of Fame in 2001. The Pirates retired his No. 9 in 1987.\"Weird, isn't it?\" Mazeroski said during his Hall of Fame speech. \"Known for the home run and in the Hall of Fame because of your defense.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Mazeroski dies at 89: Pirates legend hit walk-off HR to win 1960 World Series - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/d72abdd8-bdc6-4dc5-8464-68ff8a04a682/thumbnail/1200x675/ff1352ad3c13350f545f460113ea2cb6/bill.jpg"
      ],
      "datePublished": "2026-02-21T15:07:18.000Z",
      "dateModified": "2026-02-21T15:07:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA MVP buzz: Why Cade Cunningham belongs in the same tier as Jokic and SGA - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-mvp-buzz-cade-cunningham/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/6d8772d5-7b21-4998-9d6e-a75845983f6e/thumbnail/1200x675/01d51c795abdf221c01673e164c10b1c/cade.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:31:00.000Z",
    "description": "\n        On Thursday morning, Cade Cunningham declared himself to be the NBA's best American player by way of a feature story in GQ magazine. Players ",
    "body": "\n        On Thursday morning, Cade Cunningham declared himself to be the NBA's best American player by way of a feature story in GQ magazine. Players say stuff like this all the time. At any given time, there are probably 10 or more guys who believe themselves to be the best player on the planet. On any given night, they might all have a case. Still, it's a pretty bright spotlight to shine upon yourself. But if you're Cunningham, why not draw a little attention to yourself? Not nearly enough people are doing it for you. Sure, he's listed in all the MVP rankings (NBA.com has him fourth this week). In ESPN's latest straw poll, which surveys a panel of 100 local, national and international media members, he came out third behind Shai Gilgeous-Alexander and Nikola Jokic, who is still in the race for now but can only miss one more game before falling below the minimum 65-game threshold. FanDuel currently has Cunningham at +700, the third-highest number on the board behind, of course, SGA and Jokic. Six weeks ago, I had him at third in my CBS ranking, which didn't even include Jokic because at that point, he was all but certain to miss too many games.But all of these rankings paint Cunningham as an also-ran in a race that, at this point, he should arguably be leading. Let's start with the obvious: He's the best player on the league's best team (entering play on Friday, Detroit is percentage points above OKC at 41-13). \nThe Pistons' latest victory was another walloping of the Knicks on Thursday, a game in which Cunningham, as if to officially stamp his best-American statement and sans the services of fellow All-Star Jalen Duren and Beef Stew Isaiah Stewart, carded 42 points, 13 assists, eight rebounds, two blocks and a steal. The Knicks were supposed to be one of the teams to beat in the East this year. Many wondered if the Pistons would even be able to match what they did last season, when they won their first playoff game in 17 years before falling in the first round to ... this Knicks. This year, they've played three times, and Detroit has won by a total of 84 points, with Cunningham registering a plus-44 across 89 minutes. Cunningham and Jokic are the only two players averaging at least 23 points and nine assists (Cunningham leads the league in the latter category at 9.6). Cunningham's 9.1 per-game plus-minus is more than double Jokic's plus-4.3, but let's be clear: This isn't about looking for cracks in the cases for Jokic or SGA; they're both airtight. This is about putting a proper case together for Cunningham. \nAnd to do that, the full context of not just where the Pistons are, but how they got here, becomes necessary. Three years ago, the Pistons were the worst team in the league with 17 wins. Two years ago, that win total dropped to 14 as they endured an NBA record 28-game losing streak. We're talking bottom of the barrel. People were honestly questioning whether Cunningham could ever be that guy.Suffice it to say, he can. And is. Last year, the Pistons became the first team in history to triple their win total from the previous season. Now they have the best record in the league. And it's not like they added a major piece. They just got better. Cade got better. He's a different, more confident shooter now, particularly from 3 off the dribble. Cunningham is hitting these step-back 3s at a 44% clip this season, per NBA.com.All told, he's up from 31% to 35% on off-the-dribble 3s; it's still not a huge number, but it's just enough to force defenders to press up tighter and go over ball screens, at which point Cunningham, who scores the third-most points per game via drives in the league, becomes truly impossible to keep out of the paint. \nIf you're looking to compare Cunningham's MVP case with, say, Luka Doncic, the conversation, for my money, begins and ends on defense. Cunningham plays both sides. Gilgeous-Alexander and Jokic are a different story. Their respective cases are unimpeachable, and this isn't to suggest that Cunningham should or shouldn't win over either one of those guys. It's simply to say he deserves to be in the same sentence. Not the one after. And certainly not the one after Luka. Say what you want, but story matters in MVP voting. And right now, there is no better story than how quickly Cunningham has turned the cellar-dwelling Pistons into, by record, the best team in the league. He has to do everything for the Pistons in terms of shot creation; when he's on the floor, Detroit's offense operates at what would rank fourth in the league, per Cleaning the Glass. When he leaves, they become the fourth worst. Nobody -- not Luka, not Jokic, not SGA, not Jalen Brunson, not Jaylen Brown -- nobody has to carry a heavier offensive load. \nYes, we're all waiting to see what the Pistons will do in the postseason, whether their lack of shooting will derail them. But this is a regular-season award, and relatively speaking, Cunningham, and by extension the Pistons, are not getting the shine they should. It's high time that it starts to change. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA MVP buzz: Why Cade Cunningham belongs in the same tier as Jokic and SGA - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/6d8772d5-7b21-4998-9d6e-a75845983f6e/thumbnail/1200x675/01d51c795abdf221c01673e164c10b1c/cade.jpg"
      ],
      "datePublished": "2026-02-21T15:31:00.000Z",
      "dateModified": "2026-02-21T15:31:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Genesis Invitational 2026: Schedule, TV coverage, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-2026-where-to-watch-tv-schedule-streaming-coverage/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/b78af851-f4d9-415e-aa31-95ceac01e0b7/thumbnail/1200x675/d3984a5c0d9b68c6c134ce4c295baf57/genesis.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:48:41.000Z",
    "description": "\n        The PGA Tour did not wait long to offer its second signature event of the season, as the circuit will bring the best players in the world dow",
    "body": "\n        The PGA Tour did not wait long to offer its second signature event of the season, as the circuit will bring the best players in the world down the California coast to Los Angeles, where they will compete in Tiger Woods' tournament, which returns to Riviera Country Club after a one-year absence.In 2025, the Genesis Invitational had to move to Torrey Pines due to the devastating fires in L.A., so Riviera will certainly be a welcome sight for all involved. There are four past champions of this event in the field this week -- Ludvig Åberg (reigning champion), Hideki Matsuyama, Max Homa and Adam Scott -- but the biggest names in the field will all be vying for their first wins at Riviera. That list includes Scottie Scheffler, who has made furious comebacks the last two weeks to finish in the top 3 after slow starts, and Rory McIlroy, who began his 2026 PGA Tour season with an up-and-down T14 finish in Pebble Beach.Scheffler was tasked with making another significant comeback just to fall inside the cut this week, while McIlroy opened the second and third rounds just one shot back of the lead, putting himself in position to win the second signature event of the 2025 season. Follow the action live with 2025 Genesis Invitational leaderboard updates throughout Round 3 on Saturday.\nCollin Morikawa is back in action after winning the Pebble Beach Pro-Am for his first victory on the PGA Tour since 2023, showing the form that once made him the No. 2 player in the world. Tommy Fleetwood, Xander Schauffele, Russell Henley and Patrick Cantlay rounded out the group of favorites this week in L.A., as they all hope to receive a trophy from Woods and a big winner's check at the end of the week. Here's how you can watch Scheffler, McIlroy and everyone else competing at Tiger's event this week. 2026 Genesis Invitational TV scheduleAll times Eastern Round 3 - SaturdayRound 3 starts: 10:15 a.m. [Tee times]PGA Tour Live: 10:15 a.m. - 7 p.m. -- PGA Tour LiveEarly TV coverage: 1-3 p.m. on Golf ChannelEarly streaming: 1-3 p.m. on NBC Sports App\nLive TV coverage: 3-7 p.m. on CBS, Paramount+Live streaming: 3-7 p.m. on CBSSports.com, CBS Sports AppRadio: 1-7 p.m. -- PGA Tour Radio Round 4 - SundayRound 4 starts: 9:45 a.m. [Tee times]PGA Tour Live: 9:45 a.m. - 6:30 p.m. -- PGA Tour LiveEarly TV coverage: 1-3 p.m. on Golf ChannelEarly streaming: 1-3 p.m. on NBC Sports AppLive TV coverage: 3-6:30 p.m. on CBS, Paramount+Live streaming: 3-6:30 p.m. on CBSSports.com, CBS Sports App\nRadio: 1-7 p.m. -- PGA Tour Radio \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Genesis Invitational 2026: Schedule, TV coverage, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/b78af851-f4d9-415e-aa31-95ceac01e0b7/thumbnail/1200x675/d3984a5c0d9b68c6c134ce4c295baf57/genesis.jpg"
      ],
      "datePublished": "2026-02-21T15:48:41.000Z",
      "dateModified": "2026-02-21T15:48:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Osasuna vs. Real Madrid live stream: Where to watch online - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/osasuna-vs-real-madrid-laliga-vini-jr-walk-off/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/bd2d32eb-5e29-49bf-be6b-b14ad340ea6c/thumbnail/1200x675/f04b7f66042a3bcffaa9c66bbfb3d836/untitled-design-2026-02-21t122843-090.png",
    "tag": "Sports",
    "date": "2026-02-21T11:33:20.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \nReal Madrid will be back on Saturday after an intense week",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \nReal Madrid will be back on Saturday after an intense week of soccer on and off the pitch. Last weekend the side coached by Alvaro Arbeloa went back at the top of the LaLiga standings after Barcelona's 2-1 defeat against Girona. Then in midweek the Blancos won 1-0 at Benfica, a game that was defined by Vinicius Jr walking off the field. Speaking to the media ahead of the match against Osasuna, Arbeloa spoke again on the matter.\"Vini has been sad like everyone else, above all, very outraged. It is a racist act that should never happen again. We have a huge opportunity not to let it go by and to keep fighting against this scourge that is racism. I think everyone saw what happened. We cannot divert from the topic and we are facing a great opportunity to take action. I am not the one to comment on Jose Mourinho's statements. Now it is in the hands of UEFA, who are leading a great fight, and they have the perfect opportunity for the fight to be more than just words. It was Vinicius' decision to return to the field. If he had told us he didn't want to keep playing, we would have gone back inside. There is no title or victory that makes me feel as proud as seeing a team as united as we were the other day.\"\n        \n            \n                Real Madrid superstar Vinicius Junior walks off field following alleged racist incident at Benfica\n                \n                    James Benge                \n            \n                            \n    \n                \n                    \n    \nHere's what you need to know ahead of the game: How to watch Osasuna vs. Real Madrid, oddsDate: Saturday, Feb. 21 | Time: 12:30 p.m. ETLocation: Estadio El Sadar -- OsasunaLive stream: ESPN+Odds: Osasuna +372; Draw +303; Real Madrid -147Possible lineupsOsasuna XI: Sergio Herrera; Valentin Rosier, Alejandro Catena, Jorge Herrando, Javi Galan; Jon Moncayola, Lucas Torro; Victor Munoz, Aimar Oroz, Ruben Garcia; Ante Budimir.Real Madrid XI: Thibaut Courtois; Trent Alexander-Arnold, Raul Asencio, Dean Huijsen, Alvaro Carreras; Eduardo Camavinga, Aurelien Tchouameni; Federico Valverde, Arda Guler, Vinicius Junior; Gonzalo Garcia.Prediction Real Madrid shouldn't be too worried about Osasuna despite their good start of the season and we can expect them to win pretty easily on Saturday. Pick: Real Madrid 3, Osasuna 0. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Osasuna vs. Real Madrid live stream: Where to watch online - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/bd2d32eb-5e29-49bf-be6b-b14ad340ea6c/thumbnail/1200x675/f04b7f66042a3bcffaa9c66bbfb3d836/untitled-design-2026-02-21t122843-090.png"
      ],
      "datePublished": "2026-02-21T11:33:20.000Z",
      "dateModified": "2026-02-21T11:33:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Genesis Invitational purse, prize money, payouts for second signature event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-2026-purse-prize-money-payouts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/18/5e558bab-4e70-49d8-a355-e5c3efeb3d48/thumbnail/1200x675/9f93c7a0dca5164e78536701252ed6d2/genesis-trophy.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:54:23.000Z",
    "description": "\n        The 2026 PGA Tour season rolls into the iconic Riviera Country Club in Los Angeles for Tiger Woods' event, the Genesis Invitational. The seco",
    "body": "\n        The 2026 PGA Tour season rolls into the iconic Riviera Country Club in Los Angeles for Tiger Woods' event, the Genesis Invitational. The second straight signature event of the season puts big money is on the line for the 72 players who make up the field in the tournament's return to Riviera following a one-year absence.Collin Morikawa took home $3.6 million in his triumphant return to the winner's circle at Pebble Beach last week, snapping a winless drought of nearly three years. There are few better places to pick up a win at this point on the PGA Tour schedule than a signature event, and whoever performs best at Riviera this week is in for an even bigger payday. With eight fewer players in the field this week, most every spot on the leaderboard will earn a bit more cash from the $20 million prize pool at the Genesis, with the winner taking home $4 million. Last year, it was Ludvig Åberg who took home that top prize -- at Torrey Pines after a venue change due to wildfires in Los Angeles -- and it will be interesting to see whether the recent run of signature-event parity continues. Nine straight signature events have been won by different players, a significant departure from 2024 when Scottie Scheffler won four of the eight events on the calendar. Scheffler was the heavy favorite coming into Riviera, as is the case every week on the PGA Tour, but he barely made the cut and faces a massive climb over the final 36 holes. Rory McIlroy enters Moving Day just one shot back of the lead.\nAll will be vying for their share of the $20 million purse. Let's take a look at the full breakdown of how much each finishing spot will take home from the 2026 Genesis Invitational. 2026 Genesis Invitational prize money, purseTotal purse: $20 million \n1st: $4,000,000 2nd: $2,200,000 3rd: $1,400,0004th: $1,000,0005th: $840,0006th: $760,000 7th: $700,0008th: $646,0009th: $600,00010th: $556,00011th: $514,00012th: $472,00013th: $430,00014th: $389,000 15th: $369,00016th: $349,00017th: $329,00018th: $309,000 19th: $289,000 20th: $269,00021st: $250,00022nd: $233,00023rd: $216,00024th: $200,00025th: $184,00026th: $168,00027th: $161,00028th: $154,00029th: $147,000 30th: $140,00031st: $133,00032nd: $126,00033rd: $119,00034th: $114,000 35th: $109,00036th: $104,00037th: $99,00038th: $94,00039th: $90,00040th: $86,00041st: $82,00042nd: $78,00043rd: $74,00044th: $70,00045th: $66,000 46th: $62,00047th: $58,00048th: $56,000 49th: $54,00050th: $52,00051st: $51,00052nd: $50,000 53rd: $49,00054th: $48,00055th: $47,000 56th: $46,00057th: $45,00058th: $44,000 59th: $43,00060th: $42,000 61st: $41,00062nd: $40,00063rd: $39,00064th: $38,000 65th: $37,00066th: $36,00067th: $35,000 68th: $34,00069th: $33,00070th: $32,000 71st: $31,00072nd: $30,000 \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Genesis Invitational purse, prize money, payouts for second signature event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/18/5e558bab-4e70-49d8-a355-e5c3efeb3d48/thumbnail/1200x675/9f93c7a0dca5164e78536701252ed6d2/genesis-trophy.jpg"
      ],
      "datePublished": "2026-02-21T15:54:23.000Z",
      "dateModified": "2026-02-21T15:54:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duke vs. Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/duke-michigan-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T23:24:08.000Z",
    "description": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No.",
    "body": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No. 1 Michigan and No. 3 Duke. After No. 2 Houston lost earlier this week to Iowa State, this game will more than likely determine who is ranked No. 1 in the AP Top 25 poll on Monday and the team that is in the driver's seat for the No. 1 overall seed in next month's NCAA Tournament. Duke and Michigan have combined for just three losses heading into the weekend. Duke lost to Texas Tech back in December and fell on the road earlier this month to in-state rival North Carolina after the Tar Heels hit a go-ahead 3-pointer with 0.4 seconds remaining after trailing the entire game. The Wolverines have won 11 consecutive games since losing to Wisconsin earlier this month. Michigan remains in firm contention to win the Big Ten regular season title. The Wolverines have a 2.0-game lead over Illinois heading into the weekend with just four conference games remaining in the regular season.  \n        \n            \n                Bracketology: Experts predict NCAA Tournament bracket before committee reveals early top 16 seeds\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nMeanwhile, Duke is 2.0 games ahead of Virginia in the ACC standings, also with four games remaining. Duke faces Virginia at home next weekend. \nHere is everything you need to know ahead of Duke's matchup with Michigan on Saturday.  Duke vs. Michigan: Need to know  No. 1 overall seed on the line: This game not only has major stakes for next week's AP poll, but also the top line of the NCAA Tournament. The winner of this game will be in the driver's seat to earn the No. 1 overall seed in CBS Sports Bracketology.  No. 3 Duke and No. 1 Michigan are 1-2 in WAB -- a new metric the committee will be looking at -- and the NET rankings. Duke and Michigan are tracking to be placed on opposite sides of the NCAA Tournament bracket, which could make this game a potential national title preview if both teams make it to Indianapolis. Frontcourt is the strength of both teams: Michigan's strength is its frontcourt. The Wolverines have one of the best frontlines in the nation in the trio of Morez Johnson Jr., Yaxel Lendeborg and Aday Mara. Michigan will face its toughest test yet, with a matchup against Duke big man Cameron Boozer, the current national player of the year frontrunner. Boozer has been the most consistent player in the sport. Boozer is a walking double-double. Mara is one of the best shot blockers and defenders in the nation. The key to this one will come down to how Michigan can slow down Boozer. \nGuards will be asked to step up: Yes, the strength of both teams is their frontcourt play, but the guards could also decide this game. On the Michigan front, Elliot Cadeau is familiar with Duke as anyone. He spent the last two seasons at North Carolina before transferring to Michigan last offseason. Cadeau's backcourt mate, Nimari Burnett, is a steady veteran presence. On the other side, Duke guard Isaiah Evans has stepped up and become the clear-cut No. 2 option. There are question marks about Duke's point guard play, with Caleb Foster and Cayden Boozer sharing that responsibility. Boozer has seen his role increase lately. That's a good thing for all parties.  Where to watch Duke vs. Michigan live  Date: Saturday, Feb. 21 | Time: 6:30 p.m. ET Location: Capital One Arena -- Washington, D.C. TV: ESPN | Live stream: fubo (Try for free)   Duke vs. Michigan prediction, pick  \nThis game is a rare nonconference Final Four/national title preview in February. It's truly going to be a toss-up. Duke and Michigan rank 1-2 in adjusted defensive efficiency, per KenPom.com, and are also No. 1 and 2 in most other metrics. The key will be the frontcourt and 3-point shooting. Duke shots 34.9% from the 3-point line, while Michigan knocks down 36.1% from beyond the arc. In a sense, Boozer has become almost underrated because people have just gotten used to how dominant he is. This is an opportunity for him to show everyone why he's a Tier 1 NBA Draft prospect. Duke wins behind Boozer and Evans. Pick: Duke +2.5\n \t \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            UM -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duke vs. Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg"
      ],
      "datePublished": "2026-02-20T23:24:08.000Z",
      "dateModified": "2026-02-20T23:24:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png",
    "tag": "Sports",
    "date": "2026-02-21T15:56:47.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA has already exceeded its overall medal tally, now at 27, and stands to add to both the overall count and possibly even the gold medal count. A win over Slovakia on Friday would assure the U.S. men's hockey team of some type of medal as it would advance to Sunday's final.On Thursday, figure skater Alysa Liu, 20, became the first American woman to take home a singles gold in 24 years and the U.S. women's hockey team rallied from a 1-0 third period deficit to a 2-1 overtime victory over rival Canada to reach the top of the podium for the first time in eight years. And speedskater Jordan Stolz added to his collection of two previous gold medals with a silver in the men's 1,500 meters.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Entering these Games, Norway had won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    18111140\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    1112730\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    1061430\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    97319\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    89623\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    68822\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    68620\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    66416\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    58518\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    571224\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    45918\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    43613\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    34310\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    3216\n            \n        \n    \n        GBR\n    \n    \n        Great Britain\n    \n\n    3003\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    2215\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    2114\n            \n        \n    \n        ESP\n    \n    \n        Spain\n    \n\n    1023\n            \n        \n    \n        BRA\n    \n    \n        Brazil\n    \n\n    1001\n            \n        \n    \n        KAZ\n    \n    \n        Kazakhstan\n    \n\n    1001\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0314\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0213\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0145\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0112\n            \n        \n    \n        DEN\n    \n    \n        Denmark\n    \n\n    0101\n            \n        \n    \n        EST\n    \n    \n        Estonia\n    \n\n    0101\n            \n        \n    \n        GEO\n    \n    \n        Georgia\n    \n\n    0101\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png"
      ],
      "datePublished": "2026-02-21T15:56:47.000Z",
      "dateModified": "2026-02-21T15:56:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NCAA March Madness Bracket Preview 2026: Where to watch, live stream, channel as current top 16 seeds unveiled - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ncaa-march-madness-bracket-preview-2026-current-top-16-seeds-unveiled-where-to-watch-live-stream-channel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/1aee7e30-92b9-4360-aacc-48fb0c41cd00/thumbnail/1200x675/065b693f19718ddb9e4e45f2ceef323b/gettyimages-2074386326-1.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:55:20.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Saturday's NCAA March Madness Bracket Preview will",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Saturday's NCAA March Madness Bracket Preview will give college basketball fans a look  at the contenders to land a top seed in the 2026 NCAA Tournament. With Selection Sunday less than a month away, fans can tune in at 12:30 p.m. ET on CBS and Paramount+ to get a look at how the top 16 teams in the bracket stack up entering the day's action.NCAA Division I Men's Basketball Committee Chair Keith Gill will join CBS analysts Clark Kellogg, Wally Szczerbiak and Seth Davis in studio along with host Adam Zucker to break down where things stand as college basketball's regular season hits the home stretch.Last year, three of the No. 1 seeds in the early bracket reveal remained the same on Selection Sunday. The only team that dropped from the No. 1 line was Alabama. Houston replaced the Crimson Tide on the No. 1 seed line. All four No. 1 seeds reached the Final Four last season for the second time in the history of the tournament.\nHistory suggests that if you're one of the 16 teams in the early bracket reveal, you will remain a top-four seed on Selection Sunday. The only two teams that dropped out of the top 16 last season were Michigan (No. 4 to No. 5 seed) and Kansas (No. 4 to No. 7). \nHeading into the weekend, Michigan is the projected No. 1 overall seed in CBS Sports' latest Bracketology model projections. Duke, Arizona and Houston are the other No. 1 seeds in the latest projections. Notably, Duke and Michigan play each other on Saturday, which is sure to have massive implications on the team that ultimately earns the No. 1 overall seed in the NCAA Tournament.The 30-minute bracket preview comes before a Big 12 showdown between No. 8 Kansas and Cincinnati on CBS at 1 p.m. \nWhere to watch NCAA March Madness Bracket Preview Date: Saturday, Feb. 21 | Time: 12:30 p.m. ETTV: CBS | Streaming on Paramount+ Premium (Try It Free)   Extended TV coverage: CBS Sports Network, 1 p.m. ET\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NCAA March Madness Bracket Preview 2026: Where to watch, live stream, channel as current top 16 seeds unveiled - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/1aee7e30-92b9-4360-aacc-48fb0c41cd00/thumbnail/1200x675/065b693f19718ddb9e4e45f2ceef323b/gettyimages-2074386326-1.jpg"
      ],
      "datePublished": "2026-02-21T15:55:20.000Z",
      "dateModified": "2026-02-21T15:55:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How MLS built a 30-year run to 2026 World Cup with risks, a plan and hope - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/survival-to-spotlight-how-mls-built-a-30-year-run-to-world-cup-with-risks-a-plan-and-hope/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/1a5b8e30-7809-4267-929b-60d51f9dc5ff/thumbnail/1200x675/87f590befcf799c8645d14dfcb172a4f/mls-1.jpg",
    "tag": "Sports",
    "date": "2026-02-21T02:33:35.000Z",
    "description": "\n        From teetering on the edge of going out of business during the early 2000s to preparing to kick off a league's 31st season with some of the b",
    "body": "\n        From teetering on the edge of going out of business during the early 2000s to preparing to kick off a league's 31st season with some of the best players in the world, Major League Soccer has come a long way since the first ball was kicked between the San Jose Clash and D.C. United in 1996. What started as a mandate to bring first division soccer to the United States as a stipulation in landing the 1994 World Cup has become one of the top soccer leagues in the world, with no signs of slowing down. Beginning with only 10 teams in 1996, there will be 30 teams in action this weekend, as the league has grown in unimaginable ways. From multimillion-dollar facilities to the presence on national teams and World Cup rosters, and of course, Lionel Messi, the fingerprints of MLS will be all over the 2026 World Cup, taking place in the United States, Canada, and Mexico this summer.MLS commissioner Don Garber summed this up well during his state of the league address in December, saying, \"We'd love to say that [the World Cup is] the rocket fuel, but this jet has been running for 30 years, and it's going to run for another 30.\"\n                                                                    Getty Images\n                                                            In what will be the biggest World Cup in history, the 2026 tournament will expand to 48 teams for the first time, featuring at least four first-time qualifiers. It's expected to surpass records set by the 1994 World Cup, which is still the most attended in history. The 16 host cities are only the tip of the iceberg as well, with training facilities being picked out all around North America to ensure that national teams can have a true home away from home. But for any of this to happen, it goes back to the soccer builders in this country -- Lamar Hunt (of the Hunt family that owns the Kansas City Chiefs), Alan Rothenberg, Philip Anschutz, and so many more.Only a few may have expected things would advance so far when MLS started. However, for the first commissioner in league history, Doug Logan, this doesn't surprise him in the slightest.\n\"Yes, I did,\" Logan said when asked if he expected to see the best players in the world playing in MLS. \"People ask me that all the time. And the answer is yes. Part of the responsibility and the charge to the top leader in entities like this is to be able to have a vision of what could be and then tirelessly and ceaselessly keep the institution and the organization on that track. I realized where it was going to go. Not where it could go, but where it was going to go.\"I also realized after the first year or a year and a half that it was going to take longer and be more expensive to get there than my owners anticipated, And those were two realities for me, but if you're asking me, did I ever envision it getting to this, the answer is yes.\"NASL collapses, MLS risesEven with the league being founded in the wake of the North American Soccer League collapsing, that didn't stop investors like the Hunt family from buying into the potential that MLS could have. The NASL brought Pele to North America, and the New York Cosmos are still to this day one of the most recognizable American soccer brands, despite not having played a game since 2020 -- although that will change in March as they take the pitch to face Portland Hearts of Pine in New Jersey in USL League One.\nAt times, being able to keep that vision may have been easier said than done, especially during a period when Anschutz owned six of the league's 10 clubs, but the message remained the same. The people involved with the founding of MLS saw the potential in the league, and it was massive, but to come full circle with another World Cup on United States soil is where things are special in this moment of reflection. It may have taken longer than expected to get the World Cup back, but this is where the league can show how far it has come from the days of 10 clubs and franchises folding (Tampa Bay Mutiny, Miami Fusion, Chivas USA) and take advantage of the increased interest in soccer in America during it.MLS cities, facilities to have huge impactHost cities during the FIFA Club World Cup took notice when Boca Juniors fans descended on Miami, ES Tunis fans took over Times Square, and Brazilian fans marched from the Art Museum in Philadelphia, and it's an effect that will only be magnified during the World Cup. Kansas City will be central to this, with Algeria, Argentina, England, and the Netherlands all training in the Kansas City region.\"A World Cup puts the host country and all of the host cities on the global map. And of course, Kansas City is a big city, but from a global standpoint, it's probably not a very well-known city, with maybe the exception of its American football league team, which has garnered a little bit of global recognition over the last six or seven years,\" said Clark Hunt, chairman and CEO of the Hunt Sports Group, which owns the Chiefs and MLS club FC Dallas. \"But I really expect that Kansas City will become known globally because of its role in hosting World Cup games.\"\nMLS facilities have come a long way during this time, as the new Red Bull New York training facility in Whippany, N.J., that will open in March has a price tag higher than most early soccer-specific stadiums as over $120 million. That facility will host the Brazil national team during this summer's World Cup. Many of the league's newest facilities have garnered praise globally, with players noting the differences as well as teams and executives abroad taking note, but with national teams making the United States their home during the summer, it will be a true show of what these facilities have to offer. They were a large part of why the first expanded World Cup is taking place in the United States, and who knows, the facilities could lead to a few transfers into MLS following the World Cup. During a changing tide of American soccer, even those will be easier with the league looking to adopt a summer-to-spring schedule shift in 2027 to aling with the rest of the soccer world. It's one of many reasons why this World Cup feels like as much of an inflection point as it does a celebration of soccer, which was also the case in 1994, which brought the pressure of a new league, as there wasn't even a commissioner until November of 1995, before beginning play in 1996.\n\"I had less than three months before we were going to play in 10 cities. It was a whirlwind kickstart. We had an incredibly successful first year because everyone was kicking the tires and thinking that it's going to be like the World Cup, and leagues are not like the World Cup. Leagues are there to endure and stay and have a legacy,\" Logan said.And more than 30 years later, MLS has endured and is building its legacy brick by brick. This year won't have such a sprint compared to what '94 did, but with the coming shift, it's clear that the league is also entering a new era. New stadium projects will also see New York City FC's time playing at Yankee Stadium come to an end, and MLS has a massive opportunity in the wake of the World Cup.But the trajectory doesn't end there because it also impacts the youth level, which MLS EVP and Chief Communications Officer Dan Courtemanche notes.\n\"We're a league now that has elite player development and incredible facilities, and 43,000 kids playing in MLS NEXT. My son plays U15 MLS NEXT. He's with an elite club; he plays against the Red Bulls, New York City FC, the Revolution, and D.C. United, and I see the sophistication now at the youth level,\" Courtemanche said. \"This is my 34th season about to start in professional soccer but I'm only a few season in when it comes to viewing it as a soccer parent at a serious level, and my son, when he's done within 24 to 36 hours, he goes onto Taka.io, the software program, our partners, and he can see videos of all the key plays that he made, the pluses and the minuses and it helps him evaluate his game he works with his coach and it makes him better, and I gotta tell you, I didn't see that coming probably even five or 10 years ago that 43,000 kids have access to that.\"With players like Alex Freeman and Obed Vargas making the jump to top level European leagues this year and others like Cavan Sullivan set to follow in the future, the impact of MLS Next on youth soccer can't be understated as well as the impact that the United Soccer League has in offering more pathways and opportunities for people to play and learn about soccer who may not have previously been able to.Capitalizing on the World Cup waveWhile there's optimism about what MLS can gain from the World Cup, it's critical to catch soccer fans soon after the World Cup. It's easier to do when the league can now say, \"Look at these players who were at the World Cup, you can keep watching them in MLS,\" which isn't something that could've been said to this degree in previous World Cups outside of members of North American national teams. Truth be told, 2022 was a banner year for MLS at the World Cup, and the 2026 edition is set to be even bigger. Messi joined MLS in the following summer, and he won the Ballon d'Or as a member of Inter Miami for his production in 2022.\nLionel Messi's 2023 Ballon d'Or was awarded to him as a member of Inter Miami. \n                                                                    Getty Images\n                                                            \"During the last two years, in total attendance, we were the second-highest attended league in the world behind the Premier League. And I wouldn't have imagined that either,\" Courtemanche said. \"So look, the world's game is here. It's continuing. And even during the World Cup in 2022, we had 37 players from Major League Soccer competing for various national teams. That was more than any other league in the Western Hemisphere.\"But how that conversion is done is critical. Just because someone watches the World Cup doesn't mean that they'll automatically decide that MLS is the league for them, but the league will need to ensure that it capitalizes on those people sampling soccer to turn them into domestic fans.\"One of the things that has happened after every World Cup in recent times is that the domestic league that plays in the host country receives a big boost,\" Hunt said. \"If you look at the attendance numbers, the TV viewership, in the year or two after a country hosts the World Cup, those numbers grow significantly. And I think in a country like the United States, where we still have an opportunity to create a lot of new soccer fans, I think that'll be particularly pronounced. And so MLS will have a real opportunity to benefit both in terms of fans attending games and watching the league on TV. So I think that's very exciting for Major League Soccer and something that we need to make sure we capitalize on.\"\nMLS isn't a league that has been around for the vast majority of Americans' lives like some other places that have hosted World Cups, but with a fandom that tends to a younger demographic, the league can set itself up well for the next 30-plus years, although, hopefully, it won't take that long for the World Cup to return to America. Soccer in America has come a long way since the last World Cup, and it could be unrecognizable, taking another look back in the future, in a good way, considering the successes that have happened since the MLS' founding. American players have taken massive steps over the last several years, and MLS has as well. They are counting on their growth to continue, be further cultivated by the World Cup, and for the next set of years to bring exponential growth initial founders could have only dreamed of.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How MLS built a 30-year run to 2026 World Cup with risks, a plan and hope - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/1a5b8e30-7809-4267-929b-60d51f9dc5ff/thumbnail/1200x675/87f590befcf799c8645d14dfcb172a4f/mls-1.jpg"
      ],
      "datePublished": "2026-02-21T02:33:35.000Z",
      "dateModified": "2026-02-21T02:33:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1: Purdue topples Indiana behind big night from Trey Kaufman-Renn - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-top-25-and-1-purdue-indiana-trey-kaufman-renn/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/9652406e-ca77-4534-a50c-8ff9ba6d423a/thumbnail/1200x675/419324ea08c87fbcd4490129a06b1c29/purdue-rankings.jpg",
    "tag": "Sports",
    "date": "2026-02-21T15:42:45.000Z",
    "description": "\n\n\n    \n                                    \n                                    Purdue's senior star dropped 20 points on Friday as the Boilermakers ",
    "body": "\n\n\n    \n                                    \n                                    Purdue's senior star dropped 20 points on Friday as the Boilermakers cruised to an easy victory over the Hoosiers\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 21, 2026\n                            \n                    at\n    9:27 am ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Trey Kaufman-Renn was ninth among vote-getters for the AP Preseason All-America Team after averaging 20.1 points and shooting 59.5% from the field in 36 games as a junior.His senior year has not been as productive.The 6-foot-9 senior entered Friday's game with Indiana averaging only 13.0 points while shooting 55.6% from the field. Obviously, those are still good numbers -- but not All-America-level numbers. So Kaufman-Renn hasn't really been a part of the national conversation this season, even as Purdue has positioned itself to likely be a No. 2 seed in Saturday's NCAA March Madness Bracket Preview that's scheduled to air at 12:30 p.m ET on CBS.He was great against IU, though.The 6-foot-9 forward took 10 shots, made eight of them and finished with 20 points, six rebounds and five assists in the Boilermakers' 93-64 win over their in-state rivals. He was the biggest reason Purdue recorded its highest point total in the series since scoring 94 against the Hoosiers in 1998. He was also the biggest reason Purdue had its largest margin of victory against the Hoosiers since beating them by 44 points in 1969, and he was among the biggest reasons the Boilermakers shot 64.7% from the field, which is the highest single-game field-goal percentage recorded by Purdue since Matt Painter became coach in 2005.When asked about that late Friday, Painter said this: \"[It was] just our ability to make shots. ... Fletcher Loyer has a perfect game [5 of 5 from the field for 18 points]. Doesn't miss. Omer [Mayer] comes off the bench and ... gets his career-high [18 points]. ... Rivalries are great in college basketball. They really are. It's great for the fans. It's great for the players.\"\nPurdue remains No. 8 in Saturday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings, where Michigan is No. 1 for the 11th straight day. Next up for the Boilermakers is Thursday's game against Michigan State. KenPom.com projects them as 6-point favorites in that game inside Mackey Arena.Top 25 And 1 rankings\n        Biggest Movers\n    RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Michigan\n                                \n                            Elliott Cadeau finished with 17 points and seven assists in Tuesday's 91-80 win at Purdue. The Wolverines' next game is Saturday against Duke.\n                        \n                            --\n                        \n                            25-1\n                        \n                                2\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 22 points and 12 rebounds in Monday's 101-64 win over Syracuse. The Blue Devils' next game is Saturday against Michigan.\n                        \n                            --\n                        \n                            24-2\n                        \n                                3\n                            \n                                    Arizona\n                                \n                            Anthony Dell'Orso finished with 22 points and four rebounds in Wednesday's 75-68 win over BYU. The Wildcats' next game is Saturday at Houston.\n                        \n                            --\n                        \n                            24-2\n                        \n                                4\n                            \n                                    Iowa St.\n                                \n                            Joshua Jefferson finished with 12 points and six rebounds in Monday's 70-67 win over Houston. The Cyclones' next game is Saturday at BYU.\n                        \n                            --\n                        \n                            23-3\n                        \n                                5\n                            \n                                    Houston\n                                \n                            Isiah Harwell missed five of the six shots he attempted in Monday's 70-67 loss at Iowa State. The Cougars' next game is Saturday against Arizona.\n                        \n                            --\n                        \n                            23-3\n                        \n                                6\n                            \n                                    Florida\n                                \n                            Alex Condon finished with 20 points and 10 rebounds in Tuesday's 76-62 win over South Carolina. The Gators' next game is Saturday at Ole Miss.\n                        \n                            --\n                        \n                            20-6\n                        \n                                7\n                            \n                                    Illinois\n                                \n                            Andrej Stojakovic finished with 22 points and three rebounds in Wednesday's 101-65 win at USC. The Illini's next game is Saturday at UCLA.\n                        \n                            --\n                        \n                            22-5\n                        \n                                8\n                            \n                                    Purdue\n                                \n                            Trey Kaufman-Renn finished with 20 points and six rebounds in Friday's 93-64 win over Indiana. The Boilermakers' next game is Thursday against Michigan State.\n                        \n                            --\n                        \n                            22-5\n                        \n                                9\n                            \n                                    Nebraska\n                                \n                            Sam Hoiberg missed six of the eight shots he attempted in Tuesday's 57-52 loss at Iowa. The Cornhuskers' next game is Saturday against Penn State.\n                        \n                            --\n                        \n                            22-4\n                        \n                                10\n                            \n                                    Kansas\n                                \n                            Darryn Peterson finished with 23 points and two rebounds in Wednesday's 81-69 win at Oklahoma State. The Jayhawks' next game is Saturday against Cincinnati.\n                        \n                            --\n                        \n                            20-6\n                        \n                                11\n                            \n                                    UConn\n                                \n                            Alex Karaban missed five of the six shots he attempted in Wednesday's 91-84 loss to Creighton. The Huskies' next game is Saturday at Villanova. The Huskies' next game is Saturday at Villanova.\n                        \n                            --\n                        \n                            24-3\n                        \n                                12\n                            \n                                    Gonzaga\n                                \n                            Graham Ike finished with 22 points and two rebounds in Wednesday's 80-59 win at San Francisco. The Zags' next game is Saturday against Pacific.\n                        \n                            --\n                        \n                            26-2\n                        \n                                13\n                            \n                                    Virginia\n                                \n                            Thijs De Ridder finished with 22 points and five rebounds in Wednesday's 94-68 win at Georgia Tech. The Cavaliers' next game is Saturday against Miami.\n                        \n                            --\n                        \n                            23-3\n                        \n                                14\n                            \n                                    Michigan St.\n                                \n                            Jeremy Fears Jr. finished with 16 points and 10 assists in Tuesday's 82-59 win over UCLA. The Spartans' next game is Sunday against Ohio State.\n                        \n                            --\n                        \n                            21-5\n                        \n                                15\n                            \n                                    Vanderbilt\n                                \n                            Tyler Harris missed five of the six shots he attempted in Wednesday's 81-80 loss at Missouri. The Commodores' next game is Saturday against Tennessee.\n                        \n                            --\n                        \n                            21-5\n                        \n                                16\n                            \n                                    St. John's\n                                \n                            Bryce Hopkins finished with 23 points and 10 rebounds in Wednesday's 76-70 win at Marquette. The Red Storm's next game is Saturday against Creighton.\n                        \n                            --\n                        \n                            21-5\n                        \n                                17\n                            \n                                    Alabama\n                                \n                            Labaron Philon Jr. finished with 35 points and seven assists in Wednesday's 117-115 double-overtime win over Arkansas. The Crimson Tide's next game is Saturday at LSU.\n                        \n                            --\n                        \n                            19-7\n                        \n                                18\n                            \n                                    Arkansas\n                                \n                            Malique Ewin missed all four shots he attempted in Wednesday's 117-115 double-overtime loss at Alabama. The Razorbacks' next game is Saturday against Missouri.\n                        \n                            --\n                        \n                            19-7\n                        \n                                19\n                            \n                                    Texas Tech\n                                \n                            Jaylen Petty missed five of the six shots he attempted in Tuesday's 72-67 loss at Arizona State. The Red Raiders' next game is Saturday against Kansas State.\n                        \n                            --\n                        \n                            19-7\n                        \n                                20\n                            \n                                    Miami (Ohio)\n                                \n                            Luke Skaljac finished with 24 points and four assists in Friday's 91-77 win over Bowling Green. The RedHawks' next game is Tuesday at Eastern Michigan.\n                        \n                            --\n                        \n                            27-0\n                        \n                                21\n                            \n                                    Tennessee\n                                \n                            Nate Ament finished with 29 points and six rebounds in Wednesday's 89-66 win over Oklahoma. The Vols' next game is Saturday at Vanderbilt.\n                        \n                            --\n                        \n                            19-7\n                        \n                                22\n                            \n                                    BYU\n                                \n                            Mihailo Boskovi missed all three shots he attempted in Wednesday's 75-68 loss to Arizona. The Cougars' next game is Saturday against Iowa State.\n                        \n                            --\n                        \n                            19-7\n                        \n                                23\n                            \n                                    Louisville\n                                \n                            Ryan Conwell missed 12 of the 16 shots he attempted in Tuesday's 95-85 loss at SMU. The Cardinals' next game is Saturday against Georgia Tech.\n                        \n                            --\n                        \n                            19-7\n                        \n                                24\n                            \n                                    Utah St.\n                                \n                            Mason Falslev finished with 17 points and three rebounds in Wednesday's 75-56 win over Boise State. The Aggies' next game is Saturday at Nevada.\n                        \n                            --\n                        \n                            23-3\n                        \n                                25\n                            \n                                    Saint Louis\n                                \n                            Kellen Thames finished with 16 points and five steals in Friday's 88-75 win over VCU. The Billikens' next game is Tuesday at Dayton.\n                        \n                            --\n                        \n                            25-2\n                        \n                                26\n                            \n                                    Villanova\n                                \n                            Acaden Lewis finished with 21 points and seven rebounds in Wednesday's 92-89 overtime win at Xavier. The Wildcats' next game is Saturday against UConn.\n                        \n                            --\n                        \n                            21-5\n                        \n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1: Purdue topples Indiana behind big night from Trey Kaufman-Renn - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/9652406e-ca77-4534-a50c-8ff9ba6d423a/thumbnail/1200x675/419324ea08c87fbcd4490129a06b1c29/purdue-rankings.jpg"
      ],
      "datePublished": "2026-02-21T15:42:45.000Z",
      "dateModified": "2026-02-21T15:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology Bubble Watch: Miami (Ohio) beats Bowling Green, remains undefeated - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-bubble-watch-miami-ohio-vcu-for-ncaa-tournament/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/d91a3b7e-ada3-4441-b6b1-eac8b3a9972f/thumbnail/1200x675/27be8e7ca8357118d842d5751c770ab2/miami-bubble.jpg",
    "tag": "Sports",
    "date": "2026-02-21T05:42:39.000Z",
    "description": "\n        No. 22 Miami (Ohio) began a busy weekend of bubble action in college basketball on Friday night by improving to 27-0 with a 91-77 win over Bo",
    "body": "\n        No. 22 Miami (Ohio) began a busy weekend of bubble action in college basketball on Friday night by improving to 27-0 with a 91-77 win over Bowling Green. With zero Quad 1 wins on their resume, the Redhawks' margin for error remains slim. But that's been the case all season, and it hasn't deterred Miami from reaching perfection thus far.The night was less joyous for VCU, which remained just on the wrong side of the bubble after a 88-75 loss at No. 18 Saint Louis. The Rams led 42-33 at halftime but were flummoxed by the Billikens in the second half of a pivotal Atlantic 10 battle. Those results serve as table setters for a massive Saturday around the country.As college basketball's regular season heads down the stretch, the NCAA Tournament bubble is popping. Every day is bringing a new wrinkle to the picture along the cut line for the field of 68, and the CBS Sports Bracketology model remains on top of it all.The at-large fate of a couple dozen teams is up in the air, with big brands such as Auburn and UCLA fighting for their lives, just to name a couple. Saturday's results will bring a new shakeup to the picture.Here is the full bubble breakdown entering a busy day.  Check out the CBS Sports Bracketology model's latest bracket at the Bracketology hub                                \nAll times ET                  Bubble teams in action Saturday\n                            \n    \n                                                \n                    \n    MissouriSaturday at No. 20 Arkansas | 4 p.m. (ESPN)Entering the weekend: Last Four InGame status: Quad 1Missouri picked up another \"Quad 1A\" win on Wednesday against Vanderbilt, which adds to a tally that also includes victories over Florida and at Kentucky. At 18-8 (8-5 SEC), the Tigers are held back by a soft nonconference slate that included eight Quad 4 games. But they have clearly demonstrated some high-end potential and could do so again by taking down Arkansas on the road. If not, a big home game game with Tennessee is up next.\n                            \n    \n                                                \n                    \n    USCSaturday vs. Oregon | 4 p.m. (FS1)Entering the weekend: No. 11 seedGame status: Quad 3\nIllinois ran USC off its own floor on Wednesday night by a score of 101-65. Other than a Jan. 25 win at Wisconsin, which is aging well, the Trojans don't have another victory over a team currently expected to make the Big Dance. The status of leading scorer Chad Baker-Mazara is a huge storyline here. The well-traveled wing has missed three straight games for what's been termed as a knee strain. USC should beat Oregon with or without Baker-Mazara, but his status will be key moving forward. \n                            \n    \n                                                \n                    \n    TCUSaturday vs. West Virginia | 5 p.m. (Peacock)Entering the weekend: Last Four InGame status: Quad 2TCU's roller-coaster resume includes wins over Florida and Iowa State along with losses to New Orleans, Notre Dame and Utah. Most recently, the Horned Frogs took an 82-71 loss at UCF on Tuesday. That's a non-fatal Quad 1 loss, but it ratchets up the pressure on TCU to hold serve against West Virginia and Arizona State at home over the next few days. The demonstration of some consistency would likely be reassuring to the selection committee as it seeks to decipher a wonky resume.\n\n                            \n    \n                                                \n                    \n    West VirginiaSaturday at TCU | 5 p.m. (Peacock)Entering the weekend: Next Four OutGame status: Quad 1Given West Virginia's controversial exclusion last season, Mountaineers fans are likely bracing for impact here. After a 61-56 Quad 3 home loss to Utah on Wednesday, they should be. WVU is in desperation mode as it heads to TCU for a must-win game. It would take a strong finish -- think 4-1 -- to get WVU back in the mix heading into the Big 12 Tournament. Undersized flamethrower Honor Huff needs to get on a legendary heater from 3-point range.\n                            \n    \n                                                \n                    \n    Seton HallSaturday vs. Georgetown | 6 p.m. (FS1)Entering the day: Next Four OutGame status: Quad 3\nSeton Hall's Wednesday home loss against DePaul plunged the Pirates into desperation mode. Their resume metrics are hovering in the mid-to-high 50s, and their predictive metrics are in the same neighborhood. Beating Georgetown won't help much, but losing to the Hoyas would likely be the final straw. Beating UConn on the road on Feb. 28 is Seton Hall's best hope for a life raft.\n                            \n    \n                                                \n                    \n    San Diego StateSaturday at Colorado State | 6 p.m. (CBS Sports Network)Entering the day: Next Four OutGame status: Quad 2You might expect a road game against Colorado State to fall in Quad 1. But because the Rams (16-10, 7-8 Mountain West) are lagging a bit in the NET, this is a Quad 2 game for San Diego State. If the Aztecs take care of business here, they will be in position to make a late charge since they have likely Quad 1 showdowns with Utah State, New Mexico and Boise State on deck.\n\n                            \n    \n                                                \n                    \n    CalSaturday vs. Stanford | 6 p.m. (ACC Network)Entering the day: First Four OutGame status: Quad 2Beating Stanford is always important for Cal, but this one has extra meaning since the Bears are trying to fight their way back into field. The home stretch is fairly light from a scheduling perspective, so Cal needs to stack some victories if it wants to enter the ACC Tournament with legitimate at-large hope.\n                            \n    \n                                                \n                    \n    UCLASaturday vs. No. 10 Illinois | 8 p.m. (Fox)Entering the weekend: No. 9 seedGame status: Quad 1\nUCLA is hanging on to the last No. 9 seed in CBS Sports Bracketology, but the Bruins have little margin for error. Where they sit, the bubble gets steep in a hurry. After taking two blowout losses on a trip to Michigan, UCLA now must contend with an Illinois team that has been hanging out in southern California for a few days since drubbing USC 101-65.\n                            \n    \n                                                \n                    \n    New MexicoSaturday at Fresno State | 8 p.m. (CBS Sports Network)Entering the weekend: Last Four InGame status: Quad 3A likely Quad 1 showdown at Nevada is up next, but New Mexico can't afford to look ahead as it travels to face a Fresno State team that could play a spoiler role. The Lobos average out at around 46th in both resume and predictive metrics, which puts them squarely on the bubble. While they are in the field for now, they would be subject to expulsion if bid thieves emerge.\n\n                            \n    \n                                                \n                    \n    AuburnSaturday vs. Kentucky | 8:30 p.m. (ESPN)Entering the weekend: First Four OutGame status: Quad 1Playing Kentucky at home is right on the threshold of what's considered a Quad 1 game. But don't get caught up in that. Auburn has lost five straight games and needs a victory over somebody -- anybody -- to stop the slide and regain traction. The Tigers have decent metrics, but at 14-12 (5-8 SEC) they will be a tough sell if they are hovering around .500 on Selection Sunday.\n                            \n    \n                                                \n                    \n    Texas A&MSaturday at Oklahoma | 8:30 p.m. (SEC Network)Entering the weekend: No. 10 seedGame status: Quad 1\nTexas A&M squeaked out a must-win home game against Ole Miss on Wednesday to stop a four-game losing streak. The work continues with back-to-back road games against Oklahoma and Arkansas as first-year coach Bucky McMillan seeks to lead an overhauled Aggies roster to the Big Dance. Regardless of who the coach is, A&M always seems to endure violent swings in league play, and this year is no different.\n                            \n    \n                                                \n                    \n    UCFSaturday at Utah | 9 p.m. (ESPN+)Entering the weekend: No. 10 seedGame status: Quad 2UCF snapped out of a three-game skid by toppling TCU in a double bubble battle on Tuesday. Beating Utah is paramount to keeping things on track for the Knights, who have a solid resume but lagging predictive metrics. The Utes just slayed West Virginia on the road, so they should have the full attention of UCF.\n\n                            \n    \n                                                \n                    \n    Saint Mary'sSaturday at Washington State | 10 p.m. (ESPN2)Entering the weekend: Last Four InGame status: Quad 2Saint Mary's narrowly avoided disaster by edging Seattle 72-70 on Wednesday, skirting what would have been its worst loss. Now comes another tricky game as the Gaels head to face Washington State. The first meeting was an 88-82 home win for Saint Mary's, which needs to stay on track before closing the regular season against WCC stalwarts Santa Clara and Gonzaga. \n                            \n    \n                                                \n                    \n    Santa ClaraSaturday at San Francisco | 10 p.m. (CBS Sports Network)Entering the day: Last Four InGame status: Quad 2Santa Clara came up short in a potential resume-defining opportunity against Gonzaga last Saturday. Another chance for a statement comes Wednesday at Saint Mary's, when the Broncos will go for a season sweep of the Gaels. For now, beating San Francisco would be highly advisable if Santa Clara wishes to stay on the right side of the bubble heading into the final week of the WCC regular season.\n                            \n    \n                                                \n                    \n    Ohio State Sunday at No. 15 Michigan State | 1 p.m. (CBS)Entering the day: First Four OutGame status: Quad 1 Ohio State is still searching for its first Quad 1 win. The Buckeyes are 0-8 in Q1, 6-1 in Q2 and spotless across Quads 3/4. Their predictive metrics average out around 37th nationally, which is good. The resume is simply in need of a boost. Clearly, slaying Michigan State inside the Breslin Center would be a jolt for their at-large hopes. Even if it doesn't happen, a forthcoming road game against Iowa and a home game against Purdue are still waiting.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology Bubble Watch: Miami (Ohio) beats Bowling Green, remains undefeated - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/d91a3b7e-ada3-4441-b6b1-eac8b3a9972f/thumbnail/1200x675/27be8e7ca8357118d842d5751c770ab2/miami-bubble.jpg"
      ],
      "datePublished": "2026-02-21T05:42:39.000Z",
      "dateModified": "2026-02-21T05:42:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas vs. Cincinnati prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-vs-cincinnati-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/1bf6f870-2449-4e60-9c7f-848abf16ba3b/thumbnail/1200x675/bca03ccfd45cf569668a599299c7c006/cbb-cincinnati-kansas-hqslate-1920x1080-sat.jpg",
    "tag": "Sports",
    "date": "2026-02-20T23:19:44.000Z",
    "description": "\n        No. 8 Kansas controls its own destiny in a Big 12 Championship race that is shaping up to be an all-timer. The Jayhawks are 10-3 in conferenc",
    "body": "\n        No. 8 Kansas controls its own destiny in a Big 12 Championship race that is shaping up to be an all-timer. The Jayhawks are 10-3 in conference play, just one game behind Arizona and Houston. Kansas gets to play both of the Big 12's top dawgs in the next eight days, but it can't afford to have any other hiccups starting Saturday against a Cincinnati club that has underwhelmed this year (14-12, 6-7 in Big 12 play) but has shown an ability to play up and beat an Iowa State team that is trending to be a No. 2 seed. Of course, Darryn Peterson's status remains the biggest story. He scored 23 brilliant points in just 19 minutes against Oklahoma State before asking out with another cramping episode. \"I didn't anticipate that tonight at all,\" Kansas coach Bill Self told reporters. \"I thought he was good to go, but obviously, we only got 18 minutes. That's disappointing 'cause he could have had a really good night.\" \n        \n            \n                Kansas' Bill Self gets candid on Darryn Peterson 'checking out': What's right, what's 'false', what's next\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \nThe saga continues with no end in sight. Let's dive into the X's and O's of this Big 12 tilt.   Kansas vs. Cincinnati: Need to know Who gets the Baba Miller assignment? Miller is having the best season of his career, even amidst a miserable 3-point shooting slump. The 6-foot-11 Cincinnati forward is firmly a post-hype sleeper who has blossomed into one of the best mismatch forwards in the Big 12. But Kansas has plenty of options. Flory Bidunga has been Kansas' problem-solver defensively this season. Against BYU, he pivoted to guarding dynamic wing AJ Dybantsa. Against Texas Tech, he got the JT Toppin assignment. But Cincinnati is a bit of a tougher matchup. Do you put Bidunga on 7-foot big man Moustapha Thiam and let freshman Bryson Tiller take a turn on Miller? Tiller has been a pleasant surprise for KU this year and has the frame and athleticism to handle Miller. Or do you let Bidunga, the frontrunner for Big 12 Defensive Player of the Year, try to slow down Miller and trust Tiller to handle the Thiam assignment?  \nThe transition seesaw: When these two defenses get set, they can both be pretty nasty. That raises the stakes of each transition possession. You just have to take advantage because there won't be a ton of clean looks in the halfcourt.  Role players in the spotlight: Kansas needs to get Tre White humming again. The well-traveled wing has been so good for the Jayhawks, but he's lost a bit of his steam lately. Part of that could be the after-effects from dealing with a painful root canal procedure. This could be a get-right spot for White. On paper, he has a tasty individual matchup with Cincinnati's Jalen Celestine, who is mainly on the floor to make 3-pointers, not strap up defensively. A good day for White could tilt the scales here. On the other hand, Cincinnati guard Sencire Harris is one of the best point-of-attack defenders in the sport. When he's on the floor, he will get right up into Melvin Council Jr. or Darryn Peterson. Kansas can't let Harris change the game with his energy. He is a total dawg who ain't afraid of anybody.  Where to watch Kansas vs. Cincinnati live Date: Saturday, Feb. 21| Time: 1 p.m. ET Location: Allen Fieldhouse -- Lawrence, Kansas TV: CBS | Live stream: CBSSports.com, CBS Sports App Streaming on Paramount+ Premium    Kansas vs. Cincinnati prediction, pick \nKansas has plenty of schematic edges in this one, but Cincinnati could be a touch undervalued here in a game that could be a low-possession affair between two defenses that give each other problems. The double-big lineup of Miller and Thiam is mobile enough to hang with Bidunga and Tiller, and Cincinnati's guards won't give up straight-line drives to Council. Cincinnati will unquestionably flood the paint and force Kansas' low-volume 3-point shooters to bomb away over the top. That's the right strategy against everyone on this Kansas roster, except for Peterson. There's also the lookahead spot to Kansas' enormous Big Monday tilt with No. 4 Houston, and if Peterson misses a good chunk of the second half again — which feels inevitable — the door is open for a backdoor cover. Kansas wins but Cincinnati stays inside this number. Pick: Cincinnati +11.5\n  \t \t  \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            KU -11.5\n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cincinnati\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cincinnati\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas vs. Cincinnati prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/1bf6f870-2449-4e60-9c7f-848abf16ba3b/thumbnail/1200x675/bca03ccfd45cf569668a599299c7c006/cbb-cincinnati-kansas-hqslate-1920x1080-sat.jpg"
      ],
      "datePublished": "2026-02-20T23:19:44.000Z",
      "dateModified": "2026-02-20T23:19:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]