[
  {
    "title": "Miami vs. Texas A&M prediction, odds: 2025 College Football Playoff picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-texas-a-m-prediction-odds-time-2025-college-football-playoff-first-round-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/29/bda2e048-126f-4ed5-a12a-a91f9989d00b/thumbnail/1200x675/087a1a0b45264b24528e004bed3214a0/carson-beck-miami-hurricanes-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-20T01:01:11.000Z",
    "description": "\n        A Saturday tripleheader of 2025 College Football Playoff first-round games begins with the No. 7 Texas A&M Aggies hosting the No. 10 Miami (F",
    "body": "\n        A Saturday tripleheader of 2025 College Football Playoff first-round games begins with the No. 7 Texas A&M Aggies hosting the No. 10 Miami (Fla.) Hurricanes. The Aggies (11-1) won their first 11 games before falling to the Texas Longhorns, 27-17, on Nov. 28. The Hurricanes (10-2) have won four in a row and last defeated Pitt, 38-7, on Nov. 29. This 2025 CFP First Round Game will be the third meeting between the programs since 2022, with the teams splitting the first two matchups.Kickoff is at noon ET from Kyle Field in College Station, Texas. The Hurricanes prevailed 48-33 when the teams last met in Miami in 2023. The Aggies are 3.5-point favorites in the latest Miami vs. Texas A&M odds, while the over/under is 48.5. Before making any Texas A&M vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Texas A&M vs. Miami. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Miami vs. Texas A&M:Texas A&M vs. Miami spreadTexas A&M -3.5 at DraftKings SportsbookTexas A&M vs. Miami over/under48.5 pointsTexas A&M vs. Miami money line Texas A&M -158, Miami +132Texas A&M vs. Miami picksSee picks at SportsLineTexas A&M vs. Miami streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. Why Miami can coverMiami has played up to the level of its competition in 2025, going 4-0 both straight-up and against the spread versus ranked opponents. Additionally, the Aggies have struggled versus the line since Mike Elko came onboard in 2024, as A&M is just 8-17 ATS since then, with that 32% cover rate being the third-worst amongst Power Conference teams over that span. QB Carson Beck tops the ACC in both completion rate (74.7%) and passing rating (165.8), and his top target, Malachi Toney, is coming off back-to-back games with 125+ receiving yards and a touchdown. That offensive firepower sometimes overshadow the fact that Miami also has the No. 6 scoring defense in FBS and allowed just 16.3 points to its four ranked opponents. See which team to back at SportsLine.Why Texas A&M can coverMiami has a recent history of not showing up for bowl games as the Canes have lost six in a row, which is one shy of the longest active streak in the nation. Additionally, Miami is on an eight-game road losing streak versus AP Top-10 teams. Those trends will bring A&M confidence, as will having dynamic playmakers on both sides of the ball. QB Marcel Reed led the SEC with 14 yards per completion and is a threat with both his arm and legs. Reed has more games with 4+ total touchdowns (four) than he has with one or fewer touchdowns (three). Meanwhile, on defense, DE Cashius Howell's 11.5 sacks top the SEC and rank fourth-most in all of FBS. See which team to back at SportsLine.How to make Miami vs. Texas A&M picksAfter simulating Texas A&M vs. Miami 10,000 times, SportsLine's model is going Over on the total as the teams combine for 61 points. The model also says one side of the spread hits almost 60% of the time in an A-rated pick. You can see the model's pick at SportsLine.  So who wins Miami vs. Texas A&M, and which side of the spread hits almost 60% of the time in an A-rated pick? Visit SportsLine now to see which side of the Texas A&M vs. Miami spread to jump on, all from the advanced model that's up on its top-ranked money-line picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami vs. Texas A&M prediction, odds: 2025 College Football Playoff picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/29/bda2e048-126f-4ed5-a12a-a91f9989d00b/thumbnail/1200x675/087a1a0b45264b24528e004bed3214a0/carson-beck-miami-hurricanes-imagn-images.jpg"
      ],
      "datePublished": "2025-12-20T01:01:11.000Z",
      "dateModified": "2025-12-20T01:01:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Jake Paul vs. Anthony Joshua fight: Start time, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jake-paul-anthony-joshua-where-to-watch-fight-stream-live-start-time-card/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/78d1bca6-b6dd-40ab-8216-150a16c92a8d/thumbnail/1200x675/0c2dbf2298f28271f8442f1a68555f43/jake-paul-anthony-joshua-face-off-boxing-netflix-cbs-sports-dec-18-2025.jpg",
    "tag": "Sports",
    "date": "2025-12-20T02:30:40.000Z",
    "description": "\n        Jake Paul faces an enormous new challenge. On Friday, two-time unified heavyweight champion Anthony Joshua tests Paul's resilience against a ",
    "body": "\n        Jake Paul faces an enormous new challenge. On Friday, two-time unified heavyweight champion Anthony Joshua tests Paul's resilience against a larger, more decorated boxer with athleticism to spare. Paul vs. Joshua headlines Netflix's latest boxing card from the Kaseya Center in Miami.Paul, to his credit, is fighting an uphill battle on Friday. The social influencer-turned-boxer made strides in the fight game by targeting the most popular opponents whom he had the greatest physical advantages over, namely, in terms of size, age, or both. Standing across from Paul on Friday is former heavyweight champ Joshua: a stronger, bigger, more powerful, and far more experienced foe. Joshua admits that anything short of a swift victory would be a failure on his part.Be sure to keep up with all the action on Saturday with our live coverage, including round-by-round scoring and updated fight results throughout the night!\"Yeah, 100%. This is the Giants vs the Patriots 2007. I mean, the list goes on, but the odds are stacked against me,\" Paul said at the final press conference. 'There's no sporting teams in history that have gone together where it's this big of a difference in terms of skill, experience, resume, height, weight, etc. So this is going to be the biggest upset in the history of sports and you guys get to witness it.\"\nBet Paul vs. Joshua at DraftKings Sportsbook, where new users get $200 in bonus bets with a winning $5 wager:The undercard features more fighters from under the Most Valuable Promotions banner. That includes recent signing Alycia Baumgardner, who looks to defend her unified junior lightweight titles against Leila Beaudoin in the co-main event. Baumgardner, 31, reached undisputed status at junior lightweight in 2023. She made three defenses of the crown before vacating the WBC title to take this fight. Plus, former UFC champions are set to clash when Anderson Silva, 50, battles Tyron Woodley, 43, at cruiserweight.\"I feel like for me, it's my chance to go forward to increase my legacy. And for once, it's an opportunity for me to fight somebody that brings my value up,\" Woodley said at the final press conference. \"Anderson, that's the type of excitement that I got when the fight was requested. And it didn't take me long. I really said yes almost before we even talked about it, so it's time to get it on. Can't wait.\" \nCBS Sports will be with you throughout the entire way on Friday, beginning with the start of the main card broadcast at 8 p.m. ET, so be sure to follow along with the live results and highlights. Be sure to check out our predictions and expert picks for the main event.Watch Jake Paul vs. Anthony JoshuaDate: Friday, Dec. 19Location: Kaseya Center -- MiamiStart time: 8 p.m. ETWatch live: Netflix | Price: $7.99 and up in the United StatesJake Paul vs. Anthony Joshua match cardOdds via DraftKings SportsbookAnthony Joshua -1200 vs. Jake Paul +700, heavyweightsAlycia Baumgardner (c) -1400 vs. Leila Beaudoin +750, unified junior lightweight titleAnderson Silva -275 vs. Tyron Woodley +210, cruiserweightsJahmal Harvey -3500 vs. Kevin Cervantes +1300, junior lightweightsWho wins Anthony Joshua vs. Jake Paul on Dec. 19, and which massive longshot prop should you target for a huge payday? Visit SportsLine now to see Josh Nagel's best bets for the Friday, Dec. 19, heavyweight bout, all from the combat sports specialist who has covered the sport for more than 20 years, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Jake Paul vs. Anthony Joshua fight: Start time, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/78d1bca6-b6dd-40ab-8216-150a16c92a8d/thumbnail/1200x675/0c2dbf2298f28271f8442f1a68555f43/jake-paul-anthony-joshua-face-off-boxing-netflix-cbs-sports-dec-18-2025.jpg"
      ],
      "datePublished": "2025-12-20T02:30:40.000Z",
      "dateModified": "2025-12-20T02:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anderson Silva scores knockout of Tyron Woodley on Jake Paul vs. Anthony Joshua undercard - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/anderson-silva-tyron-woodley-results-knockout-jake-paul-vs-anthony-joshua-undercard/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/bde23b79-af55-4dc3-83be-40f14189a816/thumbnail/1200x675/b79a5955a4dcf93c978dc9a3fbef9567/anderson-silva-woodley-ko.jpg",
    "tag": "Sports",
    "date": "2025-12-20T03:00:10.000Z",
    "description": "\n        At the age of 50, UFC Hall of Famer Anderson Silva is still creating viral moments in combat sports. Silva (4-2, 3 KOs) continued his transit",
    "body": "\n        At the age of 50, UFC Hall of Famer Anderson Silva is still creating viral moments in combat sports. Silva (4-2, 3 KOs) continued his transition into professional boxing on Friday by stopping fellow former UFC champion Tyron Woodley (0-3, 0 KOs) in Round 2 of their cruiserweight bout inside the Kaseya Center in Miami. The scheduled six-round bout took place on the undercard of Jake Paul-Anthony Joshua. In his first pro bout since losing a unanimous decision to Paul in 2022, Silva broke open a slow start by backing Woodley up to the ropes. After tapping his right foot with his glove, in a tribute to his boxing hero Roy Jones Jr., Silva followed up by feinting a left cross to bring up Woodley's guard before uncorking a flush right uppercut from the southpaw stance. Be sure to keep up with all the action on Saturday with our live coverage, including round-by-round scoring and updated fight results throughout the night!\nSilva followed up with a trio of short hooks to drop the 43-year-old Woodley, who lost a pair of fights to Paul in 2021, onto his face. Even though Woodley beat the count, he didn't initially respond to referee Sam Burgos' queue to walk out of the corner on his own power. That led to Burgos, after Silva reached in to touch gloves with Woodley as a form of sportsmanship, waving off the fight at 1:33 of Round 2 after Woodley's corner stopped the bout.\n\"I have young kids [in training camp]  to push me hard every day,\" Silva said. \"The guys kicked my ass in training and I came here and did my best. I'm so happy to be here and continuing doing something I love. This is amazing. I just tried to take my time and my distance. I'm lucky, but lucky is the people training hard. And I'm lucky.\"The stoppage win was yet another impressive performance inside the boxing ring for the ageless Silva following the conclusion of his legendary MMA career. In 2021, Silva upset former world titleholder Julio Cesar Chavez Jr. by split decision before knocking out MMA legend Tito Ortiz in the opening round three months later.  \nSilva, who revealed he will be entering the police academy in Beverly Hills, California, in his way of \"giving back to the United States,\" said after the fight that he would continue his boxing career. Silva, who was originally scheduled to face former MMA rival Chris Weidman until an arm injury forced his withdrawal and Woodley's late addition, called for another chance at Weidman after losing both middleweight title bouts against him in UFC.\"No, that's not my last fight. I keep working and I keep doing something hard. Let's see for the next event with Most Valuable Promotions. Let's see,\" Silva said. \"Chris, I know you hurt your arm, bro. I am awaiting for you to stay better. Let's go show how the ex-UFC fighters can do a good job in boxing. Let's respect the boxing community, that's more important.\"Woodley, a former UFC welterweight champion, remained winless in boxing and suffered his second knockout in three fights. \n\"Obviously, I'm used to MMA where we go out on our shield,\" Woodley said. \"I was yelling at my coach but he made the right call [to stop the fight].\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anderson Silva scores knockout of Tyron Woodley on Jake Paul vs. Anthony Joshua undercard - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/bde23b79-af55-4dc3-83be-40f14189a816/thumbnail/1200x675/b79a5955a4dcf93c978dc9a3fbef9567/anderson-silva-woodley-ko.jpg"
      ],
      "datePublished": "2025-12-20T03:00:10.000Z",
      "dateModified": "2025-12-20T03:00:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jake Paul vs. Anthony Joshua: Fight card, date, odds, start time for Friday fight - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jake-paul-vs-anthony-joshua-fight-card-date-odds-rumors-guide/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/15e99b22-990e-4d30-805a-a4ce84046b51/thumbnail/1200x675/8ec277f0dd31b6e1628a90acd41fae57/jake-paul-anthony-joshua-faceoff.jpg",
    "tag": "Sports",
    "date": "2025-12-20T03:27:14.000Z",
    "description": "\n        The time has nearly arrived for one of the most-anticipated boxing events of the year as we inch toward closing out 2025. The spotlight will ",
    "body": "\n        The time has nearly arrived for one of the most-anticipated boxing events of the year as we inch toward closing out 2025. The spotlight will be on Miami as Jake Paul takes on his literal biggest test yet when he steps in the ring with former unified heavyweight champion Anthony Joshua. It all goes down on Friday night at the Kaseya Center and can be streamed live on Netflix.Paul has become one of boxing's biggest stars through careful matchmaking, expert promotion, world class training and solid athleticism. Over the last five years he's accumulated a 12-1 record by beating former UFC champions and stars with little boxing experience, smaller foes, and a nearly 60-year-old Mike Tyson.Be sure to keep up with all the action on Saturday with our live coverage, including round-by-round scoring and updated fight results throughout the night!Joshua, meanwhile, is one of the sport's most decorated champions of his era. He earned gold at the 2012 Olympics before turning pro and earning the unified heavyweight titles. While he has yet to secure the desired matchups against Tyson Fury or Deontay Wilder, Joshua did have two chances against Oleksandr Usyk for the undisputed crown, but came up short in both instances.\"It's my job. We fight. We're licensed to kill. I'm sure many people don't understand it, but this is what my job is,\" Joshua said at the final press conference. \"When you're in that ring, it's a dangerous place to be and anything can happen. You hope your opponent leaves the ring safely, but if they don't, you still have to go to bed knowing that you just done your job. It wasn't personal.\"\nBet Paul vs. Joshua at DraftKings Sportsbook, where new users get $200 in bonus bets with a winning $5 wager:Below is the complete fight card for Paul vs. Joshua along with the latest odds. Check back all week long for the latest news, features and other content around this massive event.Jake Paul vs. Anthony Joshua fight card, odds, resultsOdds via DraftKings Sportsbook\nAnthony Joshua -1200 vs. Jake Paul +700, heavyweightsAlycia Baumgardner (c) -1400 vs. Leila Beaudoin +750, unified junior lightweight titleAnderson Silva def. Tyron Woodley via second-round TKOJahmal Harvey def. Kevin Cervantes via unanimous decision (60-53, 60-53, 60-53)Where to watch Jake Paul vs. Anthony JoshuaDate: Dec. 19Location: Kaseya Center -- MiamiStart time: 8 p.m. ET (Main card) How to watch: Netflix (subscription required)Paul vs. Joshua countdownStaff picks and predictions for the main eventCampbell: Paul makes smart business move in taking on JoshuaFighters make predictions on Paul vs. JoshuaJoshua admits it's a 'failure' if he doesn't knockout Paul in Round 1Weight limits, glove sizes and other things to know about the fightWho wins Anthony Joshua vs. Jake Paul on Dec. 19, and which massive longshot prop should you target for a huge payday? Visit SportsLine now to see Josh Nagel's best bets for the Friday, Dec. 19, heavyweight bout, all from the combat sports specialist who has covered the sport for more than 20 years, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jake Paul vs. Anthony Joshua: Fight card, date, odds, start time for Friday fight - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/15e99b22-990e-4d30-805a-a4ce84046b51/thumbnail/1200x675/8ec277f0dd31b6e1628a90acd41fae57/jake-paul-anthony-joshua-faceoff.jpg"
      ],
      "datePublished": "2025-12-20T03:27:14.000Z",
      "dateModified": "2025-12-20T03:27:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jake Paul vs. Anthony Joshua fight predictions, odds and expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jake-paul-vs-anthony-joshua-fight-predictions-odds-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/21d2c1f3-de88-4ac8-9c36-e43b7d42d5ce/thumbnail/1200x675/e3002a864ba67e0cfc0931b02b52b847/jake-paul-anthony-joshua-final-presser.jpg",
    "tag": "Sports",
    "date": "2025-12-20T01:25:00.000Z",
    "description": "\n        Are you a boxing fan who has been eagerly awaiting Jake Paul's downfall? Well, you may get their wish on Friday night when the social media i",
    "body": "\n        Are you a boxing fan who has been eagerly awaiting Jake Paul's downfall? Well, you may get their wish on Friday night when the social media influencer-turned-boxer squares off with the biggest test of his career in the form of two-time unified heavyweight champion Anthony Joshua (Netflix, 8 p.m. ET).Paul's career started off as little more than a sideshow, stopping fellow influencer KSI in a white-collar exhibition before knocking out another influencer, AnEsonGib, in his pro debut. Paul's second pro fight saw him score a viral knockout of former NBA star Nate Robinson on the undercard of the highly-watched event headlined by an exhibition between Mike Tyson and Roy Jones Jr.Paul then turned to facing a series of former UFC fighters, defeating Ben Askren, Tyron Woodley (twice) and Anderson Silva. Silva was the only of Paul's first five opponents who had any professional boxing experience, leading to calls for Paul to \"face a real boxer.\"Be sure to keep up with all the action on Saturday with our live coverage, including round-by-round scoring and updated fight results throughout the night!\nPaul did just that in his seventh pro fight, and it resulted in his first loss as Tommy Fury took a split decision win in a fight that saw Paul score a knockdown but ultimately fail to be active enough to win over two of the three ringside judges.After defeating former UFC star Nate Diaz, Paul scored back-to-back knockouts over club-level fighters before stopping another former UFC fighter and current BKFC star, Mike Perry.Bet Paul vs. Joshua at DraftKings Sportsbook, where new users get $200 in bonus bets with a winning $5 wager:\nPaul then faced 57-year-old Mike Tyson in a shameless fight that saw Tyson unable to do much of anything while Paul carried the fight to the judges' scorecards. Another win over an aging former world champion followed as Paul took a decision win over Julio Cesar Chavez Jr.Looking at that resume, you can see a pattern of Paul facing almost exclusively smaller, older and/or completely inexperienced boxers.\n        \n            \n                Jake Paul faces his toughest test to date as he makes a calculated business decision against Anthony Joshua\n                \n                    Brian Campbell                \n            \n                            \n    \n                \n                    \n    \nThat will not be the case on Friday, when Paul faces a much larger man in the 6-foot-6 Joshua, a 2012 Olympic gold medalist and two-time unified heavyweight champion of the world.\n\"Yeah, 100%. This is the Giants vs the Patriots 2007. I mean, the list goes on, but the odds are stacked against me,\" Paul said at the final press conference. \"There's no sporting teams in history that have gone together where it's this big of a difference in terms of skill, experience, resume, height, weight, etc. So this is going to be the biggest upset in the history of sports and you guys get to witness it.\"Bet Paul vs. Joshua at Bet365 Sportsbook, where new users get $150 in bonus bets using the bonus code CBSBET365:While Joshua is past his absolute prime, he is not so far removed as to not be capable of competing with the best heavyweights in the world.\nAfter a 15-0 start to his pro career, Joshua knocked out Charles Martin to capture the IBF heavyweight championship. After two successful defenses of the title, Joshua stopped Wladimir Klitschko to add the WBA belt to his collection. Two fights later, Joshua would grab a third belt, stopping Joseph Parker for the WBO title.The Parker fight, the 21st of Joshua's career, was the first time a Joshua opponent made it to the final bell.In June 2019, Joshua suffered a shocking TKO loss to Andy Ruiz Jr., losing his status as unified champion in the process. The Ruiz upset was one of the biggest in heavyweight boxing history -- something Paul fans use as proof that Joshua is a vulnerable fighter, even when heavily favored.\nJoshua got his revenge in a rematch with Ruiz, regaining his three world titles. After a single defense, Joshua finally met a fighter who was clearly his superior, losing a September 2021 fight to Oleksandr Usyk and dropping the rematch the following August.Joshua has won four of his five fights since the Usyk bouts, including a thunderous knockout of former UFC heavyweight champion Francis Ngannou, before suffering a brutal knockout loss in an IBF title fight with Daniel Dubois.While no longer among the elite of the elite, Joshua remains a talented, strong, and large heavyweight and is a fighter unlike any Paul has shared the ring.\n\"Jake Paul creates a great challenge for me, and he's got a great mindset for sure,\" Joshua said. \"Great family, great brother, great person. So yeah, he definitely creates a good challenge for me. But as I said earlier, competition is really good.\"The undercard features more fighters from under the Most Valuable Promotions banner. That includes recent signing Alycia Baumgardner, who looks to defend her unified junior lightweight titles against Leila Beaudoin in the co-main event. Baumgardner, 31, reached undisputed status at junior lightweight in 2023. She made three defenses of the crown before vacating the WBC title to take this fight. Plus, former UFC champions are set to clash when Anderson Silva, 50, battles Tyron Woodley, 43, at cruiserweight. \"I feel like for me, it's my chance to go forward to increase my legacy. And for once, it's an opportunity for me to fight somebody that brings my value up,\" Woodley said at the final press conference. \"Anderson, that's the type of excitement that I got when the fight was requested. And it didn't take me long. I really said yes almost before we even talked about it, so it's time to get it on. Can't wait.\"\nLet's take a closer look at the rest of the undercard with the latest odds before getting to a prediction and expert pick on the main event below.Joshua vs. Paul fight card, oddsOdds via DraftKings SportsbookAnthony Joshua -1200 vs. Jake Paul +700, heavyweightsAlycia Baumgardner (c) -1400 vs. Leila Beaudoin +750, unified junior lightweight titleAnderson Silva -275 vs. Tyron Woodley +210, cruiserweightsJahmal Harvey -3500 vs. Kevin Cervantes +1300, junior lightweightsCherneka Johnson (c) -900 vs. Amanda Galle +550, undisputed bantamweight titleCaroline Dubois (c) -3500 vs. Camila Panatta +1300, WBC lightweight titleYokasta Valle (c) -1400 vs. Yadira Bustillos +700 . WBC strawweight titleAvious Griffin -600 vs. Justin Cardona +400, welterweightsKeno Marley -10000 vs. Diarra Davis Jr. +1800, cruiserweightsWhere to watch Jake Paul vs. Anthony JoshuaDate: Dec. 19Location: Kaseya Center -- MiamiStart time: 8 p.m. ET (Main card) How to watch: Netflix (subscription required)PredictionLook, what is there to say? If Jake Paul wins, it would be legitimately shocking. It would be a sport-shaking result -- and one many would refuse to accept as legitimate, no matter how little sense a fix would make. Joshua is bigger, stronger, more technical, has more power and high-level experience against some of the best fighters in the world. Paul has ... fought some guys people know who have all come into the fight with at least some degree of disadvantage.Anthony Joshua wins this fight 99 times out of 100. Paul's best trait is his power, and landing one big shot and knocking out Joshua is the way Paul wins that one fight out of 100. It's just very unlikely, and Paul's worst defensive traits, such as hanging around the ropes while not throwing punches, leaves him open to Joshua's power and sharp punching. In reality, every round Paul survives is a win in its own way. Pick: Anthony Joshua via TKO2\nWho wins Anthony Joshua vs. Jake Paul on Dec. 19, and which massive longshot prop should you target for a huge payday? Visit SportsLine now to see Josh Nagel's best bets for the Friday, Dec. 19, heavyweight bout, all from the combat sports specialist who has covered the sport for more than 20 years, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jake Paul vs. Anthony Joshua fight predictions, odds and expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/21d2c1f3-de88-4ac8-9c36-e43b7d42d5ce/thumbnail/1200x675/e3002a864ba67e0cfc0931b02b52b847/jake-paul-anthony-joshua-final-presser.jpg"
      ],
      "datePublished": "2025-12-20T01:25:00.000Z",
      "dateModified": "2025-12-20T01:25:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 16, 2025 NFL betting guide, odds, props: Model, AI, expert, parlay, DFS, fantasy picks revealed - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-16-2025-nfl-betting-guide-odds-okayer-props-model-ai-expert-parlay-dfs-fantasy-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/893958e3-7074-44c0-8376-e0b42e74a988/thumbnail/1200x675/9379a53f9f0203b47b2af62c4ad13343/saquon-barkley-philadelphia-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-19T21:29:13.000Z",
    "description": "\nCrafting a winning NFL 16 betting guide comes from being aware of trends to help with your Week 16 NFL picks. Knowing how teams perform with a rest e",
    "body": "\nCrafting a winning NFL 16 betting guide comes from being aware of trends to help with your Week 16 NFL picks. Knowing how teams perform with a rest edge is part of that, which puts a focus on the Bengals and Lions. Both teams are facing squads coming off Monday games, with Cincy 4.5-point favorites versus a Miami team that benched Tua Tagovailoa in place of rookie Quinn Ewers. The latest Week 16 NFL lines also have Detroit at -7 against Pittsburgh. While every team appreciates having a rest advantage, not every team makes the most of it per NFL spread records.Since 2023, no team has more ATS wins with a rest edge than Detroit (nine), while Cincy's 2-6 ATS record with a rest advantage is the third-worst in football over that span. While this could assist with your ATS Week 16 NFL betting strategy, what in regards to individual performance could help you nail your NFL player props and Fantasy football start/sit decisions? If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 16, SportsLine has you covered with its proven model, Machine Learning Model and team of experts.Join SportsLine right here and get your first month for just $1 using promo code CHAMPIONSHIP.NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 16 that pays 25-1, and one of the legs is the Broncos (-3, 45.5) covering against the Panthers. The model has Tampa Bay covering in almost 60% of simulations, and the rest of the five-team parlay can be found here.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins, on picks like Tampa covering. Bet it at DraftKings right here:\nFantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 16 Fantasy football rankings that can be used to make start-sit decisions. The Broncos' Bo Nix is projected to be a top-10 Fantasy quarterback this week, and the model also has full rankings for every position right here.NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Chargers' Omarion Hampton as one of its top value picks at running back, while the Lions' Jameson Williams is among the best values at wide receiver for Sunday's main slate. Here are its complete Week 16 NFL DFS rankings.Back Williams to go Over 4.5 receptions at DraftKings:\nSenior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Cardinals' Jacoby Brissett as a top-5 Fantasy quarterback this week. Get his full Week 16 Fantasy and DFS projections right here. Advanced NFL model simulates every game 10,000 times SportsLine's model is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024 and has revealed picks for every Week 16 NFL game. One of its favorite picks is the Chiefs (-3.5, 37.5) covering versus the Titans, which cashes well over 50% of the time. You can find the model's picks for every NFL Week 16 game here. NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Bruce Marshall, who is 45-26-2 over his last 73 NFL ATS picks, is backing the Chargers (+2.5) to cover versus the Cowboys on Sunday.\"Dallas should have had more left in the tank for last Sunday's 34-26 loss to the Vikings, and the defense is starting to resemble its poor form from the first half of the season while allowing 39 ppg in consecutive losses to the Lions and Vikes,\" said Marshall. \"As for the Bolts, they're still playing inspired defense while continuing to chase Denver in the AFC West, and Justin Herbert's left wrist has had another week to heal and get him closer to 100%. This is arguably a tougher test for Dallas than others they didn't pass the past two weeks. Play Chargers.\" Marshall's Week 16 NFL picks can be found here.Bet the Chargers to cover at DraftKings:\nBest bets for the Saturday NFL scheduleWith the college football regular season over, the NFL expands to Saturday as well, and in Week 16 it is Eagles (-7) vs. Commanders at 5 p.m. ET and Packers (+1.5) vs. Bears at 8 p.m. ET. R.J. White is +585 on his past 281 NFL picks, and he's backing Jalen Hurts as an anytime TD scorer in the early kick. \"The Eagles finally got back on track against the Raiders, and this is another good matchup for their offense,\" White said. \"The Washington defense has allowed 3+ TDs in every game played stateside since Week 6, and giving up 21 points and 384 yards to the Giants last week represents one of their best outings in that stretch. We're used to seeing Hurts' ATD prop at much shorter odds in this type of matchup, and even if Lane Johnson isn't able to make it back this week, I think he shouldn't be plus odds to score against a defense that gives up loads of points.\" Get more Eagles vs. Commanders picks here and see Packers vs. Bears picks right here. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 16, 2025 NFL betting guide, odds, props: Model, AI, expert, parlay, DFS, fantasy picks revealed - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/893958e3-7074-44c0-8376-e0b42e74a988/thumbnail/1200x675/9379a53f9f0203b47b2af62c4ad13343/saquon-barkley-philadelphia-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-12-19T21:29:13.000Z",
      "dateModified": "2025-12-19T21:29:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 16 odds, lines, spreads: Picks, predictions, best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-16-nfl-odds-lines-spreads-predictions-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/f2b4bbb3-ad43-4571-bf46-2b29338ad1b2/thumbnail/1200x675/11ca7b9cdbb6f079c8545f89eb8e7e84/travis-kelce-kansas-city-chiefs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-19T21:22:24.000Z",
    "description": "\nThe Week 16 NFL schedule sees a number of teams playing their final home games of the regular season. Thus, there's nearly a full year's worth of hom",
    "body": "\nThe Week 16 NFL schedule sees a number of teams playing their final home games of the regular season. Thus, there's nearly a full year's worth of home games to gather NFL betting trends from in order to help with Week 16 NFL picks. Two of those teams with their final home stands include the Ravens, who are -3 versus the Patriots, as well as the Cardinals who are +3 versus the Falcons. Both Baltimore and Arizona have a league-high of six ATS home losses this year, perhaps, making them ones to fade with Week 16 NFL predictions.There are more road favorites than home teams giving points, according to the Week 16 NFL odds. Amongst those home dogs are Giants (+3) versus the Vikings, the Panthers (+3) against the Bucs and the Titans (+3) against a Chiefs squad that lost Patrick Mahomes to a torn ACL and has been eliminated from playoff contention. All of the updated Week 16 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 16 NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 16 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Week 16 NFL predictionsWe can tell you one of the model's strongest Week 16 NFL picks is that the Ravens (-3, 48) cover versus New England on Sunday night. Baltimore is coming off a dominant 24-0 win over Cincinnati, while the Patriots saw their 10-game win streak come to an end at the hands of Buffalo. The Pats have now dropped two of their last three versus the spread, as the team allowed season highs in points (35) and rushing yards (168) in the defeat to the Bills. Now, New England has to face the league's No. 3 rushing offense, led by Derrick Henry and Lamar Jackson, and the quarterback has a stunning 16-0 regular season record in Week 15 or later. Baltimore is projected to rush for over 170 yards, which allows the Ravens to cover versus the spread 60% of the time. See which other teams to pick here, and bet the Ravens using the DraftKings promo code, which offers $200 in bonus bets if your bet wins right here:\nAnother one of its Week 16 NFL predictions: the Chiefs (-3, 37.5) cover versus the Titans in well over 50% of simulations in a Sunday kickoff at 1 p.m. ET. Patrick Mahomes' (torn ACL) injury shifted this line a full touchdown from Chiefs -10.5, but Kansas City still has a more complete team in just about all regards than Tennessee. While the Chiefs' No. 20 rushing offense isn't great, it's miles ahead of Tennessee's No. 30 ground attack. Then on defense, Kansas City boasts top 10 rankings in both points allowed and yards allowed, while the Titans rank in the bottom six in both categories. Tennessee is only 3-12 ATS over its last 15 home games and just allowed both its second-most total yards (430) and passing yards (292) of the year to San Fran on Sunday, so Gardner Minshew should be able to find success. The model also says the Under hits well over 50% of the time. See which other teams to pick here, and bet the Chiefs to cover at DraftKings:\nHow to make Week 16 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 16 NFL schedule and just revealed four A-rated picks with the spread and total, potentially giving you a huge payday. You can only get every pick for every game at SportsLine.So what Week 16 NFL picks can you make with confidence, and which four picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 16 NFL betting odds, lines, live spreads, scoresGet Week 16 NFL picks at SportsLineGameSpreadTotalPicksRams at Seahawks (Thursday)F: Seahawks 38, Rams 37Eagles at Commanders (Saturday)PHI -744.5SEE  PICKS HEREPackers at Bears (Saturday)CHI -1.546.5SEE  PICKS HEREBuccaneers at PanthersTB -345.5SEE  PICKS HEREBills at BrownsBUF -10.541.5SEE  PICKS HEREChargers at CowboysDAL -2.549.5SEE  PICKS HEREJets at SaintsNO -6.540.5SEE  PICKS HEREVikings at GiantsMIN -2.543.5SEE  PICKS HEREChiefs at TitansKC -337.5SEE  PICKS HEREBengals at DolphinsMIA +4.547.5SEE  PICKS HEREFalcons at CardinalsATL -348.5SEE  PICKS HEREJaguars at BroncosDEN -3.547.5SEE  PICKS HERESteelers at LionsDET -752SEE  PICKS HERERaiders at TexansHOU -1437.5SEE  PICKS HEREPatriots at RavensBAL -348.5SEE  PICKS HERE49ers at Colts (Monday)SF -5.546.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 16 odds, lines, spreads: Picks, predictions, best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/f2b4bbb3-ad43-4571-bf46-2b29338ad1b2/thumbnail/1200x675/11ca7b9cdbb6f079c8545f89eb8e7e84/travis-kelce-kansas-city-chiefs-imagn-images.jpg"
      ],
      "datePublished": "2025-12-19T21:22:24.000Z",
      "dateModified": "2025-12-19T21:22:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oklahoma vs. Alabama prediction, odds: 2025 College Football Playoff first-round expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-college-football-playoff-first-round-odds-betting-line-top-prediction-oklahoma-alabama-expert-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/23234786-7c29-46ba-96d9-ac3d1570d836/thumbnail/1200x675/850f46784e8c62c87b122544f527d6d7/deion-burks-oklahoma-sooners-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-19T23:30:37.000Z",
    "description": "\n        The ninth-ranked Alabama Crimson Tide will look to turn the tables on the eighth-ranked Oklahoma Sooners when they meet Friday in the first r",
    "body": "\n        The ninth-ranked Alabama Crimson Tide will look to turn the tables on the eighth-ranked Oklahoma Sooners when they meet Friday in the first round of the 2025 College Football Playoff. Oklahoma earned a 23-21 win in the Nov. 15 matchup in Tuscaloosa, Ala. The Crimson Tide (10-3), who are coming off a 28-7 loss to Georgia in the SEC title game on Dec. 6, have split their last four games. The Sooners (10-2), who finished the regular season with a 17-13 win over LSU on Nov. 29, have won four in a row. The winner advances to face top-seeded Indiana in the Rose Bowl on Jan. 1.Kickoff from Gaylord Family Oklahoma Memorial Stadium is at 8 p.m. ET. Oklahoma won the first matchup between these teams this season in Tuscaloosa in November despite being 6.5-point underdogs. This time around, the Sooners are 1.5-point favorites in the latest Alabama vs. Oklahoma odds, while the over/under for total points scored is 40.5. Before making any Oklahoma vs. Alabama picks, be sure to check out the college football predictions and betting advice from SportsLine expert Thomas Casale.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:A frequent guest on national radio and TV shows to discuss college sports, Casale has been sports betting -- and winning -- for more than 30 years. Now, he has turned his attention to the Alabama vs. Oklahoma in the College Football Playoff bracket and is sharing his top betting picks. You can head to SportsLine now to see his picks. Here are the college football odds for the Alabama vs. Oklahoma matchup:Alabama vs. Oklahoma                                                                                                                                 spreadOklahoma -1.5 Alabama vs. Oklahoma                                                                                                                             over/under40.5 pointsAlabama vs. Oklahoma                                                                                                                                                                                                                                             money line Oklahoma -115, Alabama -104Alabama vs. Oklahoma                                                                                                                                                                                                                                     picksSee picks at SportsLineAlabama vs. Oklahoma                                                                                                                                                                                                                                       streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. Why Alabama can coverAlabama went 8-5 against the spread this season and junior quarterback Ty Simpson was named to the All-SEC Second Team by The Associated Press and league coaches. He ranked second in the SEC and 12th nationally with 26 touchdown passes. He also ranked second in the conference and 13th nationally with 3,268 yards passing, an average of 251.4 yards per game. In the November meeting with Oklahoma, he completed 28 of 42 passes for 326 yards and one touchdown and one interception.Also helping power the offense is junior wide receiver Isaiah Horton. In 12 games this season, he has 35 receptions for 430 yards (12.3 average) and a team-high eight touchdowns. In a 27-20 win over Auburn on Nov. 29, he caught five passes for 35 yards and three touchdowns. In the game against the Sooners, he caught three passes for 56 yards, including a long of 26. See which team to back at SportsLine.\nWhy Oklahoma can cover Redshirt junior quarterback John Mateer, who transferred from Washington State this past January, has completed 221 of 356 passes (62%) for 2,578 yards and 12 touchdowns. He is also the Sooners' third-leading rusher with 416 yards with a team-high seven rushing touchdowns. In a 33-27 win at Tennessee on Nov. 1, he completed 19 of 29 passes for 159 yards, while rushing 16 times for 80 yards and one touchdown. In the win over LSU, he threw for 318 yards and two touchdowns, while rushing eight times for 27 yards.Freshman Tory Blaylock powers the Oklahoma rushing attack. In 11 games, he has carried 109 times for 444 yards (4.1 average) and four touchdowns. He also has eight receptions for 41 yards. In a 26-7 win at South Carolina on Oct. 18, he carried 19 times for 101 yards (5.3 average) and one touchdown. In a 42-3 win at Temple on Sept. 13, he rushed 14 times for 100 yards and two touchdowns. See which team to back at SportsLine.How to make Alabama vs. Oklahoma picksCasale is leaning Under on the total because he sees this game being a \"defensive slugfest.\" He's also isolated a critical x-factor that has him jumping on one side of the spread. See what it is at SportsLine.Who wins Alabama vs. Oklahoma, and what critical x-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Alabama vs. Oklahoma spread you need to jump on Friday, all from the expert with more than 30 years of handicapping experience.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oklahoma vs. Alabama prediction, odds: 2025 College Football Playoff first-round expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/23234786-7c29-46ba-96d9-ac3d1570d836/thumbnail/1200x675/850f46784e8c62c87b122544f527d6d7/deion-burks-oklahoma-sooners-imagn-images.jpg"
      ],
      "datePublished": "2025-12-19T23:30:37.000Z",
      "dateModified": "2025-12-19T23:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon vs. James Madison prediction: Expert picks and odds for first round of CFP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oregon-james-madison-prediction-picks-odds-cfp-first-round-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/36f6d364-4c66-4a6f-9448-72e43554596a/thumbnail/1200x675/977e373fe4a288fd8471ce8abed47068/gettyimages-2249105834-1.jpg",
    "tag": "Sports",
    "date": "2025-12-20T01:00:43.000Z",
    "description": "\n        The first round of the 2025 College Football Playoff concludes Saturday night when No. 5 Oregon hosts No. 12 James Madison at Autzen Stadium.",
    "body": "\n        The first round of the 2025 College Football Playoff concludes Saturday night when No. 5 Oregon hosts No. 12 James Madison at Autzen Stadium. With one of college football's most prominent home-field advantages and a loaded roster on their side, the Ducks are commanding favorites to advance to the Orange Bowl, where No. 4 Texas Tech awaits the winner. But the Sun Belt champion Dukes will head to the Pacific Northwest with their sights set on what would be a legendary upset.They come from different backgrounds, but the Ducks and Dukes stand side by side in the FBS rankings for scoring offense and scoring defense. Both rank inside the top 10.These sides also have something in common in that they will say goodbye to coaches at the end of their postseason runs. James Madison coach Bob Chesney will depart to take the UCLA job at the end of the CFP, and both of Oregon's coordinators -- Will Stein (Kentucky) and Tosh Lupoi (California) -- are set to begin their duties as Power Four head coaches once the campaign closes.A win for Oregon would be its first in the playoff since its expansion to 12 teams. It would also help remove the bitter taste left over from last postseason when the Ducks squandered their No. 1 seed and dropped out of the CFP in the quarterfinals.\n  Oregon vs. James Madison: Need to know  Healthy Ducks are dangerous Ducks: If Oregon gets closer to full strength ahead of its playoff run, it could be in for a long stay in the bracket. A host of Ducks participated in practice this week after missing extended time with injuries. That includes the wide receiver trio of Dakorien Moore, Gary Bryant Jr. and Evan Stewart. Moore missed the final four games of the regular season after hurting his knee in practice, Bryant sat the final three games and Stewart has not played due to an injury he suffered in the offseason. Running back Jayden Limar and cornerback Sione Laulea could also return to the lineup.FCS to CFP in four years: James Madison debuted at the FBS level just four years ago when former Dukes coach Curt Cignetti oversaw a successful transition from the FCS ranks. Between Cignetti and Bob Chesney, this program benefitted from two outstanding coaches in an unfathomable rise to the top of the Sun Belt and, ultimately, to the CFP. The Dukes have won no fewer than eight games in a season since making the jump to Division I's highest subdivision, and they made their first appearance in the CFP Top 25 rankings ahead of conference championship week.Survived the gauntlet: Oregon played three of its toughest games in the final month of the season and won each of them, and suddenly the Oct. 11 loss to Indiana is far in the rearview mirror. The wins over Iowa, USC and Washington helped the Ducks re-establish themselves as national championship contenders and launched them into the No. 5 seed, which sets them up for arguably the most favorable path to the title game of any team outside the top four seeds.\nSoft schedule, decidedly dominant: According to ESPN FPI, James Madison played the 121st-toughest schedule in the country thus far. Only 15 teams faced a lighter load of opponents. Does that mean the Dukes' dominance has to be taken with a grain of salt? Saturday will put that idea to the test. Running back Wayne Knight torched defenses for a Sun Belt-best 1,263 rushing yards, defensive lineman Sahir West racked up 14 tackles for loss and dual-threat quarterback Alonza Barnett III passed for 21 touchdowns and ran for 14 more. In all, the Dukes boasted the nation's No. 10 scoring offense and No. 10 scoring defense. But now they have to prove they can do it against a national championship contender.  Where to watch Oregon vs. James Madison live  Date: Saturday, Dec. 20 | Time: 7:30 p.m. ETLocation: Autzen Stadium -- Eugene, OregonTV: TNT | Live stream: Fubo (Try for free)  Oregon vs. James Madison prediction, picks  \nA staple of the Dan Lanning era at Oregon is that when the Ducks are decidedly more talented than their opponent, they leave no doubt of it on the scoreboard. James Madison is far better than the trio of non-conference foes that Oregon pounded into the dirt by a combined score of 169-23, but is it really much stronger than the Big Ten bottom-dwellers that stood no chance against this powerhouse, either? The Dukes fell by two touchdowns in their lone regular-season matchup against a Power Four team, and this one should be even more lopsided than the 28-14 loss to Louisville. Pick: Oregon -21.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            OREG -21.5\n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oregon\n                    \n    \n    Who will win and cover in each college football bowl and playoff game? SportsLine's computer model just simulated each matchup 10,000 times and has revealed its picks. Visit SportsLine now to see all its college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon vs. James Madison prediction: Expert picks and odds for first round of CFP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/36f6d364-4c66-4a6f-9448-72e43554596a/thumbnail/1200x675/977e373fe4a288fd8471ce8abed47068/gettyimages-2249105834-1.jpg"
      ],
      "datePublished": "2025-12-20T01:00:43.000Z",
      "dateModified": "2025-12-20T01:00:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Best PG in the country': How Rori Harmon is taking Texas to new heights - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/texas-womens-basketball-rori-harmon-best-point-guard-in-country/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/eb498c53-a50b-46e3-8a32-81f29d3ec3bc/thumbnail/1200x675/5dea0e808d2f5b550a4ec58d66cd64f4/rori-harmon-vic-schaefer-texas-wbb.png",
    "tag": "Sports",
    "date": "2025-12-20T01:03:39.000Z",
    "description": "\n        Last month at the Players Era Championship in Las Vegas, after Texas took down then-No. 3 UCLA to set up a showdown with then-No. 2 South Car",
    "body": "\n        Last month at the Players Era Championship in Las Vegas, after Texas took down then-No. 3 UCLA to set up a showdown with then-No. 2 South Carolina the next day, head coach Vic Schaefer took a moment in the press conference to make a bold statement.\"I thought down the stretch, Rori Harmon showed why she is the best point guard in the country,\" Schaefer said.This wasn't the first or last time that Schaefer made such a proclamation. But Harmon takes it to heart each time.\"For someone like Coach Schaefer, of his stature and his greatness, to think that of me is a pretty big deal and just something that I want to live up to,\" Harmon told CBS Sports. \"He has such a high standard for me to just come out and play as hard as I can and be that engine that my team needs to be on both ends of the floor. \n\"Yeah, I'm gonna take that challenge and try to live up to it every day. Not just showing up for games, but just being a good teammate and showing up for practice, playing hard and doing all the things that some people sometimes overlook. So yeah, I feel really happy that he thinks that about me. It feels really nice, but there's always room for me to improve.\"While some might call it a bold statement, it's not exactly far-fetched. Under Harmon's leadership, the Longhorns currently ranked No. 2 in the nation and are 13-0 heading into Sunday's matchup against South Dakota State (2 p.m. ET on CBS Sports Network). \nHarmon is averaging 9.3 points and 7.8 assists per game. In the last four games, she has registered 44 assists and only two turnovers. She almost got a triple-double against Northwestern State with 11 points, 10 assists and a career-high seven steals.\nTexas is known as a defensive powerhouse, but the team has improved significantly on offense this season. There were already high expectations for the Longhorns, but they made a loud statement in November by taking down UCLA and South Carolina in back-to-back games. Harmon did a solid job directing her team, but she also hit the game-winning shot against the Gamecocks to win the Players Era championship. \nWhile Madison Booker has certainly been a highlight for the team, and players such as Jordan Lee deserve a lot of credit for embracing bigger roles, the point guard has been the key to tying it all together. Schaefer compares Harmon to Houston Comets legend Kim Perrot, whom he described as \"the heart and soul of the team.\"\"She made them go. She was their energizer bunny,\" Schaefer said of Perrot. \"Their toughness kid. She was a little bitty card.\"\nEarlier this season, Harmon became Texas's all-time assist leader, and she could be breaking more records before she finishes her master's degree. She is currently third on the Longhorns' all-time career steals list and only needs 26 more to tie Linda Waggoner's record of 346 steals.\"She is involved in so many things,\" Schaefer said. \"But here is, to me, the separator: it's what she does on the defensive end. It's how hard she plays down there. It's how much love she has for that end. A lot of kids go down there because they just have to. Rori loves that end of the floor. She loves to make an impact on that end. She takes pride in making an impact on that end. Not many kids do that. A lot of them can score, a lot of them can pass, but most of them don't defend like Rori Harmon. That,  to me, is what separates her. She is good on offense, but she is also that good defensively.\"Texas reached the Final Four last season, but Harmon, who was coming back from a torn ACL, was not even playing her best basketball. She and Schaefer had a productive conversation at the end of the season and he has continued to cheer her on during this journey.\n\"Last season was pretty tough for me, even though we did have a great season and went to the Final Four,\" Harmon said. \"We just had a conversation, he was like, 'What do you think is different?' We acknowledged the fact that I spent most of the year just trying to find myself again, including that the previous summer I didn't really get to touch the floor as much up until the season started.\"But a lot of our conversations now are like, he's just really happy. You can tell when he's smiling at me, he'll just not say anything, he'll smile. You can tell he's just super happy that I've found myself again. And I'm really enjoying the game of basketball again. I feel like myself. I'm moving better than ever.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Best PG in the country': How Rori Harmon is taking Texas to new heights - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/eb498c53-a50b-46e3-8a32-81f29d3ec3bc/thumbnail/1200x675/5dea0e808d2f5b550a4ec58d66cd64f4/rori-harmon-vic-schaefer-texas-wbb.png"
      ],
      "datePublished": "2025-12-20T01:03:39.000Z",
      "dateModified": "2025-12-20T01:03:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Arkansas vs. Houston: TV channel, stream, odds, spread, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/arkansas-houston-john-calipari-prediction-pick-odds-spread-where-to-watch-cbs-college-basketball-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/daec9fde-8b2f-4b28-acc9-64ecef561384/thumbnail/1200x675/e9b020baa243571f2c5d5eefef747892/cbb-houston-arkansas-hqslate-1920x1080-sat.jpg",
    "tag": "Sports",
    "date": "2025-12-20T01:23:16.000Z",
    "description": "\n        A pair of old Southwest Conference rivals will square off for the first time since the 2017-18 season on Saturday, when No. 8 Houston and No.",
    "body": "\n        A pair of old Southwest Conference rivals will square off for the first time since the 2017-18 season on Saturday, when No. 8 Houston and No. 14 Arkansas tangle on CBS in a marquee showdown inside the Prudential Center in Newark, New Jersey. The meeting brings a final showcase opportunity for both as nonconference play winds down ahead of the start of Big 12 and SEC play during the first week of January.  It marks Houston's toughest December test after a challenging November slate that showed the promise of a team led by a mixture of grizzled veterans and freshman phenoms. As per usual, the Cougars are a gritty defensive club that plays a physical, grinding style designed to wear down the opposition. Arkansas counters with an up-tempo attack led by a pair of star freshman guards in Darius Acuff and Meleek Thomas. Second-year coach John Calipari's club has already beaten ranked foes Louisville and Texas Tech this month and is on the hunt for another high-profile victory.  The showdown between Calipari and Houston coach Kelvin Sampson is a meeting of old friends. Calipari revealed after taking the Arkansas job in 2024 that he consulted Sampson about working for Razorbacks athletic director Hunter Yurachek, who was previously Sampson's boss at Houston. Sampson's glowing review of Yurachek helped Calipari decide to take the gig.  It's the eighth rendition of the Never Forget Tribute Classic, which supports charities dedicated to the remembrance of the September 11, 2001 terrorist attacks on the United States. Here is everything you need to know ahead of a big-time showdown between Arkansas and Houston.  \n\n        \n            \n                Bruce Pearl makes network debut, previews CBS Sports Classic between UK vs. St. John's, UNC vs. Ohio State\n                \n                    Cameron Salerno                \n            \n                            \n    \n                \n                    \n    \nAll odds via FanDuel Sportsbook     Where to watch Arkansas vs. Houston live    Date: Saturday, Dec. 20 | Time: 5:30 p.m. ET  Location: Prudential Center, Newark, New Jersey   \tTV: CBS | Live stream: CBSSports.com, CBS Sports App Streaming on Paramount+ Premium  Arkansas vs. Houston: Need to know Getting Thomas back on track: Arkansas star freshman Meleek Thomas will be seeking to get back on track after consecutive poor showings. The highly touted guard reached double figures in his first nine games, averaging 16.9 points to begin his college career, before hitting a wall over the past week. He went just 3 for 19 from the floor in Arkansas' victories over Texas Tech and Queens. Finding a rhythm will be tough against Houston, but expect Thomas to take plenty of shots. He's a flamethrower who won't be afraid to let it fly.  Freshman studs: Houston has a couple freshman stars of its own in point guard Kingston Flemings and center Chris Cenac Jr. Flemings has delivered his biggest performances in some of Houston's biggest games, tallying 21+ points against Auburn, Tennessee and Florida State. But even when he's not scoring, Flemings is stirring the drink as a passer. Cenac is a long, rangy utilitarian who supports the program's mission of defending tenaciously and rebounding with a vengeance.   \nEarly-season Bracketology: It's never too early to be thinking about the NCAA Tournament picture. Arkansas is currently the last No. 5 seed in CBS Sports' latest Bracketology, and the Razorbacks would solidify their standing on the No. 5 line with a win. But a loss would drop the Razorbacks one full seed line, according to our model's projection. Houston enters as a No. 4 seed and will move a half-seed in either direction, depending on the outcome. A win could be enough to get the Cougars up to the No. 3 seed line if projected No. 3 seeds Purdue and/or North Carolina falter in tough Saturday matchups.    Arkansas vs. Houston prediction, picks  \nArkansas is on the upswing after taking down Louisville and Texas Tech this month. Facing Houston's tenacious defense is a different level of challenge, but the Razorbacks are outfitted with a variety of scoring threats and will seek to speed the Cougars up. If one or more Arkansas defenders are up to the challenge of trailing Houston star Emanuel Sharp on the defensive end, the Razorbacks will cover and potentially even win outright. Pick: Arkansas +4.5  \t \t  \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            UH -4.5\n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years.   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Arkansas vs. Houston: TV channel, stream, odds, spread, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/daec9fde-8b2f-4b28-acc9-64ecef561384/thumbnail/1200x675/e9b020baa243571f2c5d5eefef747892/cbb-houston-arkansas-hqslate-1920x1080-sat.jpg"
      ],
      "datePublished": "2025-12-20T01:23:16.000Z",
      "dateModified": "2025-12-20T01:23:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Alabama vs. Oklahoma: TV channel, stream, odds, prediction, pick for CFP game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/alabama-oklahoma-prediction-picks-odds-cfp-first-round-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/9d1ca126-bc89-4b56-ad36-0e3e70f43197/thumbnail/1200x675/5162025a61aa42b73a6803d58a9793c4/bama-ou.png",
    "tag": "Sports",
    "date": "2025-12-20T00:49:17.000Z",
    "description": "\n        No. 8 Oklahoma and No. 9 Alabama have already collided in the 2025 season, but do the Sooners have it in them to pull off the feat for a seco",
    "body": "\n        No. 8 Oklahoma and No. 9 Alabama have already collided in the 2025 season, but do the Sooners have it in them to pull off the feat for a second time and advance in the College Football Playoff? That's what everyone is waiting to see on Friday as these two SEC behemoths clash for the third time in the past two seasons to kick off the 2025-26 College Football Playoff event. The rematch of one of the more surprising results of the season pits Alabama (10-3) and Oklahoma (10-2) in the first round of the College Football Playoff. Kickoff Friday is set for 8 p.m. ET. A month ago, Oklahoma used three turnovers, including a pick six, to knock off Alabama 23-21 in Tuscaloosa. The Tide nearly doubled the Sooners' offensive output (406-212) but couldn't overcome the turnover margin and lost their first home game in the Kalen DeBoer era.The Sooners are chasing history in the first round of the CFP. No team has ever defeated Alabama twice in the same season. Oklahoma is also chasing its first playoff win, entering with a 0-4 record all-time in the CFP.Alabama looks a tad different from earlier in the season when it lost to the Sooners. Up to 13 players were out or limited in the SEC Championship Game two weeks ago, and many of them have returned to the field, including running back Jam Miller. \nFollow along for LIVE updates, highlights and expert analysis as Alabama travels to Oklahoma to kick off the College Football Playoff. Where to watch Alabama vs. Oklahoma liveDate: Friday, Dec. 19 | Time: 8 p.m. ETLocation: Gaylord Family Oklahoma Memorial Stadium -- Norman, OklahomaTV: ESPN | Live stream: Fubo (Try for free)Alabama vs. Oklahoma: Need to knowOklahoma's offense is struggling: The Sooners own the worst offense in the CFP. They haven't scored more than two offensive touchdowns in a game since Oct. 25. A top-10 defense, along with some late-game heroics, lifted Oklahoma into the playoff with big wins against ranked Tennessee, Alabama and Missouri. The Sooners average only 26.4 points per game, the fewest by a 10-win team in the FBS. They're scoring only 21.5 points against SEC competition, ranking 11th in the conference. \nLT Overton likely out: Alabama defensive end LT Overton is expected to miss a second straight game with what has been described as an illness or medical condition. Overton ranks second on the Tide with four sacks.Alabama's running attack: The Tide struggled to get much of anything going in the SEC Championship Game, especially in the backfield. They finished with minus-3 rushing yards against Georgia with a depleted backfield. The Tide played without two of their three best running backs but should get Miller back Friday. Miller, however, hasn't eclipsed 100 yards since Oct. 4. The Tide average only 116.2 yards per game, the worst production among CFP teams.Alabama vs. Oklahoma prediction, picks\nAlabama should have beaten Oklahoma the first time, but turnovers -- and the lack of a rushing attack -- doomed the Tide. I'm not expecting drastic changes for the Tide's offense overnight, but they're healthier and have the better quarterback. Oklahoma is an underdog at home for the first time this season and the total (40.5) is the lowest in any CFP game ever. The under has hit in Alabama's last five games and Oklahoma is 10-2. I'm not sure I'd touch the total, but I just don't see Alabama losing to a team for the second time.  Pick: Alabama -1\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            Bama -1\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    Who will win and cover in each college football bowl and playoff game? SportsLine's computer model just simulated each matchup 10,000 times and has revealed its picks. Visit SportsLine now to see all its college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Alabama vs. Oklahoma: TV channel, stream, odds, prediction, pick for CFP game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/9d1ca126-bc89-4b56-ad36-0e3e70f43197/thumbnail/1200x675/5162025a61aa42b73a6803d58a9793c4/bama-ou.png"
      ],
      "datePublished": "2025-12-20T00:49:17.000Z",
      "dateModified": "2025-12-20T00:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rays Trade Fallout: Brandon Lowe to Pirates, Shane Baz to Orioles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-reactions-rays-ship-out-brandon-lowe-shane-baz-in-separate-deals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/d1ce31d1-4d41-4a42-8f6f-141715e196f8/thumbnail/1200x675/6467a6ce9e45ab122fb46715bcdbfd7c/brandon-lowe-tampa-bay-rays-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-19T21:24:26.000Z",
    "description": "\n        The past couple of seasons have been frustrating for the Tampa Bay Rays, and while they certainly aren't rebuilding in the 2026 offseason, th",
    "body": "\n        The past couple of seasons have been frustrating for the Tampa Bay Rays, and while they certainly aren't rebuilding in the 2026 offseason, they are reshuffling things. And that includes, naturally, trading away players who are finally starting to make some real money. On Friday, that included separate deals to send Shane Baz to the Orioles and Brandon Lowe to the Pirates. Let's take a look at the fallout for each of the principal players involved, starting with Lowe's move to Pittsburgh: Brandon Lowe traded to the Pirates*The Pirates also acquired outfielder Jake Mangum and pitcher Mason Montgomery from the Rays while sending pitcher Mike Burrows to the AstrosWith Lowe set to make $11.5 million in 2026, a trade seemed inevitable, and the Pirates did well in taking advantage of another team's cheapness for once. The Pirates have a surplus of talented young pitchers and an obvious need for offense, so they plucked a pitcher without an obvious role and landed one of the best hitters at second base in the whole league. Lowe is coming off his healthiest season since 2021, and it resulted in 31 homers in 134 games – for some context, the Pirates haven't had a hitter with 31 homers in a season since Josh Bell in 2019. And it was no outlier for Lowe, who has averaged 34.8 homers per-162 games since establishing himself as an everyday player in 2019. He is, like many left-handed hitters, significantly better with the platoon advantage, though his career .695 OPS against lefties isn't an insurmountable disadvantage. \nIt is a park downgrade for Lowe, though that may not matter as much as you think –  he hit just .240/.279/.456 at George M. Steinbrenner Field last season, while Tropicana Field (where Lowe played every season prior to last) is actually a worse park for left-handed hitters than PNC Park. PNC is a tougher park for righties and should play pretty fair for Lowe, so your expectations for him shouldn't change too much based on this deal.Which means Lowe should remain one of the best values at the second base position for Fantasy yet again. Despite coming off a bounce-back season, Lowe's ADP in early NFBC drafts is just 174.1. He's being held back by concerns about his health, which is fair, but he just proved last season he can give us something close to a full season, and there just aren't many players who can give you as big an edge on the competition as Lowe does with homers relative to other second basemen. The Pirates won't play any games with Lowe's playing time, and he should hit in the heart of the order, giving him sizable run production upside, too. Lowe's value at least holds steady after this trade, and he should already be going earlier in drafts than he has been, making him a solid target in all leagues. \nShane Baz traded to the OriolesThe Orioles have been looking for upside in their rotation, and it's hard to argue Baz doesn't have considerable upside. The question is whether he'll ever be able to live up to it and whether we believe the Orioles are more likely to unlock that than the Rays.To that latter question, I lean, \"No.\" There just aren't many teams that are better able to coax the most out of pitchers than the Rays, so if they couldn't maximize Baz, do we have much reason to believe the Orioles will? Of course, it's not quite that straightforward. Not every approach works for every pitcher, and sometimes a change of scenery can have value even if the surrounding environment seems like a downgrade. To that point, we can look to Trevor Rogers, who turned into an ace for the Orioles last season after flaming out with the Marlins. The Orioles are betting they can do something similar here with Baz entering his age-27 season. And there are obviously tools to work with here once you look past the ugly 4.78 ERA Baz put up in 2025. His xERA was 3.85, which suggests there was plenty of poor luck in Baz's results. He has some strikeout upside and limits damage on contact well enough (.359 xwOBA on contact in 2025, .355 for his career; .368 is league average), but has mostly struggled with consistency.\nAnd I think the Rays approach may have something to do with that. Many pitchers have talked about how the Rays philosophy can often be boiled down to, \"Throw your best pitches as often as possible, aim for the middle of the zone,\" and let your stuff do the rest.\" That is advice that has worked out well for many pitchers (most notably Tyler Glasnow), but I think it's been holding Baz back. He has good stuff, but doesn't necessarily miss as many bats in the strike zone as you would expect, posting a roughly average in-zone contact rate allowed. That's a problem when Baz throws 53% of his pitches in the zone, compared to the league average of roughly 48%. Those pitches in the zone will help you avoid walks, of course, but it's hard to consistently miss bats that way, and consistently missing bats has been a big issue for Baz.Can he successfully work in the shadows of the strike zone more often? That remains to be seen, but I think Baz would certainly benefit from aiming for the top of the zone with his four-seamer more and the bottom of the zone with the curveball and changeup more often. It might lead to more walks, but it also might lead to more chase, swing-and-miss, and just generally uncomfortable at-bats. Will the Orioles be able to unlock that? I'm skeptical, but then I was skeptical they would be able to maximize Trevor Rogers and Kyle Bradish the way they have, too. Baz doesn't suddenly become a high-priority target for me as a result of this trade, but I do think his current 209.8 ADP allows for quite a lot of room for profit, making him a viable late-round flier in all leagues. \nMike Burrows traded to the AstrosWe don't need to spend as much time on this part of the deal. Burrows is a 26-year-old who fits in well with the Astros bevy of rotation fillers. He's a depth piece with some upside, and he's landing on a team with a well-earned reputation for wringing the most out of pitchers like this. There probably isn't huge upside here with Burrows, but he could emerge as a useful enough streamer in Houston, at least. What about the Rays' prospect haul?Here are all of the players the Rays got back for their two deals Friday, with some quick thoughts on each:Jacob Melton, OF: Melton has a very fantasy-friendly skill set, with 11 homers and 23 steals in just 82 games at Triple-A. But there might just be a bit too much swing-and-miss and platoon risk in his bat to ever really become a Fantasy stalwart. But he's a good defender and should at least get a chance to play against right-handed pitching to start in 2026, making him a viable late-round flier in Roto leagues. He's a very Rays player. Anderson Brito, RHP: Brito is a young fireballer who hasn't thrown more than 53.2 innings in a season to date. There is significant reliever risk here, but the Rays will surely give Brito every chance to be a starter over the next few years, and we're probably looking at a long developmental period for a 21-year-old who hasn't pitched above High-A to date. Slater de Brun, OF: The Orioles liked de Brun enough five months ago to give him an over-slot deal of $4 million after taking him in the Competitive Balance Round A. He's an 18-year-old with plus speed and defensive potential who probably profiles as a top-of-order hitter. He definitely fits in with the profile of other outfielders the Rays have acquired and developed in recent years, though we likely won't see de Brun for three or four years even in a best-case scenario. Caden Bodine, C: Bodine came off the board not long after de Brun and signed for over $3 million and then held his own in an 11-game cameo in A ball last season. He's a contact-first, switch-hitting catcher with a flat swing who scouts hope will develop into at least something of a power threat. If you're looking for a comp, something ranging from Keibert Ruiz to Gabriel Moreno probably works here, though he's probably at least a few years away. Michael Forret, RHP: Forret has been a fast-riser since the Orioles picked him in the 14th round in 2023, and he reached Double-A in 2025 while putting up a 1.58 ERA and 32.3% strikeout rate across two levels and 74 innings of work. He has a deep arsenal with multiple breaking balls and offspeed pitches, though one imagines the Rays will try to get him to focus and refine that attack in the long run. He's never thrown 100 innings in a season, but should start the 2026 season at Double-A and could be in the discussion for a rotation spot in 2027 if all goes well.Austin Overn, OF: 64 steals in 114 games in 2025 is the first thing you notice, though you'll also notice, with 13 homers, that he isn't a prototypical slap hitter, or anything. In fact, his biggest issue is probably that he just doesn't make enough contact at present to project as an MLB-caliber hitter. But the Rays love this prototype, and his defense and speed should give him a chance to break in sometime in 2027. Plus a 2026 draft pick in Competitive Balance Round A. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rays Trade Fallout: Brandon Lowe to Pirates, Shane Baz to Orioles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/d1ce31d1-4d41-4a42-8f6f-141715e196f8/thumbnail/1200x675/6467a6ce9e45ab122fb46715bcdbfd7c/brandon-lowe-tampa-bay-rays-imagn-images.jpg"
      ],
      "datePublished": "2025-12-19T21:24:26.000Z",
      "dateModified": "2025-12-19T21:24:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami vs. Texas A&M prediction: Expert picks and odds for first round of CFP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-texas-a-m-prediction-picks-odds-cfp-first-round-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/e314668b-f73d-48ba-8667-13e682ce848d/thumbnail/1200x675/bae5526ac5bb7b00b290831180ebadec/miami.jpg",
    "tag": "Sports",
    "date": "2025-12-20T00:00:52.000Z",
    "description": "\n        No. 7 Texas A&M will play host to No. 10 Miami in a first-round matchup of the College Football Playoff at Kyle Field with some pivotal stake",
    "body": "\n        No. 7 Texas A&M will play host to No. 10 Miami in a first-round matchup of the College Football Playoff at Kyle Field with some pivotal stakes. The Aggies are fresh off a 11-1 season, the most wins for the program since 2012. However, Texas A&M struggled in its final regular-season game -- a loss against rival Texas. Miami started the 2025 season on fire, but had to recover after losing games to Louisville and SMU by a combined nine points midseason. The losses cost them a shot at playing for the ACC title, but blazing through the month of November was enough to deliver them their first College Football Playoff appearance as the final team in. Texas A&M and Miami have played five teams, including a recent home-and-home series in 2022-23. The Hurricanes won 48-33 in their most recent matchup, the second game for Miami offensive coordinator Shannon Dawson. However, the matchup will look much different with Mike Elko now leading Texas A&M.   Miami vs. Texas A&M: Need to know  War in the trenches: Miami and Texas A&M come into the matchup boasting some of the top trench play of any teams in the playoff. Hurricanes offensive lineman Francis Mauigoa leads a unit that allowed only 11 total sacks this year. The Aggies were close behind at 12, both ranking top 11 nationally. But, Texas A&M also leads the nation with 41 sacks behind All-American defensive end Cashius Howell, and Miami had 34. The chess match between the lines will be the matchup of the weekend. Star receivers: Texas A&M invested heavily into its wide receiver corps and the unit has carried the program to new heights. Transfers KC Concepcion and Mario Craver each posted at least 50 catches for 800 yards, and others like Ashton Bethel-Roman and tight end Nate Boerkircher have each come up big in major moments. Few teams are built to win outside in, but the Aggies have that kind of ability. \nAll eyes on Bain: If the Heisman was given in September, Miami defensive end Rueben Bain Jr. might have walked away with it. The defensive end was unbelievable, wreaking havoc and making disruptive plays during a 5-0 start. However, both his production and grading have fallen off precipitously. Bain posted 1.5 sacks in the season finale against Pittsburgh; could he wake up in the season's most important moments?   Where to watch Miami vs. Texas A&M live  Date: Saturday, Dec. 20 | Time: 12 p.m. ET  Location: Kyle Field -- College Station, Texas  TV: ABC | Live stream: Fubo (Start watching, save $20!)  Miami vs. Texas A&M prediction, picks  \nThe matchup between Texas A&M and Miami is a true heavyweight battle. Both teams have the upside to win the national championship if things break right, and the first round will be an important stress test. Miami quarterback Carson Beck has the experience edge, but Texas A&M's offense has an explosive component that will prove to be the difference in College Station. Pick: Texas A&M -3.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            A&M -3.5\n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    Who will win and cover in each college football bowl and playoff game? SportsLine's computer model just simulated each matchup 10,000 times and has revealed its picks. Visit SportsLine now to see all its college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami vs. Texas A&M prediction: Expert picks and odds for first round of CFP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/e314668b-f73d-48ba-8667-13e682ce848d/thumbnail/1200x675/bae5526ac5bb7b00b290831180ebadec/miami.jpg"
      ],
      "datePublished": "2025-12-20T00:00:52.000Z",
      "dateModified": "2025-12-20T00:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 16 NFL injury report: Updates on Drake London, Tee Higgins and Josh Jacobs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-16-nfl-injury-report-updates-drake-london-tee-higgins-josh-jacobs-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/29/bd5606c6-8ba0-4dc7-8c4a-aeac4adf253e/thumbnail/1200x675/a324ddda370004c0d7215c7eddce2a12/getty-drake-london-falcons.jpg",
    "tag": "Sports",
    "date": "2025-12-19T23:04:09.000Z",
    "description": "\n        Week 16 is already off the rails, and we've barely gotten started. The NFL is coming off arguably the game of the year on Thursday night, whe",
    "body": "\n        Week 16 is already off the rails, and we've barely gotten started. The NFL is coming off arguably the game of the year on Thursday night, when the Seattle Seahawks rallied to defeat the Los Angeles Rams in overtime, not only moving to 12-3 but also controlling their destiny in pursuit of the No. 1 seed in the NFC. That baton will be passed to the rest of the slate, which includes a doubleheader on Saturday and a slew of high-stakes games on Sunday. While the primary focus will be on how those games shape up and further clarify the playoff picture, we also need to pay attention to injuries. As is the case every week, injuries will play a big piece to how these matchups unfold, so it's important to know who is in, out, and has their status still in question. Below, we'll go through all the final injury reports for the remaining games in Week 16. All Week 16 NFL betting lines via DraftKings Sportsbook.Philadelphia Eagles (-7) at Washington Commanders (Saturday)\nTeamPlayerPositionInjuryStatusEaglesJalen CarterDTShoulderOutLane JohnsonOTFootOutCameron LatuTEStingerQuestionableCameron WilliamsOTShoulderQuestionableCommandersEddie GoldmanDTConcussionOutJayden DanielsQBLeft elbowOutLaremy TunsilOTObliqueOutColson YankoffTEAnkleOutJonathan JonesCBRibQuestionableJer'Zhan NewtonDTIllnessQuestionablePhiladelphia will continue to be without two key figures in the trenches as both Jalen Carter and Lane Johnson did not practice at all this week. Meanwhile, after missing Tuesday's session with a stinger, Saquon Barkley logged back-to-back full practices and carries no injury designation for Saturday. The Commanders have decided to shut Jayden Daniels down for the rest of the season, and he's since been officially ruled out. That means backup Marcus Mariota will get another start. He'll do so without his star left tackle as Larmey Tunsil is out with a strained oblique. Tunsil practiced on a limited basis on Wednesday, but was downgraded to a non-participant on Thursday. Green Bay Packers at Chicago Bears (-1.5) (Saturday)\nTeamPlayerPositionInjuryStatusPackersJosh WhyleTEConcussionOutJohn WilliamsIOLBackOutMarShawn LloydRBCalf, hamstringOutChris BrooksRBChestQuestionableBrenton Cox Jr.DLGroinQuestionableKingsley EnagbareDLIllnessQuestionableJosh JacobsRBKnee, ankleQuestionableDarian KinnardOLNeckQuestionableCollin OliverDLHamstringQuestionableZach TomOLBack, kneeQuestionableChristian WatsonWRChest, shoulderQuestionableDontayvion WicksWRAnkleQuestionableEvan WilliamsSKneeQuestionableBearsLuther Burden IIIWRAnkleOutRome OdunzeWRFootOutAmen OgbongbemigaLBHamstringOutTremaine EdmundsLBGroinQustionableCole KmetTEAnkle, kneeQuestionableD'Andre SwiftRBGroinQuestionableJoe Tryon-ShoyinkaDLNot injury-relatedQuestionableThe notable names in Green Bay's lengthy injury report come on the offensive side of the ball with Josh Jacobs and Christian Watson, who are both questionable. Watson suffered a chest injury during Sunday's loss to the Broncos and needed to be examined at a local hospital. Fortunately, he avoided a significant injury, but his status for Week 16 is up in the air. He was limited on Wednesday and Thursday. As for Jacobs, the star back did not practice at all this week. Chicago's receiver room will be thin in Week 16 with both Rome Odunze and Luther Burden III sidelined for this matchup. Meanwhile, running back D'Andre Swift popped up on the injury report on Wednesday and logged back-to-back limited sessions due to a groin injury, which has him questionable. Buffalo Bills (-10.5) at Cleveland Browns\nTeamPlayerPositionInjuryStatusBillsMatt PraterKRight quadOutJordan PhillipsDTAnkleOutChase LundtOTKneeOutCam LewisDBHamstringQuestionableMecole Hardman Jr.WRCalfQuestionableBrownsJack ConklinRTConcussionOutDavid NjokuTEKneeOutWinston ReidLBBackOutDylan SampsonRBHandOutDenzel WardCBCalfOutDeshaun WatsonQBAchillesOutSam KamaraDTElbowQuestionableWyatt TellerRGCalfQuestionableThe most notable development on Buffalo's injury report is who is not on it. Specifically, cornerback Christian Benford (toe) logged a full practice on Friday and carries no designation for this week, meaning he will suit up. Jack Conklin will miss his third-straight game due to a concussion, while Njoku will be sidelined for the second week in a row with a knee injury. Rookie running back Dylan Sampson did not practice this week due to a hand injury and has since been ruled out. As for right guard Wyatt Teller, he was limited in practice this week after missing both Week 14 and Week 15 with a calf injury, and is officially questionable. Cincinnati Bengals (-4.5) at Miami Dolphins\nTeamPlayerPositionInjuryStatusBengalsNoah FantTEAnkleOutCharlie JonesWRAnkleOutJoseph OssaiDEAnkleOutTee HigginsWRConcussionQuestionableB.J. HillDTAnkleQuestionablePJ JulesSAnkleQuestionableDolphinsMinkah FitzpatrickSCalfOutJordyn BrooksLBFoot, kneeQuestionableElijah CampbellDBAnkle, kneeQuestionableIsaiah JohnsonCBKneeQuestionableAndrew MeyerOLTricepQuestionableJason SandersKRight hipQuestionableTee Higgins logged a full practice on Friday, which gives him a good shot at clearing the final hurdles of concussion protocol and playing on Sunday. Cincinnati also activated defensive end Shemar Stewart off of injured reserve. After missing the first two days of practice, linebacker Jordyn Brooks returned on Friday as a limited participant, which gives him a shot to play on Sunday as he's now listed as questionable. Los Angeles Chargers at Dallas Cowboys (-1.5)\nTeamPlayerPositionInjuryStatusChargersRJ MickensSShoulderOutDerius DavisWRAnkleOutBud DupreeOLBBackQuestionableQuentin JohnstonWRGroinQuestionableElijah MoldenDBHamstringQuestionableTrey Pipkins IIIOLAnkleQuestionableTeair TartDLShinQuestionableCowboysDaRon BlandCBFootOutTyler GuytonOTAnkleOutJosh ButlerCBKneeQuestionableCaelen CarsonCBShoulder, HamstringQuestionableTrevon DiggsCBKneeQuestionableHunter LuepkeFBConcussionQuestionablePhil MafahRBShoulderQuestionablePayton TurnerDERibsQuestionableQuinnen WilliamsDTConcussionQuestionableJohnston and Pipkins both were limited throughout the week of practice for the Chargers, which gives them a good shot at playing on Sunday. Quarterback Justin Herbert was listed on the injury report throughout the week with his left hand injury, but he's been a full participant and has no game designation. CeeDee Lamb missed the first two days of practice this week due to an illness, but returned Friday as a full participant and carries no injury designation. With Bland ruled out, it'll be interesting to see if Trevon Diggs plays this weekend after being limited throughout the week. Meanwhile, Quinnen Williams was a full participant, so he seems to be progressing through concussion protocol well. Kansas City Chiefs (-3) at Tennessee Titans\nTeamPlayerPositionInjuryStatusChiefsLeo ChenalLBShoulderOutTrent McDuffieCBKneeOutJaylon MooreOTKneeOutRashee RiceWRConcussionOutJawaan TaylorOTElbowOutTyquan ThorntonWRConcussionOutJake BriningstoolTEHamstringOutNazeeh JohnsonCBShoulderOutDerrick NnadiDTIllnessOutTitansBryce OliverWRKneeOutOluwafemi OladejoLBFibulaOutCedric GrayLBConcussionOutJalyn Armour-DavisCBAchillesQuestionableAli GayeLBKneeQuestionableGunnar HelmTEToeQuestionableVan JeffersonWRBackQustionableArden KeyLBIllnessQuestionableKansas City is ruling out nine players for Week 18, including top wideout Rashee Rice. He was unable to practice this week due to a concussion. Meanwhile, the offensive line will continue to be thin with tackles Jawaan Taylor and Jaylon Moore both out as well. Tennessee will be monitoring the status of linebacker Arden Key, who appeared on the injury report on Friday due to an illness that held him out of practice and has him officially listed as questionable. Tampa Bay Buccaneers (-3) at Carolina Panthers\nTeamPlayerPositionInjuryStatusBuccaneersN/AN/AN/AN/APanthersTershawn WhartonDTHamstringOutTrevin WallaceILBShoulderOutIkem EkwonuOTKneeQuestionableDavid MooreWRElbowQuestionableThe Buccaneers have a clear bill of health coming into Week 16, listing no players with a game designation. Left tackle Ikem Ekwonu was able to practice for the first time this week on Friday, which gives him a shot at suiting up on Sunday for Carolina. Rookie wideout Tetairoa McMillan (foot, ankle) did not practice on Wednesday, but was a full participant the past two days and carries no designation for Week 16. Minnesota Vikings (-2.5) at New York Giants\nTeamPlayerPositionInjuryStatusVikingsJavon HargraveDLThighOutRyan KellyCKneeQuestionableAustin KeysLBAnkleQuestionableBrian O'NeillOTHeelQuestionableGavin BartholomewTEBackQuestionableTy ChandlerRBKneeQuestionableGiantsBeaux CollinsWRConcussion, neckOutEvan NealOLNeck, hamstringOutRakeem Nunez-Roches Sr.DLAnkleOutKayvon ThibodeauxOLBShoulderOutJoshua EzeuduOLCalfQuestionableDemetrius Flannigan-FowlesLBIllnessQuestionableArt GreenCBIllness, hamstringQuestionableRico PaytonCBBackQuestionableThe Vikings announced that offensive tackle Christian Darrisaw (knee) has been placed on injured reserve. Justin Skule will start in his place at left tackle, according to head coach Kevin O'Connell. After logging a full practice on Wednesday, the Giants listed Evan Neal as a non-participant on back-to-back days and have since been ruled out. Neal has yet to play this season. Elsewhere, pass rusher Kayvon Thibodeaux will be sidelined after missing the entire week of practice with a shoulder injury. New York Jets at New Orleans Saints (-6)\nTeamPlayerPositionInjuryStatusJetsKiko MauigoaLBNeckOutMason TaylorTENeckOutEric WattsDLConcussionOutJustin FieldsQBKneeQuestionableTyrod TaylorQBGroin, kneeQuestionableSaintsAlvin KamaraRBKnee, ankleOutAsim RichardsOTAnkleOutCesar RuizGAnkleOutNathan ShepherdDTAnkle, kneeQuestionableMason TiptonWRIllnessQuestionableZaire Mitchell-PadenTEKneeQuestionableNew York will start Brady Cook again at quarterback, but Fields and/or Taylor could be available in a backup/emergency role as they are both questionable. Rookie tight end Mason Taylor is out after not practicing this week. The Saints will once again be without Alvin Kamara as the veteran back has been ruled out with knee and ankle injuries. Kamara hasn't played since suffering an MCL sprain in Week 12. With Devin Neal on injured reserve, New Orleans' backfield is quite thin. Atlanta Falcons (-3) at Arizona Cardinals\nTeamPlayerPositionInjuryStatusFalconsKhaDarel HodgeWRShoulderOutMike HughesCBAnkleOutDrake LondonWRKneeQuestionableJames Pearce Jr.EDGEFootQuestionableBrandon DorlusDLIllness, shoulderQuestionableCardinalsMax MeltonCBHeelOutDarren HallCBConcussionOutParis Johnson Jr.OLKneeOutJalen ThompsonSHamstringOutEvan BrownOLPersonalOutL.J. CollierOLKneeQuestionableMarvin Harrison Jr.WRHeelQuestionableDadrion Taylor-DemersonSAnkleQuestionableCody SimonLBKnee, ankleQuestionableXavier WeaverWRHamstringQuestionableDespite being officially listed as questionable, the Falcons are slated to get star wideout Drake London back this week. Head coach Raheem Morris told reporters that London, who missed the last four games with a PCL sprain in his knee, is fully expected to play. Marvin Harrison Jr. is trending towards playing, telling reporters on Friday that he's \"good enough to go.\" The second-year wideout missed two games with a heel injury. \nJacksonville Jaguars at Denver Broncos (-3.5)\nTeamPlayerPositionInjuryStatusJaguarsBhayshul TutenRBFingerOutDanny StriggowDEAnkleOutJalen McLeodLBAnkleOutBroncosJustin StrnadILBFootOutKarene ReidILBHamstringQuestionableBen PowersGBicepsQuestionableTuten will be sidelined for the Jaguars on Sunday, and it's possible his absence could be longer. He did not practice at all this week due to his finger injury, which could mean even more carries for Travis Etienne Jr. out of the backfield. Both Powers and Reid practiced fully on Friday, so Denver is pretty healthy coming into Week 16 outside of Strnad, who missed all week. Pittsburgh Steelers at Detroit Lions (-7)\nTeamPlayerPositionInjuryStatusSteelersT.J. WattLBLungOutIsaac SeumaloGTricepsOutJames PierreCBCalfOutNick HerbigLBHamstringDoubtfulChristian KuntzLSKneeQuestionableLionsKerby JosephSKneeOutGiovanni ManuOTKneeOutTrystan ColonOLWristQuestionableTaylor DeckerOTShoulderQuestionableGraham GlasgowCKneeQuestionableChristian MahoganyOGFibulaQuestionableAmik RobertsonDBHandQuestionablePittsburgh will once again be without edge rusher T.J. Watt, who did not practice this week due to his lung issue. Seumalo and Pierre also did not practice at all this week and have subsequently been ruled out. Joseph couldn't get on the field with the Lions this week and has since been ruled out. Decker and Glasgow are two linemen to monitor heading into the weekend, as neither was able to practice on Friday. Las Vegas Raiders at Houston Texans (-14)\nTeamPlayerPositionInjuryStatusRaidersKolton MillerOLAnkleOutJordan MeredithOLAnkleQuestionableTexansAzeez Al-ShaairLBAnkle, kneeQuestionableChristian KirkWRIllnessQuestionableWoody MarksRBAnkleQuestionableDerek Stingley Jr.CBOlbiqueQuestionableNick ChubbRBRibsQuestionableJake HansenLBChestQuestionableJustin WatsonWRCalfQuestionableHead coach Pete Carroll said Friday that Geno Smith is good to go this week and will starter after missing last week with right shoulder and back injuries. He practiced fully throughout the week. Meanwhile, Maxx Crosby also carries no injury designation after practicing fully on Friday despite a knee injury.Houston's backfield is worth monitoring with both Woody Marks and Nick Chubb listed as questionable. Both were able to practice, however, with Chubb listed as a full participant while Marks was limited. Star corner Derek Stingley Jr. returned to practice on a limited basis on Friday after missing both Wednesday and Thursday due to an oblique injury. New England Patriots at Baltimore Ravens (-3)\nTeamPlayerPositionInjuryStatusPatriotsRobert SpillaneLBAnkleOutChristian BarmoreDTKneeQuestionableCarlton Davis IIICBHipQuestionableMarcus JonesCBKneeQuestionableHarold LandryLBKneeQuestionableRavensTeddye BuchananLBKneeOutJay Higgins IVLBKneeOutChidobe AwuzieCBFootDoubtfulKyle HamiltonSAnkleQuestionableJohn JenkinsDTIllnessQuestionableRonnie StanleyOTKnee, ankleQuestionableNew England's defense could have a serious dent put into it this weekend, particularly if a number of key questionable players are unable to go. Christian Barmore seemed to be the most at risk of not playing after not participating on Friday. Every other questionable Patriot practiced on a limited basis to end the week. \nAfter not practicing on Wednesday, Lamar Jackson participated fully on both Thursday and Friday, and carries no designation for Week 16. Maybe the most intriguing aspect of Baltimore's injury report, however, is Kyle Hamilton, who is questionable after popping up on the report on Friday as a limited participant with an ankle injury. San Francisco 49ers (-5.5) at Indianapolis Colts (Monday)\nTeamPlayerPositionInjuryStatus49ersColtsAnalysis to come.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 16 NFL injury report: Updates on Drake London, Tee Higgins and Josh Jacobs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/07/29/bd5606c6-8ba0-4dc7-8c4a-aeac4adf253e/thumbnail/1200x675/a324ddda370004c0d7215c7eddce2a12/getty-drake-london-falcons.jpg"
      ],
      "datePublished": "2025-12-19T23:04:09.000Z",
      "dateModified": "2025-12-19T23:04:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]