[
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus for backing Mariners, Jacksonville State, Sam Houston today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-betmgm-bonus-code-cbssports-get-150-bonus-mariners-jacksonville-state-sam-houston-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-15T19:01:45.000Z",
    "description": "\n        The 2025 MLB Playoffs continue on Wednesday with Game 3 of the ALCS, and it's a perfect opportunity to use BetMGM bonus code CBSSPORTS, which",
    "body": "\n        The 2025 MLB Playoffs continue on Wednesday with Game 3 of the ALCS, and it's a perfect opportunity to use BetMGM bonus code CBSSPORTS, which offers $150 in bonus bets if your first $10 bet wins or up to $1,500 back in bonus bets if your first qualifying wager loses. Mariners vs. Blue Jays is scheduled for 8:08 p.m. ET in Seattle, and there are also a pair of Conference USA matchups tonight in college football, with Jacksonville State vs. Delaware and Sam Houston vs. UTEP both kicking off at 7 p.m. ET.Picks from all three games are among our Wednesday MLB and college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. It also entered the second week of the 2025 MLB playoffs a profitable 35-29 on top-rated MLB money-line picks this season. Anybody following its MLB betting and college football betting picks at sportsbooks and on betting sites could have seen strong returns.  Wednesday's best bets at BetMGMJacksonville State +3 vs. Delaware (-115)Sam Houston money line vs. UTEP (+110)Mariners money line vs. Blue Jays (-135)Combining these three picks into a Wednesday MLB and CFB parlay at BetMGM would result in a payout of +583 (risk $100 to win $583). Bet it at BetMGM here:Jacksonville State +3 vs. Delaware (-115)Delaware is off to a 3-2 start in its first FBS season, but the Blue Hens dropped to 1-1 in the conference after a 27-24 loss at home to Western Kentucky last week. Meanwhile, Jacksonville State is 3-3, but the Gamecocks are 2-0 in Conference USA with wins over Liberty and Sam Houston. Jacksonville State managed nine wins in each of its first two seasons in FBS, and it will also have home-field advantage on Wednesday. The model predicts that the Gamecocks cover in 73% of simulations. Back Jacksonville State at BetMGM Sportsbook now:Sam Houston money line vs. UTEP (+110)These two Texas institutions are at the bottom of the Conference USA standings entering tonight's action, as UTEP is 1-5 overall and 0-2 in the league while Sam Houston is 0-6 and 0-3 in conference play. However, Sam Houston is only a year removed from a 10-win season, and UTEP has been bowling three times in 20 years and hasn't managed more than seven wins in a season during that span. The Bearkats won 41-21 in El Paso last season and are coming off their best performance of the season in a tight 29-27 loss to Jacksonville State last week. The model predicts that Sam Houston wins outright in 64% of simulations. Bet the Bearkats at BetMGM here:Mariners money line vs. Blue Jays (-135)The Mariners took a commanding lead in the series with a pair of wins in Toronto, and now they'll head back home to Seattle with a sweep in mind. George Kirby will take the ball for Game 3 of the ALCS, and he is sporting a 2.70 ERA with 14 strikeouts over 10 innings so far during the 2025 MLB Playoffs. Meanwhile, Cal Raleigh has followed up a historic 60-homer season by posting a 1.078 OPS during the postseason. Blue Jays starter Shane Bieber only lasted 2 2/3 innings in his lone playoff start, and the model has the Mariners winning in 61% of simulations. Bet Seattle at BetMGM:Want more college football picks for Wednesday?You've seen some of the model's Wednesday best bets. Now, get against the spread, total and money-line picks for every college football game on the Week 8 schedule, all from the model that's simulated every game 10,000 times. Also at SportsLine:You can also see weekend MLB picks from legendary handicapper Bruce Marshall, who is 176-164-3 (+2742) over his last 343 MLB picks. See his best bets right here. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus for backing Mariners, Jacksonville State, Sam Houston today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-15T19:01:45.000Z",
      "dateModified": "2025-10-15T19:01:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USA soccer has another upcoming talent with a bright future, but European national team is making a push - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/usa-soccer-has-another-upcoming-talent-with-a-bright-future-but-european-national-team-is-making-a-push/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/b31360dd-c263-46cb-9308-4a387f54c1cd/thumbnail/1200x675/6a7a52ed2a02d724a5f16c0e60b06661/uswnt-1.jpg",
    "tag": "Sports",
    "date": "2025-10-15T23:58:52.000Z",
    "description": "\n        American midfielder Rokas Pukstas made the move to Barcelona's academy from Sporting Kansas City in 2020, and now shining for Croatian club H",
    "body": "\n        American midfielder Rokas Pukstas made the move to Barcelona's academy from Sporting Kansas City in 2020, and now shining for Croatian club Hajuk Split, Pukstas is wanted by more than just U.S. Soccer. The 21-year-old is rebuffing interest from Lithuania while keeping the door open for the United States in the future. Pukstas is in the midst of a strong season with the Croatian side, already scoring four goals in nine league appearances.Due to Pukstas' parents being Lithuanian, the midfielder is also eligible to represent the nation, but when they've called, he's been clear that his heart is set on representing the United States. Born in Stillwater, Okla., Pukstas has represented the United States at youth levels, but he hasn't been capped since the U-20 World Cup, where he appeared in midfield in June of 2023 under Mikey Varas.\"Being a dual national, you get calls from Lithuania, but I made clear, I made it direct that I'm here to play for the USA,\" Pukstas said on CBS Sports Golazo's Morning Footy. \"That's where my heart is, so they know where my heart is, and that's what I tell them.\"Pukstas added that he hasn't had conversations with the current USMNT regime under Mauricio Pochettino, but having represented the youth teams and been around the federation, he knows what he needs to focus on. Being the best he can be at his club and helping Hajuk Split win matches is what Pukstas can control, and he's doing just that after also getting to improve playing alongside a legend in Ivan Rakitic.\nRakitic is now in the Hajduk Split front office, but he spent the 2024-25 season with the club before retiring, which was a transformative time for Pukstas. He was able to learn from the midfielder and how he sees the field, and it's showing this season.\"I asked him a step-by-step process of how he approaches it, you know, and he took me through everything,\" Pukstas said. \"He took me through all his small details that he's learned. So just everything that he's given to me, I'm more than grateful.\"\nIt's something that can be helpful, having club legends around, but credit must be given to Pukstas for soaking up everything that he could in their time together. His journey has been far from an average one, and seeing his old teammates do well for their clubs and with the USMNT is something that gives Pukstas confidence that he can make the breakthrough, too.\"The guys like Diego Luna, Jack McGlynn, you see them, and you know, I was in their cycle with them for two to three years, so we saw each other develop,\" Pukstas said. \"So it's great to see these guys, you know, perform, not only play, but perform for the team. So it gives me confidence because I was there with them, too, and it also makes me happy that they're performing so well.\"Only 21, even if Pukstas doesn't make this World Cup squad, there's plenty of time for him to make that breakthrough. His team are level with Dinamo Zagreb atop the Croatian Football League, which could also lead to Pukstas gaining Champions League experience. Already appearing in UEFA Conference League qualifiers this campaign, the UCL would provide more opportunities for Pukstas to continue his upward trajectory and get onto the USMNT roster.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USA soccer has another upcoming talent with a bright future, but European national team is making a push - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/b31360dd-c263-46cb-9308-4a387f54c1cd/thumbnail/1200x675/6a7a52ed2a02d724a5f16c0e60b06661/uswnt-1.jpg"
      ],
      "datePublished": "2025-10-15T23:58:52.000Z",
      "dateModified": "2025-10-15T23:58:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Gannon explains when he learned to take emotion out of coaching: 'When our quarterback went to jail' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jonathan-gannon-explains-when-he-learned-to-take-emotion-out-of-coaching-when-our-quarterback-went-to-jail/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/ad41cf59-443a-47bb-9b79-c9ea7d958085/thumbnail/1200x675/a1d5595e49bdf1db7df9853f99d47ee8/jonathan-gannon.jpg",
    "tag": "Sports",
    "date": "2025-10-15T22:49:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Arizona Cardinals are having a tough 2025 seas",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Arizona Cardinals are having a tough 2025 season. They suffered the most embarrassing loss of any team in the league two weeks ago when they melted down against the then-winless Titans to hand Tennessee a victory. At 2-4 and in danger of falling fully out of the playoff race, they are dealing with another injury absence from quarterback Kyler Murray. Murray missed last week's game with a foot sprain, and his status still unsure for this week against Green Bay. Cardinals coach Jonathan Gannon received a question Wednesday about dealing with injuries and when he learned to put emotion aside as a coach. He offered up an extremely blunt answer about his time on the Atlanta Falcons coaching staff. \"2007. When our quarterback went to jail,\" Gannon said, succinctly.\nIt's highly doubtful that was the answer which the reporter expected, but that was Gannon's first year in the NFL (and only year in Atlanta) as a quality control coach. That situation would certainly impact you as a young coach in the NFL and provide a harsh lesson about how quickly things can change. Gannon is navigating a very different situation in Arizona, but one that has him on the hot seat nonetheless. It's been pretty clear that Gannon feels the frustration of another losing season in Arizona, as he's now 14-26 as an NFL head coach, and that's surfaced in a variety of ways.\nMost notably, Gannon got tagged with a $100,000 fine for hitting Emari Demarcado on the sidelines during the Titans loss after he dropped the ball before reaching the goal line. He's also apparently not particularly interested in offering up flowery anecdotes about lessons he's learned as a coach, as evidenced by his answer that left those in his press conference without a follow-up on Wednesday. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Gannon explains when he learned to take emotion out of coaching: 'When our quarterback went to jail' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/ad41cf59-443a-47bb-9b79-c9ea7d958085/thumbnail/1200x675/a1d5595e49bdf1db7df9853f99d47ee8/jonathan-gannon.jpg"
      ],
      "datePublished": "2025-10-15T22:49:27.000Z",
      "dateModified": "2025-10-15T22:49:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tua Tagovailoa issues apology to teammates for his comments following the Dolphins' latest loss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/tua-tagovailoa-issues-apology-to-teammates-for-his-comments-following-the-dolphins-latest-loss/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/517918de-3bfc-423c-9a8d-91f166f306b3/thumbnail/1200x675/fb28404d0995c6245895e378fdd5846d/tua25.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:33:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tua Tagovailoa has issued a public apology to his ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tua Tagovailoa has issued a public apology to his teammates for his comments following the Miami Dolphins' Week 6 loss to the Los Angeles Chargers. Following Sunday's loss, Tagovailoa publicly called out teammates for either being late to or not attending players-only meetings. Tagogvailoa said that, while those comments were well-intended, he realizes now that it created an unneeded distraction for a Dolphins team that enters this Sunday's game against the Browns with a 1-5 record. \"I made a mistake, and I'm owning up to that right now,\" Tagovailoa said. The Dolphins' former Pro Bowl quarterback said that he has spoken to the team's other leaders about his comments while adding that they \"know that my intent was right.\" \n\"The intent can be right,\" he said, \"but when things get misconstrued or however the media wants to portray it, that leaves a void of silence and a lot of questions for the guys on our team now.\" In addition to adding to the outside noise, Tagovailoa also acknowledged that he didn't protect the locker room by airing the team's business publicly. \"I felt like I let the emotions of the game get to me after the game,\" he said. \"That's something that I can learn from as a leader on this team. What happens in-house should be protected, and none of that should have gotten out. And so want to publicly apologize about that. Want to move forward and focus on the Cleveland Browns.\" \nAs Tagovailoa surely knows, winning can cure a lot of things for a struggling team. Fortunately for the Dolphins, their next opponent has also won just one game and has had a similarly tumultuous start to the 2025 season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tua Tagovailoa issues apology to teammates for his comments following the Dolphins' latest loss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/517918de-3bfc-423c-9a8d-91f166f306b3/thumbnail/1200x675/fb28404d0995c6245895e378fdd5846d/tua25.jpg"
      ],
      "datePublished": "2025-10-15T20:33:17.000Z",
      "dateModified": "2025-10-15T20:33:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL survivor picks, knockout pool predictions, strategy guide for Week 7 from proven computer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-survivor-pool-picks-strategy-guide-advice-week-7/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/fe554be6-0247-4976-b8dd-8acc6fb05e8c/thumbnail/1200x675/39726eeff82af032855b58093f9c131a/matthew-stafford-los-angeles-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:47:20.000Z",
    "description": "\n        The available Week 7 survivor pool teams has dwindled even further. Couple that with a number of upsets, including the Thursday night New Yor",
    "body": "\n        The available Week 7 survivor pool teams has dwindled even further. Couple that with a number of upsets, including the Thursday night New York Giants win over the Philadelphia Eagles 34-17, and many survivor pool players' hopes are in tatters. For those still alive, this week's schedule does give them a number of options to be able to move on. Among the likely targets for NFL survivor players this week include Packers vs. Cardinals (+6.5), Buccaneers vs. Lions (-5.5) on 'Monday Night Football,' Patriots (-7) vs. Titans and Broncos (-7) vs. Giants.Meanwhile, the Kansas City Chiefs will look to battle their way back to the top of the AFC West standings when they take on the visiting Las Vegas Raiders. Las Vegas is 2-4 on the year and fourth in the AFC West, while the Chiefs are third at 3-3. Kansas City enters as an 11.5-point favorite, the largest line of the week, so the Chiefs will be an appealing option for those who can still use them. Before finalizing any Week 7 NFL survivor picks, see which team the red-hot SportsLine Projection Model just went all-in on.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 42-25 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns. The model can be used to crush the survivor pool format, which calls for picking one team to win each week but never using the same team twice.Now, it has turned its attention to the latest Week 7 NFL schedule and locked in its Week 7 survivor pool pick. You can only see who the model is backing this week at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top Week 7 NFL survivor pool predictions In Week 7 of the 2025 NFL season, the model is shying away from the Los Angeles Rams as they take on the Jacksonville Jaguars at Wembley Stadium in London, England. The Rams are 3-point and -154 money-line favorites, as one of the road favorites in the Week 7 lines. They are coming off a 17-3 win over the Baltimore Ravens as Matthew Stafford completed 17 of 26 passes for 181 yards and one touchdown. The Jaguars, meanwhile, are off to a 4-2 start following a 20-12 loss to the Seattle Seahawks on Sunday. Fading the Rams may also be part of a greater NFL survivor pool strategy, which sees the Rams play a struggling Saints team in a couple of weeks. The model projects the Rams to win 51% of the time, which is lower than most other teams this week, making Los Angeles a team to avoid in NFL survivor pool picks. See which team to pick instead here. You can also use the latest FanDuel promo code to get $300 in bonus bets instantly:How to make Week 7 NFL survivor pool picks Instead, the model is confidently backing a team many have not used in survivor pools to win outright in over 80% of simulations. The time to pick this team is now, and you can only see the play over at SportsLine.Which surprising team is a must-back in your Week 7 NFL survivor pool? Visit SportsLine now to see which team carries you to victory in Week 7, all from the advanced computer model that nails survivor picks and is up well over $7,000 since its inception.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL survivor picks, knockout pool predictions, strategy guide for Week 7 from proven computer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/fe554be6-0247-4976-b8dd-8acc6fb05e8c/thumbnail/1200x675/39726eeff82af032855b58093f9c131a/matthew-stafford-los-angeles-rams-imagn-images.jpg"
      ],
      "datePublished": "2025-10-15T20:47:20.000Z",
      "dateModified": "2025-10-15T20:47:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Draymond Green doesn't think he could average 20 points on a lottery team - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/draymond-green-doesnt-think-he-could-average-20-points-on-a-lottery-team/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/59df3237-d2a8-4690-ae47-55e12592d960/thumbnail/1200x675/70ceb412fd49b4e08ac894e28a00606e/draymond-green-warriors.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:39:43.000Z",
    "description": "\n        Draymond Green begins his 14th NBA season when the Warriors take on the Lakers Oct. 22 on opening night. He is a four-time champion, Defensiv",
    "body": "\n        Draymond Green begins his 14th NBA season when the Warriors take on the Lakers Oct. 22 on opening night. He is a four-time champion, Defensive Player of the Year winner, four-time All Star and two-time All-NBA player. He will retire as a first-ballot Hall of Famer easily, and despite the ever evolving roster around him, Green will almost certainly retire with the Warriors.But Green's also at the point in his career where we see some decline in players, which often leads to the team making a tough decision in moving on from them in favor of a younger -- or in Klay Thompson's case, a cheaper -- option. However, Green doesn't appear to be itching to leave Golden State, and even if he did it certainly wouldn't be for a rebuilding team.\"Could I average 20 [points] on a lottery team? I have no interest in doing that,\" Green said on the \"Why is Draymond Green Talking About Football?\"  podcast when asked how much he could average on a lottery team. \"You want me to go play bad basketball? ... I once averaged 15 [points] on a great team. So, you do the math.\"Green is probably the worst person to ask that question to, because he's never been the type of player to chase stats. The reason he's considered an all-time great is because he carved out a role for himself with the Warriors which consists of a lot of intangible things that don't show up on the box score. He's going to be the defensive anchor, capable of sliding between multiple positions, can be the connector offensively as a facilitator and is the heart of the Warriors dynasty with his fiery personality which has its pros and cons. \nThat lone season Green averaged 15 points (actually was 14 points but that's a minor discrepancy) is the year that the Warriors set the record for most regular season wins with 73. That team clicked on all cylinders in more ways than one, and could be considered the peak of Golden State's powers despite losing in the Finals to LeBron James and the Cavaliers. Since that year, Green's role has been less of a scorer and more as a Swiss army knife doing whatever is necessary.\"I don't know if I have that mindset anymore,\" Green said. \"That's a mindset that you have to have, and I left that mindset so long ago that I'm not sure I could even tap back into that. ... The reason I got to the NBA is because I could score. To then come into the NBA and be doing that, and then like have to switch the whole thing up, it's hard to just go back to that. It requires you to change how you see the game. There's a certain way that I had to start seeing the game for our teams to work. So to then try to flip back to that, it's a very tough thing to do.\"\nLuckily, Green probably doesn't have to concern himself with those hypotheticals, because it would be incredibly shocking if he didn't retire with the Warriors. Or at the very least if he were to leave, he'd certainly join another championship-contending team. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Draymond Green doesn't think he could average 20 points on a lottery team - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/59df3237-d2a8-4690-ae47-55e12592d960/thumbnail/1200x675/70ceb412fd49b4e08ac894e28a00606e/draymond-green-warriors.jpg"
      ],
      "datePublished": "2025-10-15T20:39:43.000Z",
      "dateModified": "2025-10-15T20:39:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UTEP vs. Sam Houston odds, picks, score predictions, Wednesday best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/utep-sam-houston-prediction-odds-expert-picks-line-college-football-wednesday-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/4639586d-e181-4c41-93e0-6e5c8907ff90/thumbnail/1200x675/be28ffe0b221d5ad9a65fb44166f9de0/hunter-watson-sam-houston.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:12:09.000Z",
    "description": "\n        A Conference USA matchup features the UTEP Miners (1-5) and the Sam Houston Bearkats (0-6) battling on Wednesday evening. UTEP has dropped fo",
    "body": "\n        A Conference USA matchup features the UTEP Miners (1-5) and the Sam Houston Bearkats (0-6) battling on Wednesday evening. UTEP has dropped four consecutive games. Last week, Liberty defeated the Miners 19-8. The Bearkats are still searching for their first victory. On Oct. 9, Jacksonville State beat Sam Houston 29-27. Sam Houston is 1-5 against the spread, while UTEP is 2-4 ATS.Kickoff from the Shell Energy Stadium in Houston, Texas, is at 7 p.m. ET on CBS Sports Network. The Miners are 3-point favorites in the latest UTEP vs. Sam Houston odds, while the over/under for total points scored is 47.5 via SportsLine consensus. Before making any Sam Houston vs. UTEP picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on UTEP vs. Sam Houston. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for UTEP vs. Sam Houston:UTEP vs. Sam Houston             spreadMiners -3 at DraftKings SportsbookUTEP vs. Sam Houston                       over/under47.5 pointsUTEP vs. Sam Houston                       money line Miners -148, Bearkats +123UTEP vs. Sam Houston               picksSee picks at SportsLineUTEP vs. Sam Houston                 streaming Fubo (Try for free)  Why UTEP can coverJunior receiver Kenny Odom is the leading pass catcher for the Miners, as he leads the team in catches (26) and receiving yards (300) with two scores. The Georgia native has gone over 50 receiving yards in three games this season, including three catches for 53 receiving yards in his last outing. Senior safety Udoka Ezeani has 26 total tackles, with team-highs in sacks (4) and forced fumbles (2). Senior linebacker Micah Davey is another productive player in the middle of the defense. He has a team-high 63 total tackles. The Louisiana native has three games with double-digit tackles in 2025. See which team to back at SportsLine. Why Sam Houston can coverSenior quarterback Hunter Watson brings a dual-threat ability under center. Watson has 754 passing yards, 208 rushing yards and six total touchdowns this season. In his last outing against Jacksonville State, Watson went 12-of-19 for 136 passing yards and three passing scores. He's added 52 rushing yards as well. Senior defensive back Emon Allen has logged 26 total tackles, a forced fumble, two interceptions and one defensive touchdown. The Bearkats are 1-1 ATS as the home underdogs this season. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make UTEP vs. Sam Houston picksSportsLine's model is going Under on the total, projecting 43 combined points. It also says one side of the spread hits in well over 60% of simulations. You can only get the pick at SportsLine. So who wins UTEP vs. Sam Houston, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the UTEP vs. Sam Houston spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UTEP vs. Sam Houston odds, picks, score predictions, Wednesday best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/29/4639586d-e181-4c41-93e0-6e5c8907ff90/thumbnail/1200x675/be28ffe0b221d5ad9a65fb44166f9de0/hunter-watson-sam-houston.jpg"
      ],
      "datePublished": "2025-10-15T20:12:09.000Z",
      "dateModified": "2025-10-15T20:12:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mariners vs. Blue Jays: Where to watch ALCS Game 3, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mariners-vs-blue-jays-alcs-schedule-prediction-odds-tv-channel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/6860521d-7563-4e41-9d48-386e73f211c4/thumbnail/1200x675/db6f6869d034072d5f42adc2cd5a252e/polanco-getty.png",
    "tag": "Sports",
    "date": "2025-10-15T21:09:32.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    A rare ALCS matchup is underway, as the Blue Jays and Mariners have never squared off in this round\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 15, 2025\n                            \n                    at\n    5:09 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Seattle Mariners are sitting pretty. Two three-run home runs from Julio Rodriguez and Jorge Polanco powered the Mariners to a 10-3 (box score) Game 2 win over the Toronto Blue Jays on Monday, giving them a 2-0 ALCS lead. The series now heads to Seattle, where the home team will just need two wins to make their first ever World Series.The Blue Jays haven't been to the ALCS since 2016 and haven't been to the World Series since 1993. The Mariners haven't been to this round since 2001 and have never won the AL pennant. They remain the only team of 30 in MLB to have never played in the World Series. They'll have their chance to advance here, but they have to deal with a hungry Blue Jays team.Mariners vs. Blue Jays scheduleDateStart time/scoreTVLive streamGame 1Sun., Oct. 12SEA 3, TOR 1FoxfuboGame 2Mon., Oct. 13SEA 10, TOR 3FoxfuboGame 3Wed., Oct. 158:08 p.m. ETFS1fuboGame 4Thurs., Oct. 168:33 p.m. ETFS1fuboGame 5 (if nec.)Fri., Oct. 176:08 p.m. ETFS1fuboGame 6 (if nec.)Sun., Oct. 198:03 p.m. ETFS1fuboGame 7 (if nec.)Mon., Oct. 208:08 p.m. ETFoxfuboMariners vs. Blue Jays: Game 3 infoTime: 8:08 p.m. ET | Date: Wednesday, Oct. 15Location: T-Mobile Park -- Seattle, Wash.TV channel: FS1 | Live stream: fubo (Try for free)Starting pitchers: RHP George Kirby (SEA) vs. RHP Shane Bieber (TOR)Odds: Blue Jays +118, Mariners -143 (via DraftKings)\nGame 3 storylinesMariners: Heading home with a 2-0 series lead is the stuff dreams are made of for this Mariners club. They've pitched well, they've hit well, they've done it all. Two more wins and they'll make the first World Series in franchise history.Blue Jays: Only three teams in MLB history have ever lost the first two games at home in a best-of-seven series and gone on to win. The Blue Jays can't think about that yet. First they have to win Game 3. Whatever it takes.\nGame 3 predictionThe Mariners have been the better and more impressive team two games into the ALCS, and now they're going home to Seattle, where they went 51-30 during the regular season. Shane Bieber has been up and down since returning from Tommy John surgery and George Kirby has been lights out this postseason. All signs point to the Mariners taking a commanding 3-0 series lead in Game 3 on Wednesday. -- Mike Axisa\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mariners vs. Blue Jays: Where to watch ALCS Game 3, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/6860521d-7563-4e41-9d48-386e73f211c4/thumbnail/1200x675/db6f6869d034072d5f42adc2cd5a252e/polanco-getty.png"
      ],
      "datePublished": "2025-10-15T21:09:32.000Z",
      "dateModified": "2025-10-15T21:09:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 7 NFL score predictions, best bets today: Betting expert reveals exact picks for all 15 games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-score-predictions-week-7-best-bets-odds-expert-picks-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/3e8fa6c4-48b6-494e-a516-551c57e79bd4/thumbnail/1200x675/2dde3eb6eea9b104a8ff1d389d3b0bc6/justin-jefferson-minnesota-vikings-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T21:12:18.000Z",
    "description": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been ravin",
    "body": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been raving about the undefeated Eagles and Bills. Now both teams have lost two straight games. How about Lamar Jackson and the Ravens, one of the preseason favorites? With Jackson having been out each of the last two weeks, Baltimore enters its bye week 1-5 and is in serious danger of missing the postseason. Even the three-time defending AFC champion Chiefs aren't immune. They sit 3-3 heading into a Week 7 home date with AFC rival Las Vegas, though Kansas City is the largest favorite of the week at -11.5.Which teams would you take today to make the Super Bowl? Before the contenders start to separate from the pretenders, unpredictability in the NFL will continue to reign supreme. Week 7's 15 game slate should tell us plenty. Before making any Week 7 NFL picks, be sure to see the exact NFL score predictions from SportsLine expert Eric Cohen.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A SportsLine expert and host, Cohen is evaluating the entire Week 7 NFL slate and delivers score predictions and logic for each matchup. He finished the 2024-25 season with a 190-95 record on straight-up NFL betting picks (69%) and was profitable for bettors. He's 60-32-1 (65%) on straight-up picks so far this season. Anyone who followed Cohen's NFL predictions has been profitable at their favorite sports betting sites and betting apps. You can only see Cohen's Week 7 NFL exact score predictions at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 7 NFL picksAfter diving into all 15 games on the NFL Week 7 schedule, Cohen likes the Vikings (+1.5, 43.5) to send the defending champion Eagles to their third straight loss. The Eagles struggled mightily on defense last week, and it's uncertain if cornerback Quinyon Mitchell (hamstring) will be back this week. \"I think it's fair to call this game a must win for Philadelphia coming off two straight losses. We've already seen one Eastern Pennsylvania team fire a successful head coach (Penn State, James Franklin), and while I don't think Nick Sirianni's job is in imminent danger considering he most recently won the Super Bowl, a third straight loss will turn up the heat a bit. Coming off a bye week and with a brutal stretch ahead, this game might be a must win for Minnesota as well. This is the type of game where I would bet both sides +7.5 at something like -125 odds and prepare for a close game no matter who wins. My coin flip says Philly's misery continues for another week. Vikings 23, Eagles 21\". See his other Week 7 football score predictions at SportsLine.How to make Week 7 NFL score predictionsIn addition, Cohen is picking one game to fly over the projected total. You can see who it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for just $1.Who wins every Week 7 NFL game, and which game is a must bet for the over? Visit SportsLine now to get Eric Cohen's NFL Week 7 score predictions, all from the NFL expert who has nailed 65% of his NFL straight-up picks this season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 7 NFL score predictions, best bets today: Betting expert reveals exact picks for all 15 games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/04/3e8fa6c4-48b6-494e-a516-551c57e79bd4/thumbnail/1200x675/2dde3eb6eea9b104a8ff1d389d3b0bc6/justin-jefferson-minnesota-vikings-imagn-images.jpg"
      ],
      "datePublished": "2025-10-15T21:12:18.000Z",
      "dateModified": "2025-10-15T21:12:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Breece Hall landing spots: Where talented Jets RB could be dealt before NFL trade deadline - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/breece-hall-landing-spots-where-talented-jets-rb-could-be-dealt-before-nfl-trade-deadline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/03/8ce2607b-8c04-437a-b735-04e1d73ef3ea/thumbnail/1200x675/63063490e2f4cc1d4152c345a551a13e/breece-hall-jets-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:04:52.000Z",
    "description": "\n        The New York Jets are in free fall, off to an 0-6 under first-year coach Aaron Glenn.New York's 2025 0-6 start is just the third such winless",
    "body": "\n        The New York Jets are in free fall, off to an 0-6 under first-year coach Aaron Glenn.New York's 2025 0-6 start is just the third such winless beginning to a season in team history along with the 1996 season (0-7) and the 2020 season (0-13). The Jets will certainly be in the midst of a rebuild next offseason or two, which puts the future of talented, 24-year-old running back Breece Hall up in the air. The 2022 second-round pick is set to become a free agent next offseason, and the team drafted promising Wisconsin running back Braelon Allen in the fourth round of the 2024 NFL Draft a year ago. New York is projected to have the seventh-most effective cap space ($58.2 million) in the NFL next offseason, according to OverTheCap.com, but there's a decent chance the franchise won't prioritize that money on a running back next year with plenty of other holes to address. That's why it would make sense for the Jets to at least shop Hall around to see what they could get for the talented, well-rounded back. Which teams would make the most sense for Hall? Here is a look at five possible landing spots for the young running back ahead of the NFL's Nov. 4 trade deadline.\n\n        \n            \n                Alvin Kamara to Chiefs? New WR for Giants' Jaxson Dart? 10 NFL trades that should happen before 2025 deadline\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    Kansas City ChiefsThe Chiefs could use more juice on offense, including an upgrade at running back since quarterback Patrick Mahomes is currently Kansas City's leading rusher with 222 yards this season. Isiah Pacheco has rushed for under 55 yards in every game this season, and he's gone 12 consecutive games without a rushing touchdown. He's second on the team in rushing with 214 yards this season. New York would certainly be happy to absorb as many draft picks as it can get amid a rebuild, and the Chiefs are obviously in win-now mode. Following an encouraging 30-17 victory over the Detroit Lions on \"Sunday Night Football\" in Week 6, this is a deal that Kansas City should look to make.\n                            \n    \n                                                \n                    \n    Los Angeles ChargersThe Chargers offense is as beaten down with injuries as it gets with offensive tackle Rashawn Slater (torn patellar tendon, out for the season), offensive tackle Joe Alt (ankle), running back Omarion Hampton (ankle, on injured reserve) and wide receiver Derius Davis (knee) all wounded. Quarterback Justin Herbert could use some assistance, especially a reliable checkdown release valve out of the backfield given his ragged offensive line.\nHall could aid Herbert and the Chargers both in the ground game and through the air. Hall's 150 catches and 1,224 yards receiving since 2023 are both the second most in the entire NFL among running backs in that span while his seven receiving touchdowns in that time are tied for the fifth most at the position with Saquon Barkley. Los Angeles needs to inquire about Hall, especially since Hampton is on a rookie deal. Plus, he could be a nice mentor for their first-round rookie back.\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersThe Pittsburgh Steelers are all in on the 2025 season after signing 41-year-old quarterback Aaron Rodgers, signing 34-year-old cornerback Darius Slay, trading for soon-to-be 31-year-old cornerback Jalen Ramsey and trading for 30-year-old tight end Jonnu Smith. This is a team in win-now mode, and that approach is working for Pittsburgh thus far with the Steelers out to a 4-1 start and in first place in the AFC North. \nHowever, the Steelers currently have the fourth-worst run game in football, averaging just 84.0 yards rushing per game through six weeks. That's surprising considering Pittsburgh offensive coordinator Arthur Smith can typically scheme up a capable run game no matter who is in the backfield. Perhaps he and the Steelers are missing the between-the-tackles consistency Najee Harris provided them the prior four seasons when he went for over 1,000 yards each year from 2021 to 2024. Hall could complement the speedier Jaylen Warren to beef up the Pittsburgh rushing attack. Plus, the Steelers also have an extra third-round pick for 2026 thanks to trading wide receiver George Pickens to the Dallas Cowboys in the offseason. Not necessarily saying a third-round pick is the right price for a rental running back, but the Jets would likely be interested in that offer.\n                            \n    \n                                                \n                    \n    Arizona CardinalsThe Arizona Cardinals are off to a tough 2-4 start to the 2025 season, but their record is somewhat deceiving. All six of their games have been decided by seven points or fewer this season: they won their first two and are currently on a four-game losing streak. Pro Bowl starting running back James Conner suffered a season-ending ankle injury and 2024 third-round pick Trey Benson is now on injured reserve with a knee injury. \nThe Cardinals don't have much time to right the ship. If they want to get their run game back on track and potentially give Hall an extended tryout to be a part of their future plans, the trade makes sense given he is only 24 years old. \n                            \n    \n                                                \n                    \n    Houston TexansThe Houston Texans are 2-3 this season, but it's not their defense's fault. Coach DeMeco Ryans' unit is the NFL's No. 1 scoring defense, allowing just 12.2 points per game. That's the fewest points per game allowed by a team with a losing record through five games in the Super Bowl era (since 1966), per CBS Sports Research. On the other hand, Houston's offense is averaging just 21.6 points per game, 22nd in the league this season. They've been league average on the ground, averaging 116.2 rushing yards per game this year. Their offense sorely lacks juice with just 31 explosive plays this season, tied for the fifth-fewest in the NFL, per TruMedia. The Texans' nine explosive runs are tied for the seventh-fewest in the league in 2025. Quarterback C.J. Stroud is still on his rookie deal, and with Joe Mixon out and Nick Chubb not looking the same after multiple, serious knee injuries throughout his career, Houston should pursue Hall in an attempt to salvage its season. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Breece Hall landing spots: Where talented Jets RB could be dealt before NFL trade deadline - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/03/8ce2607b-8c04-437a-b735-04e1d73ef3ea/thumbnail/1200x675/63063490e2f4cc1d4152c345a551a13e/breece-hall-jets-cbs.jpg"
      ],
      "datePublished": "2025-10-15T20:04:52.000Z",
      "dateModified": "2025-10-15T20:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cubs, Blue Jays lead the way among 2025 MLB Gold Glove Award finalists - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/cubs-blue-jays-lead-the-way-among-2025-mlb-gold-glove-award-finalists/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/86579ceb-b2a8-46ad-8f16-c2760f78c62b/thumbnail/1200x675/a4ca9c58807607d80f38fb3349971eda/pca-getty.png",
    "tag": "Sports",
    "date": "2025-10-15T19:07:49.000Z",
    "description": "\n\n\n    \n                                    Winners will be announced on Nov. 2\n        \n                                                \n            ",
    "body": "\n\n\n    \n                                    Winners will be announced on Nov. 2\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 15, 2025\n                            \n                    at\n    3:07 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The finalists for this year's Gold Glove Awards were announced by Rawlings on Wednesday morning. The Chicago Cubs and Toronto Blue Jays led their respective leagues and tied for the overall majors lead with six finalists apiece.The Gold Glove Awards are determined, by and large, through voting conducted among MLB managers and coaches. There's also an aggregate statistical input that weighs defensive metrics \"derived from batted ball location-based data and those collected from play-by-play accounts.\" Said statistical index accounts for just 25% of the process, however.Here are the American League finalists, listed alphabetically by position.American LeagueCatcherDillon Dingler, Detroit TigersAlejandro Kirk, Toronto Blue JaysCarlos Narváez, Boston Red SoxFirst baseTy France, Minnesota Twins and Toronto Blue JaysVladimir Guerrero Jr., Toronto Blue JaysCarlos Santana, Cleveland GuardiansSecond baseAndrés Giménez, Toronto Blue JaysLuis Rengifo, Los Angeles AngelsMarcus Semien, Texas RangersThird baseErnie Clement, Toronto Blue JaysMaikel Garcia, Kansas City RoyalsJosé Ramírez, Cleveland GuardiansShortstopCorey Seager, Texas RangersTaylor Walls, Tampa Bay RaysBobby Witt Jr., Kansas City RoyalsLeft fieldSteven Kwan, Cleveland GuardiansWyatt Langford, Texas RangersTyler Soderstrom, AthleticsCenter fieldKyle Isbel, Kansas City RoyalsCeddanne Rafaela, Boston Red SoxJulio Rodríguez, Seattle MarinersRight fieldWilyer Abreu, Boston Red SoxAdolis García, Texas RangersCam Smith, Houston AstrosUtilityErnie Clement, Toronto Blue JaysMauricio Dubón, Houston AstrosDaniel Schneemann, Cleveland GuardiansPitcherJacob deGrom, Texas RangersMax Fried, New York YankeesLuis Severino, AthleticsAnd here are the National League finalists.National LeagueCatcherPatrick Bailey, San Francisco GiantsCarson Kelly, Chicago CubsLuis Torrens, New York MetsFirst baseBryce Harper, Philadelphia PhilliesMatt Olson, Atlanta BravesSpencer Steer, Cincinnati RedsSecond baseXavier Edwards, Miami MarlinsNico Hoerner, Chicago CubsBrice Turang, Milwaukee BrewersThird baseKe'Bryan Hayes, Pittsburgh Pirates and Cincinnati RedsRyan McMahon, Colorado Rockies and New York YankeesMatt Shaw, Chicago CubsShortstopNick Allen, Atlanta BravesMookie Betts, Los Angeles DodgersMasyn Winn, St. Louis CardinalsLeft fieldIan Happ, Chicago CubsTommy Pham, Pittsburgh PiratesKyle Stowers, Miami MarlinsCenter fieldPete Crow-Armstrong, Chicago CubsVictor Scott II, St. Louis CardinalsJacob Young, Washington NationalsRight fieldCorbin Carroll, Arizona DiamondbacksSal Frelick, Milwaukee BrewersFernando Tatis Jr., San Diego PadresUtilityMiguel Rojas, Los Angeles DodgersJavier Sanoja, Miami MarlinsJared Triolo, Pittsburgh PiratesPitcher\nMatthew Boyd, Chicago CubsDavid Peterson, New York MetsLogan Webb, San Francisco GiantsThe winners will be revealed on Nov. 2.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cubs, Blue Jays lead the way among 2025 MLB Gold Glove Award finalists - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/86579ceb-b2a8-46ad-8f16-c2760f78c62b/thumbnail/1200x675/a4ca9c58807607d80f38fb3349971eda/pca-getty.png"
      ],
      "datePublished": "2025-10-15T19:07:49.000Z",
      "dateModified": "2025-10-15T19:07:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers vs. Bengals odds, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-steelers-prediction-odds-time-thursday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/33eac641-235a-45e4-aa58-61968dd6d08c/thumbnail/1200x675/4f2a22813b0d38dd60953928d125c4a5/jamarr-chase-cincinnati-bengals-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-15T21:06:46.000Z",
    "description": "\n        An old-school AFC North rivalry kicks off NFL Week 7 with the Pittsburgh Steelers visiting the Cincinnati Bengals on 'Thursday Night Football",
    "body": "\n        An old-school AFC North rivalry kicks off NFL Week 7 with the Pittsburgh Steelers visiting the Cincinnati Bengals on 'Thursday Night Football.' Pittsburgh (4-1) has won three straight, including a 23-9 victory over Cleveland on Sunday, and the Steelers are 2-0 on the road this season. Cincinnati (2-4) has lost four in a row since losing Joe Burrow to injury, and the Bengals suffered a 27-18 loss to Green Bay in Week 6. These teams split their two matchups last season, with the road team winning each game. Cincinnati tight end Mike Gesicki (pectoral) and defensive end Trey Hendrickson (hip) were among the players who did not practice Tuesday.Kickoff is at 8:15 p.m. ET from Paycor Stadium in Cincinnati, and Pittsburgh has won each of its last three trips to Cincy. The latest Bengals vs. Steelers  odds have Pittsburgh as the 5.5-point favorite. The over/under for total points is 44.5. Before making any Steelers vs. Bengals picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 42-25 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Now, the model has zeroed in on Cincinnati vs. Pittsburgh. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Steelers vs. Bengals:Bengals vs. Steelers       spreadPittsburgh -5.5 at DraftKings SportsbookBengals vs. Steelers     over/under44.5 pointsBengals vs. Steelers           money line Pittsburgh -254, Cincinnati +206Bengals vs. Steelers          picksSee picks at SportsLineBengals vs. Steelers   streaming Amazon PrimeWhy the Steelers can coverPittsburgh has found its groove, not only winning three straight games but also covering in all three after beginning the year 0-2 against the spread (ATS). Aaron Rodgers' 105.4 passer rating is the sixth-highest of his career, and of the five years in which he had a better rating, he won NFL MVP in four of them. Rodgers also has the third-highest completion percentage and touchdown rate of his career, while his pairing with DK Metcalf has hit its stride. The former Seahawk has touchdown receptions in four straight games, as he's just one touchdown catch away from matching his total from last season (five).The Steelers' +7 turnover differential is the second-best in the league, and even if they don't notch a takeaway, the defense can still produce elite performances. That's what occurred on Sunday as Pittsburgh's nine points allowed to Cleveland were the fewest the Steelers have given up all year. Another dominant defensive effort can be expected on Thursday versus a Cincinnati team which ranks in the bottom four in the key stats of points scored, yards gained, rushing offense and passing offense. See which team to back at SportsLine. Why the Bengals can coverCincinnati is coming off a road loss to Green Bay, but there were some promising signs for the Bengals. One is that the team covered, after losing three straight ATS, and another was the performance of Joe Flacco, just days after being acquired by the team. Flacco provided a spark for the offense as he had two touchdown passes and no turnovers, compared to Jake Browning, who failed to have more touchdowns than turnovers in any of his four games. Ja'Marr Chase had a 10-94-1 stat line as his 12th career game with 10-plus catches and a touchdown are now tied for fourth-most in NFL history.Cincy is a perfect 4 for 4 in red-zone scoring over their last two games, and it ranks second in the NFL in red-zone conversion percentage this season. That could be a bad omen for Pittsburgh, as its defense isn't quite on par with prior seasons. The Steelers are 26th in total defense, 27th in passing defense and haven't experienced much recent success in flustering Flacco. The 40-year-old has played turnover-free ball versus the Steelers over his last three games versus them. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code to get $300 in bonus bets after placing a $5 wager:How to make Steelers vs. Bengals picksFor the NFL Week 7 Thursday Night Football game of Bengals vs. Steelers, the model is leaning Over the total, projecting 46 total points. It also says one side of the spread hits nearly 60% of the time. See what it is at SportsLine.Who wins Steelers vs. Bengals, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the Bengals vs. Steelers spread you need to jump, all from the model that is 42-25 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers vs. Bengals odds, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/33eac641-235a-45e4-aa58-61968dd6d08c/thumbnail/1200x675/4f2a22813b0d38dd60953928d125c4a5/jamarr-chase-cincinnati-bengals-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-15T21:06:46.000Z",
      "dateModified": "2025-10-15T21:06:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy basketball rankings, picks 2025: Top sleepers, breakouts, busts - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-rankings-2025-nba-breakouts-busts-sleepers-picks-adp/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/3ce16f53-c534-47fd-a9c7-6defc2f8d77a/thumbnail/1200x675/1f7032fd493299d73602f03b945c4227/kevin-porter-jr-milwaukee-bucks-getty-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T19:02:01.000Z",
    "description": "\nThe latest Fantasy basketball ADP listing is solidifying as the 2025-26 NBA season is about to tip off. Action begins on Tuesday, Oct. 21 with a pair",
    "body": "\nThe latest Fantasy basketball ADP listing is solidifying as the 2025-26 NBA season is about to tip off. Action begins on Tuesday, Oct. 21 with a pair of games when the Rockets battle the defending champion Thunder, and the Warriors meet the Lakers. Topping the 2025 Fantasy basketball ADP listing are top consensus picks in Nikola Jokic, Shai Gilgeous-Alexander and Victor Wembanyama.Can you trust those Fantasy basketball picks at the top of drafts, and which Fantasy basketball sleepers, breakouts and busts should you target or avoid later in 2025-26 Fantasy basketball drafts?Before making any 2025-26 Fantasy basketball picks, be sure to check out the 2025 Fantasy basketball rankings and cheat sheets from the proven computer model at SportsLine.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. SportsLine's proven model simulates each season 10,0000 times. This model is powered by the same people who powered projections for all three major Fantasy sites. These cheat sheets and rankings, available for leagues on many major sites, are updated multiple times every day. Last year the model called a breakout season for Stephon Castle, predicting that he would finish 25 spots ahead of consensus ADP at his position. The result: Castle won NBA Rookie of the year honors after averaging 14.7 points, 4.1 assists and 3.7 rebounds per game and finished as the No. 51 guard in average Fantasy points per game. The model also nailed James Harden as a sleeper last year before he put together his first All-Star season in three years and called Paolo Banchero's and Victor Wembanyama's breakout seasons before they went on to win NBA Rookie of the Year honors as well.Now, SportsLine has simulated the entire NBA season 10,000 times and released its latest Fantasy basketball rankings 2025-26, along with plenty of sleepers, breakouts and busts. Head to SportsLine now to see these 2025-26 Fantasy basketball rankings.   Top 2025 Fantasy basketball sleepers  One of the top 2025 Fantasy basketball sleepers the model is predicting: Milwaukee Bucks guard Kevin Porter Jr., who is barely being picked in the top 100 picks in many drafts. Despite struggling from deep through the first 45 games of last season with the Los Angeles Clippers, he turned things around in a big way once he was acquired by the Bucks. He finished the regular season connecting on 40.8% of his 3-pointers in his final 30 games with Milwaukee, averaging 11.7 points per game.In the postseason, he continued to light it up from deep, hitting on 46.7% of his 3-pointers, averaging 11.2 points in five games. Porter is expected to be the Bucks' starting point guard, and is just one of two players on the 2025-26 roster to average 2.9 assists or more. For his career, Porter has averaged 4.6 assists per game. See more Fantasy basketball sleepers 2025 here. Top 2025 Fantasy basketball breakouts  One of the 2025 Fantasy basketball breakouts the model has identified: Jazz point guard Isaiah Collier, who has an ADP of 137. The No. 1 ranked prospect in the Class of 2023, Collier starred at USC for one season before being the 29th overall pick by Utah in 2024. He began as a backup but then wrestled the starting job away from Keyonte George, who was an All-Rookie selection the year prior. Collier really hit his stride towards the end of the season and averaged 15.9 points and 7.1 assists over his final seven games of his rookie year.Already one of the league's youngest teams, Utah then jettisoned vets Jordan Clarkson, Collin Sexton and John Collins in the offseason as it has fully embraced a youth movement. Thus, the 21-year-old Collier should have no shortage of opportunities, and he plays in an offense conducive for lots of stats. The Jazz ranked fifth in pace last season as they want to utilize those young legs to their advantage. The model slots Collier ahead of Klay Thompson and Jalen Suggs, despite those two being drafted earlier on average. Identify other Fantasy basketball breakouts 2025 here. Top 2025 Fantasy basketball busts As for players to avoid, the model lists Pelicans guard Jordan Poole as a Fantasy basketball bust. Poole was one of the major pieces in a trade between the Wizards and Pelicans in the offseason. The 26-year-old now goes to New Orleans, where he'll have to be a bit more of a complimentary player to Zion Williamson. New Orleans also brings in two lottery picks -- Derik Queen and Jeremiah Fears -- so Poole could lose some of his scoring opportunities as the season progresses. Poole is being picked in the seventh round, according to the latest ADP, but SportsLine's model has players such as Jrue Holiday and Immanuel Quickly, both of whom are being picked later, as better values. Avoid these 2025 Fantasy basketball busts as well. How to find proven 2025-26 Fantasy basketball rankings SportsLine is also extremely high on a surprising forward you aren't even thinking about being taken in the early rounds of 2025 Fantasy basketball drafts. This player is a top-3 Fantasy option at his position and is ranked ahead of stars like Kevin Durant and Paolo Banchero. You can only see who it is, and the 2025 Fantasy basketball rankings for every player, at SportsLine.So which 2025-26 Fantasy basketball sleepers, breakouts and busts should you target and fade, and which forward shocks the NBA as a top-3 player in positional rankings? Visit SportsLine now to get 2025-26 Fantasy basketball cheat sheets for every single position, all from the model that's nailed its Fantasy basketball picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy basketball rankings, picks 2025: Top sleepers, breakouts, busts - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/3ce16f53-c534-47fd-a9c7-6defc2f8d77a/thumbnail/1200x675/1f7032fd493299d73602f03b945c4227/kevin-porter-jr-milwaukee-bucks-getty-images.jpg"
      ],
      "datePublished": "2025-10-15T19:02:01.000Z",
      "dateModified": "2025-10-15T19:02:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, 3 months of NBA League Pass free by picking Mariners - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-draftkings-promo-code-to-get-300-bonus-bets-3-months-of-nba-league-pass-free-by-picking-mariners/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-10-15T21:43:46.000Z",
    "description": "\n        The Seattle Mariners return home with a commanding 2-0 series lead in the American League Championship Series, and they'll look to get closer",
    "body": "\n        The Seattle Mariners return home with a commanding 2-0 series lead in the American League Championship Series, and they'll look to get closer to their first-ever World Series appearance with another win on Wednesday. Game 3 of Blue Jays vs. Mariners is set to get underway from T-Mobile Park at 8:08 p.m. ET. The SportsLine model projects the Mariners to record the win at home, targeting Seattle (-137) as one of its Wednesday best bets at DraftKings. Mariners vs. Blue Jays is the only MLB playoff game on the Wednesday sports calendar, but there are multiple sports in action to use the latest DraftKings promo code, which gives new users $300 in bonus bets and 3 months of NBA League Pass free. The model also likes Jacksonville State to defeat Delaware and Sam Houston to knock off UTEP in Conference USA college football action in its Wednesday best bets at DraftKings. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. It also enters the ALCS and NLCS rounds of the 2025 MLB playoffs with a profitable 35-29 on top-rated MLB money-line picks this season. Anybody following its college football betting picks or MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Wednesday best bets at DraftKings SportsbookMariners (-137) to defeat the Blue JaysJacksonville State (+124) to defeat DelawareSam Houston (+114) to defeat UTEPCombining the model's three picks into a Wednesday parlay at DraftKings would result in a payout of +729 (risk $100 to win $729). Bet it at DraftKings here:Mariners (-137) to defeat the Blue JaysSeattle had four different players hit home runs over its two victories in Toronto, while the Blue Jays only had four total runs over that span. The Mariners closed the regular season 17-4, including winning 17 of 18 games before dropping their final three contests to the Dodgers, and continue their red-hot finish into the postseason. After dropping Game 1 of the ALDS in 11 innings, Seattle has won five of its last six games entering Wednesday. Mariners starter George Kirby has a 2.30 ERA over his last five starts, including a 2.70 ERA in two postseason contests. The model projects the Mariners to win in 61% of simulations to take a commanding 3-0 lead in the ALCS. Back the Mariners at DraftKings, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Jacksonville State (+124) to defeat DelawareThe Gamecocks turned to freshman quarterback Caden Creel for his first start last week, and he rewarded the coaches by rushing for 132 yards and a touchdown on 24 carries while completing 13 of 17 passes for 129 yards in a 29-27 road victory over Sam Houston. Creel also helped get the best rushing performance of the season from Cam Cook, a junior transfer from TCU who now leads the nation at 832 rushing yards. Cook ran for 218 yards and two touchdowns on 7.0 yards per rush last week. Jacksonville State is third in the nation on rush attempts per game (49.6), and despite teams thinking they know what type of play is coming, the Gamecocks are 14th in the nation in yards per rush (5.4). The model projects this rushing attack to be too much for Delaware, which is allowing 4.4 yards per rush (74th in the nation), and the Gamecocks cover the spread in 70% of simulations. Back Jacksonville State at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Sam Houston (+114) to defeat UTEPThe Bearkats are coming off their best game of their 0-6 start, keeping pace with defending Conference USA champion Jacksonville State in a 29-27 loss last week on a 52-yard field goal as time expired. Hunter Watson completed 12 of 19 passes for 136 yards and three touchdowns while rushing for 52 yards. Alton McCaskill added 87 yards on 14 carries (6.2 yards per rush) and Chris Reed had two touchdown receptions. The model projects Sam Houston to take some of those game positives into a matchup against a 1-5 UTEP team. Sam Houston is home, where the Bearkats have performed better this year, and the model projects Sam Houston to win in 64% of simulations against a UTEP team with the 129th scoring offense (14 ppg) in college football this season. Back Sam Houston at DraftKings, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Want more college football picks and MLB picks?You've seen the model's Wednesday best bets. Now, get against the spread, total and money-line picks all games on Wednesday, including college football, MLB and NHL, as well as early lines for the Week 7 NFL schedule, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, 3 months of NBA League Pass free by picking Mariners - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-10-15T21:43:46.000Z",
      "dateModified": "2025-10-15T21:43:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $300 bonus bets for Delaware-Jacksonville St, Sam Houston-UTEP, Blue Jays-Mariners - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-fanduel-promo-code-get-300-bonus-bets-for-delaware-jacksonville-st-sam-houston-utep-blue-jays-mariners/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-15T21:19:21.000Z",
    "description": "\n        Conference USA takes center stage with two college football matchups on Wednesday, as well as Game 3 of Toronto Blue Jays vs. Seattle Mariner",
    "body": "\n        Conference USA takes center stage with two college football matchups on Wednesday, as well as Game 3 of Toronto Blue Jays vs. Seattle Mariners in the 2025 MLB Playoffs. Sports fans have the opportunity to take advantage of the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. First pitch for Blue Jays vs. Mariners is at 8:08 p.m. ET, while Delaware vs. Jacksonville State and Sam Houston vs. UTEP both begin at 7 p.m. ET. SportsLine's model has Jacksonville State (+2.5) covering the spread in 78% of simulations against Delaware. The model's best bets also include the under on total points (47.5), which hits in 62% of the simulations in UTEP vs. Sam Houston. Meanwhile, SportsLine's model is also backing Over seven runs in Blue Jays vs. Mariners. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best Wednesday picksDelaware vs. Jacksonville State (+2.5)UTEP vs. Sam Houston: Under 47.5 total pointsBlue Jays vs. Mariners: Over 7.5 total runs Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +635 (risk $100 to win $635). Bet it at FanDuel here:Delaware vs. Jacksonville State (+2.5)The Gamecocks are a run-first offense, as they are averaging 279.5 rushing yards per game. Junior running back Cam Cook leads the nation in rushing yards (832) with seven rushing scores and 5.9 yards per rush. Jacksonville State goes into this game 1-0 ATS as the home underdog and 1-1 ATS as the home team. In the meantime, Delaware is 0-2 ATS as the favorite. SportsLine's model predicts that the Gamecocks cover the spread in 78% of simulations. Bet it at FanDuel here:UTEP vs. Sam Houston: Under 47.5 total points Both of these teams have had problems moving the ball consistently this season. UTEP logs 18.7 points per game, while Sam Houston puts up 17.3 points per contest. The under has hit in four of the six games this season for UTEP. As for the Bearkats, they have scored more than 21 points twice this season. SportsLine's model predicts the under cashes in 62% of simulations. Bet it at FanDuel now:Blue Jays vs. Mariners: Over 7 total runsThe Blue Jays were ranked third in the MLB in team runs per game this year at 4.98 runs. Seattle came in at the 10th spot (4.72). This postseason, the over hit in four of the six outings for Toronto. On the other side, the Mariners had the over cash in three of the last five games. SportsLine's model projects these teams to combine for 8.2 total runs, with the over hitting in 54% of simulations. Bet it at FanDuel here:Want more CFB picks?You've seen the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every CFB game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets for Delaware-Jacksonville St, Sam Houston-UTEP, Blue Jays-Mariners - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-15T21:19:21.000Z",
      "dateModified": "2025-10-15T21:19:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]