[
  {
    "title": "Penn State football coaching search 2025: Candidates, hot board, top names to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-football-coaching-search-2025-new-candidates-hot-board-james-franklin-replacement-names-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/d0ad0093-fa8d-4af6-a421-7eed4dbb1ddc/thumbnail/1200x675/4e76b094968ec26a674134d0ef349cc6/beaver-stadium-penn-state-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:54:55.000Z",
    "description": "\n        It's been one of the busiest coaching carousels in recent memory, and as the calendar turns to December, Penn State is the top program with a",
    "body": "\n        It's been one of the busiest coaching carousels in recent memory, and as the calendar turns to December, Penn State is the top program with an opening remaining. The Nittany Lions fired James Franklin back on Oct. 12 with an eye on getting ahead of the carousel, but they'll be making a hire later than programs like LSU, Florida, Auburn, Arkansas and Virginia Tech, where Franklin ultimately landed. There have been several public rejections with names like Matt Rhule, Curt Cignetti and Kalani Sitake all agreeing to new deals with their respective schools in the midst of being rumored Penn State candidates. Where do the Nittany Lions turn now? If you love the Nittany Lions, or just want to know who will be calling the shots for Penn State in the future, be sure to see what the proven team of experts are saying at Lions247.Lions247 with Fight on State brings fans trusted coverage from a dedicated team of insiders. With 20+ years and a staff that includes Mark Brennan, Tyler Donohue, Tyler Calvaruso and Daniel Gallen, the site delivers daily updates, recruiting scoop, and team news. Lions247 with Fight on State is the market leader in coverage of Penn State athletics! Join the conversation and experience the power of the Lions247 with the Fight on State community. Want even more? Sign up for a VIP membership now and unlock all the insider content and features today.And right now, Lions247 is offering 75% off annual subscriptions*, so now is the time to sign up. The team at Lions247 is on their 14th version of the hot board, and and there are some surprising names on the list. Head to Lions247 now to see them all.\nTop Penn State football coach candidatesOne name the staff has identified as a potential target on the Penn State football coaching hot board is Louisville head coach Jeff Brohm. The former Louisville and NFL quarterback returned to his alma mater as the head coach in 2023 after previous stints as the head coach at Western Kentucky and Purdue.In total, Brohm is 93-56 as a head coach, though his ACC record at Louisville has gotten worse each of the past three seasons. The Cardinals looked like playoff contenders after a 7-1 start this season, but they lost three straight after that. They did bounce back with a dominant 41-0 win over rival Kentucky last week, however. \"Across his career, Brohm carries four victories versus top-five opponents,\" Donohue wrote. \"That success includes three top-five wins at Purdue over No. 2 Ohio State (2018), No. 2 Iowa (2021) and No. 3 Michigan State (2021). Brohm produced a 36-34 record in six seasons with the Boilermakers, reaching eight regular-season wins in each of his last two seasons with a 2022 Big Ten West title. Neither his predecessor nor successor at Purdue surpassed four wins.\" See more candidates at Lions247.\nHow to get insider Penn State coaching search updates The rest of the list includes several other exciting possibilities, including multiple coaches who currently have their team in the College Football Playoff mix. You can only see who it is by joining Lions247.Who are the top names in the Penn State football coaching search, and which playoff-caliber coaches could the Nittany Lions take a big swing on? Go to Lions247 to see their Penn State coaching hot board and more, all from a team of reporters with extensive experience covering the Nittany Lions, and find out. And remember, Lions247 is offering 75% off an annual VIP membership, so subscribe now before it's too late.\n*Terms: This offer is only available for new members who sign up for an annual subscription to Lions247. After the first year, subscription will re-bill on an annual basis at the regular rate. 247Sports.com reserves the right to alter or cancel this promotion at any time. Please write support@247sports.com with any questions you may have.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State football coaching search 2025: Candidates, hot board, top names to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/d0ad0093-fa8d-4af6-a421-7eed4dbb1ddc/thumbnail/1200x675/4e76b094968ec26a674134d0ef349cc6/beaver-stadium-penn-state-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T15:54:55.000Z",
      "dateModified": "2025-12-03T15:54:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL odds, lines, spreads: Week 14 predictions, best picks today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-14-nfl-odds-lines-spreads-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/a7000084-cb70-42f6-bc56-700809ea4b05/thumbnail/1200x675/da958a7638d3bf44ed096c7bc1a5b93e/bo-nix-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:23:05.000Z",
    "description": "\n        With the four weekday games from last week's holiday slate, your Week 14 NFL predictions should account for the rest advantages that teams ha",
    "body": "\n        With the four weekday games from last week's holiday slate, your Week 14 NFL predictions should account for the rest advantages that teams have. Games like Bengals vs. Bills (-5.5), Ravens vs. Steelers (+6), Chiefs vs. Texans (+3.5) and Eagles vs. Chargers (+3) all feature teams with multiple days of rest over their opponent. While sportsbooks factored this in when setting the Week 14 NFL odds, having the edge in rest hasn't always been beneficial in regard to NFL spread success. Cincinnati, for example, who played on Thanksgiving Day, is 0-6 ATS over its last six games when it has the rest advantage.Elsewhere, Seahawks vs. Falcons (+7) pits one team, in Seattle, that has the league's best spread record (9-3) versus an Atlanta squad that's comfortable in the role of an underdog. The Falcons have been dogs six times this year, only losing ATS once. When there's reason to back both teams with Week 14 NFL bets, digging deep into the trends, stats and analysis can it more apparent which side to choose. All of the updated Week 14 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 14 NFL picks now. LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can also target the DraftKings promo code, which offers $200 in bonus bets if your initial $5 bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 14 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top Week 14 NFL predictionsWe can tell you one of the model's strongest Week 14 NFL picks is that the Jets (+2.5, 40.5) cover at home versus Miami in a Sunday 1 p.m. ET kickoff. Being at home is important to note for the Jets as that means the Dolphins have to leave sunny South Beach for a December game in the Northeast. Tua Tagovailoa is 0-7 all-time in his career when the temperature is 40 degrees or below, and forecasts are calling for a high of 40 degrees come Sunday. Additionally, the Jets are 4-1 ATS over their last five games, while Miami has scored just one touchdown in each of its last two games. The model has New York prevailing versus the spread almost 60% of the time. See which other teams to pick here.\nAnother one of its Week 14 NFL predictions: the Broncos (-7.5, 40.5) cover versus the Raiders in nearly 60% of simulations. Denver's nine-game win streak is its longest in 13 years, while the Raiders' six-game losing streak is the third-longest active one in the NFL. Speaking of streaks, the Broncos have won each of the last three meetings, while Vegas has also lost versus the spread in each of its last three games this season. The Raiders fired OC Chip Kelly prior to Sunday's loss to the Chargers, and the Vegas went out and produced just 156 total yards, which is the team's second fewest in any game in eight years. With Las Vegas now facing Denver's elite defense, the Broncos win by double-digits, per the model, which also says the Under hits in well over 50% of simulations. See which other teams to pick here.\nHow to make Week 14 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 14 NFL schedule and just revealed seven teams projected to win by at least a touchdown, potentially giving you a huge payday. You can only get every pick for every game at SportsLine.So what Week 14 NFL picks can you make with confidence, and which seven teams should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 14 NFL betting odds, lines, live spreads, scoresGet Week 14 NFL picks at SportsLineGame SpreadTotalPicksCowboys at Lions (Thursday)DET -354.5SEE  PICKS HERESeahawks at FalconsSEA -744.5SEE  PICKS HERESteelers at RavensBAL -642.5SEE  PICKS HERETitans at BrownsCLE -4.533.5SEE  PICKS HEREColts at JaguarsIND -1.547.5SEE  PICKS HERECommanders at VikingsMIN -1.542SEE  PICKS HEREDolphins at JetsMIA -2.540.5SEE  PICKS HERESaints at BuccaneersTB -8.542.5SEE  PICKS HEREBengals at BillsBUF -5.553.5SEE  PICKS HEREBroncos at RaidersDEN -7.540.5SEE  PICKS HEREBears at PackersGB -6.544.5SEE  PICKS HERERams at CardinalsLAR -8.548.5SEE  PICKS HERETexans at ChiefsKC -3.541.5SEE  PICKS HEREEagles at Chargers (Monday)PHI -340.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL odds, lines, spreads: Week 14 predictions, best picks today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/a7000084-cb70-42f6-bc56-700809ea4b05/thumbnail/1200x675/da958a7638d3bf44ed096c7bc1a5b93e/bo-nix-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T15:23:05.000Z",
      "dateModified": "2025-12-03T15:23:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 14 NFL picks, score predictions, best bets from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-14-picks-score-predictions-best-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/28402d0b-3aa9-412b-aa11-defc9cb90939/thumbnail/1200x675/cf88a92e92b2e4a21f9c2914f66dedbe/shedeur-sanders-cleveland-browns-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T14:39:00.000Z",
    "description": "\n        The Week 14 NFL schedule features 14 games, including a number of key divisional matchups. In an important NFC North battle, first place will",
    "body": "\n        The Week 14 NFL schedule features 14 games, including a number of key divisional matchups. In an important NFC North battle, first place will be on the line when the Chicago Bears visit the Green Bay Packers. The Packers are favored by 6.5 points as Jordan Love of the Packers takes on Caleb Williams and the Chicago Bears.Another key divisional battle pits the Pittsburgh Steelers (6-6) against the Baltimore Ravens (6-6) with first place on the line. Baltimore has won each of the last two meetings and enters as the 6-point favorite. The Ravens earned a 28-14 win over the Steelers in last year's playoff meeting. Sunday's largest spreads are Saints vs. Buccaneers (-8.5) and Rams (-8.5) vs. Cardinals.Before making any Week 14 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 14 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 14 games. You can only see the AI predictions for the Week 14 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 14 NFL AI picksAfter analyzing every game in Week 14, the AI says the Browns (-4.5), who have split their last two games, cover comfortably against the Titans. Quarterback Shedeur Sanders is expected to make another start. in three games, he has completed 31 of 61 passes (50.8%) for 405 yards and two touchdowns with two interceptions. He has rushed five times for 21 yards.Powering the Cleveland rushing attack is rookie running back Quinshon Judkins. In 11 games, he has carried 196 rushes for 758 yards (3.9 average) and seven touchdowns. He has four explosive plays of 20 yards or more, including a long of 46 yards. SportsLine AI rates the Browns as an A+ spread pick and also predicts a 24-15 win on average. See its other Week 14 football predictions and football picks at SportsLine, and bet the Browns here:How to make Week 14 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A+ picks for Week 14. You need to see the AI's NFL picks before making any Week 14 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 14 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 14 NFL picks, score predictions, best bets from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/28402d0b-3aa9-412b-aa11-defc9cb90939/thumbnail/1200x675/cf88a92e92b2e4a21f9c2914f66dedbe/shedeur-sanders-cleveland-browns-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T14:39:00.000Z",
      "dateModified": "2025-12-03T14:39:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-cowboys-lions-daily-fantasy-picks-lineup-advice-thursday-night-football-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/ccbcf400-5f22-4c9d-8cc4-8b97808dfa52/thumbnail/1200x675/4625d84af51769649fc370bc43a0289e/ceedee-lamb-dallas-cowboys-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T14:46:35.000Z",
    "description": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys ",
    "body": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys vs. Detroit Lions matchup at 8:15 p.m. ET. Detroit is a 3-point home favorite, while the over/under is 54.5, the highest on the board in Week 14. Dak Prescott, Jared Goff, Jahmyr Gibbs and CeeDee Lamb are names known to casual football fans and names very familiar with being included in NFL DFS lineups. However, Detroit could be shorthanded with Sam LaPorta on the IR and Amon-Ra St. Brown (ankle) missing practice on Monday and Tuesday. Wideout Isaac TeSlaa played 92% of snaps in Detroit's last game and scored his third touchdown of the year. Daily Fantasy football lineups need economical options like TeSlaa to balance out the highly-priced stars. The Cowboys also have NFL daily Fantasy sleepers who could provide a great return on investment on TNF. Before making any Lions vs. Cowboys NFL DFS picks for 'Thursday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Thursday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Cowboys vs. LionsOne of McClure's top NFL DFS picks for 'Thursday Night Football' is Cowboys receiver CeeDee Lamb. The wideout is coming off a 7-112-1 stat line on Thanksgiving versus Kansas City, with the 112 yards matching a season high. Lamb is averaging 82.7 receiving yards per game in 2025, which ranks sixth-best in the NFL, and his career high of 227 yards came versus Detroit in 2023. This year's Lions team has allowed the third-most touchdowns to opposing wideouts, and now it will be without starting cornerback, Terrion Arnold (shoulder), who was placed on injured reserve on Monday. See who else to roster at SportsLine.McClure is also rostering Lions running back Jahmyr Gibbs, who has been a one-man show over the last half-dozen games. Gibbs is averaging 152.3 scrimmage yards with eight total touchdowns over his last six contests, compared to 83.7 yards and five scores over his first six games. The two-time Pro Bowler is on pace for career highs in rushing yards, rushing average, receptions and receiving yards, with his 2025 production coming versus defenses much more stout than what Dallas possesses. The Cowboys have allowed the second-most points and the fourth-most yards this season, as Gibbs should produce both in the redzone and in between the 20s. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set Lions vs. Cowboys NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Thursday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Thursday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/ccbcf400-5f22-4c9d-8cc4-8b97808dfa52/thumbnail/1200x675/4625d84af51769649fc370bc43a0289e/ceedee-lamb-dallas-cowboys-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T14:46:35.000Z",
      "dateModified": "2025-12-03T14:46:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football odds, picks, lines, spread: 2025 Championship Week predictions, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-odds-lines-spreads-picks-predictions-best-bets-championship-week-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/a29b8c0b-8c8e-431e-8aa9-4c69fb2559a4/thumbnail/1200x675/93185655bcd4e4f4e398821037e7086a/roman-hamby-francisco-mendoza-indiana-hoosiers.jpg",
    "tag": "Sports",
    "date": "2025-12-03T14:07:00.000Z",
    "description": "\n        From one glance at the Championship Week college football odds, there is a clear outlier amongst the Power 4 title games. That's over in the ",
    "body": "\n        From one glance at the Championship Week college football odds, there is a clear outlier amongst the Power 4 title games. That's over in the Big 12, which has Texas Tech favored by 13.5 points over BYU, per the latest Championship Week college football lines. Meanwhile, the other power conference championship games all have college football spreads of under 6 points. They include Georgia vs. Alabama (+2.5) in the SEC, Ohio State vs. Indiana (+4.5) in the Big Ten and Virginia vs. Duke (+3.5) in the ACC.Whether you prefer to make Championship Week college football bets on smaller lines or larger college football spreads is a matter of preference. However, having the proper college football betting advice will set you up for success during the conference championship schedule. Before locking in any Championship Week college football picks, be sure to see the latest Championship Week college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and Championship Week college football betting lines on the spread, money line, and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for Championship WeekOne of the college football picks the model is high on during Championship Week: No. 2 Indiana (+4.5, 47.5) covers against No. 1 Ohio State in over 50% of simulations Saturday at 7 p.m. ET. No team has a better point differential than IU (+401), which is 50 points greater than what Ohio State has. Indiana also has the Heisman favorite in Fernando Mendoza, who leads FBS with 32 passing touchdowns, while topping the Big Ten in total touchdowns and yards per attempt. His counterpart, Julian Sayin, has thrown picks in his last two games away from home, and the Buckeyes haven't won the turnover battle in five straight games. In addition to the Hoosiers sticking within the spread, the model also says the Under hits nearly 70% of the time in an A-rated pick. See which other picks the model likes here.\nAnother prediction: Duke (+3.5, 57.5) covers versus No. 16 Virginia in the ACC Championship Game on Saturday at 8 p.m. ET. The model projects the Blue Devils to cover almost 60% of the time. While UVA prevailed when these teams met on Nov. 8, the Cavs' offense is limping into this rematch. UVA averaged 36.4 points over its first nine games but is averaging over 13 fewer points over its last three. Meanwhile, Duke is coming off a season-high of 49 points in a victory over 8-win Wake Forest, as the Blue Devils have one of the most efficient offenses around. They rank 19th in the nation, and second in the ACC, with 34.6 ppg, and only two teams in all of FBS have thrown fewer interceptions. Virginia has as many turnovers (five) over its last three games as Duke has over its last nine games, and the turnover margin is one reason why Duke sticks within the spread. See the rest of the model's picks here.\nHow to make college football picks for Championship WeekThe model has also made the call on who wins and covers in every Championship Week matchup, and it's calling for three underdogs to outright win. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which three teams should you jump on? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.Championship Week college football oddsSee full Championship Week college football picks, odds, predictions here(odds subject to change)Friday, Dec. 5Kennesaw State vs. Jacksonville State (-2.5, 59.5)Troy vs. James Madison (-23.5, 47.5)North Texas vs. Tulane (+2.5, 66.5)UNLV vs. Boise State (-3.5, 58.5)Saturday, Dec. 6BYU vs. Texas Tech (-12.5, 49.5)Miami (OH) vs. Western Michigan (-2.5, 43.5)Georgia vs. Alabama (+2.5, 47.5)Indiana vs. Ohio State (-4.5, 47.5)Duke vs. Virginia (-3.5, 57.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football odds, picks, lines, spread: 2025 Championship Week predictions, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/a29b8c0b-8c8e-431e-8aa9-4c69fb2559a4/thumbnail/1200x675/93185655bcd4e4f4e398821037e7086a/roman-hamby-francisco-mendoza-indiana-hoosiers.jpg"
      ],
      "datePublished": "2025-12-03T14:07:00.000Z",
      "dateModified": "2025-12-03T14:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Brewers considering Freddy Peralta trade, Astros eye rotation depth - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-brewers-freddy-peralta-astros-marlins-sandy-alcantara-edward-cabrera/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4d08225-ed08-4ae7-934b-ff8828834066/thumbnail/1200x675/6b92117741520b18bf753e75023283f5/peralta-getty.png",
    "tag": "Sports",
    "date": "2025-12-03T15:54:37.000Z",
    "description": "\n        We're only a few days from the Winter Meetings and we've started to see a trickle of moves here in the MLB offseason, which means it's possib",
    "body": "\n        We're only a few days from the Winter Meetings and we've started to see a trickle of moves here in the MLB offseason, which means it's possible things start to pick up a bit. As such, the rumor mill is churning and we're going to round up the best nuggets of news and rumors here for the day, which is Wednesday, Dec. 3. Let's get to it.Brewers drawing 'significant interest' in PeraltaEarlier this offseason, reports surfaced that the Brewers were not interested in trading ace Freddy Peralta. In fact, as recently as yesterday the reporting was that the Brewers were going to keep him.Lately, though, according to The Athletic, things might be leaning in the other direction.Perhaps this was inevitable, but the interest in right-hander Freddy Peralta is so significant, the Milwaukee Brewers are now considering \"cracking the door open\" for trade discussions, according to a person briefed on their situation.Peralta is 30 years old next season and is coming off arguably the best year of his career. He was 17-6 with a 2.70 ERA (154 ERA+), 1.08 WHIP, 204 strikeouts in 176 ⅔ innings. He posted a career-high 5.5 WAR. He's set to make $8 million in 2026 before hitting free agency. If the Brewers think 2025 was the peak for Peralta and that he'll definitely walk in free agency, you can see the line of thinking to accept huge trade offers here. They previously dealt Corbin Burnes a season before free agency. Given the conflicting reports of late, it's safe to assume the situation is fluid with the Brewers listening to trade offers and maybe even considering them while leaning toward keeping Peralta until they're blown away.\nAstros looking at pitching depthThe Astros were crushed under the weight of pitching injuries over the last two years, including lengthy absences from the likes of Cristian Javier, Lance McCullers Jr., Luis Garcia, Ronel Blanco and Spencer Arrighetti. What's more, ace workhorse Framber Valdez is now a free agent. Knowing all this, it isn't surprising that the Astros are targeting depth at the Winter Meetings. They don't \"have the financial resources\" to a top free agent, per MLB.com, but they have a \"desire\" to land pitchers who are still under team control via trades. Center fielder Jake Meyers is mentioned as a possibility for the Astros to trade for said pitching. Marlins not inclined to deal Alcantara or Cabrera?People love talking about trading prospects to the Marlins in order to grab controllable players because, well, look at their history. This time around, the Marlins are apparently trying to hold and maybe even extend some of their own players, according to MLB.com.\nSpecifically, high-upside Edward Cabrera and former Cy Young winner Sandy Alcantara have seen their names bandied about in trade rumors since early last regular season, but the Marlins are repotedly not \"actively trying to trade\" either, though if that were to change, Christina De Nicola speculated that Cabrera is the more likely of the two to be dealt. Former GM Byrnes takes Rockies' GM positionFormer Diamondbacks and Padres general manager Josh Byrnes has been hired as the general manager of the Rockies, reports The Athletic. Keep in mind that there's been a shift in titles over the course of the past decade-plus and that GM isn't necessarily always the big boss in the front office. Here, Byrnes is second in command under new president of baseball operations Paul DePodesta. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Brewers considering Freddy Peralta trade, Astros eye rotation depth - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4d08225-ed08-4ae7-934b-ff8828834066/thumbnail/1200x675/6b92117741520b18bf753e75023283f5/peralta-getty.png"
      ],
      "datePublished": "2025-12-03T15:54:37.000Z",
      "dateModified": "2025-12-03T15:54:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT draw at FIFA World Cup: Best and worst possible paths - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/fifa-world-cup-draw-scenarios-usmnt-best-worst-case/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/d5286adc-cc17-4e44-92a6-cb34ae764f3f/thumbnail/1200x675/f5f0856079222a37be2fb0851b704ada/untitled-design-2025-12-03t150054-364.png",
    "tag": "Sports",
    "date": "2025-12-03T14:06:53.000Z",
    "description": "\n        As the World Cup inches closer by the week, the time will soon come when the United States men's national team will know who will accompany t",
    "body": "\n        As the World Cup inches closer by the week, the time will soon come when the United States men's national team will know who will accompany them in Group D. On Friday, Dec. 5, the World Cup Draw will take place at the Kennedy Center in Washington, D.C., revealing the path for the USMNT. They've done their part to close out 2025 on a high note as they've been unbeaten in their last five games of the year under Mauricio Pochettino, despite spending a large portion of matches without regular members of the side being available.Draw restrictionsNo group will have more than one team from the same federation in it, except UEFA, which is required to have two groups of two UEFA teams in it, due to the fact that 16 teams will be participating in the tournament. Then there's the challenge of the intercontinental playoffs, which will not be held until after the draw. For the playoff tournament teams, the confederation restrictions will be applied to all teams involved in the playoff, which would keep the host nations from drawing a team involved in the FIFA playoff tournament due to Jamaica and Suriname being involved as Concacaf teams.USMNT worst case draw The way the draw works is that the teams are divided into pots. You can check out the full pot by pot breakdown here. When looking at draws, most roads lead to a reunion between the USMNT and Ghana at the World Cup, but it's the increase of UEFA teams that can turn the draw upside down. If the USMNT are to get a team like Morocco or Japan in pot 2, it almost locks them into getting a UEFA side in pot three, as well as one of the UEFA playoff path winners (in yet another undecided part of the draw the final European teams will be decided in a playoff that ALSO has yet to be played). Scenario A:\nUSMNTMorocco (CAF)Norway (UEFA)Italy (UEFA playoff winner)Scenario B: USMNTCroatia (UEFA)Egypt (CAF)Denmark (UEFA playoff winner)Erling Haaland bearing down on the USMNT defense feels like the stuff of nightmares. While you can't bet on Italy to actually make it through the playoff unscathed, that's a team that no one will want in their groups. There's a similar issue with Denmark as their balanced midfield can give teams trouble. Croatia and Egypt are aging sides, but they're also organized, while Morocco and Norway are sides on the rise. When it comes to Morocco, they've enjoyed knocking the United States youth teams out of FIFA competitions, so why not extend things to the senior side too.USMNT best case drawThe World Cup is about facing the best talent in the world to prove yourself as a nation. But what if we saved that for the knockout stages, especially since the USMNT would now go to a newly minted round of 32 before even getting to the proper round of 16 with the tournament expanding to 48 teams.  \nUSMNTAustria (UEFA)South Africa (CAF)Jordan (AFC)Going by rankings, this is close to the weakest group that the USMNT could end up in. Drawing a team like Australia could lock them into a stronger pot 4 team and Ghana also makes pot 3 tough. This is when you see how few draws there are for a team like the USMNT, but avoid those sides and you get a group that looks like this. Not winning a group of this caliber would be a massive disappointment. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT draw at FIFA World Cup: Best and worst possible paths - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/d5286adc-cc17-4e44-92a6-cb34ae764f3f/thumbnail/1200x675/f5f0856079222a37be2fb0851b704ada/untitled-design-2025-12-03t150054-364.png"
      ],
      "datePublished": "2025-12-03T14:06:53.000Z",
      "dateModified": "2025-12-03T14:06:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joel Embiid injury: NBA fines 76ers $100,000 for report violation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/joel-embiid-injury-nba-fines-76ers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/f8acb5fa-f3b7-44a5-9b4d-b594abfbfb35/thumbnail/1200x675/b040ab7afc4186ed2d79e65d0e8747aa/joel-embiid-76ers.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:49:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA fined the 76ers $100,000 for violating the",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA fined the 76ers $100,000 for violating the league's injury reporting rules. Philadelphia initially ruled star center Joel Embiid out for a Nov. 30 contest against the Hawks, but he ended up playing in the resulting 142-134 double-overtime loss. The final line of the release -- \"The fine takes into account the 76ers' prior history of fines for violating injury reporting rules.\" -- is notable.  \nThe NBA fined Philadelphia $75,000 in February 2024 for not disclosing Embiid's nagging knee soreness on their injury report ahead of a showdown with the Denver Nuggets and Nikola Jokić that Embiid did not play in. At the time, the two were in a closely contested MVP race.A few months later, the NBA fined the 76ers $100,000 for a incident similar to this most recent one: Embiid was listed as \"Out\" for a game against the Oklahoma City Thunder, but he ended up playing.The following season, in October 2024, the NBA fined Philadelphia $100,000 for public statements from general manager Daryl Morey and coach Nick Nurse that were \"inconsistent with Joel Embiid's health status and in violation of NBA rules, including the league's Player Participation Policy.\"\nEmbiid has played in just seven of Philadelphia's 20 games this year. He missed nine consecutive contests leading up to the Hawks game in question due to \"right knee injury management.\" He missed Tuesday night's game against the Wizards -- two days after the Hawks game -- due to \"right knee injury recovery.\"Embiid played in just 19 games last year due to a left knee injury that required surgery.\nOverall this season, Embiid averages 19.4 points and 5.3 rebounds in 24.3 minutes per game. All three averages are on pace to be career lows. The 76ers are 11-9 despite injuries to Embiid, Paul George and Kelly Oubre Jr., among others.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joel Embiid injury: NBA fines 76ers $100,000 for report violation - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/f8acb5fa-f3b7-44a5-9b4d-b594abfbfb35/thumbnail/1200x675/b040ab7afc4186ed2d79e65d0e8747aa/joel-embiid-76ers.jpg"
      ],
      "datePublished": "2025-12-03T15:49:27.000Z",
      "dateModified": "2025-12-03T15:49:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Evans, Jalen McMillan near return from injury as Bucs open 21-day practice window - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-injuries-mike-evans-jalen-mcmillan-returns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/dcd5e90f-12eb-4d8f-bf51-eb3e98120cc3/thumbnail/1200x675/afe09c06f2f0f7cf558645f2d87c7d7b/mike-evans-buccaneers-2.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:19:19.000Z",
    "description": "\n        The Buccaneers are, at long last, getting healthy. Tampa Bay is opening the 21-day practice window for star wide receiver Mike Evans as well ",
    "body": "\n        The Buccaneers are, at long last, getting healthy. Tampa Bay is opening the 21-day practice window for star wide receiver Mike Evans as well as second-year wide receiver Jalen McMillan, CBS Sports lead NFL insider Jonathan Jones reports.Evans, 32, broke his collarbone and suffered a concussion in Week 7 against the Lions, landing hard after nearly reeling in a deep pass from Baker Mayfield. That had been Evans' first game back since Week 3, when he suffered a hamstring injury. Coach Todd Bowles said after the Lions game that the collarbone injury would keep Evans \"out mostly toward the end of the year.\"Overall this season, Evans has 14 catches for 140 yards and one touchdown, so while his record-tying streak of 11 straight 1,000-yard receiving seasons is over, the fact that he's potentially returning on the earlier side of the timeline set by Bowles is a very good sign for Tampa Bay.McMillan, 23, reeled in 37 catches for 461 yards and eight scores last season as a third-round rookie out of Washington; the eight touchdown catches were third-most by a rookie in franchise history. Expected to open the season as a starter, McMillan landed awkwardly after trying to catch a high throw in the preseason and suffered a \"severely sprained neck\" that had him in a brace for several months.\nJones noted that both players will \"take some time getting back on the game field,\" so while a return to the lineup may not be imminent, this is a key step forward.Buccaneers finally getting healthyTampa Bay has battled a litany of injuries this season. Star left tackle Tristan Wirfs underwent knee surgery shortly before the regular season began and missed the first three games of the season. Likewise, wide receiver Chris Godwin, recovering from a severe leg/ankle injury last season, did not debut until Week 4. Godwin then missed Weeks 6-11 with a fibula injury. Bucky Irving played for the first time since Week 4 last week due to foot and shoulder injuries.Right tackle Luke Goedeke has played in just six games due to a foot injury and aggravation, though he has been back for the last four games. Right guard Cody Mauch suffered a season-ending knee injury in Week 2.\nDespite that, Tampa Bay is 7-5 and atop the NFC South. Mayfield has thrown for 2,600 yards, 19 touchdowns and five interceptions and run for 246 yards. Rachaad White and Sean Tucker have played well in Irving's absence, and standout first-round rookie Emeka Egbuka has shined with 791 receiving yards and six touchdowns. He and seventh-round rookie Tez Johnson (five touchdowns) have been on the receiving end of more than half of Mayfield's touchdowns.Tampa Bay is yet to play a snap this season with its top three wide receivers -- Evans, Egbuka and Godwin -- on the field together.Playoff impactThe Buccaneers have a half-game lead on the Panthers (7-6) for the NFC South lead; SportsLine currently gives Tampa Bay an 85% chance to win the division and an 86% chance to make the playoffs.\nEvans' and McMillan's potential returns could provide a boost to ensure Tampa Bay captures its fifth straight division title, especially considering the Buccaneers face division opponents four times over the next five weeks, including the Panthers twice.Week 14: SaintsWeek 15: FalconsWeek 16: at PanthersWeek 17: at DolphinsWeek 18: Panthers\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Evans, Jalen McMillan near return from injury as Bucs open 21-day practice window - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/dcd5e90f-12eb-4d8f-bf51-eb3e98120cc3/thumbnail/1200x675/afe09c06f2f0f7cf558645f2d87c7d7b/mike-evans-buccaneers-2.jpg"
      ],
      "datePublished": "2025-12-03T15:19:19.000Z",
      "dateModified": "2025-12-03T15:19:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy football Week 14 trade chart: Rest of season rankings to finalize deadline deals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-14-trade-chart/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:18:04.000Z",
    "description": "\n\n\n    \n                                    Use this trade chart to finalize your deadline deals\n        \n                                            ",
    "body": "\n\n\n    \n                                    Use this trade chart to finalize your deadline deals\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 3, 2025\n                            \n                    at\n    10:16 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Fifteen seasons ago, the Fantasy Football Trade Chart was created by CBS Sports for the sole purpose of helping you make fair trades in your leagues.                     But in 2025, the Trade Chart expanded! This year, we've added a column for those of you who play in four-point-per-pass TD leagues, and a column for half-PPR leagues! Yes finally.                      The values assigned to the players below reflect a long-term measurement of their Fantasy value. Values are determined by expected future performance, future schedule, and, most importantly, public sentiment. Past performance isn't a major factor in the Trade Chart.                      By adding two players' values, you could determine what one player you should be able to get in return. However, Fantasy managers should take off 10% of the value in any trade where one side has two or more players than the other. Also, a handful of others only carry legitimate value in two-QB or full-PPR leagues (and thus have no value listed in one-QB or non-PPR leagues).                     \nThis list also works as a \"rest of season\" rankings for the 2025 season.                      Finally, any player not on the chart should be considered valued at no more than four points. If you want to dive deeper before sending out or replying to trade offers, be sure to find my updated projected rest of season schedule rankings available on SportsLine later this week.                          \nYou can reach out with any questions, disagreements, or reports of trades from your leagues to Dave Richard at drichard@cbs.com or at @daverichard on X.                                                        Running back                     playertmnon0.5PPRC. McCaffreySF434547D. AchaneMIA4042.545J. TaylorIND424344J. GibbsDET4041.543B. RobinsonATL363840J. CookBUF353637J. JacobsGB3030.531D. HenryBAL292929B. IrvingTB2324.526J. WilliamsDAL212223B. HallNYJ192021S. BarkleyPHI202020K. WilliamsLAR202020C. BrownCIN1718.520A. JeantyLV161820T. EtienneJAC151617O. HamptonLAC141516D. SwiftCHI141516R. HarveyDEN121314R. DowdleCAR121314Q. JudkinsCLE121212K. Walker IIISEA111111J. WarrenPIT91011T. HendersonNE8910T. BensonARI88.59K. MonangaiCHI88.59K. HuntKC77.58W. MarksHOU66.57D. NealNO66.57K. GainwellPIT66.57C. Rodriguez Jr.WAS666C. HubbardCAR666R. StevensonNE666D. MontgomeryDET666Z. KnightARI666T. AllgeierATL666B. TutenJAC666J. MasonMIN666A. JonesMIN55.56T. Tracy Jr.NYG55.56D. SingletaryNYG55.56Z. CharbonnetSEA55.56B. CorumLAR555I. PachecoKC555K. VidalLAC555A. KamaraNO555R. WhiteTB----5                                         \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \tWide receiver                     playertmnon0.5PPRJ. Smith-NjigbaSEA384144J. ChaseCIN353841P. NacuaLAR3134.538R. RiceKC293235A. St. BrownDET2729.532C. LambDAL242730G. PickensDAL2426.529D. AdamsLAR232527N. CollinsHOU212325D. LondonATL2022.525L. McConkeyLAC1819.521T. HigginsCIN1718.520J. WaddleMIA1718.520C. OlaveNO1517.520A. BrownPHI1617.519T. McLaurinWAS1516.518M. Harrison Jr.ARI141618E. EgbukaTB1213.515D. SmithPHI1213.515M. PittmanIND111315J. WilliamsDET1112.514J. JeffersonMIN101214T. McMillanCAR101214M. EvansTB101112R. OdunzeCHI910.512G. WilsonNYJ89.511Z. FlowersBAL89.511D. SamuelWAS8910C. SuttonDEN8910A. PierceIND8910K. ShakirBUF78.510C. WatsonGB88.59J. MeyersJAC789J. JenningsSF789W. RobinsonNYG67.59S. DiggsNE66.57B. Thomas Jr.JAC66.57T. FranklinDEN66.57C. GodwinTB666D. MetcalfPIT666Q. JohnstonLAC55.56J. HigginsHOU55.56X. WorthyKC55.56K. BoutteNE55.56J. AddisonMIN555A. MitchellNYJ555P. WashingtonJAC555D. MooreCHI555                                         \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \tTight end                                   playertmnon0.5PPRT. McBrideARI1820.523B. BowersLV1719.522G. KittleSF141618T. WarrenIND1112.514T. KelceKC101112J. JohnsonNO77.58J. FergusonDAL567B. StrangeJAC66.57D. SchultzHOU66.57D. KincaidBUF66.57H. HenryNE55.56H. FanninCLE55.56K. PittsATL----6O. GadsdenLAC555M. AndrewsBAL555Z. ErtzWAS----5                     Quarterback                     playertm1QB-41QB-62QBJ. AllenBUF242350J. HurtsPHI212044M. StaffordLAR202044P. MahomesKC191942D. MayeNE181738D. PrescottDAL171738J. BurrowCIN131330J. BrissettARI111126L. JacksonBAL101024C. WilliamsCHI9922J. DartNYG8820J. GoffDET7716B. MayfieldTB7716B. PurdySF5512J. HerbertLAC5512J. DanielsWAS----12B. NixDEN----12J. LoveGB----12T. LawrenceJAC----12D. JonesIND----11S. DarnoldSEA----11C. StroudHOU----11T. TagovailoaMIA----10B. YoungCAR----9T. ShoughNO----9C. WardTEN----9T. TaylorNYJ----8K. CousinsATL----8A. RodgersPIT----7S. SandersCLE----6M. MariotaWAS----6J. McCarthyMIN----5G. SmithLV----5D. GabrielCLE----5\n            \n    \n\n        \n\n    \n            \n    \n            \n\n                    \n         Now Playing \n                    \n    \n                                        \n            \n                        \n                                                            \n                                    \n    \n                                                                                                    \n                                    \n                                                                                    \n                                                                                                    Dave's Week 14 Trade Chart \n                                                                                            \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 tight end preview\n                                                                                                                                                \n                                        \n                                                    Heath Cummings\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 WR preview\n                                                                                                                                                \n                                        \n                                                    Heath Cummings\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 waiver wire\n                                                                                                                                                \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     10 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                                                \n                    \n            \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy football Week 14 trade chart: Rest of season rankings to finalize deadline deals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T15:18:04.000Z",
      "dateModified": "2025-12-03T15:18:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn State's botched coaching search turns Signing Day into unprecedented disaster - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-states-botched-coaching-search-turns-signing-day-into-unprecedented-disaster/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/b358a267-b46d-4b15-ba34-d7202b5b7110/thumbnail/1200x675/0572d2bb50c21254042c50c7e6bc0fcc/pennstatefootball.jpg",
    "tag": "Sports",
    "date": "2025-12-03T15:47:15.000Z",
    "description": "\n        When Penn State made the bold move to fire longtime coach James Franklin on Oct. 12, the assumption was clear: act early, land a marquee repl",
    "body": "\n        When Penn State made the bold move to fire longtime coach James Franklin on Oct. 12, the assumption was clear: act early, land a marquee replacement and steady the 2026 recruiting class as the starting point for the future. Instead, six weeks later, the class has completely come apart.As the early signing period opened Wednesday, Penn State was down to four commitments -- then it lost four-star in-state safety Matt Sieg to West Virginia before lunchtime. That number may shrink to zero by the end of the week with no permanent coach in place and the office empty on the most important day of the year for any program chasing national titles.The damage is staggering.\"Other coaches are looking around going, what is going on over there?,\" 247Sports recruiting analyst Brian Dohn said during live Signing Day coverage. \"Penn State will come back from it because it's Penn State and it's the dominant program in the region ... they'll be fine in the long-run but in the short term, embarrassing is putting it mildly.\" Since Franklin's dismissal, 22 commitments have backed out of the 2026 class, gutting a group that once sat inside the national top 20. Now it has plummeted to -- at this moment -- No. 139 in the 247Sports Composite Team Recruiting Rankings, surrounded by FCS programs, purely because so few prospects remain attached. Even worse: nine of those decommits have flipped to Virginia Tech, where Franklin has wasted no time rebuilding momentum at his new stop since being hired two weeks ago.\nThat group uniting with him in Blacksburg now includes:4-star RB Messiah Mickens (90)3-star WR Davion Brown (89)3-star IOL Benjamin Eziuka (89)3-star LB Tyson Harley (89)3-star QB Troy Huhn (89)3-star TE Pierce Petersohn (89)3-star OT Marlen Bright (88)3-star OT Roseby Lubintus (88)3-star LB Mathieu Lamah (87)Note: 247Sports rating in parenthesesPenn State had eight four-star commitments at the time of Franklin's exit. Most have flipped elsewhere representing a staggering loss of talent. Dohn said more decommitments are on the way Signing NamePosition247Sports ratingCommitted toMatt SiegS95West VirginiaTerry WigginsLB94Penn StateKevin BrownOT94West VirginiaJackson FordEdge91Penn StateAlexander HaskellDL90SyracuseElijah LittlejohnLB90GeorgiaMessiah MickensRB90Virginia TechJahsiear RogersWR90OklahomaThe collapse is magnified by the stability Franklin once provided on the trail. His recruiting wasn't flawless -- Penn State still needed to climb into the true championship tier -- but he delivered a consistent floor of top-20 classes and cornerstone players. The moment he left, that floor gave way.The October plan was supposed to create clarity. Instead, it created a void. Top coaching targets signed extensions to stay put and while Penn State kept looking, recruits made their own decisions. Competitors -- including Franklin himself -- pounced.One potential stabilizer remainsInside the building, there is real backing for interim coach Terry Smith, who guided the Nittany Lions to three straight wins to reach bowl eligibility. Veteran leaders like Tony Rojas have publicly pushed to remove the interim tag. Their support is meaningful: in a moment when recruits are fleeing because of instability, the locker room is the only source of it. But that potential anchor remains in limbo as athletic director Pat Kraft and the administration continues its search and as Dohn said in the aftermath of Sieg's decommitment, if Sieg thought Smith had a legit chance at the full-time job, perhaps he would have kept his commitment to Penn State. The result is a collapse that illustrates a brutal truth of modern recruiting: if you fire a coach, you'd better have a replacement lined up. Penn State evidently didn't -- and the consequences hit immediately.Now the consequences extend well beyond the 2026 recruiting board. With the class nearly wiped out and the roster bracing for significant portal departures, the next coach should expect to inherit one of the biggest rebuilds in the country. Dohn said Kraft will likely have to spend big in the transfer portal to save face, but we've seen portal-heavy turnovers go poorly. For a program that was a play away from the national championship game last season, what was intended as a strategic reset has triggered a full-scale roster crisis. The margin between a controlled reboot and an uncontrolled collapse proved razor-thin, and Penn State now enters the early signing period unable to capitalize on the head start it believed it created.The Nittany Lions needed traction. Instead, they're watching the ground disappear beneath them.\n    \n                                        \n    If you want all of the latest Penn State coaching search news and info, there's no better place than Lions247.  It's the most trusted source for intel on the Nittany Lions and has the largest and most dedicated community of Penn State fans. The team of insiders with over 20 years of experience will tell you what's happening before it happens. Sign up for a VIP membership now and unlock all of the intel, info, analysis and more as the Lions search for its next head coach for the first time in over a decade.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State's botched coaching search turns Signing Day into unprecedented disaster - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/b358a267-b46d-4b15-ba34-d7202b5b7110/thumbnail/1200x675/0572d2bb50c21254042c50c7e6bc0fcc/pennstatefootball.jpg"
      ],
      "datePublished": "2025-12-03T15:47:15.000Z",
      "dateModified": "2025-12-03T15:47:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 Women's ACC/SEC Challenge preview: Five must-see games, including LSU vs. Duke - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-accsec-challenge-preview-five-must-see-games-including-lsu-vs-duke-and-north-carolina-vs-texas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/4b8a4f1a-5409-462a-aecb-1bc4915a8071/thumbnail/1200x675/bb5da86bec14de9941bceaf716031d4d/milaysia-fulwiley-lsu.png",
    "tag": "Sports",
    "date": "2025-12-03T14:45:50.000Z",
    "description": "\n        Two of the most intriguing conferences this season will face each other this week in the ACC/SEC women's basketball challenge. The event cons",
    "body": "\n        Two of the most intriguing conferences this season will face each other this week in the ACC/SEC women's basketball challenge. The event consists of 16 games over the span of two days and includes 11 teams who are currently ranked in the AP Top 25. The storylines feature a little bit of everything, from teams such as LSU getting ready to face their biggest test of the season, to programs like South Carolina looking to bounce back after a close loss to SEC foe Texas last week.It is only the beginning of December, but the results this week have the potential to impact resumes for March. Here is the schedule and how to watch the ACC/SEC challenge, along with a closer look at five must-watch matchups.ScheduleAll times are Eastern TimeWednesday, Dec. 3No. 17 Kentucky at Miami at 5 p.m. on ESPN2Georgia at Florida State at 5 p.m. on ESPNUVirginia at No. 15 Vanderbilt at 5 p.m. on SEC NetworkAuburn at Syracuse at 5 p.m. on ACC NetworkNC State at No. 9 Oklahoma at 7:15 p.m. on ESPN2Georgia Tech at Texas A&M at 7:15 p.m. on SEC NetworkNo. 17 Tennessee at Stanford 9:15 p.m. on ESPN2Thursday, Dec. 4Florida at Virginia Tech at 5 p.m. on ESPN2No. 3 South Carolina at No. 22 Louisville at 7 p.m. on ESPNNo. 11 Carolina at No. 2 Texas at 7 p.m. on ESPN2Clemson at Alabama at 7 p.m. on ESPNUPittsburgh at Mississippi State at 7 p.m. on SEC NetworkArkansas at SMU at 7 p.m. on ACC NetworkNo. 5 LSU at Duke at 9 p.m. on ESPNNo. 18 Notre Dame at No. 13 Ole Miss 9 p.m. on ESPN2California at Missouri at 9 p.m. on  SEC NetworkLSU at DukeDuke will be LSU's biggest test so far, but it is unfortunate these teams are meeting while the Blue Devils are at a low point. Kara Lawson's squad has lost four of its last five contests, although three of those were against currently ranked teams. They've struggled to find consistency on offense, so it doesn't help that five-star freshman point guard Emilee Skinner has only played two games due to a lower-body injury.\nThe Blue Devils had some good moments against South Carolina in the Players Era tournament, but ultimately the Gamecocks' size and physicality was too much for them to overcome. The Tigers have had no issue on offense, scoring 100+ points in each of their first eight contests with seven players averaging double-figures. A win would help Duke work its way back into the Top 25, but this is also a good opportunity to see how the Tigers perform against a tougher defense from their previous opponents.South Carolina at LouisvilleSouth Carolina is coming off a 66-64 loss to Texas in the Players Era championship game, but Dawn Staley said she was not disappointed in the result because this was going to be a good learning experience for her team. She definitely knows how to get the Gamecocks to bounce back because her teams have not lost back to back games since the 2020-21 season. South Carolina will be a tough opponent for Louisville but both teams are still figuring things out. Although the Gamecocks a tough defensively, they sometimes struggle with consistency on offense, particularly when it comes to 3-point shooting. Louisville tipped off the season with a tough test against No. 1 UConn. The Cardinals did not get the win, but they did make a decent comeback attempt. Their second loss this season was to a ranked Kentucky team. South Carolina won't be easy, but perhaps the Cardinals' recent 100-37 blowout against Bellarmine can give them some confidence.\nNorth Carolina at TexasAfter wins over UCLA and South Carolina, the Longhorns are the hottest team in women's basketball -- even though they have been shorthanded with the recent injuries of Aaliyah Crump and Bryanna Preston. The team was able to adjust quickly thanks to the leadership of Madison Booker and Rori Harmon, who hit the clutch shot that won her team the Players Era championship trophy. Not only might Texas have the best defense in the nation, but this season the team has also shown great improvement when it comes to offense. Texas will try to keep the momentum going while North Carolina is chasing its first win against a ranked opponent this season. The Tar Heels' biggest test so far was UCLA, which resulted in a 78-60 loss. They have six players averaging over nine points per game, and that depth will be needed to compete against Texas' defense.NC State at OklahomaThe Wolfpack don't have a single senior on the roster and this young team has certainly been tested early in the season with three ranked opponents. They pulled off a win against Tennessee but fell against USC and TCU. They also lost to an unranked Rhode Island team on Nov. 23, which was likely taken into consideration when they slipped out of the AP Top 25 rankings this week.\nDespite not having a ranking next to their name, this is still a team with dangerous pieces, including junior forward Khamil Pierre who is one of the top rebounders in the nation. Meanwhile, Oklahoma has a good combination of young and veteran talent as star Raegan Beers was joined by 247Sports No. 1 freshman Aliyah Chavez. The Sooners are averaging 92.1 points per game, but their 73-59 loss to UCLA in their second game of the season showed they are still a vulnerable team. The Bruins were able to limit Chavez to just 4-16 shooting, and Beers to only 7 points.Notre Dame at Ole MissOle Miss enters this matchup undefeated, but Notre Dame will be its most difficult opponent yet. The Rebels' offense is led by Cotie McMahon and Christeen Iwuala with over 17 points per game each. However, they have more depth than that, with six players averaging at least seven points per game and four players averaging over 5 rebounds per contest. The biggest question for the Rebels is how well they can perform against ranked competition. Meanwhile, Notre Dame is still figuring out its depth. The Fighting Irish are in rebuilding mode and naturally going through ups and downs. They suffered a 39-point loss to Michigan on Nov. 15 but a week later pulled off a win against USC. Hannah Hidalgo is averaging 27 points per game while also leading the team in assists and steals. She does a lot of heavy lifting but often gets help from the other only two returners from last season Cassandre Prosper and KK Bransford. There are also players like Vanessa de Jesus who have shown a lot of potential to be key pieces, but are still working on consistency.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 Women's ACC/SEC Challenge preview: Five must-see games, including LSU vs. Duke - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/4b8a4f1a-5409-462a-aecb-1bc4915a8071/thumbnail/1200x675/bb5da86bec14de9941bceaf716031d4d/milaysia-fulwiley-lsu.png"
      ],
      "datePublished": "2025-12-03T14:45:50.000Z",
      "dateModified": "2025-12-03T14:45:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Power Rankings: Lakers crack top three, Clippers' season hits new low - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-power-rankings-lakers-top-three-clippers-chris-paul-move/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/32ed9d28-2c7b-408a-821d-4790ba2c900e/thumbnail/1200x675/55f0813e298731653d4e6e515b8718fb/nbapowerrankings1203.png",
    "tag": "Sports",
    "date": "2025-12-03T15:00:07.000Z",
    "description": "\n\n\n    \n                                    Elsewhere, the Spurs are surviving just fine without Victor Wembanyama\n        \n                          ",
    "body": "\n\n\n    \n                                    Elsewhere, the Spurs are surviving just fine without Victor Wembanyama\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 3, 2025\n                            \n                    at\n    10:00 am ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        If you win seven straight games you're not going to fall in the Power Rankings just because your most recent game was a loss to the Suns on a back-to-back. Here's looking at you, Lakers. It's a different story across town in L.A., though. The Clippers are down to 25th in this week's Power Rankings as the NBA world woke up Wednesday to learn they decided to part ways with future Hall of Famer and team legend Chris Paul in the middle of the night.\nMeanwhile, in the East, the Magic and Hawks, are looking like the teams they were supposed to be after sluggish starts and they're both doing it without an All-Star player (Trae Young with Atlanta and Paolo Banchero in Orlando). If you're not paying attention to the Celtics and Suns, you need to. And if you though the Spurs being a good team was tied only to Victor Wembanyama, think again. \n        \n            \n                NBA quarter-season grades for every West team, from obvious 'A+' to alarming 'F-'\n                \n                    James Herbert                \n            \n                            \n    \n                \n                    \n    \nNote: As a general Power Rankings rule, we're going to try to strike a balance between what we've seen in the last week, the season as a whole so far, and what can reasonably be expected to play out over the next few weeks. We will not go so far as to rank these teams based on championship expectations, because in that case it would take a lot more to alter, at least in tiers, the generally accepted hierarchy. Winning matters, and it will get you on the move up this board form week to week. But if you're beating bad teams, just as an example, and probably playing a little above your head, it's not necessarily going to be reflected in a completely commensurate climb up the rankings. Or vice versa.\n        Biggest Movers\n    \n                7\n            \n                Celtics\n            \n                5\n            \n                Cavaliers\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Thunder\n                                \n                            The 2015-16 Warriors that won an NBA record 73 games were 24-1 after 25 games. The Thunder need three more wins to match that start and two of those games are against the Jazz and Mavericks. 74 wins is in play.\n                        \n                            --\n                        \n                            21-1\n                        \n                                2\n                            \n                                    Rockets\n                                \n                            Call it a schedule loss to Utah on a back-to-back doubleheader after beating the pants off the Jazz the night before. I love this team. Top-three offense and defense. Denver won the lone head-to-head thus far, but it was a photo-finish war and given Denver's recent slide means Houston has earned the higher ranking. \n                        \n                            1\n                        \n                            13-5\n                        \n                                3\n                            \n                                    Lakers\n                                \n                            This offense is basically unstoppable. Mismatches everywhere with two stars in Luka Dončić and Austin Reaves and now LeBron James to bring some fast-break force. Their seven-game winning streak came to an end with a loss to the Suns. Big deal. The Suns are good and play their butts off. It happens. If the Lakers make a trade for a defensive needle mover, this is a top-shelf title contender -- at least in the non-OKC division. \n                        \n                            2\n                        \n                            15-5\n                        \n                                4\n                            \n                                    Nuggets\n                                \n                            First tough stretch of the season for the Nuggets. Three losses in their last five with the latest coming against the Mavericks when they didn't score a single point between the six-minute and two-minute marks of the fourth quarter. That makes them 2-6 in Clutch games. \n                        \n                            2\n                        \n                            14-6\n                        \n                                5\n                            \n                                    Pistons\n                                \n                            Everything was roses for the Pistons on a 13-game winning streak, but what I loved to see was that when that streak turned into a little two-game skid in two tight losses against Boston and Orlando, they turned around on a back-to-back and beat Miami on the road and then backed that up with a win over a good Atlanta team to get right back on track. That's the mark of not just a good team, but a tough team.\n                        \n                            1\n                        \n                            17-4\n                        \n                                6\n                            \n                                    Spurs\n                                \n                            San Antonio is for real. We know this when Victor Wembanyama is out there, but now the Spurs gave gone 6-2 since his calf strain and 5-2 without both Wemby and Stephon Castle with wins over a good Atlanta team and a great Denver team. De'Aaron Fox has taken the scoring reins and Devin Vassell is having a sensational season. \n                        \n                            2\n                        \n                            14-6\n                        \n                                7\n                            \n                                    Magic\n                                \n                            This is the Magic team we thought we would see to start the year. It's been a talking point that it's happening without Paolo Banchero and what that may or may not mean, but note that they had won five of seven when he went out. Jalen Suggs is at the top of the \"we should be talking way more about this guy\" list. Nine wins in their last 11 games with a top-five offense and defense over that three-week stretch. \n                        \n                            4\n                        \n                            13-8\n                        \n                                8\n                            \n                                    Raptors\n                                \n                            Scottie Barnes, Brandon Ingram and Immanuel Quickley combined for 72 points in a win over Portland on Tuesday to get Toronto back on track after its first two-game losing skid in over a month. Make that 14 wins in their last 17 games. \n                        \n                            2\n                        \n                            15-7\n                        \n                                9\n                            \n                                    Celtics\n                                \n                            The Celtics are the sixth-ranked offense in the league with Payton Pritchard and Derrick White having down 3-point seasons, which is going to, and has already started to, normalize. This is a legit team even without Jayson Tatum. Seven wins in their last nine games, and four of their last five have been over the Magic, Pistons, Cavs and Knicks. That's as good a run as you'll find in these rankings. You cannot ignore how good the Celtics have been since their 0-3 start. \n                        \n                            7\n                        \n                            12-9\n                        \n                                10\n                            \n                                    Suns\n                                \n                            How can you not love love this team? The Suns have won 10 of their last 14. In the last week they played the Nuggets tough and took the Thunder to the wire. Those are probably the two best teams in the league, and then they beat the Lakers, one of the five best teams. So many Suns are having incredible seasons and not getting talked about enough. Dillon Brooks, Grayson Allen, Mark Williams and Collin Gillespie chief among them. \n                        \n                            3\n                        \n                            13-9\n                        \n                                11\n                            \n                                    Heat\n                                \n                            Wins in seven of their last eight with the only blemish being a one-possession loss to the East-leading Pistons. Tyler Herro has been on fire in his first games back, and so far the defense has held up fine with him on the court. \n                        \n                            2\n                        \n                            14-7\n                        \n                                12\n                            \n                                    Knicks\n                                \n                            The Knicks blew out the Raptors on Sunday before they had their four-game winning streak snapped by Boston on Tuesday. Josh Hart has been on a tear as he's back in New York's starting lineup with Mitchell Robinson coming off the bench. New York should pick up couple wins in its next two vs. Charlotte and Utah before a big matchup with Orlando on Sunday. \n                        \n                            --\n                        \n                            13-7\n                        \n                                13\n                            \n                                    Timberwolves\n                                \n                            The Wolves rallied in the second half to beat the Pelicans in overtime on Tuesday. Anthony Edwards went for 44 for his third 40-point games in the last 11 days. Minnesota continues to clean up its schedule slop and is 11-1 against sub-.500 teams. \n                        \n                            --\n                        \n                            13-8\n                        \n                                14\n                            \n                                    Hawks\n                                \n                            Wins in four of their last six and nine of their last 13. Atlanta is 12-6 without Trae Young with a top-10 defense and an offense that averaged a league-leading (by a mile) 32.1 assists per game in November, a single-month franchise record. Jalen Johnson leads the list of MVP players who have no chance of winning MVP. \n                        \n                            --\n                        \n                            13-9\n                        \n                                15\n                            \n                                    Cavaliers\n                                \n                            A little past the quarter mark of the season and the Cavs are sitting right on the East's playoff/play-in cut line. They've been hit pretty hard by injuries, but the good news is every lineup variation of the big four (Mitchell, Garland, Mobley and Allen) is killing opponents. Cleveland needs to get healthy across the board and then we can assess where this team is. Until then, Donovan Mitchell is just going to have to keep hitting a million pull-ups 3s. \n                        \n                            5\n                        \n                            13-9\n                        \n                                16\n                            \n                                    76ers\n                                \n                            Philly has split its last six games including a loss in the first game in which Paul George and Joel Embiid have actually played together -- a double-overtimer against Atlanta. Embiid doesn't look good to me. He cannot, or will not, move defensively. He gets beat up the floor. He can't get off the ground to rebound, where the Sixers are getting killed as a small team with a lot of really good guards who have to play together and George at the four. I want to believe in this team because of Tyrese Maxey, but I don't know. Embiid, even with some supportive offensive juice still in the tank, just doesn't do much for me right now. \n                        \n                            1\n                        \n                            11-9\n                        \n                                17\n                            \n                                    Warriors\n                                \n                            This is a .500 team in every way. When they manage to turn the ball over less than their opponents they generally win. When they don't, they almost always lose. It's been a 50/50 proposition. \n                        \n                            2\n                        \n                            11-11\n                        \n                                18\n                            \n                                    Trail Blazers\n                                \n                            Portland has lost eight of its last 10 against a string of tough opponents. The Blazers are still the only team to beat OKC and they had a fourth-quarter lead on the league's best team again on Sunday. The Blazers really need Jrue Holiday back. They're now 2-7 without him. \n                        \n                            --\n                        \n                            8-13\n                        \n                                19\n                            \n                                    Bulls\n                                \n                            Debbie Downer time: The Bulls, after a 5-0 start, might be exactly who we thought they were after all. Losses in five of their last six with the only win coming against the Wizards. That includes a stretch of three straight losses to the Pelicans, Hornets and Pacers, which is about as ugly as it gets. \n                        \n                            --\n                        \n                            9-11\n                        \n                                20\n                            \n                                    Grizzlies\n                                \n                            Hey, if the Play-In Tournament started today the Grizzlies would be in thanks to five wins in their last seven games against a super-soft stretch of opponents. The Grizzlies are now 8-0 against teams with losing records and 1-13 against above-.500 teams. One positive note: They are boat racing teams in the Zach Edey minutes. \n                        \n                            1\n                        \n                            9-13\n                        \n                                21\n                            \n                                    Bucks\n                                \n                            The Bucks had no chance without Giannis in the lineup, but since he's been back they're just 1-2 with a loss to the freaking Wizards. This isn't a good team. Waiving and stretching Damian Lillard to pay for four years of Myles Turner remains a incredibly desperate move that will not work. \n                        \n                            1\n                        \n                            9-13\n                        \n                                22\n                            \n                                    Jazz\n                                \n                            The Jazz have lost five of their last seven. The beat the Rockets on the back end of a back-to-back doubleheader on Monday, but they have a murderous December schedule ahead of them. That's good news for the rest of the league that is rooting for Utah to wind up with a top-eight pick next summer, lest it go to Oklahoma City. \n                        \n                            --\n                        \n                            7-13\n                        \n                                23\n                            \n                                    Hornets\n                                \n                            Charlotte ended Toronto's nine-game winning streak, but then missed a chance to extend its first winning streak of the year to three by losing to Brooklyn on Monday. The Hornets continue to be better with LaMelo Ball on the floor even though his shooting is in the tank. \n                        \n                            1\n                        \n                            6-15\n                        \n                                24\n                            \n                                    Mavericks\n                                \n                            Cooper Flagg is starting to take off. He has 59 points and 16 boards over his last two games, both Dallas wins. He is quietly shooting 60% in the clutch with a sparkling 77.8 eFG% on Clutch squared shots, which Inpredictable defines as shots \"in the top 1% in potential win probability impact.\" These are the one-possession-score-inside-the-final-minutes shots, and Flagg has been ultra confident in attacking in these few situations he's been in. \n                        \n                            1\n                        \n                            7-15\n                        \n                                25\n                            \n                                    Clippers\n                                \n                            The Clippers are a disgrace -- and that was true before they sent Chris Paul packing in the middle of the night. I can't remember a team with two elite players and a universally heralded offseason going this far in the tank this early, and this isn't because Bradley Beal got hurt. The Kawhi Leonard minutes are a wreck as is the defense in general. This team, and coach, has basically already quit with 14 losses in their last 16 games. The fact that the Thunder are going to get the Clippers' first-round pick next summer is unfair. \n                        \n                            2\n                        \n                            5-16\n                        \n                                26\n                            \n                                    Pelicans\n                                \n                            Make it 13 losses in 14 games after the Pelicans couldn't hold onto a late fourth-quarter lead vs. the Wolves on Tuesday. And now Zion Williamson is hurt. Again. \n                        \n                            --\n                        \n                            3-19\n                        \n                                27\n                            \n                                    Kings\n                                \n                            Everyone is for sale in Sac Town. They're not going to get much for anyone, with the possible exception of Domantas Sabonis. The good news is they own seven first-round picks over the next five years. \n                        \n                            --\n                        \n                            5-16\n                        \n                                28\n                            \n                                    Pacers\n                                \n                            Wins in two of their last three, and they took the Raptors to the wire only to go down on a Brandon Ingram game-winner with less than a second to play. I don't care that the records look pretty much the same, the Pacers are a way better team than the Nets or Wizards. \n                        \n                            1\n                        \n                            4-17\n                        \n                                29\n                            \n                                    Wizards\n                                \n                            The Wizards have actually won two of their last four. They beat the Bucks with Giannis in the lineup and a good Hawks team by way of a 46-point CJ McCollum explosion. It's enough to move them out of the cellar for at least a week. \n                        \n                            1\n                        \n                            3-17\n                        \n                                30\n                            \n                                    Nets\n                                \n                            Michael Porter Jr. continued his super season with 35 points and seven 3s in a win over the Hornets. It was Brooklyn's fourth win of the season. How much can we really say about that. \n                        \n                            2\n                        \n                            4-16\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Power Rankings: Lakers crack top three, Clippers' season hits new low - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/32ed9d28-2c7b-408a-821d-4790ba2c900e/thumbnail/1200x675/55f0813e298731653d4e6e515b8718fb/nbapowerrankings1203.png"
      ],
      "datePublished": "2025-12-03T15:00:07.000Z",
      "dateModified": "2025-12-03T15:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Signing Day: Top classes emerge in 2026 recruiting rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-recruiting-rankings-2026-early-national-signing-day/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/6648b8e2-6178-4ea1-aeeb-ab5a9e627f55/thumbnail/1200x675/860719ca07c16db19102d04b31b9e7ec/riley-1.jpg",
    "tag": "Sports",
    "date": "2025-12-03T14:29:42.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        With 148 of the top 150 players in the 247Sports r",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        With 148 of the top 150 players in the 247Sports rankings already committed, Wednesday's National Signing Day should largely be a celebration of the work programs have done to assemble top-ranked classes. Still, last-minute flips are an annual occurrence, and until pen meets paper, prospects can alter the outlook for a team -- or even an entire conference.On signing day eve, five-star quarterback Jared Curtis flipping his commitment from Georgia to Vanderbilt. The move provided the Commodores with their highest-rated commitment in school history and altered the top five of the recruiting rankings.The Early Signing Period's Wednesday start will formally begin the closing stretch of the 2026 recruiting cycle for most prospects headed to power-conference schools. For some programs, it will also mark an important turning point with an eye toward next season. Conference championship games, bowls and the College Football Playoff still await, but Wednesday offers its own moment of celebration for teams that feel better positioned for the future based on this cycle's recruiting haul.One of those teams is USC, which entered Wednesday ranked No. 1 nationally and is seeking to secure the first top-ranked class of the Lincoln Riley era. The recruiting wins of this cycle reflect the work Riley and his staff have done to modernize that department. But with blue-chip competitors like Alabama and Notre Dame also lurking in the top five, the Trojans still need to lock down their class to secure the top spot.\n Check out the top 10 classes below, and be sure to stay with us throughout the rest of the early National Signing Day as these rankings will likely change. Click the link at the end of the table to see where your team ranks if it is not inside the top 10.\n Watch our National Signing Day show LIVE starting at 10 a.m. ET on the 247Sports YouTube page for commitments, analysis and reactions. Then, tune to CBS Sports HQ for a signing day recap at 6 p.m. Refresh the page as you desire to see the most updated recruiting rankings.National Signing Day LIVE updates | Crystal Ball | Complete Schedule   \nGrab a 247Sports subscription today to get inside scoop on your favorite team, expert analysis and opinion on all the day's biggest news and read content across the 247Sports network. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Signing Day: Top classes emerge in 2026 recruiting rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/6648b8e2-6178-4ea1-aeeb-ab5a9e627f55/thumbnail/1200x675/860719ca07c16db19102d04b31b9e7ec/riley-1.jpg"
      ],
      "datePublished": "2025-12-03T14:29:42.000Z",
      "dateModified": "2025-12-03T14:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A CFP bracket without Alabama, Notre Dame or any ACC team? It could happen - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-bracket-without-alabama-notre-dame-acc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/298a0e67-e278-42f9-8730-3660b96a7dcf/thumbnail/1200x675/4904ef8bdcfcf34c9b496d0eb32abb54/byu.png",
    "tag": "Sports",
    "date": "2025-12-03T14:19:45.000Z",
    "description": "\n        The College Football Playoff Selection Committee will be able to enjoy their Sunday morning coffee without much anxiety ahead of their final ",
    "body": "\n        The College Football Playoff Selection Committee will be able to enjoy their Sunday morning coffee without much anxiety ahead of their final top 25 rankings reveal as long as conference championship weekend goes as expected. If not, there's a series of chaos scenarios that could summon nightmares for committee chair Hunter Yurachek and his team as they try and pick the seven best teams as at-large teams along with the five highest-ranked conference champions to fill their 12-team bracket.Only one of the three teams on the bubble -- No. 10 Notre Dame, No. 11 BYU and No. 12 Miami -- will be in action Saturday with a chance to play its way into the playoff. The Cougars take on Texas Tech in the Big 12 Championship Game and those watching from South Bend and South Florida will be rooting hard for the Red Raiders.More on that scenario in a second ...Duke beats Virginia in ACC ChampionshipSo many results had to happen in November for the league's doomsday scenario to potentially come to fruition and here we are within the ACC. There's a chance commissioner Jim Phillips will be wide awake around midnight Saturday wondering if the ACC is kept out of the final bracket by the committee if unranked Duke takes out No. 17 Virginia in Charlotte.\nThe committee may have to decide between a five-loss Blue Devils team and potential Sun Belt champion James Madison for the final spot in the rankings as the fifth auto-bid. Let's compare the resumes and metrics for each, with acknowledgment that Duke beating a top-20 team this weekend would enhance those numbers a bit.Strength of recordGame controlStrength of scheduleDuke59th74th70thJames Madison18th40th118thDuke currently holds zero wins over teams ranked inside the committee's top 25, the same number as 25th-ranked JMU. The two teams unfortunately do not share a common opponent, either. JMU's lone loss came against Louisville on the road, while Duke has setbacks against Illinois, Tulane, Georgia Tech, UConn and Virginia.Strength of record and game control are two metrics that favor JMU. However, the strength of schedule gap is wide by comparison. Game control has been this committee's preferred metric the last four weeks and how these two teams look this weekend is extremely important. The Dukes are a three-touchdown favorite against Troy, while the Blue Devils are a 2.5-point underdog against the Cavaliers. Georgia blasts Alabama in SEC ChampionshipAlabama could make it easy on the committee during final deliberations by taking out the Bulldogs for a second time this season, securing a spot in the bracket as a likely top 4-seeded SEC champion. The other side of that equation would leave much room for debate and brings several bubble teams -- like Miami -- back into the mix. Would the committee leave Alabama (10-3) out entirely with a loss inside Mercedes-Benz Stadium?It depends on how bad of a loss the Crimson Tide suffers. Alabama sliding ahead of Notre Dame to No. 9 in Tuesday's rankings update was a substantial positive, but Yurachek did say the committee would \"re-rank\" the entire top 25 after championship weekend and take into account final results.There's been recent calls to end conference championship games in the expanded playoff era and this scenario would throw gasoline on that fire. This weekend, should the Crimson Tide lose, is an unnecessary 13th data point for the committee that could potentially torch Alabama's playoff bid. If the season ended today, Alabama would be the second-to-last at-large selection and one of five SEC teams in the field.The idea of playing in the SEC Championship Game and missing out on the playoff with a loss would be stunning, according to Alabama's second-year coach Kalen DeBoer.\"That would blow my mind,\" DeBoer said after Alabama beat Auburn in the Iron Bowl. \"That would be unreal. You know what I mean? We're 10-2 and 7-1 in the SEC, with all these ranked wins and we got some wins on the road. We got more a playoff-caliber team, there's not a question in my mind.\"DeBoer said the win at Jordan-Hare Stadium should have clinched a spot for Alabama.\"I definitely do. Definitely believe that we've got that type of team,\" DeBoer said. \"7-1 in the SEC and as many ranked teams as we have, and then winning a rivalry game here on the road shows a lot grit, what this team's all about. Yeah, I think it goes back to Week 1 and what you can believe and what people will tell you, who you are. It really comes to the character of this team really never wavered.\"DeBoer won't have to do much politicking for his team in the playoff Saturday evening if Georgia wins. SEC commissioner Greg Sankey will be in front of the nearest microphone he can grab to do it for him.BYU beats Texas Tech in Big 12 ChampionshipIf Alabama beats Georgia and BYU wins the Big 12, seed Nos. 2 through 10 will be virtually unpredictable on Sunday with much fluctuation. If you're a fan of chaos, this is what you're rooting for unless you're a Notre Dame or Miami fan. BYU would be an unexpected bid-stealer of sorts as an auto-bid conference champion, knocking the 10th-ranked Fighting Irish from their current perch into -- let's be real -- an unwanted bowl game as consolation.After Texas Tech beat BYU last month and handed the Cougars their only loss of the regular season, Red Raiders coach Joey McGuire used his post-game availability as an opportunity to beat the drum for one of his fellow Big 12 members in the at-large playoff discussion.He delivered an uppercut to Notre Dame in the same breath.\n\"I have so much respect for BYU. I do,\" McGuire said. \"I was really excited whenever they joined the Big 12 because I think that they carry a lot of weight and a lot of respect. I think that I have a lot of respect for them entering a conference and not playing an independent schedule like other people -- y'all already know who that is. \"So, I have a lot of respect for that. I mean, they're earning their right just like everybody, but a couple of people in the nation, are earning their right through conference play and playing in some really tough places.\"Since BYU has been slotted behind Notre Dame by the committee, the Cougars are not guaranteed to be selected unless they win their conference championship.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A CFP bracket without Alabama, Notre Dame or any ACC team? It could happen - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/298a0e67-e278-42f9-8730-3660b96a7dcf/thumbnail/1200x675/4904ef8bdcfcf34c9b496d0eb32abb54/byu.png"
      ],
      "datePublished": "2025-12-03T14:19:45.000Z",
      "dateModified": "2025-12-03T14:19:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]