[
  {
    "title": "Bruce Bochy out as Rangers manager after three seasons, 2023 World Series title - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/bruce-bochy-out-as-rangers-manager-after-three-seasons-2023-world-series-title/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/30/4ddc4248-e3fe-4bea-837b-c9b662a5a7f2/thumbnail/1200x675/6f43913029892bb5439a2d4130b98e6e/bochy-getty.png",
    "tag": "Sports",
    "date": "2025-09-30T01:09:05.000Z",
    "description": "Getty Images                                    The Texas Rangers announced on Monday night that the club and manager Bruce Bochy \"have mutually agreed to end his managerial tenure with the...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"bochy-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/30/4ddc4248-e3fe-4bea-837b-c9b662a5a7f2/thumbnail/770x433/074b4e09645f3f8f30d65153ac3d3b36/bochy-getty.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/TEX/texas-rangers/\">Texas Rangers</a> announced on Monday night that the club and manager Bruce Bochy \"have mutually agreed to end his managerial tenure with the organization.\"</p><p>\"Bruce Bochy is one of the greatest managers in baseball history and he will forever hold a place in the hearts of Ranger fans after bringing home the first World Series title in franchise history in 2023,\" Rangers president of baseball operations <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/489811/chris-young/\">Chris Young</a> said in that same statement. \"Boch brought class and respect to our club in his return to the dugout and we will always take pride in being part of his Hall of Fame career.  We are grateful for everything he has given to the organization over the past few seasons and hopeful he can continue to impact the Rangers for many years to come.\"</p><p>He has been offered an advisory role within the front office, the team said.</p><p>Bochy's time with the Rangers ended after a disappointing 2025 season in which Texas went 81-81 and finished in third place in the American League West. That came after a 2024 campaign in which the Rangers, coming off that World Series championship in 2023, finished 78-84 and missed the postseason. In three seasons with Texas, Bochy guided the team to a record of 249-237 and the only World Series championship in franchise history. </p>\n<p>Overall, the 70-year-old Bochy is 2,252-2,266 (.498) in 28 seasons as a manager in Major League Baseball. Those 28 years in the dugout also include long stints with the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/SD/san-diego-padres/\">San Diego Padres</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/SF/san-francisco-giants/\">San Francisco Giants</a>. Prior to winning the World Series with Texas, Bochy guided the Giants to a trio of titles in 2010, 2012, and 2014. As a four-time winner of the World Series who's also sixth on the all-time wins list, Bochy will almost certainly be elected to the Baseball Hall of Fame for his managerial accomplishments.</p><p>Those same Giants are currently in the market for a manager after <span><a href=\"https://www.cbssports.com/mlb/news/giants-fire-manager-bob-melvin-san-francisco-wants-change-in-leadership-after-third-place-nl-west-finish/\" target=\"_blank\">firing Bob Melvin</a></span> earlier Monday.</p>\n<p>As for the Rangers, former <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIA/miami-marlins/\">Miami Marlins</a> manager Skip Schumaker is <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/news/rangers-hire-ex-marlins-manager-skip-schumaker-to-front-office-role-per-report/\">a current member of the Texas front office</a> and may emerge as a strong internal candidate to replace Bochy. </p>\n            </div>\n    </div>"
  },
  {
    "title": "When will Jaydon Blue make his Cowboys debut? Injuries could force rookie RB onto field as soon as Week 5 - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/when-will-jaydon-blue-make-his-cowboys-debut-injuries-could-force-rookie-rb-onto-field-as-soon-as-week-5/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/a600d9a2-9af9-4bfe-8e2e-58fda11f92fd/thumbnail/1200x675/be54cefceacd2e5631ae9298599c919f/jaydon-blue.jpg",
    "tag": "Sports",
    "date": "2025-09-29T23:49:14.000Z",
    "description": "FRISCO, Texas -- Dallas Cowboys running back Javonte Williams has already surpassed all expectations that came with the team signing him to a one-year, $3 million contract on the first day of free agency in...",
    "body": "<div>\n        <p>FRISCO, Texas -- <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DAL/dallas-cowboys/\">Dallas Cowboys</a> running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2961719/javonte-williams/\">Javonte Williams</a> has already surpassed all expectations that came with the team signing him to a one-year, $3 million contract on the first day of free agency in March. Williams ranks fifth in the entire <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> in rushing yards (312), tied for second in rushing touchdowns (four) and eighth in yards per carry (5.0, minimum 35 carries). </p><p>Williams is clearly the Cowboys' bell cow back, especially after going for 85 yards and a touchdown on a season-high 20 carries in Dallas' 40-40 tie against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/GB/green-bay-packers/\">Green Bay Packers</a> on \"Sunday Night Football\" in Week 4. However, the 25-year-old needs a reliable back to spell him across a 17-game season. </p><p>Seven-year veteran <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2251305/miles-sanders/\">Miles Sanders</a> has been serving as Dallas' backup, but he suffered an ankle injury against Green Bay. Head coach Brian Schottenheimer feels like Sanders will still be able to suit up Sunday at the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>. </p>\n<p>If Sanders doesn't heal to the team's liking ahead of playing at the Jets' MetLife Stadium -- a venue notorious for its turf surface that leaves players, home and away, <span><a href=\"https://www.cbssports.com/nfl/news/metlife-stadium-playing-surface-under-the-microscope-again-following-malik-nabers-knee-injury/\" target=\"_blank\">seemingly more susceptible to injuries</a></span> -- it could be worth giving him the week off. Last season, both starting edge rushers, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1984683/demarcus-lawrence/\">DeMarcus Lawrence</a> (foot) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2967590/micah-parsons/\">Micah Parsons</a> (ankle sprain), suffered multi-week injuries in Dallas' 20-15 Week 4 win at the Giants, who also play at MetLife. On Sunday, Giants Pro Bowl wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/26697761/malik-nabers/\">Malik Nabers</a> suffered a season-ending ACL tear. </p>\n<p>That could open the door for fifth-round rookie running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/28875227/jaydon-blue/\">Jaydon Blue</a>, who <span><a href=\"https://www.cbssports.com/nfl/news/2025-nfl-draft-cowboys-draft-texas-jaydon-blue-in-fifth-round-rb-compares-himself-to-jahmyr-gibbs/\" target=\"_blank\">compared himself and his speed on draft day</a></span> to <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DET/detroit-lions/\">Lions</a> Pro Bowl running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3162723/jahmyr-gibbs/\">Jahmyr Gibbs</a>, to make his <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> debut. There was <span><a href=\"https://www.cbssports.com/nfl/news/cowboys-not-questioning-rookie-rb-jaydon-blues-work-ethic-impressed-with-his-between-the-tackles-abilities/\" target=\"_blank\">a rumor about Blue's work ethic</a></span> coming out of the University of Texas, a claim Cowboys running backs coach Derrick Foster <span><a href=\"https://www.cbssports.com/nfl/news/cowboys-not-questioning-rookie-rb-jaydon-blues-work-ethic-impressed-with-his-between-the-tackles-abilities/\" target=\"_blank\">shot down in training camp</a></span>. Schottenheimer described Blue as \"very close\" to actually suiting up for the first time with Blue meeting his challenge of being more \"consistent\" in practice. </p><p>\"Very close. I'll say that again. I've said it a number of times, he's practicing really, really well. I challenged him a few weeks ago on being consistent,\" Schottenheimer said. \"He's done that. He's becoming one of our best offensive practice squad players. He gives the defense an incredible look with his speed and playmaking ability, so very close.\"</p><a href=\"https://www.cbssports.com/nfl/news/dak-prescott-has-been-money-this-season-for-cowboys-earning-indispensable-pay-check-from-jerry-jones/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Dak Prescott has been money this season for Cowboys, earning 'indispensable' paycheck from Jerry Jones</p>\n                <p>\n                    Garrett Podell                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Dak Prescott has been money this season for Cowboys, earning 'indispensable' paycheck from Jerry Jones\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/14/0df2bae3-4da8-4ab8-826a-7c8e82efdb29/thumbnail/270x152/87138d18f07a59cd3cc0b6cdcba80389/dak-prescott.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Another element that could factor into Blue being active could be the Cowboys' desire to keep fullback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2969438/hunter-luepke/\">Hunter Luepke</a> plugged in as a core special teamer, something they had to adjust Sunday with Sanders dealing with the ankle issue. </p>\n<p>Perhaps Blue and his 21-year-old legs will be of use to Schottenheimer and the Cowboys at New York on Sunday. The true test will come not in a game, but in practice.</p>\n            </div>"
  },
  {
    "title": "Tyreek Hill injury: Dolphins WR carted off with gruesome knee injury vs. Jets on 'Monday Night Football' - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/tyreek-hill-injury-dolphins-wr-carted-off-with-gruesome-knee-injury-vs-jets-on-monday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/30/71319496-72e0-4a1b-91dc-d04d0350385f/thumbnail/1200x675/83b462517111e73f3a33b89cc9c5a6e7/tyreek-injury-imagn.png",
    "tag": "Sports",
    "date": "2025-09-30T01:21:54.000Z",
    "description": "Imagn Images                                    Dolphins star wide receiver Tyreek Hill suffered a gruesome-looking knee injury in the third quarter of Miami's \"Monday Night Football\" game against the...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"tyreek-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/30/71319496-72e0-4a1b-91dc-d04d0350385f/thumbnail/770x433/da73d28b5677b627bd9a23d8a7fdaf4e/tyreek-injury-imagn.png\" /></figure>\n                    <figcaption>\n                <span>Imagn Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Dolphins</a> star wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a> suffered a gruesome-looking knee injury in the third quarter of Miami's \"Monday Night Football\" game against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">Jets</a>. He was carted off the field, quickly ruled out and taken to a local hospital, <a href=\"https://x.com/miamidolphins/status/1972829403005734932\" target=\"_blank\">the team announced</a>.</p><p>ESPN cameras captured Hill in a wheelchair leaving the stadium, with his leg in a brace and a staff member holding Hill's foot up to keep the leg straight.</p><p>The Dolphins were leading 10-3 less than two minutes after halftime when Hill caught a 10-yard pass from <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a> to convert a third-and-8. However, as Hill went to the ground out of bounds, his left leg got caught under him and bent at a very awkward angle.</p><p>According to ESPN sideline reporter Katie George, the training staffs of both teams worked quickly to help Hill, cutting off his cleat and the tape around his ankle/foot area to get his leg into a stabilizer. Players from both teams took a knee and then went over to offer support to Hill, who waved to the crowd as he exited the field on a cart.</p>\n<p>Hill, 31, had 15 catches for 198 yards and a touchdown across the first three weeks of the season and was on his way to another big performance against the Jets with six catches for 67 yards.</p><p>Hill is in his fourth season with the Dolphins. After 1,710 receiving yards in his 2022 debut with Miami, he had an NFL-leading 1,799 receiving yards and 13 touchdowns in 2023 before a down 2024 when Tagovailoa missed significant time.</p>\n<p>Tagovailoa had <span><a href=\"https://www.cbssports.com/nfl/news/dolphins-tua-tagovailoa-says-bond-with-tyreek-hill-has-been-repaired-i-think-that-conversation-is-dead-now/\" target=\"_blank\">spoken highly</a></span> of Hill's maturity and the relationship between the two just before the season began, and Hill was off to a solid start to this year. With Hill out, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2962110/jaylen-waddle/\">Jaylen Waddle</a> becomes the Dolphins' de facto No. 1 wide receiver; <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3124729/malik-washington/\">Malik Washington</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2185954/nick-westbrook-ikhine/\">Nick Westbrook-Ikhine</a> will likely see more snaps as well.</p>\n            </div>\n    </div>"
  },
  {
    "title": "Dolphins vs. Jets: Darren Waller comes out of retirement to catch 2 TD passes 631 days after his last NFL game - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-darren-waller-comes-out-of-retirement-catch-td-pass/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/30/39247c91-a3cf-4ae0-9efc-ac93f9d58fb2/thumbnail/1200x675/0689d962fb2d5b0cf972504d775146a6/waller.jpg",
    "tag": "Sports",
    "date": "2025-09-30T01:02:35.000Z",
    "description": "After spending more than a year in retirement, Darren Waller finally returned to the NFL on Monday night and he made a huge splash. In his first game with the Miami Dolphins, Waller came out and caught two...",
    "body": "<div>\n        <p>After spending more than a year in retirement, Darren Waller finally returned to the NFL on Monday night and he made a huge splash. In his first game with the Miami Dolphins, Waller came out and caught two touchdown passes against the New York Jets. </p><p>Waller's first score of the game came on a four-yard pass from Tua Tagovailoa that gave the Dolphins an early 10-0 lead. </p>\n<p>Waller then followed that up in the third quarter with a nine-yard touchdown reception that put the Dolphins up 17-3. </p>\n<p>The tight end caught a total of three passes for 27 yards through the first three quarters. </p>\n<p>The Dolphins' new star is having a productive night that didn't even seem possible just six months ago. </p><p>Waller's appearance on Monday night came 631 days after he played in his last NFL game, which came with the New York Giants during Week 18 of the 2023 season. Five months after that game was played, Waller <span><a href=\"https://www.cbssports.com/nfl/news/darren-waller-retires-former-pro-bowl-te-hangs-up-cleats-after-lone-season-with-giants-eight-year-nfl-career/\" target=\"_blank\">announced that he had decided to retire</a></span> at the age of 31. </p><p>The former Pro Bowler ended up sitting out the entire 2024 season and it didn't look like he was going to return to football, but then a funny thing happened: The Giants decided to trade him. Waller agreed to come out of retirement as part of the July 1 trade, which saw the Giants send the tight end to Miami in <span><a href=\"https://www.cbssports.com/nfl/news/darren-waller-trade-tight-end-to-come-out-of-retirement-as-giants-send-former-pro-bowler-to-dolphins/\" target=\"_blank\">exchange for a 2026 sixth-round pick</a></span>. </p>\n<p>The Dolphins' didn't <a href=\"https://www.nfl.com/news/dolphins-te-darren-waller-still-knocking-some-rust-off-as-week-1-approaches\" target=\"_blank\">activate Waller until late August</a> and after that happened, it took his body to re-acclimate to the NFL. </p><p>\"You can't always predict how your body will respond from having time away,\" Waller said in late August. \"Mostly, it's just my body responding well and, in some ways, it didn't, so it was just like being cautious in that way to, I guess, look at the bigger picture as opposed to maybe rushing in to get ready for the very beginning.\"</p><p>During the first three weeks of the season, Waller wasn't on the field. He was listed inactive for each game while dealing with a hip injury. On Monday night, he was finally ready to make his debut. </p>\n<p>The Dolphins are certainly a team where a tight end can have some success. During the 2024 season, Jonnu Smith led the team in receptions (88) and receiving touchdowns (8) while finishing second in receiving yards (884). After Smith <span><a href=\"https://www.cbssports.com/nfl/news/steelers-acquire-jonnu-smith-from-dolphins-why-he-helps-aaron-rodgers-as-do-it-all-weapon/\" target=\"_blank\">got traded to the Steelers</a></span> on June 30, the Dolphins went out an acquired Waller just one day later. </p><p>Waller finished with over 1,000 yards receiving in both 2019 and 2020 while playing for the Raiders and even made the Pro Bowl in 2020. In 2023, he finished with 552 receiving yards despite playing for a Giants offense that simply wasn't very good. </p><p>In Miami, he'll have a chance to put up some big numbers and he's already off to a hot start. </p>\n            </div>"
  },
  {
    "title": "Jets vs. Dolphins prediction, odds, time: 2025 NFL Week 4 Monday Night Football picks from expert on 18-9 roll - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-vs-dolphins-prediction-odds-time-2025-nfl-week-4-monday-night-football-picks-from-expert-on-18-9-roll/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/baecf821-c61b-4716-8f73-d972c50ad141/thumbnail/1200x675/debae254e76050bb8e6a85ff5cb1fa5c/justin-fields-new-york-jets-imagn-imges.jpg",
    "tag": "Sports",
    "date": "2025-09-29T22:35:52.000Z",
    "description": "Teams looking to get into the win column clash when the New York Jets face the Miami Dolphins in a key AFC East matchup on Monday Night Football. New York is coming off a 29-27 loss at Tampa Bay, while Miami...",
    "body": "<div>\n        <p>Teams looking to get into the win column clash when the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a> face the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> in a key AFC East matchup on Monday Night Football. New York is coming off a 29-27 loss at Tampa Bay, while Miami dropped a 31-21 decision at Buffalo in Week 3. The Jets (0-3), who are 0-2 in the conference, are 0-1 within the division. The Dolphins (0-3), who are 0-3 in the conference, are 0-2 against AFC East foes. Cornerbacks Storm Duck (ankle) and Jason Marshall Jr. (hamstring) have been ruled out for Miami.</p><p>Kickoff from Hard Rock Stadium in Miami Gardens,  Fla., is set for 7:15 p.m. ET. The Dolphins lead the all-time series 61-57-1, including wins in eight of the past 10 matchups. The Dolphins are 2.5-point favorites in the latest Jets vs. Dolphins odds from SportsLine consensus, while the over/under for total points scored is 44. Before making any Jets vs. Dolphins picks, <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">make sure you check out what SportsLine expert, Emory Hunt, has to say</a>. </p><p><em>New users can also target the </em><span><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$300 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a><em>:</em></p><p>Hunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007, and a former running back at Louisiana-Lafayette. He knows the game from a player's perspective. </p><p>Hunt's dedication to analysis of all levels of college and professional football helped go 88-67-2 (+1474) on all <a target=\"_blank\" href=\"https://cbssports.com/nfl/picks/experts/\">NFL picks</a> over the past two years. He is also 18-9 (+805) on his last 27 against-the-spread picks in New York Jets games. Anyone who has followed him could be way up.</p><p>Now, Hunt has zoned in on <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_NYJ@MIA/\" target=\"_blank\">Jets vs. Dolphins</a>. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">You can head to SportsLine now to see his picks</a>. Here are several <a href=\"https://www.cbssports.com/nfl/odds/\" target=\"_blank\">NFL odds</a> and <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> lines for Dolphins vs. Jets:</p><table><tbody><tr><td><p>Jets vs. Dolphins     spread</p></td><td><p>Dolphins -2.5 at DraftKings Sportsbook</p></td></tr><tr><td><p>Jets vs. Dolphins     over/under</p></td><td><p>44.5 points</p></td></tr><tr><td><p>Jets vs. Dolphins     money line </p></td><td><p>Dolphins -153, Jets +127</p></td></tr><tr><td><p>Jets vs. Dolphins     picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Jets vs. Dolphins     streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Dolphins can cover</h2><p>Veteran quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a> leads the Miami offense. In three games this season, he has completed 62 of 89 passes for 575 yards (69.7%) and five touchdowns with four interceptions. In a 33-27 loss to the New England Patriots in Week 2, he completed 26 of 32 passes for 315 yards and two touchdowns with one interception. In his last matchup against the Jets in 2024, he helped guide the Dolphins to a 32-26 overtime win on Dec. 8. In that game, he completed 33 of 47 passes (70.2%) for 331 yards and two touchdowns.</p><p>His top target has been wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a>. He has 15 receptions for 198 yards (13.2 average) and one touchdown. Hill has three explosive plays of 20 yards or more, including a long of 47, with 30 yards after the catch and 12 first-down conversions. In the loss to New England, he caught six passes for 109 yards. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>Why the Jets can cover</h2><p><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1273205/justin-fields/\">Justin Fields</a> (concussion) has cleared protocol and is in line to get the start. He'll lean on wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123864/garrett-wilson/\">Garrett Wilson</a>, who leads the team with 21 receptions for 229 yards (10.9 average) and two touchdowns. He has two explosive plays of 20 yards or more, including a long of 33, with 59 yards after the catch and 10 first-down conversions.</p><p>Fourth-year running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a> is off to a solid start to the season. In three games, he has rushed 38 times for 157 yards (4.1 average), while catching eight passes for 78 yards, including a long of 33. In a season-opening 34-32 loss to the Pittsburgh Steelers, he carried 19 times for 107 yards (5.6 average). In 43 career games, he has 550 carries for 2,490 yards and 14 touchdowns. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See which team to back at SportsLine</a>.</p><p><em>New users can also check out the latest </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>FanDuel promo code</em></a></span><em> to </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>get $300 in bonus bets after placing a $5 bet</em></a></span><em>:</em></p><h2>How to make Jets vs. Dolphins  picks</h2><p>For Monday Night Football's Jets vs. Dolphins matchup, Hunt is leaning under the total, but he also says a critical X-factor makes one side of the spread a must-back. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See what it is at SportsLine</a>.</p><p><strong>Who covers in Jets vs. Dolphins and what critical x-factor do you need to know about? </strong><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\"><strong>Visit SportsLine now to see which side of the Jets vs. Dolphins spread you need to jump, all from the expert who returned $805 to $100 players over his last 27 New York Jets picks</strong></a><strong>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Monday Night Football NFL player props: Self-learning AI likes Jake Browning Over 219.5 passing yards - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-nfl-player-props-self-learning-ai-likes-jake-browning-over-219-5-passing-yards/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/c41caf59-93be-4775-aa13-5aef58550dff/thumbnail/1200x675/f1844d41c6c63c953678c12864522cb1/jake-browning-bengals-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-09-29T22:43:16.000Z",
    "description": "The Week 4 NFL schedule concludes with another two-game 'Monday Night Football' slate. There's a staggered start with Jets vs. Dolphins at 7:15 p.m. ET and Bengals vs. Broncos kicking an hour later. The...",
    "body": "<div>\n<p>The Week 4 NFL schedule concludes with another two-game 'Monday Night Football' slate. There's a staggered start with Jets vs. Dolphins at 7:15 p.m. ET and Bengals vs. Broncos kicking an hour later. The earlier kick has an over/under of 44, while the later is at 44.5. Joe Burrow (toe) remains out for Cincinnati, though the Jets will have Justin Fields (concussion) back in the lineup. Bengals tight end Noah Fant (concussion) has been ruled out. How should those injury situations shape your Monday NFL prop picks at quarterback and surrounding positions?</p><p>Nome notable Monday Night Football player prop lines include Fields with an over/under of 183.5 yards, Ja'Marr Chase at over/under 68.5 receiving yards and Bo Nix at 1.5 touchdown passes. Before making any Monday Night Football NFL prop picks, <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">you need to see the Seahawks vs. Cardinals prop predictions powered by SportsLine's Machine Learning Model AI</a>.</p><p>Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. </p><p>For Jets vs. Dolphins and Broncos vs. Bengals <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> on Monday Night Football, the Machine Learning Model  has evaluated the NFL player prop odds and provided NFL prop picks. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">You can only see the Machine Learning Model player prop predictions for here</a>.</p><h2>Top NFL player prop bets for 'Monday Night Football'</h2><p>After analyzing the Seahawks vs. Cardinals props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Browning goes Over 219.5 passing yards (-112).</p><p>Browning is an experienced backup who saw extensive action in 2023 with Burrow out an extended period that year. He's stepping in again in 2025 due to Burrow's toe injury, which will have him out multiple months, and thus far he's 1-1. His first action against Jacksonville led to a win and 241 passing yards, though he did take a step back last week in a loss with just 140 yards. </p><p>SportsLine's model is projecting 261.8 yards for Browning as he's in a spot where the Bengals might have to play from behind. He has excellent targets in Chase and Tee Higgins, and the model rates this as a strong 4.5-star play. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">See more NFL props here</a>.</p><h2>How to make NFL player prop bets for Dolphins vs. Jets and Broncos vs. Bengals</h2><p>In addition, the SportsLine Machine Learning Model has revealed several other strong picks, including a five-star pick on one of the biggest names in action on Monday. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">See who it is here</a>.</p><p><strong>Which Bengals vs. Broncos and Jets vs. Dolphins prop bets should you target for Monday Night Football? <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">Visit SportsLine now to see the top  props, all from the SportsLine Machine Learning Model</a>.</strong></p>\n            </div>"
  },
  {
    "title": "Dolphins vs. Jets prediction, odds, start time: 2025 NFL Week 4 Monday Night Football picks from proven model - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-vs-jets-prediction-odds-start-time-2025-nfl-week-4-monday-night-football-picks-from-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/05/c50841a5-6b18-4d32-9078-7e8f5d0ed8ac/thumbnail/1200x675/bb9f2d7c748b84eefafbc3b2d9c652de/tua-imagn-1.jpg",
    "tag": "Sports",
    "date": "2025-09-29T22:45:34.000Z",
    "description": "A two-game 'Monday Night Football' slate in NFL Week 4 begins with the Miami Dolphins hosting the New York Jets. These divisional rivals are both winless on the season, and only one team in league history has...",
    "body": "<div>\n        <p>A two-game 'Monday Night Football' slate in NFL Week 4 begins with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> hosting the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>. These divisional rivals are both winless on the season, and only one team in league history has ever made the postseason after an 0-4 start. Miami (0-3) fell 31-21 to Buffalo in its most recent contest last Thursday, making it 0-3 for the first time since 2019. New York lost 29-27 in Week 3 to Tampa, as the Jets are 0-3 for the fourth time since 2019, which is the most in the NFL over that span. Cornerback and new acquisition Jarvis Brownlee (ankle) and edge Jermaine Johnson (edge) are out for New York.</p><p>Kickoff is at 7:15 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., where the home team has won nine straight meetings with the Jets. Miami is a 2.5-point favorite in the latest Dolphins vs. Jets odds, and the over/under for total points scored is 44. Before making any Jets vs. Dolphins picks, be sure to <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">see what the SportsLine projection model has to say</a>. </p><p><em>New users can also target the <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings promo code</a>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$200 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a><em>:</em></p><p>The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated <a href=\"https://www.sportsline.com/nfl/picks/\" target=\"_blank\">NFL picks</a> since its inception. The model is on a sizzling 39-19 run on top-rated picks dating back to 2024. Anybody following its <a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a> picks at <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a> and on <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">betting sites</a> could have seen strong returns.  </p><p>Now, the model has zeroed in on <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_NYJ@MIA/\" target=\"_blank\">Dolphins vs. Jets</a>. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">You can head to SportsLine now to see its picks.</a> Here are several <a href=\"https://www.cbssports.com/nfl/odds/\" target=\"_blank\">NFL odds</a> and betting lines for Jets vs. Dolphins:</p><table><tbody><tr><td><p>Dolphins vs. Jets spread</p></td><td><p>Dolphins -2.5 at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings Sportsbook</a></p></td></tr><tr><td><p>Dolphins vs. Jets over/under</p></td><td><p>44 points</p></td></tr><tr><td><p>Dolphins vs. Jets money line </p></td><td><p>Dolphins -153, Jets +127</p></td></tr><tr><td><p>Dolphins vs. Jets picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Dolphins vs. Jets streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Jets can cover</h2><p>New York couldn't have asked for a better opponent to see on Monday Night Football as the Dolphins are 1-7 over their last eight primetime games. That includes four straight Miami defeats at home in primetime, and the team has lost five of its last six MNF appearances overall. Also, the mini-bye that Miami is coming off after playing last Thursday doesn't appear to help their chances of covering as the Dolphins are 0-4 against the spread with a rest advantage since the start of 2024.</p><p>The Jets have a potent running attack with a number of talented backs, plus mobility with the quarterback position with Justin Fields cleared from the concussion protocol. The team entered Week 4 ranking in the top 10 in both rushing yards per game and rushing scores, despite <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a> yet to find the end zone in 2025. Than run game should undoubtedly get boosted by the pass game, as that's what Miami's defense tends to do for opponents. The Dolphins are first team since the merger to allow nine total touchdowns and zero turnovers to their opposing starting quarterbacks in each of the team's first three games. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>Why the Dolphins can cover</h2><p>Playing at home has certainly been an advantage for the Dolphins in this series as they've won nine straight home matchups with the Jets. All of them have been by more than the spread of 2.5 points as the Dolphins have a 10.4-point average margin of victory during this run. Additionally, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a> has had success versus his divisional rival no matter where the games have taken place as the quarterback is undefeated in five starts against the Jets, including averaging 277.5 passing yards, a 76% completion rate and a 3:0 TD:INT over his last two versus New York.</p><p>The Dolphins offense has come to life after an eight-point Week 1, particularly the run game, as the team rushed for 130 yards last week versus Buffalo. Miami is averaging 5.4 yards per carry on the year, which ranks fourth in the NFL, while the team ranks No. 1 in third-down conversion percentage and fourth in redzone scoring. That offense can take advantage of deficiencies with the Jets defense, as New York hasn't had a takeaway, ranks in the bottom 10 in run defense and is in the bottom five in scoring defense. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See which team to back at SportsLine</a>. </p><p><em>Check out the latest </em><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/betmgm-promo-code/\"><em>BetMGM promo code</em></a><em> CBSSPORTS, where new users can </em><a target=\"_blank\" href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\"><em>get up to $1,500 in bonus bets if your first bet loses</em></a><em>.</em></p><h2>How to make Jets vs. Dolphins picks</h2><p>For this NFL Week 4 Monday Night Football game of Dolphins vs. Jets, the model is leaning over the total, projecting 50 combined points. It also says one side of the spread hits in almost 60% of simulations. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See what it is at SportsLine</a>.</p><p><strong>Who wins Jets vs. Dolphins, and which side of the spread hits almost 60% of the time? </strong><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\"><strong>Visit SportsLine now to see which side of the Dolphins vs. Jets spread you need to jump, all from the model that is 39-19 on top-rated picks since 2024</strong></a><strong>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Where to watch Jets vs. Dolphins: TV channel, live stream, prediction, pick, odds, spread - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-vs-jets-prediction-which-of-these-afc-east-teams-can-avoid-an-0-4-start-in-prime-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2023/11/24/098b4e27-2e5b-4b9f-a507-1822928a73c1/thumbnail/1200x675/857ab12f9e1e681e8b4bdfc1a7ad3942/tyreek-hill-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-09-29T23:15:33.000Z",
    "description": "Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.                                                    Let's preview...",
    "body": "<div>\n<div>\n    <p>\n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    </p>\n        <div>\n<article>\n    <div>\n                                    <h2>Let's preview and predict Monday night's divisional showdown</h2>\n        <div>\n                                                <div>\n                        <a target=\"_blank\" href=\"https://www.cbssports.com/writers/cody-benjamin/\">\n                        <div>\n    <figure><img alt=\"            Cody Benjamin\n    \" src=\"https://sportshub.cbsistatic.com/i/r/2025/08/26/4aff63bd-23c1-414a-9918-14cc5d8ec4c4/thumbnail/80x80/56242097bea3d20ecdd37090a814aa9e/cody-benjamin700.png\" /></figure>\n                                            </div>\n                    </a>\n                    </div>\n                                            <div>\n                            <p>\n    Sep 29, 2025\n                            <span>\n                    at\n    7:15 pm ET</span>\n                        <span>\n                •\n            </span>\n            <span>4 min read\n            </span>\n        </p>\n    </div>\n</div>\n            </div>\n    <div>\n    <div>\n    <figure><img alt=\"untitled-design-2025-09-19t130614-244.png\" src=\"https://sportshub.cbsistatic.com/i/r/2023/11/24/098b4e27-2e5b-4b9f-a507-1822928a73c1/thumbnail/770x433/ab707ecc7a039ecec01bab0c547686ad/tyreek-hill-usatsi.jpg\" /></figure>\n                    <figcaption>\n                <span>USATSI</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The AFC East got a jolt of electricity on Sunday. Not only did the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/BUF/buffalo-bills/\">Buffalo Bills</a> advance to a perfect 4-0 record with a win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NO/new-orleans-saints/\">New Orleans Saints</a>, but the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NE/new-england-patriots/\">New England Patriots</a> also turned in their most convincing performance of the 2025 season. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/26695757/drake-maye/\">Drake Maye</a> tossed two scores, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2866110/marcus-jones/\">Marcus Jones</a> returned a punt 87 yards for another, and Mike Vrabel's squad ran away with a 42-13 victory to secure a second-place spot in the division.</p><p>Now it's time to see if one more AFC East club can make some noise, with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a> visiting the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> in the first of two \"Monday Night Football\" matchups to close out Week 4. The Jets couldn't hold on to beat the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/TB/tampa-bay-buccaneers/\">Tampa Bay Buccaneers</a> last week, but they've got <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1273205/justin-fields/\">Justin Fields</a> back under center after the quarterback cleared concussion protocol. The Dolphins, meanwhile, are hoping their own signal-caller, the embattled <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a>, can finally translate news-conference bravado to late-game stability.</p><p>Which desperate franchise is due for victory on Monday night? Only time will tell, but this matchup is must-see TV. We've got everything you need to know right here, including how to tune in and which players to monitor.</p><p><strong>LIVE updates: </strong><a href=\"https://www.cbssports.com/nfl/news/jets-vs-dolphins-live-updates-score-analysis-highlights-for-battle-of-winless-teams-on-monday-night/live/\" target=\"_blank\"><strong>Follow along with all the action as the Jets battle the Dolphins in a \"Monday Night Football\" doubleheader.</strong></a></p><h2>Where to watch Dolphins vs. Jets live </h2><ul><li><strong>Date: </strong>Monday, Sept. 29 | <strong>Time:</strong> 7:15 p.m. ET</li><li><strong>Location: </strong>Hard Rock Stadium (Miami Gardens, Florida)</li><li><strong>TV: </strong>ESPN | <strong>Stream: </strong><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</li><li><strong>Follow: </strong><a href=\"https://apps.apple.com/us/app/cbs-sports-app-scores-news/id307184892\" target=\"_blank\">CBS Sports App</a></li><li><strong>Odds:</strong> Dolphins -2.5; O/U 44.5 (via <a href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\" target=\"_blank\">DraftKings Sportsbook</a>)<br /></li></ul><p><em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">Bet Dolphins vs. Jets at DraftKings Sportsbook</a>, where new users get $200 in bonus bets and over $200 off NFL Sunday Ticket.</em></p>\n<h2>Key questions</h2><figure><p><img alt=\"imagn-justin-fields-jets-pregame.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/07/fe8f1206-f95b-4db5-97d1-a45a75ad2b1b/resize/670x377/d38aa5dc7a0e23b58d2e0a3103a11b3f/imagn-justin-fields-jets-pregame.jpg\" /></p><figcaption><span>\n                                                                    Imagn Images\n                                                            </span></figcaption></figure><ul><li><strong>How will Justin Fields manage his return to the field? </strong>Absent for one game due to a concussion, Fields brings much more dynamism as a rusher than fill-in <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1243338/tyrod-taylor/\">Tyrod Taylor</a>, but he remains something of an erratic evaluation when it comes to throwing the ball. He might be a little less inclined to take off on the ground given his recent injury, but then again, maybe he'll lean even more into his legs to ease back into action, considering the run game is his strong suit. Either way, his athleticism figures to give New York some offensive lift.</li><li><strong>Can <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a> finally break out? </strong>The Jets running back is still searching for his first 20-yard carry of the season, averaging a career-low 4.1 yards per carry out of New York's backfield. But this could be just the matchup he needs to break loose: Not only is Fields back under center, giving the Jets a legitimate threat to scramble for a big gain, but the Dolphins are giving up an average of 145 rushing yards per game, which ranks 29th in the entire <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a>. If he finds open space in this one, it could go a long way in powering an upset.</li><li><strong>Does Tua Tagovailoa have what it takes to finish strong? </strong>This season hasn't been a total failure for Miami's quarterback, who hit more than 80% of his pass attempts against the Patriots in Week 3. It's just been an abjectly disappointing season in terms of crunch-time reliability, with Tagovailoa already up to five turnovers on the year, with a slew of them coming late in the game. Fortunately for Dolphins fans, the Jets defense hasn't exactly been a juggernaut, either, giving up an average of 31 points per game during their 0-3 start.</li></ul><h2>X factor to watch</h2>\n<p>Tagovailoa and coach Mike McDaniel are under pressure to come up big when it matters most for Miami's offense, but lost in the understandable criticism of the two biggest decision-makers is the young Achane, who's made the most of his touches as one of the Dolphins' most electric multipurpose weapons. His size dictates he may never warrant a full workload as a ball carrier, but he's averaging almost 8 yards per catch as a steadily involved receiver, tying <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a> for the team lead in total targets (23). He's as capable as anyone of exploding for six.</p><h2>Dolphins vs. Jets prediction, pick</h2>\n<p>It's not a surprise the Dolphins are favored, if ever so slightly, in this battle of ailing AFC East teams. Not because they're at home, but because they're probably even more desperate to claim their first win of 2024. This is a group that not long ago boasted one of the league's most high-octane offenses en route to playoff appearances, after all. Then again, maybe that was a long time ago, at least in NFL years. Because the Tagovailoa-McDaniel combo seems to grow more averse to clutch decision-making each week.</p><p>The Jets aren't exactly a beacon of stability, either, struggling to dominate defensively despite Aaron Glenn's oversight and all but digging their own hole with emergency quarterback Tyrod Taylor a week ago. Fields' return may or may not represent an actual boost for their passing attack, considering he's functioned much better as a rushing playmaker than steady passer. But we should remember Fields turned in a truly promising dual-threat showing when faced with a so-so defense in the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/PIT/pittsburgh-steelers/\">Pittsburgh Steelers</a> back in Week 1.</p><p>We tend to think he'll find plenty of green grass operating against the Dolphins' defense this time around. And even if Tagovailoa feeds Achane, Hill and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2962110/jaylen-waddle/\">Jaylen Waddle</a> to keep pace on the scoreboard, pressure has tended to squeeze rather than elevate this Miami group before. Give us the J-E-T-S in a nail-biter. </p>\n<p><strong>Pick: Jets 24, Dolphins 22 | <em>Jets +2.5, Over 44.5</em></strong></p>\n            </div>\n    </div>\n</article>\n        </div>\n    </div>\n                        </div>"
  },
  {
    "title": "Dolphins wearing new dark water 'Rivalries' uniform on 'Monday Night Football' vs. Jets - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-set-to-wear-these-splashy-new-rivalries-uniforms-on-monday-night-football-vs-jets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/703dc55e-22de-453f-b6ba-6c266d142f65/thumbnail/1200x675/a01188621bc1bbbf5fc1dd5d400cb9a0/tua-tagovailoa.jpg",
    "tag": "Sports",
    "date": "2025-09-29T23:09:56.000Z",
    "description": "When the Miami Dolphins take the field on Monday night, the team will be wearing a new uniform it has never worn before.The uniforms were unveiled back in August as part of the NFL's \"Rivalries\" program. The...",
    "body": "<div>\n        <p>When the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> take the field on Monday night, the team will be wearing a new uniform it has never worn before.</p><p>The uniforms <span><a href=\"https://www.cbssports.com/nfl/news/look-nfl-unveils-rivalries-uniforms-as-afc-east-nfc-west-teams-debut-new-alternate-looks-for-2025-season/\" target=\"_blank\">were unveiled back in August</a></span> as part of the <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL's</a> \"Rivalries\" program. The Dolphins were one of eight teams to get a \"Rivalries\" uniform for 2025, and they'll be the second team to debut the new look. (The <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/ARI/arizona-cardinals/\">Cardinals</a> showed off their new desert-themed uniforms on Thursday.)</p><p><strong>LIVE updates: </strong><a href=\"https://www.cbssports.com/nfl/news/jets-vs-dolphins-live-updates-score-analysis-highlights-for-battle-of-winless-teams-on-monday-night/live/\" target=\"_blank\"><strong>Follow along with all the action as the Jets battle the Dolphins in a \"Monday Night Football\" doubleheader.</strong></a></p><p>The plan behind the \"Rivalries\" program was to design a uniform based on a theme that's local to each team. With the Dolphins being located in South Florida, the team decided to create a \"dark water\" jersey and helmet combination. </p>\n<p>Although the uniforms appear to be black, they ARE NOT quite that dark. According to the team, the <a href=\"https://www.palmbeachpost.com/story/sports/nfl/dolphins/2025/08/28/dolphins-rivalry-jerseys-vote-best-nfl-uniforms/85866241007/\" target=\"_blank\">official color</a> here is \"Dark pitch blue,\" so yes, that means the jersey and helmet are both a very dark shade of blue. </p><p>The Dolphins are wearing the uniforms for the first time in their Monday night game against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>, which kicks off at 7:15 p.m. ET on ESPN. You can see a few more photos of the uniform and helmet below. </p>\n<p>Even the cheerleaders got new uniforms for the game. </p>\n<p>The Dolphins <a href=\"https://www.miamidolphins.com/rivalries/\" target=\"_blank\">teamed up with Nike</a> to create the new uniform with a design that is \"unlike any before, featuring dark aquatic tones made to represent a team who hunts in dark waters. Complete with orange accents and sleek dark blue touches throughout.\"</p>\n<p>With the Monday game being played in Miami, the Dolphins will be celebrating their new uniform by giving their field a new look. The end zones will be painted dark pitch blue while the lettering in each end zone will feature aqua letters with orange accents. </p>\n<p>In the photo below, you can get a better look of both the end zone and the midfield logo. </p>\n<p>The Dolphins are one of eight teams that will be participating in the \"Rivalries\" program this year. This program <span><a href=\"https://www.cbssports.com/nfl/news/nfl-uniform-announcement-league-to-unveil-rivalries-jerseys-beginning-in-2025/\" target=\"_blank\">was announced DURING</a></span> the 2025 <a target=\"_blank\" href=\"https://cbssports.com/nfl/draft/\">NFL Draft</a> back in April, so a lot of people missed the initial announcement. </p>\n<p>Over the next four seasons, one NFC division and one AFC division per year will get to debut a new \"Rivalries\" uniform, so not every team got a new uniform this year. </p><p>Here's when each division will be getting their \"Rivalries\" uniform: </p><ul><li><strong>2025:</strong> AFC East and NFC West (See <span><a href=\"https://www.cbssports.com/nfl/news/look-nfl-unveils-rivalries-uniforms-as-afc-east-nfc-west-teams-debut-new-alternate-looks-for-2025-season/\" target=\"_blank\">all the 2025 uniforms here</a></span>)</li><li><strong>2026: </strong>AFC South and NFC North</li><li><strong>2027:</strong> AFC West and NFC East</li><li><strong>2028:</strong> AFC North and NFC South</li></ul><p>After the Dolphins wear their new uniform on Monday night, we'll be getting another \"Rivalries\" uniform game in Week 5 when the Buffalo Bills show off their new look. </p><p>Here's the the full \"Rivalries\" schedule for 2025 (The team listed first will be wearing their \"Rivalries\" uniform):</p>\n<ul><li><strong>Week 4: </strong>Cardinals vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SEA/seattle-seahawks/\">Seahawks</a> (Thursday, Sept. 25 -- <span><a href=\"https://www.cbssports.com/nfl/news/nfls-new-rivalries-uniforms-cardinals-set-to-debut-new-desert-themed-look-on-thursday-night/\" target=\"_blank\">See photos here</a></span>)</li><li><strong>Week 4: </strong>Dolphins vs. Jets (Monday, Sept. 29)</li><li><strong>Week 5: </strong><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/BUF/buffalo-bills/\">Bills</a> vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NE/new-england-patriots/\">Patriots</a> (Sunday, Oct. 5)</li><li><strong>Week 11: </strong>Patriots vs. Jets (Thursday, Nov. 13))</li><li><strong>Week 11: </strong><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAR/los-angeles-rams/\">Rams</a> vs. Seahawks (Sunday, Nov. 16)</li><li><strong>Week 14: </strong>Jets vs. Dolphins (Sunday, Dec. 7)</li><li><strong>Week 16: </strong>Seahawks vs. Rams (Thursday, Dec. 18)</li><li><strong>Week 18: </strong><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SF/san-francisco-49ers/\">49ers</a> vs. Seahawks (Jan. 3 or Jan. 4)</li></ul><p>The <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> <span><a href=\"https://www.cbssports.com/nfl/news/nfl-updates-uniform-policy-allows-teams-to-wear-throwback-or-alternate-jerseys-more-than-ever-before/\" target=\"_blank\">approved a new rule</a></span> in April that will allow each team to wear an alternate uniform in four different games, which is up from three. That means that any team with multiple alternate or throwback uniforms will now have an extra opportunity to wear those during the regular season. The \"Rivalries\" uniforms will only be worn once this season by each team. </p>\n            </div>"
  },
  {
    "title": "Tigers vs. Guardians prediction, odds, start time: 2025 MLB picks, best bets for AL Wild Card Game 1 by model - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/tigers-vs-guardians-prediction-odds-start-time-2025-mlb-picks-best-bets-for-al-wild-card-game-1-by-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/21/cb809fd0-cfa3-4206-9b98-26329d8524dc/thumbnail/1200x675/26f5676786b301ec30a7b0f47cd7208e/tigers-imagn.png",
    "tag": "Sports",
    "date": "2025-09-30T00:24:02.000Z",
    "description": "SportsLine's model simulated Detroit vs. Cleveland 10,000 times and revealed its MLB picks for Tuesday afternoon's American League Wild Card Game 1 matchup at Progressive Field in Cleveland",
    "body": "<div>\n        <p>After battling to the last day of the regular season, American League Central rivals clash when the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/DET/detroit-tigers/\">Detroit Tigers</a> meet the division-winning <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/CLE/cleveland-guardians/\">Cleveland Guardians</a> in Game 1 of the Wild Card round on Tuesday. Cleveland had trailed Detroit by as many as 15.5 games in July before making up all the ground and winning the division by one game. The Tigers (87-75), who went just 2-8 down the stretch, are 41-40 on the road this season. The Guardians (88-74), who won seven of 10, are 45-36 on their home field in 2025.</p><p>First pitch from Progressive Field in Cleveland is set for 1:08 p.m. ET. The all-time series is tied 1,166-1,166, with Cleveland winning eight of 13 games during the regular season. Detroit is a -166 favorite on the money line (risk $166 to win $100) in the latest Tigers vs. Guardians odds from <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings Sportsbook</a>, while the total number of runs Vegas thinks will be scored, or the over-under, is 6. Before making any Tigers vs. Guardians picks, be sure to <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">see the MLB predictions and betting advice from SportsLine's proven computer model</a>. </p><p><em>New users can also target the </em><span><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$200 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a><em>:</em></p><p>The SportsLine Projection Model simulates every MLB game 10,000 times. It entered the final weeks of the 2025 MLB regular season a profitable 34-28 on top-rated MLB money-line picks. It has excelled making home run prop picks this season, returning more than 25 units of profit. Anybody following its <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/mlb/\" target=\"_blank\">MLB betting</a> picks at <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a> and on <a href=\"https://www.cbssports.com/www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">betting sites</a> could have seen strong returns.</p><p>Now, the model has set its sights on <a href=\"https://www.sportsline.com/mlb/game-forecast/MLB_20250930_DET@CLE/\" target=\"_blank\">Tigers vs. Guardians</a> and just locked in its picks and MLB predictions. <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">You can head to SportsLine now to see the model's picks</a>. Here are several <a href=\"https://www.sportsline.com/mlb/odds/\" target=\"_blank\">MLB odds</a> and betting lines for Guardians vs. Tigers:</p><table><tbody><tr><td><p>Tigers vs. Guardians     money line</p></td><td><p>Detroit -166, Cleveland +139 at DraftKings Sportsbook</p></td></tr><tr><td><p>Tigers vs. Guardians     over/under</p></td><td><p>6 runs</p></td></tr><tr><td><p>Tigers vs. Guardians     run line </p></td><td><p>Detroit -1.5 (+117)</p></td></tr><tr><td><p>Tigers vs. Guardians     picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Tigers vs. Guardians     streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Tigers can win</h2><p>Left-hander <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/3126008/tarik-skubal/\">Tarik Skubal</a> (13-6, 2.21 ERA) will get the start for Detroit. In 31 games, all starts, the team's ace has allowed 141 hits, 48 earned runs and 33 walks with 241 strikeouts in 195.1 innings. In his last two starts against the Guardians, he has allowed just 11 hits, four runs – two earned – and five walks with 17 strikeouts in 12 innings of work. In their Sept. 23 meeting, he took the loss despite allowing just one earned run on four hits in six innings. He walked three and struck out eight.</p><p>Left fielder <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/3117537/riley-greene/\">Riley Greene</a> helps power the offense. In 157 games played, he batted .258 with 31 doubles, one triple, 36 home runs and 111 RBI. In Detroit's last series at Cleveland Sept. 23-25, Greene went 4-for-10 with two home runs and two runs scored. He was 2-for-4 with an RBI in a 6-2 loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/ATL/atlanta-braves/\">Atlanta Braves</a> on Sept. 21. <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">See which team to back at SportsLine</a>.</p>\n<h2>Why the Guardians can win</h2><p>Cleveland is expected to send right-hander <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2837689/gavin-williams/\">Gavin Williams</a> (12-5, 3.06 ERA) to the mound. Williams' last two decisions came against the Tigers in the waning weeks of the regular season. In a 5-2 win over the Tigers on Sept. 23, he pitched six innings, allowing four hits, two earned runs, two walks and 12 strikeouts. He went five innings in a 4-0 win at Detroit on Sept. 17, allowing three hits, no runs and two walks with nine strikeouts. In 31 starts this season, he allowed 130 hits, 57 earned runs and 152 walks with 333 strikeouts.</p><p>Among the Guardians' top hitters is left fielder <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2932861/steven-kwan/\">Steven Kwan</a>. In 156 games played, he hit .272 with 29 doubles, one triple, 55 walks and 21 stolen bases. He hit .308 against the Tigers this season with five doubles and five RBI. In the Sept. 23 win over Detroit, he was 2-for-4 with a double. <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>How to make Tigers vs. Guardians picks</h2><p>SportsLine's model is leaning Over on the total, and it says one side of the money line has all the value. <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">You can head to SportsLine to see the model's MLB picks</a>. </p><p><strong>So who wins Tigers vs. Guardians, and which side of the money line has all the value? <a href=\"https://www.sportsline.com/insiders/tigers-vs-guardians-odds-line-start-time-picks-best-bets-for-al-wild-card-game-1-matchup-from-proven-model/#ttag=09302025_agg_cbssports_picks_baseball_mlb_model_TigersGuardians\" target=\"_blank\">Visit SportsLine now to see which side you need to jump on, all from the model that has crushed its MLB picks</a>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Week 4 NFL player props, MNF predictions, odds: Top Dolphins vs. Jets, Broncos vs. Bengals picks - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-4-nfl-player-props-mnf-predictions-odds-top-dolphins-vs-jets-broncos-vs-bengals-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/05/9986d537-8f7d-4e90-98c6-deafe5b4e5bf/thumbnail/1200x675/94250076d4e9ace1de3bf40997b780d7/bo-nix-broncos-imagn.jpg",
    "tag": "Sports",
    "date": "2025-09-29T21:08:06.000Z",
    "description": "NFL player props continue to grow in popularity with bettors and a double-dose of Monday Night Football opens up the possibilities for building NFL same-game parlays and SGPx tickets in Week 4. Dolphins vs....",
    "body": "<div>\n        <p>NFL player props continue to grow in popularity with bettors and a double-dose of Monday Night Football opens up the possibilities for building NFL same-game parlays and SGPx tickets in Week 4. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Dolphins</a> vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">Jets</a> kicks off at 7:15 p.m. ET, and then <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DEN/denver-broncos/\">Broncos</a> vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/CIN/cincinnati-bengals/\">Bengals</a> begins at 8:15 p.m. ET, and the wide receiver play should be strong in both games. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123864/garrett-wilson/\">Garrett Wilson</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2218461/courtland-sutton/\">Courtland Sutton</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2966320/jamarr-chase/\">Ja'Marr Chase</a> are all bona fide No. 1 options, and they're sure to attract a lot of attention in Monday Night Football player props.</p><p>Meanwhile, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3121193/bo-nix/\">Bo Nix</a> has a juicy matchup against a struggling Cincinnati pass defense, and over 1.5 passing touchdowns for the second-year QB is one of our top NFL prop picks. Nix and the Broncos are favored by 7.5 points, according to the latest NFL odds, and the over/under for Broncos vs. Bengals is 44.5. With NFL props available for almost every player in every game at <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a>, SportsLine's proven computer model can help you find value to add to your Jets vs. Dolphins and Bengals vs. Broncos picks. They can also help new users take advantage of <a href=\"https://www.cbssports.com/betting/news/sportsbook-promos/\" target=\"_blank\">sportsbook promos</a> like the latest <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\">FanDuel Sportsbook</a>, which offers new users <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">$300 in bonus bets if your first $5 bet wins</a>:</p><p>The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated <a href=\"https://www.sportsline.com/nfl/picks/\" target=\"_blank\">NFL picks</a> since its inception. The model went 39-19 on top-rated picks in 2024. Anybody following its <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> picks at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">sportsbooks</a> and on <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">betting sites</a> could have seen strong returns. Now, the model has revealed its top Dolphins vs. Jets or Broncos vs. Bengals NFL player prop picks: </p><p><strong>Best Monday Night Football player prop picks for Week 4:<br /></strong></p><ul><li>Bo Nix, Broncos, Over 1.5 passing touchdowns (+105)</li><li><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3171161/devon-achane/\">De'Von Achane</a>, Dolphins, anytime touchdown scorer (-115)</li><li>Courtland Sutton, Broncos, Over 62.5 receiving yards (-114)</li><li>Parlay these picks for +619 odds at <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">DraftKings</a> (odds subject to change), where new users get <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">over $200 off NFL Sunday Ticket and $200 in bonus bets</a>:</li></ul><h2>Bo Nix, Broncos, Over 1.5 passing touchdowns (+105)</h2><p>His sophomore season in the NFL is off to a sluggish start, but this could be the matchup to kick-start things for Nix. The Bengals ranked 25th in pass defense entering Week 4 and have already surrendered six passing touchdowns on the season. Meanwhile, Nix might have only thrown for 535 yards over the first three weeks, but he has thrown five touchdown passes overall and has thrown for multiple TDs in 11 of his 20 career regular-season starts. <strong>The model predicts that the throws for 2.34 touchdowns on average</strong>, making plus money here a stellar deal.</p><h2>De'Von Achane, Dolphins, anytime touchdown scorer (-115)</h2><p>Achane has scored in two of three games to start the season despite Miami's struggles, and he's now up to 25 career touchdowns in 31 games. What's even better than the bulk for betting a running back is the balance, as 14 of his scores have come on the ground and 11 have come through the air. He's one of few running backs who score a large chunk of their team's touchdowns in the league who are unlikely to be phased out based on the game script. <strong>The model predicts that he scores 0.86 touchdowns on average</strong>, yet these odds suggest he scores only 53% of the time.</p><h2>Courtland Sutton, Broncos, Over 62.5 receiving yards (-114)</h2><p>Sutton had a strange performance against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/IND/indianapolis-colts/\">Colts</a> in Week 2, where he was only targeted four times and finished with one catch for six yards. That feels fluky considering he was targeted nine times in Week 1 and finished with six catches for 61 yards and a score, then was targeted eight times and had six catches for 118 yards and another touchdown in Week 3. Since Nix took over as the starter, he's averaging 63.3 yards per game, and a bad Cincinnati pass defense is a big reason why <strong>the model is projecting that he averages 67 yards</strong>.</p><h2>Want more Week 4 Monday Night Football picks?</h2><p><strong>You've seen the model's <a target=\"_blank\" href=\"https://cbssports.com/nfl/picks/experts/\">NFL picks</a> for Jets vs. Dolphins and Bengals vs. Broncos player props for Week 4. Now, <a href=\"https://www.sportsline.com/nfl/picks/#ttag=09292025_agg_cbssports_picks_football_NFL_model_Week4MNFplayerpropsFREE\" target=\"_blank\">get NFL Week 4 projections for every player prop at SportsLine</a>.</strong></p><p><strong>Also at SportsLine:</strong></p><p>SportsLine expert R.J. White, who is 31-22 on his last 53 NFL picks, has revealed his best bets for both Monday Night Football games. <a href=\"https://www.sportsline.com/experts/14890/rj-white/?league=nfl#ttag=09292025_agg_cbssports_picks_football_NFL_model_Week4MNFplayerpropsFREE\" target=\"_blank\">You can find them here.</a></p>\n            </div>"
  },
  {
    "title": "Brock Purdy injury: 49ers QB felt toe soreness after loss to Jaguars; status for Week 5 vs. Rams up in the air - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brock-purdy-injury-49ers-qb-felt-toe-soreness-after-loss-to-jaguars-status-for-week-5-vs-rams-up-in-the-air/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/d2a048dd-b3ec-4f70-be8f-cd5a0c5ae9c0/thumbnail/1200x675/eb0ebbda3c1eead058930b21593d86ab/untitled-design-9.png",
    "tag": "Sports",
    "date": "2025-09-29T22:08:22.000Z",
    "description": "49ers quarterback Brock Purdy felt soreness in his toe following a 26-21 loss to the Jacksonville Jaguars on Sunday, and his status for Week 5 against the Los Angeles Rams on Thursday is up in the air. Purdy...",
    "body": "<div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SF/san-francisco-49ers/\">49ers</a> quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2961306/brock-purdy/\">Brock Purdy</a> felt soreness in his toe following a 26-21 loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/JAC/jacksonville-jaguars/\">Jacksonville Jaguars</a> on Sunday, and his status for Week 5 against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAR/los-angeles-rams/\">Los Angeles Rams</a> on Thursday is up in the air. Purdy missed Weeks 2 and 3 because of a turf toe injury and returned to the lineup Sunday for the first time since Week 1. </p><p>49ers coach Kyle Shanahan said Purdy would be further evaluated later Monday. Purdy was listed as a non-participant on the team's estimated injury report</p><p>\"Hopefully we'll find out more later today, but any time guys are sore and hurting on a Monday, you usually don't stress too much about it,\" <a href=\"https://www.espn.com/nfl/story/_/id/46423038/49ers-qb-brock-purdy-status-again-air-due-tore-soreness\" target=\"_blank\">Shanahan said.</a> \"But anytime you have a Thursday game, it's a totally different element. So, I'm concerned with anybody who's not totally healthy at this moment, but we'll have to get more information on that later today to really have a clue of what to speculate.\"</p><p>Purdy finished 22 of 28 for 309 yards with two touchdowns and two interceptions in the loss. Immediately after the game, Purdy told reporters that his toe didn't bother him and he \"felt good\" throughout the game.</p>\n<p>\"I think just getting back out there and throwing and getting into a rhythm, being down two weeks, coming back and feeling out my body and everything, obviously how my toe feels,\" Purdy said. \"Honestly, I don't know the answer to that. But obviously I'm going to watch this film, look at my mechanics and be real with myself and try to fix that.\"</p><a href=\"https://www.cbssports.com/nfl/news/robert-saleh-and-liam-coen-have-heated-exchange-following-jaguars-upset-win-over-49ers/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>'I will f--- your world up': Robert Saleh to Liam Coen in heated exchange after Jaguars' win over 49ers</p>\n                <p>\n                    Jordan Dajani                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"'I will f--- your world up': Robert Saleh to Liam Coen in heated exchange after Jaguars' win over 49ers\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/077ea7b4-bd14-4e7a-80a4-e4b15243a626/thumbnail/270x152/d7ca446f32082ae79fc940ed2f321f3c/untitled-design-2025-09-28t234625-814.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>If Purdy doesn't play in Week 5, backup quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741202/mac-jones/\">Mac Jones</a> would likely get his third start of the season. Jones (knee) was dealing with an injury himself following his team's Week 3 16-15 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/ARI/arizona-cardinals/\">Arizona Cardinals</a>. Despite being limited in practice last week, Jones was active against Jacksonville.</p><h2>49ers could also be without their top wide receivers</h2><p>Purdy isn't the only player on offense who could be questionable for this week's game against Los Angeles. 49ers wide receivers <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3122949/ricky-pearsall/\">Ricky Pearsall</a> (knee) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2180514/jauan-jennings/\">Jauan Jennings</a> (ribs) also dealt with injuries during the loss to the Jaguars. Pearsall injured his knee after attempting to make a catch on the sideline, while Jennings was drilled while catching a two-point conversion in the second half.</p>\n<p>Like Purdy, both Pearsall and Jennings were listed as non-participants on Monday's estimated injury report. </p><p>Pearsall was dealing with a knee injury throughout last week and was limited in practice. Pearsall went back into the game for one play after suffering the injury, but didn't return after taking himself out of the game.</p><p>\"I was testing out my knee,\" Pearsall said. \"I fell pretty hard on that play on the sideline, trying to keep my feet in bounds, and I fell pretty hard on my knee. I was just feeling pain and a little bit of instability. I wasn't trying to mess with it.\"</p>\n<p>The 49ers are already without star tight end <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2818265/george-kittle/\">George Kittle</a>, who landed on injured reserve following his team's Week 1 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SEA/seattle-seahawks/\">Seahawks</a>. The Rams opened as a 3.5-point favorite against their NFC West rival (per <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\">FanDuel</a>. As of Monday afternoon, the line jumped to 5.5.</p>\n            </div>"
  },
  {
    "title": "Arkansas football coaching search 2025: Candidates, hot board, names to watch from Razorbacks experts - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arkansas-football-coaching-search-2025-candidates-hot-board-names-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/10faee34-be9e-48fc-b1b0-50e631771b7f/thumbnail/1200x675/32f2d4a88282e7e86a2c326b540c2582/jon-sumrall-tulane-green-wave-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-09-29T21:21:17.000Z",
    "description": "The Arkansas Razorbacks became the latest program to make a move on Sunday when they fired head coach Sam Pittman. He finishes his time in Fayetteville with a 32-34 record overall, but just a 14-29 mark in...",
    "body": "<div>\n        <p>The Arkansas Razorbacks became the latest program to make a move on Sunday when they fired head coach Sam Pittman. He finishes his time in Fayetteville with a 32-34 record overall, but just a 14-29 mark in the SEC. The Razorbacks clearly overachieved early in his tenure, especially during a 9-4 campaign with an Outback Bowl win in 2021, but have been unable to remain relevant in the SEC the past few seasons despite regularly playing opponents tough.</p><p>Now the Arkansas football coaching search begins, and the Razorbacks have at least a couple months to find their next full-time head coach as Bobby Petrino leads them in the interim. If you love the Razorbacks, or just want to know who will be calling the shots for Arkansas in the future, be sure to <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">see what the proven team of experts are saying at HawgSports, the 247Sports affiliate that covers Arkansas</a>.</p><p>No one covers Arkansas's coaching search like HawgSports, the market leader in Razorbacks athletics coverage. With a trusted team of insiders — Trey Biddy, Danny West, and Connor Goodson — HawgSports delivers unmatched daily updates, recruiting/portal scoop, and team news. Fans rely on the site's deep knowledge of the program and its relentless commitment to keeping them informed. Join the conversation and experience the power of the HawgSports community. Right now, get <a target=\"_blank\" href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\">two months of VIP access for just $1</a> and unlock all the insider content and features today.</p><p>The team at HawgSports already has a list out of several potential candidates and there are some surprising names on the list. <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">Head to HawgSports now to see them all</a>.</p>\n<h2>Top Arkansas football coach candidates</h2><p>One name the staff has identified as a potential target on the Arkansas football coaching hot board is Tulane head coach Jon Sumrall. He's done nothing but win at the collegiate level, going 23-4 in two years at Troy, and now he's off to a 13-6 start at Tulane since taking over in 2023. </p><p>He's expected to be a popular name this coaching search cycle, and it's possible that Arkansas could get outbid, but he's somebody the Hawgs will certainly be taking a long look at. </p><p>\"He has no known ties to Arkansas, but sources indicate he is very interested in the position,\" said Trey Biddy of HawgSports. \"He has coached in the SEC footprint, spending time at Kentucky (his alma mater), Ole Miss, Tulane (in Louisiana) and Troy (in Alabama). Before landing the Troy job, he was co-defensive coordinator at Kentucky under Mark Stoops. Tulane is 4-1 this season with the lone loss to Ole Miss.\" <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">See more candidates at HawgSports</a>.</p>\n<h2>How to get insider Arkansas coaching search updates </h2><p>The rest of the list includes several other exciting possibilities, including multiple current and former SEC head coaches. <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">You can only see who they are at HawgSports</a>.</p><p><strong>Who are the top names in the Arkansas football coaching search, and which SEC coaches could be in the mix? <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">Go to HawgSports to see their Arkansas coaching hot board and more, all from a team of reporters with extensive experience covering the Razorbacks</a>, and find out. </strong></p><p><strong>And remember, HawgSports is offering two months of VIP membership for $1 as a coaching search special, so <a href=\"https://secure.247sports.com/college/arkansas/join/#ttag=09232025_agg_cbssports_247_Arkansasfootballsearch\" target=\"_blank\">subscribe now before it's too late</a>.</strong></p>\n<p><strong><em>*Terms:</em></strong><em> This offer is only available for new members who sign up for an annual subscription to HawgSports. After the first year, subscription will re-bill on an annual basis at the regular rate. 247Sports.com reserves the right to alter or cancel this promotion at any time. Please write support@247sports.com with any questions you may have.</em></p>\n            </div>"
  },
  {
    "title": "Best sportsbook promos for Monday Night Football: Betting promos for Jets-Dolphins, Broncos-Bengals - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-sportsbook-promos-for-monday-night-football-betting-promos-for-jets-dolphins-broncos-bengals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/18/4c8a86ae-1b7c-4861-8277-4d9ce51ac747/thumbnail/1200x675/015620519790b0c2c6b1d15172f2551b/zac-taylor-cincinnati-bengals-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-09-29T21:29:19.000Z",
    "description": "It's a special Monday Night Football doubleheader for Week 4 of the 2025 NFL season as the New York Jets visit the Miami Dolphins and the Cincinnati Bengals visit the Denver Broncos. The Dolphins are...",
    "body": "<div>\n        <p>It's a special Monday Night Football doubleheader for Week 4 of the 2025 NFL season as the New York Jets visit the Miami Dolphins and the Cincinnati Bengals visit the Denver Broncos. The Dolphins are 2.5-point home favorites with an over/under of 44 points, while the Broncos are 7.5-point favorites at home with the total listed at 44.5 points. Broncos wide receiver Marvin Mims Jr. is listed as questionable for tonight's contest. With promotions such as profit boosts, no sweat bets, jackpot prizes, and more, you'll want to compare some of the top online <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/sportsbook-promos/\">sportsbook promos</a> before you place any Week 4 NFL picks. </p><h2>Here are the best sportsbook promos you can get for Monday Night Football</h2><p>DraftKings is offering over $200 off on NFL Sunday Ticket as well as $200 in bonus bets instantly, while FanDuel is providing new users $300 in bonus bets if their first bet of $5 or more wins. Claim those sportsbook promos or any of the other offers available before <a target=\"_blank\" href=\"https://www.cbssports.com/betting/\">betting</a> Jets vs. Dolphins and Bengals vs. Broncos, or any other NFL matchup.   </p><h2>Where to bet on Jets-Dolphins, Bengals-Broncos</h2><table><tbody><tr><td><strong>Brand</strong></td><td><strong>Promo</strong></td><td><strong>CBS promo code </strong></td></tr><tr><td>DraftKings</td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">Bet $5, get   $200 in bonus bets instantly + over $200 off NFL Sunday Ticket</a></td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">Just click here</a></td></tr><tr><td>BetMGM</td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\" target=\"_blank\">Up to $1,500 in bonus bets if your first   bet loses</a></td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\" target=\"_blank\">CBSSPORTS</a></td></tr><tr><td>Caesars</td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=caesars&c=sport\" target=\"_blank\">Bet $1,   double your winnings your next 20 bets</a></td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=caesars&c=sport\" target=\"_blank\">CBS20X</a></td></tr><tr><td>FanDuel</td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">Bet $5, get $300 in bonus bets if your bet   wins</a></td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">Just click here</a></td></tr><tr><td>Fanatics</td><td>      <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanatics&c=sport\" target=\"_blank\">Get $100 in   FanCash plus a $100 No Sweat Bet in FanCash on every Game Day  </a></td><td><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanatics&c=sport\" target=\"_blank\">Just click here</a>      </td></tr></tbody></table><p><br />For more information on these sportsbook promos, check out our <span><a href=\"https://www.cbssports.com/betting/news/sportsbook-promos/\" target=\"_blank\">sportsbook promos page</a></span>.</p><h2>DraftKings promotions for Monday Night Football in Week 4</h2><p><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">DraftKings</a> customers have access to multiple NFL promotions for Week 4 MNF betting:</p><ul><li>MNF SGP(x) Boost</li><li>NFL Parlay Boost (good for use on Parlay, SGP, SGPx) (parlay boost % varies)</li></ul><h2>FanDuel promotions for Monday Night Football in Week 4</h2><p><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">FanDuel</a> promotions for Week 4 MNF betting include:</p><ul><li>NFL Choose Your Own Reward: One 50% profit boost or two 30% profit boosts </li></ul><h2>BetMGM promotions for Monday Night Football in Week 4</h2><p><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\" target=\"_blank\">BetMGM</a> is offering the following promos for Week 4 MNF betting:</p><ul><li>Pro Football Boost Pack Profit Boosts (33% NFL Profit Boosts)</li><li>Cash back for the second TD scorer</li></ul><h2>Caesars promotions for Monday Night Football in Week 4</h2><p>Customers at <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=caesars&c=sport\" target=\"_blank\">Caesars</a> have access to these promos for Week 4 Monday Night Football betting:</p><ul><li>Million Dollar Parlay Payday (Win a share of $50K in bonus bets for hitting a +5000 parlay or greater)</li><li>$50,000 50 Burger (Win a share of $50K if your team scores 50+ points)</li></ul><h2>Fanatics odds boosts for Monday Night Football in Week 4</h2><p>With <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanatics&c=sport\" target=\"_blank\">Fanatics</a>, you can use promos for Jets vs. Dolphins, Bengals vs. Broncos betting:</p><ul><li>(2) 25% SGP Profit Boosts</li><li>Gameday Guarantee No Sweat Bets </li></ul><h2>Responsible Gaming</h2><p>Gaming responsibly is important, and all the top <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">sportsbooks</a> have various tools and resources available on their apps and websites, including time and wager limits, plus voluntary self-exclusion options. Several are equipped with live 24/7 chat support, so if you or someone you know is dealing with a gambling problem, reach out to trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.</p>\n            </div>"
  },
  {
    "title": "Braelon Allen injury: Jets RB exits 'Monday Night Football' early, quickly ruled out after hurting knee - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/braelon-allen-injury-jets-rb-exits-monday-night-football-early-quickly-ruled-out-after-hurting-knee/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/30/a451a19a-bb3c-4e3a-858c-0cf1ba494bf3/thumbnail/1200x675/b022a40b844d3ee8ff8422d81c921bab/braelon-allen.jpg",
    "tag": "Sports",
    "date": "2025-09-30T00:40:16.000Z",
    "description": "Imagn Images                                    The New York Jets' rocky first half against the Miami Dolphins included running back Braelon Allen exiting the game early with a knee injury. Allen was...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"braelon-allen.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/30/a451a19a-bb3c-4e3a-858c-0cf1ba494bf3/thumbnail/770x433/96ae2b805ba8d9d4370873667a5f5219/braelon-allen.jpg\" /></figure>\n                    <figcaption>\n                <span>Imagn Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>' rocky first half against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> included running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/26726580/braelon-allen/\">Braelon Allen</a> exiting the game early with a knee injury. </p><p>Allen was injured on a kickoff return late in the second quarter and quickly ruled out. Allen had run for 26 yards on four carries prior to getting injured. He also committed a costly fumble deep in Dolphins territory that short-circuited the Jets' 12-play, 82-yard opening drive. </p><p>Allen, a 2024 fourth-round pick, wasn't the only Jets player that struggled to protect the ball in the first half. His quarterback, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1273205/justin-fields/\">Justin Fields</a>, put the ball on the ground late in the second quarter after taking a sack. The fumbles were the first forced turnovers by Miami's defense this season. </p>\n<p>As a rookie, Allen ran for 334 yards and two touchdowns while averaging 3.6 yards per carry. He also caught 19 passes for 146 yards and a touchdown. Allen ran for 50 yards and a score on 14 carries in New York's first three games of the 2025 season. </p><p>With Allen out, the Jets' running game will now be spearheaded by Fields and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a>. Hall had seven carries for 53 yards in the first half, while Fields picked up 30 yards on four carries. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/26718641/isaiah-davis/\">Isaiah Davis</a> was the only other Jets player who carried the ball in the first half. </p>\n<p>The turnovers contributed to the Dolphins taking a 10-3 halftime lead over the Jets in a matchup of two winless teams. </p>\n            </div>\n    </div>"
  }
]