[
  {
    "title": "Computer model locks in Dolphins vs. Patriots picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-dolphins-where-to-watch-nfl-week-18-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/97166bec-3202-48ea-be76-91917a4869fc/thumbnail/1200x675/c6d88fe209192fec49da3fcd54b2e118/drake-maye-new-england-patriots.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:42:41.000Z",
    "description": "\nThe New England Patriots still have a chance at the AFC's No. 1 seed on Sunday when they host the Miami Dolphins in an NFL Week 18 AFC East matchup. ",
    "body": "\nThe New England Patriots still have a chance at the AFC's No. 1 seed on Sunday when they host the Miami Dolphins in an NFL Week 18 AFC East matchup. Quarterback Drake Maye will try to lock up the MVP award -- he is the -295 favorite at DraftKings -- and lead the Patriots (13-3) into the postseason on a roll. They can take the No. 1 seed with a victory and a Denver loss. The Dolphins (7-9) are simply trying to help coach Mike McDaniel keep his job. Miami knocked off the Tampa Bay Buccaneers 20-17 last week to end a two-game losing streak that eliminated them from the playoffs. New England has won 12 of its past 13 games.     Kickoff from Gillette Stadium is set for 4:25 p.m. ET. The Patriots are 13.5-point favorites in the latest Dolphins vs. Patriots odds from DraftKings, while the over/under for total points scored is 45.5. New England's over/under for total team points is 29.5, while Miami's is 15.5. Before you make any Patriots vs. Dolphins picks of your own, you have to see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Dolphins vs. Patriots on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppDolphins vs. Patriots betting previewOdds: Patriots -13.5, Over/Under 45.5The Patriots are outscoring opponents by about nine points per game and are 11-5 against the spread but just 4-4 ATS at home. Miami is 8-8 ATS (3-4 in road games) but has covered the spread in nine of its past 10 visits to Gillette Stadium. The Pats are 7-1 against the spread in their past eight AFC East matchups. Dolphins vs. Patriots SGPOver 45.5Dolphins +13.5Rhamondre Stevenson anytime TD scorerBet it at DraftKings:\nModel's Dolphins vs. Patriots score prediction, picksAs mentioned, the Dolphins are 9-1 ATS in their past 10 trips to New England. They rushed for 145 yards in last week's victory and are 10th in the NFL at 124 rushing yards per game behind De'Von Achane,who is fifth in the league with 1,350 rushing yards. The run game will take pressure off rookie quarterback Quinn Ewers. The first meeting between this season was a 33-27 New England victory, and the model has Miami covering in 53% of simulations. The total has gone Over in eight of New England's past 10 games, and the Pats score an average of 28 points per game, fifth in the NFL. The Over hits at a 60% rate in SportsLine's projections. They want the win to lock up the top seed, but they'll also want to stay healthy for the playoffs, so they could be conservative with Maye. The SportsLine props model projects him for 15 completions and has the Under as a 5-star play.Dolphins vs. Patriots score prediction: Patriots 30, Dolphins 21\nWant more Week 18 NFL picks?You've seen the model's best bets for Miami Dolphins vs. New England Patriots. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Dolphins vs. Patriots picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/97166bec-3202-48ea-be76-91917a4869fc/thumbnail/1200x675/c6d88fe209192fec49da3fcd54b2e118/drake-maye-new-england-patriots.jpg"
      ],
      "datePublished": "2026-01-04T19:42:41.000Z",
      "dateModified": "2026-01-04T19:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-bills-where-to-watch-nfl-week-18-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/64db3f7f-c371-40e7-acc1-d74096dd6a33/thumbnail/1200x675/2c347b864c9fa4e8d9639c00a807385c/josh-allen-buffalo-bills-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:31:35.000Z",
    "description": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jet",
    "body": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jets and have results go their way elsewhere in Week 18. Yet given the foot injury star quarterback Josh Allen is currently nursing, Buffalo may not want to risk its most important player with a postseason berth already secured. Allen does not have an injury designation on the injury report, but it's unclear whether he will play the full game. The Jets, meanwhile, are playing out the string for another lost season. Coach Aaron Glenn may be coaching for his job.Kickoff from Highmark Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Bills are 12.5-point favorites in the latest Bills vs. Jets odds at DraftKings, and the total is 38.5 points. Before making any Jets vs. Bills picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Bills vs. Jets on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppBills vs. Jets betting previewOdds: Bills -12.5, over/under 38.5These lines could fluctuate as kickoff draws closer and it becomes clearer just how the Bills will handle their starters. Both teams are 7-9 against the spread. Buffalo is 8-8 to the Over, while New York is 10-6. The Bills have only covered in one of their last four games, while the Jets haven't covered once in that span.Bills vs. Jets SGPBills -12.5Over 38.5Bills -7.5 first half spreadBet it at DraftKings:\nModel's Bills vs. Jets score prediction, picksThe Bills cover in 62% of the model's simulations and win outright in 82%. The Over hits 69% of the time. These rates may change as player availability news emerges. Bills vs. Jets score prediction: Bills 30, Jets 16Want more Week 18 NFL picks?You've seen the model's best bets for Buffalo Bills vs. New York Jets. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/64db3f7f-c371-40e7-acc1-d74096dd6a33/thumbnail/1200x675/2c347b864c9fa4e8d9639c00a807385c/josh-allen-buffalo-bills-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T19:31:35.000Z",
      "dateModified": "2026-01-04T19:31:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Commanders vs. Eagles picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-commanders-where-to-watch-nfl-week-18-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/86ca77ed-6890-481e-8b2f-e70439cb47c9/thumbnail/1200x675/0575aecc1f9de7cea48fb8a6a87b6117/tanner-mckee-eagles.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:35:58.000Z",
    "description": "\nThe Philadelphia Eagles have once again won the NFC East and are aiming to defend their Super Bowl title. Before they can go on another postseason ru",
    "body": "\nThe Philadelphia Eagles have once again won the NFC East and are aiming to defend their Super Bowl title. Before they can go on another postseason run, they'll take on the Washington Commanders in Week 18 action. Philadelphia can get the No. 2 seed in the conference and host the Green Bay Packers with a win and a loss by the Chicago Bears to the Detroit Lions this weekend, but an Eagles loss, a Bears win, or losses by both teams would lock the Eagles into the No. 3 seed and a matchup with either the Los Angeles Rams or San Francisco 49ers. The Eagles are expected to sit key starters like quarterback Jalen Hurts, however. Kickoff from Lincoln Financial Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Eagles are 3.5-point favorites in the latest Commanders vs. Eagles odds at DraftKings, and the total is 38.5. Before making any Eagles vs. Commanders picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Commanders vs. Eagles on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppCommanders vs. Eagles betting previewOdds: Eagles -3.5, over/under 38.5Despite some early struggles on offense, the Eagles have been very good against the spread at 10-6, nearly identical with the team's 11-5 overall record. The Commanders have had a dreadful 2025 campaign after a surprising postseason run in 2024, and they're 3-12 overall and 6-10 against the spread. Philadelphia is 6-10 to the Over this year while the Commanders, thanks to a disastrous defense, are 9-7 to the Over.Commanders vs. Eagles SGPEagles -3.5Over 38.5Commanders first-half points Under 8.5Bet it at DraftKings:\nModel's Commanders vs. Eagles score prediction, picksThe Eagles are expected to still win this one rather easily as they cover in 56% of simulations and win outright 75% of the time. The Over also hits nearly 70% of the time. Commanders vs. Eagles score prediction: Eagles 30, Commanders 20Want more Week 18 NFL picks?You've seen the model's best bets for Washington Commanders vs. Philadelphia Eagles. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Commanders vs. Eagles picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/86ca77ed-6890-481e-8b2f-e70439cb47c9/thumbnail/1200x675/0575aecc1f9de7cea48fb8a6a87b6117/tanner-mckee-eagles.jpg"
      ],
      "datePublished": "2026-01-04T16:35:58.000Z",
      "dateModified": "2026-01-04T16:35:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 College Football Playoff semifinal odds, lines: Picks, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-semifinals-2026-odds-picks-cfp-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/21/36bbfb82-fc72-4153-b4d4-007af0b0d80c/thumbnail/1200x675/8258fa68e8b9983744386a9482450a79/dante-moore-oregon-ducks-3.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:35:29.000Z",
    "description": "\n        The 2025-26 college football bowl schedule saw its final standard bowl games on Friday, Jan. 2, but the season extends well into January as t",
    "body": "\n        The 2025-26 college football bowl schedule saw its final standard bowl games on Friday, Jan. 2, but the season extends well into January as the 2026 College Football Playoff semifinals are up next. Ole Miss vs. Miami in the Fiesta Bowl is up first on Thursday, Jan. 8, while Oregon vs. Indiana in the Peach Bowl is the following day. The national championship game will then take place on Monday, Jan. 19.The latest college football odds lists Miami at -3.5 with the over/under at 51.5 in the first semifinal matchup. Indiana is -4 with the over/under at 46.5 in the second CFP semifinal. Before locking in any college football picks for those games, be sure to see the latest College Football Playoff picks and predictions from SportsLine's proven model. The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for the CFP semifinals One of the college football picks the model is high on during the semifinal round of the College Football Playoffs: The Over (47.5) hits in the rematch between Oregon and Indiana on Friday at 7:30 p.m. ET at Mercedes-Benz Stadium in Atlanta. These teams met in Eugene on Oct. 11 and combined for 50 points. Both squads have elite defenses, but they can both score at a high rate as well as they're led by the possible top-two picks in the 2026 NFL Draft -- Indiana quarterback and Heisman winner Fernando Mendoza and Oregon quarterback Dante Moore. Indiana just put 38 points on Alabama, while Oregon is averaging 37 points per game through two playoff matchups. SportsLine's model is projecting 49 points this time around as the Over hits in 54% of simulations. See the rest of the model's picks here, and bet the Over right here:\nHow to make College Football Playoff picks The model has also made the call on who wins and covers in both CFP games, including backing one of the underdogs to win outright. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which underdog is projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has simulated every game 10,000 times, and find out.2026 College Football Playoff semifinals odds See full CFP picks, odds, predictions here(odds subject to change)Thursday, Jan. 8Fiesta Bowl/CFP semifinal: Miami vs. Ole Miss (+3.5, 51.5)Friday, Jan. 9 Peach Bowl/CFP semifinal: Oregon vs. Indiana (-4, 46.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football Playoff semifinal odds, lines: Picks, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/21/36bbfb82-fc72-4153-b4d4-007af0b0d80c/thumbnail/1200x675/8258fa68e8b9983744386a9482450a79/dante-moore-oregon-ducks-3.jpg"
      ],
      "datePublished": "2026-01-04T15:35:29.000Z",
      "dateModified": "2026-01-04T15:35:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Chargers vs. Broncos picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chargers-broncos-where-to-watch-nfl-week-18-score-prediction-betting-odds-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/bc544dde-9640-4b68-abe4-262d4f249dc7/thumbnail/1200x675/fdc1bd993e94aea20db2ab8962d171b8/bo-nix-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:39:45.000Z",
    "description": "\nThe Denver Broncos will be attempting to secure the No. 1 seed in the AFC when they host the Los Angeles Chargers in Week 18 of the 2025 NFL season. ",
    "body": "\nThe Denver Broncos will be attempting to secure the No. 1 seed in the AFC when they host the Los Angeles Chargers in Week 18 of the 2025 NFL season. The Chargers don't have much to play for beyond seeding in the playoffs, and they're planning on resting Justin Herbert and other key starters as a result. If Denver wins this game, the Broncos will secure the top seed and get a bye in the first round of the playoffs.Kickoff from Empower Stadium at Mile High is set for 4:25 p.m. ET on CBS and Paramount+. The Broncos are 14-point favorites in the latest Chargers vs. Broncos odds at DraftKings, and the over/under for total points scored is 37.5. Denver's over/under for total points scored is 26.5, while Los Angeles' is 10.5. Before making any Broncos vs. Chargers picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Chargers vs. Broncos on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppChargers vs. Broncos betting previewOdds: Broncos -14, over/under 37.5Despite its stellar record, Denver is only 6-9-1 against the spread. Los Angeles is 8-7-1 ATS but had four straight covers before losing to the Texans at home in Week 17. The Chargers are 6-9-1 to the Over while the Broncos are 7-9 to the Over.Chargers vs. Broncos SGPChargers +14Over 37.5RJ Harvey anytime touchdown scorerBet it at DraftKings:\nModel's Chargers vs. Broncos score prediction, picksThe Chargers cover the spread in 58% of model simulations and win in 27%, bringing value as +575 underdogs. The Over hits in 51% of simulations.Chargers vs. Broncos score prediction: Broncos 25, Chargers 15\nWant more Week 18 NFL picks?You've seen the model's best bets for Los Angeles Chargers vs. Denver Broncos. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Chargers vs. Broncos picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/bc544dde-9640-4b68-abe4-262d4f249dc7/thumbnail/1200x675/fdc1bd993e94aea20db2ab8962d171b8/bo-nix-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T19:39:45.000Z",
      "dateModified": "2026-01-04T19:39:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Lions vs. Bears picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-bears-where-to-watch-nfl-week-18-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/9c12cd82-0a5e-4c30-9a26-ad937e7a11d3/thumbnail/1200x675/d49b384723bd224b1eb0c3390144ad4a/caleb-williams-chicago-bears.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:47:21.000Z",
    "description": "\nThe NFC North has been the Detroit Lions' for the last two years, but the Chicago Bears have won the crown in 2025 under first-year head coach and fo",
    "body": "\nThe NFC North has been the Detroit Lions' for the last two years, but the Chicago Bears have won the crown in 2025 under first-year head coach and former Lions offensive coordinator Ben Johnson. He has the Bears at 11-5 entering a Week 18 matchup with Detroit, and a win would have Chicago clinching the No. 2 spot in the NFC and securing a third matchup with the Green Bay Packers, this time in NFL Super Wild Card Weekend. The Lions were eliminated from playoff contention last week, but Dan Campbell has a history of having Detroit ready to play spoiler in the final week of the season.Kickoff from Soldier Field is set for 4:25 p.m. ET. The Bears are 4.5-point favorites in the latest Lions vs. Bears odds at DraftKings, and the total is 51.5. Before making any Bears vs. Lions picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Lions vs. Bears on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppLions vs. Bears betting previewOdds: Bears -4.5, over/under 51.5Detroit dominated the previous matchup 52-21 back in Week 2, but the Bears have been red hot ever since, while the Lions need a win to finish the season over .500. The Bears are 10-5-1 against the spread this season, while the Lions are 7-9 ATS. The Lions are 10-6 to the Over this year, and the Bears are 8-8 to the Over.Lions vs. Bears SGPLions +4.5Over 51.5Lions +3.5 first half spreadBet it at DraftKings:\nModel's Lions vs. Bears score prediction, picksThe SportsLine model likes backing Detroit here as the Lions cover in 51% of simulations and win outright 47% of the time. The model also expects this NFC North clash to be a high-scoring affair, with Over 50.5 hitting in nearly 60% of sims. Lions vs. Bears score prediction: Bears 28, Lions 27Want more Week 18 NFL picks?You've seen the model's best bets for Detroit Lions vs. Chicago Bears. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Lions vs. Bears picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/9c12cd82-0a5e-4c30-9a26-ad937e7a11d3/thumbnail/1200x675/d49b384723bd224b1eb0c3390144ad4a/caleb-williams-chicago-bears.jpg"
      ],
      "datePublished": "2026-01-04T19:47:21.000Z",
      "dateModified": "2026-01-04T19:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens vs. Steelers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-steelers-nfl-player-props-sgp-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/27/895ff5ff-42a4-4342-b1a3-cd8c679f6878/thumbnail/1200x675/703d0fabd5569137b81895cc2eacfa36/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:18:25.000Z",
    "description": "\nThe AFC North title and a playoff berth are on the line when the Baltimore Ravens clash with the Pittsburgh Steelers in Week 18 'Sunday Night Footbal",
    "body": "\nThe AFC North title and a playoff berth are on the line when the Baltimore Ravens clash with the Pittsburgh Steelers in Week 18 'Sunday Night Football' at 8:20 p.m. ET from Acrisure Stadium in Pittsburgh. The Ravens (8-8) trail the Steelers (9-7) by one game in the division, but would win the tiebreaker if they win on Sunday. The matchup will feature Ravens running back Derrick Henry and Steelers quarterback Aaron Rodgers. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which Baltimore is favored by 3.5 points.Henry is coming off a monster game against the Green Bay Packers in which he carried 36 times for 216 yards and four touchdowns. It is the most rushing yards ever registered by an opposing player at Lambeau Field. Rodgers, meanwhile, has completed 65.6% of his passes for 3,028 yards and 23 touchdowns on the year. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Zay Flowers, Mark Andrews and DeAndre Hopkins of the Ravens, and Jaylen Warren, Kenneth Gainwell and Pat Freiermuth of the Steelers. Before betting any Steelers vs. Ravens props for Sunday Night Football, you need to see the Ravens vs. Steelers prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Steelers vs. Ravens NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Ravens vs. Steelers prop picks. You can only see the Machine Learning Model player prop predictions for Ravens vs. Steelers here.Top NFL player prop bets for Steelers vs. RavensAfter analyzing the Ravens vs. Steelers props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Steelers quarterback Aaron Rodgers goes over 1.5 passing touchdowns (+148). Rodgers has thrown two or more touchdown passes in five games this season. In a 28-15 win over the Miami Dolphins on Dec. 15, Rodgers completed 23 of 27 passes for 224 yards and two touchdowns. Additionally, Baltimore has the 30th-best passing defense, and has given up 22 passing touchdowns. Rodgers has thrown for four touchdown passes in his last two games against Baltimore. The SportsLine Machine Learning Model projects Rodgers to have 1.7 touchdown passes and gives this prop a 4 out of 5-star prop rating. See more NFL props here. Bet Rodgers to go Over 1.5 passing touchdowns at DraftKings:\nHow to make NFL player prop bets for Ravens vs. SteelersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has nine other NFL props that are rated 4 stars or better. You need to see the Machine Learning Model analysis before making any Ravens vs. Steelers prop bets for Sunday Night Football.Which Steelers vs. Ravens prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Ravens vs. Steelers props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens vs. Steelers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/27/895ff5ff-42a4-4342-b1a3-cd8c679f6878/thumbnail/1200x675/703d0fabd5569137b81895cc2eacfa36/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T16:18:25.000Z",
      "dateModified": "2026-01-04T16:18:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Rams vs. Cardinals picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cardinals-rams-where-to-watch-nfl-week-18-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/fe554be6-0247-4976-b8dd-8acc6fb05e8c/thumbnail/1200x675/39726eeff82af032855b58093f9c131a/matthew-stafford-los-angeles-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:43:26.000Z",
    "description": "\nThe Los Angeles Rams have already secured a place in the postseason, but head coach Sean McVay has said he plans to play his starters in Week 18 agai",
    "body": "\nThe Los Angeles Rams have already secured a place in the postseason, but head coach Sean McVay has said he plans to play his starters in Week 18 against the Arizona Cardinals after the team's loss to the Atlanta Falcons. The Rams would be locked into the No. 5 seed in the NFC if the Seattle Seahawks defeat the San Francisco 49ers on Saturday, but McVay claims he plans to put his starters on the field either way. As for Arizona, it's been a bad year in the desert, and big changes could be coming this offseason.Kickoff from SoFi Stadium is set for 4:25 p.m. ET. The Rams are 14-point favorites in the latest Rams vs. Cardinals odds from DraftKings, while the over/under for total points scored is 47.5. Before you lock in your own Cardinals vs. Rams picks, make sure you see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Rams vs. Cardinals on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppRams vs. Cardinals betting previewOdds: Rams -14, over/under 47.5Los Angeles is 11-5 against the spread and 9-7 to the Over. Arizona is 6-10 ATS and 9-7 to the Over. The Rams won 45-17 when these teams met in the desert in early December. Los Angeles has covered three of its last five games and has produced five straight Overs. Arizona has lost eight in a row and has failed to cover in each of its last four outings.Rams vs. Cardinals SGPCardinals +14.5Over 47.5Cardinals first half spread +9.5Bet it at DraftKings:\nModel's Rams vs. Cardinals score prediction, picksThe Rams cover in 58% of the model's simulations and win outright in 76%, although the Los Angeles money line offers little value at such a heavy price. The Over hits 60% of the time. Rams vs. Cardinals score prediction: Rams 31, Cardinals 20Want more Week 18 NFL picks?You've seen the model's best bets for Los Angeles Rams vs. Arizona Cardinals. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Rams vs. Cardinals picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/fe554be6-0247-4976-b8dd-8acc6fb05e8c/thumbnail/1200x675/39726eeff82af032855b58093f9c131a/matthew-stafford-los-angeles-rams-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T16:43:26.000Z",
      "dateModified": "2026-01-04T16:43:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amorim's Man United future: 'I will do my job for 18 months and then we move on' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/ruben-amorim-future-manchester-united-leeds-draw-premier-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/84d4fe62-eb97-4b03-8f10-2f4355eb118a/thumbnail/1200x675/33493cacea68b64627924a651836977b/amorim.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:04:14.000Z",
    "description": "\n        Manchester United's Ruben Amorim is once again showing signs of discontent at the club, declaring on Sunday that he intends to stay in the jo",
    "body": "\n        Manchester United's Ruben Amorim is once again showing signs of discontent at the club, declaring on Sunday that he intends to stay in the job until his contract expires – though he may \"move on\" after the fact.Amorim's comments came after a 1-1 draw at Leeds United, the hosts striking first courtesy of Brenden Aaronson in the 62nd minute before Matheus Cunha notched an equalizer three minutes later. It was a somewhat evenly contested match and leaves United in fifth place on the Premier League table, still well within touching distance of a UEFA Champions League spot, though the Red Devils now have just one win in their last five matches.That run of form has added another hurdle in a bumpy tenure at United for Amorim, who took the helm in November 2024, though his comments on Sunday suggested the disconnect between him and the club's higher-ups may be down to more than just results.\"I came here to be the manager of Manchester United, not to be the coach of Manchester United, and that is clear,\" Amorim said. \"I know that my name is not [Thomas] Tuchel, it's not [Antonio] Conte, it's not [Jose] Mourinho, but I'm the manager of Manchester United, and it's going to be like this for 18 months or when the board decides to change, so that was my point. I want to finish with that. I'm not going to quit. I will do my job until [an]other guy is coming here to replace me.\"\nAmorim also suggested that all parties involved might be willing to end things when his contract expires, even as criticism mounts amidst a poor run of form.\"I just want to say I'm going to be the manager of this team, not just the coach, and I was really clear on that, and that is going to finish in 18 months, and then, everyone is going to move on,\" Amorim continued. \"That was the deal. That is my job – not to be a coach. If people handle the [Sky Sports broadcaster] Gary Nevilles and the criticisms of everything, we need to change the club … I just want to say that I came here to be the manager of Manchester United, not to be the coach and every department – the scouting department, the [sporting] director needs to do their job. I will do mine for 18 months, and then we move on.\"Amorim has made his dissatisfaction with United's power players clear over the last several weeks, including through comments on Christmas Eve that the club needs to put in \"time and money\" to make his preferred 3-4-3 system work. He admitted, though, on Friday in a pre-match press conference that there are \"no conversations\" about bringing in players during the January transfer window and that questions on that front should be directed towards United's director of football Jason Wilcox.\nThe manager's contract expires at the end of the 2026-27 season and includes an option to extend the deal by another year.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amorim's Man United future: 'I will do my job for 18 months and then we move on' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/84d4fe62-eb97-4b03-8f10-2f4355eb118a/thumbnail/1200x675/33493cacea68b64627924a651836977b/amorim.jpg"
      ],
      "datePublished": "2026-01-04T20:04:14.000Z",
      "dateModified": "2026-01-04T20:04:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-spread-time-ravens-steelers-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/685349bc-30e7-4676-a79f-03790ffe7383/thumbnail/1200x675/98a3316856e142cd42c829424a2122ef/derrick-henry-baltimore-ravens-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-04T18:25:26.000Z",
    "description": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday ",
    "body": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday Night Football.' Baltimore is coming off a 41-24 thumping of the Green Bay Packers in Week 17, while Pittsburgh dropped a 13-6 decision to the Cleveland Browns. The Ravens (8-8), who have won the past two division championships, would hold the tiebreaker with Pittsburgh if they finish with the same record. The Steelers (9-7), who are looking for their first AFC North crown since 2020, are 5-3 on their home field this season. Lamar Jackson (back) will start at quarterback for the Ravens. Pittsburgh will again be without receiver DK Metcalf (suspension), but T.J. Watt (lung) is expected to return after having surgery.Kickoff from Acrisure Stadium in Pittsburgh is set for 8:20 p.m. ET. The Steelers lead the all-time series 37-27, including a 27-22 win in Baltimore on Dec. 7. Baltimore is a 3.5-point favorite in the latest Ravens vs. Steelers odds from DraftKings Sportsbook, while the over/under for total points scored is 41.5. Before locking in any Steelers vs. Ravens picks, make sure to check out the 'Sunday Night Football' predictions from SportsLine NFL expert Mike Tierney.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nA veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. Mike is 235-189-13 in the NFL the past three seasons, returning $2,505 to $100 players. In addition, he is an amazing 31-14-1 on his last 46 picks in games involving the Baltimore Ravens, returning $1,527. Anyone who has followed him could be way up. Now, Tierney has set his sights on Ravens vs. Steelers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Ravens vs. Steelers: Ravens vs. Steelers                                         spreadBaltimore -3.5 at DraftKings SportsbookRavens vs. Steelers                                                 over/under41.5 pointsRavens vs. Steelers                                                 money line Baltimore -190, Pittsburgh +159Ravens vs. Steelers                                             picksSee picks at SportsLineRavens vs. Steelers                                                 streaming Fubo (Try for free)  \nWhy the Ravens can winVeteran running back Derrick Henry can put the offense on his back, as he did in last week's win over the Packers. Henry rushed 36 times for 216 yards and four touchdowns at Green Bay. For the season, he has carried 287 times for 1,469 yards and 16 touchdowns. He has 15 explosive plays of 20 yards or more, including a long of 59, with 74 first-down conversions. He has also caught 20 passes for 150 yards and has over 100 scrimmage yards earlier this year versus Pittsburgh.Wide receiver Zay Flowers has been solid in the passing game. In 16 games, Flowers has 82 receptions for 1,073 yards and three touchdowns. He also has 17 big plays of 20 yards or more, including a long of 56, with 400 yards after the catch and 45 first-down conversions. Against the Packers, he caught four passes for 30 yards and a score. See which team to back at SportsLine. Bet Lamar Jackson to go Over 214.5 passing yards at DraftKings:\nWhy the Steelers can winVeteran quarterback Aaron Rodgers, who is in his 21st season in the league, powers the Pittsburgh offense. In 15 games, he has completed 65.6% of his passes for 3,028 yards and 23 touchdowns with seven interceptions and a 95.3 rating. Rodgers has also rushed for one score. In the win over the Ravens in December, he completed 23 of 34 passes for 284 yards and one touchdown. He also rushed for one score.Four-year veteran running back Jaylen Warren helps lead the Steelers' ground attack. In 15 games, he has carried 197 times for 892 yards (4.5 average) and six touchdowns. He has six explosive plays of 20 or more yards, including a long of 45. He has converted 48 first downs, and he scored a touchdown versus Baltimore earlier this season. In a 29-24 win at Detroit on Dec. 21, he carried 14 times for 143 yards and two touchdowns. See which team to back at SportsLine.Bet Jonnu Smith to go Over 16.5 total receiving yards at DraftKings:\nHow to make Ravens vs. Steelers  picksTierney has analyzed Ravens vs. Steelers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Steelers vs. Ravens, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Ravens vs. Steelers spread you need to jump on, all from the expert that is 31-14-1 on his last 46 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/685349bc-30e7-4676-a79f-03790ffe7383/thumbnail/1200x675/98a3316856e142cd42c829424a2122ef/derrick-henry-baltimore-ravens-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-04T18:25:26.000Z",
      "dateModified": "2026-01-04T18:25:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rodri's return offers hope to City but draw at Chelsea mean he'll have to deliver - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/rodris-return-manchester-city-score-chelsea-draw-premier-league-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/5ed6d918-781c-4305-9511-643cc6e06ad1/thumbnail/1200x675/a6692d63fee008e70204c1ee5e36a31f/man-city-1.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:08:42.000Z",
    "description": "\n        The two points dropped threaten to be critical but can the immediate damage to the title race be offset by the return of one man? What about ",
    "body": "\n        The two points dropped threaten to be critical but can the immediate damage to the title race be offset by the return of one man? What about if that player's peak is Ballon d'Or level? Enzo Fernandez's late equalizer to earn Chelsea a 1-1 draw at the Etihad Stadium feels like a major speed bump in the title race, the sort that is going to require all hands on the Manchester City deck.Thank goodness then that Pep Guardiola at least got an approximation of the best midfielder in the world, Rodri completing a full 90 minutes for the first time since September, one where at his peak he imposed his style on the contest. City find themselves with six points to make up on the Premier League leaders, needing the sort of winning run that might only come if they can boss games like they used to. For a time, they managed to do exactly that. This was a glimpse of prime Rodri, 469 days in the making since the ACL injury that so derailed City last season, another serious step forward after a promising cameo in the second half against Sunderland. There have been false dawns before, enough to mean that every late Reece James tackle should have brought palpitations across City. This felt different, though, to the player we saw in the early days of autumn.Take the driving run into midfield with eight minutes to go in the first half. Josh Acheampong didn't have the muscle to get away from Rodri, who went on and on into the penalty area, Chelsea's 10-man block just about managing to deal with the danger. They didn't soon after as the Spaniard cruised away from pressure, a sweeping pass out to the right, hitting Erling Haaland in stride, his shot crashing back off the inside of the far post.It is worth noting early on that Chelsea rather facilitated Rodri's excellence. No one seemed to pick him up when he drifted into the space around their midfield and the pressure was far from sufficient on the City center backs to stop them fizzing the ball between the lines. From there, Rodri usually had the time to turn and assess his options. If not, he was probably being fouled. Chelsea began like what they were, a team without Moises Caicedo whose head coach, Calum McFarlane, had never managed a senior match before.\nRodri instinctively knew where the gaps were in this first timers system. No one else seemed to understand how best to deal with his movement. His contribution to Tijani Reijnders' goal might have been minimal, little more than a wall for Bernardo Silva to bounce possession off before a probing through ball. It spoke  Only with the second half introduction of Andrey Santos did Chelsea really get a handle on midfield and turn this into a game where they could get a few counters going.Before then, you saw an approximation of the City of old, one who can simply hold court in the attacking third, throttling any breakout attempts by the opposition. Rodri's winning of all bar one of his duels, the same for his tackles, was critical. The one shot allowed and five penalty box touches allowed in the first 45 minutes were the sort of numbers this team had only really allowed against bottom-half opposition before today. Maybe Chelsea were just performing at that level. And maybe Rodri was making them.As for the second half, the triumph, as far as City should be concerned, was how much of it Rodri was able to play. That was all the more critical when Josko Gvardiol and Ruben Dias limped out with injury. For the most part, Guardiola has swerved injuries to his backline this season, Gvardiol missing three early this season. What the current quartet might lack in comparison to the best City defenses of the last decade can at least be mitigated by minutes together on the pitch. When it was Abdukodir Khusanov and Nathan Ake being flanked by Nico O'Reilly and Matheus Nunes, City suddenly looked vulnerable.\nThat they were, Malo Gusto blowing down the right, his cross evading five trailing City shirts on its way to Enzo Fernandez, who eventually stabbed home an equalizer that their hosts should never have left on the cards. Off finishing by Haaland, Phil Foden and others cost Guardiola dearly, the manager a picture of frustration at the end. City have left themselves an almighty task for the months ahead. It will take Rodri at his best to drag them forward in the race.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rodri's return offers hope to City but draw at Chelsea mean he'll have to deliver - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/5ed6d918-781c-4305-9511-643cc6e06ad1/thumbnail/1200x675/a6692d63fee008e70204c1ee5e36a31f/man-city-1.jpg"
      ],
      "datePublished": "2026-01-04T20:08:42.000Z",
      "dateModified": "2026-01-04T20:08:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cam Ward injury update: Titans QB ruled out vs. Jaguars after hurting shoulder - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cam-ward-injury-update-titans-qb-out-jaguars/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/711abae8-686b-4116-8b1d-ba219aeae401/thumbnail/1200x675/b6cba1ee0350ddbdd87e589aa2245bae/gettyimages-2254633528-2.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:41:18.000Z",
    "description": "\n        Tennessee Titans rookie quarterback Cam Ward is out for the remainder of Sunday's game against the Jacksonville Jaguars with a right shoulder",
    "body": "\n        Tennessee Titans rookie quarterback Cam Ward is out for the remainder of Sunday's game against the Jacksonville Jaguars with a right shoulder injury. Ward suffered the injury after diving into the end zone for a rushing touchdown on Tennessee's first offensive drive.Fewer than five minutes into the game, Ward kept the ball on a designed run and dove for the goal line. He came down on his right shoulder, and as he did, Jaguars linebacker Foyesade Oluokun landed on top of him with a lot of force.Ward was slow to get up, and when he returned to the sideline, he entered the injury tent. After exiting, he walked back to the locker room. The Titans quickly labeled Ward as questionable before ruling him out.\nThe injury ends Ward's bid to play every offensive snap in his rookie campaign. He was the only quarterback with that distinction coming into the day.\nBefore exiting the game, Ward helped Tennessee get off to a fast start. He completed all three of his passes for 52 yards and rushed for 11 yards and the aforementioned touchdown.Brandon Allen entered the game in relief of Ward, and he will have the reins the rest of the way. Because fo Ward's durability and availability, Allen didn't see any action in the first 17 weeks of the season. A sixth-round pick in the 2016 NFL Draft, Allen completed 17 of 30 pass attempts for 56 yards, one touchdown and two interceptions as a backup with the San Francisco 49ers last season.Ward's late-season surge comes to an abrupt endThe No. 1 overall pick in 2025, Ward's rookie season got off to a discouraging start. Between rookie mistakes, a shaky offensive line and an unimpressive wide receiver room, Ward struggled to gain traction at the NFL level.\nHowever, around a month ago, something seemed to click. He started playing more consistently, and the Titans started finding the end zone with a little more frequency. Dating back to the Titans' Week 14 loss to the Cleveland Browns, Ward showed legitimate signs of progress.Over that four-game stretch, Ward completed 59.2% of his passes for eight touchdowns and just one interception while averaging 191.5 yards per game. Ward also became the first Titans quarterback to throw at least two touchdown passes in four consecutive weeks since Ryan Tannehill accomplished that feat in 2020.In the 12 games prior to that run, Ward struggled, especially when it came to protecting the football. Over that span, Ward tossed seven interceptions to six interceptions, which came in consecutive games. He also fumbled the ball nine times, and a number of those came as a result of him trying to do too much in the backfield.\nWard's improved late-season play generated a clear impact on the team overall -- the Titans were 2-2 in those four games and averaged 26.7 points per game. On the season, Tennessee averaged just 17.3 points per game prior to Sunday. Rookie receivers Chimere Diek and Elic Ayomanor also emerged to make some key plays for the Titans.Ward ends his season with a 59.8% completion percentage, 3,169 yards, 15 touchdowns and seven interceptions, but those numbers don't tell the whole story. Ward showed flashes of greatness down the stretch, and that should encourage the Titans as they look toward the 2026 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cam Ward injury update: Titans QB ruled out vs. Jaguars after hurting shoulder - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/711abae8-686b-4116-8b1d-ba219aeae401/thumbnail/1200x675/b6cba1ee0350ddbdd87e589aa2245bae/gettyimages-2254633528-2.jpg"
      ],
      "datePublished": "2026-01-04T19:41:18.000Z",
      "dateModified": "2026-01-04T19:41:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael Wilson among expert's best Week 18 NFL player prop bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-picks-michael-wilson-prop-among-sportsline-experts-best-bets-for-week-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/e57d3d13-b4aa-4ce9-a7df-cf89969fb898/thumbnail/1200x675/100d06ddc410f99b118f3d1f59ab0f16/michael-wilson-arizona-cardinals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:39:12.000Z",
    "description": "\nTwo games in Week 18 of the 2025 NFL season will be front and center as they will determine the final playoff participant in each conference. An NFC ",
    "body": "\nTwo games in Week 18 of the 2025 NFL season will be front and center as they will determine the final playoff participant in each conference. An NFC South champion will be crowned when the Atlanta Falcons host the New Orleans Saints, although neither of those teams are in the running. If Atlanta completes a sweep of the season series, the Carolina Panthers (8-9) will win their first division title since 2015 while the Tampa Bay Buccaneers (8-9) will make it five consecutive crowns should New Orleans end the regular season its fifth straight victory.The AFC North winner will be decided when the two-time reigning champions Baltimore Ravens (8-8) visit the Pittsburgh Steelers (9-7) on Sunday Night Football. Pittsburgh had the opportunity to secure the title last week but dropped a 13-6 decision to the Cleveland Browns. Baltimore, which lost five of its first six games this season but used a five-game winning streak to vault back into contention for the crown before losing three of its next four, kept its hopes alive by routing the Green Bay Packers 41-24 behind a 216-yard, four-touchdown rushing performance by Derrick Henry.\nThe No. 1 seed in the AFC also is at stake Sunday. The Denver Broncos (13-3) will capture it with a home victory against the Los Angeles Chargers (11-5), but a loss would allow the New England Patriots (13-3) to earn the spot - and a first-round bye - with a triumph over the visiting Miami Dolphins (7-9). Meanwhile, the Jacksonville Jaguars (12-4) could swoop in and finish atop the conference should both Denver and New England lose while they defeat the Tennessee Titans (3-13).For Sunday's matchups, top sportsbooks have set the passing yards prop for both Baltimore's Lamar Jackson and Pittsburgh's Aaron Rodgers at 207.5 yards, Bijan Robinson of Atlanta's rushing yards prop at 82.5 and the receiving yards prop for New Orleans' Juwan Johnson at 56.5.Before you play a side on Jackson, Rodgers, Robinson, Johnson or any player prop for Week 18 of the NFL season, you need to see what SportsLine player prop expert PropBetGuy has to say. The expert is +1605 on his last 83 NFL player prop picks. Here are his picks and analysis.Parker Washington Over 47.5 receiving yards\nWashington has cleared this line each of the last three weeks, recording 145 and 115 yards in the last two, on a team-leading 20 total targets.Last game, he was on the field for 41 of Trevor Lawrence's 43 dropbacks, and I expect a similar snap share today as the Jaguars look to clinch the AFC South.Washington, who has run 67% of his routes out of the slot over the last four games, will face a Tennessee secondary that allows the sixth-highest yards per route run to slot pass catchers this season (1.99, per Fantasy Points).I'm counting on Lawrence to find his new go-to guy before this game gets out of hand. I'd bet this to Over 50.5 yards.Michael Wilson 6+ receptions\nWe get one last ride on the wagon that is Michael Wilson receiving props when he suits up without Marvin Harrison Jr..The Cardinals receiver has 59 total targets in the four games played without Harrison, accumulating a 31% target share and 42% first read rate per Fantasy Points.The Rams are one of the teams that Wilson decimated during that stretch (11 catches on 16 targets), and I do expect a lot of volume again today.While the Cardinals have nothing for which to play, I do see them playing their starters as head coach Jonathan Gannon is on the hot seat. It also doesn't hurt that Wilson is 93 yards away from 1,000 for the season.I'd bet this line up to -155, with the option to reduce the juice by pairing it with an alternate receiving yards total.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael Wilson among expert's best Week 18 NFL player prop bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/e57d3d13-b4aa-4ce9-a7df-cf89969fb898/thumbnail/1200x675/100d06ddc410f99b118f3d1f59ab0f16/michael-wilson-arizona-cardinals-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T16:39:12.000Z",
      "dateModified": "2026-01-04T16:39:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Billy Edwards commits to UNC: Bill Belichick lands QB out of transfer portal - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/billy-edwards-unc-bill-belichick-transfer-portal-quarterback/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/4920bcdd-936f-4151-955a-fb80fd62fd9b/thumbnail/1200x675/26be055b8925bfe376578156a8f1fe31/bill.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:00:03.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Bill Belichick's North Carolina Tar Heels found a ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Bill Belichick's North Carolina Tar Heels found a new quarterback, as former Wisconsin and Maryland signal-caller Billy Edwards Jr. committed to UNC, according to CBS Sports' Matt Zenitz. Edwards is expected to receive a medical redshirt and be ready for spring ball, ESPN reports.Edwards entered the 2025 season as the Badgers' starter, but suffered a knee injury in the first game of the season. It held him to just two total games played, and he finished the season having completed just 7 of 16 passes for 113 yards. The Virginia native ranked as a three-star recruit in the 2021 class by 247Sports. Edwards initially committed to Wake Forest, but took a redshirt year and transferred to Maryland in 2022.At Maryland, Edwards went 7-7 as a starter over three years. He earned the 2023 Music City Bowl MVP after throwing for 126 yards and a touchdown, and leading the Terrapins in rushing with 50 yards and another touchdown in a 31-13 win over Auburn. In 2024, Edwards completed 65% of his passes for 2,881 yards, 15 touchdowns and nine interceptions, and added five more scores on the ground. His 261.9 passing yards per game ranked second in the Big Ten that year.\nThe Belichick era got off to a slow start, as the Tar Heels finished this season 4-8, and went 2-6 in conference play. South Alabama transfer Gio Lopez was the Tar Heels' leading passer, as he threw for 1,747 yards, 10 touchdowns and five interceptions. UNC finished 2025 ranked dead last in the ACC in total offense (288.8 yards per game), and second-worst in scoring offense (19.3 points per game). \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Billy Edwards commits to UNC: Bill Belichick lands QB out of transfer portal - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/4920bcdd-936f-4151-955a-fb80fd62fd9b/thumbnail/1200x675/26be055b8925bfe376578156a8f1fe31/bill.jpg"
      ],
      "datePublished": "2026-01-04T16:00:03.000Z",
      "dateModified": "2026-01-04T16:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons QB Kirk Cousins woke up sick, and that matters to Buccaneers, Panthers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-qb-kirk-cousins-woke-up-sick-and-heres-why-that-matters-for-the-buccaneers-and-panthers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/03cb1a6d-9835-4fc0-8524-4681009dfbc7/thumbnail/1200x675/4387041c2ccb3fbbb98699b5ed20e35b/kirk.jpg",
    "tag": "Sports",
    "date": "2026-01-04T17:16:05.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the most important games of NFL Week 18 tak",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the most important games of NFL Week 18 takes place in Atlanta, as the Falcons host Tyler Shough and the rival New Orleans Saints. Both teams have been eliminated from playoff contention, but the winner of this game decides whether the Tampa Bay Buccaneers or Carolina Panthers make the postseason. If the Falcons win, the Panthers are kings in the NFC South. If the Saints win, Baker Mayfield is headed back to the playoffs.The Falcons are listed as 4.5-point favorites over at DraftKings Sportsbook, but one of their most important players is ill. On Sunday morning, the team announced that quarterback Kirk Cousins woke up feeling sick. However, he was not given a game designation, and will start against the Saints. Atlanta's backup quarterback is Easton Stick with Michael Penix Jr. on injured reserve.\nThis season, Cousins is 4-3 as a starter, and has thrown 1,541 yards, nine touchdowns and four interceptions in nine games played. Atlanta is coming off a dramatic 27-24 upset victory over the Los Angeles Rams on Monday night, in which Cousins threw for 126 yards and one touchdown. Running back Bijan Robinson was the star of the show, as he rushed for 195 yards and a touchdown, and added 34 yards receiving and another touchdown on five receptions. With Cousins feeling ill, it's fair to expect that Robinson will again be asked to carry the offense on Sunday.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons QB Kirk Cousins woke up sick, and that matters to Buccaneers, Panthers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/03cb1a6d-9835-4fc0-8524-4681009dfbc7/thumbnail/1200x675/4387041c2ccb3fbbb98699b5ed20e35b/kirk.jpg"
      ],
      "datePublished": "2026-01-04T17:16:05.000Z",
      "dateModified": "2026-01-04T17:16:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]