[
  {
    "title": "NFL picks for Week 15, score predictions, best bets today from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-15-picks-score-predictions-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/ccbcf400-5f22-4c9d-8cc4-8b97808dfa52/thumbnail/1200x675/4625d84af51769649fc370bc43a0289e/ceedee-lamb-dallas-cowboys-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-10T22:29:24.000Z",
    "description": "\nThe Week 15 NFL schedule features 16 more games, including several with potential playoff ramifications. One such game is an AFC East battle between ",
    "body": "\nThe Week 15 NFL schedule features 16 more games, including several with potential playoff ramifications. One such game is an AFC East battle between the Buffalo Bills (9-4) and New England Patriots (11-2). Buffalo is favored by 1.5 points as Josh Allen and the Bills take on Drake Maye and the Patriots. Buffalo is on a two-game winning streak, while New England has won 10 straight. Another key matchup is between two NFC contenders as the Detroit Lions (8-5) clash with the Los Angeles Rams (10-3). The Lions are battling for a playoff spot, while the Rams are seeking to retain the No. 1 seed in the conference. The Rams enter as 5.5-point home favorites. Sunday's largest spreads include Raiders vs. Eagles (-11.5), Titans vs. 49ers (-12.5) and Jets vs. Jaguars (-13.5). Before making any Week 15 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 15 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 15 games. You can only see the AI predictions for the Week 15 NFL schedule here.Top Week 15 NFL AI picksAfter analyzing every game in Week 15, the AI says the Cowboys (-5.5, 47.5), who have won three of their last four games, cover comfortably against the Vikings. \nQuarterback Dak Prescott has been on a roll. In 13 games, he has completed 69% of his passes for 3,637 yards and 26 touchdowns with 10 interceptions for a rating of 100.2. Bet Prescott to go Over 37.5 yards for longest completion using the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nPowering the Dallas rushing attack is fifth-year veteran running back Javonte Williams. In 13 games, he has carried 215 times for 1,022 yards (4.8 average) and nine touchdowns. He has five explosive plays of 20 yards or more, including a long of 66 yards. SportsLine AI rates the Cowboys as an A+ spread pick and also predicts a 30-20 win on average. See its other Week 15 football predictions and football picks at SportsLine, and bet the Cowboys at DraftKings here:\nHow to make Week 15 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 15. You need to see the AI's NFL picks before making any Week 15 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 15 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 15, score predictions, best bets today from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/ccbcf400-5f22-4c9d-8cc4-8b97808dfa52/thumbnail/1200x675/4625d84af51769649fc370bc43a0289e/ceedee-lamb-dallas-cowboys-imagn-images.jpg"
      ],
      "datePublished": "2025-12-10T22:29:24.000Z",
      "dateModified": "2025-12-10T22:29:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons vs. Buccaneers prediction, odds, time: 'Thursday Night Football' picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-falcons-prediction-odds-time-line-week-15-thursday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/052d899f-2b3c-4b3d-8d00-01e7a7ff3ad2/thumbnail/1200x675/fa15094e1ddc436c53829d6978963c04/baker-mayfield-tampa-bay-buccaneers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-10T23:28:50.000Z",
    "description": "\nThe Tampa Bay Buccaneers will look to get back on track when they take on the Atlanta Falcons in a key NFC South matchup on 'Thursday Night Football.",
    "body": "\nThe Tampa Bay Buccaneers will look to get back on track when they take on the Atlanta Falcons in a key NFC South matchup on 'Thursday Night Football.' Atlanta is coming off a 37-9 loss at Seattle on Sunday, while Tampa  Bay dropped a 24-20 decision to the New Orleans Saints. The Falcons (4-9), who have lost seven of their last eight games, are 2-5 on the road this season. The Buccaneers (7-6), who have lost five of their last seven, are 3-3 on their home field. Receiver Drake London (knee) has been ruled out for Atlanta. Mike Evans (collarbone) is questionable for Tampa Bay.Kickoff from Raymond James Stadium in Tampa, Fla., is set for 8:15 p.m. ET. The Buccaneers are 4.5-point favorites at DraftKings Sportsbook in the latest Falcons vs. Buccaneers odds, while the over/under for total points scored is 44.5 via SportsLine consensus. Before making any Bucs vs. Falcons picks, check out the NFL predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins, on picks like Baker Mayfield going Over 217.5 passing yards. Bet it at DraftKings right here:\nThe model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Falcons vs. Buccaneers. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Bucs vs. Falcons:Falcons vs. Buccaneers                                                                 spreadTampa Bay -4.5 at DraftKings SportsbookFalcons vs. Buccaneers             over/under44.5 pointsFalcons vs. Buccaneers                                                                                                                                                                             money line Tampa  Bay -239, Atlanta +195Falcons vs. Buccaneers                                                                                                                                                                     picksSee picks at SportsLineFalcons vs. Buccaneers                                                                                                                                                                       streaming Prime Video\nWhy the Buccaneers can coverVeteran quarterback Baker Mayfield powers the Tampa Bay offense. In 13 games this season, he has completed 61.6% of his passes for 2,722 yards and 20 touchdowns with six interceptions and a 90.6 rating. He has also rushed 43 times for 285 yards (6.6 average) and one touchdown. In the first meeting against the Falcons on Sept. 7, he completed 17 of 32 passes for 167 yards and three touchdowns, while rushing five times for 39 yards.His top target has been rookie wide receiver Emeka Egbuka. In 13 games, he has 54 receptions for 806 yards (14.9 average) and six touchdowns. In the season-opening win at Atlanta, he caught four passes for 67 yards and two touchdowns. In a 28-23 loss to the New England Patriots on Nov. 9, he had six receptions for 115 yards and one touchdown. See which team to back at SportsLine. Bet Mayfield to go Over 19.5 completions at DraftKings:\nWhy the Falcons can coverWith Michael Penix Jr. (knee) out for the season, veteran Kirk Cousins has taken over at quarterback. In six games, he has completed 84 of 138 passes (60.9%) for 845 yards and three touchdowns. In a 24-10 win at New Orleans on Nov. 23, he completed 16 of 23 passes for 199 yards and two touchdowns with one interception. In a 27-24 loss to the New York Jets on Nov. 30, he completed 21 of 33 passes for 234 yards and one touchdown. Powering the Atlanta rushing attack is third-year veteran running back Bijan Robinson. In 13 games, he has carried 215 times for 1,081 yards (5.0 average) and five touchdowns. He has five explosive plays of 20 yards or more, including a long of 81, with 48 first-down conversions. He also has 56 receptions for 602 yards (10.8 average) and two touchdowns. See which team to back at SportsLine.Bet Robinson to go Over 73.5 rushing yards at DraftKings:\nHow to make Falcons vs. Buccaneers picksSportsLine's model is going Over on the total, projecting 46 combined points. It also says one side of the spread hits in over 50% of simulations.         You can only get the pick at SportsLine. Bet the Over at DraftKings right here:\nSo who wins Buccaneers vs. Falcons, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Falcons vs. Buccaneers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons vs. Buccaneers prediction, odds, time: 'Thursday Night Football' picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/052d899f-2b3c-4b3d-8d00-01e7a7ff3ad2/thumbnail/1200x675/fa15094e1ddc436c53829d6978963c04/baker-mayfield-tampa-bay-buccaneers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-10T23:28:50.000Z",
      "dateModified": "2025-12-10T23:28:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Francis Ngannou: PFL contract could end in time for UFC event at White House - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/francis-ngannou-jon-jones-ufc-white-house-card-pfl-contract-end-date/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/4688387c-d559-4ae8-8d64-b2aa4803dafb/thumbnail/1200x675/7f0339d099ff1f13701e059b5df082e5/francis-ngannou-ufc-cbs-sports-mma-dec-10-2025.jpg",
    "tag": "Sports",
    "date": "2025-12-10T22:47:48.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Francis Ngannou wants the elusive fight against Jo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Francis Ngannou wants the elusive fight against Jon Jones and calls the UFC's upcoming White House card a perfect venue for it. Ngannou revealed on Wednesday that his PFL contract will expire in time for next year's White House card, but it would require fences to be mended with Dana White and UFC.Ngannou left the UFC in January 2023, vacating the UFC heavyweight championship and later signing with the PFL. Since then, he's fought once in mixed martial arts, knocking out PFL heavyweight tournament winner Renan Ferreira. \"The Predator\" is expecting a new fight offer from the PFL, with his contract expiring soon.\"I'm getting very close on the PFL contract [ending],\" Ngannou told \"The Ariel Helwani Show\" on Wednesday. \"They have to give me a fight.\" Ngannou said his PFL contract will expire before the UFC's White House card, which is widely expected to take place in June. When asked if Ngannou is interested in pursuing a fight with Jones, Ngannou said, \"Yes, if that could happen.\"  \n\"Confident, no, but there's a chance,\" Ngannou said about the potential of a UFC reunion at the White House. \"Anything can happen.\" The biggest hurdle for Ngannou vs. Jones is the fighters' respective relationships with UFC CEO Dana White. Ngannou and White have bickered back and forth in the media for years after their 2023 negotiations for a new contract fell through. White has also repeatedly thrown cold water on Jones' campaign to fight at the White House, claiming to not trust the all-time great to be reliable. \nNgannou has boxed more than he's fought in MMA since leaving the UFC. He took former unified heavyweight boxing champion Tyson Fury to a shockingly close split decision in Ngannou's professional boxing debut. His sophomore stint ended far worse, with Anthony Joshua knocking him out in two rounds. Aside from the Jones fight, Ngannou is also interested in fighting Deontay Wilder in some capacity. Wilder recently claimed negotiations for an Ngannou fight were \"warming up.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Francis Ngannou: PFL contract could end in time for UFC event at White House - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/4688387c-d559-4ae8-8d64-b2aa4803dafb/thumbnail/1200x675/7f0339d099ff1f13701e059b5df082e5/francis-ngannou-ufc-cbs-sports-mma-dec-10-2025.jpg"
      ],
      "datePublished": "2025-12-10T22:47:48.000Z",
      "dateModified": "2025-12-10T22:47:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Suns vs. Thunder: Live stream, channel, NBA Cup bracket - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-cup-2025-bracket-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/ece58854-c411-4f01-9ee4-eb5a51418316/thumbnail/1200x675/9f20a4e5eb30de608c4f9c1b1d24984e/jalen-williams-gillespie-getty.png",
    "tag": "Sports",
    "date": "2025-12-10T23:46:02.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA Cup quarterfinals are here. Six teams rema",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA Cup quarterfinals are here. Six teams remain in the battle to win the league's in-season tournament, and that number will be cut to four by the end of Wednesday night. The semifinals are set in the East as the Magic and Knicks were both victorious on Tuesday night. The Magic rallied after giving up the first 15 points to the Heat to come back and defeat their in-state rival. The Knicks, meanwhile, got 35 points from Jalen Brunson in a road win against the Raptors. The Magic and Knicks will meet up in the semis on Saturday. The West quarterfinals are set for Wednesday night as the Thunder host the Suns before the Lakers and Spurs meet up.The 19-1 Thunder are currently the favorites to win the 2025 NBA Cup (-125 at FanDuel). The Bucks won the competition last year, and the Lakers won the initial version in 2023.NBA Cup knockout stage scheduleTuesday, Dec. 9Magic 117, Heat 108Knicks 117, Raptors 101Wednesday, Dec. 10Suns at Thunder (-14.5) | 7:30 p.m. ET | Amazon Prime VideoSpurs at Lakers (-4.5) | 10 p.m. ET | Amazon Prime VideoSaturday, Dec. 13Magic vs. Knicks | 5:30 p.m. ET | Amazon Prime VideoSuns/Thunder vs. Spurs/Lakers | 9 p.m. ET | Amazon Prime VideoTuesday, Dec. 16TBD vs. TBD | 8:30 p.m. ET | Amazon Prime VideoThe Heat, Magic, Knicks, Raptors, Suns, Thunder, Spurs and Lakers made the knockout stage by going 3-1 or better in group play. The Thunder, Lakers, Raptors and Magic all went unbeaten in the group stage. Our Sam Quinn has winners and losers of the group play stage.\nThe quarterfinal games are all being played in home markets of the higher seeds, but the semifinals on Saturday and the finals on Dec. 16 will be held in Las Vegas.2025 NBA Cup bracket\n                                                                    NBA\n                                                            NBA Cup group play standings\n                                                                    NBA\n                                                            \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Suns vs. Thunder: Live stream, channel, NBA Cup bracket - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/ece58854-c411-4f01-9ee4-eb5a51418316/thumbnail/1200x675/9f20a4e5eb30de608c4f9c1b1d24984e/jalen-williams-gillespie-getty.png"
      ],
      "datePublished": "2025-12-10T23:46:02.000Z",
      "dateModified": "2025-12-10T23:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan's next coach will be charged with rehabbing program's broken reputation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigans-next-coach-tarnished-reputation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/2cc04be5-2694-4256-bb11-72afabb65e4c/thumbnail/1200x675/3e7b658e5a917634ec16c97931c5560d/michigan-tunnel-1.jpg",
    "tag": "Sports",
    "date": "2025-12-11T00:29:23.000Z",
    "description": "\n        For more than a century, Michigan football has held itself up as a paragon of morality in a chaotic college athletics world. The Wolverines p",
    "body": "\n        For more than a century, Michigan football has held itself up as a paragon of morality in a chaotic college athletics world. The Wolverines pride themselves on producing \"Michigan Men,\" people of character who go on and have lifelong success off the field. Through that way, Michigan became the winningest program in the history of the sport and the first to clear 1,000 victories. And through its proud history, the Wolverines have largely avoided major scandal -- a historic contrast to the perceived win-at-all-costs attitudes of the Southeastern Conference. If the past few years have been any indication, that image has been dramatically tarnished. And the next hire at Michigan will be tasked with fixing it. On Wednesday, Michigan coach Sherrone Moore was fired in his second season after an internal investigation found he had an inappropriate relationship with a staff member. He went just 15-8 in two years after taking the reins of a national championship team from Jim Harbaugh. \nIf Moore sought employment elsewhere, he would have both an active show-cause and a one-game suspension because of his involvement in another scandal, the Connor Stalions sign-stealing investigation. The former head coach Harbaugh was also implicated in the probe. In a separate case, former co-offensive coordinator Matt Weiss was dismissed and remains under federal indictment after illegally accessing thousands of student files. And then, there was also the other NCAA investigation into Harbaugh for alleged dead-period recruiting violations during the pandemic. The contacts would have likely received a slap on the wrist, but Harbaugh was defiant with investigators, which landed him in more hot water. \nUltimately, Michigan fought through all this chaos to win the 2023 national championship -- the program's first since 1997 and first outright since 1948. Maybe, shrugging off the reputation of choir boys for scandal was worth it. But for one of the legitimately outstanding public institutions in the country, this malfeasance is beneath them. Now let's be clear, the definition of wrongdoing has changed dramatically in modern history. Paying players is no longer against the rules, so Michigan should have no shame enticing elite players like quarterback Bryce Underwood to Ann Arbor with hefty paychecks. In fact, the sport is leaning far more in the direction of well-monied, metropolitan programs like Michigan. Embrace it. But in the case of Stalions, Michigan called into question the integrity of actual on-field play -- and they didn't even need to. The Wolverines went undefeated after firing him, adding an unnecessary asterisk to their run. Moore now adds personal shortcomings to the list. That has to be a bright red line that Michigan will not tolerate. \nAnd while Michigan's win-at-all-costs approach obviously bore fruit, there's no reason to believe it's necessary for a major blue blood. Ironically, heavy rivals Ohio State and Notre Dame each reached the national championship game last year largely free of off-field controversy. It can be done at Michigan, and will be done, at least with the right hire. There's a lot to like at Michigan. Quarterback Bryce Underwood showed flashes of greatness during an encouraging freshman season. The Wolverines signed the No. 11 high school class, if the next coach can keep them together. The talent level on the roster is trending upwards as recruiting nationalizes. In fact, despite the timing of the move, Michigan could rival LSU as the top opening of the college football cycle. As the only Power Four job still open, the Wolverines have time to catch their breath and identify the new face of the program. And that person must understand how Michigan should do business. \nFrom 1900-1989, Michigan was coached by a College Football Hall of Fame coach every year. Gary Moeller broke the streak after he was forced to resign in 1995 after an arrest for disorderly conduct, but Lloyd Carr made it 10 out of 11 coaches to reach the Hall of Fame. It's an unbelievable run of success, unmatched in the history of the sport. College Football Hall of Famers are one of Ann Arbor's greatest exports. It won't take compromising to find the next one. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan's next coach will be charged with rehabbing program's broken reputation - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/2cc04be5-2694-4256-bb11-72afabb65e4c/thumbnail/1200x675/3e7b658e5a917634ec16c97931c5560d/michigan-tunnel-1.jpg"
      ],
      "datePublished": "2025-12-11T00:29:23.000Z",
      "dateModified": "2025-12-11T00:29:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy fallout: Pete Alonso joins Orioles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-reaction-pete-alonsos-signs-with-orioles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/6a1c3f20-6478-4c2c-8243-709340592afa/thumbnail/1200x675/7f90ec1a8df72a634cbce5fb3fc7c24f/pv-pete-alonso-bump-00-00-06-27-still001.jpg",
    "tag": "Sports",
    "date": "2025-12-10T22:11:19.000Z",
    "description": "\n        After he sat on the free agent market until February last offseason, Pete Alonso found his home much earlier this time around. And, for the f",
    "body": "\n        After he sat on the free agent market until February last offseason, Pete Alonso found his home much earlier this time around. And, for the first time in his professional career, he won't be with the Mets, as he landed with the Orioles Wednesday on a five-year deal that will make him one of the highest-paid first basemen in MLB history. And it's a move that answers some questions for the Orioles lineup in 2026 and raises plenty more for the Mets. Let's start with what this deal means for Alonso's 2026 Fantasy Baseball value before pivoting to look at the fallout for both the Orioles and Mets lineups. It's an upgrade in park, especially if you take out the years from 2022 and 2024, when the Orioles had the most punishing left field dimensions in baseball. In the four other years of Alonso's career, he would have hit 158 homers at Camden Yards, including 45 in 2025, per Statcast data; in those same four seasons, Alonso would have hit 145 at Citi Field, including just 36 in 2025. One-year park factor numbers are incredibly noisy, but there's no question that Camden played as a much more hitter-friendly park in 2025 after they moved the fences in and lowered them, and while it won't be quite as friendly as it was prior to 2022, it should generally play better than Citi Field.It's a lineup downgrade, or at the very least a lineup context downgrade. The Orioles are deep and full of potential after adding Taylor Ward and Alonso, and this should be a vastly improved offense overall. But Alonso will go from hitting behind Francisco Lindor and Juan Soto to hitting behind … well, not Francisco Lindor and Juan Soto. Jackson Holliday, Jordan Westburg, and Gunnar Henderson could, in theory, be a pretty good top-of-order trio for Alonso to hit behind, but even the rosiest expectations won't put them in the same universe as the Lindor-Soto combo, so expecting a downgrade in run production for Alonso isn't unreasonable. \nOn the whole, it's probably a wash in terms of Alonso's 2026 value. The question is whether the skills gains Alonso showed in 2025 can stick. Alonso shortened his swing a bit without losing any bat speed, and the result was the best quality of contact of his career. His 93.5 mph average exit velocity was his best ever by more than 2 mph, and he managed that without a worst strikeout rate or any real changes in his batted-ball directions. That explains the big improvement in batting average we saw from Alonso, which was backed up by the best xBA (.278) of his career. Alonso has never been a pure pull-side power guy, and that's a narrow path to walk without elite quality of contact – hitting a lot of fly balls to the power alleys can result in a lot of 390-foot outs if you aren't hammering the ball like he did in 2025. Which is why he had emerged in recent years as more of an all-or-nothing power source than he was in 2025. Those gains help explain why he's kind of on an island at first base in drafts, with an early ADP of 28.7 – about half a round behind Nick Kurtz and Vladimir Guerrero Jr. and about 20 picks ahead of Rafael Devers, Bryce Harper, and Matt Olson. That Devers/Harper/Olson trio have all fallen a few rounds from last year's drafts, while Alonso has jumped from a 45.6 ADP to his near Round 2 price these days. \nI was probably going to be fading Alonso at this price before this signing, and I'm not sure this should push him any higher. I do have Alonso ranked higher than that Harper/Devers/Olson trio, but I also have him closer in my overall ranks to them than his ADP would suggest. If that gap remains, I'll probably be passing on Alonso, whose batting average risk is just hard to stomach at that price, even if he should be one of the safer bets in the entire league for 40 homers. What about the fallout for the OriolesWell, this does complicate things a bit. The Alonso signing would seem to imply the end of Coby Mayo's time in Baltimore, and that's probably for the best for all parties involved. The former top prospect just hasn't been able to translate his success in the high minors to the majors, hitting just .217/.299/.388 in his most extensive opportunity in the majors in 2025. Of course, 2025 seemed to indicate that Mayo's progression has stalled out, as he also only hit .226/.318/.452 at Triple-A – he had an OPS north of .900 in both 2023 and 2024 at Triple-A. Getting a change of scenery might be the only way Mayo turns this around, and it's also his only real chance at actually playing regularly in 2026 – his attempts to play the corner outfields have never really stuck, and his defense at third base has always been a hurdle to getting playing time. In the long run, he's probably a first baseman or DH, and the Orioles just don't have any room for him at either spot now. Making him a perfect trade candidate.\nNot that Mayo likely has much trade value these days. Neither does Ryan Mountcastle nor Heston Kjerstad, two others whose path to playing time in Baltimore has been seemingly closed off by the signing of Alonso (and the earlier trade for Taylor Ward). Turning some combination of those three into a pitcher would make a ton of sense, but it's not clear any of that trio is enough to get a big pitcher in return, even if all three might still have at least enough upside to project as average starters if they get the chance.The addition of Alonso also causes some problems for the Orioles' catching tandem of Adley Rutschman and Samuel Basallo. Basallo was expected to get some playing time at first base in addition to catcher and DH duties, but that's not going to happen with Alonso around. Basallo should still be the team's primary DH, and ideally, the Orioles will just play both Basallo and Rutschman more or less every day, either behind the plate or at DH. But this trade does give Basallo a little less flexibility, putting a lot more pressure on his bat to play more or less immediately. It didn't in his cup of coffee in 2025, as he hit .165/.229/.330. He was much more productive – like, arguably the best hitter in the league – at Triple-A and is still just 21 years old, so I'm not going to hold his struggles in his first taste of the majors against him much. Especially since he has that long-term contract locked in.\nBut there's no question Basallo has a bit more pressure to hit the ground running. And, for that matter, so does Rutschman, who has gone from looking like a perennial MVP candidate to a below-average hitter over the past year and a half. If Basallo is hitting and Rutschman isn't, that could cut into Rutschman's playing time behind the plate, and if he isn't hitting, there isn't much reason to play him at DH. I'm still ranking Rutschman and Basallo both as top-12 catchers for Fantasy in 2026, but there's a bit more risk involved with taking either (or both) now. And what do the Mets do now? Brandon Nimmo and Edwin Diaz were already out of the picture, and now Alonso follows them out the door, so this roster will look a lot different in 2026 than it has for the past half-decade or so. Credit to the Mets (I guess) for being unsentimental, but that's a lot of production out the door, and Marcus Semien and Devin Williams aren't enough to overcome it. Especially since the Mets already missed the playoffs in the first year of Juan Soto's deal.\nThey have a well-stocked farm system and Steve Cohen's billions, but this is a team that needs some reinforcements right now. As things stand, the Mets seem likely to go into battle in 2026 with Brett Baty as the primary third baseman while Mark Vientos mans first base, and while there's some upside there, that just isn't good enough. Especially with … Ronny Mauricio or Jeff McNeil (coming off Thoracic Outlet surgery) handling DH duties? Yeah, that definitely ain't good enough. There's a Kyle Tucker-shaped hole on this roster, and the offseason would look a whole heck of a lot better with Kyle Tucker filling it. It would look okay with Cody Bellinger, I suppose, but this offense could really use another sure-fire impact bat, and Bellinger definitely isn't that. Of course, there are some big needs on the pitching side, too. The Mets are a smart and well-run organization, but it's fair to say this offseason hasn't gone their way so far, and they've got some work to do to make up for it. \nI suspect they will, and I suspect this lineup will look quite a bit different on Opening Day than it appears right now. But if the Mets decide not to spend a ton of money this offseason, there will certainly be room for Baty, Vientos, McNeil, Luisangel Acuna, Jett Williams, Carson Benge, and possibly Jacob Reimer, Ryan Clifford, and A.J. Ewing to be Fantasy viable options in 2026. But if more than just a couple of them are, things have probably gone pretty wrong for the Mets. Which would be in keeping with how the offseason has gone so far. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy fallout: Pete Alonso joins Orioles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/6a1c3f20-6478-4c2c-8243-709340592afa/thumbnail/1200x675/7f90ec1a8df72a634cbce5fb3fc7c24f/pv-pete-alonso-bump-00-00-06-27-still001.jpg"
      ],
      "datePublished": "2025-12-10T22:11:19.000Z",
      "dateModified": "2025-12-10T22:11:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Real Madrid would be wrong to sack manager Xabi Alonso after UCL defeat to Man City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/real-madrid-shouldnt-fire-xabi-alonso-man-city-defeat-champions-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/37016ebb-efa7-4f6c-abee-890422a0b66b/thumbnail/1200x675/bc6bb8cdba27978dc79285fa942270a1/alonso.jpg",
    "tag": "Sports",
    "date": "2025-12-11T00:33:43.000Z",
    "description": "\n        Is this it for Xabi Alonso then? Vinicius Junior misses a few chances, Antonio Rudiger goes rogue in his penalty area and Real Madrid conclud",
    "body": "\n        Is this it for Xabi Alonso then? Vinicius Junior misses a few chances, Antonio Rudiger goes rogue in his penalty area and Real Madrid conclude that there can be no more time afforded to a coach with a proven track record of success as a player with this club and as a coach in the most remarkable of circumstances.That had been the suggestion in the Spanish press since Saturday's defeat at Celta Vigo. Fail against Manchester City and Alonso was on the brink. By his standards and Madrid's, this team had been wobbling over the last month with two wins and three defeats in their last eight. Florentino Perez has dispensed with coaches for less. But those managers have not been Alonso, a coach who was supposed to be empowered to bring about a \"new era.\" If this is the end, this probably isn't going to be a time period that gets much of an airing on a Perez Eras Tour.And if it is the case that Alonso departs after 22 games, then it is a suitably baffling plot twist for a club that cannot shake its inclination towards the telenovela. You simply have to hang around for the next episode because right now it's not entirely clear why exactly Manchester City beat Real Madrid, and it's not certainly entirely clear why that particular result should cost Alonso his job. To address that latter point first, a second defeat to English opposition means that Madrid are seventh in the league phase of the Champions League with games against Monaco and Jose Mourinho's Benfica to come. Though their old boss would doubtless love to play spoiler, Madrid can probably expect to get six points, and with that, they would be a near lock for top eight. Doubtless, it would be preferable to have the home advantage that comes with a top-two seeding but there is no cause for panic.\nNor is there in La Liga. Again, a four-point deficit to Barcelona is suboptimal, but Alonso has beaten them once this season. In the month since, they have nine points from a possible 18 but scored 10 goals from 14.4 expected goals (xG). A bit of better finishing from those not named Kylian Mbappe, sidelined Wednesday with a muscle issue, and the table might look very different. Fundamentally, there is nothing that has gone wrong on the pitch so far this season that cannot be rectified. Wednesday's display too was by no means a disaster. Giving up over 2.5 xG to City doesn't look nice in isolation but 1.92 of it came in the space of 10 weird minutes late in the first half. Thibaut Courtois spilled a corner, Rudiger got too close to Erling Haaland. Do you sack a manager because two experienced defenders made individual errors? Would you continue to employ him if Brahim Diaz got his header on target, if Vinicius Junior's bicycle kick was struck that bit sweeter or if Mbappe had been a bit fitter and changed this game from the bench?Perhaps not, given so few of the questions around Alonso have been about his ability to coach this team successfully. He can broadly say he has done that. Last season in La Liga and Champions League play, Madrid created shots worth 1.76 non-penalty expected goals (npxG) and gave up 1.17. This season, they are at 1.99 and 1.11, their points per game tally drifting up too. They aren't yet at best-team-in-Europe levels but Alonso knows better than most that this club can take its time to move through the gears. Right now, they are motoring along quite nicely.\nThen again, this is Real Madrid. This isn't a tactics gig, as Thierry Henry explained on the UEFA Champions League Today pre-match show. \"You have a guy there who is coaching a bit too much and not managing enough,\" he said. \"Gareth Bale was sitting there the other day and telling us that at Madrid, what you need to do is manage players.\"I feel sorry for Xabi Alonso because you could see what he did at Leverkusen when he was able to coach a team that was going to listen to what he wanted to do. It's a different ball game.\"\nIt is certainly true that the way Alonso started his managerial career would be asking for trouble at Madrid. When he took his first senior coaching position with Leverkusen, the Spaniard surprised his squad with an obsessive focus on tightening up the defense. Some within the Bay Arena dressing room had expected one of the great deep playmakers of his day to send them straight in at the deep end with front-footed positional play and were surprised by what they got.A young squad who had never won anything as a collective could hardly question Alonso's methods. A group who won the Champions League before many were old enough to hire a car? They might have preconceived notions about what happens (or does not) when they lose the ball. Take, for instance, Vinicius Junior, whose supposed rift with Alonso has been as major plotline through the early months of the season as the goalscoring feats of Mbappe. The vast majority of his career has been under the tutelage of Zinedine Zidane and Carlo Ancelotti, both of whom interpreted the Madrid management gig in laissez-faire fashion. A hands-off approach brought both collective and individual glory without players being summoned in for daily pre-training meetings.Perhaps Wednesday night functioned as a reminder that not everyone has been alienated by Alonso. Rodrygo came out with a punchy defense at the final whistle, insisting, \"We are with [Xabi Alonso]. We need this unity to move forward.\" Their relationship during the Club World Cup had been the first sign of superstars butting up against this new style of management. Rodyrgo's embrace of his coach after his substitution is a reminder that bridges can be built. Jude Bellingham was similarly supportive while Raul Asencio was even more forthright. \n\"We are with Xabi Alonso to the death,\" said the young center back. \"We understand his message. You saw the change of attitude tonight.\" That last line is the most significant. It is easy for players to say one thing to the cameras and another behind closed doors but for much of this game, Madrid played like a team fighting for something or someone. The Vinicius, Rodrygo tandem might have created even more than it did. In the first half in particular, there was much to admire in the defensive organization, the way there was always a second body to block a Jeremy Doku cross with Bellingham and Dani Ceballos working hard without the ball.More than any coach, Alonso finds himself in a results, not performance business, but there was nothing in this game to suggest that future results are beyond Madrid. After all, they have a coach whose methodical approach can have a meaningful impact on the vibes that seem to carry more weight than any predictive metric.\nLeverkusen players adored Alonso's eye for the \"small details.\" By the time he had been in the job for a year, his ability to coach them on so many facets of the game was functioning as a type of management. His team were so prepared and drilled that they came to believe at the deepest level that they could not be beaten. There was a reason for that meme that pitted Alonso's Leverkusen against Madrid in a never-ending, no-one loses sort of game. Alonso had imbued Leverkusen with that very Madrid-ian belief in their own invincibility. He can coach squads and he can motivate them, too. And if a serial winner as a player and coach can't find a way to get these players bought into a more organized way of playing, can anyone? If Alonso goes, is there any point in asking his successor to do much more than take the pre-match press conferences and pose for photos? Perhaps they could pick the dressing room music too and hang the Christmas decorations? After all, should Alonso go, then Madrid are making plain that they want a vibe conductor rather than a tactician. They might as well lean into it.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Real Madrid would be wrong to sack manager Xabi Alonso after UCL defeat to Man City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/37016ebb-efa7-4f6c-abee-890422a0b66b/thumbnail/1200x675/bc6bb8cdba27978dc79285fa942270a1/alonso.jpg"
      ],
      "datePublished": "2025-12-11T00:33:43.000Z",
      "dateModified": "2025-12-11T00:33:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee expected to hire Jim Knowles: Vols adding proven DC to fix struggles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tennessee-defensive-coordinator-jim-knowles-josh-heupel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/a25af82b-0a21-4a60-93c9-390326b43b65/thumbnail/1200x675/b3abfdeb50e5871f295c505a86d6c1ca/jim-knowles.jpg",
    "tag": "Sports",
    "date": "2025-12-10T21:27:05.000Z",
    "description": "\n        Tennessee is expected to hire Jim Knowles as its next defensive coordinator following the firing of Tim Banks earlier this week, Matt Zenitz ",
    "body": "\n        Tennessee is expected to hire Jim Knowles as its next defensive coordinator following the firing of Tim Banks earlier this week, Matt Zenitz reports. The move signals a major effort by coach Josh Heupel to re-establish defensive identity after a costly drop-off in performance in 2025.Banks, who was dismissed Monday after five seasons in Knoxville, saw his defense collapse this fall. Once a unit that helped carry Tennessee into the College Football Playoff just a season ago, the Volunteers surrendered 28.8 points per game and allowed 395.5 yards on average -- both third-worst in the SEC.Enter Knowles, who after spending 2025 at Penn State, will not be retained by incoming coach Matt Campbell.Knowles' coaching résumé is among the most decorated for a defensive coordinator. Before Penn State, he spent three seasons as defensive coordinator at Ohio State -- including the 2024 national championship season, when his defense ranked No. 1 in the country in both scoring (12.9) and total defense (254.6).\nEarlier stops at Oklahoma State (2018-2021) and Duke (2010-2017) likewise cemented his reputation as a sharp defensive strategist and solid developer of talent. What does it mean for Tennessee?For Tennessee, the hire represents a clear acknowledgment that 2025's defensive collapse cannot be ignored. Bringing in a coordinator with championship-level pedigree and experience retooling defenses at multiple Power Four programs may be exactly what the Volunteers need to rebound. Especially with questions lingering over depth and scheme consistency after a turnover-heavy roster and porous secondary -- which ranked 115th in the FBS in passing yards allowed per game (248.8) -- derailed the season.But the fit isn't guaranteed to be seamless, and Knowles inherits sizable challenges. Transitioning to his system typically requires an adjustment period, a trend reflected in the modest results during his first seasons at Oklahoma State and Ohio State before each defense made significant Year 2 leaps, followed by even sharper refinement and consistency in Year 3. \nHis only previous SEC experience also came more than two decades ago as a linebackers coach at Ole Miss in 2003, adding another layer of adaptation as he steps back into the conference.Tennessee will likely need to lean on the transfer portal and recruiting to fill holes, particularly in the secondary and along the interior of the defensive front. Why Knowles' adaptability matters for TennesseeOne of the more revealing parts of Knowles' career arc is how flexible he has been when circumstances demand it. Across multiple stops, his defenses have reflected not just his own schematic preferences but the realities of the roster in front of him. At Ohio State, that meant shelving some of the three-man front structures and hybrid packages that became staples of his work at Oklahoma State and Duke. The Buckeyes' established four-down philosophy -- and the presence of veteran defensive line coach Larry Johnson deeply rooted in that approach -- forced Knowles to build a top-ranked unit through a different lens. He created a defense that remained aggressive while fitting the strengths of a deep, traditional Big Ten front.\nBut that flexibility has limits. Knowles left Ohio State after a national championship season in part because expanded oversight from Ryan Day narrowed his ability to independently shape the defense. For a coach known for disappearing into the film room and emerging with intricate game plans tailored to matchups and personnel, that autonomy matters. Tennessee could be betting that giving Knowles space -- and players suited to his toolbox -- will unlock the creativity and week-to-week adaptability that have defined his best work.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee expected to hire Jim Knowles: Vols adding proven DC to fix struggles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/a25af82b-0a21-4a60-93c9-390326b43b65/thumbnail/1200x675/b3abfdeb50e5871f295c505a86d6c1ca/jim-knowles.jpg"
      ],
      "datePublished": "2025-12-10T21:27:05.000Z",
      "dateModified": "2025-12-10T21:27:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB Rule 5 Draft: Analyzing all 13 picks, including a former top 100 prospect - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rule-5-draft-results-picks-yankees-griff-mcgarry/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/f72c0f87-6d42-4e1e-923c-50e36eb508d8/thumbnail/1200x675/81d31068df3f8535d2009bf80c0f83db/mcgarry-getty.png",
    "tag": "Sports",
    "date": "2025-12-10T21:04:19.000Z",
    "description": "\n        The 2025 Winter Meetings in Orlando unofficially wrapped up Wednesday afternoon with the annual Rule 5 Draft. The Rule 5 Draft gives minor le",
    "body": "\n        The 2025 Winter Meetings in Orlando unofficially wrapped up Wednesday afternoon with the annual Rule 5 Draft. The Rule 5 Draft gives minor leaguers who are not top prospects a big-league opportunity  by making it more difficult for clubs to stash players in the minors  indefinitely.  Generally speaking, college players drafted no  later than 2022 and high  school players drafted no later than 2021 were eligible this  winter, as were players signed  internationally no later than 2021. Players who meet that criteria and  are not on the 40-man roster are eligible to be selected.    Players  selected in the Rule 5 Draft must remain on their new team's MLB roster  all next season, otherwise they must pass through waivers and be  offered back to their original team. A dozen or so players are selected in the Rule 5 Draft each year but very few actually stick with their new team.  The White Sox struck Rule 5 Draft gold with righty Shane Smith last year. He threw 146 ⅓ innings with a 3.81 ERA in 2025, and became only the second Rule 5 Draft pick to go to the All-Star Game the next season, joining Dan Uggla. Most Rule 5 Draft picks are middle relievers and bench guys.  \nTeams do not have to make a Rule 5 Draft pick, and they can make as many picks as they have open 40-man roster spots. A total of 13 picks were made this year. Here is what you need to know about each of this year's Rule 5 Draft selections.    1. Rockies: RHP RJ Petit (Tigers)  Petit, 26, is exactly the kind of player typically taken in the Rule 5 Draft. He's had success in the upper minors (2.44 ERA while striking out close to 30% of the batters he faced at Double-A and Triple-A in 2025), he has velocity (touches 98 mph), and he has a bat-missing secondary pitch (slider). He also toys around with a curveball. Petit is a massive human -- he's listed at 6-foot-8 and 300 pounds -- and, given the state of Colorado's pitching staff, he stands a good chance to stick in their MLB bullpen in 2026.    2. White Sox: RHP Jedixson Paez (Red Sox)  A control artist, Paez will turn only 22 in January, and he's never pitched above Single-A. That jump to the big leagues makes it unlikely he will stay on Chicago's roster next season, though it's worth a shot. Paez was limited to 19 ⅓ innings by a calf injury in 2025, during which he struck out 23 and walked three. He sits low-90s and has four other pitches (curveball, changeup, two sliders). Paez is a project, though the command is very good. If the velocity ever ticks up, he could be a valuable big leaguer.  \n  3. Nationals: RHP Griff McGarry (Phillies)  Once a top 100 prospect, McGarry's stock has fallen the last few seasons, though he has enough talent to remain on at least one team's radar. Here's what our R.J. Anderson wrote about him in our Rule 5 Draft preview:  There's undeniable talent  here, but it's overshadowed by unreliable usability. He spent most of  last season in Double-A, a step back from the year before, and all you  need to know about this performance is that he walked nearly 15% of the  batters he faced. McGarry has quality stuff, including a heater that  sits in the mid-90s and a nasty sweeper, so if he ever unlocks a little  more command he's going to be a force coming out of some team's  bullpen. \t \tMcGarry's walk issues could make it tough to stick next year, though the Nationals are in position to ride it out for a while.    4. Giants via Twins: C Daniel Susac (Athletics)  A trade! The Twins selected Susac with their Rule 5 Draft pick and immediately traded him to the Giants for minor-league catcher Miguel Carabello, the team announced. Rule 5 Draft trades like this are arranged ahead of time. The Twins were not planning to make a Rule 5 Draft pick for themselves, so they found a team that wanted to move up and brokered a deal. The Giants did it because they really wanted Susac but weren't sure he would make it to their pick. Susac, 24, slugged 18 home runs in Triple-A this past season and has the tools to be a dingers-and-defense backup catcher. His older brother, Andrew, played six years in the big leagues, including 2014-15 with the Giants. Carabello is a 17 year old who played 2025 in the Dominican Summer League, the lowest level of the minors. He's a long shot lottery ticket.  5. Rangers via Pirates: RHP Carter Baumler (Orioles)  Injuries, including shoulder trouble, have limited Baumler to 88 ⅔ innings since 2021. He struck out 46 batters with a 2.04 ERA in 39 ⅔ innings in 2025, finally reaching Double-A. When healthy, Baumler works with an upper-90s fastball that has analytics-friendly traits (i.e. rise at the top of the zone) and a hard mid-80s curveball. He finished this past season healthy and the Rangers surely did their homework before making a trade with the Pirates to get him in the Rule 5 Draft. Pittsburgh received cash and minor-league righty Jaiker Garcia in the trade, the team announced. Garcia, a former infielder, converted to pitching in 2023.\n  6. Athletics: RHP Ryan Watson (Giants)  Watson, 28, is another hard-thrower who has missed a lot of time with injuries. That is standard fare in the Rule 5 Draft. This past season, Watson threw 50 ⅓ innings with 64 strikeouts and only 14 unintentional walks, and he played the entire year in Triple-A. That upper-level success, plus a mid-90s fastball and good slider, give Watson a chance to stick with the Giants in 2026.    7. Cardinals: RHP Matt Pushard (Marlins)  Similar to Watson, Pushard is a Triple-A battle-tested reliever who had a strong 2025: 3.61 ERA with close to a 30.0% strikeout rate in 62 ⅓ innings. Here's what our R.J. Anderson wrote about Pushard in our Rule 5 Draft preview:  Pushard celebrated his 28th birthday in October, making him the oldest  player on this list -- blame that on the fact he didn't turn  professional (as an undrafted free agent) until just before his 25th  birthday. Pushard, a Maine native, could be on the cusp of making his  big-league debut if he's selected this week. His arsenal includes a  mid-90s fastball and a couple of average or better breaking balls. It  doesn't take much of an imagination to envision him slotting in as a  middle relief option.   \t \tPushard was considered one of the most MLB-ready players available in the Rule 5 Draft and it was something of a surprise when Miami didn't add him to their 40-man roster prior to the protection deadline in November.  \n  8. Astros: RHP Roddery Muñoz (Reds)  Every so often, a player with MLB experience gets picked in the Rule 5 Draft, and that happened with Muñoz. The 25-year-old has bounced around waivers the last few years and he pitched to a 6.78 ERA in 93 ⅔ big-league innings with the Marlins in 2024 and the Cardinals in 2025. Houston will see whether they can unlock Muñoz's mid-90s sinker, low-90s cutter, and upper-80s slider.     9. Guardians: RHP Peyton Pallette (White Sox)  In 2022, Pallette was considered a candidate to go No. 1 overall in the amateur draft, though he never pitched that spring because of Tommy John surgery. He fell to the second round and has since moved to the bullpen, where he had a 4.06 ERA with a 32.5% strikeout rate in 64 ⅓ innings in 2025, most in Triple-A. Pallette works with a mid-90s fastball and two breaking balls. Cleveland is one of the top pitching organizations in the game. It stands to reason Pallette has a good chance to stick in their bullpen next year.    10. Blue Jays: RHP Spencer Miles (Giants)  Miles missed all of 2023 with back surgery, then most of 2024 and all of 2025 with Tommy John surgery. He returned to the mound in the Arizona Fall League in October, where he allowed five runs in 8 ⅔ innings while striking out 12 and walking one. Miles sat mid-90s with his four-seamer and sinker in the desert and also showed a slider, a curveball, and a changeup. It can be difficult for contending teams to keep a Rule 5 Draft pick because they need players who can help them win, so the odds are stacked against Miles in 2026. The defending American League champion Blue Jays are at least willing to give the 25-year-old a look in spring training.    11. Yankees: RHP Cade Winquest (Cardinals)  Winquest, 25, is the rare Rule 5 Draft pick who spent his most recent season as a healthy starting pitcher. He made 23 starts and threw 103 innings, mostly in Double-A, and had a 3.99 ERA with a 48.0% round ball rate. Winquest sits mid-90s with his fastball and his go-to secondary pitch is a curveball. He also has a changeup. It will be basically impossible for the Yankees to deploy Winquest as a starter in 2026 while also contending. More likely, he'll be a low-leverage long man, if he makes the roster. He is the first Yankees Rule 5 pick since 2011.\n  12. Phillies: RHP Zach McCambley (Marlins)  A slider monster, McCambley leaned on his mid-80s bender as much as any pitch in 2025, during which he had a 2.90 ERA with 83 strikeouts and 20 unintentional walks in 62 relief innings. The 26-year-old made it up to Triple-A and also has a mid-90s fastball and a cutter. It can be difficult for a contender to hide a Rule 5 Draft pick on their active roster all season, though McCambley has the stuff to be a big league factor in the future.    13. White Sox: RHP Alexander Alberto (Rays)  The White Sox were the only team to make two Rule 5 Draft picks this year. Alberto is a big guy (6-foot-8 and 203 pounds) who has touched 100 mph with his cutter, and also has an upper-80s slider. That two-pitch arsenal allowed the 24-year-old to run a 2.59 ERA with a 30.6% strikeout rate in 48 ⅔ innings in 2025, none above Single-A. Occasional control issues and the fact he's never pitched at or above Double-A make it unlikely Alberto will stick in 2026, but for the White Sox, he's a worthwhile roll of the dice, especially in the second round of the Rule 5 Draft.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB Rule 5 Draft: Analyzing all 13 picks, including a former top 100 prospect - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/f72c0f87-6d42-4e1e-923c-50e36eb508d8/thumbnail/1200x675/81d31068df3f8535d2009bf80c0f83db/mcgarry-getty.png"
      ],
      "datePublished": "2025-12-10T21:04:19.000Z",
      "dateModified": "2025-12-10T21:04:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bucs activate WRs Mike Evans, Jalen McMillan ahead of 'TNF' matchup with Falcons - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-injuries-mike-evans-jalen-mcmillan-returns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/baeec5bf-ed91-4117-9d98-0a627f867e58/thumbnail/1200x675/f1d9c1d02b9e6cac8224a0a27f802374/mike-evans-getty.png",
    "tag": "Sports",
    "date": "2025-12-10T21:02:24.000Z",
    "description": "\n        The Tampa Bay Buccaneers are, at long last, getting healthy. Tampa Bay activated star wide receiver Mike Evans as well as second-year wide re",
    "body": "\n        The Tampa Bay Buccaneers are, at long last, getting healthy. Tampa Bay activated star wide receiver Mike Evans as well as second-year wide receiver Jalen McMillan on Wednesday, a day before they are set to take on the Atlanta Falcons on \"Thursday Night Football.\"Evans, 32, broke his collarbone and suffered a concussion in Week 7 against the Detroit Lions, landing hard after nearly reeling in a deep pass from Baker Mayfield. That had been Evans' first game back since Week 3, when he suffered a hamstring injury. Coach Todd Bowles said after the Lions game that the collarbone injury would keep Evans \"out mostly toward the end of the year.\"Evans has 14 catches for 140 yards and one touchdown, so while his record-tying streak of 11 straight 1,000-yard receiving seasons is over, the fact that he's returning on the earlier side of the timeline set by Bowles is a very good sign for Tampa Bay.\n        \n            \n                Buccaneers vs. Falcons prediction: Can Baker Mayfield and Co. get back on track to secure NFC South lead?\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nMcMillan, 23, reeled in 37 catches for 461 yards and eight scores last season as a third-round rookie out of Washington; the eight touchdown catches were third-most by a rookie in franchise history. Expected to open the season as a starter, McMillan landed awkwardly after trying to catch a high throw in the preseason and suffered a \"severely sprained neck\" that had him in a brace for several months.\nBuccaneers finally getting healthyTampa Bay has battled a litany of injuries this season. Star left tackle Tristan Wirfs underwent knee surgery shortly before the regular season began and missed the first three games of the season. Likewise, wide receiver Chris Godwin, recovering from a severe leg/ankle injury last season, did not debut until Week 4. Godwin then missed Weeks 6-11 with a fibula injury. Bucky Irving recently returned to the lineup after missing extensive time due to foot and shoulder injuries. Up front, right tackle Luke Goedeke missed extensive time with a foot injury and right guard Cody Mauch suffered a season-ending knee injury in Week 2.Despite that, Tampa Bay is 7-6 and atop the NFC South. Mayfield has thrown for 2,722 yards, 20 touchdowns and six interceptions. Rachaad White and Sean Tucker played well in Irving's absence, and standout first-round rookie Emeka Egbuka has shined with 806 receiving yards and six touchdowns. He and seventh-round rookie Tez Johnson (five touchdowns) have been on the receiving end of more than half of Mayfield's touchdowns.Tampa Bay is yet to play a snap this season with its top three wide receivers -- Evans, Egbuka and Godwin -- on the field together.\nPlayoff impactEvans' and McMillan's expected returns could provide a boost to ensure Tampa Bay captures its fifth straight division title, especially considering the Buccaneers face division opponents three times over the next four weeks, including the Panthers twice.Week 15: Atlanta FalconsWeek 16: at Carolina PanthersWeek 17: at Miami DolphinsWeek 18: Carolina Panthers\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bucs activate WRs Mike Evans, Jalen McMillan ahead of 'TNF' matchup with Falcons - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/baeec5bf-ed91-4117-9d98-0a627f867e58/thumbnail/1200x675/f1d9c1d02b9e6cac8224a0a27f802374/mike-evans-getty.png"
      ],
      "datePublished": "2025-12-10T21:02:24.000Z",
      "dateModified": "2025-12-10T21:02:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 17 schedule: Texans-Chargers, Ravens-Packers chosen for Saturday doubleheader - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-schedule-week-17-texans-chargers-ravens-packers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/a3fe92a8-f397-44a8-9444-b7e3253a0122/thumbnail/1200x675/4470f8f6013493cff31fdbd7b219d111/lovejacobs.jpg",
    "tag": "Sports",
    "date": "2025-12-11T00:13:23.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL has chosen the two games for its Week 17 S",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL has chosen the two games for its Week 17 Saturday doubleheader. The Los Angeles Chargers will host the Houston Texans at 4:30 p.m. ET followed by an 8 p.m. primetime showdown between the Green Bay Packers and Baltimore Ravens at historic Lambeau Field. Both games -- which were initially slated to kickoff Sunday at 1 p.m. -- will undoubtedly have significant playoff implications. Saturday's first game will feature two teams that have an inside track to AFC playoff berths. Los Angeles (9-4) is currently holding onto the fifth seed in the AFC, while Houston (8-5) holds final playoff spot entering Week 15. The Texans are just a game behind the Jacksonville Jaguars for first place in the AFC South. The second game will impact both the AFC and NFC playoff pictures. Green Bay (9-3-1) enters its Week 15 showdown with the Denver Broncos as the NFC's No. 2 seed. Green Bay will likely need to keep winning to stay ahead of the NFC North rival Chicago Bears, who were the NFC's top-ranked team before they were defeated by the Packers this past Sunday. \n\n        \n            \n                NFL schedule Week 16 changes: Patriots-Ravens flexed into Sunday night, replacing Bengals-Dolphins\n                \n                    Bryan DeArdo                \n            \n                            \n    \n                \n                    \n    \nBaltimore (6-7) is currently on the outside of the AFC playoff picture, but is just one game behind the Pittsburgh Steelers in the AFC North division standings. A win in Green Bay would go a long way toward a possible playoff berth for the Ravens, who will end the regular season with a showdown in Pittsburgh that could very well determine which team wins the division and earns a playoff spot.Playoff implications aside, the NFL's Week 17 doubleheader will showcase some of the league's biggest stars in quarterbacks Jordan Love, Lamar Jackson, C.J. Stroud and Justin Herbert, running backs Derrick Henry and Josh Jacobs, Packers All-Pro pass rusher Micah Parsons, and Texans pass rushers Danielle Hunter and Will Anderson Jr., among others. \nThis is the Ravens' second game in as many weeks that has been moved to a different time. Baltimore's Week 16 showdown against the visiting New England Patriots was recently moved to Sunday night. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 17 schedule: Texans-Chargers, Ravens-Packers chosen for Saturday doubleheader - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/a3fe92a8-f397-44a8-9444-b7e3253a0122/thumbnail/1200x675/4470f8f6013493cff31fdbd7b219d111/lovejacobs.jpg"
      ],
      "datePublished": "2025-12-11T00:13:23.000Z",
      "dateModified": "2025-12-11T00:13:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/\n                    ",
    "image": "https://sportsfly.cbsistatic.com/fly-370/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "tag": "Sports",
    "date": "2025-12-10T20:35:51.000Z",
    "description": "\n                    \n\n                            \n            Today's Top Free Expert Picks\n        \n            \n    \n        Content on this page ",
    "body": "\n                    \n\n                            \n            Today's Top Free Expert Picks\n        \n            \n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n                    \n                                                \n\n    \n            \n            \n            \n                Thomas Casale\n            \n            \n                                    \n                    \n                                        \n        #4\n    \n                                    \n        \n            +353\n        \n        \n            (65%)\n        \n    \n                \n                                            13-7 in Last 20 NCAAB Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAB\n                                                CHARLS @ SFLA • Wed 7:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                SFLA -13.5\n                            \n                            \n                                -120\n                            \n                        \n                                                    \n                                Spread\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 9 @ 3:04pm\n                \n                    \n                \n                    Analysis\n                \n                \n                                            South Florida is a team I’m projecting to have pretty big home and away splits this season. The Bulls already have a strong win at home over Utah State and I think the line is right to take them here vs. Charleston. This isn’t the same Charleston team we are used to seeing in recent years. They play slower and have already lost to Belmont, Yale, FAU and Liberty by double digits. South Florida has topped 90 points six times this season and I think that trend continues against a Charleston defense that ranks 246th in efficiency. Play up to 14.5. \n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Matt Severance\n            \n            \n                                    \n        \n            +632.5\n        \n        \n            (64%)\n        \n    \n                \n                                            25-14-5 in Last 44 NHL Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NHL\n                                                NYR @ CHI • Wed 7:30pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                Under 6.5\n                            \n                            \n                                -130\n                            \n                        \n                                                    \n                                Over/Under\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 9 @ 3:52pm\n                \n                    \n                \n                    Analysis\n                \n                \n                                            A rare total play Wednesday as Chicago isn't scoring much of late with just six goals in the past four games. But netminder Spencer Knight has a 2.43 home GAA. The Rangers are among the worst offensive team in the NHL at 2.65 goals per game. Netminder Igor Shesterkin has allowed three or fewer goals in seven straight overall and has been better on the road with a 2.29 GAA. The Rangers' past five overall have all landed Under this total. It's the only 6.5 on our board and juiced, so it may flip soon. \n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Matt Severance\n            \n            \n                                    \n                    \n                                        \n        #5\n    \n                                    \n        \n            +189.5\n        \n        \n            (60%)\n        \n    \n                \n                                            15-10 in Last 25 NCAAB ML Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAB\n                                                STHRN @ TEXST • Wed 8:30pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                TEXST\n                            \n                            \n                                -150\n                            \n                        \n                                                    \n                                Money Line\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 10 @ 7:57am\n                \n                    \n                \n                    Analysis\n                \n                \n                                            I expect this to go up a bit. Texas State has lost three straight but is 6-0 at home. It already handled another SWAC team in San Marcos, beating Texas Southern by 10 earlier in the season. Southern is 1-5 away as it travels around cashing checks and has a quick turnaround after getting routed at Texas on Monday. TXST has won eight straight games over SWAC opponents and has been off a week to prepare. The Bobcats' DJ Hall looks for a third straight double-double, which no player at the school has accomplished since 2012. \n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Bruce Marshall\n            \n            \n                                    \n        \n            +75\n        \n        \n            (60%)\n        \n    \n                \n                                            3-2 in Last 5 NCAAB O/U Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAB\n                                                WISC @ NEB • Wed 9:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                Over 156\n                            \n                            \n                                -110\n                            \n                        \n                                                    \n                                Over/Under\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 10 @ 4:23am\n                \n                    \n                \n                    Analysis\n                \n                \n                                            The Badgers stopped playing Bo Ryan-style not long after Greg Gard took over on the bench at Madison, and Wiscy scorelines have been increasing ever since.  Already this season the Badgers are scoring almost 88 ppg with one of the rare lineups featuring a pair of 20 ppg scorers (jr. G John Blackwell and ex-FAU/San Diego State G Nick Boyd) . Not to be outdone, Fred Hoiberg's Cornhuskers are 9-0 and efficiently scoring nearly 84 ppg in the process, and among the nation's leaders with 18.6 apg. The perimeter also has a sharper edge with Iowa transfer G Pryce Sandifort (16 ppg) proving a perfect complement to 6-10 Reink Mast (18 ppg). Play Wisconsin-Nebraska Over.\n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Prop Bet Guy\n            \n            \n                                    \n                    \n                                        \n        #4\n    \n                                    \n        \n            +238\n        \n        \n            (67%)\n        \n    \n                \n                                            6-3 in Last 9 NBA Player Props Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NBA\n                                                SA @ LAL • Wed 10:00pm\n                    \n                \n                \n                    \n        \n        \n                    \n    \n                                                \n                    \n            \n                    \n                                                    \n                                D. Harper\n                            \n                        \n                            \n                                Over 15.5\n                            \n                            \n                                -122\n                            \n                        \n                                                    \n                                PTS + AST\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 9 @ 11:34pm\n                \n                    \n                \n                    Analysis\n                \n                \n                                            FanDuel. Dylan Harper is averaging 17.4 points plus assists this season, clearing this line in 9/12 full games he’s played. His usage since returning from injury has bumped upwards, with at least a 25% over the last six games. With Victor Wembanyama still sidelined, and Stephon Castle shaking off some rust from his own injury, I’m expecting another high usage effort from Harper, in his standard 20-24 minutes (with upside for more). The Lakers have struggled against ball-handling guards of late, and I like this game to have some decent pace to it. \n                                    \n            \n    \n\n                    \n                                        \n            \n        \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
      "image": [
        "https://sportsfly.cbsistatic.com/fly-370/bundles/sportsmediacss/images/fantasy/default-article-image-large.png"
      ],
      "datePublished": "2025-12-10T20:35:51.000Z",
      "dateModified": "2025-12-10T20:35:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Suns-Thunder, Lakers-Spurs in NBA Cup Wednesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-200-bonus-bets-suns-thunder-lakers-spurs-nba-cup-wednesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-10T20:57:58.000Z",
    "description": "\n        The Wednesday Western Conference NBA Cup knockout stage provides another quality chance to utilize the latest DraftKings promo code, which gi",
    "body": "\n        The Wednesday Western Conference NBA Cup knockout stage provides another quality chance to utilize the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The Oklahoma City Thunder host the Phoenix Suns at 7:30 p.m. ET, followed by the Los Angeles Lakers hosting the San Antonio Spurs at 10 p.m. ET. The SportsLine Projection Model has a play from both of these contests included in its Wednesday best bets at DraftKings Sportsbook for online sports betting on stars such as LeBron James, Luka Doncic and Shai Gilgeous-Alexander. James' over/under for total points scored against the Spurs is 18.5.The model is backing Over 225.5 total points in Suns vs. Thunder, while projecting the Spurs to cover as 7.5-point underdogs against the Lakers. Also, the model sees value in backing the New York Rangers on the road against the Chicago Blackhawks in NHL action. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight seasons. The model enters Week 8 of the 2025-26 NBA season on a sizzling 29-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Wednesday best bets at DraftKings SportsbookThunder vs. Suns: Over 225.5 pointsSpurs (+7.5) vs. LakersRangers (-140) vs. BlackhawksCombining the model's three picks into a Wednesday parlay at DraftKings would result in a payout of +508 (risk $100 to win $508). Bet it at DraftKings here:\nThunder vs. Suns: Over 225.5 points (-110)The Over has hit in four of the last five Thunder games, including in each of the last four games that Shai Gilgeous-Alexander played in. The reigning NBA MVP didn't play on Sunday, but he's off the injury report as a full-go for Wednesday to lead the No. 2 scoring offense in the NBA at 123 points per game. SGA is averaging 32.8 ppg, which ranks second in the league, while scoring more than 30 points in seven of his last eight games. The Over hit in the most recent Suns vs. Thunder game, which resulted in a 123-119 win for Oklahoma City. The model projects the Over to hit in 64.2% of simulations. Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Spurs (+7.5) vs. Lakers (-115)The Spurs are coming off a 135-132 win over the Pelicans on Monday, improving to 3-1 over their last four games and 8-3 over their last 11 contests. They are 16-7 on the season, despite Victor Wembanyama only playing in 12 games this year, and the phenom remains out on Wednesday with a calf strain. San Antonio has road victories over teams such as Denver and Orlando over this stretch, so it hasn't been simply the Spurs winning at home or over inferior opponents. Wednesday provides a significant test against LeBron James and Luka Doncic, but the Spurs have the No. 7 scoring offense at 119.6 ppg to keep pace with L.A. The model projects the Spurs to cover in 63% of simulations. Back the Spurs at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Rangers (-140) vs. BlackhawksThe Rangers have dominated off their home ice this season, going 12-4-1 away from Madison Square Garden, and they play at Chicago on Wednesday. The Rangers are coming off back-to-back losses, both at home, but they've won their last three games on the road. Meanwhile, Chicago is 2-6-2 over its last 10 games and 1-3-1 over its last five games. The model projects the Rangers to win in 59% of simulations. Back the Rangers at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more NBA and NHL picks?You've seen some of the model's Wednesday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Suns-Thunder, Lakers-Spurs in NBA Cup Wednesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-10T20:57:58.000Z",
      "dateModified": "2025-12-10T20:57:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sherrone Moore buyout, contract details as Michigan football coach is fired for cause - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/sherrone-moore-buyout-michigan-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/738eb3e9-c812-41d5-9d06-183413a7225e/thumbnail/1200x675/4d2f501428956260e2488d456d638461/untitled-design-122.png",
    "tag": "Sports",
    "date": "2025-12-11T00:34:48.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Sherrone Moore's tenure as Michigan's coach came t",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Sherrone Moore's tenure as Michigan's coach came to an abrupt end on Wednesday after he was fired. Moore was terminated for cause by the school after an internal investigation concluded the Wolverines' coach had engaged in an inappropriate relationship with a staff member. \"Sherrone Moore has been terminated, with cause, effective immediately,\" Michigan athletic director Warde Manuel said in a statement. \"Following a university investigation, credible evidence was found that Coach Moore engaged in an inappropriate relationship with a staff member. This conduct constitutes a clear violation of University policy, and UM maintains zero tolerance for such behavior.\"Moore was tabbed Michigan's coach at the conclusion of the 2023 season after Jim Harbaugh departed to coach the Los Angeles Chargers. He finished 16-8 (11-6 in Big Ten play) in his two seasons with the program. Moore had been on Michigan's staff since the 2018 campaign, when he was hired as the tight end coach.As of Dec. 1, per USA Today's college football salary database, Moore's buyout was listed at $13.89 million. That number is the second-lowest among all listed coaches from the Big Ten. Of note, USC coach Lincoln Riley and Northwestern coach David Braun did not have a buyout listed on the site. Because Moore was fired for cause, Michigan could be off the hook for some (or all) of his buyout, though cases like this have ended in court battles in the past. \nMoore is the fourth coach from the Big Ten to be fired, joining DeShaun Foster (UCLA), James Franklin (Penn State) and Jonathan Smith (Michigan State).Moore's contract at Michigan was set to pay $5.5 million in base salary and additional compensation annually through the 2029 season -- with a $500,000 retention bonus each season. \nThe original buyout was 75% of the base and additional compensation for the remainder of his contract. Moore's contract with Michigan also included the obligation to seek alternative employment, where any amount earned would offset Michigan's buyout payments.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sherrone Moore buyout, contract details as Michigan football coach is fired for cause - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/738eb3e9-c812-41d5-9d06-183413a7225e/thumbnail/1200x675/4d2f501428956260e2488d456d638461/untitled-design-122.png"
      ],
      "datePublished": "2025-12-11T00:34:48.000Z",
      "dateModified": "2025-12-11T00:34:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Michigan coach Sherrone Moore reportedly detained by police hours after firing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-coach-sherrone-moore-fired-detained-police/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/87d82913-a4ed-4650-b9d3-5bcae52d3f92/thumbnail/1200x675/45ba823b1ef60741403e77ad0863dc28/untitled-design-124.png",
    "tag": "Sports",
    "date": "2025-12-11T00:55:21.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Ex-Michigan coach Sherrone Moore was detained by t",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Ex-Michigan coach Sherrone Moore was detained by the Saline (Mich.) Police Department Wednesday hours after being fired by the school, according to ESPN. Moore, who was fired for cause for engaging in an inappropriate relationship with a staff member, was turned over to the Pittsfield Township Police Department for investigation into potential charges, the Saline Police Department said in a statement to ESPN. No other details were immediately available. \"The City of Saline Police Department assisted in locating and detaining former University of Michigan football coach Sherrone Moore,\" the statement read. \"Mr. Moore was turned over to the Pittsfield Township Police Department for investigation into potential charges.\"\n        \n            \n                Michigan fires Sherrone Moore for cause amid 'inappropriate relationship' with staff member\n                \n                    Carter Bahns                \n            \n                            \n    \n                \n                    \n    \nMoore's tenure as Michigan's coach came to an abrupt end Wednesday after an internal investigation into his conduct.\"Sherrone Moore has been terminated, with cause, effective immediately,\" Michigan athletic director Warde Manuel said in a statement. \"Following a university investigation, credible evidence was found that Coach Moore engaged in an inappropriate relationship with a staff member. This conduct constitutes a clear violation of University policy, and UM maintains zero tolerance for such behavior.\"\nCalls to the Saline and Pittsfield Township Police Departments from CBS Sports have not been returned. Moore was tabbed Michigan's coach at the conclusion of the 2023 season after Jim Harbaugh departed to coach the Los Angeles Chargers. He finished 16-8 (11-6 in Big Ten play) in his two seasons with the program. Moore had been on Michigan's staff since the 2018, when he was hired as the tight ends coach. He ascended to offensive coordinator before succeeding Harbaugh. Moore had a buyout of around $14 million, but because he was fired for cause, Michigan may be off the hook for nearly all of it. \nMichigan went 9-3 this season and is slated to play Texas in the Citrus Bowl on Dec. 31. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Michigan coach Sherrone Moore reportedly detained by police hours after firing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/87d82913-a4ed-4650-b9d3-5bcae52d3f92/thumbnail/1200x675/45ba823b1ef60741403e77ad0863dc28/untitled-design-124.png"
      ],
      "datePublished": "2025-12-11T00:55:21.000Z",
      "dateModified": "2025-12-11T00:55:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]