[
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by backing USC-Northwestern on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-300-bonus-bets-free-nba-league-pass-usc-northwestern-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:40:33.000Z",
    "description": "\n        The North Carolina Tar Heels will host the Kansas Jayhawks in a college basketball classic with two of the most prestigious programs in the s",
    "body": "\n        The North Carolina Tar Heels will host the Kansas Jayhawks in a college basketball classic with two of the most prestigious programs in the sport's history, and with the latest DraftKings promo code, new users can earn $300 in bonus bets and three free months of NBA League Pass by betting on the action. Kansas defeated North Carolina when the two met in Kansas last year, but with the Jayhawks coming to Chapel Hill on Friday, one of the SportsLine's advanced computer model's Friday best bets at DraftKings Sportsbook includes backing the Tar Heels to cover as 2.5-point favorites.SportsLine's team of experts also has multiple plays on Friday and two top experts have college football and NBA picks locked in. The SportsLine experts are backing Northwestern to cover as a 14.5-point underdog against No. 19 USC and the Magic to defeat the Celtics in its Friday best bets at DraftKings Sportsbook. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. The model enters Week 3 of the 2025-26 NBA season on a sizzling 26-13 roll on top-rated NBA spread picks dating back to last season. Anyone following its college football betting picks or NBA betting advice at sportsbooks and on betting apps could have seen strong returns.Friday best bets at DraftKings SportsbookNorth Carolina (-2.5) vs. Kansas (-112)Northwestern (+14.5) vs. USC (-108)Magic to defeat the Clippers (-155)Combining the model's three picks into a Friday parlay at DraftKings would result in a payout of +518 (risk $100 to win $518). Bet it at DraftKings here:\nNorth Carolina (-2.5) vs. Kansas (-112)The Tar Heels had a 40-point victory in a tune-up against Central Arkansas before their first true test of the season when playing the Jayhawks on Friday. The time, North Carolina will be home, however, where it went 12-3 last year and 14-1 the season before. Caleb Wilson, the No. 8 recruit in the Class of 2025 by 247Sports, scored 22 points in his debut. North Carolina had the No. 5 freshman class in the nation and returned its third-leading scorer from last year in Seth Trimble, who averaged 11.6 ppg last season. The model projects North Carolina to cover in 57% of simulations. Back North Carolina at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Northwestern (+14.5) vs. USC (-108)\"The Trojans can thank their lucky stars that Nebraska QB Dylan Raiola got injured in the second half last week at Lincoln with the Huskers up 14-6 and driving inside of USC territory,\" SportsLine legendary expert Bruce Marshall said. \"Nebraska's offense would then effectively stop as frosh QB TJ Lateef couldn't throw the ball downfield, netting just 7 pass yards the rest of the night, while USC rallied to a 21-17 win. Northwestern hasn't played USC at the Coliseum since 1969, but it's a better Northwestern team, and better than last year too, more resembling David Braun's 2023 overachievers, only this time with a real QB in the fold (SMU transfer Preston Stone) while a gnarly defense has helped NU to five straight covers.\" Back Northwestern at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Magic to defeat the Clippers (-155)\"Orlando really hasn't gotten going yet but is well-rested and back at home for the first time since Oct. 25,\" SportsLine expert Matt Severance said. \"The Magic are also healthy. Boston's weakness is in the frontcourt in starting Josh Minott and \"Mr. Vowel\" Neemias Queta. The frontcourt is Orlando's strength. The Magic also have multiple good defenders to throw at Jaylen Brown. Back the Magic at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:\nWant more Friday NBA, college basketball and college football picks?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NBA, college basketball, college football, NFL and NHL, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by backing USC-Northwestern on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-11-07T15:40:33.000Z",
      "dateModified": "2025-11-07T15:40:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB free agency: NPB slugger Munetaka Murakami to be posted - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/munetaka-murakami-npb-posted-mlb-free-agency/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/08151632-7536-4fcd-81cc-44f88dea4503/thumbnail/1200x675/58c234d3f26ccf25484b3446738db414/murakami-getty-1.png",
    "tag": "Sports",
    "date": "2025-11-07T15:45:59.000Z",
    "description": "\n        The Tokyo Yakult Swallows will official post slugging third baseman Munetaka Murakami for MLB teams on Friday, reports ESPN. His 45-day negot",
    "body": "\n        The Tokyo Yakult Swallows will official post slugging third baseman Munetaka Murakami for MLB teams on Friday, reports ESPN. His 45-day negotiating window opens at 8 a.m. ET on Saturday and will close at 5 p.m. ET on Monday, Dec. 22. Murakami can sign at any time between those two dates.\n        \n            \n                Ranking top 50 MLB free agents for 2026: Kyle Tucker, Alex Bregman at top, plus landing spots for every player\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nBecause he is 25, Murakami is free to sign a contract of any size this offseason, similar to Yoshinobu Yamamoto two years ago. He is not subject to the international bonus pools like Roki Sasaki last offseason. We ranked Murakami as the seventh-best free agent available this winter. Here's the write-up:Murakami launched his name into orbit back in 2022, when he homered  56 times to break Sadaharu Oh's single-season Nippon Professional  Baseball record for a Japanese-born player. Clearly he has elite  strength. Alas, the ensuing years haven't been as kind. He swings and  misses a ton, even within the zone, and his strikeout rate has cleared  28% three seasons in a row -- NPB hasn't experienced the same K-rate  creep as MLB, making that one  of the worst marks among regulars. There've long been questions about  his viability at the hot corner too, with first base appearing as his  long-term home. Murakami's power and youth (he'll turn 26 in February)  will go a long way in making a team forgive those blemishes, with a  left-handed Eugenio Suárez serving as a good outcome here.In 69 games around elbow surgery and an oblique injury, Murakami hit .286/.392/.659 with 24 home runs this season. Those 24 home runs were third most in the league even though Murakami finished 135th in games played. Offense is way down in NPB right now -- the league average was .242/.302/.350 in 2025 -- making Murakami's power stand out even more.Whichever team signs Murakami will owe the Swallows a posting fee based on the size of his contract. Here is the posting fee structure:\nContract worth less than $25 million: 20% of contract valueContract worth $25 million to $50 million: $5 million plus 17.5% of amount over $25 millionContract worth more than $50 million: $9.275 million plus 15% of amount over $50 millionOur R.J. Anderson projected Murakami to receive a six-year, $140 million contract. That would come with a $22.775 million posting fee, making it $162.775 million all-in. The richest contract given to a Japanese position player coming over to MLB is the five-year, $90 million deal the Red Sox gave Masataka Yoshida three years ago. Murakami should easily beat that.The teams that show the most interest in Murakami figure to be the teams that most believe in him at third base. His free agency could have a domino effect on Alex Bregman and Eugenio Suárez, and perhaps Pete Alonso too. The fairly early posting window ensures Murakami's free agency will be over in December and not drag into January, which could have really slowed things down.\nAll the usual suspects are expected to pursue Murakami: Dodgers, Mets, Yankees, etc. The Blue Jays, Cubs, Giants, Mariners, Padres, Rangers, and Tigers should not be ruled out either.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB free agency: NPB slugger Munetaka Murakami to be posted - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/08151632-7536-4fcd-81cc-44f88dea4503/thumbnail/1200x675/58c234d3f26ccf25484b3446738db414/murakami-getty-1.png"
      ],
      "datePublished": "2025-11-07T15:45:59.000Z",
      "dateModified": "2025-11-07T15:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus for picking Memphis-Tulane, USC-Northwestern on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-betmgm-bonus-code-cbssports-get-150-bonus-memphis-tulane-usc-northwestern-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:47:30.000Z",
    "description": "\n        A college football tripleheader on Friday is the perfect opportunity to use the BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus ",
    "body": "\n        A college football tripleheader on Friday is the perfect opportunity to use the BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins. The action begins at 8 p.m. ET with UCF vs. Houston, while USC vs. Northwestern and Memphis vs. Tulane kick off at 9 p.m. ET.Picks from all three of those games are among our college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The model simulates every college football game 10,000 times and has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Friday's college football best bets at BetMGMUCF +1.5 vs. Houston (-110) Over 50.5 in USC vs. Northwestern (-115)Memphis -3.5 vs. Tulane (-110)Combining these three picks into a Friday college football parlay at BetMGM would result in a payout of +581 (risk $100 to win $581). Bet it at BetMGM Sportsbook here:\nUCF +1.5 vs. Houston (-110)The Knights are 4-4 in Scott Frost's first season back at the helm and have lost four of five, but they have won four of five at home this season with the only loss coming in a hard-fought battle against Kansas where the final score was 20-27. UCF hammered Wester Virginia 45-13 at home and also beat North Carolina 34-9, covering comfortably as 6.5-point favorites in both games to establish the Acrisure Bounce House as a hostile environment. Now the model says that the Knights cover in 53% of simulations. Back UCF at BetMGM Sportsbook now:Over 50.5 points in USC vs. Northwestern (-115)Northwestern has shown improvement in David Braun's second season and the defense is formidable, as the Wildcats allow 16.8 points and 304.1 yards per game. However, the USC offense ranks eighth in the nation in scoring (39.8 ppg) and first in total offense (505.8 ypg). In their only other matchup against an elite offense, the Wildcats gave up 34 points to Oregon and we could easily see USC put up close to 40 on their own. The model predicts that the Over hits in 54% of simulations. Back the Over at BetMGM Sportsbook now:Memphis -3.5 vs. Tulane (-110)Memphis wasn't ranked by the College Football Playoff committee but the Tigers were announced as the top Group of Six team and have the inside track on a CFP bid. This is an opportunity to cement themselves against another quality AAC program and crack the top 25 next week and they've risen to the occasion in previous high-profile matchups against USF and Arkansas. The model has Memphis covering in 61% of simulations. Back Memphis at BetMGM Sportsbook now:\nWant Week 10 NFL picks?You've seen some of the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NFL game on the schedule, all from the model that's simulated every game 10,000 times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus for picking Memphis-Tulane, USC-Northwestern on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-11-07T15:47:30.000Z",
      "dateModified": "2025-11-07T15:47:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball rankings: Kansas faces UNC in early season showdown of blue bloods - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-darryn-peterson-faces-first-tough-test-when-kansas-meets-unc-in-early-showdown/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/13ed4a33-3bf4-4568-844e-1c89408813f1/thumbnail/1200x675/69837df2ba65518ee0cd1810aea18e79/top25-1kansas.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:42:16.000Z",
    "description": "\n\n\n    \n                                    The Tar Heels play host to the Jayhawks in a matchup sure to impact the Top 25 And 1\n        \n            ",
    "body": "\n\n\n    \n                                    The Tar Heels play host to the Jayhawks in a matchup sure to impact the Top 25 And 1\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 7, 2025\n                            \n                    at\n    10:19 am ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Two kinda-interesting days to start this college basketball season were followed by two filled with blah -- evidence being that, between Wednesday and Thursday, only four teams in the CBS Sports Top 25 And 1 daily college basketball rankings took the court, never against each other.All four games with ranked teams featured a good high-major vs. an overmatched mid-major or low-major with the average margin of victory in those contests being 38.5 points. As I write every season, in some form, this is among the biggest flaws with the sport in November and December, how there are simply too many games between teams that shouldn't even be competing against each other. But I digress.Anyway ...Friday should get us back on track and provide something compelling with the most notable game originating at the Dean E. Smith Center, where Darryn Peterson and the Kansas Jayhawks will play North Carolina.\n\n        \n            \n                Kansas vs. North Carolina prediction, pick, odds, spread: Jayhawks face Tar Heels in showdown of blue bloods\n                \n                    Cameron Salerno                \n            \n                            \n    \n                \n                    \n    \n\"Certainly playing at their place, in front of 21, 22 (thousand fans), whatever the number is, will be a tough, tough, tough challenge,\" said Kansas coach Bill Self. \"But [it's] one that we need to go through to kind of see where we're at and hopefully learn from.\"The chance to see Peterson on this stage, so early in his college career, is especially cool. The 6-foot-6 guard is among the obvious candidates to be selected first overall in the 2026 NBA Draft. In his debut against Green Bay, Peterson took 11 shots, made seven of them and finished with 21 points, four rebounds, three assists, two steals and a block in 22 minutes. I can't wait to see how he'll perform in his first road game, against his first quality opponent,\nKansas is No. 15 in Friday morning's updated Top 25 And 1. North Carolina is No. 24. The Jayhawks and Tar Heels are set to tip a little after 7 p.m. ET.   Top 25 And 1 rankings \n        Biggest Movers\n    RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    St. John's\n                                \n                            Dillon Mitchell finished with 18 points and four steals in Monday's 108-74 win over Quinnipiac. The Red Storm's next game is Saturday against Alabama.\n                        \n                            --\n                        \n                            1-0\n                        \n                                2\n                            \n                                    Purdue\n                                \n                            Fletcher Loyer finished with 30 points and one assist in Tuesday's 82-51 win over Evansville. The Boilermakers' next game is Friday against Oakland.\n                        \n                            --\n                        \n                            1-0\n                        \n                                3\n                            \n                                    Houston\n                                \n                            Emanuel Sharp finished with 24 points and seven rebounds in Monday's 75-57 win over Lehigh. The Cougars' next game is Saturday against Towson.\n                        \n                            --\n                        \n                            1-0\n                        \n                                4\n                            \n                                    BYU\n                                \n                            AJ Dybantsa finished with 21 points and six rebounds in Monday's 71-66 win over Villanova. The Cougars' next game is Saturday against Holy Cross.\n                        \n                            --\n                        \n                            1-0\n                        \n                                5\n                            \n                                    UConn\n                                \n                            Alex Karaban finished with 19 points and 10 rebounds in Monday's 79-55 win over New Haven. The Huskies' next game is Friday against UMass Lowell.\n                        \n                            --\n                        \n                            1-0\n                        \n                                6\n                            \n                                    Arizona\n                                \n                            Koa Peat finished with 30 points and seven rebounds in Monday's 93-87 win over Florida. The Wildcats' next game is Friday against Utah Tech.\n                        \n                            --\n                        \n                            1-0\n                        \n                                7\n                            \n                                    Florida\n                                \n                            Alex Condon finished with 25 points and 10 rebounds in Thursday's 104-64 win over North Florida. The Gators' next game is Tuesday against Florida State.\n                        \n                            --\n                        \n                            1-1\n                        \n                                8\n                            \n                                    Texas Tech\n                                \n                            Christian Anderson finished with 34 points and seven rebounds in Tuesday's 98-60 win over Lindenwood. The Red Raiders' next game is Friday against Sam Houston State.\n                        \n                            --\n                        \n                            1-0\n                        \n                                9\n                            \n                                    Michigan\n                                \n                            Morez Johnson finished with 24 points and three assists in Monday's 121-78 win over Oakland. The Wolverines' next game is Nov. 11 against Wake Forest.\n                        \n                            --\n                        \n                            1-0\n                        \n                                10\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 15 points and 13 rebounds in Tuesday's 75-60 win over Texas. The Blue Devils' next game is Saturday against Western Carolina.\n                        \n                            --\n                        \n                            1-0\n                        \n                                11\n                            \n                                    UCLA\n                                \n                            Donovan Dent finished with 21 points and nine assists in Monday's 80-74 win over Eastern Washington. The Bruins' next game is Friday against Pepperdine.\n                        \n                            --\n                        \n                            1-0\n                        \n                                12\n                            \n                                    Kentucky\n                                \n                            Collin Chandler finished with 15 points and four assists in Tuesday's 77-51 win over Nicholls. The Wildcats' next game is Friday against Valparaiso.\n                        \n                            --\n                        \n                            1-0\n                        \n                                13\n                            \n                                    Iowa St.\n                                \n                            Joshua Jefferson finished with 20 points and eight rebounds in Thursday's 102-62 win over Grambling. The Cyclones' next game is Monday against Mississippi State.\n                        \n                            --\n                        \n                            2-0\n                        \n                                14\n                            \n                                    Louisville\n                                \n                            Ryan Conwell finished with 19 points and eight rebounds in Thursday's 106-70 win over Jackson State. The Cardinals' next game is Tuesday against Kentucky.\n                        \n                            --\n                        \n                            2-0\n                        \n                                15\n                            \n                                    Kansas\n                                \n                            Darryn Peterson finished with 21 points and four rebounds in Monday's 94-51 win over Green Bay. The Jayhawks' next game is Friday at North Carolina.\n                        \n                            --\n                        \n                            1-0\n                        \n                                16\n                            \n                                    Illinois\n                                \n                            Tomislav Ivisic finished with 21 points and four rebounds in Monday's 113-55 win over Jackson State. The Illini's next game is Friday against Florida Gulf Coast.\n                        \n                            --\n                        \n                            1-0\n                        \n                                17\n                            \n                                    Alabama\n                                \n                            Labaron Philon finished with 22 points and eight assists in Monday's 91-62 win over North Dakota. The Crimson Tide's next game is Saturday at St. John's.\n                        \n                            --\n                        \n                            1-0\n                        \n                                18\n                            \n                                    Michigan St.\n                                \n                            Jaxon Kohler finished with 16 points and 15 rebounds in Monday's 80-69 win over Colgate. The Spartans' next game is Saturday against Arkansas.\n                        \n                            --\n                        \n                            1-0\n                        \n                                19\n                            \n                                    Oregon\n                                \n                            Takai Simpkins finished with 18 points and three rebounds in Tuesday's 60-59 win over Hawaii. The Ducks' next game is Friday against Rice.\n                        \n                            --\n                        \n                            1-0\n                        \n                                20\n                            \n                                    Arkansas\n                                \n                            Trevon Brazile finished with 25 points and 11 rebounds in Monday's 109-77 win over Southern. The Razorbacks' next game is Saturday at Michigan State.\n                        \n                            --\n                        \n                            1-0\n                        \n                                21\n                            \n                                    Gonzaga\n                                \n                            Tyon Grant-Foster finished with 15 points and five rebounds in Monday's 98-43 win over Texas Southern. The Zags' next game is Saturday against Oklahoma.\n                        \n                            --\n                        \n                            1-0\n                        \n                                22\n                            \n                                    Tennessee\n                                \n                            Nate Ament finished with 18 points and nine rebounds in Monday's 76-61 win over Mercer. The Vols' next game is Saturday against Northern Kentucky.\n                        \n                            --\n                        \n                            1-0\n                        \n                                23\n                            \n                                    Auburn\n                                \n                            Keyshawn Hall finished with 25 points and 14 rebounds in Thursday's 95-57 win over Merrimack. The Tigers' next game is Tuesday against Wofford.\n                        \n                            --\n                        \n                            2-0\n                        \n                                24\n                            \n                                    N. Carolina\n                                \n                            Caleb Wilson finished with 22 points and three assists in Monday's 94-54 win over Central Arkansas. The Tar Heels' next game is Friday against Kansas.\n                        \n                            --\n                        \n                            1-0\n                        \n                                25\n                            \n                                    Wisconsin\n                                \n                            John Blackwell finished with 31 points and four rebounds in Monday's 96-64 win over Campbell. The Badgers' next game is Friday against Northern Illinois.\n                        \n                            --\n                        \n                            1-0\n                        \n                                26\n                            \n                                    Ole Miss\n                                \n                            Malik Dia finished with 20 points and four rebounds in Monday's 88-58 win over Southeastern Louisiana. The Rebels' next game is Friday against Louisiana-Monroe.\n                        \n                            --\n                        \n                            1-0\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball rankings: Kansas faces UNC in early season showdown of blue bloods - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/13ed4a33-3bf4-4568-844e-1c89408813f1/thumbnail/1200x675/69837df2ba65518ee0cd1810aea18e79/top25-1kansas.jpg"
      ],
      "datePublished": "2025-11-07T15:42:16.000Z",
      "dateModified": "2025-11-07T15:42:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by betting USC-Northwestern, North Carolina-Kansas Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-usc-northwestern-north-carolina-kansas-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:44:41.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 offers new users $200 in bonus bets after placing a first wager of $5 or more, and Friday's sports sch",
    "body": "\n        The latest bet365 bonus code CBSBET365 offers new users $200 in bonus bets after placing a first wager of $5 or more, and Friday's sports schedule brings plenty of college football and college basketball action. No. 19 USC hosts Northwestern on the gridiron, with the Trojans listed as 14.5-point favorites.SportsLine's proven computer model is backing the Trojans with its Friday best bets and is also taking No. 25 North Carolina to cover against No. 19 Kansas in a college basketball showdown. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every game 10,000 times, has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. It has also returned over $2,200 in betting profit for $100 players on its top-rated college basketball picks over the past three seasons. Anybody following its college football betting and college basketball betting at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Friday's top picks, best betsNorth Carolina -1.5 vs. KansasOver 54 in Memphis vs. TulaneUSC -14.5 vs. NorthwesternCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +595 (risk $100 to win $595). Bet it at bet365 here:\nNorth Carolina -1.5 vs. KansasNorth Carolina's roster is headlined by star freshman Caleb Wilson, who scored 22 points in 24 minutes against Central Arkansas on Monday. The Tar Heels cruised to a 94-54 win in that game, shooting 50.8% from the floor while holding the Bears to 31.3% shooting. Wilson was one of five double-digit scorers. Arizona transfer Henri Veesaar added 14 points and 10 rebounds in his first game with the school, and North Carolina has one of the best home atmospheres in the country. The model has the Tar Heels covering the spread in 57% of simulations. Bet it at bet365 here:  Over 54 in Memphis vs. TulaneMemphis has the No. 12 scoring offense in college football, averaging 37.7 points per game. The Tigers are facing a Tulane defense that allowed 48 points against UTSA in its most recent outing, as quarterback Jake Retzlaff threw two interceptions. However, he only had one interception all season prior to that game, and he leads the team in both passing (1,622 yards) and rushing (513 yards). These teams have gone Over the total in four of their last six meetings, and the model has the Over cashing 62% of the time on Friday night. Bet it at bet365 here:  USC -14.5 vs. NorthwesternUSC has lost a pair of games to ranked opponents this season, but it remains squarely in the College Football Playoff hunt heading into its final four games of the regular season. The Trojans bounced back from a loss at Notre Dame with a 21-17 win at Nebraska last week. They are averaging the eighth-most points per game (39.8) in the country, as quarterback Jayden Maiava is a top-10 passer nationally. Northwestern has not scored more than 22 points in a game against a major-conference opponent, so the model has USC covering 55% of the time. Bet it at bet365 here:  \nLooking for Week 10 NFL picks?You've seen the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by betting USC-Northwestern, North Carolina-Kansas Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-11-07T15:44:41.000Z",
      "dateModified": "2025-11-07T15:44:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lakers' Bronny James still missing one obvious skill as his playing time increases - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/bronny-james-lakers-scoring-playing-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/8ec018e7-6db1-44a9-9773-c24ffb6026c2/thumbnail/1200x675/24f63a2933116571f973cac5cee0ebcd/bronny-getty.png",
    "tag": "Sports",
    "date": "2025-11-07T15:15:31.000Z",
    "description": "\n        The biggest compliment you can pay Bronny James in his sophomore campaign with the Los Angeles Lakers is that he no longer stands out. It's a",
    "body": "\n        The biggest compliment you can pay Bronny James in his sophomore campaign with the Los Angeles Lakers is that he no longer stands out. It's a strange thing to say about someone literally named \"LeBron James,\" as the first NBA player with that name has dominated the league for more than two decades now. But his son is a very different player. Stardom isn't a realistic goal at this point. The hope is just that he can fit in on an NBA floor.A rash of Lakers injuries has given him that chance. Last season, he played double-digit minutes only five times: three blowouts, a meaningless end-of-season game, and a close loss to Denver in which the Lakers were without Luka Dončić, Gabe Vincent, Dorian Finney-Smith and the elder James. But with pretty much every Laker experiencing injuries thus far this season, Bronny has gotten some pretty meaningful run in real games over the past two weeks, playing 18 or more minutes in three reasonably close games. And in that time, he's held his own. Despite fears that his presence would be a bit of a sideshow last season, James hasn't looked out of place participating in real NBA games thus far. He's by no means a perfect player -- we'll get into the weaknesses shortly -- but in those three longer stretches, the Lakers have been outscored by only a single point. Not bad for a bench player. And when he actually shares the court with either Dončić or Reaves (tiny samples, of course), the Lakers have actually fared quite well.The selling point is and always has been his defense. Size was the primary question on this front when James arrived in the NBA. The NBA isn't exactly full of 6-foot-2 defensive specialists, but his 6-7 wingspan and deceptive strength have allowed him to hold up well on that end of the floor thus far. He's held opponents to 11-of-26 shooting as the primary defender this season and while you should always take tracking data like that with a grain of salt, it comes across on film. He can stay in front of most assignments and he contests more shots on a per-minute basis than any other Laker guard.\nThat isn't his best trait defensively either. What's stood out so far has been his defensive playmaking. James leads the Lakers in steals per minute and, among those who have earned any actual playing time, only Marcus Smart is averaging more deflections per minute. Obviously it's a bit easier to be that aggressive when you're playing fewer minutes; conserving energy isn't as meaningful for a bench player as it is for a starter. But this is where James jumps off the screen. He's a nightmare in passing lanes.\nWe knew James could defend. The jump he showcased during summer league was as a ball-handler and playmaker. We're getting some of that in real games this season. He's a high-IQ player who has been especially dangerous as a passer when attacking closeouts. Check out this assist against Portland. Jerami Grant closes out a bit too hard, so James blows him. This forces Deni Avdija to help. James doesn't have to dump off to Jaxson Hayes because Jrue Holiday has rotated off of Rui Hachimura to help at the basket, but he catches Shaedon Sharpe ball-watching, creating an open 3 for Hachimura.\nThat vision and awareness of his surroundings in traffic near the basket is very valuable for a small guard and it has served him, and perhaps more pertinently his big men, quite well so far this season.\nThese traits are all meaningful and they may one day help James become a steady, NBA role player. But they all ultimately qualify as \"little things.\" James is fitting in defensively. He's not a stopper and he probably doesn't have the physical dimensions to be one. He's making plays within the flow of the offense, but he isn't bending defenses in ways that lead to consistent creation. They are supplementary, helpful for a player who either has one elite skill or survives by being passable at everything. James' hope is probably the latter and that's where the concerns start to arise. He still isn't putting the ball in the hoop.That's the be-all and end-all here, the obstacle standing between Bronny James and a long, productive NBA career. He is never going to be a primary scorer. He does, however, have to be enough of a threat to score to keep defenses honest. Once he gets there, the little things start to pile up and you get a usable reserve in higher-leverage games. As it stands right now, there's just not much of a reason for defenses to guard him.Shooting has always been a weakness for James. He shot just 16-of-60 from deep at USC, and while that's a small sample, he wasn't a great free-throw shooter either at 67.6%. Thus far, that's more or less how defenses have treated him. His man frequently creeps into the lane, making life harder for other Laker drivers. This isn't just happening when James sits in the corner. It happens mid-possession. Take this play against the Heat. James begins the action in the dunker's spot and, when he gets the ball, Nikola Jović steps over to avert a layup. He proceeds to follow James back onto the perimeter, but when James passes the ball to Austin Reaves, it's as if Jović forgot he was there.\nIt's one thing to simply be a weak 3-point shooter. While that is probably the single biggest impediment to offensive success as a reserve, it's not necessarily a deal-breaker. That James is also struggling this much as a finisher makes things significantly harder. That success he's having attacking closeouts as a passer just isn't translating to scoring. Once again on this possession, James is left wide open and takes advantage of the late closeout to get into the lane. This is by no means an easy finish, especially with the bigger Javonte Cook on his tail, but he isn't close.\nOn this possession in Wednesday's win over the Spurs, Stephon Castle does what so many defenders do against him: cheat off of him in the corner to help against a driver (in this case, Dončić). James beats Castle's frantic closeout, but he sees the crowded paint and, rather than challenge Kelly Olynyk, he passes up his runway and settles for a baseline runner.\nWhen you're a small guard trying to finish through traffic, you generally need quite a bit of either craft or explosiveness. James doesn't have either, at least not yet. You see the difference between James and an elite NBA athlete on this Andrew Wiggins chase down block. Wiggins, like the elder James, was a No. 1 pick with elite physical tools. The younger James lacks them, and without a counter, Wiggins does to Bronny what LeBron has spent 20 years doing to unsuspecting guards in transition: he made him look small.\nAll of this combines to make James a somewhat unusual young prospect. Most young players in the NBA have a single skill that gets them in the door -- very often based on scoring -- and the hope is that they'll be able to round out the rest of their game over time. This is the case to an extent with Nick Smith Jr., another beneficiary of these early Laker injuries. He was a former lottery pick in Charlotte whose offensive upside is evident every time he touches the floor, but who has real holes throughout the rest of his skill set that will need work over time. James came into the league with a relatively mature game. He knows his role and by and large does the right things. He's just so limited as a scorer at this point that keeping him on the floor when the roster is healthy and the games really count is just probably a non-starter at this stage.We're still very early into a career that on some level began and was irrevocably altered by a cardiac arrest incident in the summer before he played at USC. He's still playing catchup to an extent and he has time. His contract is guaranteed through next season. But this is the hurdle he's going to have to clear. He doesn't have to be a great scorer. He doesn't even have to be a good one. But he needs to become enough of a threat to actually put points on the board that his team can keep him on the floor and take advantage of everything else he brings. If he's going to be a real NBA player, he has to be able score.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lakers' Bronny James still missing one obvious skill as his playing time increases - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/8ec018e7-6db1-44a9-9773-c24ffb6026c2/thumbnail/1200x675/24f63a2933116571f973cac5cee0ebcd/bronny-getty.png"
      ],
      "datePublished": "2025-11-07T15:15:31.000Z",
      "dateModified": "2025-11-07T15:15:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jayden Daniels injury update: Commanders QB gets positive news on dislocated elbow - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jayden-daniels-injury-update-elbow-arm-washington-commanders-qb-seahawks-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/656d78c3-b438-4c68-9448-4aaa86b1c2bb/thumbnail/1200x675/34f3459d01c46dede3b21947f3e77ea1/jayden-daniels-injury-getty.png",
    "tag": "Sports",
    "date": "2025-11-07T15:16:11.000Z",
    "description": "\n        Washington Commanders quarterback Jayden Daniels, who dislocated his left elbow late in Sunday night's 38-14 loss to the Seattle Seahawks, av",
    "body": "\n        Washington Commanders quarterback Jayden Daniels, who dislocated his left elbow late in Sunday night's 38-14 loss to the Seattle Seahawks, avoided a serious injury and will not require surgery, CBS Sports' Jonathan Jones reported Friday. He will not be placed on injured reserve the plan is to re-evaluate the reigning NFL Offensive Rookie of the year during the Week 12 bye later this month.Daniels was injured when Seahawks linebacker Drake Thomas tackled him with less than eight minutes to play and the Commanders trailing 38-8. As Daniels rolled over, he tried to use his non-throwing arm to steady himself; however, upon landing on the grass, his left elbow appeared to bend inwards at an unnatural angle.Commanders medical staffers rushed onto the field, bracing Daniels' left elbow and arm before the franchise's star signal caller walked off the field being steadied as he entered the tunnel.Daniels was set to undergo an MRI this week and was initially expected to be placed on injured reserve, but further evaluation revealed no ligament damage, according to NFL Network, allowing Washington to keep him on the active roster for now.\n        \n            \n                Jayden Daniels fallout: Commanders coach Dan Quinn takes responsibility for not removing QB from blowout loss\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nMany were quick to criticize Commanders coach Dan Quinn for leaving his starting quarterback in the game with the contest already out of hand. On Monday, Quinn took responsibility for the decision, admitting he should have pulled Daniels earlier.\n\"I know many of you have been asking about the thought process of Jayden being in the game in that situation. I get that,\" Quinn said. \"I've been thinking about it honestly nonstop too, and for me the answer is, man, I missed it.\"Sunday's injury is just the latest obstacle in a difficult sophomore season for Daniels, who missed two games with an ankle injury incurred in Week 2 against the Packers and sat out of Washington's Week 8 game with a hamstring injury suffered against the Cowboys.The Commanders have been badly hampered by injuries all season. After a magical 12-5 campaign in 2024 that included Daniels winning Offensive Rookie of the Year, Washington ended Sunday night with a 3-6 record. Daniels was 16 of 22 for 153 yards with an interception; he also carried 10 times for 51 yards and a touchdown.Marcus Mariota, who started all three games Daniels previously missed this season, replaced Daniels and completed a touchdown drive. The Commanders are 1-2 with Mariotta starting this season.\nMariota will start again Sunday as the Commanders host the Detroit Lions. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jayden Daniels injury update: Commanders QB gets positive news on dislocated elbow - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/656d78c3-b438-4c68-9448-4aaa86b1c2bb/thumbnail/1200x675/34f3459d01c46dede3b21947f3e77ea1/jayden-daniels-injury-getty.png"
      ],
      "datePublished": "2025-11-07T15:16:11.000Z",
      "dateModified": "2025-11-07T15:16:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 10 picks, odds, predictions: Best bets, survivor plays, expert tips - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-10-picks-odds-best-bets-predictions-against-the-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/6e6a09fa-ae0c-4ce9-bb17-67fb39495fc3/thumbnail/1200x675/24f0428a7783e83eec3923f399cd0bd4/daniel-jones.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:31:39.000Z",
    "description": "\n        The second half of the 2025 NFL regular season is about to begin. If the final nine weeks of the year are anything like the first, we're in f",
    "body": "\n        The second half of the 2025 NFL regular season is about to begin. If the final nine weeks of the year are anything like the first, we're in for a wildly entertaining stretch run. It kicks off with a Week 10 slate that features a number of intriguing matchups - including Sauce Gardner making his Colts debut after a shocking deadline blockbuster, and the Eagles squaring off with the Packers at Lambeau Field on Monday night.As we do every week throughout the season, we've collected all of the best picks and gambling content from CBS Sports and SportsLine in one place. Below, you'll find picks against the spread from our CBS Sports experts as well as additional feature content for each game, including plays from top SportsLine experts and the SportsLine Projection Model, best bets from our staff, survivor picks and more. Ready? Let's jump in.Bet NFL Week 10 games and NFL odds at DraftKings, where new users get $300 in bonus bets and three months of NBA League Pass with a winning $5 wager.     Falcons at Colts (in Berlin)Sunday, 9:30 a.m. ET on NFL Network (Stream: Fubo -- try for free)\nThe SportsLine Projection Model, which simulates every game up to 10,000 times, is currently on a 47-29 run on top-rated NFL picks dating back to 2024. We've now zeroed it in on Sunday's international matchup between the Falcons and Colts. We can tell you that the model likes the Over 48.5 total slightly, hitting in 53% of sims. However, there is one side of the moneyline hitting at a whopping 71%. To see that, head over to SportsLine.\nColts -6: \"The Falcons defense has given up the FEWEST passing yards per game in the NFL this year (158.1), so the best way to beat them is to run the ball. Although Taylor struggled against the Steelers with just 45 yards, I don't see that happening two weeks in a row. The Falcons have given up more than 100 rushing yards in seven of their eight games this year, so Taylor should be able to run on them.\" -- CBS Sports NFL writer John Breech on why he likes Indy to take down the Falcons, 27-20. To see the rest of his Week 10 picks, click here.\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Falcons at Colts (-6.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    Ravens at VikingsSunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nVikings +4: \"The Ravens have given up the fifth-most passing yards per game in the NFL this year, and that could be a problem for a team that's about to face a Vikings offense that has one of the top receivers in the NFL in Justin Jefferson. I definitely don't trust J.J. McCarthy just yet, and if the Ravens could get any pressure on the quarterback, I'd probably lean toward Baltimore, but it hasn't been able to do that this year. Even the Ravens know they've struggled to get pressure on the quarterback, which is why they added Dre'Mont Jones in a trade on Monday night. Jones might eventually help Baltimore's defense, but I don't think he'll help much this week.\" -- CBS Sports NFL writer John Breech on why he has Minnesota pulling off the home upset over Baltimore, 27-24. To see the rest of his Week 10 picks, click here.\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Ravens (-4) at Vikings\n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vikings\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vikings\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vikings\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vikings\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n         Bills at DolphinsSunday, 1 p.m. ET on CBS (Stream on Paramount+)\nBills -9.5: \"Miami was just blown out at home by the Ravens last Thursday, which led to the team parting ways with general manager Chris Grier. It also feels like both Mike McDaniel and Tua Tagovailoa's days are numbered. Meanwhile, Josh Allen -- who is currently boasting career highs in completion percentage (70%) and yards per attempt (8.2) -- has owned the Dolphins. The Bills quarterback is 14-2 and averages three total touchdowns per game against his division foe.\" -- CBS Sports NFL writer Tyler Sullivan on why he has Buffalo throttling Miami, 33-20. To see the rest of his Week 10 picks, click here.\n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Bills (-9.5) at Dolphins\n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bills\n                    \n    \n         Browns at JetsSunday, 1 p.m. ET on CBS (Stream on Paramount+)\nBrowns -2.5: \"This is one of the dog games of the week, featuring two teams coming off a bye. Both needed it. Both teams have quarterback issues, but at least the Browns have the better defense. The Jets traded away captains Sauce Gardner and Quinnen Williams this week. That won't play well. I think the Browns win it behind their defense.\" -- CBS Sports senior NFL analyst Pete Prisco on why he has Cleveland beating a depleted Jets squad, 21-17. To see the rest of his Week 10 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Browns (-2.5) at Jets\n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jets\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Browns\n                    \n    \n         Jaguars at TexansSunday, 1 p.m. ET on CBS (Stream on Paramount+)\nTexans -1.5: \"The Jaguars offense is simply hard to believe in, especially with Trevor Lawrence struggling. He ranks 32nd among 33 qualified quarterbacks in completion percentage this season (59.7%), and Jakobi Meyers' arrival doesn't magically solve those issues. This is an even tougher matchup for Jacksonville considering Lawrence now faces arguably the best defense in the NFL. Houston leads the league in points allowed per game (15.1) and yards allowed per game (267.4). I expect the Texans to disrupt Jacksonville's offense enough that [Davis] Mills won't need to do any heavy lifting to keep Houston in control.\" -- CBS Sports NFL writer Tyler Sullivan on why he has Houston defeating Jacksonville, 23-20. To see all of his Week 10 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Jaguars at Texans (-1.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n         Patriots at BuccaneersSunday, 1 p.m. ET on CBS (Stream on Paramount+)\nBuccaneers -2.5: \"This is the best game of the week, with both teams legitimate Super Bowl contenders. The Bucs are coming off a bye, which they needed. They are getting healthier. It's also nice to be at home. Baker Mayfield will outplay Drake Maye to win it as the Bucs snap the Patriots' winning streak.\" -- CBS Sports senior NFL analyst Pete Prisco on why he likes Tampa Bay to slow down New England, 30-24. To see the rest of his Week 10 picks, click here. \n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Patriots at Buccaneers (-2.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Patriots\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Buccaneers\n                    \n    \n         Saints at Panthers          Sunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nThe Panthers are slated to be one of the more popular selections in Survivor Pools, especially as they are hot off an upset win over the Packers in Green Bay. However, SportsLine's R.J. White is suggesting caution, as the Panthers are not among his top picks in survivor for Week 10. To see his top-rated survivor plays, go check out SportsLine. Panthers -5.5: \"The Saints are playing consecutive road games against a physical Panthers team. The defense will be a challenge for Tyler Shough, who will be making his second start. Carolina will continue to run the ball to eat clock and move the chains. I think that's good enough in a low-scoring game.\" -- CBS Sports senior NFL analyst Pete Prisco on why he has Carolina taking down New Orleans, 21-10. To see the rest of his Week 10 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Saints at Panthers (-5.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Saints\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n         Giants at BearsSunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nBears -3.5: \"The Giants are struggling, while the Bears are playing good football. The Bears have played well on offense, while the Giants defense hasn't come close to living up to the hype. Look for Ben Johnson and the offense to have another big game as the Giants continue to struggle.\" -- CBS Sports senior NFL analyst Pete Prisco on why he has Chicago lighting up the Giants, 33-17. To see the rest of his Week 10 picks, click here. \n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Giants at Bears (-3.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Giants\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Giants\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Giants\n                    \n    \n         Cardinals at SeahawksSunday, 4:05 p.m. on CBS (Stream on Paramount+)\nSeahawks -6.5: \"Defensively, Seattle should be able to get after Brissett, as the Seahawks enter Week 10 with the third-most sacks in the NFL (27). They're also tied for the third-fewest yards per play allowed (4.7) and rank fifth in points allowed per game (18.8). Pair that with an offense that sits top five in scoring and tied for first in yards per play, and Seattle simply feels like too much, especially at home.\" -- CBS Sports NFL writer Tyler Sullivan on why he likes Seattle to take down the Cardinals, 27-17. To see the rest of his Week 10 picks, click here.\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Cardinals at Seahawks (-6.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Seahawks\n                    \n    \n        Lions at CommandersSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\nLions -8.5: \"The Commanders will be without quarterback Jayden Daniels, which means Marcus Mariota starts. That's not their biggest issue. The defense is bad. The Lions weren't as good on offense last week in the loss to the Vikings, but that will change here. Jared Goff will light up the Commanders.\" -- CBS Sports senior NFL analyst Pete Prisco on why he likes Detroit to roll in Washington, 35-23. To see the rest of his Week 10 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Lions (-9.5) at Commanders\n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n        Rams at 49ersSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\n49ers +3.5: \"This is an enormous NFC West game in a tight division race. The 49ers have played well with Mac Jones playing, but Rams quarterback Matthew Stafford is on fire. It will be a challenge for the undermanned 49ers defense to slow the Rams. But I think they show up and play well. It's close.\" -- CBS Sports senior NFL analyst Pete Prisco on why he likes the Rams to beat San Francisco, 26-24. To see the rest of his Week 10 picks, click here. \n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Rams (-3.5) at 49ers\n                            \n    \n                                                \n                    \n    \n        \n                            Rams\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Rams\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Rams\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Rams\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    Steelers at ChargersSunday, 8:20 p.m. on NBC (Stream: Fubo -- try for free)\nSportsLine's R.J. White has been on an absolute tear when it comes to betting Steelers games. In games involving Pittsburgh, White enters Week 10 with a 37-19-1 (+1575) record with his picks. With that in mind, you'll certainly want to know who he likes for Sunday night. We can tell you White is leaning Under the 45.5 total, but to see his official play in this matchup, you'll need to go to SportsLine. Chargers -3: \"In Week 9, the Steelers stopped the NFL's leading passer (Daniel Jones), but that only worked because the Colts' offense revolves around Jonathan Taylor, and if you stop him, you can stop Indy. With the Chargers, they don't need their running game to beat you, they just need Herbert. As a matter of fact, the Chargers are 1-2 this year when they rush for 150 yards or more, so they're actually worse when they run the ball well. For the Chargers to win this game, they need Herbert to pick apart the Steelers and not turn over the football. (The Chargers are 5-0 this season when Herbert has a QB rating above 100 and 1-3 when he doesn't.) The loss of Joe Alt hurts because the Chargers weren't really in a position to lose any more offensive linemen, but I'll say that Herbert puts on his Superman cape and leads the Chargers to a prime-time win.\" -- CBS Sports NFL writer John Breech on why he likes Los Angeles to roll over Pittsburgh, 34-27. To see the rest of his Week 10 picks, click here.\n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Steelers at Chargers (-3)\n                            \n    \n                                                \n                    \n    \n        \n                            Chargers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Chargers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Chargers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Chargers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Chargers\n                    \n    \n        Eagles at PackersMonday, 8:15 p.m. on ABC (Stream: Fubo -- try for free)\nNeed help formulating a pick for Monday's matchup between the Eagles and Packers? Look no further than SportsLine's R.J. White. He is as dialed in as you could want to be when betting NFL, and especially Packers games. In games involving Green Bay, White owns a staggering 47-19 (+2439) record, and has made an official play in this prime-time affair. To check that out, go log on to SportsLine.Eagles +2.5: \"Philadelphia will be well-rested coming off its Week 9 bye and has historically fared well in this spot, owning a 4-0 post-bye record under Nick Sirianni. The second reason I'm wary of Green Bay on Monday night is the absence of Tucker Kraft, who suffered a season-ending knee injury last week. He has been the key cog in the offense, leading the team in receiving yards. With such a young receiver room, it may take some time for the offense to find its new rhythm, and the Eagles' revamped, post-deadline defense isn't the group that will give them many opportunities to do so.\" -- CBS Sports NFL writer Tyler Sullivan on why he likes Philadelphia to pull off the upset in Lambeau Field, 23-21. To see the rest of his Week 10 picks, click here.\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cody Benjamin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Eagles at Packers (-2.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Packers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Packers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 10 picks, odds, predictions: Best bets, survivor plays, expert tips - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/6e6a09fa-ae0c-4ce9-bb17-67fb39495fc3/thumbnail/1200x675/24f0428a7783e83eec3923f399cd0bd4/daniel-jones.jpg"
      ],
      "datePublished": "2025-11-07T15:31:39.000Z",
      "dateModified": "2025-11-07T15:31:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football storylines for Week 11 games: LSU, Auburn interim coaches face trial by fire - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-week-11-games-schedule-interim-coaches-trial-by-fire-lsu-auburn-notre-dame-test/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/1484c2e9-c057-4dcd-9402-ad85e4373753/thumbnail/1200x675/033b237a690d403295942d5db074f7cb/dj-durkin-1.jpg",
    "tag": "Sports",
    "date": "2025-11-07T15:04:12.000Z",
    "description": "\n        We have hit the home stretch of the 2025 regular season. It feels like we just kicked things off, and yet somehow it is already November. We'",
    "body": "\n        We have hit the home stretch of the 2025 regular season. It feels like we just kicked things off, and yet somehow it is already November. We've seen a Power Four coach fired for four consecutive Sundays now. The obvious names are running out ahead of what should be a quiet Sunday this week, especially with Wisconsin proclaiming that Luke Fickell will be back next season, but never doubt a particularly bad loss' impact on a coach's standing. This is a relatively quiet week from a big game standpoint with only three ranked-on-ranked games between No. 7 BYU vs. No. 8 Texas Tech, No. 3 Texas A&M vs. No. 22 Missouri and No. 9 Oregon vs. No. 20 Iowa. Still, all three have the possibility to shape the College Football Playoff race, especially that Big 12 showdown in Lubbock. Let's get to what you need to know ahead of this weekend. Week 11 storylines...Interim watchOn Saturday we get the debut of two new interim coaches and each is immediately getting thrown into a top-25 road game. New LSU interim coach Frank Wilson at least had a bye week to get accustomed to being back in the big chair, but the scheduling gods didn't do him any favors with a trip to No. 4 Alabama. At Auburn, defensive coordinator DJ Durkin got the bump up after Hugh Freeze's firing on Sunday and has to go to No. 16 Vanderbilt. Diego Pavia, who started his career at New Mexico State, is going for a 3-0 career record against the Tigers. What will be interesting is whether any of the remaining interim coaches this year can build momentum toward the permanent gig. Kent State was the first to decide it liked what it saw from its interim, promoting Mark Carney to the full-time job last week. Last year we saw East Carolina interim Blake Harrell go 5-1 down the stretch and ultimately get the permanent job. So far, so good for Harrell who is 5-3 this season with his only losses coming to No. 7 BYU, NC State and Tulane. \nAt the moment, it feels unlikely another interim will join Carney, but not impossible. Bobby Petrino felt like the best shot at it, getting seven games to prove Petrino 2.0 would make sense permanently in Fayetteville after all the success from 2008-11 before it came crashing down. Unfortunately for Petrino, the Razorbacks are winless since he took over and haven't been able to capitalize on multiple opportunities for an SEC win. Arkansas finishes with LSU, at No. 11 Texas and No. 22 Missouri. UCLA's Tim Skipper generated national headlines with three consecutive wins after taking over for Deshaun Foster, including one over a then-top 10 Penn State team, but a 56-6 loss to Indiana brought the Bruins back to earth. Still, if Skipper can add wins given the remaining opponents (No. 1 Ohio State, No. 19 USC, No. 23 Washington and Nebraska) he'd warrant real consideration for the job. \nDurkin, who is popular in Auburn, could be intriguing if he wins out and beats Alabama in the Iron Bowl. Friday night fightOne of the most intriguing matchups of the weekend comes Friday night when Tulane travels to Memphis. Not only is it a battle to stay in the American Conference title race (and thus the CFP race), but it features two of the hottest candidates in an already-hectic coaching carousel. Tulane's Jon Sumrall is already a hot name for the Auburn opening while Memphis' Ryan Silverfield could be in the mix for multiple jobs if he wants to be. Memphis has the inside track as the Group of Six team to make the playoffs, but a loss to UAB is a blemish on the resume. Still, the Tigers rebounded well and beat South Florida and Rice after the surprise loss to the Blazers. Tulane has wins over Northwestern and Duke, but a loss to UTSA last week looms large. Another Tulane loss and the Green Wave are likely out of the American title chase. The Tigers are 4.5-point favorites in the game that kicks off at 9 p.m. Eastern on Friday night. \nBiggest test left for Notre Dame?Notre Dame was one of the big winners of the initial CFP rankings, slating in at No. 10. Despite losing its two biggest games of the season (No. 3 Texas A&M, No. 18 Miami), the Fighting Irish are in great position to make the playoffs again. The remaining schedule is incredibly manageable and if Notre Dame wins out, it should be in despite loud protests in SEC country. Notre Dame plays No. 24 Pittsburgh in a week, but its toughest remaining test may actually be this weekend against Navy. Led by offensive coordinator Drew Cronic, the Midshipmen boast a high-powered offense that averages 34.8 points per game and leads the country with a 317.25 yards rushing per contest. Navy quarterback Blake Horvath has 20 total touchdowns (13 rushing, seven passing) and 2,069 yards from scrimmage. Even with a loss to North Texas, Navy is very much still in the American title race with Memphis, Tulane and others. Can Navy beat Notre Dame? It's unlikely. Can Navy make Notre Dame at least work for it for a half or so? I think so. When the remaining schedule is Pittsburgh, Syracuse and Stanford, there aren't a lot of viable options to choose from tough remaining opponents. Navy has as good a shot as anyone left on the schedule. \nSALTY TALTYEach week this space will be my airing of grievances, my opportunity to let the audience know what has been really grinding my gears. Hopefully it'll be mostly college football-related, but it's a good bet travel, family and other day-to-day life annoyances will find a way in. Wisconsin athletic director Chris McIntosh's explanation for bringing Luke Fickell back for a fourth season, which included saying he won't be judged on just wins and losses, went over like a lead balloon with Badgers fans. And, frankly, I can't blame them. I think Fickell is a good coach. You don't take a program like Cincinnati to the then-four-team playoff as the first Group of Five program to do so if you're bad at your job. There's a reason why he was a hot name for every prominent job opening for a stretch, too. \nBut it clearly hasn't worked at Wisconsin. Fickell is 15-19 in three seasons in Madison and there's a real chance the 2-6 Badgers could finish this year 2-10. Wisconsin gets No. 23 Washington this weekend and then finishes with No. 2 Indiana, Illinois and Minnesota. There's not an easy win left there. McIntosh is selling to fans the idea of putting in additional resources to try to make Fickell successful rather than pay a $25 million or so buyout this season to start over with a new coach. That makes sense, in theory, though we've seen over and over again this season the all-in approach for an embattled coach hasn't paid off. Just ask James Franklin, Brian Kelly and Hugh Freeze. Perhaps most importantly: What has Fickell done to elicit any reason for hope and optimism from Wisconsin fans? \nThere have been numerous stories recently about out-of-whack fan expectations driving a wild coaching carousel. The math can't math if every fanbase demands its program make the playoff. There's only 12 spots, and yet far more programs that believe they are owed one annually. Even in the wake of firing Brian Kelly, new LSU AD Verge Ausberry said the Tigers should be in the playoff every year. But when the entire sport is built around making the CFP, why is anyone surprised that fans now only care about that and not simply making a bowl game? The expectations may be unfair, especially on the coaches, but this is the trade-off schools unknowingly made when they started pushing their fans to give more and more of their money to pay for everything from NIL to facilities upgrades. Those fans want more of a say now and a return on their investment. If you sell them on how a quarterback who costs $1.5 million is critical for the program and that QB turns out to be a bust, they are going to have something to say about it. \nIt's not for people like me to say that these fans are undeserving. There is nothing that frustrates me more, frankly, than media people telling fans to just be happy with what they have. If Indiana had listened to the pundits' opinion of where it stood in the pecking order, it wouldn't be one of the best teams in the country now. Indiana and its fans wanted more than what it traditionally had been. I may disagree with, for instance, Tennessee fans getting restless already over Josh Heupel, who I believe is a good coach, but it's their money, their time and their passion.It's time to stop talking down to fans and telling them what they are allowed to want. In this parity era of college football, anything and everything is possible. And if Wisconsin fans are disappointed over another year of Fickell, they have every right to be. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football storylines for Week 11 games: LSU, Auburn interim coaches face trial by fire - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/1484c2e9-c057-4dcd-9402-ad85e4373753/thumbnail/1200x675/033b237a690d403295942d5db074f7cb/dj-durkin-1.jpg"
      ],
      "datePublished": "2025-11-07T15:04:12.000Z",
      "dateModified": "2025-11-07T15:04:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama vs. LSU prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/alabama-lsu-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/279d81db-0cdc-4162-86c0-7380266cd755/thumbnail/1200x675/6637c1a003a5b22fc14a3f76833b1488/lsu-vs-alabama-2024.jpg",
    "tag": "Sports",
    "date": "2025-11-07T14:50:29.000Z",
    "description": "\n        No. 4 Alabama is in control of its own destiny as it prepares to host LSU in a rivalry showdown on Saturday. The Crimson Tide (7-5, 5-0 SEC) ",
    "body": "\n        No. 4 Alabama is in control of its own destiny as it prepares to host LSU in a rivalry showdown on Saturday. The Crimson Tide (7-5, 5-0 SEC) face a manageable November slate and are on pace to appear in the SEC Championship Game and to receive a first-round bye in the College Football Playoff.But the Tigers (5-3, 2-3) would love nothing more than to sow chaos inside Bryant-Denny Stadium as they begin life without Brian Kelly. The dismissal of LSU's fourth-year coach eight games into the season leaves the Tigers under the direction of interim coach Frank Wilson as they enter one of the nation's most hostile environmentsThe Crimson Tide have won 84 straight home games against unranked teams, which is the longest streak of any team in college football over the past 30 years. LSU is no ordinary unranked team, however. For all their flaws, the Tigers are still a talented team that could be galvanized by the shock of Kelly's firing and the installation of Wilson as the interim.Alabama has reeled off seven straight wins since its shocking Week 1 loss at Florida State. The run has calmed the waters surrounding second-year coach Kalen DeBoer. But crazy things happen when these teams meet, and the Crimson Tide will need to be ready for an LSU team playing with nothing to lose.\n  Alabama vs. LSU: Need to know  Bad omen: This is just the fourth time in the past 40 years that a team is facing a top-five opponent on the road while playing its first game under an interim coach. The previous three each lost by 30+ points. Most recently, Texas Tech fell 52-21 at No. 4 Oklahoma in 2021 the week after firing Matt Wells. LSU interim coach Frank Wilson is no stranger to be in charge, however. He was the head coach at UTSA from 2016-19 and then at McNeese for two years before joining Brian Kelly's staff as running backs coach in 2022.Ty Simpson's big year: Alabama quarterback Ty Simpson is just the third SEC quarterback since 2000 to have 20 or more touchdown passes with one interception or less through eight games. The redshirt junior was an unknown commodity entering the season after serving as a backup for his first three seasons on campus. But his patience has been rewarded in a significant way as he sits at third on the Heisman Trophy odds sheet (+390 at FanDuel) entering Week 11 action. Simpson hasn't been intercepted since a Week 1 loss at Florida State and has made a habit of delivering clutch throws under game pressure during the Crimson Tide's seven-game winning streak.A welcome distraction: If LSU can put up a fight on the road against Alabama, it may be a welcome distraction for a university community grappling with the public fallout of Brian Kelly's firing. Louisiana governor Jeff Landry suggested he would let Donald Trump make LSU's coaching hire before allowing athletic director Scott Woodward to find Kelly's replacement. Woodward was subsequently fired as part of what amounts to a wholesale overhaul of university leadership. LSU also hired a new president this week, Wade Rousse, and he promptly elevated interim athletic director Verge Ausberry to the full-time position. Finally, a football game can provide a temporary diversion from the chaos.\n  Where to watch Alabama vs. LSU liveDate: Saturday, Nov. 8 | Time: 7:30 p.m. ET  Location: Bryant-Denny Stadium -- Tuscaloosa, Alabama  TV: ABC | Live stream: Fubo (Try for free)Alabama vs. LSU prediction, picks  \nLSU is in absolute institutional turmoil following the dismissal of coach Brian Kelly, which came on the heels of an embarrassing home loss to Texas A&M. The Tigers have no running game, shoddy pass protection and a quarterback who appears to be struggling with confidence. What about the defense? A unit that gave up 10 points or less in its first four games has looked far more vulnerable against quality opposition. Alabama presents arguably the toughest test yet. Look for the Crimson Tide to cruise at home. Pick: Alabama -10\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            BAMA -10.5\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            LSU\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    Who will win and cover in each Week 11 college football game? Legendary Vegas expert Bruce Marshall is on a 24-10 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama vs. LSU prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/279d81db-0cdc-4162-86c0-7380266cd755/thumbnail/1200x675/6637c1a003a5b22fc14a3f76833b1488/lsu-vs-alabama-2024.jpg"
      ],
      "datePublished": "2025-11-07T14:50:29.000Z",
      "dateModified": "2025-11-07T14:50:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer tool - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-lineup-advice-optimizer-week-10-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/23869400-14c4-400f-b9ca-231683b9cfa0/thumbnail/1200x675/b1ecaaeaf8e5bc88272e7e93c665a56d/goff-vs-bucs-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-11-07T14:28:28.000Z",
    "description": "\n        Ten more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET window, and those matchups comprise the main sla",
    "body": "\n        Ten more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET window, and those matchups comprise the main slate for NFL DFS sites like FanDuel and DraftKings. One of the early kickoffs -- Bills vs. Dolphins -- has the highest over/under (50) for the week, so that game should be a focus for NFL daily Fantasy players with big names like Josh Allen, De'Von Achane and James Cook in action. Other big names expected to be playing on the main slate include Christian McCaffrey, Jahmyr Gibbs and Justin Jefferson.How should they factor into your NFL DFS picks this week, and who are the sleepers in the NFL DFS player pool that can help differentiate your lineups? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, where they can pick at Underdog and get $100 in site credits after making a $5 wager:The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool for sports betting apps.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 10 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 10 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is Detroit Lions quarterback Jared Goff at $5,900 on DraftKings and $7,800 on FanDuel. Goff is averaging nearly 240 passing yards per week, and has only had fewer than 200 yards one time this season, giving him a high floor. He's also thrown 17 touchdowns against the just three interceptions. The Lions face the Commanders, a team that has given up the fifth-most Fantasy points to opposing quarterbacks. See who else to pick here.The optimizer's NFL DFS strategy also includes building around Carolina running back Rico Dowdle at $8,000 on FanDuel and $6,300 on DraftKings. Since taking over the starting job in Carolina in Week 5, Dowdle has been one of the league's best backs. He's rushed for 652 yards and three touchdowns in that span, while adding 10 catches and a receiving touchdown. He faces the Saints, who have given up the 22nd most Fantasy points to opposing running backs. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to build Sunday Week 10 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer tool - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/23869400-14c4-400f-b9ca-231683b9cfa0/thumbnail/1200x675/b1ecaaeaf8e5bc88272e7e93c665a56d/goff-vs-bucs-usatsi.jpg"
      ],
      "datePublished": "2025-11-07T14:28:28.000Z",
      "dateModified": "2025-11-07T14:28:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Notre Dame vs. Navy prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/notre-dame-navy-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/5ae978e3-115a-49ca-8ee0-8f33c8a9b2f6/thumbnail/1200x675/ae405035537824a099f880fcf6c49467/nd-picks-1.jpg",
    "tag": "Sports",
    "date": "2025-11-07T14:40:28.000Z",
    "description": "\n        One of college football's great rivalries adds another chapter Saturday as Notre Dame and Navy meet for the 98th time. This year, the Fightin",
    "body": "\n        One of college football's great rivalries adds another chapter Saturday as Notre Dame and Navy meet for the 98th time. This year, the Fighting Irish enter with College Football Playoff hopes on the line, while Navy's path to the CFP remains a long shot through the American. It's not a game that will make or break Navy's season, but math won't be top of mind when these two teams kick off a contest that has been a defining part of both programs' histories.In series history, Notre Dame holds a commanding edge. The Fighting Irish lead 83-13-1 and have won 12 of the last 13 meetings dating back to 2011. With 98 matchups, it's the most-played rivalry in Notre Dame history, including an unbroken run from 1927 to 2019.Notre Dame will take the field looking to validate its top-10 status after the College Football Playoff selection committee ranked Marcus Freeman's squad among the nation's best, reflecting the Fighting Irish's recent rise in the polls. If the CFP started today, Notre Dame would be in, but at No. 10 that position is tenuous and will be tested each week starting Saturday night in South Bend.  Notre Dame vs. Navy: Need to know  CJ Carr among the most impressive rookies in the sport: Redshirt freshman quarterback CJ Carr ranks second among all freshman quarterbacks in FBS in passing touchdowns (16) and fourth among rookies in passing yards (2,057). Carr has thrown for more than 290 yards four times this season, all against power-conference opponents, and his rise to the QB1 role has unlocked a breakout season for junior wide receiver Jordan Faison. A former lacrosse commit who wasn't on the radar as a high-level football prospect, Faison spent two years as a rotational piece at wide receiver but has already set single-season career highs for receptions (39) and receiving yards (518), leading the team in both categories.Love ranks as one of Notre Dame's all-time running backs: Jermiyah Love moved into a tie for sixth in Notre Dame history with 35 career rushing touchdowns after scoring twice in last week's win over Boston College. He is also one of the longest-tenured running backs in school history, with 25 consecutive starts at the position (tied for third all-time), and etched his name into Notre Dame Stadium history with a 228-yard performance against rival USC earlier this year.\nNavy's veteran quarterback has some history against the Fighting Irish: Navy quarterback Blake Horvath ranks among the nation's most productive players, checking in fifth nationally in FBS rushing yards (926) and second in rushing touchdowns (13). Horvath ran for 129 yards and a score against Notre Dame last season in a 51-41 loss, but also threw an interception and lost two fumbles. Taking care of the football will be crucial against a Notre Dame defense that ranks fourth nationally in turnover margin (+10). If the Midshipmen avoid back-breaking mistakes, Horvath and the Navy run game could have a chance to get going.  Where to watch Notre Dame vs. Navy live  Date: Saturday, Nov. 8 | Time: 7:30 p.m. ET  Location: Notre Dame Stadium -- South Bend, Ind.  TV: NBC | Live stream: Fubo (Try for free)  Notre Dame vs. Navy prediction, picks  \nThe Fighting Irish should be able to move the ball effectively against a Navy defense that has allowed more than 25 points per game to conference opponents. Notre Dame ranks 12th nationally, averaging 37.4 points per game, and should not only be able to score on most possessions but do so quickly with explosive plays. Factor in Navy's potential for a big run or two, and a final score around 49-14 would likely push the game well over the total. Pick: Over 55.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            ND -22.5\n                            \n    \n                                                \n                    \n    \n        \n                            Notre Dame\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Notre Dame\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Navy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Navy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Notre Dame\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Notre Dame\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Navy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Navy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Navy\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Notre Dame\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    Who will win and cover in each Week 11 college football game? Legendary Vegas expert Bruce Marshall is on a 24-10 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Notre Dame vs. Navy prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/5ae978e3-115a-49ca-8ee0-8f33c8a9b2f6/thumbnail/1200x675/ae405035537824a099f880fcf6c49467/nd-picks-1.jpg"
      ],
      "datePublished": "2025-11-07T14:40:28.000Z",
      "dateModified": "2025-11-07T14:40:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 11 college football odds, picks, predictions, betting guide for Friday, Nov. 7 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/week-11-college-football-odds-best-bets-friday-college-football-picks-betting-predictions-nov-7/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/424b0b49-5ec3-498e-8d70-b1ed902fb267/thumbnail/1200x675/8393e3d66ac0727015089e73f8d72507/jayden-maiava-usc-trojans.jpg",
    "tag": "Sports",
    "date": "2025-11-07T14:23:58.000Z",
    "description": "\n        There are three Week 11 college football games on Friday night, and none of the six teams involved are below the .500 mark this season. No. 1",
    "body": "\n        There are three Week 11 college football games on Friday night, and none of the six teams involved are below the .500 mark this season. No. 19 USC is the lone top-25 team in action, as it hosts Northwestern in a Big Ten matchup at 9 p.m. ET. The Trojans, who bounced back from a loss at then-No. 13 Notre Dame with a win at Nebraska last week, are 14.5-point home favorites against Northwestern. SportsLine's proven computer model is backing USC to cover the spread in that contest, as the Wildcats have already lost two games by 20 points this season.   Friday's other matchups are UCF vs. Houston at 8 p.m. ET and Memphis vs. Tulane at 9 p.m. ET. The model is backing UCF and Memphis to cover the spread in their respective matchups for Friday online sports betting. Click here to bet on Friday's games with the latest DraftKings promo code, which gives new users $300 in bonus bets if your first $5 bet wins, and three months of NBA League Pass free:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best bets for Friday's college football scheduleUCF -105 vs. HoustonMemphis -3.5 vs. TulaneUSC -14.5 vs. NorthwesternClick here to bet on the Friday college football action at BetMGM, which offers up to $1,500 in bonus bets if your first bet loses:Friday college football best bets Game: UCF vs. Houston, 8 p.m. ETThe Pick: UCF -105Houston picked up its first top-25 ranking after beating then-No. 24 Arizona State on Oct. 25, but the Cougars lost to West Virginia by 10 points at home last Saturday. The Mountaineers, who were previously winless in conference play, racked up 45 points against Houston, which turned the ball over four times. The Cougars are 1-2 when they have turned the ball over at least once, and they are facing a UCF pass defense that ranks 11th nationally, allowing just 161.4 yards per game. SportsLine's model has UCF winning outright 52% of the time as a slight underdog. Game: Memphis vs. Tulane, 9 p.m. ETThe Pick: Memphis -3.5Memphis lost to UAB on Oct. 18, but it has responded with wins over then-No. 18 South Florida and Rice to improve to 8-1 overall this season. The Tigers are squarely in the running for a College Football Playoff berth, while Tulane is coming off a crushing loss at UTSA. The Green Wave were 6-point favorites in that matchup, but they gave up 370 passing yards and 48 points. This is the second consecutive road game for them, which is one reason why the model has Memphis covering the spread in 62% of simulations. Game: USC vs. Northwestern, 9 p.m. ETThe Pick: USC -14.5 USC heads into the final four games of the regular season chasing a spot in both the Big Ten Conference title game and the College Football Playoff. The Trojans are heading home for the first time since picking up a 31-13 win over then-No. 15 Michigan on Oct. 11, wrapping up their back-to-back road games with a 21-17 win at Nebraska last week. Their offense ranks eighth nationally in points per game (39.8), while quarterback Jayden Maiava ranks inside the top 10 in passing yards per game (289.4). Northwestern does not have enough firepower to match USC, which is covering the spread 55% of the time.  More college football best betsEvery college football game simulated 10,000 times\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 11 college football odds, picks, predictions, betting guide for Friday, Nov. 7 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/424b0b49-5ec3-498e-8d70-b1ed902fb267/thumbnail/1200x675/8393e3d66ac0727015089e73f8d72507/jayden-maiava-usc-trojans.jpg"
      ],
      "datePublished": "2025-11-07T14:23:58.000Z",
      "dateModified": "2025-11-07T14:23:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's early best bets to target: Friday top picks for Celtics vs. Magic, Georgetown vs. Maryland, Serie A - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-early-best-bets-to-target-friday-top-picks-celtics-magic-georgetown-maryland-soccer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/37ab4993-5662-447f-be9d-61f2bf0e2b98/thumbnail/1200x675/caf51b4c861c006b4624f4fc4d7ae2fc/jaylen-brown-celtics.png",
    "tag": "Sports",
    "date": "2025-11-07T15:00:40.000Z",
    "description": "\n        Friday features another jam-packed slate with online sports betting options throughout the day. The Friday sports calendar features three col",
    "body": "\n        Friday features another jam-packed slate with online sports betting options throughout the day. The Friday sports calendar features three college football games and NHL action and more at night, and the SportsLine Projection Model can help you start the day right with its early best bets. The model's top picks for Friday include Serie A soccer, Celtics vs. Magic in the NBA, and Georgetown vs. Maryland in college basketball.Click here to bet today's games with the latest bet365 promo code, which gives new users $200 in bonus bets with a $5 wager, whether it wins or loses:Whether you're looking into NFL betting, NHL betting, college basketball betting and college football betting or anything else on the Friday sports schedule, there are a number of online sports betting options, and our team can help point you in the right direction. Our computer model and experts will weigh in on all of the biggest events every day, and they're offering their top sports betting picks right now.Friday's early best betsCremonese (+0.5) vs. Pisa (-160)Celtics (+3.5) vs. Magic (-108)Maryland (-6.5) vs. Georgetown (-105)Combining these three picks into a Friday parlay at DraftKings would result in a payout of +485 (risk $100 to win $485). Bet it at DraftKings here:Friday soccer bets Game: Cremonese at Pisa (2:45 p.m. ET) on Paramount+The Pick: Cremonese +0.5 (-160)\"Pisa are one of the three teams left in Serie A play, who 10 matches into the season, are yet to find a single win,\" SportsLine soccer expert Jon Eimer said. \"While they are struggling to win, they have managed to become a bit of a draw specialist, with their last four matches straight ending with no victor. This is a team that either plays up or plays down to their competition, but never seems to have enough to claim all three points. While I wouldn't be shocked to see another draw, I can't ignore a better Cremonese side on the spread.\"Use the latest DraftKings promo code, where new users receive $300 in bonus bets if their first $5 wager wins and three months of free NBA League Pass:More soccer best betsEvery EPL match simulated 10,000 timesFriday NBA best bets Game: Boston Celtics vs. Orland Magic (7 p.m. ET)The Pick: Celtics +3.5 (-108)It's no surprise the Celtics will go through a learning curve to playing without Jayson Tatum (Achilles), but after dropping their first three games of the season, the Celtics are 4-2 over their last six games, and one of those two losses came by only two points, as the model likes Boston to cover as 4.5-point underdogs on Friday. The Magic are coming off a 127-112 loss to a Hawks team without Trae Young, and they are off to a 3-5 start this season. The model projects the Celtics to cover in 51% of simulations.Use the latest DraftKings promo code, where new users receive $300 in bonus bets if their first $5 wager wins and three months of free NBA League Pass:More NBA best betsEvery NBA game simulated 10,000 timesFriday college basketball best bets Game: Georgetown vs. Maryland (6 p.m. ET)The Pick: Maryland -6.5 (-105)Maryland took care of its business with a 22-point victory over Coppin State in its opener, coming off a 27-9 season and reaching the Sweet 16. Maryland lost to the eventual national champion Florida Gators and the Terrapins have built another strong roster this season. Pharrell Payne, a Texas A&M transfer, scored 21 points in the season-opener. Meanwhile, Georgetown is coming off an 18-16 season and missing the NCAA Tournament. This will be their first meeting since 2016, but Maryland has won the last two head-to-head matchups. The model projects Maryland to cover in 59% of simulations. Use the latest BetMGM promo code, where new users receive up to $1,500 in bonus bets if your first bet loses:More college basketball best betsEvery college basketball game simulated 10,000 times\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's early best bets to target: Friday top picks for Celtics vs. Magic, Georgetown vs. Maryland, Serie A - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/37ab4993-5662-447f-be9d-61f2bf0e2b98/thumbnail/1200x675/caf51b4c861c006b4624f4fc4d7ae2fc/jaylen-brown-celtics.png"
      ],
      "datePublished": "2025-11-07T15:00:40.000Z",
      "dateModified": "2025-11-07T15:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joel Embiid's minutes restriction has forced 76ers to get creative -- and it works - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/76ers-joel-embiid-offense-minutes-restriction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/ffe21dfc-7ee8-429f-9953-629e55ff9ae8/thumbnail/1200x675/879054b8175cb0d90df044e540e7e21b/embiid-getty.png",
    "tag": "Sports",
    "date": "2025-11-07T14:26:53.000Z",
    "description": "\n        The Philadelphia 76ers' success has always hinged on Joel Embiid's health and availability. In the years during which he misses significant t",
    "body": "\n        The Philadelphia 76ers' success has always hinged on Joel Embiid's health and availability. In the years during which he misses significant time due to injuries, it typically spells disaster for the Sixers. When Embiid played 19 games last season, the Sixers won 24 games. Two seasons ago, when he appeared in 39 games, Philly limped to a seventh-place finish and suffered a first-round playoff exit to the Knicks.This year, Embiid is on a minutes restriction and is averaging a career low in points (17.8) and rebounds (5.4) and is shooting the ball worse than he ever has at 42.3% from the floor. Despite that, Philadelphia has managed to start the season 5-3 and possesses the second-best offense in the league.In any other year, if Embiid was performing that inefficiently, the Sixers would be bottoming out. The sky would be falling and talks of tanking would be growing. The faithful fans would be looking ahead to the next Eagles game and any mention of the Sixers would be met with an eye roll. It's dramatic, but given the history of this team's success being directly correlated to Embiid's performance and health, it's also the truth. When Embiid isn't on the floor, the Sixers' offense falls off a cliff. Excluding last season, since 2020, the Sixers have scored 7.4 points fewer per 100 possessions when Embiid is on the bench. He's one of the most effective offensive players in the league and there aren't many more players who are more important to their team's success than Embiid is to the Sixers'.\nEmbiid's on/off numbersSeasonSixers points per 100 possessions (On court)Sixers points per 100 possessions (Off court)2025-26120.0121.52024-25105.5113.02023-24120.7114.82022-23120.9114.72021-22116.9109.72020-21119.1108.7This season hasn't been like those of the past, though. When Embiid's on the bench, the Sixers' offense actually operates better. It's not a significant change, just 1.5 points more per 100 possessions, but it's a step in the right direction as Philadelphia tries to navigate life with Embiid's status constantly changing.\"I think the biggest thing is, we wanted to get some more depth,\" Sixers coach Nick Nurse said prior to Philadelphia's loss to the Chicago Bulls on Tuesday. \"We wanted to get some more speed, more athleticism. Just to be ready to play in case he's in or he's not. They understand he didn't play a ton last year and we knew he'd be out some this year until he gets back in the fold. So I think we just wanted to make sure we could try to function a little better and a little differently when he isn't available.\"Embiid's even relished the fact that the Sixers offense won't struggle as much this season when he goes to the bench. When asked after Philadelphia's win against the Hornets how it feels to see the Sixers playing better when he's on the bench, which was a massive problem last season, the seven-time All Star offered a correction.\"It's been 12 years, so I'll take it,\" Embiid said with a smile. \"Just got to keep it going. Obviously the most important games are the best teams and the playoffs. If that's the effort we're going to have when I'm not on the floor, amen. It's been a long time.\"The addition of No. 3 overall pick in the 2025 draft VJ Edgecombe has certainly helped matters. The tandem of him and Tyrese Maxey in the backcourt allow the Sixers to play fast and wreak havoc in the open floor. We already know Maxey's capable of that and he's since raised his game to another level, sitting second in the league in scoring (33.5). But no one expected Edgecombe to be this effective this early on. That duo has Philadelphia generating more points in transition than ever before.Sixers' transition efficiencySeasonTransition frequencyPoints per possessionPoints per game2025-2619.0%1.2628.32024-2517.4%1.1522.02023-2416.7%1.1921.92022-2315.4%1.2119.92021-2213.6%1.1917.12020-2116.5%1.1320.8Through the first eight games of the season, Edgecombe is averaging 17. points, 5.6 rebounds and 4.8 assists on 39.1% from 3-point range. He and Maxey play so well off each other you'd think they've been doing it for years. And when either of those two goes to the bench, Nurse can go to Quentin Grimes, who should be considered a frontrunner for Sixth Man of the Year. Grimes is averaging a career-high 18.3 points off the bench for the Sixers. He's explosive and is just as dangerous from 3-point land. There's also second-year guard Jared McCain, who just made his season debut against the Bulls, his first game since tearing his meniscus in December 2024. McCain was on track to run away with Rookie of the Year last season and if he returns to that level of play, the Sixers will have -- aside from the Thunder -- arguably the best backcourt depth in the league.With Embiid playing himself into shape after missing most of the preseason, that backcourt depth has been the reason the Sixers have gotten out to such a strong start. That's not to say Embiid hasn't been important, because the defensive attention he requires allows for guys like Edgecombe, Grimes and Oubre to get better looks. But Philadelphia hasn't needed to run its entire offense through the big man to see success.Instead, we're seeing a more balanced offensive attack from the Sixers. It's fewer post ups and isolation plays from Embiid and more pick-and-rolls with Maxey, Edgecombe and Grimes. It's relying less on Embiid's brute force and more on the creation of the guards. All three of them, and McCain once he gets his footing, can get their own bucket or give Embiid the ball in the right spot to take more efficient shots.Embiid's play typesSeasonPick and rollPost-upIsolationSpot-up2025-2624.7%18.6%12.4%15.5%2024-2524.7%19.3%14.0%9.8%2023-2416.6%19.2%18.5%10.1%2022-2322.4%17.1%23.0%11.4%2021-2216.1%27.3%17.0%11.8%2020-2112.7%35.8%12.6%11.2%The change in how Embiid's being used can also help lessen the physical burden on his body, too.\"I'm hoping that he's still probably going to do a lot,\" Nurse said. \"He's a magnetic player on both ends of the floor, but I'm hoping for more variety, right? I keep talking to them about different spots, different players, him and different players. Letting things come to the offense more than than just always through him. I think it'll just make us function better. I think it'll take some of the -- just even the way that you say, it puts a lot on him, to have to do all that sometimes. Hopefully it'll help some of our longevity through the season as a team too.\"It's a small sample size and the Sixers haven't even factored in Paul George, whose return could be coming soon as he's been participating in practice. But even with a diminished version of Embiid right now, the Sixers have the ability to be more creative because of the backcourt depth. It's lifted some of the offensive burden off Embiid's shoulders.Embiid's health will still be a constant question and the Sixers will need him in order to make any run in the playoffs. But this start is encouraging in knowing that Philadelphia doesn't have to live and die with Embiid's performance every night.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joel Embiid's minutes restriction has forced 76ers to get creative -- and it works - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/ffe21dfc-7ee8-429f-9953-629e55ff9ae8/thumbnail/1200x675/879054b8175cb0d90df044e540e7e21b/embiid-getty.png"
      ],
      "datePublished": "2025-11-07T14:26:53.000Z",
      "dateModified": "2025-11-07T14:26:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]