[
  {
    "title": "How the Pistons made the NBA's most drastic turnaround: From record losing streak to first place in two years - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/pistons-drastic-turnaround-losing-streak-first-place/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/47b05b52-4a5b-4c13-93b7-fe0d2c536da8/thumbnail/1200x675/201089bf028475c1d41702ab283f9f72/cade-cunningham-getty-5.png",
    "tag": "Sports",
    "date": "2025-12-12T15:47:12.000Z",
    "description": "\n        This time two years ago, the Detroit Pistons were 20 defeats into a losing streak that would ultimately reach an NBA-record-tying 28 games. T",
    "body": "\n        This time two years ago, the Detroit Pistons were 20 defeats into a losing streak that would ultimately reach an NBA-record-tying 28 games. The mood was so bad during that stretch that Cade Cunningham was fighting back tears as he walked off the floor after their 25th consecutive loss, and they ultimately finished 14-68. It was the worst season in franchise history. There are no tears in Detroit these days. The Pistons are 19-5, which is good for first place in the Eastern Conference, and only the defending champion Oklahoma City Thunder have a better record overall. Their 13-game winning streak from Oct. 29 through Nov. 24 tied a franchise record, and this is the latest in a season they've been atop the East since 2005 -- coincidentally the last time they made the Finals. \"The biggest thing is we're still hungry. Not everybody here went through [the 28-game losing streak] with us, but the guys who were here truly understand and still feel like we've got a lot to prove,\" Jalen Duren said late last month. \"We've still got a lot more room to grow. It's gonna be fun man, I think it's gonna be a hell of a ride as we continue to go through this season and improve and show the world, because I think people still don't believe in us. As we continue to prove them wrong, it's gonna be a fun ride.\"Before the Pistons return to action on Friday night against the Atlanta Hawks after nearly a week off due to the NBA Cup, let's take a closer look at how they went from worst to first in two years. \nA 'conscious decision' to keep the young core togetherThe Pistons made their first big leap last season when they won 44 games, made the playoffs for the first time since 2019 and pushed the New York Knicks to six games in the first round. Instead of cashing in their chips over the summer to bring in a star and expedite their rebuild, they decided to operate in the margins. They added Duncan Robinson, Caris LeVert and Javonte Green to give the locker room a few more veteran voices, but empowered their young core to lead the way. \"There was a maturation point for us. We made a conscious decision this summer to give our young guys an opportunity to continue to grow,\" coach J.B. Bickerstaff said prior to the team's win over the Milwaukee Bucks on Nov. 22. \"Some people may have made a jump and decided to package some of the young guys and go get older players. We felt like our young guys deserved an opportunity to continue to grow together.\"\nThe Pistons' faith in the likes of Cunningham, Jalen Duren and Ausar Thompson has paid off, but their early success hasn't quieted the trade talk. If anything there have only been more questions about whether they'll go star chasing ahead of the deadline if they have a real chance to win the East. Shams Charania reported earlier this month that the Pistons are one of the teams interested in Dallas Mavericks star Anthony Davis, but Omar Sankofa of the Detroit Free Press threw cold water on that idea Thursday. Late last month, Marc Stein, reported that the Pistons' thought process from the summer hasn't changed. \n\"The early indications are the Pistons are not in that mode. There has been very little tangible, bankable trade talk about the Pistons,\" Stein said on a recent episdoe of the All NBA Podcast. \"I don't think at this point there's any discussion about the Pistons doing anything dramatic.\"Cunningham is operating at an MVP levelCade Cunningham is almost certainly not going to win MVP this season -- no one is going to take that honor from Nikola Jokić or Shai Gilgeous-Alexander any time soon -- but he's worked his way into the conversation. Per Caesars, he has the fourth-best odds (+5000) behind only Jokić, Gilgeous-Alexander and Luka Dončić. Cunningham was recently named Eastern Conference Player of the Month for November, and is averaging 27.5 points, 6.4 rebounds, 9.3 assists and 1.5 steals per game -- all despite the fact that he's only shooting 29.9% from 3-point range. Thus far, he's either scored (577) or assisted (421) on 998 of the Pistons' 2,849 points (35%). \nOn a per-game basis, Cunningham is creating 47.5 points, and has a chance to break his own Pistons record. (Historic numbers via Pistons broadcast.) PlayerSeasonPoints CreatedCade Cunningham2024-2547.7Cade Cunningham2025-2647.5Jerry Stackhouse2000-0141Cade Cunningham2023-2440Grant Hill1996-9739.2Cunningham is 11th in the league in scoring and second in assists, and has a real chance to become the eighth player in league history to average at least 28 points and nine assists for a season. When Cunningham is on the floor, the Pistons have a plus-8.5 net rating, and when he sits, they have a minus-0.6 net rating. If all that wasn't enough, Cunningham also leads the Pistons in minutes by a significant margin (36.4 per game, no one else at even 32). Cunningham is running the show in Detroit, but he isn't satisfied. \"I've felt like I was in more of a rhythm than this, for sure, Cunningham said late last month. \"Still coming, still working, things that I could sharpen for sure, shots that I wish would have fell, or whatever. I've definitely felt more in rhythm than this, and that's the exciting part. There's still so much more to get. There's some low-hanging fruit that I could get right now that would help me take my game to another level too.\"\n'JD is different'Cunningham has been the Pistons' best player for a few years now, but the team has been searching for a true No. 2 option to play alongside him. It just might be Jalen Duren, who is off to a tremendous start this season. \"We put a plan in place this summer for him and he out-beat the plan,\" Bickerstaff said. \"The work that he put in, the time that he put in, it was two-a-days, it was in the weight room, it was working with different people with different levels of experience. Then you saw him when we started to get together in September, when they were playing pick-up and you were just like, 'JD is different.'\"Duren is putting up a career-high 18.8 points per game, 11.5 rebounds and one block on 65.5% shooting from the field. He's one of just nine players in the league averaging a double-double -- one of five putting up at least 15/10 -- is the Pistons' second-leading scorer and leads the team in rebounds. While Duren has long been an imposing presence in the paint and a strong rebounder, he's now much more skilled on the offensive end, thanks in large part to extensive work with assistant coach Vitaly Potapenko. Everyone still loves the emphatic alley-oops, but it's no longer a surprise when he grabs a rebound and goes coast-to-coast or weaves around the defense in the halfcourt. \nBickerstaff also praised Duren's growth on defense, which he said has been the \"biggest step\" for the fourth-year big man. \"He's improved as a defensive rim protector and understanding when to be early to a spot and how to anticipate movement,\" Bickerstaff said. \"And that's helped keep him out of foul trouble also.\"In Duren's 613 minutes this season, the Pistons have a staggering plus-14.5 net rating. In the 504 minutes that Duren and Cunningham have played together, their net rating is slightly higher at plus-14.8. Duren, who did not come to an agreement on a rookie extension with the Pistons during the offseason, is going to earn himself a major payday next summer if he keeps this up. Coming up clutchSeventeen of the Pistons' 24 games have been \"clutch\" contests, which is defined as the score being within five points during the final five minutes. Only the Mavericks have played more clutch games than the Pistons, who have been excellent in close contests. The Pistons' 13 clutch wins lead the league, and their .765 winning percentage in clutch games trails only the Thunder and San Antonio Spurs among teams with at least 10 clutch games. In games decided by three points or fewer, they are 4-2, which is tied for the most such wins in the league. Cunningham had some uncharacteristic miscues in the Pistons' recent narrow defeats to the Boston Celtics and Orlando Magic, but he's been the driving force behind their late-game success.  \"I relish the moment for sure. I think it's the responsibility of it that I appreciate so much and try to make the most out of,\" Cunningham told reporters after sealing the team's win over the Atlanta Hawks on Nov. 18 with two clutch buckets in the final 90 seconds. \"My team trusts me with the ball, they want me to go make plays. So in moments like that, I feel like it's my opportunity or my job to go make a play.\"Cunningham's 79 clutch points are second only to Gilgeous-Alexander, and his 12 clutch assists are second only to the Hawks' Jalen Johnson. In 57 clutch minutes he's 24 of 45 (53.3%) from the field and 30 of 35 (85.7%) from the free throw line, and has only turned the ball over five times. \"It's like you feel safe, you feel good,\" Pistons forward Isaiah Stewart told The Athletic about trusting Cunningham. \"You know the ball is in the right person's hands with the game on the line. He's never afraid of the moment, and he believes his shot is going in every time.\"Continuing a defensive legacyDuring the preseason, Ausar Thompson told CBS Sports that he wants to continue the legacy set by the Bad Boys and the Goin' to Work Pistons, who used elite defense to bring championships to Detroit. \n\"The culture they built all those years back, I feel like it still stands. Not only for the Pistons but the city of Detroit,\" Thompson said. \"I feel like every team that comes from here, every successful team, is going to be built off that identity.\"Thompson has backed up his talk, and his effort sets the tone for the rest of the group. \"He's an absolute menace on the ball. I don't know that I've ever seen anything like that,\" Duncan Robinson told CBS Sports late last month. Thompson routinely picks up fullcourt, and is tasked with guarding the other team's best scorer, no matter if it's a small guard like Tyrese Maxey, a powerful wing like Jaylen Brown or a rangy power forward like Kevin Durant. Thompson is \"probably going to be the best defender in the league in less than two years,\" Duren said recently. \nWith Thompson lead the way, the Pistons have been one of the best defensive teams in the league. They're athletic, they're physical, they're relentless and they won't back down from a fight. In fact, they're often the ones looking for a confrontation. Here's a look at where they rank in some key defensive metrics. \nDefensive rating: 111.3 (4th)Opponent field goal percentage: 44.6% (2nd)Opponent turnover rate: 16.6% (3rd)Deflections per game: 20.4 (7th)Loose balls recovered per game: 6.5 (1st)Opponent restricted area field goal percentage: 61.7% (2nd)Since the turn of the century, only three teams have won the title while finishing outside of the top-10 in defensive rating: the 2023 Denver Nuggets, 2018 Golden State Warriors and 2001 Los Angeles Lakers, all of whom had generational offensive talents that could make up for defensive lapses. It's fair to have questions about the Pistons' offense given their reliance on Cunningham and poor spacing, but they have the defense necessary to win in the playoffs. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the Pistons made the NBA's most drastic turnaround: From record losing streak to first place in two years - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/47b05b52-4a5b-4c13-93b7-fe0d2c536da8/thumbnail/1200x675/201089bf028475c1d41702ab283f9f72/cade-cunningham-getty-5.png"
      ],
      "datePublished": "2025-12-12T15:47:12.000Z",
      "dateModified": "2025-12-12T15:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 15 NFL betting guide, expert picks, player props, DFS lineups, fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-15-nfl-betting-guide-player-props-spreads-parlay-dfs-fantasy-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/b589c48f-ac1d-4f16-bf86-188bc3f72913/thumbnail/1200x675/01726cdc7a6189686ca3cafe03e981d8/hunter-henry-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T15:30:34.000Z",
    "description": "\nThose experienced with making NFL picks know that monitoring the weather should be a part of an NFL betting guide. That's especially critical when wa",
    "body": "\nThose experienced with making NFL picks know that monitoring the weather should be a part of an NFL betting guide. That's especially critical when warm-weathered teams visit cold-climate destinations, and a couple of games you can make Week 15 NFL predictions on stand out in that regard. Raiders vs. Eagles (-11.5, 38.5) and Dolphins vs. Steelers (-3.5, 41.5) will see the two Pennsylvania teams hosting, with forecasts calling for freezing temps at the respective kickoffs. Given that, many may see these Week 15 NFL spreads as not being large enough in favor of Philly and Pittsburgh.Sub-optimal weather often affect player performance, which could have a bearing on Week 15 NFL player props, who you insert into Fantasy football lineups or an NFL DFS strategy. Can you count on the likes of Ashton Jeanty, Brock Bowers, Tua Tagovailoa or Jaylen Waddle this week? If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 15, SportsLine has you covered with its proven model, Machine Learning Model and team of experts.NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 15 that pays 25-1, and one of the legs is the Cowboys (-5.5, 47.5) covering against the Vikings on Sunday night. The model has Dallas covering in 60% of simulations in an A-rated pick, and the rest of the five-team parlay can be found here.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins, on picks like Dallas covering. Bet it at DraftKings right here:\nFantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 15 Fantasy football rankings that can be used to make start-sit decisions. The Commanders' Chris Rodriguez Jr. is projected to be a top-25 Fantasy running back this week, and the model also has full rankings for every position right here.NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the 49ers' Brock Purdy as one of its top value picks at quarterback, while the Giants' Theo Johnson is among the best values at tight end for Sunday's main slate. Here are its complete Week 15 NFL DFS rankings.Back Purdy to go Over 240.5 passing yards at DraftKings:\nSenior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Saints' Juwan Johnson as a top-10 Fantasy tight end this week. Get his full Week 15 Fantasy and DFS projections right here. Advanced NFL model simulates every game 10,000 times SportsLine's model is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 15 on a 50-35 run on top-rated picks dating back to 2024 and has revealed picks for every Week 15 NFL game. One of its favorite picks is the Saints (+2.5, 40.5) covering versus the Panthers, which cashes over 60% of the time in an A-rated pick. You can find the model's picks for every NFL Week 15 game here. NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Alex 'PropStarz' Selenick, who is 48-31 (+1104) over his last 79 NFL player props, is backing Patriots TE Hunter Henry Under 42.5 receiving yards (-117) versus Buffalo on Sunday.\"Hunter Henry has been a very reliable target for Drake Maye this season. With that being said, this is a fairly large number for Henry in what I consider a difficult matchup,\" stated Selesnick. \"The Bills defense hasn't performed well and has some major holes, however they cover the middle of field and opposing Tight Ends very well. Buffalo has surrendered the second fewest yards to the position.\" Selesnick's Week 15 NFL picks can be found here.Bet Henry to go Under 41.5 receiving yards at DraftKings:\nCowboys vs. Vikings 'Sunday Night Football' picksNFC squads clinging to outside chances at the playoffs meet on 'Sunday Night Football,' and the Cowboys are 5.5-point favorites in this one. They have won three out of four, but are coming off a 44-30 loss to the Lions in Week 14. Minnesota, meanwhile, snapped a four-game losing streak in Week 14 with a 31-0 win over Washington. SportsLine's R.J. White is on a 141-120 NFL run, returning nearly 19 units of profit. He's backing the Cowboys to cover in this one. \"J.J. McCarthy is coming off his best game of the season, but he also got to throw against air,\" White said. \"The Cowboys' defense has been better in recent weeks, including helping the team beat the Eagles and Chiefs in their last two at home. The Dallas offense also shines at home, where the Cowboys have just one game under 400 yards gained. The lookahead was 7.5 and that's probably a better number for this matchup with the Cowboys on extra rest.\" Get more 'Sunday Night Football' picks right here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 15 NFL betting guide, expert picks, player props, DFS lineups, fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/b589c48f-ac1d-4f16-bf86-188bc3f72913/thumbnail/1200x675/01726cdc7a6189686ca3cafe03e981d8/hunter-henry-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T15:30:34.000Z",
      "dateModified": "2025-12-12T15:30:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 15 Fantasy football rankings, sleepers, playoff lineup picks, start-sit advice from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-rankings-week-15-picks-projections-playoff-lineups-sleepers-streamers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/c74ad699-fc6c-4820-9069-50eec7db8503/thumbnail/1200x675/ae3ae5f214233a4ab09ea7c827238e33/tyler-warren-indianapolis-colts-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T14:40:37.000Z",
    "description": "\n        Byes are done with for the 2025 NFL season, which means you have a full complement of Week 15 Fantasy football picks to choose from as the Fa",
    "body": "\n        Byes are done with for the 2025 NFL season, which means you have a full complement of Week 15 Fantasy football picks to choose from as the Fantasy playoffs arrive in mayn leagues. There are, however, player injuries, which is a season-long thing to deal with when composing a Fantasy football strategy. Nonetheless, the likes of Stefon Diggs, TreVeyon Henderson, Jaxson Dart, Christian McCaffrey and Rico Dowdle are back in action after being on a bye. But who should start along side them in Week 15 Fantasy football lineups?Speaking of injuries, Daniel Jones (Achilles) was one of many casualties on Sunday, as those who have been riding him all season long at quarterback are likely seeking out some Week 15 Fantasy football advice. His absence has a ripple effect, and while Jonathan Taylor remains a must-start, where do the Fantasy football projections forecast for Colts pass catchers like Michael Pittman Jr., Alec Pierce and Tyler Warren with the Colts uncertain on their quarterbacks plans and even bringing Philip Rivers in as an option?Before making your Week 15 Fantasy football picks, be sure to check out the Week 15 Fantasy football rankings from the proven computer model at SportsLine. Bet on every NFL Week 15 game at DraftKings Sportsbook, where new users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 initial wager wins:When it comes to ranking players, SportsLine's model beat human experts in Fantasy football for the past several seasons, especially when there were big differences in ranking. Over the course of a season, that could literally be the difference between winning your league or going home empty-handed.The same model has a proven track record providing Fantasy football tips, including being ahead of the curve on players like A.J. Brown, Jonathan Taylor, Derrick Henry, Christian McCaffrey, Alvin Kamara and Jahmyr Gibbs. Anybody who banked on players like those could have made a run at their league title.Now, the model, which simulates every NFL game 10,000 times, has revealed its Fantasy football rankings for Week 15 of the 2025 NFL season. Head to SportsLine now to see them. New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. Top Week 15 Fantasy football picks One surprise in Week 15: The model is fading Colts tight end Tyler Warren, who is being started in around 65% of leagues, may not warrant a spot in Week 15 Fantasy football lineups. Warren is a by-product of Indy's passing game, which just lost Daniel Jones (Achilles) for the season, has Anthony Richardson on IR, and has third-strong rookie, Riley Leonard (knee) dealing with his own ailment, leading to the Rivers signing this week. Warren had season lows in both catches (2) and yards (15) on Sunday, with Leonard playing most of the game. Not much more is expected on Sunday versus Seattle, which has the No. 2 scoring defense and hasn't allowed a tight end touchdown since Week 11. Warren sits outside the top 15 in Fantasy football TE rankings.Another curveball: The model is high on Commanders running back Chris Rodriguez Jr., despite him being the RB50 in standard leagues and being started in just 35% of leagues this week. Rodriguez has leapfrogged Jacory Croskey-Merritt on the depth chart, as the former has more touches each of the last three weeks. He hasn't disappointed with more opportunities as Rodriguez has at least 52 scrimmage yards or a touchdown in five straight games. With the Giants' league-worst run defense on tap, as New York allows the most yards per carry and the second-most rushing yards per game, Rodriguez should find his way into your Week 15 Fantasy football lineups. For more start/sit Fantasy football advice, be sure to check out the rest of the Week 15 Fantasy football rankings.New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2  in select states.How to set Week 15 Fantasy football rankingsThe model is also calling for a surprising running back you aren't even thinking about to finish in the top 20 of its Week 15 Fantasy football rankings, even slotted ahead the likes of Breece Hall and Ashton Jeanty. This pick could be the difference between winning big and going home with nothing. See the model's entire Week 15 Fantasy football rankings for PPR and standard leagues here.So who should you start and sit this week, and which surprising running back could lead you to victory? Visit SportsLine now to get Week 15 Fantasy football rankings for every position, plus see which running back is going to come out of nowhere to crack the top 20 all from the model that has outperformed experts big-time.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 15 Fantasy football rankings, sleepers, playoff lineup picks, start-sit advice from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/c74ad699-fc6c-4820-9069-50eec7db8503/thumbnail/1200x675/ae3ae5f214233a4ab09ea7c827238e33/tyler-warren-indianapolis-colts-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T14:40:37.000Z",
      "dateModified": "2025-12-12T14:40:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets: This Week 15 parlay returns nearly 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-15-nfl-picks-predictions-football-parlay-best-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/fe5b82a5-4c70-4b8d-a537-67f29e8eb719/thumbnail/1200x675/b1e53f6ec6fb13ebf87a8247ff8aae9b/dak-prescott-dallas-cowboys-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T15:03:57.000Z",
    "description": "\nThe NFL Week 15 schedule is full of playoff implications. Among them is the AFC West matchup between Justin Herbert and the Los Angeles Chargers vs. ",
    "body": "\nThe NFL Week 15 schedule is full of playoff implications. Among them is the AFC West matchup between Justin Herbert and the Los Angeles Chargers vs. Patrick Mahomes and the Kansas City Chiefs. Los Angeles is in the thick of the AFC West race, while the Chiefs need a strong finish and a lot of help to reach the postseason for an 11th consecutive year. Kansas City is a 5.5-point favorite and is 4-6 against the spread in its last 10 games, while Los Angeles is 3-6-1 ATS in their last 10 and coming off a short week and an overtime game no less. The Chargers won the last meeting, 27-21, in Brazil on Sept. 5.  There are a number of other intriguing matchups on the Week 15 NFL schedule, including Bills (-1.5) vs. Patriots, Ravens (-2.5) vs. Bengals, Packers (-2.5) vs. Broncos, Lions vs. Rams (-6) and Colts vs. Seahawks (-13.5) as Indianapolis could potentially turn to 44-year-old Philip Rivers at quarterback. Before locking in any Week 15 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 15 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of nearly 25-1. You can only see the model's Week 15 NFL picks at SportsLine.Top Week 15 NFL picksAfter simulating every game 10,000 times, the model is high on the Dallas Cowboys (-5.5, 47.5) to cover against the Minnesota Vikings on 'Sunday Night Football.'\nThe Cowboys are led by quarterback Dak Prescott. In 13 games this season, he has completed 69% of his passes for 3,637 yards and 26 touchdowns with 10 interceptions and a 100.2 rating. He has also rushed 44 times for 138 yards (3.1 average) and two touchdowns. In a 44-30 loss at Detroit in Week 14, he completed 31 of 47 passes for 376 yards and one touchdown with two interceptions.Bet Prescott to go Over 37.5 yards for longest completion using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nThe model has Dallas winning outright over 70% of the time and covering in nearly 60% of simulations in an A-rated spread pick. See which other NFL parlay picks to make here, and new users can bet the Cowboys to cover using the DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nHow to make Week 15 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 15 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 15 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 15 NFL best bets from a model on a 50-35 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets: This Week 15 parlay returns nearly 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/fe5b82a5-4c70-4b8d-a537-67f29e8eb719/thumbnail/1200x675/b1e53f6ec6fb13ebf87a8247ff8aae9b/dak-prescott-dallas-cowboys-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T15:03:57.000Z",
      "dateModified": "2025-12-12T15:03:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Carolina State vs. Prairie View A&M prediction, odds: 2025 Celebration Bowl picks from top expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/south-carolina-state-prairie-view-a-m-prediction-odds-2025-celebration-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/5a830769-2793-4275-ae35-6a1b615e419f/thumbnail/1200x675/9914212f34ff94a49c80b8e9b65e3994/andre-dennis-prairie-view-a-m-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T10:47:57.000Z",
    "description": "\n        College football bowl season kicks off on Saturday with the 2025 Celebration Bowl featuring the Prairie View A&M Panthers and South Carolina ",
    "body": "\n        College football bowl season kicks off on Saturday with the 2025 Celebration Bowl featuring the Prairie View A&M Panthers and South Carolina State Bulldogs. This is the lone bowl game featuring FCS teams, with Prairie View representing the SWAC, and South Carolina State playing in the MEAC. Prairie View A&M is 10-3, riding a four-game winning streak and defeated Jackson State, 23-21, last week. SC State is on a seven-game win streak but hasn't taken the field in a while, as it defeated Delaware State, 28-17, in its last game on Nov. 22. This 2025 Celebration Bowl is PVAMU's first-ever appearance in this bowl, while SC State has split its two previous appearances.Kickoff is at noon ET from the Mercedes-Benz Stadium in Atlanta. The MEAC is 6-3, all-time, in the Celebration Bowl. The latest South Carolina State vs. Prairie View A&M odds have the Bulldogs favored by 1.5 points, while the over/under is 52.5. Before making any Prairie View A&M vs. South Carolina State picks, check out the college football predictions from SportsLine expert Emory Hunt. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:Hunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007. He is a former running back for the Louisiana Ragin' Cajuns and knows the game from a player's perspective. Hunt's dedication to analysis of all levels of college and professional football helped go 224-198 (+605) on all college football picks over the past two years. Anyone who has followed him could be way up.Now, Hunt has set its sights on Prairie View A&M vs. South Carolina State. You can visit SportsLine now to see the picks. Here are the college football odds and betting trends for South Carolina State vs. Prairie View A&M:Prairie View A&M vs. South Carolina State spreadSouth Carolina State -1.5 Prairie View A&M vs. South Carolina State over/under52.5 pointsPrairie View A&M vs. South Carolina State money line SC State -124, PVAMU +103Prairie View A&M vs. South Carolina State picksSee picks at SportsLinePrairie View A&M vs. South Carolina State streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make South Carolina State vs. Prairie View A&M picksHunt is leaning Under on the total (51.5 points). In SC State's two previous appearances in this bowl, its games, respectively, had 41 total points and 35 total points. Also, the Bulldogs' last game versus Delaware State, which decided the MEAC champion, saw just 45 total points on the scoreboard.Meanwhile, Prairie View A&M has played five games versus teams this year that currently have winning records, before taking on the 9-3 Bulldogs. Four of those five have seen 48 or fewer points scored as grind-it-out affairs typically arise when the Panthers are matched with teams on par with them. Given the trends, Hunt likes the Under.Hunt has also identified a critical X-factor that has him jumping all over one side of the spread. You can see his pick at SportsLine.  So who wins Prairie View A&M vs. South Carolina State, and what critical X-factor has Hunt jumping on one side of the spread? Visit SportsLine now to see which side of the South Carolina State vs. Prairie View A&M spread to jump on, all from the expert that has returned +605 on picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Carolina State vs. Prairie View A&M prediction, odds: 2025 Celebration Bowl picks from top expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/5a830769-2793-4275-ae35-6a1b615e419f/thumbnail/1200x675/9914212f34ff94a49c80b8e9b65e3994/andre-dennis-prairie-view-a-m-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T10:47:57.000Z",
      "dateModified": "2025-12-12T10:47:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL odds for Week 15, betting lines, spreads: Picks, predictions, best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-15-nfl-odds-lines-spreads-best-bets-predictions-picks-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/ed797b35-35fa-43f6-b668-8178fa083d0a/thumbnail/1200x675/cfeb6257c5675fdaf88dc1901da23253/chris-olave-new-orleans-saints-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T14:53:40.000Z",
    "description": "\nIf ever a day deserved to be called Statement Sunday, it's the one that takes place during the Week 15 NFL schedule. There are no fewer than five mat",
    "body": "\nIf ever a day deserved to be called Statement Sunday, it's the one that takes place during the Week 15 NFL schedule. There are no fewer than five matchups to make Week 15 NFL predictions on with major playoff implications for both teams. This includes divisional contests like Chiefs vs. Chargers (+5.5) and Patriots vs. Bills (-1.5). Additionally, there are captivating non-divisional games to make NFL best bets on such as Packers vs. Broncos (+2.5) and Lions vs. Rams (-6).While those games all have close NFL spreads, there are some wider ones featuring playoff contenders versus teams contending for high positions in the NFL Draft. The Week 15 NFL odds have the Eagles favored by 11.5 points over the Raiders, while the Jaguars are 13.5-point favorites against the Jets. All of the updated Week 15 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 15 NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 15 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Week 15 NFL predictionsWe can tell you one of the model's strongest Week 15 NFL picks is that the Saints (+2.5, 40.5) cover versus Carolina in a Sunday 4:25 p.m. ET kickoff in well over 60% of simulations. The Saints pulled off a road upset victory on Sunday over Tampa, covering for the second straight and for the third time in the last four games. QB Tyler Shough is providing a running element that Spencer Rattler didn't, as the rookie had 55 yards and two scores on the ground versus the Bucs. Bet the Saints to go Over 9.5 first-half points at DraftKings:\nNew Orleans also has an underrated pass defense, ranking sixth in the NFL, while Carolina already struggles on offense. The Panthers are in the bottom 10 in points scored, total yards and red-zone scoring, and they have just one victory, as well as one cover, over their last five versus the Saints. The model also has the Over hitting in over 60% of simulations in an A-rated pick. See which other teams to pick here, and bet the Saints to cover at DraftKings right here:\nAnother one of its Week 15 NFL predictions: the Giants (-2.5, 46.5) cover versus the Commanders in a Sunday kickoff at 1 p.m. ET. Jayden Daniels re-injured his elbow in Sunday's shocking 31-0 loss to Minnesota, leaving the game in the third quarter and not returning. While his availability is unknown to face the Giants, Zach Ertz (ACL) is now done for the year. That's a big blow to a passing offense which is already a bottom-10 unit, while Washington ranks in the bottom-five in points allowed, yards allowed, run defense and pass defense. Both Washington (eight) and New York (seven) are on lengthy losing streaks, but the Giants have a 4-3 spread record during their streak, while the Commanders are just 1-7 ATS on theirs. New York is projected to cover in over 50% of simulations. See which other teams to pick here, and bet the Giants to cover at DraftKings:\nHow to make Week 15 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 15 NFL schedule and just revealed three underdogs projected to outright win, potentially giving you a huge payday. You can only get every pick for every game at SportsLine.So what Week 15 NFL picks can you make with confidence, and which three underdogs should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 15 NFL betting odds, lines, live spreads, scoresGet Week 15 NFL picks at SportsLineGameSpreadTotalPicksFalcons at Buccaneers (Thursday)F: Falcons 29, Bucs 28Browns at BearsCHI -7.538.5SEE  PICKS HERERavens at BengalsBAL -2.551.5SEE  PICKS HERECardinals at TexansHOU -9.542.5SEE  PICKS HEREJets at JaguarsJAX -13.541.5SEE  PICKS HEREChargers at ChiefsKC -5.541.5SEE  PICKS HEREBills at PatriotsBUF -1.549.5SEE  PICKS HERECommanders at GiantsNYG -2.546.5SEE  PICKS HERERaiders at EaglesPHI -11.538.5SEE  PICKS HEREPackers at BroncosGB -2.540.5SEE  PICKS HERELions at RamsLAR -654.5SEE  PICKS HEREPanthers at SaintsCAR -2.540.5SEE  PICKS HERETitans at 49ersSF -12.544.5SEE  PICKS HEREColts at SeahawksSEA -13.542.5SEE  PICKS HEREVikings at CowboysDAL -5.547.5SEE  PICKS HEREDolphins at Steelers (Monday)PIT -341.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL odds for Week 15, betting lines, spreads: Picks, predictions, best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/ed797b35-35fa-43f6-b668-8178fa083d0a/thumbnail/1200x675/cfeb6257c5675fdaf88dc1901da23253/chris-olave-new-orleans-saints-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T14:53:40.000Z",
      "dateModified": "2025-12-12T14:53:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025-26 college football bowl confidence picks: Rankings from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-confidence-pool-picks-playoff-predictions-rankings-projections/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/cb6d9552-c324-4685-bbdf-abb72033fbcb/thumbnail/1200x675/43d65b69401a18a06ce33009691eb1d2/conner-weigman-houston-cougars-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-12T14:59:03.000Z",
    "description": "\n        The 2025-26 college football bowl schedule begins on Saturday with Boise State vs. Washington (-9.5). Even with the postseason landscape rapi",
    "body": "\n        The 2025-26 college football bowl schedule begins on Saturday with Boise State vs. Washington (-9.5). Even with the postseason landscape rapidly changing, college football bowl confidence pools remain popular, and there are 39 matchups to make college football bowl confidence picks on this season. The two biggest spreads are in the CFP First Round as Oregon is favored by 21.5 points over James Madison, while Ole Miss is a 17.5-point favorite over Tulane. While putting faith in big favorites is a part of just about everyone's college football bowl confidence strategy, correctly predicting an upset could help you separate from the pack.Anticipated matchups outside of the CFP include Penn State vs. Clemson (-3.5), Georgia Tech vs. BYU (-4.5), Tennessee vs. Illinois (+4.5) and Michigan vs. Texas (-7.5). The Wolverines will operate under interim head coach Biff Poggi after dismissing Sherrone Moore. The college football odds give you an idea of what sportsbooks deem as favorites and underdogs, but you'll need more than just those when making bowl confidence bets. Before making any college football predictions for bowl season, be sure to see the latest college football bowl confidence picks from SportsLine's proven model.New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season.  Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting for confidence pools. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top 2025-26 college football bowl confidence picks  One of the model's most confident picks is that No. 21 Houston, a 3.5-point favorite, gets a double-digit win over LSU in the Texas Bowl on Dec. 27. Not only is this game in Texas, but it's in Houston, providing the obvious home-field advantage for the Cougars, as LSU has lost its last four games outside of Tiger Stadium. Meanwhile, the Cougars are 5-1 straight-up when favored this season, and the Tigers' offense limps into this matchup as it has a total of four touchdowns over the last four games and won't have quarterback Garrett Nussmeier. That's the same number that Houston had in its last game, alone, as the model has the Cougars winning in 80% of simulations. See all of the model's college football bowl confidence picks here.Another one of the bowl confidence predictions the model is high on: No. 16 USC (-5.5) gets a comfortable win over TCU in the Alamo Bowl on Dec. 30. USC went 9-3 in the regular season, with all three defeats coming versus ranked teams. TCU found itself in the Top 25 once -- back in September -- before having a pedestrian run through the Big 12 schedule, finishing 5-4. Even with the Horned Frogs playing in the easier conference than the Trojans, USC both averaged more points and allowed fewer points per game. USC sports a 32-9 (78%) straight-up record when favored since Lincoln Riley came aboard in 2022, as it is projected to easily take care of business in San Antonio. SportsLine's model has the Trojans prevailing nearly 70% of the time. See the rest of the college football bowl confidence predictions here. How to make college football bowl confidence picksThe model has also made the call on who wins every other bowl game. There are 11 teams that win at least 70% of the time, so you need to go big on those matchups, as well as 15 underdogs that win outright. You can get all the model's picks at SportsLine.So who wins every college football bowl game, and which matchups should you assign the most confidence points to? Check out the college football bowl schedule below, then visit SportsLine to see which teams to pick, all from a proven computer model that has simulated each bowl game 10,000 times, and find out.College football bowl schedule See every college football bowl game pick hereSaturday, Dec. 13 LA Bowl: Boise State vs. Washington, 8 p.m. ET  Tuesday, Dec. 16 Veterans Bowl: Troy vs. Jacksonville State, 9 p.m. ET  Wednesday, Dec. 17 Cure Bowl: Old Dominion vs. South Florida, 5 p.m. ET 68 Ventures Bowl: Louisiana vs. Delaware, 8:30 p.m. ET  Thursday, Dec. 18 Xbox Bowl: Missouri State vs. Arkansas State, 9 p.m. ET  Friday, Dec. 19 Myrtle Beach Bowl: Kennesaw State vs. Western Michigan, 11 a.m. ET Gasparilla Bowl: Memphis vs. NC State, 2:30 p.m. ET CFP First Round: Alabama at Oklahoma, 8 p.m. ET  Saturday, Dec. 20 CFP First Round: Miami at Texas A&M, noon ET CFP First Round: Tulane at Ole Miss, 3:30 p.m. ET CFP First Round: James Madison at Oregon, 7:30 p.m. ET  Monday, Dec. 22 Potato Bowl: Washington State vs. Utah State, 2 p.m. ET  Tuesday, Dec. 23 Boca Raton Bowl: Toledo vs. Louisville, 2 p.m. ET New Orleans Bowl: Western Kentucky vs. Southern Miss, 5:30 p.m. ET Frisco Bowl: UNLV vs. Ohio, 9 p.m. ET  Wednesday, Dec. 24 Hawaii Bowl: Cal vs. Hawaii, 8 p.m. ET  Friday, Dec. 26 GameAbove Sports Bowl: Central Michigan vs. Northwestern, 1 p.m. ET Rate Bowl: New Mexico vs. Minnesota, 4:30 p.m. ET First Responder Bowl: FIU vs. UTSA, 8 p.m. ET  Saturday, Dec. 27 Military Bowl: Pitt vs. East Carolina, 11 a.m. ET Pinstripe Bowl: Penn State vs. Clemson, noon ET Fenway Bowl: UConn vs. Army, 2:15 p.m. ET Pop-Tarts Bowl: Georgia Tech vs. BYU, 3:30 p.m. ET Arizona Bowl: Miami (OH) vs. Fresno State, 4:30 p.m. ET New Mexico Bowl: North Texas vs. San Diego State, 5:45 p.m. ET Gator Bowl: Virginia vs. Missouri, 7:30 p.m. ET Texas Bowl: LSU vs. Houston, 9:15 p.m. ET  Monday, Dec. 29 Birmingham Bowl: Georgia Southern vs. App. State, 2 p.m. ET  Tuesday, Dec. 30 Independence Bowl: Coastal Carolina vs. Louisiana Tech, 2 p.m. ET Music City Bowl: Tennessee vs. Illinois, 5:30 p.m. ET Alamo Bowl: USC vs. TCU, 9 p.m. ET  Wednesday, Dec. 31 ReliaQuest Bowl: Iowa vs. Vanderbilt, noon ET Sun Bowl: Arizona State vs. Duke, 2 p.m. ET Citrus Bowl: Michigan vs. Texas, 3 p.m. ET Las Vegas Bowl: Nebraska vs. Utah, 3:30 p.m. ET  Friday, Jan. 2 Armed Forces Bowl: Rice vs. Texas State, 1 p.m. ET Liberty Bowl: Navy vs. Cincinnati, 4:30 p.m. ET Holiday Bowl: Arizona vs. SMU, 8 p.m. ET Duke's Mayo Bowl: Wake Forest vs. Mississippi State, 8 p.m. ET\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025-26 college football bowl confidence picks: Rankings from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/cb6d9552-c324-4685-bbdf-abb72033fbcb/thumbnail/1200x675/43d65b69401a18a06ce33009691eb1d2/conner-weigman-houston-cougars-imagn-images.jpg"
      ],
      "datePublished": "2025-12-12T14:59:03.000Z",
      "dateModified": "2025-12-12T14:59:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 college football bowl game odds, picks, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-playoff-odds-lines-picks-predictions-spreads-best-bets-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/18/fd173ef0-635c-4f00-a273-e40c8e6c6728/thumbnail/1200x675/8dc5c3282c1c6b45c18bd8d84d742539/ahmad-hardy-missouri-tigers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-12T13:16:03.000Z",
    "description": "\n        A season which began in late August is reaching its conclusion, with that being the 2025-26 college football bowl schedule. There are 46 FBS ",
    "body": "\n        A season which began in late August is reaching its conclusion, with that being the 2025-26 college football bowl schedule. There are 46 FBS bowl games, so there are no shortage of opportunities to make college football bowl bets. The LA Bowl kicks things off on Saturday with Washington vs. Boise State (+10), with the first round of the College Football Playoff starting on Dec. 19. The opener is a matchup of Blue Bloods as Alabama is a 1.5-point road favorite over Oklahoma per the latest college football bowl odds.  That's one of a handful of games with a college football spread of 3 points or fewer. Others include Missouri State vs. Arkansas State (-1.5), Washington State vs. Utah State (-2.5) and Arizona State vs. Duke (-1.5). The largest of the college football bowl spreads comes in the CFP, with Oregon favored by 21.5 points versus James Madison. Other games of interest include powerhouse programs facing off, such as Penn State vs. Clemson (-4.5) in the Pinstripe Bowl and Michigan vs. Texas (-7.5) in the Citrus Bowl as the Wolverines will be led by interim Biff Poggi after the firing of Sherrone Moore.Before locking in any college football bowl picks, be sure to see the latest bowl and playoff college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for bowl seasonOne of the college football picks the model is high on during the 2025-26 college football bowl schedule: Penn State (+4.5, 48.5) covers against Clemson in the Pinstripe Bowl on Saturday, Dec. 27 at noon ET. Both schools vastly underperformed this year but had strong finishes, with each finishing the season 3-1 ATS. However, Dabo Swinney has lost four of his last six bowl games, with each defeat coming by at least 14 points. This year, his Tigers are averaging 28.7 points, which ranks 61st in the nation, while Penn State, despite playing in the much tougher Big Ten, ranks 37th nationally in scoring. Also, the location of this game in New York City favors a northeastern university like Penn State over Clemson from South Carolina. The Nittany Lions cover almost 60% of the time, while the model also says the Under hits in almost 60% of simulations. See which other picks the model likes here.\nAnother prediction: Missouri (-6.5, 48.5) covers versus No. 20 Virginia in the Gator Bowl on Dec. 27 in well over 50% of simulations. UVA is coming off an ACC Title Game loss to Duke, in which the Cavaliers would have made the CFP if they had won. Thus, you have to wonder about motivation now that they have to settle for a lesser bowl game, and Virginia has struggled in bowls to begin with, going 1-4 over the last 19 years. Mizzou has won back-to-back bowls under Eli Drinkwitz, and the Tigers' only losses this season came versus teams ranked in the top 10 of the AP Poll at the time. Missouri is 4-1 ATS at neutral sites since Drinkwitz took over in 2020, and the Tigers are 12-4 ATS as favorites since the start of last season. See the rest of the model's picks here.\nHow to make college football picks for bowl seasonThe model has also made the call on who wins and covers in every 2025-26 college football bowl game, and it's calling for five underdogs to outright win in bowl matchups of power conference teams. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which five underdogs are projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.2025-26 college football bowl odds (through 12/24)See full college football bowl picks, odds, predictions here(odds subject to change)Saturday, Dec. 13LA Bowl: Boise State vs. Washington (-10, 52.5)Tuesday, Dec. 16Veterans Bowl: Troy vs. Jacksonville State (+2.5, 46.5)Wednesday, Dec. 17Cure Bowl: Old Dominion vs. South Florida (-3.5, 53.5)68 Ventures Bowl: Louisiana vs. Delaware (+3, 59.5)Thursday, Dec. 18Xbox Bowl: Missouri State vs. Arkansas State (-1.5, 56.5)Friday, Dec. 19Myrtle Beach Bowl: Kennesaw State vs. Western Michigan (-4, 49.5)Gasparilla Bowl: Memphis vs. NC State (-5.5, 58.5)CFP First Round: Alabama at Oklahoma (+1.5, 40.5)Saturday, Dec. 20CFP First Round: Miami at Texas A&M (-3.5, 51.5)CFP First Round: Tulane at Ole Miss (-17.5, 56.5)CFP First Round: James Madison at Oregon (-21.5, 50.5)Monday, Dec. 22Potato Bowl: Washington State vs. Utah State (2.5, 52.5)Tuesday, Dec. 23Boca Raton Bowl: Toledo vs. Louisville (-8.5, 44.5)New Orleans Bowl: Western Kentucky vs. Southern Miss (+4, 55.5)Frisco Bowl: UNLV vs. Ohio (+4.5, 62.5)Wednesday, Dec. 24Hawaii Bowl: Cal vs. Hawaii (+1.5, 54.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 college football bowl game odds, picks, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/18/fd173ef0-635c-4f00-a273-e40c8e6c6728/thumbnail/1200x675/8dc5c3282c1c6b45c18bd8d84d742539/ahmad-hardy-missouri-tigers-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-12T13:16:03.000Z",
      "dateModified": "2025-12-12T13:16:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From Fernando Mendoza to Texas Tech's d-line: The top 25 transfers in the CFP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/fernando-mendoza-texas-techs-d-line-top-transfers-college-football-playoff/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/ece5c68b-2d11-4a7e-a624-013c225c9601/thumbnail/1200x675/6bd58a7ed8b98568a9f8ef391c865208/gettyimages-2249856658.jpg",
    "tag": "Sports",
    "date": "2025-12-12T15:29:25.000Z",
    "description": "\n        The College Football Playoff is just a week away, and many of the players primed to star in December and January are former transfers. That's",
    "body": "\n        The College Football Playoff is just a week away, and many of the players primed to star in December and January are former transfers. That's the reality of college football in 2025 where thousands of players change teams each offseason and many of the signature players of the sport are on their second (or third) school.So, who are the best transfers in the playoff field? Let's run through them, starting with a potential Heisman winner: No. 1 | Fernando Mendoza | QB, Indiana Former School: CalThe catalyst of the first No. 1 Indiana team in history, Mendoza's thrust himself into the conversation for the Heisman and to be the first pick in the 2026 NFL Draft. He's thrown for 2,980 yards and 33 touchdowns while completing 71.5% of his passes for the 13-0 Hoosiers.No. 2 | David Bailey | Edge, Texas Tech Former School: StanfordTexas Tech paid big -- $2 million plus -- to lure Bailey to Lubbock. It's been worth the investment. He's posted a Big 12-high 17.5 TFLs and 13.5 sacks. His 74 pressures are the most in college football and 13 more than the next-closest Power Four player.\nNo. 3 | Caleb Downs | S, Ohio State Former School: AlabamaDowns has been in the conversation for best safety in college football since his freshman season at Alabama, and he remains one of the elite players of the sport. He's posted 60 tackles, five TFLs and two interceptions this season for an Ohio State defense that allows the fewest passing yards per game in the FBS. No. 4 | Dante Moore | QB, Oregon Former School: UCLAA smooth passer with pinpoint accuracy, Moore's been excellent for the Ducks this year. He's thrown for 2,733 yards and 24 touchdowns with a 72.5 CMP%. Despite a rash of wide receiver injuries, Oregon ranks in the top 10 nationally in terms of yards per play and points per game.No. 5 | Cashius Howell | Edge, Texas A&M Former School: Bowling GreenFrom Bowling Green to College Station, Howell's emerged as one of college football's premier edge rushers. He ranks fourth nationally with 11.5 sacks to go along with 14 tackles for loss. He's the biggest reason the Aggies rank 12th nationally in pressure rate.\nNo. 6 | Trinidad Chambliss | QB, Ole Miss Former School: Ferris StateChambliss isn't a stranger to a playoff setting. He led Ferris State to a Division II national title last season. He was the best player on the field then. He's still arguably the best player now despite the leap to the Power Four. He's thrown for 3,016 yards and 18 touchdowns this year while completing 65.5% of his passes. He's also run for 470 yards and six scores. Making the switch from Austin Simmons to Chambliss changed Ole Miss' season.\nNo. 7 | Romello Height | Edge, Texas Tech Former School: Georgia TechThe other half of college football's premier edge rush tandem -- with apologies to an excellent one in Coral Gables -- Height finished this season with 33 tackles, 10.5 TFLs and nine sacks. He'd be the most skilled pass rusher on almost any team. It's just that he plays opposite Bailey.No. 8 | Emmanuel Pregnon | OG, Oregon Former School(s): Wyoming, USCPregnon is a two-time transfer. He began his career at Wyoming, transferred to USC and found his way to Oregon this season. In Eugene he's emerged as one of the best interior linemen in the sport. Pregnon did not allow a sack this season and paced the nation's No. 5 run offense in terms of yards per play.\nNo. 9 | KC Concepcion | WR, Texas A&M Former School: NC StateConcepcion, a weapon Texas A&M moves around frequently from the outside to the slot, consistently creates chunk yardage. He has 40 catches of 10-plus yards this season, ranking eighth nationally, and is averaging 15.5 yards per catch despite a high target volume. He's also the best punt returner in the playoff field with two return touchdowns this season.No. 10 | Akheem Mesidor | Edge, Miami Former School: West VirginiaA burley edge at 6-foot-3, 280 pounds, Mesidor is perhaps the playoff's best edge setter. He's an elite run defender (90.7 PFF run grade) but also creates plenty of backfield havoc with 44 pressures this season to go along with 12 tackles for loss and seven sacks.No. 11 | Kewan Lacy | RB, Ole Miss Former School: MissouriThe SEC's leader in rushing touchdowns with 20, Lacy does so much on his own as a runner. He leads the Power Four with 86 forced missed tackles in just 12 games and has 858 yards after contact among his 1,279-yard rushing total.\nNo. 12 | Lee Hunter | DT, Texas Tech Former School: UCFYep, another Texas Tech defensive lineman. Hunter is a big 'ol space eater in the middle of Texas Tech's defense at 6-foot-4, 330 pounds. His ability to eat up double teams and collapse the interior allows Bailey, Height and his fellow DT AJ Holmes to pressure the pocket with devastating consistency.  Texas Tech allows a FBS-low 68 rushing yards per game.No. 13 | Dillon Thieneman | S, Oregon Former School: PurdueThere isn't much room to throw against Oregon on the second and third level because Thieneman is a space eraser at safety. The former 247Sports True Freshman of the year finished this season with 67 tackles, 1.5 TFL and two interceptions. He rarely misses a tackle in the open field and is one of the elite coverage safeties in the sport. No. 14 | Isaiah World | OT, Oregon Former School: NevadaThere aren't many college football players who look like World, a 6-foot-8, 318-pound anchor on the left side of Oregon's offensive line. He's a future early round draft pick and has surrendered just one QB hit in 685 snaps this season. World is also a big part of a top five Oregon rushing attack.\nNo. 15 | Aiden Fisher | LB, Indiana Former School: James MadisonA havoc creator in the middle of Indiana's defense, Fisher is an instinctual, sure tackler and a major reason the Hoosiers have been so strong against the run. He has posted 77 tackles, seven TFLs, 2.5 sacks and two interceptions this season.No. 16 | Jakobe Thomas | S, MiamiFormer School(s): Middle Tennessee/TennesseeA transformational presence on the backend of Miami's defense, Thomas has helped Miami's secondary go from a bust-ridden unit in 2024 to one of college football's best this season. He's posted 49 tackles, 3.5 TFLs, three sacks and four interceptions on the season as a do-it-all-presence for a top 10 Miami defense.No. 17 | Mario Craver | WR, Texas A&M Former School: Mississippi StateThe other half of A&M's superstar wide receiver transfer duo, Craver posted 52 catches for 825 yards and four touchdowns on the season. His production has waned some in recent weeks -- he hasn't cleared the 70-yard barrier since mid-October -- but he's a big play waiting to happen, and his early-season production is a huge reason A&M reached the playoff.\nNo. 18 | Zachariah Branch | WR, Georgia Former School: USCInstant offense for the Bulldogs, the 5-foot-10, 180-pound Branch is one of the fastest players in college football. Georgia tends to throw it to him short with an average depth of target of just 3.3 yards, and Branch tends to make things happen from there. He averages eight yards after the catch and has 744 yards and five touchdowns total on the season.\nNo. 19 | Carson Beck | QB, Miami Former School: GeorgiaBeck's been a very productive player with 3,072 yards passing, 25 touchdowns against 10 interceptions and a 74.7% completion rate. He ranks 11th in ESPN's QBR metric. If Beck can avoid turnovers in the playoff -- he again ranks near the bottom of the FBS in interceptions thrown with 10 -- Miami's got a chance.No. 20 | Germie Bernard | WR, Alabama Former School(s): Michigan State, WashingtonRyan Williams gets all the attention, but Bernard is Alabama's leader in catches and yardage. The former Washington transfer lines up a little bit of everywhere for the Tide. He almost always comes through. He's only dropped one pass this season. He's run for 101 yards and two scores. He's even completed both his passing attempts.  \nNo. 21 | Davison Igbinosun | CB, Ohio State Former School: Ole MissA lockdown corner on the outside for the Buckeyes, the 6-foot-2, 195-pound former Ole Miss transfer has had the best year of his career. He's posted 45 tackles, two interceptions, eight pass breakups and is holding opposing receivers to a 41.9% catch rate for a top 10 Buckeyes pass defense.No. 22 | Isaiah Sategna | WR, Oklahoma Former School: ArkansasSategna has emerged as John Mateer's go-to playmaker this season since transferring in from Arkansas. He's caught 65 passes for 948 yards and seven scores. He was a 10.8-second 100-meter runner coming out of high school and it shows. He ranks fourth nationally in receptions of at least 70 yards. No. 23 | D'Angelo Ponds | CB, Indiana Former School: James MadisonThere aren't many 5-foot-9, 173-pound corners you'd feel comfortable leaving on an island with any consistency in the Big Ten -- Ponds is an exception. Other than a rough night against Jeremiah Smith in the Big Ten championship game (join the club), Ponds has been exceptional this season holding opposing receivers to a 43.6% catch rate.\nNo. 24 | Jake Retzlaff | QB, Tulane Former School: BYURetzlaff is a gamer who finds ways to make plays when it matters. He's thrown for 2,862 yards and 14 touchdowns this season to go along with 610 yards rushing and 16 scores on the ground. If the Green Wave don't suddenly pick up Retzlaff during the summer, they aren't in the CFP.No. 25 | Xavier Holmes | Edge, James Madison Former School: MaineOne half of an excellent edge duo for the Dukes, Holmes has posted 29 tackles, 7.5 TFLs and six sacks this season. He's a huge part of what is the nation's second-best run defense, and he's also the leading pressure creator for JMU.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From Fernando Mendoza to Texas Tech's d-line: The top 25 transfers in the CFP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/ece5c68b-2d11-4a7e-a624-013c225c9601/thumbnail/1200x675/6bd58a7ed8b98568a9f8ef391c865208/gettyimages-2249856658.jpg"
      ],
      "datePublished": "2025-12-12T15:29:25.000Z",
      "dateModified": "2025-12-12T15:29:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baseball Hall of Fame: Andruw Jones running out of time; will his defense carry him? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/andruw-jones-hall-of-fame-ballot-voting/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/0dfd6471-2af7-4a28-ac22-a1f225bd07a0/thumbnail/1200x675/bc4f7dbfc6c73646a0dc71076c8fa753/jones-getty.png",
    "tag": "Sports",
    "date": "2025-12-12T14:40:00.000Z",
    "description": "\n        In my ongoing series of profiling candidates for the 2026 Baseball Hall of Fame class, I already noted that this cycle might be the best chan",
    "body": "\n        In my ongoing series of profiling candidates for the 2026 Baseball Hall of Fame class, I already noted that this cycle might be the best chance for Carlos Beltrán to make it into the Hall. Fellow center fielder Andruw Jones might be in a similar situation, only there's much more urgency to Jones' case. This is Jones' ninth year on the ballot out of a maximum of 10 tries. Between the 2019 and 2023 ballots, Jones' vote percentage skyrocketed upward, but the gains the last two years were more modest and might be concerning for Jones advocates. Here's a look at the nine years and his percentages of the vote, in order, keeping in mind he needs 75% to get in: 2018: 7.3%2019: 7.5%2020: 19.4%2021: 33.9%2022: 41.4%2023: 58.1%2024: 61.6%2025: 66.2%If Jones adds 4.6 points in each of the next two voting cycles -- as he did between 2024 and 2025 -- he'd end up with 75.4% of the vote in his 10th and final year, squeaking into the Hall of Fame. \nIt isn't that simple, of course. The voting body is fluid, but there is usually always a hard ceiling. Most players hit that ceiling before 75% and that's what makes the Hall of Fame special. Others finally break through in their second-to-last or last voting cycle. This year is a relatively weak year on the ballot, so it's possible there are extra openings on ballots for Small Hall voters who prefer to only vote for a few players a year, despite being allowed to select 10. Things start to get a bit more crowded next year when Buster Posey comes on the ballot. I do not think this is Jones' last chance, but he's really cutting it close here. It might well come down to the wire like it did for Billy Wagner (in), Gary Sheffield (out), Barry Bonds (out), Roger Clemens (out), Larry Walker (in) and Edgar Martinez (in).\nIn Jones' career, spanning parts of 17 seasons, he hit .254/.337/.486 (111 OPS+) with 1,933 hits, 383 doubles, 36 triples, 434 home runs, 1,289 RBI, 1,204 runs, 152 stolen bases and 62.7 WAR. If that WAR seems a bit out of whack for a player with the modest-looking batting average and on-base percentage, consider the defensive component. There's plenty of room in Cooperstown for excellent defenders who weren't great hitters. Ozzie Smith is a defense-first Hall of Famer, so is Bill Mazeroski, albeit one who is a massive step down from Smith. Jones is a step down from Smith, but there's an argument to be made that he's the greatest defensive outfielder ever. I've made it before.If we're talking about the best defensive outfielder ever, his offense really shouldn't matter much, no? And Jones still hit 434 home runs. Let's also keep in mind that Jones came up at age 19 and then had a drastic decline late in his career. His peak at the plate was pretty impressive. From 1998-2006 -- nine years spanning his ages 21-29 seasons -- Jones hit .270/.347/.513, good for a 119 OPS+. Now we're talking. Remember, this was the best defender in baseball at the time. \nIt's possible the domestic violence arrest after Jones was already done playing is hanging over his head. On Christmas Day 2012, he allegedly assaulted his wife and threatened to kill her; Jones pleaded guilty and paid a fine. I wouldn't blame voters for withholding a vote due to this. I've held my nose and voted for him both last year and this year, with the justification that it's a difficult decision and that I'm only weighing a player's career as a player. Given what we've seen for decades, though, my hunch is that Jones completely falling apart after signing a big contract in free agency -- and letting himself get noticeably out of shape -- is the main factor keeping him out so far. In his last five years, he hit .210/.316/.424 (95 OPS+) with just 1.7 WAR and became a national punchline. That clouded the best parts of his career. The post-playing career arrest certainly didn't help matters.On the field though 2007, though, Jones put together a body of work that makes him a quality peak candidate for the Hall. \nSure enough, the JAWS system has Jones 11th all-time among center fielders. He's very slightly below the average current Hall of Fame center fielder, but he's ahead of Richie Ashburn, Andre Dawson, Earl Averill, Max Carey, Kirby Puckett, Earl Combs, Edd Roush, Hack Wilson and a few others.If we only looked at statistics and factored in his defensive prowess, by no means would Jones be a bad induction into the Baseball Hall of Fame.He still needs a jump in voting, though. There were 394 votes cast last season, meaning a player needed 296 to get to the 75% threshold. Jones got 261 votes, leaving him 33 short. \nCan he add the needed votes this year with the relatively weak ballot? It's a big opportunity. Jones just has to hope he didn't plateau.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baseball Hall of Fame: Andruw Jones running out of time; will his defense carry him? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/0dfd6471-2af7-4a28-ac22-a1f225bd07a0/thumbnail/1200x675/bc4f7dbfc6c73646a0dc71076c8fa753/jones-getty.png"
      ],
      "datePublished": "2025-12-12T14:40:00.000Z",
      "dateModified": "2025-12-12T14:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 15 weather: How polar vortex, snow, frigid temperatures could impact games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-15-weather-polar-vortex-snow-rain-frigid-temperatures/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/435a91f1-d62e-4037-adbf-c17a64a588c8/thumbnail/1200x675/c0d6a54612effec4572b3d2f986fa53b/josh-allen-bills-2.jpg",
    "tag": "Sports",
    "date": "2025-12-12T12:49:56.000Z",
    "description": "\n        December football often means playing in the elements, and while we got a bit of a taste of that in Week 14 -- Josh Allen dashing through the",
    "body": "\n        December football often means playing in the elements, and while we got a bit of a taste of that in Week 14 -- Josh Allen dashing through the snow in the Bills' thrilling win over the Bengals comes to mind -- we're going to feel mother nature's full impact in Week 15.A polar vortex from Canada will descend into the United States this weekend, creating frigid conditions in the midwest and, later, the east coast. Temperatures are expected to hover in the single digits in many areas, and that's without factoring in wind chill and other potential adverse conditions.\"This is the mother lode of cold air and is a term I don't use lightly,\" AccuWeather meteorologist Bernie Rayno said.\n        \n            \n                NFL Week 15 viewer's guide: Top 10 things to watch, including Super Bowl contenders and Philip Rivers comeback\n                \n                    Douglas Clawson                \n            \n                            \n    \n                \n                    \n    \nBut the show will go on, at least for the NFL, and that means teams not only dealing with the teams across from them but whatever the weather may bring.\n(NOTE: All weather projections are via AccuWeather)Browns at Bears (Sunday, 1 p.m. ET)CHICAGO, ILSunday weather: High of 11 degrees, feels like 1 degree, wind gusts up to 22 mphAlthough there's no snow in the forecast for Sunday, there could be some Friday flurries and more snow on Saturday, when the temperature plunges. Both of these teams are plenty used to playing in tough conditions considering the Browns faced the Titans in the snow and the Bears played a frigid game against the Packers just last week.Still, this is projected to be the coldest game Caleb Williams has played in as an NFL quarterback. Last week, he got off to a rough start against the Packers but played a much better second half. Still, expect Chicago to lean on the run as much as possible. Chicago leads the NFL in rushing success rate this season; Cleveland ranks 31st, so there will be a decided edge for the hosts.\nRavens at Bengals (Sunday, 1 p.m. ET)CINCINNATI, OHSunday weather: High of 12 degrees, feels like 2 degrees, wind gusts up to 17 mphCincinnati is expected to get significant snow Friday and Saturday, but the storm should tail off before a critical AFC North game. Still, it will be a very cold day in the Queen City. Joe Burrow played well in his first snow game, completing 25 of 36 passes for 284 yards, four touchdowns and two interceptions last week in Buffalo, though it should be noted that Tee Higgins -- who had a team-high 92 receiving yards and caught two touchdowns -- is in concussion protocol. Still, Burrow is 2-0 in games in which the kickoff temperature is 20 degrees or lower; that includes a 375-yard, three-touchdown game against the Patriots back in 2022.This will likely be the coldest game of Lamar Jackson's career. In fact, he has only played in one game under 20 degrees -- last year's playoff loss to the Bills, in which he played very well.\nChargers at Chiefs (Sunday, 1 p.m. ET)KANSAS CITY, MOSunday weather: High of 23 degrees, feels like 23 degrees, wind gusts up to 10 mphThe conditions won't be quite as brutal in Kansas City, but the Chargers will certainly feel far from their sunny southern California home for several reasons. This will be their first game played in freezing-or-below temperatures since a 2019 playoff game at the Patriots. Philip Rivers was the starting quarterback (and he might be starting again this week for another team!) Antonio Gates was still in the NFL. The team was still more than a year away from drafting Justin Herbert.The Chiefs, on the other hand, are very used to the cold. Patrick Mahomes is 16-4 in games played at 32 degrees or colder, including a 12-2 mark at home games in those temperatures. They did, however, lose at home last week against the Texans.\nBills at Patriots (Sunday, 1 p.m. ET)FOXBOROUGH, MASunday weather: High of 32 degrees, feels like 22 degrees, 1-3 inches of snow, wind gusts up to 21 mphAnother snow game for Josh Allen, trying to keep his team's AFC East hopes alive -- or at the very least not lose ground in the Wild Card chase? And he's facing Drake Maye, one of this season's biggest breakout star? Count me in.Josh Allen in six career snow games (incl. playoffs)Rank (since 2000)Wins51stTouchdowns accounted for141stTouchdowns scored61stRushing yards2942ndWhen Josh Allen's career wraps up, I hope they have a special section of highlights dedicated to just snow games.\nColts at Seahawks (Sunday, 4:25 p.m. ET)SEATTLE, WASunday weather: High of 56 degrees, 80% chance of rainSeattle is dealing with a completely different weather issue: rain. Back-to-back atmospheric rivers have resulted in historic flooding in the Pacific Northwest. Washington governor Bob Ferguson declared a state of emergency Wednesday, and some areas of the state are under evacuation orders.The Seahawks have played in plenty of rain-drenched games. That's the nature of playing in Seattle. But the Colts, who call indoor Lucas Oil Stadium home, have played in just one game this season with \"rain\" listed as the kickoff temperature: last week's disastrous 36-19 loss to the Jaguars that saw Daniel Jones suffer a season-ending Achilles tear. With Anthony Richardson (eye) out and Riley Leonard suffering a knee injury after coming in following Jones' injury, he team signed 44-year-old Philip Rivers to its practice squad this week, and he could start. Whoever is behind center, he will be playing in brutal conditions against one of the league's best defenses.Dolphins at Steelers (Monday, 8:15 p.m. ET)PITTSBURGH, PAMonday weather: High of 22 degrees, feels like 12 degrees, wind gusts up to 18 mph, slight chance of precipitationThanks to years in Green Bay, Aaron Rodgers is plenty experienced in the cold.Tua Tagovailoa is, too, but he has struggled infamously in it when he has to leave Miami.Tua Tagovailoa under 40 degrees (incl. playoffs)W-L0-5TD6Turnovers6Team point diff-96Miami has made a recent run to get on the edges of playoff contention, but it will need Tagovailoa to reverse his cold-weather struggled to have a shot Monday.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 15 weather: How polar vortex, snow, frigid temperatures could impact games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/435a91f1-d62e-4037-adbf-c17a64a588c8/thumbnail/1200x675/c0d6a54612effec4572b3d2f986fa53b/josh-allen-bills-2.jpg"
      ],
      "datePublished": "2025-12-12T12:49:56.000Z",
      "dateModified": "2025-12-12T12:49:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Buccaneers' epic fourth quarter meltdown happened on 'TNF' vs. Falcons - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-implode-in-shocking-loss-to-falcons-thursday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/188d2b26-af97-42cf-892a-6b0a6decb4ea/thumbnail/1200x675/ff90916a43f3163328b4f0d5988e7f9c/falcons.jpg",
    "tag": "Sports",
    "date": "2025-12-12T15:27:12.000Z",
    "description": "\n        With 10 minutes left to play on Thursday night, the Tampa Bay Buccaneers looked like they were on their way to picking up a huge win. At that",
    "body": "\n        With 10 minutes left to play on Thursday night, the Tampa Bay Buccaneers looked like they were on their way to picking up a huge win. At that point, the Bucs had a 14-point lead on Atlanta and when you get up by that much on the Falcons, the game is usually over. Going into Week 15, the Falcons had been 0-104-1 when trailing by 14 points or more in the fourth quarter over the past 25 years. Unfortunately for the Bucs though, they didn't walk away with the win and that's because they totally imploded in a stunning 29-28 loss that knocked them into second place in the NFC South. The Falcons committed a franchise-record 19 penalties, they missed TWO two-point conversions in the fourth quarter, and yet, they somehow still won. So how did that happen? Let's break down the Buccaneers implosion. Implosion breakdown, part I: Buccaneers defenseThe defense had the first chance to put the game away for the Bucs. With Tampa Bay leading 28-14 and just 10 minutes left to play, the Bucs just needed to get a stop and that probably would have been enough to win the game, but that didn't happen. Instead, the Falcons put together an 8-play, 65-yard scoring drive that was capped by a Bijan Robinson touchdown run from six yards out. \nThe Falcons went 2-for-2 on third down during the drive, including a play at Tampa Bay's 44-yard line where Kirk Cousins converted a third-and-2 by completing an 18-yard pass to Kyle Pitts. It was almost like the Bucs forgot Pitts existed on Thursday, because he ended up having a career game with 11 catches for 166 yards and three touchdowns. \n\n        \n            \n                NFL Week 15 viewer's guide: Top 10 things to watch, including Super Bowl contenders and Philip Rivers comeback\n                \n                    Douglas Clawson                \n            \n                            \n    \n                \n                    \n    \nRobinson's touchdown came just two plays after Pitts' big catch. The Falcons went for two after the score and didn't get it, so Tampa bay was still leading 28-20 with 9:37 left to play after Atlanta's touchdown. Implosion breakdown, part II: Baker Mayfield's interceptionThe Bucs defense didn't get the job done, but Tampa Bay still could have won the game with just one scoring drive in the fourth quarter. Instead, the offense pulled a total no-show with just 28 total yards in the final period. The Buccaneers did start to move the ball on one drive, but it was cut short after Baker Mayfield got picked off by Dee Alford. \nAgain, if the Bucs score any points on this drive, they probably win, but instead Mayfield threw a back-breaking interception. After the game, the Buccaneers quarterback took all the blame for the loss. \n\"Can't turn the ball over, can't have that interception,\" Mayfield said. \"You can say what you want being up two scores and the defense right there, but we have to be better on offense and it comes down to how I play. This one is on me. This falls on my shoulders.\"Implosion breakdown, part III: The missed fumble recoveryAfter Alford's interception, the Falcons quickly moved down the field thanks to a 14-yard run by Robinson, a 15-yard run by Tyler Allgeier and a 10-yard pass from Cousins to Pitts. On a second-and-10 from Tampa Bay's 25-yard line, the Bucs appeared to get the big defensive play that they needed: After Darnell Mooney caught a pass from Cousins, Lavonte David knocked it free and the Bucs looked like they were about to make the easiest recovery in NFL history. Tampa Bay had SEVEN defenders around the ball and the Falcons only had Mooney, who couldn't even move because he was flat on the ground. \nIn the end, Falcons offensive lineman Ryan Neuzil came in from OUT OF NOWHERE to recover the fumble and save the game for Atlanta. \nThe play ended with the Falcons recovering the ball at Tampa Bay's 10-yard line, so it went in the books as a 15-yard gain. Two plays later, the non-recovery came back to haunt the Bucs when Cousins hit Pitts for a 7-yard touchdown that cut the lead to 28-26. \nThe touchdown was actually reviewed for a lengthy amount of time before officials ruled that Pitts came down in-bounds. \nAfter the score, the Falcons went for two, and once again, they failed, which set up even more drama. Implosion breakdown, part IV: Buccaneers offense stumbles againAfter the Falcons score, the Bucs offense had ANOTHER chance to put the game away. The Falcons had all three timeouts, so it was going to take two or three first downs to win it and the Buccaneers quickly got one of those after converting a third-and-5. After that though, things got dicey. Here were their next four plays: First-and-10 from Tampa Bay 39-yard line: Bucky Irving stopped for 4-yard loss (Falcons call final timeout at 2:24)Second-and-14 from TB 35-yard line: Mayfield pass to Emeka Egbuka falls incomplete (clock stops 2:20)Third-and-14 from TB 35-yard line: Mayfield sacked (Clock runs down to two-minute warning)Mayfield had Egbuka open for a possible first down on second-and-14, but the pass went incomplete. At that point, the Falcons were out of timeouts, so if the Bucs had run the ball on the play, the clock would have run down to the two-minute warning, and then, the Bucs could have run the clock down to 1:20 before punting. Instead, the Falcons got the ball back with 1:45 left to play knowing that they only needed just a field goal to win. \nImplosion breakdown, part V: The second missed fumble recoveryFor the second time in the fourth quarter, the Bucs defense made a big play, but they couldn't finish it off. On a first-and-10 from his own 47, Cousins dropped back to pass and he ended up FUMBLING after getting drilled by Haason Reddick. \nIf the Buccaneers recover the ball, then the game is over, but the officials made a rare call: They ruled that it was simultaneous possession between Cousins and the Buccaneers defender. In the NFL, the tie goes to the offense, so the Falcons got to keep the ball. Even though Falcons got the recovery, they lost eight yards on the play, which sets up our final Buccaneers meltdown. Implosion breakdown, part VI: Bucs let the Falcons turn a third-and-28 into an eventual first downAfter the sack, the Falcons were facing a second-and-18 and that quickly turned into a second-and-28 after Atlanta got flagged for holding. Following an incompletion by Cousins, it was now third-and-28 and it didn't look like there was any way Tampa Bay was going to lose at that point. On third down, Cousins hit Pitts for a 14-yard gain that gave Atlanta a much more manageable fourth-and-14. \nOn fourth down, the Falcons converted with a miracle 21-yard completion from Cousins to David Sills that gave Atlanta the ball at Tampa Bay's 36-yard line. \nFrom there, it was pretty clear the Buccaneers weren't going to win. After the Sills catch, the Falcons quickly had to spike the ball to stop the clock and the Bucs imploded again when Vita Vea got called for a defensive offsides that gave Atlanta five free yards. Cousins then threw one more six-yard completion to set up Zane Gonzalez's game-winning field goal attempt from 43 yards out. \nIt was a colossal meltdown by the Bucs and it marked the first time since 2003 that they lost a game where they led by 14 points or more in the fourth quarter. This is the kind of game that the Falcons usually lose -- again, Atlanta had 19 PENALTIES -- but the Buccaneers managed to out-Falcons a Falcons team that had nothing to play for after being eliminated from playoff contention on Sunday. \nThe Buccaneers now have lost six of their last eight games, including two straight that have come in the division. The only silver lining for the Bucs is that they still control their playoff fate: If they win out, they'll win the NFC South. The only reason that's possible is because they face the Panthers twice over the final three weeks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Buccaneers' epic fourth quarter meltdown happened on 'TNF' vs. Falcons - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/188d2b26-af97-42cf-892a-6b0a6decb4ea/thumbnail/1200x675/ff90916a43f3163328b4f0d5988e7f9c/falcons.jpg"
      ],
      "datePublished": "2025-12-12T15:27:12.000Z",
      "dateModified": "2025-12-12T15:27:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meet Landon Robinson: How Navy star NG emerged as Midshipmen's soft-spoken 'freak' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/landon-robinson-navy-football-freak-army-navy-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/ab24ce82-a4d1-43cf-8d4e-f1f85ef6d97b/thumbnail/1200x675/e2b3fc8a99ebd5164c614e4dc6976ec5/landon-robinson-navy.png",
    "tag": "Sports",
    "date": "2025-12-12T14:38:16.000Z",
    "description": "\n        It's a normal spring workout session for the Navy football program, but there is a distinctly abnormal athlete preparing to squat an eye-popp",
    "body": "\n        It's a normal spring workout session for the Navy football program, but there is a distinctly abnormal athlete preparing to squat an eye-popping amount of weight. Meet Navy nose guard Landon Robinson, who is about to squat 650 points with a barbell that had to be specially ordered because there wasn't one long enough. He is Navy's freak, a moniker earned thanks to his repeated inclusion in The Athletic's annual freaks list. The story chronicles the strongest, fastest and most physical players in college football, and Robinson checked in at No. 13 before the 2025 season. Freaks come in all packages, and the 6-foot, 285-pound Robinson is on the list for the third time. He is a two-time all-conference player in The American and one of the league's leaders in sacks, but it's the freak designation in which he takes a particular amount of pride.  \"I don't take it as any offense,\" Robinson told CBS Sports. \"I think it's very cool. I think being able to be recognized in that sense, it's awesome. Hopefully I can continue to keep being a freak in the future and keep improving my status. I'm just thankful for it.\" A freak is not built in a day, and Robinson's journey to Navy started on the tumbling mats of his father Lance's gym at a young age. Robinson wrestled, ran track and played baseball and football in high school at Copley, Ohio. Lance was a gymnast at Kent State, and got Landon started early. When he was young, Robinson would watch \"The Karate Kid\" and go in the backyard and do stretches and flips. Robinson has always been a workout fiend, and he is an all-around athlete in an era of intense sports specialization at the youth level. What started on the mats evolved to his backyard where he took his footwork to the next level.  \n\"I would take a ladder and I would just go in my backyard and I would just do baseball related footwork stuff and a little bit of football too,\" Robinson said. \"I would put weights on my legs, just trying too weigh myself down as much as I can to just build that speed. I would just do those all the time. I would get cones, all the ... all the different things. So the neighbors probably thought I was crazy, but I was just, I was just working out all the time\" It was wrestling, even though he only did it for a year, that was actually his favorite sport. He says beyond the competitive aspect it taught him how to use his body in different ways to create leverage. For a relatively undersized defensive lineman who idolizes players like Aaron Donald, leverage can mean everything. Offensive lineman Hoke Smith said he'd never had lower pad level than Robinson across the hundreds of reps they've gone against each other in practice. With all of his experiences, Robinson is the poster child for the way Navy identifies and develops players. The Midshipmen won't get the 6-5, 275-pound specimens tailor made for NFL Sundays straight out of high school. They look for versatility, and switching positions is common as players' body types evolve. \n\"That's how we recruit in general,\" defensive coordinator PJ Volker said. \"Say you're recruiting a mike linebacker, right? Well, the next position for a mike to play for us if we're recruiting the right profile is for him to go to Raider, our boundary outside backer. So we wanna recruit a big, long mike that may grow into a Raider; we wanna recruit a Raider that might grow into a defensive end; a defensive end that might grow into a three technique -- into a nose tackle. Longer bodied corners that may grow into safeties, safeties that may go into linebackers.\" Volker was his area recruiter out of high school and thought Robinson could turn into a sawed off defensive end, perhaps around 265 pounds. Navy was his only FBS offer coming out of high school. So how did Robinson get from outside linebacker to head up on the center nose tackle? \"With him, that wasn't part of the forecast,\" Volker said. He came to the Naval Academy as a 240-pound outside linebacker, and within months Robinson was up to 280. Robinson was known to set an alarm to wake up in the middle of the night and drink protein shakes, eat a Gatorade bar to put 600 calories in his body and then go back to bed. He would order full pizzas to eat after dinner in addition to the extra lifts he put in. He actually got all the way to 300 pounds, but it was deemed a bit too heavy for him to be an every down player considering all the movement Navy asks of its defensive linemen. \nDuring spring practice his sophomore year, a player on the interior of the defensive line had a shoulder injury, so Navy's coaches asked Robinson to fill in up front. He would chase plays down sideline to sideline and become a general disruptive force up front as he grew into his new position. But as Robinson bulked up, one thing didn't change: his speed. Robinson has been clocked with pads on running over 20 miles per hour, which at his current weight is eye catching. So much so that Navy's coaching staff felt they could use him on the kickoff team, and Robinson became one of 13 defensive linemen in the country, according to Navy, to play on kickoff coverage in 2023. \"I was just flying down and running as fast as I can and hitting whoever comes in my way,\" Robinson said. \"It was awesome. It was a lot of fun, a lot of adrenaline. And I think the first play of my collegiate career was against Notre Dame over in Ireland on kickoff. And I made the tackle first play, and I was ... I was ecstatic. It was insane. I ran a dude over, dude tried to block back and I put him all the way back into the returner and then made the tackle. I was jumping for joy. So it was super cool.\"Robinson also has had chances to carry the ball at times. His famous fake punt in the 2024 Army-Navy game helped the Midshipmen to victory. He has three rushing attempts in his career for 87 yards. \nIt wasn't just the coaches who noticed his transformation. Fellow defensive lineman Griffen Willis came to the Naval Academy during Robinson's sophomore year, and the two bonded quickly over a shared love of working out. It was Willis who spotted Robinson during his 650-pound lift -- and all of his heavy lifts -- although he doubts how much it's necessary as Robinson doesn't fail lifts, according to him. \"It's not like we go out to parties or anything like that. We'd rather sacrifice the fun. This is our kind of fun, going to get better, and that relationship's built and, you know, I've had him over at my house. Parents love him to death. He's slept in my house. I'm super grateful to be a good friend of his. I can attest a lot of my success to him. And he's always pushed me. He's always like an itch in my brain. Like, I bet Landon's doing something. My mom has a trademark saying: What would Landon do? And see she's not wrong because what would Landon do? He'd probably go work out.\" There is an unanswered question in the Navy football program: How much can Robinson actually lift? His max squat is 665 pounds and a 465 pound bench press. Head strength and conditioning coach Jim Kiritsy thinks he can get up to a 500-pound bench and a 700-plus pound squat, but with a special bar already ordered to get the 650 squat, he won't be spending more of his budget just to find out. There are other ways to test strength beyond just raw maxing out, though. Kiristsky has challenged Robinson this season to up the bar velocity on his 600-pound squats so they move as fast as his 500-pound squats used to. \n\"We put a lot of leashes on our weightlifting ability because we wanna keep ourselves safe and keep ourselves recovered,\" Willis said. \"But if they took off the leash, I'm thinking he could squat upwards of 750, and I'm serious about that. I mean, that guy, he is an animal, he's actually crazy in the way that he squats. And I wish I could be like him, but I'm trying\" On the field, the work in the weight room shows in his play strength and how quick he is getting off the ball. Smith has played defenders from Notre Dame and Oklahoma multiple times in his time at Navy, and he says Robinson is still the toughest player he's had to block. Robinson is so freakish that there are special rules for him at practice when he gets into the backfield, especially in pass rushing situations, as he often does. The play doesn't stop; Robinson simply peels off and quarterback Blake Horvath still gets the throw off. It's the only way they can practice their passing game at some points because Robinson is so disruptive.He's soft-spoken but has a game that does the real talking for him. Robinson will take the field against Army for the last time in his college career, ending one of the freakiest football careers in the history of the Naval Academy. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meet Landon Robinson: How Navy star NG emerged as Midshipmen's soft-spoken 'freak' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/ab24ce82-a4d1-43cf-8d4e-f1f85ef6d97b/thumbnail/1200x675/e2b3fc8a99ebd5164c614e4dc6976ec5/landon-robinson-navy.png"
      ],
      "datePublished": "2025-12-12T14:38:16.000Z",
      "dateModified": "2025-12-12T14:38:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's at stake in NFL Week 15 schedule: Six games with playoff implications - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-15-historic-slate-cbs-bills-patriots-packers-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/b977df9e-014f-4866-9c0a-a4b45ffcec08/thumbnail/1200x675/14daff39a872ed621439b8352a6e47cd/bo-nix-broncos-g.jpg",
    "tag": "Sports",
    "date": "2025-12-12T12:30:07.000Z",
    "description": "\n        We are all in for a treat on Sunday. It will be one of the best slates in NFL history on a single network. It's the first time on record that",
    "body": "\n        We are all in for a treat on Sunday. It will be one of the best slates in NFL history on a single network. It's the first time on record that CBS features teams with a collective win percentage of .600 or better in December or later. There are seven teams that are at least five games over .500 and the schedule also features nine of the top 10 seeds in the AFC playoff picture.It's statement Sunday for teams looking to prove they are legit Super Bowl contenders and survivor Sunday for teams with their backs against the wall. If all the jockeying for playoff position wasn't enough, this is the time of year when teams need to be hitting their stride if they want to win it all. Each of the last 12 Super Bowl winners was .500 or better in the final 4 games of the regular season. Here's what's at stake in each matchup:Ravens (6-7) at Bengals (4-9): Sunday 1 p.m. ETBoth teams are in survival mode. The Bengals would be eliminated with a loss and the Ravens would have a really tough time recovering if they lost. The Ravens lost a game they really needed to win vs. Pittsburgh in Week 14 and have a chance at revenge against the Bengals after losing 32-14 at home to them two weeks ago.It won't be easy for the Ravens to win the AFC North now, which is their only path to punching their playoff ticket. After this game, they get the Patriots, Packers and Steelers to finish the year.\nMissing the playoffs would also be crushing for both franchises. It would mean a lost season for superstar quarterbacks in their primes. It would be an especially tough blow for Jackson, who has never made the Super Bowl and could have fewer prime years left with how much he relies on his legs. This year's hamstring injury suggests we may already be seeing his decline, or it could be right around the corner.This definitely looks like a lost season for Joe Burrow, but it's not over until it's over. John Breech laid out a nightmare scenario for the NFL where the 7-10 Bengals could host the 13-4 Patriots in the playoffs. I wouldn't even be surprised to see Cincinnati run the table with this upcoming schedule (they face the Ravens, Cardinals, Browns and Dolphins) to really put the pressure on Baltimore and Pittsburgh. The Bengals' season is on life support and the loss in Buffalo was a setback, but I still believe they can win the division. \n        \n            \n                NFL Week 15 viewer's guide: Top 10 things to watch, including Super Bowl contenders and Philip Rivers comeback\n                \n                    Douglas Clawson                \n            \n                            \n    \n                \n                    \n    \nChargers (9-4) at Chiefs (6-7): Sunday 1 p.m. ETThe Chiefs could be eliminated from playoff contention as soon as Sunday with a loss and wins by at least three of these teams (Colts, Bills, Texans, Jaguars). Their current run of 10 straight playoff appearances is the second-longest in NFL history, behind the 11 seasons of the 2009-19 Patriots. They also have AFC Championship (seven straight) and Super Bowl trip (three straight) streaks hanging in the balance. \nIt's going to be interesting to see if they can still salvage this season (and keep the dynasty going) despite all of the struggles. They currently have a 6% chance to make the playoffs, according to Sportsline, but the path is there, as John Breech laid out earlier this week. They need to essentially steal the Chargers' wild card spot and hope the Colts' collapse continues. Considering Patrick Mahomes is the quarterback you'd probably want most if you needed to run the table, plus the Chargers and Colts have brutal schedules, it's still within reach.The Chargers aren't afraid of Charger-ing either. For this franchise, it's about avoiding the collapse we all know they are capable of and Justin Herbert eventually winning his first playoff game. It starts by sweeping the Chiefs on Sunday (they beat them in Brazil in Week 1). Nobody has swept the Chiefs since Peyton Manning's Broncos in 2014.Bills (9-4) at Patriots (11-2): Sunday 1 p.m. ETThis game is about the AFC East title (and the top seed in the AFC). The Patriots are trying to sweep the Bills and put a stranglehold on their first division title since 2019. They are trying to prove their Week 5 win in Buffalo was no fluke as they've played the easiest schedule in the NFL this year. Drake Maye is also trying to become the fifth quarterback to win an NFL MVP within his first two seasons (Dan Marino, Kurt Warner, Patrick Mahomes, Lamar Jackson) and sweeping the Bills would go a long way. Maye can also tie the longest win streak by a quarterback in his second season, ever (Lamar Jackson, Peyton Manning and Dan Marino all won 11 straight). Bo Nix can match this later in the day, too. \nPlus, don't forget the Patriots are in the middle of a historic turnaround. If they win out and finish 15-2, they would have the largest year-over-year win improvement (+11) in NFL history (they were 4-13 in 2024). This year is a golden opportunity for the Bills to win a Super Bowl, with the Chiefs most likely missing the postseason. Their path would be much easier if they came back and won the AFC East title and they are certainly capable. They won the division in 2021, when they were two games back with four games to play, and in 2023, after they were three games back with five to play. \n        \n            \n                NFL Week 15 preview: Highlighting best QB matchups, including Josh Allen vs. Drake Maye and more\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nJets (3-10) at Jaguars (9-4): Sunday 1 p.m. ETAnyone who makes the playoffs probably has a legit chance to win the Super Bowl this year, with how wide open it is. That probably even includes the Jaguars, so they need to take care of business and win this game and inch closer to a division title. They are averaging over 30 points per game in five games since the trade deadline, the first time they've hit that mark in a five-game stretch since 2017, when they lost in the AFC title game. They are rounding into form and can maintain their one-game lead in the AFC South over the Colts and Texans with road games at Denver and Indianapolis on deck.\nYou would think there's nothing at stake for the Jets besides draft positioning, but remember this is a team with zero interceptions this season and two takeaways, the fewest through 13 games all-time. There were more takeaways on one play this past Monday (three in the bizarre sequence in the Chargers-Eagles affair). If the Jets have any dignity left, they will get their first interception of the season.Packers (9-3-1) at Broncos (11-2): Sunday 4:25 p.m. ETThis is a potential Super Bowl preview that is a barometer for both teams. The Packers didn't beat anyone of significance last year and they still haven't shed that stink even after wins over the Lions and Bears in the last two weeks. If Jordan Love and Green Bay come up with a win vs. this Denver defense and snap the team's 10-game win streak, it will restore some faith that they can actually win a Super Bowl this year. In a similar respect, the Broncos haven't exactly been lighting the world on fire during their win streak and their statement wins vs. the Chiefs and Eagles look less impressive now in light of their recent struggles (but their win vs. the Texans is looking better). This is an opportunity for the Broncos to prove they are legit contenders and that their passing game with Bo Nix is good enough to win a Super Bowl.\nThe Super Bowl narrative looms large, but right now, the most important thing is each team winning its division and chasing a one seed. The Packers have a half-game lead over the Bears, with Chicago, Baltimore, and Minnesota still on their schedule. The Broncos are currently the one seed in the AFC with Jacksonville, Kansas City and the Chargers left. That's a tough path to a one seed, but history says it's very important for Denver to get the first-round bye. They've made the Super Bowl six times out of eight when they've been a one seed.Denver may not make the Super Bowl this year, but we would all remember a sack record. They are currently on pace to tie the 1984 Bears for the most sacks in NFL history (72), but Jordan Love is one of the hardest quarterbacks to sack in the NFL.Colts (8-5) at Seahawks (10-3): Sunday 4:25 p.m. ETWe have to start with Philip Rivers here. His body is going to be at stake when he plays in his first NFL game in 1,800 days vs. a Seahawks defense that leads the NFL in pressures this season. He also has a chance to author one of the greatest comeback stories in NFL history. A 44-year-old grandfather who has been retired for five years could stop the Colts' collapse in its tracks while facing the NFL's toughest remaining schedule. I imagine that would help his Hall of Fame case, too.\nThe Colts have lost three straight games, are currently on the outside of the playoffs looking in, and could be the first team since the 1995 Raiders to miss the playoffs after an 8-2 or better start.The Seahawks need this win to keep pace with the Rams as they fight for an NFC West title and a one seed. This is deja vu for Sam Darnold. The Vikings won 14 games last year but finished second in the NFC North (and had to travel to face the Rams in the playoffs) after losing a critical Week 18 game vs. the Lions. Darnold could actually win 13+ games in back-to-back seasons with different teams, but have to start the playoffs on the road. Brutal. We're a long way from that happening and the Seahawks need to take care of business here before a short turnaround when they host the Rams on Thursday Night Football in Week 16.There's also individual history on the line for both teams. Jonathan Taylor can win his second rushing title, although a brutal schedule and several good defenses stand in the way. He's also gone under 100 rush yards in three straight games. Jaxon Smith-Njigba is on pace for 1,867 receiving yards this season. The NFL record is 1,964 by Calvin Johnson in 2012.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's at stake in NFL Week 15 schedule: Six games with playoff implications - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/b977df9e-014f-4866-9c0a-a4b45ffcec08/thumbnail/1200x675/14daff39a872ed621439b8352a6e47cd/bo-nix-broncos-g.jpg"
      ],
      "datePublished": "2025-12-12T12:30:07.000Z",
      "dateModified": "2025-12-12T12:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big 12 football grades: Evaluating the performance of all 16 teams in 2025 season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/big-12-college-football-grades-analysis-2025-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/12/f415a8ee-5ace-45a6-ad87-1844d04e05a5/thumbnail/1200x675/be0edd2d68b1846fb39ec2104f638c3a/texas-tech.png",
    "tag": "Sports",
    "date": "2025-12-12T13:40:55.000Z",
    "description": "\n        The 2025 Big 12 season has come to an end, and the final results look far different than preseason outlooks. Texas Tech blew away expectation",
    "body": "\n        The 2025 Big 12 season has come to an end, and the final results look far different than preseason outlooks. Texas Tech blew away expectations to earn its first outright conference title since 1955, and BYU surprised everyone by posting a second 11-win season. Utah got back to its winning ways and Arizona proved its missed bowl last season was just a fluke. Kansas State, however, was seen by many as a potential Big 12 contender; the Wildcats finished .500. Baylor started with similar expectations but missed a bowl game to post their fourth losing season in six years. And then there was Oklahoma State, which fired coach Mike Gundy and embarked on a historically terrible campaign. The Cowboys were the only program to fire their coach, though Iowa State's Matt Campbell left for Penn State and Kansas State's Chris Klieman retired. With so much movement, here's how we grade every single Big 12 team after the 2025 campaign. \n\n    \n                                        \n    Texas TechThe Red Raiders took one of the great swings in college football history by investing heavily in a stacked portal class. It was an unprecedented success. Texas Tech blew through the Big 12 to win its first outright conference title since 1955 and earn a first-round bye in the College Football Playoff. The program has serious national championship aspirations. Grade: A+\n    \n                                        \n    BYUThe season seemed to be over after quarterback Jake Retzlaff transferred, but true freshman Bear Bachmeier was a revelation. The Cougars again bullied their way to a second consecutive 11-win season and national ranking to establish themselves as one of the top programs in the Big 12. With coach Kalani Sitake locked in long term after a dalliance with Penn State, vibes are high. Frankly, the only thing holding this back from being an A+ is disrespect by the College Football Playoff Selection Committee. Grade: A\n    \n                                        \n    HoustonWillie Fritz has long been a miracle worker, but even he outdid himself. The Cougars stunningly went from consecutive 4-8 seasons to a 9-3 campaign and No. 21 slot in the final CFP Rankings. Quarterback transfer Conner Weigman helped stabilize the position, and No. 1 overall recruit Keisean Henderson has a shot to change everything for this program. The Cougars are back. Grade: A\n\n    \n                                        \n    ArizonaWildcats coach Brent Brennan entered the year on a blazing hot seat after wasting the final year of Tetairoa McMillan's career. But instead of panicking, Brennan settled down and built around his quarterback, Noah Fifita. The results were fantastic. The Wildcats ended the year on a five-game winning streak, including a decimation of rival Arizona State. Fifita was named the first-team All-Big 12 quarterback as UA ranked No. 17 in the final CFP Rankings. The Brennan era has new life in Tucson. Grade: A\n    \n                                        \n    UtahThe Utes were in an unfamiliar position after missing a bowl last season, but gambles on offensive coordinator Jason Beck and quarterback Devon Dampier worked to perfection. Utah reestablished itself as one of the leading powers in the Big 12 with a 10-win campaign. The only damper on their season was losing to BYU in Provo, which ultimately cost them any real Big 12 or playoff contention. Grade: A-\n    \n                                        \n    CincinnatiIt was a tale of two seasons for Cincinnati. The Bearcats rattled off a seven-game winning streak with multiple blowouts through October. Then, they ended November on a four-game losing streak to finish 7-5. The emergence of quarterback Brendan Sorsby and some serious line talent is a positive indicator for Scott Satterfield's staff, but the bar was raised after a 7-1 start. This wasn't the way to finish. Grade: B-\n\n    \n                                        \n    Arizona StateThe Sun Devils might be the most difficult program on the list to grade. They finished a respectable 8-4 and were the only team to upset Texas Tech during the Red Raiders' Big 12 title campaign. They also dealt with major injuries, lost in nonconference to Mississippi State and dropped a third Territorial Cup in four years with a 23-7 loss against Arizona. Arizona State was capable of contending for the Big 12, and their path gets more complicated after losing multiple starters to the portal. Grade: B-\n    \n                                        \n    Iowa StateIt was a strange season for the Cyclones. They beat rivals Kansas State and Iowa in the first three games. Then, they went on a four-game losing streak in the middle of the season before recovering at the end. Failing to reach conference contention after the start was disappointing, but eight wins is nothing to scoff at in Ames after serious roster turnover. Grade: B-\n    \n                                        \n    TCUBefore the 2025 season, coach Sonny Dykes claimed the Horned Frogs were good enough to win the Big 12 title. They flashed real upside while sweeping in-state opponents Baylor, SMU and Houston, but a 44-13 loss to BYU defined a middling 8-4 campaign. The Horned Frogs have not been in serious conference contention since their magical run to the national title game in 2022. Grade: B-\n\n    \n                                        \n    UCFTakeaways were hard to find during an up-and-down season for the Knights. They hung well with Houston and Cincinnati, but only beating Oklahoma State by three and getting crushed by Baylor won't sit well. The defense ranked No. 4 in the conference, and Scott Frost has plenty of track record on offense. Still, making a bowl would have been nice. Grade: C\n    \n                                        \n    West VirginiaThe Mountaineers' second stint under Rich Rodriguez was a rollercoaster. Beating Pittsburgh made it all worth it, but the middle of the season was a tire fire. Then, November brought some serious intrigue behind freshman quarterback Scotty Fox Jr. All Rodriguez needed was to find a few stars and beat Pitt; mission accomplished. Grade: C\n    \n                                        \n    KansasThe shine is officially off the Lance Leipold era at Kansas after the Jayhawks missed a bowl game for a second straight season. The Jayhawks started 4-2 but lost five of six games down the stretch to waste Jalon Daniels' senior season. Grade: C-\n\n    \n                                        \n    Kansas StateThe Wildcats have been the model of consistency under coach Chris Klieman, but the bottom fell out in 2025. Kansas State never seemed to recover from a season-opening loss to Iowa State in Dublin, leading to a stunning 2-4 start. They recovered well enough to make a bowl game, but Klieman retired after the season. KSU fans will hope to quickly move on from this year. Grade: D+\n    \n                                        \n    ColoradoFor essentially the first time in his career, Deion Sanders had to find a quarterback after Shedeur Sanders left for the NFL. The decision proved fatal during a miserable 3-9 season that completely got away from them at the end. Losses by a combined 105-24 against Utah and Arizona in consecutive weeks were rock bottoms for the program. The emergence of Julian Lewis brings at least a little optimism, but Coach Prime has work to do. Grade: D\n    \n                                        \n    BaylorThe Bears came into the year with serious Big 12 title aspirations after ending 2024 on a six-game winning streak. Baylor managed to retain nearly all of its stars and had a favorable home schedule. Instead, it was a fourth losing season in six years as Baylor stunningly missed a bowl game. If not for athletic director Mack Rhoades resigning, Baylor would likely have fired coach Dave Aranda. Instead, he heads into yet another lame duck season in 2026, but this time without his top talents. Grade: D-\n\n    \n                                        \n    Oklahoma StateFor a second, let's put aside the football team. Obviously a 1-11 campaign was horrendous. Give some credit to Cowboys fans, who truly gave us a good vibes season for the ages. With Eric Morris coming to town, the dawn is about to break. Grade: F\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big 12 football grades: Evaluating the performance of all 16 teams in 2025 season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/12/f415a8ee-5ace-45a6-ad87-1844d04e05a5/thumbnail/1200x675/be0edd2d68b1846fb39ec2104f638c3a/texas-tech.png"
      ],
      "datePublished": "2025-12-12T13:40:55.000Z",
      "dateModified": "2025-12-12T13:40:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]