[
  {
    "title": "Wild Card NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-parlay-longshot-picks-odds-props-wild-card-weekend-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/fda0a38e-cbf6-4daf-b229-826f78f139d3/thumbnail/1200x675/37da089231d6cdbcd3df96763d761c57/brock-purdy-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:56:26.000Z",
    "description": "\nA dozen teams will take the field during NFL Wild Card Weekend 2026, with Denver and Seattle on byes and waiting in the wings. You have the option of",
    "body": "\nA dozen teams will take the field during NFL Wild Card Weekend 2026, with Denver and Seattle on byes and waiting in the wings. You have the option of making NFL picks or crafting a Wild Card NFL parlay on games with large spreads, like Rams vs. Panthers (+10.5) or ones with slim lines, such as Bills vs. Jaguars (+1.5). Meanwhile, Steelers vs. Texans on Monday has Houston favored by 3 points, per the latest Wild Card Weekend NFL odds from DraftKings Sportsbook, despite Pittsburgh's recent run of playoff futility. The Steelers have lost six straight postseason games -- five coming by double-digits -- which could make playing the alternate lines intriguing with an NFL longshot parlay.Pittsburgh's average margin of defeat across these six losses is 13.7 points, and you could make NFL prop bets on the winning margin for this matchup. Predicting Houston to win by 13 to 18 points would return +650, as that could be one leg of a massive payout for the opening week of the 2026 NFL playoffs. Before making any Wild Card NFL picks or parlays, you need to see the Wild Card NFL longshot parlay from SportsLine's proven computer simulation that pays out $1.2 million on a $10 bet.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Wild Card Weekend NFL odds, it's locked in its betting picks to form a six-leg NFL parlay that could pay out $1.2 million for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.Top Wild Card NFL parlay picksFor Wild Card Weekend, one of the picks featured in the six-leg parlay is Brock Purdy as an anytime touchdown scorer (+650) in 49ers vs. Eagles on Sunday. Only one team has allowed more rushing touchdowns to opposing quarterbacks than Philly, which has given up three rushing scores to quarterbacks over the last two games alone. Philly has also allowed the second-most rushing yards to opposing QBs this year, and Purdy is much more mobile, and willing, to run than many realize.He has two rushing touchdowns over his last two games, and Purdy's scored eight touchdowns on the ground since the start of last season, despite missing 10 games. That's more rushing TDs than Lamar Jackson (six) or Kyler Murray (six) and is as many as Jayden Daniels. Additionally, the Eagles have given up the fewest passing touchdowns in the redzone, which could force Purdy to scramble towards the endzone in these situations. That makes these long odds worthy of investing in as one leg of a longshot parlay. See the rest of the picks in the Wild Card NFL parlay here.You can bet Purdy as an anytime touchdown scorer at using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make NFL parlay picks for a payout of $1.2 millionThe parlay also includes five additional picks from SportsLine's computer model, including a pair of first touchdown scorer props that return at least +1000. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for Wild Card Weekend that can be combined into a parlay that returns $1.2 million on just a $10 bet, and what optimal first touchdown scorer bets return at least +1000? Visit SportsLine now to see the top Wild Card NFL picks from SportsLine's proven model that can be combined for a parlay that pays $1.2 million, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild Card NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/fda0a38e-cbf6-4daf-b229-826f78f139d3/thumbnail/1200x675/37da089231d6cdbcd3df96763d761c57/brock-purdy-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T15:56:26.000Z",
      "dateModified": "2026-01-09T15:56:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA DFS picks, Friday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-dfs-draftkings-fanduel-daily-fantasy-basketball-picks-friday-january-9/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/45202b06-4847-4936-9b58-04cdd3c5d841/thumbnail/1200x675/a49efc4e9934db996d56c7dbd8134733/bub-carrington-cbs.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:54:13.000Z",
    "description": "\n        There is 10-game NBA schedule on Friday, which begins at 7 p.m. ET and has the last tip at 10:30 p.m. ET.   There are a number of high qualit",
    "body": "\n        There is 10-game NBA schedule on Friday, which begins at 7 p.m. ET and has the last tip at 10:30 p.m. ET.   There are a number of high quality options in the NBA DFS player pool to build your daily Fantasy basketball lineups around. Stars like Jamal Murray, Tyrese Maxey, James Harden, Devin Booker, Kawhi Leonard, Jaylen Brown, Jalen Johnson, Paolo Banchero and Joel Embiid are in action, so you certainly have plenty of directions to go with NBA DFS picks. Finding someone who can outperform his price tags on sites like FanDuel and DraftKings is key to that and to constructing a winning NBA DFS strategy.  Chet Holmgren (leg), Isaiah Hartenstein (calf), Shai Gilgeous-Alexander (ankle), Ja Morant (calf), Jalen Green (hamstring) and Franz Wagner (ankle) are among those who are out for tonight. That means there are several players who could make a difference in their absences. Who should find their way into your daily Fantasy basketball lineups? Before making any NBA DFS picks, be sure to check out the NBA DFS advice, player rankings, stacks, and top daily Fantasy basketball picks from SportsLine's Mike McClure.New users can also target the DraftKings promo code, which offers $300 in bonus bets if your initial $5 bet wins:McClure is a DFS professional with more than $2 million in career winnings. He's also a predictive data engineer at SportsLine who uses a powerful prediction model that simulates every minute of every game 10,000 times, taking factors like matchups, statistical trends and injuries into account. This allows him to find the best NBA DFS values on sites like DraftKings and FanDuel and create optimal lineups that he shares only over at SportsLine. They're a must-see for any NBA DFS player.McClure has turned his attention to NBA action on Friday and locked in his top daily Fantasy basketball picks. You can only see them by heading to SportsLine.Top NBA DFS picks for Friday, January 9For Friday, one of McClure's top NBA DFS picks is Wizards power forward Bub Carrington at $4,900 on DraftKings and $5,500 on FanDuel. The second-year veteran has shown flashes of brilliance this season. In Wednesday's 131-110 loss at Philadelphia, he scored 18 points, while dishing out seven assists and grabbing three rebounds. He had 20 points, five rebounds and five assists in a 114-113 win over Milwaukee on Dec. 31.Washington has won three of its last five games in part to Carrington's play. In 36 games this season, including 12 starts, he is averaging 9.5 points, 4.4 assists and 3.8 rebounds in 27.2 minutes of action. He is connecting on 40.1% of his field goals, including 42.5% of his 3-pointers, and 71.4% of his free throws. New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:Another part of McClure's optimal NBA DFS strategy includes stacking Carrington with power forward Justin Champagnie ($4,800 on DraftKings and $5,700 on FanDuel). The fourth-year veteran is averaging 6.6 points in 34 games played, including nine starts. He had 17 points, three assists, three rebounds and two blocks in a 120-112 win over Orlando on Tuesday. In a 119-99 win over the Brooklyn Nets on Jan. 2, he scored 20 points and grabbed seven rebounds in 25 minutes. The Wizards have a favorable matchup with the New Orleans Pelicans, who have the 28th ranked scoring defense, which allows 122.7 points per game. See McClure's other NBA DFS picks right here.How to set your NBA DFS lineups for Friday, Jan. 9McClure is also targeting a player who could go off for massive numbers on Friday because of an optimal matchup. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is here.Who is DFS pro Mike McClure putting in his optimal NBA DFS lineups for Friday? Visit SportsLine now to see optimal NBA DFS picks, rankings, advice, and stacks, all from a professional DFS player who has over $2 million in career winnings, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA DFS picks, Friday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/45202b06-4847-4936-9b58-04cdd3c5d841/thumbnail/1200x675/a49efc4e9934db996d56c7dbd8134733/bub-carrington-cbs.jpg"
      ],
      "datePublished": "2026-01-09T15:54:13.000Z",
      "dateModified": "2026-01-09T15:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals College Football Playoff semifinal picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-playoff-semifinal-picks-odds-best-bets-predictions-model-backing-oregon-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/c0e7598b-c26b-453d-b1a3-186519e36be9/thumbnail/1200x675/064b5d498501572fd97e1231243996dd/fernando-mendoza-indiana-hoosiers-2.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:34:42.000Z",
    "description": "\n        A trip to the national championship is on the line when the College Football Playoff semifinals continue on Friday. The No. 1 Indiana Hoosier",
    "body": "\n        A trip to the national championship is on the line when the College Football Playoff semifinals continue on Friday. The No. 1 Indiana Hoosiers take on the No. 5 Oregon Ducks at 7:30 p.m. ET in a Big Ten battle, with the winner advancing to take on Miami. The Hoosiers won the first meeting of the season, 30-20, and Indiana is favored by 3.5 points this time around. The over/under for Indiana vs. Oregon is 48.5 points, up two from the opening line. Before locking in your College Football Playoff semifinal picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also target the latest DraftKings promo code, which offers $300 in bonus bets if your first $5 bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:College football best bets for CFP semifinals (odds subject to change): Oregon (+3.5) vs. IndianaOregon vs. Indiana: Under 48.5 pointsBet it now at Caesars Sportsbook: Oregon (+3.5) vs. IndianaBoth defenses were disruptive in the quarterfinals, with Oregon posting a shutout against Texas Tech and Indiana holding Alabama to just three points. These two foes squared off on Oct. 11, with Indiana walking away with a 30-20 victory on the road. Oregon has reeled off eight consecutive wins since then, and the Ducks are 4-1 against the spread in their last five games. According to the model's projections, Oregon suffers a 24-22 defeat, but the Ducks cover the spread 54% of the time. Bet on Oregon vs. Indiana at FanDuel Sportsbook, where new users can bet $5, get $300 in bonus bets if your bet wins. Indiana vs. Oregon: Under 48.5 pointsBoth of these defenses have been playing spectacularly in recent weeks. Oregon has given up 16 or fewer points in six of its past eight games, which includes shutting out Texas Tech in the quarterfinals, while Indiana has conceded 10 points or fewer in six of its last seven contests. These two teams combined to go 8/28 on 3rd-down conversions in the first meeting, and SportsLine's model is projecting another defensive battle as these teams combine for 46 points on Friday, helping the Under hit in 59% of simulations. Bet on Indiana vs. Oregon at bet365, where new users can get $200 in bonus bets after placing a first wager of $5 or more.Want more college football picks?You've seen the model's College Football Playoff semifinal best bets. Now, get against the spread, total and money line picks for every game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals College Football Playoff semifinal picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/c0e7598b-c26b-453d-b1a3-186519e36be9/thumbnail/1200x675/064b5d498501572fd97e1231243996dd/fernando-mendoza-indiana-hoosiers-2.jpg"
      ],
      "datePublished": "2026-01-09T15:34:42.000Z",
      "dateModified": "2026-01-09T15:34:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoffs: One reason why every team can (and can't) win Super Bowl XL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoffs-one-reason-why-every-team-can-and-cant-win-super-bowl-xl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/02/13/63fc8a6d-8cba-4934-a34e-98a44c875105/thumbnail/1200x675/f5e9b855784d23bcd4a285e6b1a3e1f6/getty-kyle-shanahan-49ers.jpg",
    "tag": "Sports",
    "date": "2026-01-09T16:09:24.000Z",
    "description": "\n        The path west for Super Bowl LX is now clear. After 18 weeks of regular season football, 14 teams are left standing to raise the Lombardi tro",
    "body": "\n        The path west for Super Bowl LX is now clear. After 18 weeks of regular season football, 14 teams are left standing to raise the Lombardi trophy in what has been one of the wildest seasons I can remember. From the Kansas City Chiefs and Baltimore Ravens missing the playoffs to the rise of teams like the Chicago Bears and Jacksonville Jaguars, the stories this season were plentiful. But now we've reached the playoffs, and every team has a chance at winning the whole thing (yes, even the Panthers). So let's give out one reason why every team can win the Super Bowl, and one reason why they could fall short.AFC\n                            \n    \n                                                \n                    \n    Denver BroncosCAN: The defense takes over gamesThe Denver Broncos have a lot going for them as they enter the playoffs. They have one of the best offensive lines in football, a great playcaller in Sean Payton and home field advantage throughout the entire AFC bracket. However, if this team is going to win a Super Bowl, the defense is going to need to live up to its billing as one of the best units in football from top to bottom. Through the first ten weeks of the season, the Broncos defense looked like it was on pace to be one of the best units in modern history: second in defensive EPA per play, first in defensive success rate and tied with the Houston Texans for the lowest Points per Drive given up. However, it hasn't exactly been a photo finish for the Broncos defense. Since week 11, the Broncos dropped to 13th in defensive EPA per play and 12th in Points per Drive allowed. Now this isn't a major cause for concern, but I do think for this team to raise a Lombardi the defense has to find their mojo from the first 10 weeks. If they can get havoc plays from a star-studded defensive line plus CB Patrick Surtain II on the back end, it's going to be hard to move the ball on this team.\nCAN'T: Lack of a run game puts too much on Bo Nix's shouldersThe Broncos offense has been sort of a seesaw this season. Allow me to explain: in the beginning of the year, while Bo Nix was playing poorly, it was the run game (specifically RB JK Dobbins) that helped keep the Broncos afloat on that side of the ball and Nix was able to find a groove late in games. But after Dobbins got hurt, everything sort of flipped. Nix has been playing fairly well, but the run game concerns me a lot without Dobbins. The Broncos' Success Rate running the football drops four percent without Dobbins in the backfield, and their EPA per carry goes from 0.05 to -0.04. For context, that would be like going from the Chicago Bears run game … to the Carolina Panthers. Without the effectiveness of the ground game, I worry that too much gets put on Nix's shoulders in a playoff environment. As I said before, Nix has played fairly well, but he's made some boneheaded plays lately that could be the difference between moving on and going home. In addition, this isn't really the receiver group that can bail out mistakes the way most teams can.Maybe the run game gets kicked into gear by using Nix as a runner more often, but if they can't it'll be a long road uphill for Denver.\n        \n            \n                2026 NFL playoff bracket picks: Expert predictions for who will win Super Bowl LX\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    New England PatriotsCAN: Drake Maye remains razor efficientPart of what makes Drake Maye's MVP-caliber season so awesome is that he's remained razor efficient and sharp while also being aggressive downfield. He leads the NFL in EPA per dropback while also being tied with Rams QB Matthew Stafford in Air Yards per Attempt. His efficiency on deep passes help open up lanes in the run game for the Patriots, where they have a home run hitter in Treveyon Henderson and RB Rhamondre Stevenson, who put together the best game of the season in the finale against the Dolphins. On top of that, his most underrated trait is how he's grown in sack avoidance to keep the offense on the field. He's lowered his sack rate this season and has been one of the most effective scramblers in the NFL. Entering the playoffs, it's really hard for QBs to remain as efficient throwing the ball downfield given the variance that comes from downfield sideline shots like Maye chooses to throw. However, given that there's an entire season of his work taking the top off a defense, I'll buy into his ability to stretch the field and keep the Patriots offense explosive.\nCAN'T: Milton Williams isn't back to 100%If there's anything that has stood out aside from Drake Maye-nia this season for New England, it's that Milton Williams was worth every dollar the Patriots paid him. He finished with a 12.6% Pressure Rate, third in the NFL among DTs behind teammate Christian Barmore and the Titans' Jeffrey Simmons and that was even while missing games with a high ankle sprain. That ankle sprain is also why I have a little bit of concern for the Patriots, however. Per TruMedia, with Williams on the field, the Patriots have almost a 62% Defensive Success Rate on the ground, give up 1.13 Yards before Contact per rush and 0.06 defensive EPA per play. Without Williams, the Defensive Success Rate drops to 59%, and their Yards Before Contact per rush goes up to 1.66. Williams' athleticism and ability to get upfield in a hurry is such a big boost to this team, and allows the Patriots to both be versatile and play their pass rushing EDGEs more often because Williams is a force against the run as well. If Williams isn't healthy through this playoff run, their ability to defend the run becomes much more compromised, and the defense comes apart.\n                            \n    \n                                                \n                    \n    Jacksonville JaguarsCAN: Explosive plays on offenseDuring this Jacksonville hot streak to finish the season, their ability to generate explosives on both sides of the ball has really stood out. Since week 12 the Jaguars' 12.7% Explosive Play Rate (passes over 16 yards and runs over 12 yards) is sixth in the NFL and their 35 plays of 20+ yards are good for fourth in the NFL. A large majority of this is through the air, where the addition of WR Jakobi Meyers has not only allowed the offense to be more efficient, but with everyone in more streamlined roles, the explosives are coming through in bunches. They've also been able to find a lot of efficiency when attacking the middle of the field and QB Trevor Lawrence has been absolutely shredding on middle of the field targets. Since week 10, Lawrence has a 0.43 EPA per attempt over the middle of the field, sixth in the NFL among QBs with at least 150 dropbacks. With the full cadre of receiving talent and Liam Coen pulling the strings, this offense can hang explosive plays on anyone at the drop of a hat.CAN'T: Interior pressure breaks the offenseIf the Jaguars have struggled anywhere this season, it's through the spine of the offense. Center Robert Hainsey has been in and out of the lineup with an injury, and if RG Patrick Mekari can't go on Sunday it'll be former starting tackle Walker Little at guard. In the games Jacksonville has lost to premier teams (Seattle, Los Angeles Rams, Houston), the interior offensive line couldn't generate enough push in the run game and also was overwhelmed by pressure up front. I think Coen has managed to mitigate some of the interior pressure over this final stretch of the season, but when Lawrence has been at his worst it's been because the pressure breaks down up the interior of the offensive line. This also bleeds into their run game issues they've had despite this strong stretch of play. Their rushing success rate since week 12 is 31st in the NFL and only the Raiders have a lower EPA per carry over that same timespan. A large part of that is the injuries to Hainsey and Mekari, but if the Jaguars can't get anything going between the tackles, offense gets a lot harder during this playoff run.\n\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersCAN: Every game can be a Mike Tomlin gameWe all know a Mike Tomlin game. The grittiest, grimiest, knockdown dragout rock fight you've ever seen, one that makes you both yearn for the football of yesteryear and also wish this Steelers team would get launched into the sun. For this version of the Steelers to make the Super Bowl, they'll have to get consecutive Mike Tomlin masterclasses. I've honestly loved what they've done to finish the regular season defensively, changing their personnel and molding from a very rigid, single-high defense to being more flexible and moving Jalen Ramsey back to safety. Their defensive line play has really improved with DT Derrick Harmon coming back, and DT Cam Heyward is aging like fine wine. They can kick butt up at the line of scrimmage, and when they unleash EDGE Nick Herbig on passing downs, it's truly a sight to behold. With Herbig on the field, their Pressure Rate of 39.6% would be third in the NFL and their Sack Rate of 8.1% would be fifth. Off the field, those numbers drop to 36.2% and 5.9% respectively. If the Steelers defense can get a few opportune turnovers and some good breaks, I think they can make any offense's life hell.CAN'T: There's no other receiver who can win downfieldThe problem with building the entire boat out of YAC is that when you're not creating after the catch the offense becomes neutered. Outside of the returning DK Metcalf, which receiver for the Steelers makes you worry when thrown the ball downfield? 35-year-old Adam Thielen? Calvin Austin? Maybe if TE Jonnu Smith and Rodgers could ever be on the same page I would have more faith, but this Steelers receiving core feels like it's on shaky ground, and the playoffs are where shaky ground crumbles. There's nobody on the roster who can create consistent separation outside of Metcalf, and if Rodgers is forced to create at 42 years old that feels like a win for the defense. The Steelers' offense remains their Achilles heel, and if they bow out early once again in the playoffs, it'll be because nobody could win on actual downfield targets.\n                            \n    \n                                                \n                    \n    Houston TexansCAN: The defense can go on a historic runThe Houston Texans have the ability to do something really special in the playoffs: they can go and win a Super Bowl despite having some of the most questionable offensive play that I've ever seen. Their ability to turn every game into a slugfest truly might be their greatest quality this season; with the defensive line that they have combined with two stars at cornerback, there's not really much you can do to attack this defense. One area that I think doesn't get talked about enough for this team is how much they've improved against the run this season. They've improved their Defensive Success Rate on the ground and shored up some of their issues they had against teams that would run a lot of trap and gap scheme runs at them through the play of DT Tommy Togiai and others on the interior. They're forcing punts at a much higher clip than any previous season under HC Demeco Ryans and with stars such as EDGEs Will Anderson Jr and Danielle Hunter, CBs Derek Stingley Jr and Kamari Lassiter plus emerging star S Calen Bullock, good luck trying to move the ball on this team.\nCAN'T: The offensive explosives run outTo say this season has been a struggle for the Texans' offense would be an understatement, but I think they started to find something with the way they've hunted explosive plays since QB CJ Stroud re-entered the lineup. His Air Yards per attempt has gone up to eight yards since week 13 (top ten mark in the NFL), and the Texans have seemed to lean into max protection and letting Stroud hunt big plays with WRs Nico Collins, Jayden Higgins and Jaylin Noel. The worry for this team is that if those explosives run out, can Stroud will this team to some down to down efficiency? They still don't generate much on the ground, and if the splash plays aren't hitting this offense could go into a major fog. The defense can obviously win them a lot of games, but if the offense can't hit a couple of haymakers to give their defense a lead I worry about their ability to win a Super Bowl.\n                            \n    \n                                                \n                    \n    Buffalo BillsCAN: Their ground and pound gameThe Bills' biggest strength going into the playoffs is twofold: their QB Josh Allen, and an offensive line and run game that can grind any defense into paste. Their offensive shift over the last few years has led to this: an offense that is built through the ground game and their QB making plays when he needs to. NFL rushing leader James Cook can also hit the explosives that the Bills offense needs to keep defenses honest: his 39 runs of over 10+ yards are only one behind Miami's DeVon Achane for the NFL lead this season, and Allen himself can also take over games on the ground when he needs to. With the defense built to play with a lead and an offense that can ball control their way to victory, if the Bills want to get to a Super Bowl it'll be through their monster efficiency and explosiveness on the ground.CAN'T: They run out of ways to hide their receiving corpsRemember that stat I said about the Steelers being first in the NFL in percentage of yards coming after the catch? Yeah, well the Bills are third, and they do it in a different way than the Steelers. Buffalo doesn't have the separators at receiver like many other teams; I'd argue their best separator is TE Dalton Kincaid. However, what OC Joe Brady does is scheme them open via motions and bunches and trying his best to make a receiver core that lacks winners look presentable. However, come playoff time you need someone that's going to go and get you a bucket, and the worry for Buffalo is that all the ways Brady can draw up mesh are going to run out and someone has to win in a man coverage situation. I don't think the Bills have that guy on the roster right now, so if they end up bowing out early, blame their inability to win in those areas.\n\n                            \n    \n                                                \n                    \n    Los Angeles ChargersCAN: The defense puts a vise grip on explosive playsWhen the Chargers defense is at their best, they can limit explosives downfield. They communicate incredibly well on the back end, and what they might lack in pure stardom outside of DB Derwin James they make up for with being in sync with each other like the boy band. Los Angeles finished the regular season fourth in percentage of explosive passes allowed, and their quarters defense allows themselves to put offenses in a sleeper hold. They want you to take checkdowns or else you risk putting the ball in harms way. Combine that with a feisty pass rush and a great defensive coordinator in Jesse Minter and you get a pretty clear picture of how this Chargers team can go from the 7 seed to the Super Bowl.CAN'T: The offensive line betrays Justin Herbert one final timeI mean have you seen who's starting on this line? Joe Alt and Rashawn Slater aren't walking through that door come playoff time, and if you have to bet on Austin Deculus, Bobby Hart or Trevor Penning to be Justin Herbert's blindside protector in a playoff scenario I would just be ready to see Herbert on the ground a LOT. Since Alt went out with an ankle injury that needed surgery, the Chargers have allowed a 44.1% pressure rate, third-highest in the NFL--and that somehow feels low considering how often Herbert is running for his life. Now, Herbert has made a way to make chicken salad out of it, attacking downfield when pressured (10 TDs under pressure is tied with Drake Maye for first in the NFL). But against real pass rushes in the playoffs, the biggest worry is that Herbert might get crushed, also crushing the Chargers' Super Bowl hopes.NFC\n                            \n    \n                                                \n                    \n    Seattle SeahawksCAN: The defense continues their dominant runThe Seahawks, Broncos and Texans are all trying to prove that defense wins championships, but statistically Seattle has been the best team in the NFL. You name a category and the Seahawks are at least top 3 in it: first in Points Per Game allowed, first in Points Per Drive allowed, first in Defensive EPA per play against the run, third in run defense success rate, third in overall EPA per play allowed. Head coach/lead defensive playcaller Mike Macdonald is a schematic wizard, poking holes in an offense's ability to be explosive against them, while also having one of the deepest and strongest defensive lines in the league. That's where this all starts for the Seahawks, a rotation of DTs Leonard Williams, Byron Murphy and Jarran Reed plus heavy handed EDGEs in Demarcus Lawrence, Uchenna Nwosu, Derick Hall and Boye Mafe. That group sets the tone for the defense, and if they can continue to take over games, this team can get to the Super Bowl.\nCAN'T: Sam Darnold pumpkin ball returnsThis is the biggest worry for the Seahawks going into the playoffs. Sam Darnold has the ability to win them games with his downfield aggression and penchant for explosive plays as a pocket passer, but can also throw the Seahawks out of games with boneheaded interceptions and negative plays. Over the second half of the season, Darnold's Turnover Worthy Throw rate has doubled and he's thrown eight interceptions since week 11, third most in the NFL over that timespan. For the Seahawks to truly reach the heights that they want to, Darnold needs to know when to fold and when to press when it comes to his downfield passing. The Seahawks offense doesn't have the firepower outside of WR Jaxon Smith-Njigba to make Darnold right in most cases, so Darnold has to better toe the line between bold and reckless.\n                            \n    \n                                                \n                    \n    Chicago BearsCAN: The offense can score with anybodyThe Bears have one of the most electrifying offenses in the NFL right now. With their ability to both grind out successful runs (third in the NFL in Rushing Success Rate) or create explosives as a rushing offense (t-3rd in EPA per rush) they cause so many problems defending them consistently. With both TEs Colston Loveland and Cole Kmet on the field however, this offense can truly force the defense to choose how they want to defend them. If they're worried about the explosive passing (Williams is eighth in the NFL in Air Yards per attempt out of 12 personnel) then the Bears can just gash teams on the ground, but if you want to load up to stop the run, Chicago can force you into trying to defend their matchup nightmares downfield. Williams has also improved quite a bit since his rookie season. He's taken much less sacks (albeit the throwaways can be a little annoying) and his processing has taken a big leap forward. While not being a finished product, the fact that the Bears offense can put up points in bunches is why they can win it all.CAN'T: The defense's turnover luck runs outYes, the Bears lead the NFL in takeaways. No, I'm not trying to water that down or rain on the parade, but I am going to say that turnover variance hits meaner than a Terence Crawford hook. If the Bears aren't forcing turnovers defensively, they're susceptible to big plays in the run game and passing game. Despite leading the NFL in takeaways, they're near the bottom of Havoc Rate in the NFL, meaning they're not generating TFLs, pass breakups or sacks at nearly a high enough rate. The lack of pass rush has really been a thorn in their side this season, finishing the regular season 27th in pressure rate and 25th in total pressures. EDGE Montez Sweat leads the team in sacks, but it feels like their pass rush can go through spurts of not being able to affect the QB in any way. If they can't get turnovers at a high rate, they could end up out of the playoffs entirely.\n\n                            \n    \n                                                \n                    \n    Philadelphia EaglesCAN: One of the most talented defenses in football makes every game a rock fightThis has been the M.O. for the Eagles the entire season. The Eagles' defense is so good they give the offense enough times at bat to at least put up some points, and for the most part that side of the ball has lived up to the billing. This Fangio defense might have more talent than the one that won the Super Bowl last season, with impact players at every level of the defense. DTs Jordan Davis, Jalen Carter and Moro Ojomo make it hard for offenses to run the football and also bat passes at a high rate, slowing the momentum of the offense. They're just above average in pressure rate, but since acquiring EDGE Jaelan Phillips their pressure rate has jumped up to almost 41%, good for a top ten mark in the NFL during that time period. CBs Cooper DeJean and Quinyon Mitchell have played like All-Pros this season and Fangio weaponizes his defense to work as a constrictor and also force offenses into mistakes. They want you to check it down, then rally and tackle. It's not out of the realm of possibility that the Eagles' defense goes on a tear like they did in 2024, finding their way back to the big game.CAN'T: The offense takes too long to flip the switchFor weeks, the Eagles' offense has talked about flipping a proverbial switch, or pressing a button to turn the offense back into the juggernaut that they were last year. I'm of the belief that the switch they plan on flipping isn't real. The one thing that would save this offense would be offensive linemen Landon Dickerson, Cam Jurgens and Lane Johnson getting healthy and a new offensive coordinator, but neither of those things are happening at this point in the season. Maybe the button they plan on pressing is using QB Jalen Hurts more in the run game; his designed rush rate is the lowest it's been in his entire career, per TruMedia. Without the RB runs being as effective as they were last year, Hurts has to be a factor in the run game for the Eagles to force opponents out of the two high shells they've seen this season. On top of that, the passing game just feels disjointed, as if they're running two separate offenses in one game. The lack of play action has been confusing for the Eagles having one of the biggest run threats in the NFL, but overall this offense is what it is by this point of the season. If the Eagles don't repeat as champions, it's because they couldn't flip that switch.\n                            \n    \n                                                \n                    \n    Carolina PanthersCAN: The offense shortens gamesThe road to the Super Bowl feels like a longshot for the Panthers, but I do think there's a way they can make the big game. It revolves around the offense staying on the field and being money on high leverage downs. The Panthers in the regular season had an average third down distance of 6.8 yards, but their conversion rate is 25th in the NFL. In their wins this season, their third down conversion rate jumps to 38.6% and they're 16/19 on 4th down in their wins. In losses, their third down conversion rate drops to 33.7% and are 11/21 on 4th down. In their wins, the Panthers have a blistering 0.3 EPA per play on money downs and a 45.8% Success Rate. For context, that EPA per play would be fourth in the NFL and their Success Rate would be seventh. I know it might sound cliche to say win on third and fourth down, but the Panthers NEED to shorten games and use their brutally efficient run game to control the time of possession. Their run game is capable of mowing defenses down, and we've seen Bryce Young come through in big moments. The clutch gene has to be in the Panthers for them to make it to Santa Clara.\nCAN'T: Their pass rush remains nonexistentCarolina's pass rush this season has been more of a suggestion than a requirement. They're dead last in pressure rate this season and 27th in sack rate. There's only one player on the Panthers with at least 75 pass rush snaps with a double digit pressure rate (EDGE Patrick Jones II has a 13.2% pressure rate, but also missed the rest of the season with a back injury that needs surgery). Among the active defensive linemen for the Panthers, their leading pressure rate man is rookie EDGE Nic Scourton…at 9.2%. Panthers' DC Ejiro Evero doesn't really lean into blitzing, often relying on his defensive line to win late or the QB throws a pass into tight coverage. With a toothless pass rush, I worry about the Panthers' ability to get off the field, especially when it comes to the offenses they'll see in the playoffs.\n                            \n    \n                                                \n                    \n    Los Angeles RamsCAN: The Rams offense continues to be an efficient buzzsawThe Rams offense is one of the most efficient and successful offenses not only this year, but one of the most brutally efficient teams we've seen in a long time. Since 2010, only four teams have a higher offensive success rate than the Los Angeles Rams: the 2011 New Orleans Saints, 2011 New England Patriots, 2020 Buffalo Bills and 2018 New Orleans Saints. If you want to go by EPA per play, this year's Rams are 25th. But they can move the ball better than ever, largely because they can force teams into base defense with their 13 personnel. It's been talked about a lot at this point how effective the Rams are when they get three tight ends on the field to throw the ball, but the Rams have also been one of the most efficient offenses on the ground in the NFL. RBs Kyren Williams and Blake Corum aren't super explosive, but they can grind out five yard carries that force the defense to respect their run game. Since 2010, there hasn't been a run game with a higher success rate than the Rams and because of that they can attack downfield out of their 13 personnel. QB Matthew Stafford has been masterful this season, and all of the tight ends have taken advantage of the attention WRs Puka Nacua and Davante Adams have draw. If the Rams win the Super Bowl, it'll be on the backs of one of the most efficient offenses we've seen in 10+ years.CAN'T: The secondary can't make a playWhen the Rams have been struggling on the defensive side of the ball, it hasn't been because of the lack of pass rush. For the most part, their defensive line has shown up in almost every game they've played. However, they have struggled in the secondary at times. Defensive coordinator Chris Shula has drawn blood from a stone for most of the season, but they've struggled against some of the premier wide receivers. Detroit Lions' wideout Amon-Ra St. Brown had an absurd 3.90 Yards per Route Run against the Rams, Eagles' receiver AJ Brown finished at 3.03. Arizona Cardinals' wide receiver Michael Wilson came in at 3.46 Yards per Route Run for a moribund team against the Rams. While CB Emmanuel Forbes has been one of the best stories of the season, against bigger receivers he can get dunked on, and that's the worry with this Rams team. They'll get dunked on in pass coverage if you can get the ball out quickly. This linebacker corps isn't the greatest in coverage, so they have to ask safeties Kam Kinchens and Kam Curl to hammer hard on all digs, leaving the outside corners susceptible to big plays. The Rams may be the favorite to win the Super Bowl, but if they don't it'll be because the secondary falls apart.\n\n                            \n    \n                                                \n                    \n    San Francisco 49ersCAN: Kyle Shanahan pulls another rabbit out of his hatWhat Kyle Shanahan has done this season has to be discussed more. While missing LT Trent Williams, TE George Kittle, WRs Ricky Pearsall, Jauan Jennings and Brandon Aiyuk and QB Brock Purdy this season, the 49ers still finished the season with a blistering 0.07 EPA per play. Once Brock Purdy came back however, that's when the offense really took off. During that time period, the Niners had a 0.11 EPA per play (3rd), 48.8% Success Rate (7th) and 3.04 Points per Drive (1st). Shanahan has found a way to get some efficiency out of a ground game that's lacked bite up front outside of Williams and been so efficient over the middle of the field, using McCaffrey as a decoy. For the Niners to win the Super Bowl, Shanahan will have to pull off one of his greatest coaching feats yet, getting this M.A.S.H. unit on both sides of the ball to keep up the efficiency while going up against the MonStars of the conference.CAN'T: The defense runs out of bodiesLook man we're already on Kyzir White and Eric Kendricks at linebacker at this point. The Niners undoing this season is going to be what it's been since EDGE Nick Bosa and LB Fred Warner went down with season-ending injuries. If the Niners don't make the Super Bowl it'll be because they just don't have anyone left to play on defense. They're already cutting it close with their pressure plan; led by Bryce Huff and…I guess Sam Okuayinonu at this point, they can't get pressure without blitzing. The problem is defensive coordinator Robert Saleh might not trust his secondary to play man coverage and if the pressure doesn't get home then the Niners are out of luck. On top of that, their run game also has been inconsistent, relying on rookie DT Alfred Collins and Kalia Davis to hold gaps. Without their impact splash players on the field, I worry that the Niners defense just runs out of players to keep throwing at their defensive issues.\n                            \n    \n                                                \n                    \n    Green Bay PackersCAN: Jordan Love can go Super SaiyanI know it's a controversial opinion, but: Packers' QB Jordan Love is a good QB. According to Sumer Sports, Love finished the regular season second in EPA per play and ninth in the NFL in Success Rate, despite at points missing WRs Jayden Reed and Christian Watson, TE Tucker Kraft and OL Elgton Jenkins and Zach Tom. His command of the offense has grown in spades this season, where he's now finding ways to beat pressure looks before the snap with changing the protection and play before continuing to attack downfield. I still think he invites a lot of pressure on himself with the way that he plays, but if the Packers are going to win the Super Bowl, they have to let Jordan Love cook. The Packers don't really throw the ball on early downs (51.2% Early down pass rate, 20th in NFL), but letting Love air it out could help them remain explosive as Josh Jacobs hammers opponents. This will have to be a Jordan Love run for the Packers to win the Super Bowl.CAN'T: The defensive line doesn't have enough juiceWhen EDGE Micah Parsons and DT Devonte Wyatt left the lineup with season-ending injuries, the Packers' pass rush went with them. Parsons led the team in quick pressures this season with 33, nobody else on the team had more than nine. The Packers' defense is built on Parsons and Wyatt's quickness and ability to wreak havoc in both the run and passing game, and without them the team quickness goes down drastically. Yes, EDGEs Lukas Van Ness and Rashan Gary both ran 40-yard dashes under 4.6 seconds, but they're not laterally quick or explosive, and can't really close distance the way that Parsons or Wyatt can. Even with Wyatt they were thin at defensive tackle and lacked size, so now they'll have to overcompensate by sending LBs Edgerrin Cooper and Quay Walker to affect the QB. Cooper is the Packers' best coverage LB so then everything falls apart after that, and DC Jeff Hafley runs out of answers. Without Parsons, the Packers' road to Santa Clara gets a lot murkier, and could be the reason they're sitting at home.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoffs: One reason why every team can (and can't) win Super Bowl XL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/02/13/63fc8a6d-8cba-4934-a34e-98a44c875105/thumbnail/1200x675/f5e9b855784d23bcd4a285e6b1a3e1f6/getty-kyle-shanahan-49ers.jpg"
      ],
      "datePublished": "2026-01-09T16:09:24.000Z",
      "dateModified": "2026-01-09T16:09:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions, best bets today: This Friday parlay returns over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-friday-january-9-basketball-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/b87ec697-5ada-4cb9-8655-8826fc12d7b0/thumbnail/1200x675/db054e251229e9cfd5759e410a2a3205/jalen-johnson-atlanta-hawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T13:44:46.000Z",
    "description": "\n        Friday's NBA schedule features a 10-game slate. Among the notable NBA odds include Raptors vs. Celtics (-8.5), 76ers (-2.5) vs. Magic, Thunde",
    "body": "\n        Friday's NBA schedule features a 10-game slate. Among the notable NBA odds include Raptors vs. Celtics (-8.5), 76ers (-2.5) vs. Magic, Thunder (-4.5) vs. Grizzlies, Hawks vs. Nuggets (-1.5), Knicks (-1.5) vs. Suns and Bucks vs. Lakers (-3.5). Portland looks to extend its winning streak to five games, while New Orleans looks to snap a nine-game losing skid.  What are the NBA best bets for Friday, and which combination of picks should you target in a Friday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Friday, Jan. 9After simulating every game 10,000 times, the model is backing the Atlanta Hawks (+1.5) to cover the spread against the injury-depleted Nuggets at Denver at 9 p.m. ET. The Hawks have lost nine of the past 10 against the Nuggets. Denver won the last meeting 134-133 on Dec. 5. Denver will be without Jonas Valanciunas (calf), Nikola Jokic (knee) and Cameron Johnson (knee). \nThe model is projecting six Hawks players to score 11.5 points or more, led by Jalen Johnson's 25.4 points. The Nuggets meanwhile, are projected to be led by Jamal Murray's 26.3 points as five Denver players score 10.2 points or more. The model is backing Atlanta as it has this as a one-possession game, which allows the Hawks (+1.5) to cover with points to spare. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Friday, Jan. 9The model also has locked in two more picks, including another bet that nearly 70% of the time. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Friday, and which best bets should you target for a chance at a payout of over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions, best bets today: This Friday parlay returns over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/b87ec697-5ada-4cb9-8655-8826fc12d7b0/thumbnail/1200x675/db054e251229e9cfd5759e410a2a3205/jalen-johnson-atlanta-hawks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T13:44:46.000Z",
      "dateModified": "2026-01-09T13:44:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Wild Card Weekend picks, AI-generated score predictions, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-wild-card-weekend-2026-playoff-picks-ai-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/72d869f5-a938-4132-8b32-ead14c317864/thumbnail/1200x675/756ea6d0f61778e836b29d43e8c88035/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T13:36:09.000Z",
    "description": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston T",
    "body": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston Texans and Pittsburgh Steelers. Monday's matchup will pit quarterback C.J. Stroud and the Houston Texans against 21-year veteran Aaron Rodgers and the Pittsburgh Steelers. The Texans are favored by 3 points at DraftKings Sportsbook, with the over/under at 39.5, as the two teams will meet in the postseason for the first time ever.Sunday's other largest spreads include Rams (-10.5) vs. Panthers, 49ers vs. Eagles (-5.5) and Chargers vs. Patriots (-3.5). The smallest spreads in Wild Card Weekend include Packers (-1.5) vs. Bears and Bills (-1.5) vs. Jaguars. Before making any 2026 Wild Card Weekend NFL picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Wild Card Weekend NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all six games. You can only see the AI predictions for the 2026 Wild Card Weekend NFL schedule here.Top 2026 Wild Card Weekend NFL AI picksAfter analyzing every game in Wild Card Weekend, the AI says the Steelers (+3, 38.5), who outlasted Baltimore in Week 18 to win the AFC North, cover in a tight loss. \nThe Texans have gone over in three of their last four games, while the over has hit in four of the last five Steelers games. Pittsburgh has won four of the last six meetings with Houston and is expected to cover in a close game. The Steelers, who will get receiver DK Metcalf back from suspension, are looking to win their first playoff game since reaching the AFC Championship Game in 2016. Houston won the last meeting, 30-6, on Oct. 1, 2023. SportsLine AI rates the Steelers as a B money line pick and also predicts a 22-21 Texans win on average. See its other 2026 Wild Card Weekend football predictions and football picks at SportsLine, and bet the Steelers at DraftKings here:\nHow to make 2026 Wild Card Weekend NFL picksIn addition, the AI PickBot has generated three highly-coveted A picks for 2026 Wild Card Weekend. You need to see the AI's NFL picks before making any 2026 Wild Card Weekend NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 Wild Card Weekend NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Wild Card Weekend picks, AI-generated score predictions, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/72d869f5-a938-4132-8b32-ead14c317864/thumbnail/1200x675/756ea6d0f61778e836b29d43e8c88035/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T13:36:09.000Z",
      "dateModified": "2026-01-09T13:36:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rams vs. Panthers prediction, odds, time, spread: 2026 Wild Card Weekend NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-panthers-prediction-playoff-odds-spread-time-nfl-wild-card-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/822c3c5d-f4c3-4d63-91ad-c14384726f7e/thumbnail/1200x675/9b5707791d8ca0cac442d741a82687e3/puka-nacua-los-angeles-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T12:26:33.000Z",
    "description": "\nThe 2026 NFL playoffs kick off with a Saturday Wild Card matchup between the Los Angeles Rams and Carolina Panthers. These teams met in Week 13, with",
    "body": "\nThe 2026 NFL playoffs kick off with a Saturday Wild Card matchup between the Los Angeles Rams and Carolina Panthers. These teams met in Week 13, with Carolina prevailing 31-28 at home. Los Angeles (12-5) enters Wild Card Weekend as the NFC's 5-seed and is coming off a 37-20 victory over Arizona, which ended a two-game losing streak. The Panthers (8-9) are the No. 4 seed after claiming the NFC South, though the team is coming off back-to-back losses, including falling to Tampa, 16-14, last Saturday. Rams receiver Davante Adams (hamstring) has been a full participant at practice this week and does not carry an injury designation. He's set to play for the first time since Dec. 14. Kickoff is at 4:30 p.m. ET from Bank of America Stadium in Charlotte, N.C. The latest Panthers vs. Rams odds from DraftKings Sportsbook list Los Angeles as 10.5-point favorites, making it the largest road favorite in a playoff game since 1970. The over/under for total points scored is 46. Before making any Rams vs. Panthers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Panthers vs. Rams. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Rams vs. Panthers:\nPanthers vs. Rams                                                                    spreadLos Angeles -10.5 at DraftKings SportsbookPanthers vs. Rams                over/under46 pointsPanthers vs. Rams                                                                                                                                                                                money line Rams -610 Panthers +440Panthers vs. Rams                                                                                                                                                                       picksSee picks at SportsLinePanthers vs. Rams                                                                                                                                                                          streaming Fubo (Try for free)   Why the Rams can coverNo team has a better spread record than the Rams at 12-5, which includes four covers over their last five games. L.A. is also facing a team with an 8-9 record, and teams with losing records are 2-6 in the playoffs all-time. The Rams have the league's best offense, ranking first in points, total yards and yards per play, and it's a unit that doesn't hurt itself as no one has committed fewer penalties. Matthew Stafford has two touchdowns and no interceptions in each of his last three postseason starts, and the MVP contender is riding a seven-game playoff streak with multiple touchdown passes. This season, Stafford has more TD passes (46) than Carolina has total touchdowns (35) as the Panthers rank 27th in both points scored and total yards. See which team to back at SportsLine. Why the Panthers can coverIt was just six weeks ago that Carolina upset the Rams as double-digit underdogs, forcing Stafford into three turnovers. The Panthers have 10 ATS wins as an underdog this year, the most in the NFL, and they also have a one-day rest advantage after playing last Saturday. The Rams have lost three of their last four road games, and the Panthers are decidedly more potent on offense at Bank of America Stadium. Five of their six highest point totals this year have come at home, and the most points they scored all year came versus Los Angeles in Week 13. See which team to back at SportsLine.How to make Rams vs. Panthers picksSportsLine's model has simulated Panthers vs. Rams 10,000 times and is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can only get the pick at SportsLine. So who wins Rams vs. Panthers, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Panthers vs. Rams spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rams vs. Panthers prediction, odds, time, spread: 2026 Wild Card Weekend NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/822c3c5d-f4c3-4d63-91ad-c14384726f7e/thumbnail/1200x675/9b5707791d8ca0cac442d741a82687e3/puka-nacua-los-angeles-rams-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T12:26:33.000Z",
      "dateModified": "2026-01-09T12:26:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Wild Card odds, bracket picks, score predictions: Proven expert taking Packers, Rams, Jaguars - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-wild-card-odds-bracket-picks-score-predictions-proven-expert-taking-packers-rams-jaguars/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/2ac77aa5-af76-4f95-af4c-bc46a98b57d0/thumbnail/1200x675/ea40fcf1f94b7e1c56bbda13490f7f0f/matthew-stafford-los-angeles-rams-2.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:26:59.000Z",
    "description": "\nThe 2026 NFL playoffs are here as six matchups are set to unfold over the course of Saturday, Sunday, and Monday. The latest Wild Card Weekend NFL od",
    "body": "\nThe 2026 NFL playoffs are here as six matchups are set to unfold over the course of Saturday, Sunday, and Monday. The latest Wild Card Weekend NFL odds from DraftKings Sportsbook lists the Rams at -10.5 vs. the Panthers and the Packers at -1.5 vs. the Bears on Saturday. On Sunday, the latest NFL lines have the Bills at -1.5 vs. the Jaguars, the Eagles at -5.5 vs. the 49ers, and the Patriots at -3.5 vs. the Chargers. The highest over/under on Sunday's NFL schedule is 51.5 points in Bills vs. Jaguars. A playoff edition of 'Monday Night Football' concludes the slate with the Texans favored by 3 points on the road against the Steelers. SportsLine's Eric Cohen has revealed his exact score prediction for each game to help you formulate spread, over/under, money-line and even NFL best bets as Wild Card Weekend approaches.A SportsLine expert and CBS on-air talent, Cohen has evaluated the entire NFL playoff slate and delivers score predictions and logic for each matchup. Cohen went 180-91-1 (66%) on his NFL straight-up picks this season, and was a sizzling 10-3 (77%) on his straight-up NFL playoff picks last season. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now he's turned his attention to the 2026 NFL Wild Card Weekend, studied each matchup in depth, and has revealed his exact NFL score predictions for each game. All NFL betting lines via DraftKings Sportsbook.Los Angeles Rams (-10.5) at Carolina Panthers\n\"Carolina won this matchup on November 30, 31-28, in one of the more impactful upsets for both teams in the NFL this season,\" Cohen said. \"That's not happening again. While Sean McVay's team hasn't looked great lately, they'll exact serious revenge as a double-digit road favorite on Saturday. The Panthers have absolutely no business being in the playoffs and it's going to be a wake up call to the other teams in the conference. I would be mildly surprised if this wasn't a blowout.\"Pick: Rams 34, Panthers 12Green Bay Packers (-1.5) at Chicago Bears\n\"This will be the NFC North rivals' third matchup since December 7,\" Cohen said. \"Green Bay held on by a touchdown in the first one, before blowing a 10 point lead in the final two minutes and falling in overtime. I believe that Packers coach Matt LaFleur's job is on the line. While his team makes the playoffs just about every season, they have lost four of their last five in the postseason and finished the 2025 regular season on a four game losing streak. I'm just not sure the Bears are ready for this kind of pressure, especially against a rested Green Bay team. In another thriller on Saturday night, the Packers exact a matter of revenge for the Week 16 collapse.\"Pick: Packers 23, Bears 21Jacksonville Jaguars (+1.5) vs. Buffalo Bills\n\"Winners of nine of their last 10 games, I have a hard time picking against Jacksonville at home,\" Cohen said. \"Buffalo's passing game is devoid of weapons and the Jaguars boast the NFL's top rush defense to slow Josh Allen and James Cook. While Allen and the Bills are 5-0 in the Wild Card Round since 2020, all five of those games have been at home. Trevor Lawrence has played at an MVP level since November and it will continue this weekend. The Jaguars win on a walk-off Cam Little field goal from 50-plus yards. If this result plays out as I anticipate, Sean McDermott won't be back to coach Buffalo next season.\"Pick: Jaguars 27, Bills 24Philadelphia Eagles (-5.5) vs. San Francisco 49ers\n\"With Philadelphia only giving 3.5 points on the early line, this is my favorite spread play of the Wild Card games,\" Cohen said. \"This is a matchup between the two NFC teams who have played in the last three Super Bowls, but I don't trust San Francisco's defense to hold up against the Eagles' potent receivers and Saquon Barkley on the ground. San Francisco had potentially three straight home games in front of them with a win against Seattle in Week 18. Now, after an offensive dud against the Seahawks, their season ends in disappointment in the City of Brotherly Love.\"Pick: Eagles 27, 49ers 21Los Angeles Chargers (+3.5) at New England Patriots\n\"My top play in this game is the Under 45.5 (though I may buy it up a few points in my weekend parlays),\" Cohen said. \"Both of these teams give up less than 21 points per game so don't expect fireworks. Of the Patriots' 14 wins, only three came against playoff teams (Panthers, Bills, Ravens) so they might have benefitted from a ridiculously weak schedule. Then again, the Chargers only beat two playoff teams (Broncos, Eagles), so I can't use that to their advantage. In their second playoffs under Jim Harbaugh (in two years), I think L.A. leads most of the game, with Drake Maye leading a late New England rally. \"Pick: Patriots 23, Chargers 21 Houston Texans (-3) at Pittsburgh Steelers \n\"I can't believe Aaron Rodgers found a way in the playoffs yet again,\" Cohen said. \"I have to think this is it for him either way. The Texans' defense should overwhelm the future Hall of Famer and hold Pittsburgh fairly in check. Entering the playoffs on a nine game winning streak and facing a team who I believe is a class below them, I think Houston's offense does enough to win. One betting note: Houston kicker Ka'imi Fairbairn had multiple field goal attempts in all 15 games he played in this season and hit his Over 1.5 made FGs in 14/15. Whatever the juice is, lay it in this game.\"Pick: Texans 23, Steelers 10How to get more NFL Wild Card Weekend picksSportsLine's model has simulated every Wild Card Weekend Game 10,000 times and revealed its picks. See who wins and covers the spread here, all from the model that's on a 53-37 roll on top-rated NFL picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Wild Card odds, bracket picks, score predictions: Proven expert taking Packers, Rams, Jaguars - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/2ac77aa5-af76-4f95-af4c-bc46a98b57d0/thumbnail/1200x675/ea40fcf1f94b7e1c56bbda13490f7f0f/matthew-stafford-los-angeles-rams-2.jpg"
      ],
      "datePublished": "2026-01-09T15:26:59.000Z",
      "dateModified": "2026-01-09T15:26:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks this week, Vegas odds: 2026 Wild Card expert predictions against the spread, parlay, and props - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-this-week-vegas-odds-2026-wild-card-expert-predictions-against-the-spread-parlay-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/78154dbe-8068-44b0-80fd-152d405987b4/thumbnail/1200x675/b488d78b9a6c65122917b8d215b8c793/blake-corum-los-angeles-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T14:56:34.000Z",
    "description": "\nThe 2026 NFL playoffs will begin on Saturday with a doubleheader, as the Panthers host the Rams (-10.5, 46) and the Bears host the Packers (-1.5, 44.",
    "body": "\nThe 2026 NFL playoffs will begin on Saturday with a doubleheader, as the Panthers host the Rams (-10.5, 46) and the Bears host the Packers (-1.5, 44.5). That rolls into three games on Sunday with the latest NFL odds from DraftKings Sportsbook listing the Bills at -1.5 vs. the Jaguars, the Eagles at -5.5 vs. the 49ers and the Patriots at -3.5 against the Chargers.NFL Wild Card Weekend 2026 concludes with the final 'Monday Night Football' of the year as the Steelers (+3) host the Texans. With four home underdogs in the latest NFL playoff lines, how should you formulate your best bets and NFL parlays for this playoff slate? Before locking in any Wild Card Weekend NFL picks or NFL prop bets, be sure to check out the Wild Card Weekend NFL best bets and predictions from SportsLine's red-hot Vegas experts. SportsLine has more than 40 hand-picked Vegas experts who excel in multiple spots. The NFL, however, is a strength for the site as SportsLine currently has five total experts who are on NFL runs that have returned $1,000 or more for $100 players and one who has returned more than $1,500. Anybody following their NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, with the Wild Card Weekend NFL schedule quickly approaching, SportsLine's top NFL experts are already locking in their picks. Go to SportsLine to see them all now.Top Wild Card Weekend NFL expert picks from Doug KralsteinBetter known as 'Prop Bet Guy,' Kralstein specializes in player props, and since joining SportsLine in 2024, he is up 112 units on his NFL player props. He enters NFL Wild Card Weekend on another strong run, going 54-36 (+1212) on his past 90 NFL player prop picks. This week, he is backing Los Angeles running back Blake Corum to go Over 9.5 total carries (-110) against the Panthers on Saturday. \"Corum finished the season clearing this rush attempts line in seven of his final 10 full games (and was tracking for another before leaving with an injury in the second quarter),\" Kralstein told SportsLine. See all of Kralstein's picks here, and new users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:\nTop Wild Card Weekend expert NFL picks from Alex Selesnick Another prop-bet specialist, Selesnick, who is better known as PropStarz, has returned nearly 45 units since joining SportsLine. He enters this weekend on a 60-40 roll on NFL player props that has returned nearly $1,300 for $100 players.This weekend, he is going Under 41.5 (-112) on total receiving yards for New England tight end Hunter Henry. \"Henry has had a very strong season while serving as one of the Drake Mayes most reliable targets,\" Selesnick said. \"Henry had arguably his best season this year, however this is a big number for the 11-year veteran, in addition to a difficult matchup. The Chargers have surrendered the fourth fewest yards to opposing tight ends this season as well as ranking 5th in EPA per drop back since Week 10. It's also worth noting that the bulk of Henry's production and almost all of his spike weeks have come versus inferior opponents and bad pass defenses.\" See the rest of Selesnick's picks here, and bet Henry Under total receiving yards here:\nHow to make Wild Card Weekend NFL picksSportsLine's team of experts also includes Brady Kannon, a former Las Vegas SuperContest winner, who is on a sizzling 26-9 run (+1590) on NFL spread picks. He's already locked in three best bets for Wild Card Weekend, including backing a surprising underdog that he says might win outright. You can find out who his NFL picks are this weekend here. If you are looking for NFL picks, NFL props, or NFL best bets for Wild Card Weekend, SportsLine has you covered with its proven team of experts. Visit SportsLine now to see who which teams you should back in Wild Card Weekend, all from a staff that includes five experts who are on NFL runs that have returned $1,000 or more for $100 players.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks this week, Vegas odds: 2026 Wild Card expert predictions against the spread, parlay, and props - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/78154dbe-8068-44b0-80fd-152d405987b4/thumbnail/1200x675/b488d78b9a6c65122917b8d215b8c793/blake-corum-los-angeles-rams-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T14:56:34.000Z",
      "dateModified": "2026-01-09T14:56:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wild Card Weekend NFL odds, lines, spreads, predictions: Picks from 10,000 computer sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-wild-card-weekend-odds-betting-lines-spreads-picks-predictions-playoffs-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/36e6dd49-9057-47dd-a407-abe4e9ea7f0d/thumbnail/1200x675/5d2a876926f7268adf3faa1a9999e870/t-j-watt-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T12:46:13.000Z",
    "description": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be high",
    "body": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be highly sought after with NFL picks. Meanwhile, Green Bay is riding a four-game losing streak and is a 1.5-point favorite against the Bears on Saturday night, per the latest Wild Card Weekend NFL odds. Those two split their regular season matchups as they'll tangle in the postseason for just the third time ever. The NFL line for that game matches Bills vs. Jaguars (+1.5) as the slimmest of the Wild Card Weekend NFL spreads, while the largest has the Rams favored by 10.5 points over the Panthers as Los Angeles is getting receiver Davante Adams (hamstring back).Other spreads include 49ers vs. Eagles (-5.5), Chargers vs. Patriots (-3.5) and Steelers vs. Texans (-3). That makes the Eagles and Patriots the only home favorites of the opening round of the 2026 NFL playoffs. All of the updated Wild Card Weekend NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Wild Card Weekend NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Wild Card Weekend NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Wild Card Weekend NFL predictionsOne of the model's strongest Wild Card Weekend NFL picks is the Steelers (+3, 38.5) covering at Houston on Monday night at 8 p.m. ET. These teams have the same 9-8 spread record, but Pittsburgh is 4-1 ATS over its last five, while Houston has failed to cover in two of its last three. While Houston has an elite defense, it allowed its most points (30) all year in Week 18 to a Colts team with a fourth-string rookie quarterback, which is no comparison to an Aaron Rodgers-led unit getting back a rested DK Metcalf. As for C.J. Stroud, he is 0-2 on the road in his playoffs career, failing to account for a touchdown in either loss. The Steelers are forecasted to cover over 50% of the time, with the Over hitting in well over 50% of simulations. See which other teams to pick here, and bet the Steelers using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make Wild Card NFL picksThe model has also made the call on who wins and covers in every other game on the Wild Card Weekend NFL schedule and just revealed three teams projected to outright win over 60% of the time, potentially giving you a huge payday. You can only get every pick for every game at SportsLine, and for a limited time, get your first month at SportsLine for just $1 using promo code CHAMPIONSHIP.So what Wild Card NFL picks can you make with confidence, and which three picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Wild Card Weekend NFL betting odds, lines, live spreads, scoresGet Wild Card NFL picks at SportsLineGameSpreadTotalPicksRams at Panthers (Saturday)LAR -10.545.5SEE  PICKS HEREPackers at Bears (Saturday)GB -1.544.5SEE  PICKS HEREBills at JaguarsBUF -1.551.5SEE  PICKS HERE49ers at EaglesPHI -5.544.5SEE  PICKS HEREChargers at PatriotsNE -3.545.5SEE  PICKS HERETexans at Steelers (Monday)HOU -338.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild Card Weekend NFL odds, lines, spreads, predictions: Picks from 10,000 computer sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/36e6dd49-9057-47dd-a407-abe4e9ea7f0d/thumbnail/1200x675/5d2a876926f7268adf3faa1a9999e870/t-j-watt-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T12:46:13.000Z",
      "dateModified": "2026-01-09T12:46:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 College Football Playoff semifinal odds, line: Indiana vs. Oregon picks from expert on 6-1 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-playoff-odds-time-peach-bowl-prediction-indiana-oregon-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/b72ccb90-c586-41a3-9efa-35c56db1e1ad/thumbnail/1200x675/50df8630f3817bf4e6e2b556d4ff2fd2/fernando-mendoza-indiana-hoosiers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:12:48.000Z",
    "description": "\n        The 2026 College Football Playoff semifinals conclude on Friday when the top-seeded Indiana Hoosiers take on the fifth-seeded Oregon Ducks. I",
    "body": "\n        The 2026 College Football Playoff semifinals conclude on Friday when the top-seeded Indiana Hoosiers take on the fifth-seeded Oregon Ducks. It's a rematch of the Oct. 11 meeting that Indiana won 30-20 at Oregon despite being a 7-point underdog entering that game. The Ducks beat James Madison and Texas Tech to advance to the CFP semifinals. Indiana had a bye and then stomped Alabama 38-3 in the quarterfinals. The winner of this matchup advances to face Miami in the national title game on January 19. Oregon running back Jordon Davison has been ruled out, while running back Noah Whittington is listed as questionable. Kickoff is at 7:30 p.m. ET from Mercedes-Benz Stadium in Atlanta. The Hoosiers are 3.5-point favorites in the latest Oregon vs. Indiana odds from SportsLine consensus, while the over/under for total points scored is 48.5. Before making any Indiana vs. Oregon picks, make sure to see the College Football Playoff semifinal predictions from SportsLine's Micah Roberts. New users can target the DraftKings promo code, which offers $300 in bonus bets if your initial bet wins:Roberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. He's been especially dialed in on Curt Cignetti and Indiana, going 6-1 on his past seven picks involving the Hoosiers. Anyone following could have seen huge returns.Now, Roberts has set his sights on Indiana vs. Oregon and just locked in his picks and CFP semifinal predictions. You can head to SportsLine now to see Roberts' picks. Here are the FBS college football odds and trends for Oregon vs. Indiana:\nIndiana vs. Oregon spreadIndiana -3.5Indiana vs. Oregon over/under48.5 pointsIndiana vs. Oregon money line Indiana -180, Oregon +150Indiana vs. Oregon picksSee picks at SportsLineIndiana vs. Oregon streaming Fubo (Try for free)  \nWhy Indiana can coverThe Hoosiers are emerging as the top program in college football at the moment, and their 38-3 rout of Alabama -- arguably college football's greatest power in the playoff era -- proved just how dominant Indiana has become under Cignetti. Indiana also knocked off Ohio State in the Big Ten Championship Game despite entering that matchup as a 3.5-point underdog. Both sides of the ball are performing at a high level, but the defense has been particularly dominant in the past two games, holding Alabama and Ohio State to a combined 13 points. Quarterback Fernando Mendoza, the Heisman winner and likely top overall pick in the 2026 NFL Draft, leads a balanced offense that features two 800-yard backs and two 700-yard receivers. The Hoosiers have already knocked off Oregon once by double digits, and that was on the road, so they should be extremely confident entering this one. See which team to back at SportsLine.Why Oregon can cover It's tough to beat a great team twice, and that's what Indiana will be attempting to do. This is the sixth rematch of a regular season game in College Football Playoff history, and four of the previous five have been won by the team that lost in the regular season. If Indiana was the most dominant team in the quarterfinals, the Ducks weren't too far behind. Oregon stifled Texas Tech's offense, forcing four turnovers and giving up just 215 total yards of offense. Offensively, the Ducks can boast many of the same qualities that Indiana can, including a likely first-round pick at quarterback in Dante Moore. Tight end Kenyon Sadiq, another possible first-round pick, leads the Ducks with 46 receptions and eight touchdown catches. See which team to back at SportsLine.How to make Indiana vs. Oregon picksRoberts has analyzied Oregon vs. Indiana and is leaning Over on the total. He's also found a critical x-factor that has him jumping on one side of the spread. You can see what it is at SportsLine.\nWho wins Oregon vs. Indiana, and what critical x-factor makes one side of the spread hit hard? Visit SportsLine now to find out which side of the spread to back, all from the expert who is on a 6-1 roll on Indiana picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football Playoff semifinal odds, line: Indiana vs. Oregon picks from expert on 6-1 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/b72ccb90-c586-41a3-9efa-35c56db1e1ad/thumbnail/1200x675/50df8630f3817bf4e6e2b556d4ff2fd2/fernando-mendoza-indiana-hoosiers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T15:12:48.000Z",
      "dateModified": "2026-01-09T15:12:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dolphins plan to hire Packers executive Jon-Eric Sullivan as next general manager - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-general-manager-jon-eric-sullivan-mike-mcdaniel-tua-tagovailoa/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/d8249531-6551-4812-9148-dfbdcdfbed8c/thumbnail/1200x675/25538c0301288e4730a67ea4ca760cf5/gettyimages-2189702335-2.jpg",
    "tag": "Sports",
    "date": "2026-01-09T15:49:13.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Dolphins plan to hire Jon-Eric Sullivan ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Dolphins plan to hire Jon-Eric Sullivan as their next general manager, sources tell CBS Sports' Jonathan Jones. Sullivan is a long-time Green Bay Packers executive who started with the team in 2003 and has worked as the vice president of player personnel since 2022.Sullivan was a scout with the Packers when they won Super Bowl XLV to cap off the 2010 season and has worked closely with Packers GM Brian Gutekunst to build a perennial playoff contender in Green Bay. Sullivan is the son of long-time college and NFL coach Jerry Sullivan, who spent 40 years on various sidelines and worked for the Dolphins as a wide receivers coach in 2004.In Miami, Sullivan replaces Chris Grier, who was fired by the Dolphins in October after serving as the team's GM since 2016, when he was promoted from director of college scouting. During Grier's tenure as general manager, the Dolphins experienced seven losing seasons and reached the postseason only three times. Miami has not won a playoff game since 2000.\n\n        \n            \n                Dolphins fire Mike McDaniel: Offensive guru out after second straight losing season, benching Tua Tagovailoa\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nSullivan's first task in Miami will be hiring a new coach to replace Mike McDaniel, who was fired Thursday after the team's 7-10 finish to the 2025 season, his fourth as coach. The Dolphins started the year 2-7 but rallied by winning five of their final eight. Ultimately, it was not enough to save McDaniel's job as owner Stephen Ross said the team is in need of \"comprehensive change.\"Miami's season included the benching of former No. 5 overall pick Tua Tagovailoa one year after the Dolphins signed him to a four-year, $212.4 million contract extension. Tagovailoa said Monday he would \"be good with\" a new opportunity elsewhere. \nAfter hiring a new coach, figuring out what to with Tagovailoa, who has a $56.4 million cap hit in 2026, will surely be one of Sullivan's top priorities. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dolphins plan to hire Packers executive Jon-Eric Sullivan as next general manager - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/d8249531-6551-4812-9148-dfbdcdfbed8c/thumbnail/1200x675/25538c0301288e4730a67ea4ca760cf5/gettyimages-2189702335-2.jpg"
      ],
      "datePublished": "2026-01-09T15:49:13.000Z",
      "dateModified": "2026-01-09T15:49:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens OC Todd Monken says he didn't coach Lamar Jackson 'well enough' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-offense-todd-monken-lamar-jackson-john-harbaugh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/691052de-abd7-4f95-8e03-3a2e698817cf/thumbnail/1200x675/c0bb48ff56b48a081139aa5054eddfbb/lamarjackson.png",
    "tag": "Sports",
    "date": "2026-01-09T15:24:27.000Z",
    "description": "\n        Baltimore Ravens offensive coordinator Todd Monken believes he could have done a better job coaching Lamar Jackson amid an up-and-down season",
    "body": "\n        Baltimore Ravens offensive coordinator Todd Monken believes he could have done a better job coaching Lamar Jackson amid an up-and-down season that resulted in the team missing the postseason. \"I didn't coach Lamar well enough,\" Monken said Thursday on the Ryan Ripken Show. \"I didn't have as good a relationship as I could've. I didn't do the things we needed this year to win enough games to give ourselves a chance.\"Baltimore's passing game never found a week-to-week rhythm down the stretch this season in terms of its usual explosive plays, yet still managed to finish 11th in the NFL in scoring offense. Jackson, a two-time MVP, had a three-turnover outing in November and the Ravens lost four of his final six starts to miss the postseason. After starting the season 1-5, Baltimore had a chance to clinch the AFC North title against the Pittsburgh Steelers, but a missed field goal in the final seconds ended that opportunity. Reported strain between Baltimore Ravens quarterback Lamar Jackson and recently-fired coach John Harbaugh was overblown, said Monken, who is not expected to be back with the team after Harbaugh's ouster. Jackson was mum on his future with the franchise following Sunday's finale against the Steelers and skipped a question about Harbaugh. The Ravens' coaching staff overhaul began less than 48 hours later.\"Lamar and I, to me, had a good relationship,\" Monken said. \"Could it have been better? Of course. I never, Lamar and I, never had an issue. I don't know where that comes from. I never saw Lamar and coach Harbaugh not have a great relationship. I never saw that. I never saw coach Harbaugh and any of our players not have a great relationship. Never, not one time, so any of that would be news to me, but I don't know how people feel.\"\n\n        \n            \n                Ravens coaching options: Kevin Stefanski, Brian Flores among top options to succeed John Harbaugh\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nA column in The Baltimore Sun earlier this fall claimed Jackson falls asleep in meetings, stays up late playing video games and is the reason the Ravens practice in afternoons, not mornings. It also called Jackson an \"overgrown kid,\" one whom Harbaugh had grown tired of this season. Harbaugh later said he didn't \"give credence to anonymous-type sources\" and said he was transparent with his locker room.Jackson will be heading into the fourth season of five-year, $260 million contract signed on May 4, 2023. General manager Eric DeCosta said last summer the Ravens and Jackson, who has a no-trade clause, started preliminary talks on an extension. Monken said he has \"no complaints\" from his tenure with the Ravens and will pull for the franchise moving forward.\n\"I'm gonna fight like hell to fix it,\" Monken said. \"I'm gonna fight like hell for the next job I get and I'm going to root like hell for the Ravens.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens OC Todd Monken says he didn't coach Lamar Jackson 'well enough' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/691052de-abd7-4f95-8e03-3a2e698817cf/thumbnail/1200x675/c0bb48ff56b48a081139aa5054eddfbb/lamarjackson.png"
      ],
      "datePublished": "2026-01-09T15:24:27.000Z",
      "dateModified": "2026-01-09T15:24:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hawks have a good thing going... as long as they don't trade for Anthony Davis - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/hawks-anthony-davis-nba-trade-rumors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/21787ab1-50cd-4418-b3dc-ce83eca011a1/thumbnail/1200x675/84be04754cbe3c158f78dd3a2ba4a33a/anthony-davis-hawks-getty.png",
    "tag": "Sports",
    "date": "2026-01-09T14:28:37.000Z",
    "description": "\n        I'm thinking of the Jonah Hill line in \"Moneyball\" when his character tells Brad Pitt (as Oakland A's exec Billy Beane): \"I think it's a good",
    "body": "\n        I'm thinking of the Jonah Hill line in \"Moneyball\" when his character tells Brad Pitt (as Oakland A's exec Billy Beane): \"I think it's a good thing that you got [Johnny] Damon off your payroll. I think it opens up all kinds of interesting possibilities.\" That's the Atlanta Hawks right now. It's not a good thing that they got Trae Young off their payroll by trading him to the Wizards on Wednesday; it's a great thing. It indeed opens up all kinds of interesting possibilities.Just as long as the Hawks understand that Anthony Davis is not one of them. Davis could well be leaving the Mavericks over the next four weeks, a year after they gave up the face of their franchise to get him. The Hawks are a potential suitor. This was reported by The Athletic a day before the Young deal:The Hawks have also made it clear that the notion of adding Davis while Young remains on the team is a non-starter because of salary alone; those two are owed more than $100 million combined this season. But if Young lands elsewhere in the coming weeks and the Hawks' stance shifts as a result, Davis would certainly fill a need in Atlanta. Veteran center Kristaps Porziņģis, who has made a significant impact when healthy, is set to be a free agent this summer.Now that Young has indeed landed elsewhere, you can see the handwriting of a stupid move on the wall. The Hawks, who are 18-21 and in ninth place in the East, have shown just enough in their non-Young games this season to convince themselves that a player of Davis' caliber could push them into fringe contention in an Eastern Conference pretty much any healthy team has a shot at winning. We don't need to do the \"Davis is one of the most dominant player in the league when he's healthy\" dance anymore. Everyone knows how good he is. And everyone knows he is never going to be healthy. Well, Nico Harrison still might not know it. But everyone else does. The guy hasn't managed to play 55 games in four of his last five seasons. He's already missed 18 games this year. He literally got hurt in his first game with the Mavericks after they traded Luka Dončić for him. If the Hawks were to fall into this trap and trade for Davis, and then worse, extend him this summer when he'll be 33 years old, they'll have nobody but themselves to blame when it goes bust. And it will go bust. Hell, even if Davis were to somehow turn injury-proof, the cost to get him would be massive. \nUnderstand, the Hawks cannot re-aggregate CJ McCollum or Corey Kispert, the guys that they got from the Wizards in the Young deal, as part of any future trades this season. The only means they have to match the $54 million Davis is making the season in outgoing salary is basically to flip Kristaps Porziņģis, 2024 No. 1 overall pick Zaccharie Risacher and Luke Kennard. But again, you can see the Hawks galaxy braining this thing by telling themselves that Porziņģis is rarely healthy himself, so why not flip for a better player in Davis? Risacher is probably never going to be more than a rotation player. McCollum and Kispert can replace Kennard's shooting. Hell, let's do it!No, let's not. Instead, let's take a step back and think about what a good position the Hawks have managed to put themselves in. Instead of doling out the $49 million player option that Young is due next season, or the $58.4 million that Davis is guaranteed next year even if they didn't extend him, the Hawks are positioned to have somewhere in the range of $30 million in cap space this summer on top of a high lottery pick (possibly No. 1 overall as it's coming from New Orleans, which is currently tied with the Kings for the second-worst record in the league) in a stacked 2026 class. \nIf the Hawks play this thing right, they can start to build around the two things everyone desires in today's league: Long, athletic defense and depth. Just getting Young off the roster helps the former, and not giving away three pieces for one in Davis, and possibly draft capital on top of that, helps the latter. Jalen Johnson is the guy to build around now. He's only 24. Risacher is 20. Dyson Daniels 22. Onyeka Okongwu 25. There is time to let this thing breathe. Or, Atlanta can try to seize the moment with a different deal before the February deadline or this summer. It has a bunch of future draft capital and flexibility on its side, all the good young players we just listed, and while McCollum can't be re-aggregated in a trade this season, he can be flipped straight up, and his $30 million number could play for a lot of guys (Michael Porter Jr., who is making $38 million, would qualify). If the Hawks are looking for a Young replacement at a lower usage rate and price point, Coby White is a free agent this summer. They could leverage the Bulls into a deal right now by threatening to sign him outright in July. Quentin Grimes. Collin Sexton. Anfernee Simons. There are a lot of these guys. I just wrote about how small guards who don't play defense are on the fast track to extinction, but that's as a max-salary player in the vein of Young. You still need guys who can create and make shots. It's all about how much they cost. \nOverpaying for them is when you get in trouble. Overpaying for anyone, in fact, is how you get in trouble in this highly punitive apron era. Davis would be a massive overpay for a Hawks team that has created a cap sheet teams would kill for. Johnson is set up to be Atlanta's highest paid guy next year at $30 million. Daniels is set for $25 million. After that, you have a bunch of guys in the teens. The Hawks could, just as an example, trade for Coby White at the deadline, and then re-sign McCollum and/or Porziņģis this summer at a far lower number than they're making this season. Now add in a mid-level exception player. And possibly the No. 1 overall pick. Or, go another way. Trade for a center now as they're not as readily available as guards. Ivica Zubac would be a dream. Davis is the Dallas center we're talking about, but Daniel Gafford is a far more attractive target for the Hawks. Then go sign one of those guards with mid-level money. Either way, this is how you end up with a roster than goes 10 or 11 deep with solid NBA players. \nAll of this is available to the Hawks right now. They are young, flush with assets, and have a new lease on life in a post-Young era. That is, unless they screw it all up and trade for Anthony Davis.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hawks have a good thing going... as long as they don't trade for Anthony Davis - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/21787ab1-50cd-4418-b3dc-ce83eca011a1/thumbnail/1200x675/84be04754cbe3c158f78dd3a2ba4a33a/anthony-davis-hawks-getty.png"
      ],
      "datePublished": "2026-01-09T14:28:37.000Z",
      "dateModified": "2026-01-09T14:28:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bears vs. Packers prediction, odds, pick, where to watch, live stream, kickoff time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-vs-bears-prediction-where-to-watch-pick-odds-nfc-wild-card/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/b4fcb80c-89e3-4b7b-abc1-1d2ee9e9c4b8/thumbnail/1200x675/4548fb075f113a0b230ca2a6900bc1ca/jordan-love-caleb-williams.jpg",
    "tag": "Sports",
    "date": "2026-01-09T14:10:01.000Z",
    "description": "\n        The Green Bay Packers versus the Chicago Bears, the NFL's oldest/most-played rivalry with 213 games on the books including their upcoming pla",
    "body": "\n        The Green Bay Packers versus the Chicago Bears, the NFL's oldest/most-played rivalry with 213 games on the books including their upcoming playoff matchup, will be reignited for a third time in the 2025 season. Each team won at home in the regular season with both games ending in a one-score win. Bears quarterback Caleb Williams threw an interception to Packers cornerback Keisean Nixon with 27 seconds to play to seal a 28-21 Packers home win in Week 14 while Williams threw a 46-yard, game-winning touchdown pass to wide receiver DJ Moore in a 22-16 overtime win in Week 16.   The last time these two teams played in Week 16, Packers quarterback Jordan Love got knocked out with a concussion in the second quarter, but he'll be back for this matchup after sitting out the final two games of the regular season. Love is a perfect 4-0 against the Bears in the four matchups with Chicago that he has started and finished in his three seasons as Green Bay's starting quarterback. The loss in Week 16 in 2025 and the loss in Week 18 in 2024 involved backup quarterback Malik Willis finishing the game because of an injury to Love. Green Bay is making its third playoff appearance in three seasons with Love as the team's starting quarterback while Chicago is making its first playoff appearance since 2020 and first of Williams' career under the guidance of first-year head coach Ben Johnson. \n        \n            \n                NFL Wild Card Weekend odds, predictions, expert picks: Best bets, where to watch, NFL playoffs, stream, more\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nIt's almost time for the Packers vs. Bears grudge match at Soldier Field in the postseason after two thrilling, one-possession wins for each team this regular season. Here are the key things to know plus a game prediction for the first Green Bay vs. Chicago playoff game since the 2010 NFC Championship game, a game that was won 21-14 at Soldier Field by the visiting Packers en route to a Super Bowl XLV title. \nWhere to watch Bears vs. Packers liveDate: Saturday, Jan. 10 | Time: 8 p.m. ETLocation: Soldier Field (Chicago, Illinois)Stream: Amazon Prime VideoFollow: CBS Sports AppOdds: Packers -1.5, O/U 45.5 (via DraftKings Sportsbook)\nPackers vs. Bears: Need to know\nHow crisp will Jordan Love, Josh Jacobs and Zack Tom be for Packers' offense? Love, running back Josh Jacobs and right tackle Zack Tom are all varying degrees of banged up. Love (concussion) should be good to go after not playing contact football for three weeks by the time this playoff matchup kicks off on Saturday night. Running back Josh Jacobs has been dealing with a knee issue since tweaking it on the MetLife Stadium turf back in Week 11. He had just four carries for three yards in Week 17 against the Baltimore Ravens before sitting out the Week 18 season finale at the Minnesota Vikings. Right tackle Zack Tom suffered a knee injury in Week 15 at the Denver Broncos, and he hasn't played since. Tom practiced as a limited participant every day this week while both Love and Jacobs are no longer on the team's injury report. That's an encouraging sign for Green Bay.Can the Bears' No. 3 rush offense take advantage of depleted Packers defensive line? \nOne of a number of things Ben Johnson was able to take with him from the Detroit Lions to the Chicago Bears in 2025 was a successful run game. Chicago is averaging 144.5 rushing yards per game this season, the third-most in the NFL this season. Green Bay is without both All-Pro edge rusher Micah Parsons (ACL) and stout defensive tackle Devonte Wyatt (ankle). Since Week 16, with both sidelined, the Packers are allowing an NFL-worst 198.0 rushing yards per game. Yes, that average is inflated by Derrick Henry's all-time performance (216 yards and four touchdowns on 36 carries) against them in Week 17, but the Packers did allow the Bears to rush for 150 against them in the Week 16 defeat at Soldier Field. This would appear to be an advantage for Chicago.Who is going to force the game-tilting turnover on defense? \nPackers safety Xavier McKinney totaled eight interceptions in 2024, the second-most in the league. Bears safety Kevin Byard led the NFL with eight interceptions in 2025. Which one of them will take away a football that flutters an extra second longer in the area out of the hand of Love or Williams after perhaps being hit on a throw? \nAs long as both quarterbacks remain healthy, this game has the makings of a high-scoring affair like the 28-21 Packers victory in Week 14. Whichever team can force that one crucial takeaway could take control of the game. Packers vs. Bears prediction\nWith Love healthy once again, he'll have a similar performance like he did in the first matchup between these teams when he threw three touchdowns, including a couple explosives to No. 1 receiver Christian Watson. Williams will play well like he did at the San Francisco 49ers on \"Sunday Night Football\" in Week 17, but like that night in Santa Clara, he'll come up just short in his first NFL playoff game. Pick: Packers 31, Bears 27 | (Packers -1.5, Over 44.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bears vs. Packers prediction, odds, pick, where to watch, live stream, kickoff time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/b4fcb80c-89e3-4b7b-abc1-1d2ee9e9c4b8/thumbnail/1200x675/4548fb075f113a0b230ca2a6900bc1ca/jordan-love-caleb-williams.jpg"
      ],
      "datePublished": "2026-01-09T14:10:01.000Z",
      "dateModified": "2026-01-09T14:10:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]