[
  {
    "title": "Bills vs. Broncos prediction, odds, date: 2026 divisional round NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-broncos-prediction-odds-time-nfl-divisional-round-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/6825d854-5d76-4b87-a3d0-c7169fef6fbe/thumbnail/1200x675/54f975c177fccff5524522d8ba0f0e24/bo-nix-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-14T15:19:39.000Z",
    "description": "\nThe divisional round of the 2026 NFL playoffs kicks off with the Denver Broncos hosting the Buffalo Bills on Saturday. The Broncos (14-3) tied for th",
    "body": "\nThe divisional round of the 2026 NFL playoffs kicks off with the Denver Broncos hosting the Buffalo Bills on Saturday. The Broncos (14-3) tied for the league's best record, won back-to-back games to close the regular season and earned a bye as the AFC's No. 1 seed. The Bills (12-5) have won six of their last seven contests, including a 27-24 road victory over Jacksonville in Sunday's Wild Card matchup. Buffalo is seeking its second straight AFC Title Game appearance, while Denver is hoping to reach the championship game for the first time since winning the Super Bowl 10 years ago.Kickoff is at 4:30 p.m. ET from Empower Field at Mile High in Denver. Buffalo prevailed 31-7, at home, when these teams last met in last year's Wild Card round. The latest Broncos vs. Bills odds from DraftKings Sportsbook list Denver as a 1.5-point favorite, while the over/under for total points is 45.5. Before making any Bills vs. Broncos picks,Â check out the NFL predictions from the SportsLine Projection Model.Â Watch the game on CBS or stream on Paramount+. Sign up right here.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-ratedÂ NFL picksÂ since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following itsÂ NFL bettingÂ picks atÂ sportsbooksÂ and onÂ betting sitesÂ could have seen strong returns.Now, the model has set its sights on Broncos vs. Bills. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Bills vs. Broncos:\nBroncos vs. Bills                                                                    spreadDenver -1.5 at DraftKings SportsbookBroncos vs. Bills                over/under45.5 pointsBroncos vs. Bills                                                                                                                                                                                money lineÂ Denver -112, Buffalo -110Broncos vs. Bills                                                                                                                                                                       picksSee picks at SportsLineBroncos vs. Bills                                                                                                                                                                          streamingÂ Paramount+Why the Bills can coverIt was just a year ago that the Bills trounced the Broncos, 31-7, in the playoffs, but Buffalo's dominance over Denver goes back beyond that. The Bills are 8-1 against the spread versus the Broncos over their last nine meetings, with three of those games taking place in Denver. Buffalo just defeated an elite defense in Jacksonville, which had the No. 1 run defense and forced the second-most turnovers. Thus, the Bills should find an easier time on the ground come Saturday, and Denver has the least opportunistic defense in the postseason. No 2026 playoff team forced fewer turnovers than the Broncos' 14, which is fewer than one per game. The Bills are undefeated (8-0) when they don't give away the ball and boast an 11-1 record with one or fewer turnovers.Â See which team to back at SportsLine.Â Why the Broncos can coverThis will be Buffalo's eight divisional road game since the 1970 merger, and the Bills have covered just once over that span. One also can't discount Denver coming off a bye, as the Broncos are 3-1-1 ATS over their last five with a rest advantage, while the Bills are 1-4 ATS this season when having less rest than their opponents. Denver possesses a ferocious pass rush as its 68 sacks are the fifth-most in NFL history, and the Bills have struggled when Josh Allen is under attack. The Broncos average 4.0 sacks per game, and Buffalo has lost six straight games, including being 0-3 this season, when Allen is sacked at least four times. Additionally, Sean Payton and company can exploit Buffalo's porous run defense as just four teams allowed more yards on the ground than Buffalo this season.Â See which team to back at SportsLine.How to make Bills vs. Broncos   picksSportsLine's model has simulated Broncos vs. Bills 10,000 times and is going Over on the total, projecting 47 combined points. It also says one side of the spread hits in well over 50% of simulations.Â You can only get the pick at SportsLine.Â So who wins Bills vs. Broncos, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Broncos vs. Bills spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills vs. Broncos prediction, odds, date: 2026 divisional round NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/6825d854-5d76-4b87-a3d0-c7169fef6fbe/thumbnail/1200x675/54f975c177fccff5524522d8ba0f0e24/bo-nix-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2026-01-14T15:19:39.000Z",
      "dateModified": "2026-01-14T15:19:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cavaliers vs. 76ers prediction, odds, time: 2026 NBA picks for Wednesday from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/cavaliers-76ers-odds-prediction-line-time-2026-nba-picks-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/5403a3aa-c00c-4e8c-8eaa-dfdc54408499/thumbnail/1200x675/c709cb8fa3dcb29866f1ba27637692a4/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-14T15:24:32.000Z",
    "description": "\n        An Eastern Conference matchup on Wednesday's NBA schedule has the Cleveland Cavaliers visiting the Philadelphia 76ers. The Cavs (22-19) have ",
    "body": "\n        An Eastern Conference matchup on Wednesday's NBA schedule has the Cleveland Cavaliers visiting the Philadelphia 76ers. The Cavs (22-19) have alternated wins and losses over their last six games, most recently falling to Utah, 123-112, on Monday. The Sixers (22-16) have won six of their last eight, including a 115-102 road victory at Toronto on Monday. Philly leads the all-time series with a 119-112 record.Tipoff is at 7 p.m. ET from Xfinity Mobile Arena in Philadelphia. The Cavs have won four of the last five matchups, including their lone meeting earlier this season. Philadelphia is a 1.5-point favorite in the latest Cavaliers vs. 76ers odds per DraftKings Sportsbook, while the over/under is 237.5 points. Before making any 76ers vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can also target the latestÂ Underdog promo code, good forÂ $75 in bonus entries when you play $5 with the promo code CBSSPORTS2Â in select states.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 inÂ bettingÂ profit for $100 players on its top-ratedÂ NBA picksÂ over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following itsÂ NBA bettingÂ advice atÂ sportsbooksÂ and onÂ betting appsÂ could have seen huge returns.\nNow, the model has simulated 76ers vs. Cavaliers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Cavs vs. 76ers:Â 76ers vs. Cavaliers spread:Â  Â Â 76ers -1.5 at DraftKings Sportsbook76ers vs. Cavaliers over/under:Â  Â Â 237.5 points76ers vs. Cavaliers money line:Â  Â Â Sixers -113, Cavs -10676ers vs. Cavaliers picks:Â  Â Â See picks at SportsLine76ers vs. Cavaliers streaming:FuboÂ (Try for free) Â New users can check out the latestÂ FanDuel promo codeÂ toÂ get $300 in bonus bets if your initial $5 wager wins:How to make Cavs vs. 76ers picksAfter 10,000 simulations of 76ers vs. Cavs, SportsLine's model is going Over on the total (237.5 points). If recent history is any indication, then fans in Philly should be in store for a high-scoring affair. The last two meetings between these teams both eclipsed 250 combined points as they averaged 257 total points. Each of the last five games between the Cavs and Sixers have hit the over, which is 9-1 overall over their last 10 matchups.The Sixers have also been on an Over run as of late as eight of their last 12 games have surpassed the total. With full health from both teams, 10 players are projected to score more than 14 points tonight, with three of them going over 20 points. The teams are forecasted to combine for 240 total points as the Over hits in over 50% of simulations.The model also says one side of the spread hits almost 70% of the time.Â You can head to SportsLine to see the model's NBA picks.Â So who wins Cavaliers vs. Sixers, and which side of the spread hits almost 70% of the time? Visit SportsLine now to see which side of the Sixers vs. Cavaliers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. 76ers prediction, odds, time: 2026 NBA picks for Wednesday from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/5403a3aa-c00c-4e8c-8eaa-dfdc54408499/thumbnail/1200x675/c709cb8fa3dcb29866f1ba27637692a4/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-14T15:24:32.000Z",
      "dateModified": "2026-01-14T15:24:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL divisional round longshot parlay picks, player props, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-parlay-longshot-picks-odds-props-divisional-round-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/06b1821e-b958-4804-aa8f-56880b8fd16f/thumbnail/1200x675/a9fc377f213f6a256cabb4f1e888ee90/seahawks-49ers-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-14T15:47:10.000Z",
    "description": "\nThe lone divisional matchup that you can make 2026 divisional round NFL picks on is Seahawks vs. 49ers (+7.5), and astute observers may have noticed ",
    "body": "\nThe lone divisional matchup that you can make 2026 divisional round NFL picks on is Seahawks vs. 49ers (+7.5), and astute observers may have noticed that Seattle scored exactly 13 points in its two regular season games versus San Fran. If that's a trend you believe will continue, then utilizing it as a leg in a divisional round NFL parlay could be an avenue to pursue. Picking the Seahawks to score Under 13.5 points is an NFL bet that would return +800, which could be a standalone prediction, or a wager included in an NFL longshot parlay.There are betting trends with all of this weekend's contests, which also include Bills vs. Broncos (+1.5), Patriots vs. Texans (+3) and Rams vs. Bears (+3.5). From NFL player props to alternate lines to exact score predictions, there are several plus-money NFL bets one could pursue in their playoff parlay to get a massive return. Before making any divisional round NFL picks or parlays, you need to see the divisional round NFL longshot parlay from SportsLine's proven computer simulation that pays out $1 million on a $10 bet.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-ratedÂ NFL picksÂ since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following itsÂ NFL bettingÂ picks atÂ sportsbooksÂ and onÂ betting sitesÂ could have seen strong returns.Now that the simulation model has had a chance to digest the divisional round NFL odds, it's locked in its betting picks to form a six-leg NFL parlay that could pay out $1 million for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.Top divisional round NFL parlay picksFor the divisional round, one of the picks featured in the six-leg parlay is backing Over for the alternate total of 48.5 in Seahawks vs. 49ers (+129). The standard total is 44.5 but SportsLine's advanced model projects 50 combined points being scored. The Under has been hit just three times over their last 11 meetings in Seattle, and of the last eight of those contests, the teams have scored a combined 48.9 points.Both teams have highly proficient passing games but struggle on the ground, which leads to them moving the ball through the air more often, leading to quick scores. Seattle has the No. 25 rushing offense but ranks second in net yards per pass attempt, while San Francisco has the No. 30 rush offense but is sixth in net yards per pass attempt. Sam Darnold and Brock Purdy are projected to combine for 3.5 total touchdowns as both defenses are forecasted to allow at least four more points than what they give up on average.Â See the rest of the picks in the divisional round NFL parlay here.You can bet the Over on the standard total using theÂ DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make NFL parlay picks for a payout of $1 millionThe parlay also includes five additional picks from the divisional round from SportsLine's computer model, including a pair of first touchdown scorer props that return over +900. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for the divisional round that can be combined into a parlay that returns $1 million on just a $10 bet, and what optimal first touchdown scorer bets return over +900? Visit SportsLine now to see the top divisional round NFL picks from SportsLine's proven model that can be combined for a parlay that pays $1 million, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL divisional round longshot parlay picks, player props, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/06b1821e-b958-4804-aa8f-56880b8fd16f/thumbnail/1200x675/a9fc377f213f6a256cabb4f1e888ee90/seahawks-49ers-imagn.jpg"
      ],
      "datePublished": "2026-01-14T15:47:10.000Z",
      "dateModified": "2026-01-14T15:47:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-predictions-best-bets-parlay-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/7450d229-ebee-4556-9764-d4a1694dace4/thumbnail/1200x675/5340aebd37f738318e2489bd63ae540c/scottie-barnes-toronto-raptors-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T15:01:15.000Z",
    "description": "\n        Wednesday's NBA schedule features seven games. Among the notable NBA odds include Raptors vs. Pacers (+2.5), Cavaliers vs. 76ers (-1.5), Jazz",
    "body": "\n        Wednesday's NBA schedule features seven games. Among the notable NBA odds include Raptors vs. Pacers (+2.5), Cavaliers vs. 76ers (-1.5), Jazz vs. Bulls (-2.5) and Nuggets vs. Mavericks (-1.5). Indiana and the Los Angeles Clippers look to extend their winning streaks to four games, while Brooklyn looks to snap a four-game losing skid.     Â What are the NBA best bets for Wednesday, and which combination of picks should you target in a Wednesday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target theÂ DraftKings promo code, which offersÂ $300 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 inÂ bettingÂ profit for $100 players on its top-ratedÂ NBA picksÂ over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following itsÂ NBA bettingÂ advice atÂ sportsbooksÂ and onÂ betting appsÂ could have seen huge returns.Â  Â Â \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +500.Â You can only see the model's NBA picks at SportsLine.New users can also check out the latestÂ FanDuel promo codeÂ andÂ get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Wednesday, Jan. 14After simulating every game 10,000 times, the model is backing the Indiana Pacers (+2.5) to cover the spread against the Toronto Raptors at 7 p.m. ET. The Pacers have won three games in a row and the Raptors are down a number of players, including R.J. Barrett (ankle), Ja'Kobe Walter (hip) and Jakob Poeltl (back). Indiana has also covered in two of the past three games against Toronto.\nPascal Siakam helps power the Indiana offense. In 39 games, all starts, he is averaging 23.5 points, 6.8 rebounds, 3.8 assists and 1.3 steals in 33.8 minutes. The Pacers will be without Bennedict Mathurin (thumb) and Isaiah Jackson (concussion).    The model is projecting five Raptors players to score 10.8 points or more, led by Brandon Ingram's 22.4 points. The Pacers meanwhile, are projected to be led by Pascal Siakam's 26.1 points as five Indiana players score 11.6 points or more. The model is backing Indiana to cover nearly 60% of the time.Â See which other NBA parlay picks to make here.\nHow to make NBA predictions for Wednesday, Jan. 14The model also has locked in two more picks, including another bet that hits over 70% of the time. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Wednesday, and which best bets should you target for a chance at a payout of over +500?Â Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/7450d229-ebee-4556-9764-d4a1694dace4/thumbnail/1200x675/5340aebd37f738318e2489bd63ae540c/scottie-barnes-toronto-raptors-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-14T15:01:15.000Z",
      "dateModified": "2026-01-14T15:01:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Raptors vs. Pacers prediction, odds, time, spread: 2026 NBA picks for Wednesday, Jan. 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/raptors-pacers-odds-prediction-line-time-2026-nba-picks-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/fd9aed46-ae89-46e1-bf78-356c3cbbba41/thumbnail/1200x675/5da615c9d7ac139430e8a080ea96374e/brandon-ingram-toronto-raptors-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-14T14:29:21.000Z",
    "description": "\n        The Indiana Pacers will look to stay hot when they take on the Toronto Raptors in Eastern Conference action on Wednesday night. Indiana is co",
    "body": "\n        The Indiana Pacers will look to stay hot when they take on the Toronto Raptors in Eastern Conference action on Wednesday night. Indiana is coming off a 98-96 win over the Boston Celtics on Monday, while Toronto dropped a 115-102 decision to the Philadelphia 76ers that same night. The Raptors (24-17), who are third in the Atlantic Division, are 11-8 on the road this season. The Pacers (9-31), who are fifth in the Central Division, are looking to win their fourth game in a row. Toronto will be without R.J. Barrett (ankle), Ja'Kobe Walter (hip) and Jakob Poeltl (back), while Indiana will be missing Bennedict Mathurin (thumb) and Isaiah Jackson (concussion).Tip-off from Gainbridge Fieldhouse in Indianapolis is set for 7 p.m. ET. The Pacers lead the all-time series 58-53, but the Raptors have won both meetings this season. Toronto is a 2.5-point favorite in the latest Raptors vs. Pacers odds from DraftKings Sportsbook, while the over/under for total points scored is 222.5. Before making any Raptors vs. Pacers picks,Â check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target theÂ DraftKings promo code, which offersÂ $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 inÂ bettingÂ profit for $100 players on its top-ratedÂ NBA picksÂ over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following itsÂ NBA bettingÂ advice atÂ sportsbooksÂ and onÂ betting appsÂ could have seen huge returns.Â  Â Â Now, the model has simulated Raptors vs. PacersÂ 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Raptors vs. Pacers:\nRaptors vs. Pacers                                                                 spread:Â  Â Â Toronto -2.5 at DraftKingsÂ  Â Â Raptors vs. Pacers                                                                               over/under:Â  Â Â 222.5 pointsRaptors vs. Pacers                                                                               money line:Â  Â Â Toronto -141, Indiana +119    Raptors vs. Pacers                                                                               picks:Â  Â Â See picks at SportsLineRaptors vs. Pacers                                                                               streaming:FuboÂ (Try for free)Â New users can check out the latestÂ bet365 bonus codeÂ toÂ get $200 in bonus bets after placing a $5 bet:How to make Raptors vs. Pacers picksSportsLine's model is going Over on the total (222.5 points). The total has gone Over in six of the last nine head-to-head meetings. The Over has also hit in two of the last three Raptors games. The SportsLine model is projecting Toronto's Brandon Ingram to score 22.4 points on average and be one of five Raptors players to score 10.8 or more points. Indiana's Pascal Siakam, meanwhile, is projected to have 26.1 points as five Pacers players score 11.6 points or more.It has also generated an against-the-spread pick that hits in nearly 60% of simulations.Â You can head to SportsLine to see the model's NBA picks.Â \nSo who wins Pacers vs. Raptors, and which side of the spread hits nearly 60% of the time?Â Visit SportsLine now to see which side of the Raptors vs. Pacers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Raptors vs. Pacers prediction, odds, time, spread: 2026 NBA picks for Wednesday, Jan. 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/fd9aed46-ae89-46e1-bf78-356c3cbbba41/thumbnail/1200x675/5da615c9d7ac139430e8a080ea96374e/brandon-ingram-toronto-raptors-imagn-images.jpg"
      ],
      "datePublished": "2026-01-14T14:29:21.000Z",
      "dateModified": "2026-01-14T14:29:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Seahawks prediction, odds, time: 2026 NFL divisional round picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-seahawks-prediction-odds-time-2026-nfl-divisional-round-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-01-14T14:58:54.000Z",
    "description": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in a 2026 NF",
    "body": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in a 2026 NFL divisional round matchup on Saturday. San Francisco advanced with a 23-19 Wild Card Weekend win at Philadelphia, while Seattle is coming off a bye after earning the NFC's top seed. The 49ers (12-5), who were the sixth seed after tying for second in the NFC West with the Los Angeles Rams, are 8-2 on the road this year. The Seahawks (14-3), who won their first NFC West title since 2020, are 6-2 on their home field this season.Kickoff from Lumen Field in Seattle is set for 8 p.m. ET. The Seahawks lead the all-time series 32-24, but the Niners have won seven of the last nine meetings. The teams have split two postseason matchups. The Seahawks are 7.5-point favorites in the latest 49ers vs. Seahawks odds, while the over/under for total points scored is 44.5 via DraftKings Sportsbook. Before making any 49ers vs. Seahawks picks,Â check out the NFL predictions from the SportsLine Projection Model.Â The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-ratedÂ NFL picksÂ since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following itsÂ NFL bettingÂ picks atÂ sportsbooksÂ and onÂ betting sitesÂ could have seen strong returns.Â  Â Â Now, the model has set its sights on 49ers vs. Seahawks. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Seahawks vs. Niners:\n49ers vs. Seahawks                                                                                     spreadSeattle -7.5 at DraftKings Sportsbook49ers vs. Seahawks                                 over/under44.5 points49ers vs. Seahawks                                                                                                                                                                                                 money lineÂ Seattle -355, San Francisco +28049ers vs. Seahawks                                                                                                                                                                                         picksSee picks at SportsLine49ers vs. Seahawks                                                                                                                                                                                           streamingÂ FuboÂ (Try for free) Â Why the Seahawks can coverEighth-year veteran Sam Darnold helps power the Seattle offense. In 17 games, he has completed 67.7% of his passes for 4,048 yards and 25 touchdowns with 14 interceptions and a 99.1 rating. In a 13-3 win over the 49ers on Jan. 3, he completed 20 of 26 passes for 198 yards. In a 38-37 come-from-behind overtime win over the Los Angeles Rams on Dec. 18, he completed 22 of 34 passes for 270 yards and two touchdowns with two interceptions.His top target is third-year veteran wide receiver Jaxon Smith-Njigba. In 17 games, he caught 119 passes for 1,793 yards (15.1 average) and 10 touchdowns. He had 27 explosive plays of 20 yards or more, including a long of 63, with 528 yards after the catch and 79 first-down conversions. In two games against San   Francisco this season, he caught 15 passes for 208 yards.Â See which team to back at SportsLine.Â Why the 49ers can coverFourth-year veteran quarterback Brock Purdy is coming off a solid performance in the Wild Card win over Philadelphia. He completed 18 of 31 passes for 262 yards and two touchdowns with two interceptions. In nine regular-season games this year, he completed 69.4% of his passes for 2,167 yards and 20 touchdowns with 10 interceptions and a 100.5 rating. He also carried 33 times for 147 yards (4.5 average) and three scores.Veteran Christian McCaffrey was San Francisco's leading rusher and receiver during the regular season. In 17 games, he carried 311 times for 1,202 yards and 10 touchdowns. He also had 102 receptions for 924 yards (9.1 average) and seven touchdowns with seven explosive plays, including a long of 39, with 720 yards after the catch and 49 first-down conversions. In the Wild Card win at Philadelphia, he carried 15 times for 48 yards (3.2 average) and had six receptions for 66 yards and two touchdowns.Â See which team to back at SportsLine.How to make 49ers vs. Seahawks picksSportsLine's model is going Over on the total, projecting 50 combined points. It also says one side of the spread hits in more thanÂ 50% of simulations. You can only get the pick at SportsLine.Â So who wins Seahawks vs. 49ers, and which side of the spread hits more than 50% of the time?Â Visit SportsLine now to see which side of the 49ers vs. Seahawks spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Seahawks prediction, odds, time: 2026 NFL divisional round picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg"
      ],
      "datePublished": "2026-01-14T14:58:54.000Z",
      "dateModified": "2026-01-14T14:58:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Purdue vs. Iowa prediction, odds, spread, time: 2026 college basketball picks for Jan. 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/purdue-iowa-odds-spread-time-2026-college-basketball-picks-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/21/0203f211-39c0-49aa-b1ad-0e3b66a5de47/thumbnail/1200x675/e470e2efb73f56cef903879bd0ead01b/usatsi-27506136-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T12:50:25.000Z",
    "description": "\n        A Big Ten battle helps get the Wednesday college basketball schedule underway when the Purdue Boilermakers host the Iowa Hawkeyes. No. 5 Purd",
    "body": "\n        A Big Ten battle helps get the Wednesday college basketball schedule underway when the Purdue Boilermakers host the Iowa Hawkeyes. No. 5 Purdue is 15-1 and 5-0 in the Big Ten, while Iowa is 12-4 and 2-3 in the Big Ten. Iowa is 11-5 against the spread this season, and Purdue is 9-7 ATS.Tipoff is at 6:30 p.m. ET from Mackey Arena. The Boilermakers are 10.5-point favorites per the latest Purdue vs. Iowa odds, while the over/under for total points is 142.5. Before making any Iowa vs. Purdue picks,Â check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target theÂ DraftKings promo code, which offersÂ $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 11 on a sizzling 9-1 run on its top-rated over/underÂ college basketballÂ picksÂ dating back to last season. Anyone following itsÂ college basketballÂ bettingÂ advice atÂ sportsbooksÂ and onÂ betting appsÂ could have seen strong returns.Â Now, the model has simulated Purdue vs. Iowa 10,000 times and just revealed its men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Iowa vs. Purdue:\nPurdue vs. Iowa spread:Â  Â Â Purdue -10.5Purdue vs. Iowa over/under:Â  Â Â 142.5 pointsPurdue vs. Iowa money line:Â  Â Â Purdue -592, Iowa +430Purdue vs. Iowa picks:Â  Â Â See picks at SportsLinePurdue vs. Iowa streaming:FuboÂ (Try for free)Â  Â Â New users can check out the latestÂ bet365 bonus codeÂ toÂ get $200 in bonus bets after placing a $5 bet:How to make Purdue vs. Iowa picksAfter simulating Iowa vs. Purdue 10,000 times, SportsLine's model is going Over on the total (142.5 points). The recent trends point strongly to this play as four straight Purdue games have cleared the total, while Iowa has seen three of its past four games go Over as well. The model is projecting 155 combined points as the Over hits nearly 70% of the time.Â The model also says one side of the spread hits nearly 60% of the time.Â You can only see that pick at SportsLine.\nSo who wins Purdue vs. Iowa, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has simulated this matchup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Purdue vs. Iowa prediction, odds, spread, time: 2026 college basketball picks for Jan. 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/21/0203f211-39c0-49aa-b1ad-0e3b66a5de47/thumbnail/1200x675/e470e2efb73f56cef903879bd0ead01b/usatsi-27506136-1.jpg"
      ],
      "datePublished": "2026-01-14T12:50:25.000Z",
      "dateModified": "2026-01-14T12:50:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baseball Hall of Fame: Matt Snyder breaks down his ballot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2026-baseball-hall-of-fame-ballot-matt-snyder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/07/05f87a65-b781-4823-8cc5-beb3577870f2/thumbnail/1200x675/191a3938606037970605ad23e84acfec/utley-getty.png",
    "tag": "Sports",
    "date": "2026-01-14T15:31:10.000Z",
    "description": "\n        The voting cycle for the 2026 Baseball Hall of Fame class is my second as a voter. Last time around, I tried to make sure as many people as p",
    "body": "\n        The voting cycle for the 2026 Baseball Hall of Fame class is my second as a voter. Last time around, I tried to make sure as many people as possible knew how much this means to me and how hard I'll work to respect the process. This time around, my process changed, albeit slightly.Â Last year, I voted for nine players despite being allowed a maximum of 10 selections. This time around, I filled out the entire 10, adding votes for three players I neglected to vote for last time around. No, their stats didn't change. I just changed my mind on my process.Â Ultimately, I'm a Big Hall guy and would rather see more players from my era of fandom make it to Cooperstown, especially since we continue to see a shortfall in Hall of Famers from the most recent eras of baseball. I know the popular social media talking point is that the Hall of Fame is \"getting watered down,\" but it simply isn't even close to being true (I've discussed this so many times). Further, we see other voters mail in blank ballots or even ballots with just one or two players getting votes. Given that a player needs to reach 75% of the vote for Hall of Fame induction, one non-vote needs to be canceled out with three yes votes in order to be enshrined in the Hall.Â The confluence of all these factors caused me to decide to lower my standards for players on my ballot. I cannot stress this enough: just because I vote for a player doesn't necessarily mean I think he should definitely be a Hall of Famer. I'm not judge, jury and/or executioner. I'm just one vote of roughly 400 and a large number of other voters are much more strict. I'm voting for players who I think are somewhere in the ballpark of a Hall of Famer and then letting the proverbial chips fall where they may.Â \nIf you disagree with my stance, that's fine, but I'd ask what's my risk here? That Jimmy Rollins and Mark Buehrle make the Hall of Fame? First off, they won't. Secondly, do you really, honestly, deep down think if something like that happened that it would be such a travesty? I've yet to hear a story about someone walking through the Hall of Fame and seeing the plaque of a lesser Hall of Famer and throwing a temper tantrum. What would the actual harm be? The answer is there isn't any. Â Finally, we've got to talk about PEDs (performance-enhancing drugs, steroids, whatever you want to call them). My line is that if a player were caught my Major League Baseball using PEDs and suspended, once there was a system in place, I'm a no. Say goodbye, Alex RodrÃ­guez, Manny RamÃ­rez and Ryan Braun. If not, the only thing that matters was on-field performance, so Andy Pettitte is fine. You can disagree with my system here and I accept that. My rationale is that players nailed with hefty suspensions were trying to cheat and it cost their team in the process, which is unbecoming of a potential Hall of Fame player. There are a large number of fans who believe A-Rod and Manny should be in the Hall, but there's also a large contingent of fans who think they shouldn't be honored as individuals with induction. Please don't be that person who acts like everyone is on your side, because that's not just true. There's a divide.I don't consider other off-field matters that never affected a player's team in most cases, but I reserve the right to change my mind.Â \nI've spent the winter discussing each player's case, but let's break down my full ballot.Carlos BeltrÃ¡n got a vote. I think this is the year he makes it and he would have already been in if not for the Astros sign-stealing scandal. As a player, he was a Hall of Famer, no question.Â In a somewhat similar ballpark is Andruw Jones, who also received my vote. He was one of the greatest defensive players in baseball history and hit 434 home runs with over 1,200 runs and RBI.\nThose two players have a shot to make the Hall of Fame, even if Jones won't this time around.Â I feel pretty strongly about Chase Utley as a peak Hall candidate and voted for him again. He needs big gains this season to have a shot at induction, but it isn't off the table.Â I do not feel quite as strong on the candidacies of players like Bobby Abreu, Jimmy Rollins, Dustin Pedroia and they might be in ballot purgatory, but I voted for all three this year. Again, see above in that I'm not necessarily saying I 100% think Rollins and Pedroia should be in the Hall, but they were close enough for me to throw them a vote.Â \nFurther, I still think the standard for Hall of Fame starting pitchers needs to be lowered, even if slightly, as we move into voting on pitchers from an era where workload decreased and will continue to decrease. I was already on this train, having voted for Andy Pettitte and Mark Buehrle before, but this time around Cole HamelsÂ was added to the ballot and I rectified a mistake I believe I made last year, adding FÃ©lix HernÃ¡ndez to my vote in his second year.And that's 10. David Wright was next on my list, but my ballot was maxed out. I might've thought about Francisco RodriguezÂ if I had the extra spots, but given that this is a weak ballot and he was 12th on my list, at best, it's hard to see him ever getting my vote. No one else was strongly considered, again, thanks to the PED exclusions of A-Rod and Manny.Â Here's my ballot.Â \n                                                                    Matt Snyder, CBS Sports\n                                                            \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baseball Hall of Fame: Matt Snyder breaks down his ballot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/07/05f87a65-b781-4823-8cc5-beb3577870f2/thumbnail/1200x675/191a3938606037970605ad23e84acfec/utley-getty.png"
      ],
      "datePublished": "2026-01-14T15:31:10.000Z",
      "dateModified": "2026-01-14T15:31:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to watch Serie A on Paramount+: Como vs. Milan meet in top-six battle - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/how-to-watch-serie-a-on-paramount-christian-pulisic-milan-como-napoli/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/0894fed0-91c4-429a-84ed-0f43327fdc57/thumbnail/1200x675/183b0a45a187ce9bb950847dd410ff91/pulisic-4.jpg",
    "tag": "Sports",
    "date": "2026-01-14T14:52:24.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2025-26 Serie A season is in full swing in Ita",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2025-26 Serie A season is in full swing in Italy.Â NapoliÂ started the campaign as defending champions after winning the 2024-25 title, their fourth Scudetto ever on the last matchday of the season.Â InterÂ andÂ AC MilanÂ will compete with the team coached by Antonio Conte to win the Serie A title, while other teams such as ASÂ Roma,Â Atalanta, Juventus,Â BolognaÂ andÂ ComoÂ are all in contention for a spot in next season's European tournaments.  This week's Serie A slate features several intriguing matchups, as the teams that took part in last month's Supercoppa Italiana return to action for Matchday 16. Inter, Napoli, and AC Milan, all firmly in the title race, will be in action. Here's how to watch and the current standings.Serie A standings   PosClubMPWDLGFGAGDPTS1Inter1914144217+25432Milan1911713015+15403Juventus2011633216+16394Napoli1912343017+13395Roma2013072412+12396Como199732713+14347Atalanta208752519+6318Lazio207762116+5289Bologna197662620+62710Udinese207582232-102611Sassuolo206592327-42312Torino206592132-112313Cremonese205782028-82214Parma195681422-82115Genoa204792229-71916Cagliari204792130-91917Lecce1945101327-141718Fiorentina2028102131-101419Hellas Verona1927101531-161320Empoli2011091530-1513  How to watch Como vs. AC Milan, odds  Date: Thursday, Jan. 15Â |Â Time: 2:45 p.m. ETLocation: Stadio Giuseppe Sinigaglia -- ComoÂ Live stream:Â Paramount+Odds:Â Como +190; Draw +230; AC Milan +150More injuries for AC MilanThe Rossoneri will face Como on Thursday after the away draw against Fiorentina over the weekend and the team coached by Massimiliano Allegri has to deal with another injury this week in the attack, as new winter signing Niclas Fullkrug reportedly fractured his toe after just 106 minutes of Serie A action. He will miss Thursday's match and will possibly be back in around two weeks. The German striker is the latest injury Allegri is facing this season, as both Christopher Nkunku and Christian Pulisic are not at their best condition and Rafael Leao is still struggling as well. This is why there are increasing doubts on who will start against Como, also considering the importance of the match.Â   How to watch Serie A Matchday 16  All times U.S./Eastern.Â   Wednesday, Jan. 14  Napoli vs. Parma, 12:30 p.m. (Paramount+)  Inter vs. Lecce, 2:45 p.m. (Paramount+)  \nThursday, Jan. 15  Verona vs. Bologna, 12:30 p.m. (Paramount+)  Como vs. AC Milan, 2:45 p.m. (Paramount+)  \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to watch Serie A on Paramount+: Como vs. Milan meet in top-six battle - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/0894fed0-91c4-429a-84ed-0f43327fdc57/thumbnail/1200x675/183b0a45a187ce9bb950847dd410ff91/pulisic-4.jpg"
      ],
      "datePublished": "2026-01-14T14:52:24.000Z",
      "dateModified": "2026-01-14T14:52:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-carabao-cup-continues-with-first-leg-of-chelsea-vs-arsenal-afcon-semifinals-pit-salah-vs-mane/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/db25b7eb-ff50-42bf-849e-c881a6af0f0d/thumbnail/1200x675/a2e69bfd57673f002fb17a79d48b6f67/carabo-cup-hq-slate-1920x1080-v3-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T15:32:03.000Z",
    "description": "\n        Hello! We've fully reached the business end of AFCON while the League Cup continues in England alongside with the other European leagues waki",
    "body": "\n        Hello! We've fully reached the business end of AFCON while the League Cup continues in England alongside with the other European leagues waking from their winter slumber. I'm Chuck Booth with the latest.ğŸ“º Footy fixAll times U.S./EasternWednesday, Jan. 14ğŸŒ AFCON: Senegal vs. Egypt, 12 p.m. â¡ï¸ beIN Sports and FuboğŸ‡®ğŸ‡¹ Serie A: Napoli vs. Parma, 12:45 p.m. Â â¡ï¸Â Paramount+ğŸ‡©ğŸ‡ª Koln vs. Bayern Munich, 2:30 p.m. â¡ï¸ ESPN+ğŸ‡®ğŸ‡¹ Serie A: Inter vs. Lecce, 2:45 p.m. â¡ï¸ Paramount+ğŸ‡ªğŸ‡¸ Copa Del Rey: Albacete vs. Real Madrid, 3 p.m. Â â¡ï¸ ESPN+ğŸŒ AFCON: Nigeria vs. Morocco, 3 p.m. â¡ï¸Â  beIN Sports and FuboğŸ´ó §ó ¢ó ¥ó ®ó §ó ¿ EFL Cup: Chelsea vs. Arsenal, 3 p.m. â¡ï¸Â Paramount+Thursday, Jan. 15ğŸ‡®ğŸ‡¹ Serie A: Verona vs. Bologna, 12:30 p.m. â¡ï¸Â Paramount+ğŸ‡©ğŸ‡ª Bundesliga: Augsburg vs. Union Berlin, 2:30 p.m. â¡ï¸ ESPN+ğŸ‡®ğŸ‡¹ Serie A: Como vs. Milan, 2:45 p.m. â¡ï¸Â Paramount+Don't Miss Chelsea vs. Arsenal\n                                                                    Paramount+\n                                                            What's on CBS Sports Golazo Network\nğŸ¥…Â ScorelineÂ (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.ğŸ“ºÂ How to watch:Â CBS Sports Golazo NetworkÂ is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on theÂ CBS Sports app,Â Pluto TVÂ andÂ Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/db25b7eb-ff50-42bf-849e-c881a6af0f0d/thumbnail/1200x675/a2e69bfd57673f002fb17a79d48b6f67/carabo-cup-hq-slate-1920x1080-v3-1.jpg"
      ],
      "datePublished": "2026-01-14T15:32:03.000Z",
      "dateModified": "2026-01-14T15:32:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Power Rankings: 76ers rising fast behind a rejuvenated Joel Embiid - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-power-rankings-76ers-rising-joel-embiid-pistons-timberwolves/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/6cf5d04f-4736-475a-a4e1-0ca161409159/thumbnail/1200x675/514cdff600b97433a5e8cff007a006d0/nbapowerrankings0114.png",
    "tag": "Sports",
    "date": "2026-01-14T14:28:20.000Z",
    "description": "\n\n\n    \n                                    The Pistons keep the top spot this week, with the Wolves, Thunder, Nuggets and Celtics rounding out the to",
    "body": "\n\n\n    \n                                    The Pistons keep the top spot this week, with the Wolves, Thunder, Nuggets and Celtics rounding out the top five\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 14, 2026\n                            \n                    at\n    9:28 am ET\n                        \n                â€¢\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        We're nearing the halfway point of the NBA season, and what once looked like an OKC runaway now looks like the pretty wide-open title race most people envisioned. OKC should still be the favorite, but it has not played to that ceiling for a decent stretch now.Â Meanwhile, the Timberwolves, who got ousted by the ThunderÂ in five games in the Western Conference finals last season, are charging hard behind perhaps the DPOY favorite in Rudy Gobert and an incredible clutch season from Anthony Edwards.Â \nOh by the way, here come the 76ers, who have jumped comfortably inside the top 10 of this week's Power Rankings.Â Joel EmbiidÂ isn't his old MVP self, but he looks legitimately dominant.Â Note:Â As a general Power Rankings rule, we're going to try to strike a balance between what we've seen in the last week, the season as a whole so far, and what can reasonably be expected to play out over the next few weeks.Â We will not go so far as to rank these teams based on championship expectations, because in that case it would take a lot more to alter, at least in tiers, the generally accepted hierarchy. Winning matters, and it will get you on the move up this board form week to week. But if you're beating bad teams, just as an example, and probably playing a little above your head, it's not necessarily going to be reflected in a completely commensurate climb up the rankings. Or vice versa.\n        Biggest Movers\n    \n                7\n            \n                Timberwolves\n            \n                10\n            \n                Rockets\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Pistons\n                                \n                            Detroit has won three of four and Cade Cunningham (wrist contusion) didn't play in the loss to the Clippers on Saturday. The Pistons are a worse offense by almost 10 points per 100 possessions without Cade, so it's no surprise they only scored 92 points against L.A. But given his absence it's hard to hold that loss too heavily against them, and considering nobody has done all that much to demand the No. 1 spot of late, Detroit stays on top for another week. \n                        \n                            --\n                        \n                            28-10\n                        \n                                2\n                            \n                                    Timberwolves\n                                \n                            Minnesota has quietly climbed into a top-four seed by winning six of their last seven. Anthony Edwards has been a clutch god (how about that game-winner over Wemby?) and Rudy Gobert is vying for his fifth Defensive Player of the Year trophy. \n                        \n                            7\n                        \n                            27-14\n                        \n                                3\n                            \n                                    Thunder\n                                \n                            Well, we know the Thunder are capable of beating the Spurs now, and they've won five straight since getting throttled by the Hornets. But it's still been touch and go. They beat the Jazz and Grizzlies by a total of five points. Over the last month, which dates back to the first Spurs loss, OKC ranks 27th in 3-point percentage.\n                        \n                            3\n                        \n                            34-7\n                        \n                                4\n                            \n                                    Nuggets\n                                \n                            Denver has won four of its last five and has managed to go 5-3 since Nikola JokiÄ‡ went down. Jamal Murray has averaged over 27 PPG on 45/41 shooting splits since Joker's injury and Peyton Watson has gone nuts with at least 20 points in seven of his last eight games including a pair of 30-pieces. \n                        \n                            3\n                        \n                            27-13\n                        \n                                5\n                            \n                                    Celtics\n                                \n                            Tough little stretch for the Celtics, who have lost three of their last four. Want to know how valuable Jaylen Brown is to this team? They lost to the Pacers without him, putting up just 96 points against a bottom-10 defense. Still, you can't drop too far when you've won 10 of your last 14. \n                        \n                            2\n                        \n                            24-15\n                        \n                                6\n                            \n                                    Suns\n                                \n                            The Suns are 1-5 against the Rockets and Thunder and 23-11 against everyone else. Top-five defense. They've won nine of their last 12. Dillon Brooks continues to play at a legit All-Star level season. \n                        \n                            2\n                        \n                            24-16\n                        \n                                7\n                            \n                                    76ers\n                                \n                            Philly is on the rise. They've won six of their last eight and the two losses were by one point each to the Nuggets and Raptors, both in overtime. Tyrese Maxey or Joel Embiid has led the team in scoring in the last 13 games. That's how it has to be if the Sixers are going to make real noise, which it's starting to look like they might be able to do in the East. Embiid is back to dominating. \n                        \n                            7\n                        \n                            22-16\n                        \n                                8\n                            \n                                    Spurs\n                                \n                            San Antonio is coming back to earth a little bit. The Spurs have lost four of six (they had Minnesota down 19 and never trailed over the first 46 minutes until Anthony Edwards took them apart in closing time) and were manhandled in the second half by OKC on Tuesday. Victor Wembanyama hasn't played more than 28 minutes in a game since mid-November. \n                        \n                            3\n                        \n                            27-13\n                        \n                                9\n                            \n                                    Clippers\n                                \n                            Kawhi Leonard has made 16 of his last 30 3-pointers and is making an All-NBA case. Meanwhile, the Clips bounced back from a loss to the Knicks with three straight wins and have now won 10 of their last 12 with the league's No. 1 offense over that stretch. \n                        \n                            1\n                        \n                            16-23\n                        \n                                10\n                            \n                                    Knicks\n                                \n                            Josh Hart returned on Sunday and the Knicks won. Coincidence? Probably not. New York is now 21-9 (if you include the NBA Cup championship over the Spurs) with Hart in the lineup and 5-5 without him. All told, they've lost five of their last seven. \n                        \n                            2\n                        \n                            25-14\n                        \n                                11\n                            \n                                    Raptors\n                                \n                            Toronto has won four of its last six and one of those losses was to the Celtics without Scottie Barnes, and they still played them tough. \n                        \n                            2\n                        \n                            24-17\n                        \n                                12\n                            \n                                    Rockets\n                                \n                            Houston finally got back in the win column (against the Bulls, but they'll take it right now) after three straight losses (two to the Blazers and another to the Kings; yikes) following Kevin Durant's game-winner vs. Phoenix. In fact, Houston's last seven losses have all come against teams with losing records. It doesn't get any easier with OKC on Thursday. \n                        \n                            10\n                        \n                            23-14\n                        \n                                13\n                            \n                                    Lakers\n                                \n                            The Lakers ended a three-game skid with a win over Atlanta on Tuesday. It was the first time this season that LeBron James has played in both ends of a back-to-back. The loss to Milwaukee stung. Luka and LeBron almost outscored the entire rest of the team (51-50) and when the Bucks sold out to double DonÄiÄ‡ the Lakers just couldn't make them pay enough. \n                        \n                            5\n                        \n                            24-14\n                        \n                                14\n                            \n                                    Warriors\n                                \n                            The Warriors have used a home-heavy slate since last December to somewhat steady the ship. They've won nine of their last 13 and still have a top-10 defense, but if the season ended today they've right back in the spot they were last year: having to go through the play-in. \n                        \n                            1\n                        \n                            22-19\n                        \n                                15\n                            \n                                    Cavaliers\n                                \n                            Cleveland has won five of eight but the loss to Utah on Monday is a momentum killer. Tough stretch with two against the Sixers and then Oklahoma City coming up. This team feels like it needs a trade to sort of give this season a restart. Jarrett Allen feels like a decent candidate to go. \n                        \n                            4\n                        \n                            22-19\n                        \n                                16\n                            \n                                    Trail Blazers\n                                \n                            Portland has lost two straight (how much can you count the Golden State loss against them without Deni Avdija), but the Blazers won seven of their previous eight with victories over Houston, Boston and San Antonio. To this point, Portland has played the league's second-toughest schedule, per ESPN. Let's see if they can hang around long enough to make a run when things eventually lighten up and they get Jerami Grant back (if they don't trade him). \n                        \n                            1\n                        \n                            19-22\n                        \n                                17\n                            \n                                    Magic\n                                \n                            Orlando hasn't won or lost two straight games since Dec. 18. The Magic have only beaten one team with a winning record in the last month. They have a bottom-10 offensive, defensive and net rating since Franz Wagner went down in early December. Still, they are hanging onto a top-six spot in the East for the moment. \n                        \n                            2\n                        \n                            22-18\n                        \n                                18\n                            \n                                    Hornets\n                                \n                            Super fun fact: The Hornets are a tenth of a point away from having the best offensive rating in the NBA, and the defense is actually middle of the pack. That's like a Denver Nuggets profile from the championship year. They beat the Jazz by 55 freaking points. They've still lost eight of their last 13, but there are some things to really be excited about in Charlotte. \n                        \n                            2\n                        \n                            14-26\n                        \n                                19\n                            \n                                    Heat\n                                \n                            The Heat managed to stay above .500 with a win over the Suns on Tuesday after and 0-3 road trip. They could very well be below .500 after their next three (vs. Boston and OKC and at Golden State to start a five-game trip through the West). \n                        \n                            1\n                        \n                            21-19\n                        \n                                20\n                            \n                                    Mavericks\n                                \n                            After it was initially reported that Anthony Davis was headed for hand surgery, which could've effectively ended his season, it now looks like he'll avoid going under the knife. The Mavs would be smart to play the \"he can come back this season\" card to trade him as soon as possible. \n                        \n                            --\n                        \n                            15-25\n                        \n                                21\n                            \n                                    Bulls\n                                \n                            Make it four losses in their last five (with one postponement for a wet court) for the Bulls, who are tied with the Hawks for the East's 9-10 play-in spot. Real heavyweight battle that is. \n                        \n                            3\n                        \n                            18-21\n                        \n                                22\n                            \n                                    Bucks\n                                \n                            The Bucks lost by 33 on Tuesday to the Timberwolves, who were playing without Anthony Edwards and Rudy Gobert. Can Giannis just please push the trade button?\n                        \n                            1\n                        \n                            17-23\n                        \n                                23\n                            \n                                    Grizzlies\n                                \n                            The Grizzlies are reportedly listening to offers for Ja Morant. It feels like his time in Memphis is done, if not at the deadline then definitely this summer. Memphis has lost six of its last eight. \n                        \n                            2\n                        \n                            17-22\n                        \n                                24\n                            \n                                    Hawks\n                                \n                            For anyone who was riding the \"Atlanta's defensive issues weren't just about Trae Young\" train, giving up 81 to the Lakers in the first half on Tuesday was some vindication. That said, the Hawks did win three straight after the deal was made (it didn't hurt getting to play the Nuggets, and hold them to 87 points, with JokiÄ‡ and Murray out). \n                        \n                            2\n                        \n                            20-22\n                        \n                                25\n                            \n                                    Wizards\n                                \n                            The Wizards can't score a lick since C.J. McCollum left town and who knows when Trae Young will actually suit up. Washington had won five of seven before the trade for Young. \n                        \n                            3\n                        \n                            10-28\n                        \n                                26\n                            \n                                    Jazz\n                                \n                            You want NBA unpredictability in a nutshell: Utah lost to the Hornets by 55 points on Saturday and then turned around two days later and beat the Cavs by double digits. Utah has lost 10 of its last 14. \n                        \n                            3\n                        \n                            14-25\n                        \n                                27\n                            \n                                    Nets\n                                \n                            The Nets keep a decent amount of games close but they're 3-12 in Clutch games. Perfect for a tank job. Are they going to sell high Michael Porter Jr.? \n                        \n                            --\n                        \n                            11-26\n                        \n                                28\n                            \n                                    Kings\n                                \n                            The Kings snapped a seven-game skid this week with back-to-back wins over the Rockets and Lakers, which says more about those two teams right now than it does the Kings. \n                        \n                            1\n                        \n                            10-30\n                        \n                                29\n                            \n                                    Pacers\n                                \n                            Indiana has won three straight but is still tied with New Orleans for the fewest wins in the league with nine. \n                        \n                            1\n                        \n                            9-31\n                        \n                                30\n                            \n                                    Pelicans\n                                \n                            Make it 11 losses in their last 12 for the Pels, who have just one win this entire season against a team with a winning record. \n                        \n                            2\n                        \n                            9-33\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Power Rankings: 76ers rising fast behind a rejuvenated Joel Embiid - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/6cf5d04f-4736-475a-a4e1-0ca161409159/thumbnail/1200x675/514cdff600b97433a5e8cff007a006d0/nbapowerrankings0114.png"
      ],
      "datePublished": "2026-01-14T14:28:20.000Z",
      "dateModified": "2026-01-14T14:28:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel Adesanya vs. Joe Pyfer set to headline UFC Fight Night in Seattle - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-seattle-israel-adesanya-vs-joe-pyfer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/de8ddc95-b961-4340-b7c3-c5cc1b6d1220/thumbnail/1200x675/35b1d1cff583f75cbe7da9ef4d582417/israel-adesnaya-prefight.jpg",
    "tag": "Sports",
    "date": "2026-01-14T01:58:29.000Z",
    "description": "\n        UFC's Seattle return has its main event. Israel Adesanya vs. Joe Pyfer will headline UFC Fight Night on March 28.UFC CEO Dana White announced",
    "body": "\n        UFC's Seattle return has its main event. Israel Adesanya vs. Joe Pyfer will headline UFC Fight Night on March 28.UFC CEO Dana White announced the fight, which streams exclusively on Paramount+, on Tuesday via Instagram. The card will also feature a pivotal women's flyweight showdown between Alexa Grasso and Maycee Barber.Former UFC middleweight champion Adesanya looks to course correct amid his first losing streak. \"The Last Stylebender\" finds himself on a three-fight skid after knocking out current light heavyweight champion Alex Pereira to reclaim the 185-pound title. Adesanya subsequently lost the title to Sean Strickland, before being finished by Dricus du Plessis and Nassourdine Imavov.Pyfer has made progress in rehabilitating his image. His reputation as an elite prospect took a hit after losing to Jack Hermansson in Pyfer's first main event. Since then, he's won three consecutive fights. A decision win over Kelvin Gastelum -- who gave Adesanya the most exciting fight of his career -- is sandwiched between Performance of the Night wins over Marc-Andre Barriault and Abus Magomedov.\nUFC visited Seattle last February, a card headlined by Henry Cejudo vs. Song Yadong. It marked the first time the promotion had visited the Emerald City in 12 years. Afterwards, White promised the promotion would be back soon.\n\"Let me tell you what, America, Seattle is an awesome city,\" White said during a post-fight press conference in February. \"The people here are amazing. We were walking around the area, lots of different people from everywhere. The shops they have here, the boutiques, the restaurants, the hotels, I forgot how awesome Seattle is. I'm so glad we came back to Seattle.\"White revealed that last year's sellout event at Climate Pledge Arena broke the UFC's North American live gate record for Fight Nights. The 18,000 attendees generated $3.84 million in revenue.\"We will not wait 10 years to come back here,\" White said.\nThe promotion has also booked former UFC women's flyweight champion Grasso against rising contender Barber. Grasso, who famously dethroned Valentina Shevchenko in the first of their three fights, is coming off a last to Natalia Silva. Barber is on a seven fight win streak, most recently beating Karine Silva at UFC 323.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel Adesanya vs. Joe Pyfer set to headline UFC Fight Night in Seattle - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/de8ddc95-b961-4340-b7c3-c5cc1b6d1220/thumbnail/1200x675/35b1d1cff583f75cbe7da9ef4d582417/israel-adesnaya-prefight.jpg"
      ],
      "datePublished": "2026-01-14T01:58:29.000Z",
      "dateModified": "2026-01-14T01:58:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Baseball Today: Pasquantino vs Perez after Kauffman fence changes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-today-how-changes-to-royals-stadium-could-help-salvador-perez/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/20/094935d2-24fc-4f58-8bbf-029eb60c60f7/thumbnail/1200x675/8915d0ed959e61de0eb025bee0a89c36/salvador-perez-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-14T12:56:32.000Z",
    "description": "\n        Our rankings for the 2026 Fantasy Baseball season are live, and you can check them out for myself, Scott White, and Frank Stampfl here. Thoug",
    "body": "\n        Our rankings for the 2026 Fantasy Baseball season are live, and you can check them out for myself, Scott White, and Frank Stampfl here. Though a fair warning here: They might already be out of date!Â At least for the Kansas City Royals in the player pool, that is. Because the Royals announced Tuesday morning that they are bringing in the fences in Kauffman Stadium. As the team explained:Â \"The wall will come in 8 to 10 feet starting near each foul pole -- the gaps will go from 387 feet to 379 -- and taper back toward centerfield, which will remain 410 feet. The height of the wall will also change, from 10 feet tall in most places to 8 Â½ feet.\"The idea here is simple, and the team isn't hiding it: They want more offense. Kauffman has been a notoriously difficult place to hit homers, ranking 25th in the majors in home run park factor over the past four seasons. So, arrow pointing up for all of our Royals hitters, right?Well, not exactly. For one thing, not every player will be impacted by this evenly. Guys who hit the ball down the lines will benefit the most, while hitters who hit the ball to the \"pull side\" in the air, but more in the direction of the power alleys, will probably benefit less.\nLooking at someone like Vinnie Pasquantino, I'm not sure how much juice is left to squeeze out of his batted ball profile â€“ he hits a lot of balls in the air to the pull side, but when you look at his batted ball spray chart, you don't see many balls down right right field line that could plausibly turn into homers with a shortened fence. Salvador Perez, on the other hand, has a bunch of doubles and outs out in deep left field that could conceivably turn into homers, even though he is more of an all-fields power hitter than Pasquantino, who didn't have a single homer to the left side of center field in 2025.Â And then there's this: While Kauffman has been a tough place to hit homers, that's not the same thing as saying it has been a tough place to hit. Over the past three seasons, it ranks as the sixth-best hitter's park in baseball, making up for what it loses in homers with huge increases in doubles and triples, not to mention the lowest strikeout park factor thanks to a great visual. Some of those doubles and triples will surely turn into homers, but some of them will just as surely turn into outs as outfielders have less room to cover.Â Which is to say, don't react to this by just moving every single Royals hitter up. It should play as an even more offense-friendly park, but it's not like you can just say, \"Homers are going up, so offense will go up!\" Homers are relatively rare (though obviously very impactful) events, and the impact for any given hitter will be tough to project. And even if it does lead to an across-the-board improvement in offense in Kansas City, that only represents half of any given hitter's games, so we're probably only talking about a couple of extra projected homers even in an optimistic view.Â \nDon't overreact, in other words. If you want to bump Perez up a bit, I won't argue; I'm probably not moving Pasquantino up at all, though I'm open to being moved on that. But if you view the new dimensions in Kansas City as a viable tie-breaker between, say, Maikel Garcia (ADP: 77.9) and Austin Riley (74.0), I think that's reasonable enough, though.Â \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Baseball Today: Pasquantino vs Perez after Kauffman fence changes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/20/094935d2-24fc-4f58-8bbf-029eb60c60f7/thumbnail/1200x675/8915d0ed959e61de0eb025bee0a89c36/salvador-perez-imagn.jpg"
      ],
      "datePublished": "2026-01-14T12:56:32.000Z",
      "dateModified": "2026-01-14T12:56:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Tomlin decision puts Steelers at crossroads; NBA midseason awards - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-tomlin-steelers-coaching-search-nba-awards/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/a8759876-7d77-4ad9-acde-ad62a7cab7f0/thumbnail/1200x675/5fa0e40b61b0676a9a9705dab590875f/untitled-design-2026-01-14t011605-958.png",
    "tag": "Sports",
    "date": "2026-01-14T13:54:46.000Z",
    "description": "\n        This is an article version of the CBS Sports HQ AM Newsletter, the ultimate guide to every day in sports. You can sign up to get it in your i",
    "body": "\n        This is an article version of the CBS Sports HQ AM Newsletter, the ultimate guide to every day in sports. You can sign up to get it in your inbox every weekday morning here. \nGood morning and happy hump day, sports fans! It's Austin Nivison greeting you on this Wednesday. We had another NFL coaching job open up yesterday, and it was a big one as Mike Tomlin's time in Pittsburgh has come to an end. Beyond that, there was a significant move on the MLB trade market and an elite player hit the NCAA transfer portal. Let's not waste anymore time and get right to the biggest stories of the da.  ğŸˆ Five things to know Wednesday Mike Tomlin and the Steelers part ways after 19 seasons.Â Tomlin's run as the longest-tenured coach endsÂ after he stepped down as coach of the Steelers. In his nearly two decades with Pittsburgh, Tomlin went 193-114, never had a losing season, made the playoffs 13 times and won Super Bowl XLIII. In all likelihood, the NFL will never see another run like this one, and it leaves Pittsburgh at a crossroads.The Diamondbacks acquired third baseman Nolan Arenado from the Cardinals.Â For over a year, Arenado had been at the center of trade speculation, and those rumors finally came to fruition with the Diamondbacks swinging a deal to land the eight-time All-Star. In addition to Arenado, Arizona also received $31 million in cash while sending pitcher Jack Martinez to St. Louis. Arenado provided diminishing returns in recent years, but the low acquisition cost makes this a good deal for both sides.The Eagles and Chargers are making a change at offensive coordinator.Â Wild card losses have spurred changes in Philadelphia and Los Angeles. After a frustrating season for the Eagles' offense, the teamÂ is done with offensive coordinator Kevin Patullo. The Chargers have also fired their offensive coordinator, Greg Roman, after putting up just three points against the Patriots. Both teams were in need of a change on the offensive side of the ball, and we'll see where they go from here.Colorado OT Jordan Seaton enters transfer portal.Â Any teams in need of an offensive tackle can get their hands on one of the best in the country for the low price of (at least) $2.5 million. Seaton, a former five-star recruit, announced his decision to enter the transfer portal and immediately became the best prospect available. Seaton started all 22 games he played for the Buffaloes and will be a highly-coveted player for championship contenders.Mavericks star Anthony Davis will miss at least six weeks.Â There is some good news and bad news for the Mavericks and Anthony Davis. The bad news is that he is expected to be out for at least six weeks due to ligament damage in his hand. The good news is that Davis won't have to undergo surgery. This injury may delay serious trade talks involving Davis, but it may not put them on ice forever. ğŸ€ Do not miss this: NBA midseason awards \n                                                                    Imagn Images\n                                                            Now that the NBA season is halfway complete, it's time to hand out some midseason awards. Our experts submitted their votes for six different awards, and none of the winners were unanimous. That's how tight these awards races are. In the case of MVP, it may come down to how many games Nikola JokÃ­c misses. He needs to get back soon -- and not just because of the 65-game award policy -- but because Shai Gilgeous-Alexander is starting to pull away. As James Herbert explains, Victor Wembanyama may be in jeopardy of losing out on Defensive Player of the Year for similar reasons. \nHerbert: \"I had Nikola JokiÄ‡ as the MVP before his injury, but it was close enough that SGA's six extra games played give him the edge. By that logic, I couldn't possibly give DPOY to Victor Wembanyama, even though he's the league's best defender. While I considered a few alternatives, I landed on Rudy Gobert, whose defensive impact has been undeniable.\"One player who wasn't mentioned in those awards discussions was Timberwolves superstar Anthony Edwards. He may not be in the MVP race, but he tookÂ the next step in his evolution thanks to his knack for making big plays in crunch time.  ğŸˆ Who will replace Mike Tomlin? \n                                                                    Getty Images\n                                                            Now that the Mike Tomlin era is over in Pittsburgh, the Steelers find themselves in an unfamiliar position. For just the fourth time since 1969, the franchise is in search of a new coach. Replacing Tomlin becomes a daunting task for any coach, but every candidate knows that it will receive plenty of patience from ownership based on the franchise's track record. So, who are those candidates? Bryan DeArdo lays out eight names that should be in the mix, and he explains why Rams defensive coordinator Chris Shula would be a natural fit for the black and gold. \nDeArdo: \"The 39-year-old Shula fits the bill of the type of candidate the Steelers have gone after in the past. Pittsburgh's previous three coaches were in their 30s, had never been head coaches prior and had had success under accomplished head coaches as an assistant. And like Tomlin and Noll, Shula also has a defensive background.\"The Steelers are far from the only vacancy in the league right now -- and that doesn't even take coordinator openings into account. Follow along with a wild NFL coaching carousel right here with our tracker.  â›½ï¸ Miami is fueling an ACC resurgence \n                                                                    Getty Images\n                                                            Just months ago, the ACC looked like a conference in turmoil, at least as far as football was concerned. Heck, after a disastrous result in the ACC title game, the league wasn't even guaranteed a spot in the College Football Playoff. Now, the league has a representative in the national title game, which will be played in its own backyard. Thanks to an improbable playoff run, Miami is one win away from hoisting another national championship trophy. The only thing that would make that win sweeter is the fact that it would come in Hard Rock Stadium, the home of the Canes. All of this means a financial windfall for Miami and the ACC, which caps off a terrific postseason, as Brandon Marcello points out. \nMarcello: \"The ACC is taking a victory lap heading into its first championship game in six years, and it has receipts. The ACC leads the country with a 9-4 bowl record, including a 7-2 mark against power conferences. Nine of the ACC's 17 teams won eight games or more, and the conference finished 8-6 against the SEC, the conference that has geographically and competitively dominated the ACC for the last two decades.\"No, I don't expect Florida State or Clemson fans to be rooting for the Hurricanes on Monday night. No one is that naive. However, those in the ACC offices have to be ecstatic with how the last few weeks have gone.  ğŸ‘ğŸ‘ The best (and not-so-best) of the rest \n                                                                    Getty Images\n                                                            Israel AdesanyaÂ isÂ returning to the OctagonÂ for UFC Fight Night in Seattle.Marcus Freeman has signaled his intent to return to Notre Dame in 2026.How much blame does Justin Herbert shoulder for his lack of postseason success?Rich Paul's fake Lakers trades aren't doing much to help the team's reality.The Eagles are one wild card loser who should expect to make a playoff return in 2026.The Big Ten has floated a 16-team CFP field as a temporary stopgap in expansion talks.Bryson DeChambeau, Jon Rahm and Cameron Smith have reaffirmed their commitment to LIV Golf.As the NBA trade deadline approaches, here's one trade each East team should make.U.S. snowboarding star Chloe Kim will compete in the 2026 Olympics despite a shoulder injury.Is Auburn star Keyshawn Hall the best transfer scorer in CBB history?The Royals are set to make big changes to Kauffman Stadium's dimensions.Barcelona is on the rise in our latest Champions League Power Rankings. ğŸ“º What we're watching Wednesday âš½ Arsenal at Chelsea, 3 p.m. on Paramount+ ğŸ€ Iowa at No. 5 Purdue (M), 6:30 p.m. on Big Ten Network ğŸ€ Ole Miss at No. 21 Georgia (M), 7 p.m. on ESPNU ğŸ€ Cavaliers at 76ers, 7 p.m. on ESPN ğŸ’ Flyers at Sabres, 7:30 p.m. on TNT ğŸ€ No. 13 Illinois at Northwestern (M), 8:30 p.m. on Big Ten Network ğŸ€ No. 14 North Carolina at Stanford (M), 9 p.m. on ACC Network ğŸ€ South Carolina at No. 17 Arkansas (M), 9 p.m. on SEC Network ğŸ€ No. 10 Vanderbilt at Texas (M), 9 p.m. on ESPN2 ğŸ€ Nuggets at Mavericks, 9:30 pm. on ESPN ğŸ€ Nevada at No. 23 Utah State (M), 10 p.m. on CBS Sports Network ğŸ’ Golden Knights at Kings, 10 p.m. on TNT ğŸ€ Arizona State at No. 1 Arizona (M), 10:30 p.m. on FS1 ğŸ€ No. 4 Michigan at Washington (M), 10: 30 p.m. on Big Ten Network ğŸ€ No. 6 Duke at California (M), 11 p.m. on ACC Network ğŸ€ TCU at No. 11 BYU (M), 11 p.m. on ESPN2 \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Tomlin decision puts Steelers at crossroads; NBA midseason awards - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/a8759876-7d77-4ad9-acde-ad62a7cab7f0/thumbnail/1200x675/5fa0e40b61b0676a9a9705dab590875f/untitled-design-2026-01-14t011605-958.png"
      ],
      "datePublished": "2026-01-14T13:54:46.000Z",
      "dateModified": "2026-01-14T13:54:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana's path to CFP National Championship: 10 reasons why Hoosiers reached title game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-path-cfp-national-championship-game-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/71f9f672-2310-47c0-a7be-3bd6555e2d04/thumbnail/1200x675/afead3cd7a4bce060c26e5776e858865/untitled-design-2.png",
    "tag": "Sports",
    "date": "2026-01-14T15:02:02.000Z",
    "description": "\n        In a season filled with landmark moments, No. 1 Indiana is on the precipice of making even more history. The Hoosiers are just one win away f",
    "body": "\n        In a season filled with landmark moments, No. 1 Indiana is on the precipice of making even more history. The Hoosiers are just one win away from ascending to college football's mountaintop as national champions for the first time ever. They'll have to get past No. 10 Miami, which will play inside the friendly confines of Hard Rock Stadium in Miami Gardens, Florida, to do so.Â That might not be a problem for an Indiana team that has passed every challenge with flying colors this season. The Hoosiers blitzed their way through two playoff games against Alabama and Oregon to get to this point. They beat the Crimson Tide and the Ducks by an average of 35.5 points.Â Indiana, which has already won a program-record 15 games, has a chance to become the first college football program in history to go 16-0. While this is just the second year of a potential 16-game season, that's a feat that isn't easily accomplished -- and it wouldn't be easily replicated, either.Â Here are the 10 biggest reasons why Indiana made the national championship game.Â \n1. Fernando MendozaÂ It's hard to start anywhere besides the 2025 Heisman Trophy winner, right? Indiana had solid quarterback play in the first year of Cignetti's tenure, but Mendoza has taken it to another level. He is the most fundamentally sound passer in all of college football. He doesn't make back-breaking mistakes (a point we'll delve into more in a bit) and he puts the ball where it needs to be at all times. He has more touchdowns passing (eight) than incompletions (five) over Indiana's last two playoff wins.Â It also helps that Mendoza has all the natural gifts you want in a quarterback. He can deliver to every level of the field with ease, his mental game is well beyond that of the average college signal caller and he can make plays outside of structure with his athleticism. Mendoza is a solid, gritty runner that isn't afraid to use his legs to pick up crucial yards. He's the complete package and he'll be the No. 1 pick in the 2026 NFL Draft, regardless of what happens Monday.Â 2. Cignetti's cultureÂ \"Culture\" is a word that gets thrown around a lot in college football, but sometimes it's hard to actually see its impact translate on the field. That isn't the case at Indiana. Cignetti's DNA is apparent all throughout his team. It's clear that he demands nothing short of excellence. The Nick Saban comparisons are fair, given that he coached under Saban, who trusted him with recruiting and talent acquisition. A crucial part of that is identifying players that fit into a team's culture, which was paramount at Saban's Alabama. Cignetti has taken that philosophy and molded a team that strives to meet his high standard. They play hard, no matter the score, Â and they play smart.Â \n3. Physicality in the trenchesÂ As a result of that physical mindset, Indiana has mauled just about every team it has seen this season along the trenches. Indiana's offensive line was named the offensive MVP of its Rose Bowl win against Alabama after the Hoosiers paved the way for 215 yards rushing on 4.3 yards per carry. The Crimson Tide, by comparison, had 23 total yards on the ground.Â It's been a similar story all year long. Indiana led the Big Ten while allowing just 75 yards rushing per game. It also led the Big Ten while rushing for 218.3 yards per game. Indiana has allowed 22 sacks in its 15 games. Its defense has gotten to opposing quarterbacks 45 times, or an average of three times per contest.Â \n                                                                    Getty Images\n                                                            4. A veteran bunchÂ No, this is not meant as a slight to Indiana, though some on social media have used the average age of Indiana's starting lineup (which is around 23 years old) to denigrate its accomplishments this season. Cignetti and his staff deserve recognition for quickly adapting to the modern era of college football, which allows coaches to immediately flip their roster by recruiting and adding experienced players. It's obviously a winning formula.Â \nIndiana's starters are, on average, 3.96 years removed from high school. Fifteen of its 22 players in the lineup are on at least their fourth year of college. That includes four of its top five offensive linemen. It doesn't take a rocket scientist to figure out that more physically developed players will beat young blue-chip talent every time.Â Oh, and for the record, Miami is older. Its starters are 4.15 years removed from high school on average.Â 5. Elite turnover marginIndiana is an extremely sound football team. Mendoza isn't the only one that avoids making mistakes -- the entire team is good at taking care of the football. The Hoosiers lead the nation with a turnover margin of plus-21. Mendoza has tossed six interception and Indiana has lost just one fumble.Â \nOn top of that, the defense is very good at forcing turnovers. Indiana has 11 fumble recoveries and 18 interceptions. It's averaging just under two forced turnovers per game. That's a winning clip.Â 6. Studs at linebackerÂ Indiana's defensive line is free to wreak havoc when it knows it has one of the nation's top linebacker groups playing behind it. It's hard to find better duo than Aiden Fisher, a first-team CBS Sports All-American, and Rolijah Hardy. The two have combined for 191 total tackles, 24.5 tackles for a loss and 11.5 sacks. But that's not all. Indiana can also turn to the versatile Isaiah Jones, who has 15.5 tackles for loss and seven sacks of his own.Â Aiden Fisher \n                                                                    Getty Images\n                                                            7. Great evaluations in the transfer portalÂ Indiana has worked the transfer portal better than most schools, even if the rankings, on paper, don't reflect those efforts. That's a testament to Cignetti's talent as an evaluator. Stephen Daley, a three-star transfer from Kent State, was one of Indiana's top defensive linemen before he suffered a season-ending injury. Devan Boykin, a three-star transfer from NC State, has been a key contributor in the secondary. Louis Moore, a three-star transfer from Ole Miss, currently leads the team with six interceptions. Riley Novakowski, a three-star transfer from Wisconsin, has been Indiana's top tight end.Â \nAnd those are just the transfers from the 2025 haul. There are plenty of former under-the-radar prospects from other classes that are still making a big impact for the Hoosiers.Â 8. Historic dominanceIndiana hasn't just won big this season. It has -- mostly -- dragged its opponents through the mud. Indiana's point differential of +473 is the largest in a single season in the College Football Playoff era. The Hoosiers have bludgeoned opposing teams by an average of 31.5 points per contest. Their last three wins against blue bloods Ohio State and Alabama and new blood Oregon have come by a combined score of 107-35. Curt Cignetti's squad has won all but one of its games against ranked opponents by at least 10 points.  \n9. James MadisonÂ Cignetti obviously came to Indiana by way of James Madison. He also brought some of his best players with him. D'Angelo Ponds, Indiana's top cornerback and a potential first-round pick in the 2026 NFL Draft, starred with the Dukes. As did Fisher and wide receiver Elijah Sarratt, who has 62 catches for 802 yards and 15 touchdowns as one of Mendoza's favorite targets. Mikail Kamara, one of Indiana's top pass-rush specialists, was an All-Sun Belt selection at James Madison. Running back Kaelon Black has 960 yards rushing and his 10 touchdowns lead the Hoosiers. James Madison is all over Indiana's football program, to the Hoosiers' benefit.Â \n10. An offense that makes things easyÂ Indiana has one of the smoothest offensive operations in college football. Its RPO-heavy system makes things easy on its own players and a nightmare for opposing defenses. Mendoza, with the mental side of his game, is the perfect man to run the show. He rarely makes the wrong reads, which keeps opponents guessing. This approach also helps the Hoosiers hit on big plays on a consistent basis. The run game, which has produced 3,275 total yards on 5.3 yards per carry, is a legitimate threat. That opens up the rest of the field for Mendoza and his talented receivers to operate.Â \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana's path to CFP National Championship: 10 reasons why Hoosiers reached title game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/71f9f672-2310-47c0-a7be-3bd6555e2d04/thumbnail/1200x675/afead3cd7a4bce060c26e5776e858865/untitled-design-2.png"
      ],
      "datePublished": "2026-01-14T15:02:02.000Z",
      "dateModified": "2026-01-14T15:02:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]