[
  {
    "title": "'Monday Night Football' prediction, odds: Giants vs. Patriots picks from expert on 34-22 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-line-time-giants-patriots-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/6970c796-5bc9-46dd-985d-5f360a550f64/thumbnail/1200x675/70b0ec79686c0d61ab9c3b36b906a560/usatsi-27545774-1.jpg",
    "tag": "Sports",
    "date": "2025-12-01T16:52:52.000Z",
    "description": "\n        The New England Patriots look to extend their winning streak to 10 games when they take on the New York Giants, who look to snap a six-game l",
    "body": "\n        The New England Patriots look to extend their winning streak to 10 games when they take on the New York Giants, who look to snap a six-game losing string, on 'Monday Night Football.' New York is coming off a 34-27 overtime loss at Detroit on Nov. 23, while New England downed Cincinnati 26-20 that same day. The Giants (2-10), who are fourth in the NFC East, are 0-7 and were the first team in the league to be eliminated from postseason consideration. The Patriots (10-2), first in the AFC East, are 4-2 on their home field. Quarterback Jaxson Dart (concussion) has been cleared to return for the Giants.Kickoff from Gillette Stadium in Foxborough, Mass., is set for 8:15 p.m. ET. The all-time series is tied 7-7. The Patriots are 7.5-point favorites in the latest Giants vs. Patriots odds, while the over/under for total points scored is 46.5. Before you make any Giants vs. Patriots picks, make sure to check out the 'Monday Night Football' predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the New York Giants. He is an outstanding 34-22-1 (+1027) on his last 57 New York Giants picks. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Giants vs. Patriots and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Patriots vs. Giants:Giants vs. Patriots                     spreadNew England -7.5 at DraftKings SportsbookGiants vs. Patriots                           over/under46.5 pointsGiants vs. Patriots                           money line New  England -368, New York +289Giants vs. Patriots                       picksSee picks at SportsLineGiants vs. Patriots                           streaming Fubo (Try for free)  Why the Patriots can winSecond-year quarterback Drake Maye is having an MVP-type season. In 12 games, he has completed 71% of his passes for 3,130 yards and 21 touchdowns with six interceptions and a rating of 110.7. He has also rushed 75 times for 307 yards (4.1 average) and two touchdowns. In the win at Cincinnati, he completed 22 of 35 passes for 294 yards and one touchdown with one interception. He has thrown for a touchdown in all but one game this season.His top target is veteran wide receiver Stefon Diggs. In 12 games, he has 61 receptions for 679 yards (11.1 average) and three touchdowns. He has nine explosive plays of 20 yards or more, including a long of 33, with 218 yards after the catch and 35 first-down conversions. In a 27-13 win over the New York Jets on Nov. 13, he caught nine passes for 105 yards. See which team to back at SportsLine. Why the Giants can winNo matter who starts at quarterback for New   York, the Giants have a number of weapons on offense. One of those is fourth-year veteran wide receiver Wan'Dale Robinson. In 12 games, he has 66 receptions for 794 yards (12.0 average) and three touchdowns. He has 13 explosive plays of 20 yards or more, including a long of 50. He has 299 yards after the catch with 31 first-down conversions. In the loss at Detroit, he caught nine passes for 156 yards and one touchdown.Second-year tight end Theo Johnson has also been productive for the Giants. In 12 games, he has 39 receptions for 427 yards (10.9 average) and five touchdowns. He has six big plays over 20 yards, including a long of 41, with 147 yards after the catch and 22 first-down conversions. In a 24-20 loss at Chicago on Nov. 9, he caught seven passes for 75 yards. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Giants vs. Patriots  picksWhite has analyzed Giants vs. Patriots from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Giants vs. Patriots, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Giants vs. Patriots spread you need to jump on, all from the expert that is 34-22-1 on his last 57 New York Giants picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' prediction, odds: Giants vs. Patriots picks from expert on 34-22 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/6970c796-5bc9-46dd-985d-5f360a550f64/thumbnail/1200x675/70b0ec79686c0d61ab9c3b36b906a560/usatsi-27545774-1.jpg"
      ],
      "datePublished": "2025-12-01T16:52:52.000Z",
      "dateModified": "2025-12-01T16:52:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Giants prediction, odds, line: 'Monday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-giants-prediction-odds-spread-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-01T20:00:30.000Z",
    "description": "\n        December football begins with an NFL Week 13 clash on 'Monday Night Football' as the New York Giants visit the New England Patriots. The Pats",
    "body": "\n        December football begins with an NFL Week 13 clash on 'Monday Night Football' as the New York Giants visit the New England Patriots. The Pats (10-2) are riding a nine-game win streak and most recently knocked off Cincinnati, 26-20, last Sunday. The Giants (2-10) have a streak of their own -- a six-game losing streak -- with the last of those being a 34-27 overtime loss to Detroit in Week 12. Jaxson Dart has been cleared to return after missing the last two games with a concussion. The Pats list outside linebacker Harold Landry (knee) as questionable. Kickoff is at 8:15 p.m. ET from Gillette Stadium in Foxborough, Mass. The all-time series between the franchises is tied 7-7, with the Giants winning the last matchup in 2023. New England is the 7.5-point favorite in the latest Patriots vs. Giants odds, while the over/under for total points scored is 46.5. Before making any Giants vs. Patriots picks, be sure to see the NFL predictions from SportsLine's projection model.New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on New England vs. New York. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Giants vs. Patriots:Patriots vs. Giants        spreadPatriots -7.5 at DraftKings SportsbookPatriots vs. Giants             over/under46.5 pointsPatriots vs. Giants             money line Patriots -372 Giants +291Patriots vs. Giants             picksSee picks at SportsLinePatriots vs. Giants     streaming Fubo (Try for free)Why the Giants can coverDart's return is a huge boost as he'll upgrade both the passing and running games, in addition to protecting the ball. Jameis Winston had the same number of turnovers (three) as touchdowns during his two starts, compared to Dart who had 13 total touchdowns versus just two giveaways over his previous five starts. The Giants have gone 6-3 against the spread over their last nine games, with Dart the signal caller for most of that stretch. He and Tyrone Tracy Jr., who's had 130-plus scrimmage yards in each of his last two games, could exploit New England's redzone defense which ranks dead last as over 73% of opponent drives into the redzone have resulted in touchdowns. See which team to back at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states:Why the Patriots can coverNew England's nine-game in streak has included seven spread victories as no AFC team has more ATS wins on the season. Quarterback Drake Maye is an MVP contender as the sophomore quarterback entered Week 13 leading the NFL in both passing yards and completion percentage. He's complemented by rookie RB, TreVeyon Henderson, who has come on strong as of late, averaging 108 scrimmage yards with five total touchdowns over his last three games. The Patriots' defense is also miles ahead of New York's, as the former ranks second in run defense and fourth in points allowed. Meanwhile, the Giants have the dead last run defense and rank 30th in both points allowed and total yards given up. See which team to back at SportsLine. Check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make Giants vs. Patriots     picksFor Patriots vs. Giants   on 'Monday Night Football,' the model is leaning Over the total, projecting 48 combined points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.Who wins Giants vs. Patriots, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Patriots vs. Giants spread you need to jump, all from the model that is 49-33 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Giants prediction, odds, line: 'Monday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2025-12-01T20:00:30.000Z",
      "dateModified": "2025-12-01T20:00:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shakur Stevenson vs. Teofimo Lopez: Boxing match set for Jan. 31 in New York - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/shakur-stevenson-vs-teofimo-lopez-boxing-match-new-york/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/0cffe56e-5ea0-435f-b315-d34140b9e209/thumbnail/1200x675/18331510ccddfd78eefc02c16068dbb2/shakur.jpg",
    "tag": "Sports",
    "date": "2025-12-01T18:17:47.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shakur Stevenson (24-0, 11 KOs) and Teofimo Lopez ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shakur Stevenson (24-0, 11 KOs) and Teofimo Lopez (21-1, 13 KOs) will meet on Jan. 31 in New York in a junior welterweight showdown between two of the biggest American stars in boxing. The venue is still to be decided, but the bout will headline \"The Ring 6\" card in New York City and be streamed on DAZN. Lopez will put his WBO and Ring junior welterweight titles on the line against the undefeated Stevenson, who will move up to 140 pounds for the first time in his career. Stevenson is the WBC world lightweight champion and the No. 8 fighter in CBS Sports' pound-for-pound rankings, and will look to prove his mettle by jumping up a weight class to take on Lopez. Stevenson most recently defended his 135-pound title in a lopsided unanimous decision victory over William Zepeda Segura in July. \"I have never shied away from a challenge and always chased the biggest fights in the sport because I know I am one of the best boxers in the world,\" Stevenson said in a release. \"Teofimo Lopez will learn that firsthand on January 31 when I take his belt and show him that there are levels to this game. New York, get ready for a spectacular performance as I take over a fourth straight weight division.\" \nLopez, meanwhile, has won his last six fights, defending his junior welterweight titles for a fourth time against Arnold Barboza Jr. in a unanimous decision victory back in May. \"Duck, Duck, Goose! Are you ready for New York City?,\" Lopez said. \"Brick city in the concrete jungle, so let's get ready to rumble! The Takeover is here to stay, not play. Make Boxing Great Again is my forte. Shakur will fall in nine.\" \nBoth fighters should be fresh having most recently fought this summer, and will have plenty of support in New York City. Lopez, a Brooklyn native, has fought numerous times in his hometown, while Stevenson is from just across the river in Newark and made his last title defense in Queens. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shakur Stevenson vs. Teofimo Lopez: Boxing match set for Jan. 31 in New York - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/0cffe56e-5ea0-435f-b315-d34140b9e209/thumbnail/1200x675/18331510ccddfd78eefc02c16068dbb2/shakur.jpg"
      ],
      "datePublished": "2025-12-01T18:17:47.000Z",
      "dateModified": "2025-12-01T18:17:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UCLA to hire Bob Chesney: Bruins pluck James Madison coach to reinvigorate program - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ucla-hires-bob-chesney-head-coach-james-madison/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/c44419ff-f9e0-4748-a1e2-187a3ac2d0cd/thumbnail/1200x675/d18907d9eccedfc385469ad067c7b69c/bob-chesney-ucla-getty.png",
    "tag": "Sports",
    "date": "2025-12-01T18:02:54.000Z",
    "description": "\n        The UCLA football coaching search has come to an end. James Madison coach Bob Chesney has been tapped to lead the Bruins and take the first P",
    "body": "\n        The UCLA football coaching search has come to an end. James Madison coach Bob Chesney has been tapped to lead the Bruins and take the first Power Four job of his career, sources confirmed to CBS Sports. Chesney replaces former UCLA coach DeShaun Foster, whom the program fired early in the 2025 season after a dreadful start to the second year of his tenure.James Madison owed Chesney an $833,495 salary for the 2025 season, according to USA Today's coaching salary database, but $140,000 of that pay was set aside as a now-nullified retention bonus.Chesney brings with him to Westwood a lengthy track record as a winner at every NCAA level. He reached conference championship games at each of his previous stops: Salve Regina (Division III), Assumption (Division II), Holy Cross (Division I FCS) and James Madison (DI FBS). For his career, Chesney boasts a pristine 131-51 record with four conference championships and numerous Coach of the Year awards.Chesney's latest achievement was a successful jump to the FBS in a two-year run at James Madison. Despite seeing a number of the Dukes' top players leave for Indiana with former coach Curt Cignetti, Chesney more than kept the program afloat with nine wins in his debut campaign. He took his second squad to the next level, posting an 11-1 record this year and placing James Madison in the hunt for the Group of Five's spot in the College Football Playoff.\n        \n            \n                College football coaching carousel tracker: Grades, analysis on coach changes, 2025-26 firings and hirings\n                \n                    Brandon Marcello                \n            \n                            \n    \n                \n                    \n    \nUCLA's move is the latest example of a program deemphasizing geographic ties with its coaching hire. It is a model that works better in the transfer portal era than in college football days of old where the ability to attract local talent on the recruiting trail was of the utmost importance. Time will tell whether Chesney -- who has never coached outside the Eastern Time Zone -- can win in the West Coast recruiting footprint.\nAs the first school to fire its coach during the 2025 campaign, UCLA had ample time to assess the candidate pool. While interim coach Tim Skipper did an admirable job, the Bruins elected to look outside their own facility for their next full-time coach.Chesney a statement hire for UCLAWhile UCLA struggled to gain its footing in its first two years in the Big Ten, its hire of Chesney signals brighter days could be ahead. Chensey became a nationally relevant name on the coaching carousel because of his winning résumé, and rather than filling one of the many prominent open jobs on the eastern side of the United States, he chose the Bruins as his launchpad into the power conference universe.UCLA also emerged as the head-to-head winner in the coaching hunt against Penn State, which would have been a logical fit for Chesney. The Pennsylvania native attended Dickinson College in Carlisle, Pennsylvania, and spent some of his earliest coaching years in the state. Prying a premier candidate away from a Big Ten foe is a major victory for a Bruins program jockeying for position in the early years of the conference's 18-team era.That Chesney picked UCLA over other potential destinations should invigorate a fanbase that has only seen moderate success over the last decade. The Bruins' hire may be a sign of new commitment to the football program after years of financial struggles and questionable decisions -- the Foster hire among them.\nBrandon Marcello, John Talty, Chris Hummer and Matt Zenitz contributed reporting\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UCLA to hire Bob Chesney: Bruins pluck James Madison coach to reinvigorate program - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/c44419ff-f9e0-4748-a1e2-187a3ac2d0cd/thumbnail/1200x675/d18907d9eccedfc385469ad067c7b69c/bob-chesney-ucla-getty.png"
      ],
      "datePublished": "2025-12-01T18:02:54.000Z",
      "dateModified": "2025-12-01T18:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers' Cam Heyward accuses Bills QB Josh Allen of kneeing him in stomach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-bills-cam-heyward-josh-allen-knee/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/6f8233c8-2712-40ae-8612-c4c116711859/thumbnail/1200x675/4e9cfec43639bf78d1e1f268426153e7/gettyimages-2247137119-2.jpg",
    "tag": "Sports",
    "date": "2025-12-01T18:12:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Josh Allen and Cameron Heyward clearly had heat th",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Josh Allen and Cameron Heyward clearly had heat throughout Sunday's game between the Buffalo Bills and Pittsburgh Steelers. Heyward claims it all stemmed from Allen kneeing him in the stomach. On multiple occasions throughout the 26-7 win for the Bills, Allen and Heyward could be seen invading one another's personal space after the whistle.\"Being kneed in my stomach,\" Heyward said, per Steelers correspondent Mark Kaboly. \"Then I was jawing back and forth. Ticked off the entire game because, as a quarterback, they're protected and I'm not. It just pisses me off.\"Asked whether he believed Allen did it intentionally, Heyward said the Bills quarterback said as much to him on the field at one point.\"Yes, he even said after, 'I had to do something to get you off of me,'\" Heyward said.\nClear video evidence of Allen kneeing Heyward has yet to surface online, but there is one clip in which Heyward and Allen get up from a pile, and the former is clearly upset with the latter.\nThere were several other moments in which tempers flared between the two players. Following a touchdown pass from Allen in the third quarter, Heyward was flagged for taunting when he got into Allen's facemask with his own.\nAllen and the Bills ultimately had the last laugh in the form of a decisive 19-point victory. Now 6-6 on the season, Pittsburgh has to regroup quickly because it goes on the road to face the Baltimore Ravens next week, and first place in the AFC North is on the line.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers' Cam Heyward accuses Bills QB Josh Allen of kneeing him in stomach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/6f8233c8-2712-40ae-8612-c4c116711859/thumbnail/1200x675/4e9cfec43639bf78d1e1f268426153e7/gettyimages-2247137119-2.jpg"
      ],
      "datePublished": "2025-12-01T18:12:28.000Z",
      "dateModified": "2025-12-01T18:12:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bulls had internal talks about trade for Chicago native Anthony Davis, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/chicago-bulls-anthony-davis-nba-trade-rumors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/faf72943-01f3-47f7-96fa-2ca6b63955d1/thumbnail/1200x675/0ab60df505877c452d12532b977a50ac/anthony-davis-bulls.jpg",
    "tag": "Sports",
    "date": "2025-12-01T18:24:06.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a red-hot 6-1 start to the season, the Chica",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a red-hot 6-1 start to the season, the Chicago Bulls have cooled off considerably and slipped back into familiar territory in 10th in the Eastern Conference at 9-10. As trade season approaches, with Dec. 15 being the date most restrictions are lifted for players that signed deals this summer, the Bulls have to decide if they want to be buyers this season. The hot start certainly showed the potential of this group to compete, but now they have to determine if that's worth chasing again or if that was simply an early-season mirage. Those conversations are happening inside the Bulls' facility, and the biggest name popping up in those internal discussions is Chicago native Anthony Davis, per ESPN. Some in Chicago view him as a fix for their leaky defense and a strong veteran to add to bolster their young, talented roster. Others within the organization believe it's too early to take that kind of swing, but the consensus, per the report, is that even if they did make an offer on Davis, they would not be willing to break up their young core to get him or any other veteran. \nThe real question then is how desperate are the Mavs to move Davis. After Dallas fired general manager Nico Harrison last month, the expectation around the league was that the Mavs would at least listen to offers on the star center. Finding a fit for the 32-year-old Davis given his contract and injury history isn't easy, and Dallas will never come close to getting the kind of return in a second Davis trade as what they gave up to get him by trading Luka Dončić. If the Bulls aren't willing to part with their young core -- which definitely includes Josh Giddey and Matas Buzelis, and potentially also includes Coby White -- it's hard to see them being able to make an offer Dallas would be intrigued by, even understanding Davis' trade value is diminished. If White was to be included, that could make it more of a conversation inside the Mavs' front office.\nStill, given Davis' ties to Chicago, the Bulls will be attached to Davis in just about any version of a trade rumors report. Though for now it feels like it would be a surprise to see the Bulls make such a move, especially after their slide, but if they can rebound and find their early season form again to move back into playoff contention, perhaps things will heat up again ahead of the deadline. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bulls had internal talks about trade for Chicago native Anthony Davis, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/faf72943-01f3-47f7-96fa-2ca6b63955d1/thumbnail/1200x675/0ab60df505877c452d12532b977a50ac/anthony-davis-bulls.jpg"
      ],
      "datePublished": "2025-12-01T18:24:06.000Z",
      "dateModified": "2025-12-01T18:24:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lane Kiffin LSU contract: Detailing the $91 million package - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-lsu-contract-details/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/17ee512b-4e70-4706-a6c3-ccd184dd8f63/thumbnail/1200x675/8459f5ad391939c446b5c360a20b16f6/gettyimages-2242969833-1-2.jpg",
    "tag": "Sports",
    "date": "2025-12-01T16:26:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        When Lane Kiffin signed his contract to become the",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        When Lane Kiffin signed his contract to become the next coach of the LSU Tigers, he immediately vaulted into the top three highest-paid coaches in college football. Kiffin inked a seven-year deal worth $91 million that comes with the opportunity to earn more via incentives, according to records obtained by The Advocate.Kiffin's contract pays him $13 million per year before incentives, and that is slightly less than what Kirby Smart makes at Georgia. Kiffin, Smart and Ohio State coach Ryan Day are the only three coaches making beyond $12 million, annually before incentives. Smart and Day are two of just three active coaches with national championships on their resume.One of the escalators in Kiffin's contract, according to the Advocate, requires a raise to make him the highest-paid coach in the country if he wins a national championship. Perhaps the most unique aspects of Kiffin's contract with LSU is that his new school will honor his postseason bonuses at Ole Miss. That means Kiffin could earn up to $1 million if the Rebels go on to win the national championship without him.\nWhen it comes to buyout language, Kiffin would be owed 80% of his remaining contract if LSU fires him without cause. That money would be paid out in monthly installments throughout the remainder of the deal, and it includes no offset language if Kiffin were to get a job elsewhere.At least three schools fought for Kiffin's services -- and he got paid like it. In 14 seasons at the college level, Kiffin compiled an overall record of 117-53. On Black Friday, Kiffin led Ole Miss to its first 11-win regular season and program history, which also likely sealed the team's first College Football Playoff berth.\nWith the playoff looming, Kiffin's messy exit from Oxford left the Rebels scrambling. Ole Miss elevated defensive coordinator Pete Golding to the role of permanent coach, and his staff will have a few weeks to prepare before competing for a national title.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lane Kiffin LSU contract: Detailing the $91 million package - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/17ee512b-4e70-4706-a6c3-ccd184dd8f63/thumbnail/1200x675/8459f5ad391939c446b5c360a20b16f6/gettyimages-2242969833-1-2.jpg"
      ],
      "datePublished": "2025-12-01T16:26:26.000Z",
      "dateModified": "2025-12-01T16:26:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25: Michigan makes big move, Purdue stays at No. 1 in college basketball rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ap-top-25-college-basketball-rankings-purdue-michigan-florida-alabama/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/8e1d5a89-db25-469c-9b63-a54349d35829/thumbnail/1200x675/e4487a91c9e56b72f355ff6514b3d48f/untitled-design-106.png",
    "tag": "Sports",
    "date": "2025-12-01T18:45:01.000Z",
    "description": "\n        The fourth AP Top 25 poll of the 2025-26 season was released Monday, and despite pushes from Arizona and Michigan, Purdue remains the No. 1 t",
    "body": "\n        The fourth AP Top 25 poll of the 2025-26 season was released Monday, and despite pushes from Arizona and Michigan, Purdue remains the No. 1 team in the country. The Boilermakers have been at the top of the poll for the last three weeks -- with the lone exception coming when Houston jumped Purdue in the first in-season poll.The biggest winner of last week was Michigan. The Wolverines went 3-0 in the Players Era Festival and jumped four spots to No. 3 after recording blowout wins over Auburn, San Diego State and Gonzaga. Michigan sits at 7-0 ahead of its first conference matchup of the season against Rutgers on Saturday. Michigan moving up to No. 3 marks the first time since 2015-16 that the Big Ten has multiple teams in top three of the AP poll. \n        \n            \n                Players Era Updates Day 3: Kansas, Iowa State go 3-0 without star guards; No. 3 Houston still work in progress\n                \n                    Matt Norlander                \n            \n                            \n    \n                \n                    \n    \nWhile the Wolverines had a week to remember, reigning national champion Florida had one to forget. The Gators were on the wrong side of an 84-80 upset loss to TCU, which marked their second loss of the young season. Florida's second loss of the 2024-25 campaign came against Missouri in SEC play earlier this calendar year on Jan. 14. Florida dropped five spots to No. 15. Another SEC team, Alabama, also fell out of the top 10, dropping from No. 8 to No. 12 on the heels of a loss to Gonzaga. Another note of significance heading into December is that 14 of the past 17 title winners were undefeated through November -- including the last three champions (Florida and UConn twice). Eight teams enter the latest poll without a loss: Purdue, Arizona, Duke, Michigan State, Indiana, USC, Oklahoma State and UC San Diego.AP Top 251. Purdue (40)2. Arizona (6)3. Michigan (15)4. Duke5. UConn6. Louisville7. Michigan State8. Houston9. BYU10. Iowa State11. Gonzaga12. Alabama13. Tennessee14. Illinois15. Florida16. North Carolina17. Vanderbilt18. Kentucky19. Texas Tech20. Auburn21. Kansas22. Indiana23. St. John's24. USC25. Arkansas\nOthers receiving votes: Iowa 100, UCLA 59, Nebraska 53, TCU 36, Missouri 28, Utah State 16, Saint Mary's 15, Baylor 13, Oklahoma State 12, SMU 12, Clemson 11, LSU 7, Seton Hall 6, Wisconsin 6, NC State 5, Wake Forest 3, California 2, Colorado 1, George Mason 1, Buffalo 1.The race for No. 1 gets interestingThis week, Purdue remained at No. 1, but it had some competition at the top. Arizona received 11 first-place votes and jumped to No. 2 in the poll last week, while Houston received four first-place votes. In this week's poll, Michigan received 15 first-place votes, while Arizona got four. The Wolverines got a huge boost in the rankings after a dominant showing in Las Vegas. Despite that, the voters held strong and kept Purdue at No. 1. It's hard to see anyone else occupying that spot -- for now -- until Purdue loses a game. Notably, the Boilermakers face No. 10 Iowa State this weekend.St. John's continues to fallThere wasn't a team in the poll that dropped further than St. John's did this week. The Red Storm fell nine spots to No. 23 after losing against Iowa State and Auburn. St. John's now has three losses on the season -- the most of any team ranked in the latest poll -- and could be in danger of falling out entirely with another early loss. Rick Pitino's team will have an opportunity during the next three weeks to improve its résumé with games against Ole Miss and Kentucky. St. John's came into this season with lofty expectations, and so far, Pitino's group hasn't met them. St. John's is 0-3 against ranked opponents.\nUSC enters the poll for the first time this seasonUSC improved to 7-0 and captured the Maui Invitational title with a win over Arizona State. The Trojans are now ranked (No. 24) for the first time this season under second-year coach Eric Musselman. The Trojans begin Big Ten play this week with games against Oregon and Washington.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25: Michigan makes big move, Purdue stays at No. 1 in college basketball rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/8e1d5a89-db25-469c-9b63-a54349d35829/thumbnail/1200x675/e4487a91c9e56b72f355ff6514b3d48f/untitled-design-106.png"
      ],
      "datePublished": "2025-12-01T18:45:01.000Z",
      "dateModified": "2025-12-01T18:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Amon-Ra St. Brown's injury could be key factor in Lions' quest for playoffs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/amon-ra-st-brown-injury-detroit-lions-dallas-cowboys-nfc-north/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/4f060c11-2318-4662-ba89-c31d4195ea99/thumbnail/1200x675/6fa865cd0e5b53cd7d5acbd76f8e930c/st-brown.jpg",
    "tag": "Sports",
    "date": "2025-12-01T19:03:04.000Z",
    "description": "\n        It is now officially crunch time for several NFL teams, as the race for the playoffs has begun to intensify. This is actually the first time ",
    "body": "\n        It is now officially crunch time for several NFL teams, as the race for the playoffs has begun to intensify. This is actually the first time in NFL history where there are five divisions that include a lead under one game this late in a season. That includes the NFC North, as the 9-3 Chicago Bears lead the 8-3-1 Green Bay Packers, who are one spot above the 7-5 Detroit Lions.The Bears are now the No. 1 seed in the NFC following the Los Angeles Rams' shocking loss to the Carolina Panthers, but Chicago's newfound top-seed hope could be shortlived. This Sunday, the Bears have to travel to Green Bay to play the Packers who would overtake Chicago in the division with a win. But where does all this leave the Lions?Detroit is now officially a long shot to repeat as division champions, listed at +950 over at FanDuel Sportsbook. In fact, the Lions are currently listed as underdogs to make the playoffs straight up at +122. Following their Thanksgiving loss to the Packers, the Lions are in treacherous waters, and on Thursday night they'll host a red-hot Dallas Cowboys team that has won three straight games, a run which includes back-to-back victories over last season's Super Bowl participants. Check out what SportsLine data expert Stephen Oh's projections say about the Lions' chances:NFC North postseason chances, via SportsLineTeamDivision chancesNFC Championship chancesSuper Bowl chancesChicago Bears40.6%6.2%2.7%Green Bay Packers52.9%16.5%9.3%Detroit Lions6.5%4.1%2.2%Games and seasons don't come down to one play or one player, but if the Lions don't have this one player on the field Thursday against the Cowboys, their playoff chances will take a massive hit. That player is wide receiver Amon-Ra St. Brown.\nThe impact of Amon-Ra St. Brown\nThe Lions' WR1 suffered a low-ankle sprain early in the Week 13 loss to Green Bay, according to NFL Media. The injury can sideline a player for one to two weeks, but St. Brown is going to try to play through it. Remember, Detroit is already without tight end Sam LaPorta, so losing St. Brown could ground Jared Goff's offense.According to CBS Sports Research, the Lions rank No. 1 in yards per play with St. Brown on the field since he began his NFL career in 2021, and No. 25 with him off the field. Detroit also ranks No. 2 in offensive efficiency with St. Brown on the field, and No. 16 with him sidelined. His 505 receptions rank second all-time in a player's first five career seasons, and he's recorded at least 1,161 yards receiving in each of the last three seasons, and double-digit touchdowns in the last two seasons.While the Cowboys famously had a terrible defense early in the season, that is no longer the case. Dallas acquired star defensive tackle Quinnen Williams and linebacker Logan Wilson at the trade deadline, added linebacker DeMarvion Overshown and cornerback Shavon Revel Jr. to the lineup, and cornerback Trevon Diggs is expected back in the near future as well. And those consecutive wins against last seaon's AFC and NFC champs? The Cowboys are actually the only team in NFL history to beat both of the prior season's Super Bowl teams in a five-day span. The fact that they came back from a 21-0 deficit against the Philadelphia Eagles in Week 12, and then fended off Patrick Mahomes and the Kansas City Chiefs on Thanksgiving just adds to the story.\nIf Lions fans are looking for a bit of good news, this team has alternated wins and losses in eight straight games. Plus, the last time the Lions and Cowboys met, Jerry Jones experienced his largest home loss in the form of a 47-9 beatdown. However, this Lions defense has struggled as of late, and the offense could be dealt a tough hand in not having LaPorta or St. Brown on the field for this pivotal Week 14 NFC showdown.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Amon-Ra St. Brown's injury could be key factor in Lions' quest for playoffs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/4f060c11-2318-4662-ba89-c31d4195ea99/thumbnail/1200x675/6fa865cd0e5b53cd7d5acbd76f8e930c/st-brown.jpg"
      ],
      "datePublished": "2025-12-01T19:03:04.000Z",
      "dateModified": "2025-12-01T19:03:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Power Rankings: Miami, Texas in focus amid playoff debates - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-power-rankings-miami-texas-college-football-playoff-debates/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/8666868d-fb71-4223-8aa5-947ebd423237/thumbnail/1200x675/2bc7d31f02fd3ef2e4a502e2bc4d6374/miami-power-rankings.png",
    "tag": "Sports",
    "date": "2025-12-01T18:00:57.000Z",
    "description": "\n\n\n    \n                                    The Hurricanes and Longhorns are staring down a nerve-racking weekend as CFP selection looms\n        \n    ",
    "body": "\n\n\n    \n                                    The Hurricanes and Longhorns are staring down a nerve-racking weekend as CFP selection looms\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 1, 2025\n                            \n                    at\n    1:00 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports Graphic\n            \n            \n    \n        Gentlemen, start your oratory engines. The College Football Playoff arguments for and against Texas, Miami and Vanderbilt have already begun and will only get louder as championship week unfolds across the country.The CFP Selection Committee has a thankless and difficult job, and an incredibly brutal assignment awaits them this week. Signing up for that panel is basically volunteering as tribute for the sport's loudest critics. And this week, the pressure only tightens as school and conference PR machines crank into overdrive. That's expected — everyone should fight for their shot — but the noise can get deafening.Meanwhile, great things happened across the country in the sport over the weekend. Duke -- Duke! -- grabbed a spot in the ACC Championship Game with Cal's stunning upset of SMU, setting up the craziest conference championship game in the league's history. Ohio State finally defeated Michigan in a dominating performance, further solidifying the Buckeyes as the nation's best team. Texas delivered the most complete performance of the weekend, beating previously undefeated Texas A&M 27–17 in a rivalry result that will sting in College Station for years.And then there's UAB? Yes, the Blazers. With 39 players listed out, interim coach Alex Mortensen still took the Blazers on the road and knocked off Tulsa 31–24 for the program's first road win in three seasons.There's plenty of time for us to debate – and, oh, we will debate – about who should be in the playoffs, but remember to give the rest of college football their flowers. The season is already over for nearly half of the sport's teams. There's plenty for us to appreciate.\nLet's dive into the final twists before championship weekend hits full speed.\n        Biggest Movers\n    \n                4\n            \n                Arizona\n            \n                5\n            \n                Texas A&M\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Ohio State\n                                \n                            Ryan Day is off the schneid. Ohio State broke its four-year losing streak in The Game against Michigan with an emphatic 27-9 victory in the Big House. The Buckeyes have won 16 straight games and have won 11 straight by double digits. They're the first team since 1975 to hold their first 12 opponents under 17 points.\n                        \n                            --\n                        \n                            12-0\n                        \n                                2\n                            \n                                    Indiana\n                                \n                            What else can we say about Indiana? The Hoosiers are 12-0 for the first time ever and just scored 50 points for the sixth time this season. If they beat Ohio State in the Big Ten Championship Game this week, will the first Big Ten title since the 1960s also lead Fernando Mendoza to the Heisman Trophy?\n                        \n                            --\n                        \n                            12-0\n                        \n                                3\n                            \n                                    Georgia\n                                \n                            Georgia and Ohio State are the only programs to win 11-plus games in the last five seasons. The Bulldogs face Alabama with a chance to earn back-to-back SEC titles. The win Saturday against Georgia Tech wasn't impressive - Gunner Stockton threw for a career-worst 70 yards - but it was yet another ranked win for the Bulldogs.\n                        \n                            1\n                        \n                            11-1\n                        \n                                4\n                            \n                                    Ole Miss\n                                \n                            Ole Miss completed the greatest regular season in school history, finishing 11-1 with a 38-19 victory at Mississippi State. Then, as expected, the Rebels lost Lane Kiffin to LSU. Defensive coordinator Pete Golding is now in charge, and just how much that affects this team on the field (and in the CFP rankings) remains to be seen. \n                        \n                            1\n                        \n                            11-1\n                        \n                                5\n                            \n                                    Oregon\n                                \n                            Oregon defeated Washington 26-14 to move to 11-1. The Ducks should host a playoff game at Autzen. Dan Lanning has been incredible, leading the Ducks to a 17-1 record in their first two seasons in the Big Ten.\n                        \n                            1\n                        \n                            11-1\n                        \n                                6\n                            \n                                    Texas Tech\n                                \n                            Texas Tech faces BYU for the second time this season when the two meet Saturday at the Big 12 Championship Game. The Red Raiders beat West Virginia in a 49-0 road victory to end the regular season. Joey McGuire's crew knocked off BYU 29-7 in Week 11. We'll see if they can repeat it. If so, they'll be conference champs for the first time since finishing in a three-way tie in the since-defunct Southwest Conference in 1994.\n                        \n                            1\n                        \n                            11-1\n                        \n                                7\n                            \n                                    Notre Dame\n                                \n                            Notre Dame is on a 10-game winning streak since starting 0-2 and should be in the CFP. Head-to-head matchups matter, yes, but let's also admit that teams change from Week 1 to Week 14. Miami should not be ranked ahead of the Irish, who have won these last 10 games by double digits. \n                        \n                            1\n                        \n                            10-2\n                        \n                                8\n                            \n                                    Texas A&M\n                                \n                            We know you're hurting, Aggies. Falling short of an SEC title game appearance because you lost to your rival is hard to swallow, but you're still safely in the playoff. One trend to watch is quarterback Marcel Reed, who didn't throw a touchdown and was picked off twice last week. He's thrown two interceptions in three of the last five games.\n                        \n                            5\n                        \n                            11-1\n                        \n                                9\n                            \n                                    Oklahoma\n                                \n                            It hasn't been easy, and the Sooners have a lot of problems on offense, but they rallied to beat LSU 17-13 and likely secured a spot in the CFP. The good news? The Sooners still won despite committing three turnovers, and that elite defense has forced nine turnovers in the last four games.\n                        \n                            --\n                        \n                            10-2\n                        \n                                10\n                            \n                                    Alabama\n                                \n                            Alabama heads to the SEC Championship Game in a rematch against Georgia, likely needing a win to reach the CFP. The Tide used a 15-play drive in the fourth quarter to pull ahead against Auburn on the road. Ty Simpson threw three touchdown passes.\n                        \n                            --\n                        \n                            10-2\n                        \n                                11\n                            \n                                    Texas\n                                \n                            Let the debates rage. Texas deserves a spot in the playoff. The Longhorns own three wins against AP Top 10 teams, and replace the season-opening trip to No. 1 Ohio State with a top-15 foe or worse, Texas is a two-loss team and is safely in the CFP after beating the Aggies.\n                        \n                            4\n                        \n                            9-3\n                        \n                                12\n                            \n                                    Vanderbilt\n                                \n                            Vanderbilt finally has its first 10-win season in school history. The Commodores beat Tennessee 45-24 on the road to record their fourth win against an AP Top 25 team. Diego Pavia should be in New York City for the Heisman Trophy ceremony. He threw for 268 yards and rushed for a career-high 165 yards against the Vols.\n                        \n                            1\n                        \n                            10-2\n                        \n                                13\n                            \n                                    BYU\n                                \n                            The 1-2 punch of Bear Bachmeier and LJ Martin is potent. Bachmeier threw for 289 yards and a touchdown while only misfiring four times, and Martin rushed for three touchdowns in a 41-21 win against UCF. The Cougars face Texas Tech in the Big 12 Championship Game this week.\n                        \n                            1\n                        \n                            11-1\n                        \n                                14\n                            \n                                    Miami (Fla.)\n                                \n                            Miami needs all the style points it can score to garner attention from the CFP committee. The Hurricanes drilled nationally ranked Pitt by 31 points on the road, but will that be enough? Miami owns four wins against top 25 teams, including the Week 1 victory against Notre Dame. That loss to Louisville, even when the Cards were at full strength, lingers over the program.\n                        \n                            1\n                        \n                            10-2\n                        \n                                15\n                            \n                                    Utah\n                                \n                            Utah has trailed in the fourth quarter in its last two games (both wins), but the Utes have 10 wins for the first time since 2022. Devon Dampier scored three touchdowns. Elijah Davis helped the Utes pull away for the 31-21 victory with a 97-yard interception return midway through the fourth quarter.\n                        \n                            1\n                        \n                            10-2\n                        \n                                16\n                            \n                                    Virginia\n                                \n                            Virginia is in the ACC Championship Game for the first time since 2019 and will be the favorite against five-loss Duke in one of the weirdest conference title matchups in ACC history. The Cavaliers defeated rival Virginia Tech 27-7 to end the regular season with their largest margin of victory in the rivalry since 1991.\n                        \n                            1\n                        \n                            10-2\n                        \n                                17\n                            \n                                    James Madison\n                                \n                            James Madison has the third-best chance to reach the CFP among the Group of Five schools, according to Sportsline, but we've got the Dukes ranked as the top G5 team. The Dukes' lone loss is on the road against a full-strength Louisville, a game the Dukes seemed primed to upset.\n                        \n                            2\n                        \n                            11-1\n                        \n                                18\n                            \n                                    USC\n                                \n                            Lincoln Riley finished his best regular season at USC since his first with a 29-10 victory against UCLA. The nine-win Trojans finished the season undefeated at home and were one win at Oregon away from reaching the CFP. \n                        \n                            2\n                        \n                            9-3\n                        \n                                19\n                            \n                                    Michigan\n                                \n                            Michigan jumped out early against Ohio State, and for a few minutes, it seemed like the ghosts were still circling Ryan Day. Then, the Buckeyes settled down and controlled the rest of the game. The Wolverines managed only 39 yards in the second half.\n                        \n                            5\n                        \n                            9-3\n                        \n                                20\n                            \n                                    North Texas\n                                \n                            North Texas can probably clinch a spot in the CFP with a win against Tulane in the American Conference Championship Game. The Mean Green host the title game in Denton. Oklahoma State has promised Eric Morris he can coach through the CFP, so how will North Texas react this week?\n                        \n                            1\n                        \n                            11-1\n                        \n                                21\n                            \n                                    Tulane\n                                \n                            Tulane is in the American Conference Championship Game for a fourth straight season, a remarkable streak for a program that has had two coaches during that time and will soon have a third. Coach Jon Sumrall took the Florida job over the weekend after defeating Charlotte 27-0.\n                        \n                            4\n                        \n                            10-2\n                        \n                                22\n                            \n                                    Arizona\n                                \n                            What a bounce-back year for Arizona and coach Brent Brennan. The Wildcats won their ninth game with a 23-7 victory against rival Arizona State. Arizona's pass defense is the best in the Big 12, allowing only nine touchdowns.\n                        \n                            NR\n                        \n                            9-3\n                        \n                                23\n                            \n                                    Navy\n                                \n                            Navy defeated Memphis 28-17 on the road and sent Tigers coach Ryan Silverfield out with his third straight loss before taking the Arkansas job. The Midshipmen shut out the Tigers in the second half. Blake Horvath is now the only quarterback in Navy history to pass and rush for 1,000-plus yards in back-to-back seasons.\n                        \n                            NR\n                        \n                            9-2\n                        \n                                24\n                            \n                                    Iowa\n                                \n                            Iowa needs to open up a satellite campus in Lincoln, Nebraska. The Hawkeyes won their seventh straight game on the road in the Nebraska series with a 40-16 blowout Saturday. Mark Gronowski broke the school record for rushing yards (491) by a quarterback in a single season.\n                        \n                            NR\n                        \n                            8-4\n                        \n                                25\n                            \n                                    Georgia Tech\n                                \n                            The Yellow Jackets just don't look like the team from a month ago, but they continue to fight despite losing three of the last four games. Georgia Tech did not score a touchdown in the 16-9 loss against rival Georgia.\n                        \n                            1\n                        \n                            9-3\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Power Rankings: Miami, Texas in focus amid playoff debates - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/8666868d-fb71-4223-8aa5-947ebd423237/thumbnail/1200x675/2bc7d31f02fd3ef2e4a502e2bc4d6374/miami-power-rankings.png"
      ],
      "datePublished": "2025-12-01T18:00:57.000Z",
      "dateModified": "2025-12-01T18:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vikings release Adam Thielen: Veteran WR wants larger role before retiring - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-release-adam-thielen-retirement/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/66168a66-1af9-492f-83e1-42bfd3c3647e/thumbnail/1200x675/488ebc1a534ada1d65f7d52e5a01b94c/thielen.jpg",
    "tag": "Sports",
    "date": "2025-12-01T18:34:51.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Minnesota Vikings have released veteran wideou",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Minnesota Vikings have released veteran wideout Adam Thielen, the team announced on Monday. The 35-year-old receiver was a healthy scratch for the Vikings' Week 13 loss to the Seattle Seahawks, and now he's parting ways with the team after requesting his release in an effort to have a larger role in what he says will be his final NFL season.The Vikings issued a statement saying that Thielen's representation approached the franchise last week about releasing him. In 11 games this year, Thielen has just eight catches for 69 yards on 18 targets.\"Last week Adam's representation approached the team and asked if we would be willing to release Adam, expressing his desire to play a bigger role in the remaining weeks of what he has indicated will be his final NFL season,\" the team said. \"Following discussions through the weekend and out of respect for Adam, we have agreed to give him the opportunity to pursue more playing time elsewhere. Adam is one of the all-time great Vikings, and we wish him and his family continued success.\"Thielen released a statement of his own, confirming that he knew 2025 was going to be his final season and he wants to spend what time he has left on the football field competing.\nThe Vikings traded for Thielen in August after their wide receiving corps was hit with injuries plus Jordan Addison's suspension. The Vikings sent the Carolina Panthers a 2026 fifth-round pick and a 2027 fourth-round pick in exchange for Thielen, a 2026 conditional seventh-round pick and a 2027 fifth-round pick. While his return to Minnesota didn't work out, Thielen is a franchise legend through and through. He was born in Detroit Lakes, Minnesota, played his college football at Minnesota State, was picked up by the Vikings as an undrafted free agent in 2013 and ended up playing nine years for the team. He currently ranks fourth in franchise history in receptions (542), fifth in receiving yards (6,751) and third in receiving touchdowns (55).\nThe Vikings fell to 4-8 with Sunday's loss to the Seahawks, a game started by third-string quarterback Max Brosmer while starter J.J. McCarthy sat out with a concussion. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vikings release Adam Thielen: Veteran WR wants larger role before retiring - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/66168a66-1af9-492f-83e1-42bfd3c3647e/thumbnail/1200x675/488ebc1a534ada1d65f7d52e5a01b94c/thielen.jpg"
      ],
      "datePublished": "2025-12-01T18:34:51.000Z",
      "dateModified": "2025-12-01T18:34:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barcelona vs. Atletico Madrid prediction, odds, best bets from proven expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/barcelona-vs-atletico-madrid-prediction-start-time-best-bets-for-tuesdays-la-liga-match-from-proven-expert/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/0a8d3171-de34-4c44-a704-7ef0f5da06e3/thumbnail/1200x675/5bf969cb94c16824729919ff22a9e688/lewynew.jpg",
    "tag": "Sports",
    "date": "2025-12-01T19:43:05.000Z",
    "description": "\nLa Liga heavyweights Barcelona and Atletico Madrid face off on Tuesday, Dec. 2 with both teams looking to maintain their stellar domestic form. Barce",
    "body": "\nLa Liga heavyweights Barcelona and Atletico Madrid face off on Tuesday, Dec. 2 with both teams looking to maintain their stellar domestic form. Barcelona have won their last four La Liga games while Atletico Madrid have rattled off six straight victories heading into Tuesday's showdown. Barcelona are at the top of the table with 34 points while Atletico Madrid sit in fourth place with 31 points.Kickoff from Camp Nou in Barcelona is set for 3 p.m. ET on Tuesday, Dec. 2. Barcelona are -130 favorites in the latest Barcelona vs. Atletico Madrid odds at DraftKings Sportsbook while the visitors are +290 underdogs. A draw comes in at +320 and the total is 3.5 (Over -105, Under -125). For the latest Barcelona vs. Atletico Madrid game forecast, head to SportsLine.Before locking in your bets for Barcelona vs. Atletico Madrid on Tuesday, you need to see what SportsLine soccer expert Martin Green is betting on in this match.After working in the sports betting industry for several years, Green became a professional sports writer and handicapper and has covered the game worldwide. Last year, Green was profitable in multiple areas on his soccer betting picks, including Euro qualifying (+6.30 units), EFL Cup (+4.47), FA Cup (+3.07) and Champions League (+3.05), among others. Anyone who follows him could be way up.    Here are Green's best bets and analysis   for Barcelona vs. Atletico Madrid on Tuesday.Barcelona vs. Atletico Madrid picksBarcelona money line (-125): 1uBoth teams to score - Over 2.5 goals - Lamine Yamal Over 0.5 shots on goal (+100): 0.5uAtlético Madrid will try to extend their unbeaten streak to eight games when they take on Barcelona at Camp Nou on Tuesday. Los Rojiblancos moved up to third in La Liga after easing to a 2-0 win against Oviedo 2-0 at the weekend. Manager Diego Simeone rested several key players for that game, including star striker Julián Alvarez and defensive stalwart José Maria Giménez.However, Atletico Madrid still looked supremely comfortable, as two goals from Alexander Sørloth wrapped up a routine victory. That result left them three points below Barcelona in the league table, so this will be an important clash in the title race.Barcelona should be close to full strengthBarcelona suffered a humbling 3-0 defeat to Chelsea in the Champions League last week, but their domestic form has been strong. They've won their last four La Liga games, scoring 14 goals in the process. A 3-1 win against Alavés on Saturday left Barça top of the table. Lamine Yamal scored in the ninth minute and Dani Olmo grabbed two goals to seal the win. They will now be determined to maintain the momentum. Barcelona should be close to full strength for the visit of Atlético Madrid. Frenkie de Jong has recovered from an injury, and he could partner Pedri in midfield. Forwards Yamal, Robert Lewandowski, and Raphinha are all available, while Ferran Torres and Marcus Rashford are also vying to start.Barcelona are the top scoring team in La Liga this season, with 39 goals in just 14 games. They have conceded 16 times, but the all-star attack continues to make amends for their defensive vulnerabilities. The sportsbooks make Barcelona the favorites for this game, and it's easy to see why. They have a perfect home record this season with seven wins from seven matches and 23 goals scored to only four conceded. They also have a strong recent record against Atlético. These teams played out a 4-4 thriller in Barcelona back in February, but Barça won the subsequent two meetings in March (4-2) and April (1-0). Both of those wins came on the road, so Barça will be keen to put on a show for their home fans on Tuesday.Atletico's away record is underwhelmingAtlético Madrid's preparations for this game have been ideal. They're on a seven-game winning streak in all competitions, and the players should be fresh. Giménez, Alvarez, Giuliano Simeone, Pablo Barrios, and Matteo Ruggeri can all come into the starting XI after enjoying a breather at the weekend.Los Rojiblancos have been underwhelming on the road this season. They've picked up two wins, three draws, and one defeat from six away games. Atlético did manage to win their last two away matches, beating Real Betis 2-0 and Getafe 1-0 but they'll face a sterner test of their mettle on Tuesday. Camp Nou is a daunting place to visit and Barcelona are in fine form right now. The likes of Alvarez, Sørloth, and Antoine Griezmann should cause problems for Barcelona's defenders. However, Atlético's defense is unlikely to keep Yamal, Raphinha and Lewandowski at bay for 90 minutes. It could be a tight game between two in-form teams, but home advantage should ultimately swing things in Barcelona's favor.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barcelona vs. Atletico Madrid prediction, odds, best bets from proven expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/0a8d3171-de34-4c44-a704-7ef0f5da06e3/thumbnail/1200x675/5bf969cb94c16824729919ff22a9e688/lewynew.jpg"
      ],
      "datePublished": "2025-12-01T19:43:05.000Z",
      "dateModified": "2025-12-01T19:43:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Could Trinidad Chambliss follow Lane Kiffin to LSU? Social media post raises questions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-lsu-ole-miss-trinidad-chambliss-transfer-portal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/8f394ad4-082f-4067-a118-45c66d73b346/thumbnail/1200x675/e69ba5913782fda611c0db0cedd3e724/kiffin.png",
    "tag": "Sports",
    "date": "2025-12-01T17:08:30.000Z",
    "description": "\n        Lane Kiffin has officially departed Ole Miss for LSU, generating a firestorm of reaction following a saga that dominated headlines for weeks.",
    "body": "\n        Lane Kiffin has officially departed Ole Miss for LSU, generating a firestorm of reaction following a saga that dominated headlines for weeks. Now that the decision has finally been made, Kiffin is active on social media once again and one of his first posts since taking the LSU job seemed to include a not-so-subtle reference to a prominent player on the Ole Miss current roster. Perhaps Kiffin's social media usage on Monday is simply playful fodder at his new job with no direct correlation to Ole Miss quarterback Trinidad Chambliss. But given Kiffin's prowess on his phone and penchant for going viral with messaging, that feels unlikely and has led many to wonder if Chambliss could be in Kiffin's crosshairs when the transfer portal officially opens next month.\"Exhale, have the best Monday ever, #GodsPlan,\" Kiffin wrote on \"X\" with a Trinidad and Tobago flag and Tiger emoji.\nOle Miss fans brought the familiar red and blue Trinidad and Tobago flag to games this season in support of Chambliss, who had an all-conference caliber campaign for the Rebels after transferring from Division II Ferris State. It would come as no surprise if Kiffin is planning on trying to poach Chambliss given his production and glove-like fit schematically.\nEntering the College Football Playoff, the senior playmaker hand-picked by Kiffin in last year's portal cycle out has 3,486 yards of total offense and 24 touchdowns, helping Ole Miss to its first 11-win regular season in program history. Coaches in the carousel bring players with them often to their new destination, a sign of the times in the portal era. Could Chambliss and Kiffin reunite in Baton Rouge?Trinidad Chambliss seeking waiver for another year of eligibilityChambliss filed a waiver with the NCAA earlier this season for an extra year of eligibility and is waiting to hear back. Chambliss said after Friday's win over Mississippi State in the Egg Bowl that \"communication\" from the NCAA could come as early as this week, but he's made no public mention of where he plans to play next season if the waiver is granted.\"That would be great for me to get another year,\" Chambliss said. \"Another year in the offense, having the spring and just developing more on this level. That would definitely be huge.\"\nThe future eligibility situation involving Chambliss is complicated. A Division II transfer, Chambliss played four seasons at Ferris State and is arguing that he should be granted a retroactive redshirt for 2022 since he only played in two games that year. Division I redshirt rules differ from his previous classification.\n        \n            \n                The people and places that made Trinidad Chambliss, Ole Miss' breakout star QB living his dreams in the SEC\n                \n                    Shehan Jeyarajah                \n            \n                            \n    \n                \n                    \n    \nChambliss initially redshirted at Ferris State in 2021 and was a backup the next two seasons before emerging as a star in 2024, leading to his arrival at Ole Miss. Under standard NCAA rules, a student-athlete has five academic years to complete up to four seasons of competition. In Division II, however, a redshirt rule wasn't established until this year, leaving Chambliss without another year of eligibility post-2025.Kiffin told ESPN on Sunday afternoon he tried to coach the Rebels through the playoff, but Ole Miss athletic director Keith Carter decided not to allow it.\n\"At the end of the day, that's his decision and I totally respect that,\" Kiffin said. \"I understand that decision. I just totally wish the team the best of luck, wish that I was coaching, but understand that it was a very challenging position for him and the chancellor to be in. Really hope they play really well and hope they win the national championship.\"Kiffin, who went 55-19 over six seasons in Oxford, said he was asked by Carter not to attend Sunday's exit meeting that resulted in defensive coordinator Pete Golding being promoted to head coach. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Could Trinidad Chambliss follow Lane Kiffin to LSU? Social media post raises questions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/8f394ad4-082f-4067-a118-45c66d73b346/thumbnail/1200x675/e69ba5913782fda611c0db0cedd3e724/kiffin.png"
      ],
      "datePublished": "2025-12-01T17:08:30.000Z",
      "dateModified": "2025-12-01T17:08:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Bulls reportedly want to emulate the Pacers, but being an NBA copycat doesn't work - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/bulls-copy-pacers-roster-building/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/2c0f64ca-bbd5-4980-b97b-e5327ba666ea/thumbnail/1200x675/0843551ab6b74956ee8d027696b54ead/josh-giddey-bulls-pacers-getty.png",
    "tag": "Sports",
    "date": "2025-12-01T19:50:52.000Z",
    "description": "\n        Who are the Chicago Bulls? It's one of the more persistent questions of the early 2025-26 season. Their 6-1 start -- which came on the heels ",
    "body": "\n        Who are the Chicago Bulls? It's one of the more persistent questions of the early 2025-26 season. Their 6-1 start -- which came on the heels of a successful end to last season -- suggested that this was a team on the rise. They've lost nine of their 12 games since. That, in itself, doesn't necessarily need to be damning. Growth isn't linear, and developing identities is usually a bumpy process. The 2022 Celtics were below .500 in mid-January before reaching the Finals. Last year's Pacers were 16-18 on New Year's Day.That Pacers comparison is appropriate. Chicago has emulated components of what made Indiana so successful in recent years, most notably its speed. That hasn't been an accident. In a deeply reported Bulls feature for ESPN, multiple sources cited the Pacers as a source of roster-building inspiration for Chicago. \"That's who we have to be,\" head coach Billy Donovan said. \"We have to be better than the sum of our parts. ... Everybody sees Indiana play, and the thing that everybody goes to right away is oh, their pace, their pace, their pace.\"Another Bulls source cited the Pacers as an example of what might come next for Chicago. \"They have Haliburton, who is an All-Star, and they have Siakam,\" the source said. \"If Giddey can develop into an All-Star and be what Hali was, when do we pull the trigger to get our Siakam?\"\n        \n            \n                NBA quarter-season grades for every East team: Knicks, Cavs can improve, Pistons get 'A+' and one team fails\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nThe concept of following another team's blueprint gets bandied about in roster-building discussions somewhat frequently, but it's worth asking how often that approach really works. Look at the best teams in the NBA today. Did Oklahoma City copy anyone? They tanked aggressively for two years, but nobody has a patent on losing. They are stylistically defined by one MVP-level scorer and wave after wave of All-Defense-caliber role players. There's not exactly a model for what they've built.\nDenver? Of course the Nuggets didn't copy anyone. They have Nikola Jokić, who is one of a kind. Their roster build has more or less boiled down to finding players that make sense next to him, specifically: defensive-minded, athletic forwards that can cut (Aaron Gordon, Peyton Watson, Bruce Brown on the smaller side), shooting wings (Michael Porter Jr., Cam Johnson, Tim Hardaway Jr.), a backup center who can serve as an offensive hub in the best of times (DeMarcus Cousins, Jonas Valančiūnas) and of course, a high-level guard creator who developed a unique chemistry with their big man (Jamal Murray).Houston? They certainly modeled their asset accumulation after Oklahoma City, but their playing style is distinct. Think of their historic offensive rebounding. That was seemingly a market inefficiency they identified early. They led the league in offensive rebounding rate by a mile during the 2022-23 season. At that point, league-wide offensive rebounding was at an all-time low. The 2022-23 season saw the eighth-lowest league-wide offensive rebounding rate in history, but the seven seasons with lower ones were the seven preceding seasons. Houston jumpstarted the league's shift toward offensive rebounding last season, when they won playing Alperen Sengun and Steven Adams together primarily to maximize their offensive rebounding.The best teams by and large tend to be trendsetters, not followers. This season has had the highest league-wide offensive rebounding rate since the 2012-13 campaign. The Rockets are primarily responsible for that. League-wide 3-point attempts are down year over year, and so are ball screens. Denver isn't the only team responsible for that shift, but it's hard not to view the Nuggets as a model of how a team can win with ball-movement and limited 3-point shooting. The Thunder have led the league in drives in four of the past five seasons. Last year, only the Grizzlies and Thunder averaged at least 54 drives per game. This year, seven teams have crossed that threshold.\nCommon teams look at the best organizations in the league and try to emulate them. They usually just build pale imitations of the true contenders they're copying. We see versions of this story play out almost every year. Remember when the Lakers won the title in 2020? Everyone assumed that the only way to keep up with them would be to stockpile big men to throw at Anthony Davis and their enormous front line. Several contenders threw ill-fated contracts at centers specifically to combat the Lakers. Utah gave Derrick Favors a three-year mid-level deal that's still the Jazz today, as they had to give the Thunder a valuable first-round pick just to dump the contract a year later. The Clippers swung and missed on Serge Ibaka, and Boston did the same with Tristan Thompson. Mason Plumlee was a backup who hardly played in the Western Conference finals against the Lakers. He still managed to parlay his size into a big three-year deal with the Pistons. The entire league shifted off of one championship run.And it didn't exactly pay off. The Bucks played big lineups when they won the 2021 championship, but Giannis Antetokounmpo is inimitable. The Western Conference champion Suns were a one-big team. And then the Warriors reclaimed the title a year later with Draymond Green starting at center in the last three games of the Finals, much as he did in 2015, when the Golden State dynasty began. Time, in the NBA, is a flat circle.This is the danger in chasing trends. They change so quickly that by the time you've successfully copied whoever you're trying to copy, the league has adjusted to whatever made that original team so successful. That doesn't put an expiration date on stylistically distinct teams. The best ones are capable of some measure of adaptation, but are also so good at what makes them special that they can overcome league-wide adjustment in ways that copycats often can't.\nSo let's compare the Pacers and the Bulls. Josh Giddey does share stylistic similarities with Tyrese Haliburton. They're both transition maestros, after all, and Giddey has improved markedly as a 3-point shooter lately, which is a Haliburton staple. But Giddey only really makes 3s off the catch. Haliburton made 39 pull-up 3s in last year's playoffs alone. Giddey has made 35 in total over the last four seasons. Giddey has never shot better than 53% on 2s, and he's at just 50.9% as a Bull in a higher-usage role. In Haliburton's three full seasons as a Pacer, he's made 58% of his 2s. Giddey can do some of the things that Haliburton does, but that doesn't mean he can be for Chicago what Haliburton has been for Indiana.The notion of finding their own Siakam is similarly fraught. All-Star forwards very rarely become available. When they do, they typically either come with enormous prices (we live in a world in which Mikal Bridges went for five first-round picks) or they have a specific destination in mind that is usually closer to contention than the Bulls are now. The Bulls could aim for a star trade, but there's no guarantee they could make one without gutting their team. Even trading for Anthony Davis, as ESPN reported they've considered, comes with taking on a max salary. The Siakam trade, for Indiana, was in many ways a case of \"right place, right time.\" A player who made sense for them was available at a price that made sense for them. Siakam's age, his shooting, and his impending free agency made him gettable for the Pacers without sacrificing anything from their core. They pounced, and the rest is history. If anything, Chicago's best chance at a Siakam-esque forward is probably internal with Matas Buzelis, but he has a long way to go before that becomes a possibility.The Pacers have had a ton of success with so-called \"second draft\" players, highly drafted youngsters who didn't quite pan out with their original teams. Think Aaron Nesmith and Obi Toppin. This is another tactic the Bulls have tried to copy. They by and large seem happy with Giddey thus far, though again, they may be setting expectations a bit too high for him. Isaac Okoro is still more or less the same player he was in Cleveland: a decent defender who can make wide-open looks, but still shoots at modest volume and likely won't be guarded in high-leverage moments.\nIf you squint at Chicago's roster, almost everyone seems like a slightly worse version of an Indiana equivalent. The Pacers hit a home run with Andrew Nembhard at top of the second round. The Bulls hit a solid double with Ayo Dosunmu in the same range of the drafts. The Pacers had shooting center in Myles Turner. The Bulls do too in Nikola Vučević, but he doesn't defend nearly as well as Turner. That has made it far harder for the Bulls to copy the Pacers defensively. In 2024, the Pacers, sensing their defensive vulnerability, decided to essentially punt on rim-protection in favor of 3-point defense. They were the only team to allow fewer than 30 3-point attempts per game, but in exchange, they allowed the most paint points per game in the league. The Bulls allow the second-most paint points per game this season behind only the tanking Wizards, but their opponents take the seventh-fewest 3s per possession in the league.This is the real pitfall of trying to copy another team's roster-build. What are the odds that you're going to build a better version of the Pacers than the Pacers did? Especially since the Pacers still exist, and Chicago will have to compete against them moving forward. The irony of all of this is that it seems as though the Bulls are trying harder to be the Pacers than the Pacers did.The Siakam trade was opportunistic. So, frankly, was the Haliburton acquisition. Rick Carlisle was never locked into the idea of playing fast. In fact, his last six Mavericks teams were below league-average in terms of pace. Because that's what his rosters dictated. The Pacers formed their style around their players. They drafted well and traded aggressively for who was available, not a predetermined set of players that they wanted. What they built was organic to the players they had. They made the most of who they could acquire.\nThe danger of locking into someone else's course is that you're not going to be presented with all of the same roster-building opportunities that they were. A Siakam-esque addition might never be available to the Bulls. Giddey probably won't ever be Haliburton. The Bulls don't have a top-five pick in a loaded draft coming as the Pacers do. But the Bulls may at some point in the next few years have access to roster-building opportunities that the Pacers didn't, things that might force them to adjust the way that they're playing or the sort of players they intend to target.When that happens, they're going to have to keep an open mind, because there's just no way to out-Pacers the Pacers, or out-Thunder the Thunder, or out-Nuggets the Nuggets. What the Bulls can do is become the best possible version of the Bulls. That's how you build a contender in the NBA. You can only get so far playing the copycat game.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Bulls reportedly want to emulate the Pacers, but being an NBA copycat doesn't work - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/2c0f64ca-bbd5-4980-b97b-e5327ba666ea/thumbnail/1200x675/0843551ab6b74956ee8d027696b54ead/josh-giddey-bulls-pacers-getty.png"
      ],
      "datePublished": "2025-12-01T19:50:52.000Z",
      "dateModified": "2025-12-01T19:50:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NC State, Virginia to meet in Brazil for first college football game in South America - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/nc-state-virginia-college-football-brazil-south-america/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/cec792ce-1536-4d32-9f18-ed06a215230c/thumbnail/1200x675/93cf91674a1eda51725d01290676b324/nc-state-virginia-football.jpg",
    "tag": "Sports",
    "date": "2025-12-01T16:31:51.000Z",
    "description": "\n        NC State and Virginia will do something unique to open the 2026 season -- play the first college football game in South America. The ACC memb",
    "body": "\n        NC State and Virginia will do something unique to open the 2026 season -- play the first college football game in South America. The ACC members face off on Saturday, Aug. 29 in Rio de Janeiro, Brazil, for the first-ever FBS game on the continent. The matchup, dubbed \"College Football Brasil,\" will also serve as the ACC conference opener for both teams after the schools converted a previously scheduled non-conference series into a league game.The international game will be played at Nilton Santos Stadium, also known as Engenhão, a 44,661-seat venue that has hosted the 2016 Summer Olympics and Copa America. Virginia will be the designated home team.\"To have NC State and Virginia open our conference schedule on an international stage in Rio de Janeiro speaks to the vision, innovation and collaboration of our league,\" ACC commissioner Jim Phillips said in a release. \"This is an extraordinary moment for the ACC and for college football.\"\n        \n            \n                Bowl projections: Miami shines as bubble team in focus, Texas joins College Football Playoff discussion\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nNC State and Virginia previously agreed to a home-and-home non-conference series after the ACC did not schedule matchups between the rivals in 2025 and 2026. Including the 2025 matchup in Raleigh, in which the Wolfpack won 35-31, the two teams have played just eight times since 2006.\nIn September, ACC athletic directors voted to move the league to a nine-game conference schedule starting in 2026. As a result, the 2026 game between NC State and Virginia was converted from a non-conference contest into an official ACC conference game, ensuring the matchup counts toward league standings.\"We're excited about the opportunity to play a game in a beautiful, world-renowned city like Rio de Janeiro and to bring American football to another continent,\" NC State athletic director Boo Corrigan said. \"It's definitely a unique situation to play a road game versus Virginia in Brazil, but it should be an unforgettable experience.\"The Wolfpack and Cavaliers have a long-standing rivalry dating back to 1904. NC State leads the all-time series 38-22-1. The Brazil game will add an unprecedented chapter to their matchup history.\n\"This is a great opportunity for the University of Virginia and our football program,\" Virginia athletic director Carla Williams said. \"UVA is already recognized globally, and this event allows us to expand our international presence, both as a leading academic institution and as a premier athletics program. We're honored to participate in such a historic event and thrilled that Brazil will be our host.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NC State, Virginia to meet in Brazil for first college football game in South America - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/cec792ce-1536-4d32-9f18-ed06a215230c/thumbnail/1200x675/93cf91674a1eda51725d01290676b324/nc-state-virginia-football.jpg"
      ],
      "datePublished": "2025-12-01T16:31:51.000Z",
      "dateModified": "2025-12-01T16:31:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]