[
  {
    "title": "Computer model locks in Seahawks vs. Rams picks, score prediction, SGP for NFL Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-rams-where-to-watch-nfl-week-11-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/90f0b4a4-a036-4d9a-a2b9-9f2453f4c528/thumbnail/1200x675/30d5090bd5b4cb438689711572338b22/kyren-williams-rams-imagn.jpg",
    "tag": "Sports",
    "date": "2025-11-15T21:55:18.000Z",
    "description": "\n        One of the most important games of the 2025 season so far will take place in Week 11 when the Seattle Seahawks visit the Los Angeles Rams at ",
    "body": "\n        One of the most important games of the 2025 season so far will take place in Week 11 when the Seattle Seahawks visit the Los Angeles Rams at SoFi Stadium. The Seahawks and Rams are tied for the lead in the NFC West at 7-2, which also puts them in a three-way tie with the Eagles for the top seed in the conference. Both squads have designs on making a Super Bowl run, and both have quarterbacks playing like MVP candidates. Sam Darnold has continued his career resurgence with the Seahawks, while Matthew Stafford has been on a tear for the Rams. This should be one of the most exciting games of the Week 11 slate.Click here to bet Seahawks vs. Rams at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Seahawks vs. RamsBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Seahawks vs. Rams on SundayWhen: Sunday, Nov. 16Time: 4:05 p.m. ETTV: FOXFollow along: CBS Sports AppSeahawks vs. Rams betting previewOdds: Rams -3, over/under 48.5These are two of the best scoring offenses in the league. The Seahawks are third in points per game while the Rams are fifth, so fans might be expecting points. However, these defenses are no slouches either. The Rams are second in scoring defense while the Seahawks are fifth. This will be a true test of strength on strength in all facets. Seattle is 6-3 to the Over while Los Angeles is 4-5 to the Over.Seahawks vs. Rams SGPUnder 48.5 (-108)Kyren Williams anytime touchdown (+110)Zach Charbonnet anytime touchdown (+145)Final odds: +891 (wager $100 to win $891)Click here to bet Seahawks vs. Rams at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Seahawks vs. Rams score prediction, picksThe SportsLine Projection Model does believe the Under 48.5 points will hit despite all the offensive firepower on both sides. It has the Under hitting in 62% of simulations. The model is backing Seattle as a 3-point underdog, saying the Seahawks cover in 51% of simulations. They offer more value on the money line as +143 underdogs, as they win in 47% of simulations to bring value at that number.Seahawks vs. Rams score prediction: Rams 23, Seahawks 22Want more Week 11 NFL picks?You've seen the model's best bets for Seattle Seahawks vs. Los Angeles Rams. Now, get against the spread, total and money-line picks for every Week 11 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Seahawks vs. Rams picks, score prediction, SGP for NFL Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/02/90f0b4a4-a036-4d9a-a2b9-9f2453f4c528/thumbnail/1200x675/30d5090bd5b4cb438689711572338b22/kyren-williams-rams-imagn.jpg"
      ],
      "datePublished": "2025-11-15T21:55:18.000Z",
      "dateModified": "2025-11-15T21:55:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in 49ers vs. Cardinals picks, score prediction, SGP for NFL Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-cardinals-where-to-watch-nfl-week-11-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/64b154b4-0eef-4ff4-928f-578635888768/thumbnail/1200x675/d7c69c017a28c62fc5d8ec80f8f6717f/christian-mccaffrey-san-francisco-49ers-imagn-images-3.jpg",
    "tag": "Sports",
    "date": "2025-11-15T22:02:10.000Z",
    "description": "\n        An NFC West clash is one of the late-afternoon games for Week 11 of the NFL season when the Arizona Cardinals host the San Francisco 49ers. T",
    "body": "\n        An NFC West clash is one of the late-afternoon games for Week 11 of the NFL season when the Arizona Cardinals host the San Francisco 49ers. The 49ers are 6-4 and are coming off a loss to the Los Angeles Rams, while the Cardinals are 3-6 after losing to the Seattle Seahawks. San Francisco won this matchup back in Week 3 by a final score of 16-15.Kickoff from State Farm Stadium is set for 4:25 p.m. ET on FOX. The 49ers are 3-point favorites, according to the latest 49ers vs. Cardinals odds. The over/under for total points scored is 48.5. Before making any 49ers vs. Cardinals picks, make sure you check out the NFL picks from the SportsLine Projection Model.Click here to bet 49ers vs. Cardinals at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on 49ers vs. CardinalsBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch 49ers vs. Cardinals on SundayWhen: Sunday, Nov. 16Time: 4:25 p.m. ETTV: FOXFollow along: CBS Sports App49ers vs. Cardinals betting previewOdds: 49ers -3, over/under 48.5This was a low-scoring affair back in Week 3, with just 31 points scored. Even with that in mind, each team has played to the Over this year more than the Under, with six of San Francisco's 10 games going Over, and five of Arizona's nine games have as well. The 49ers are 5-5 against the spread, while the Cardinals are 5-4 ATS.Click here to bet 49ers vs. Cardinals at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:49ers vs. Cardinals SGPUnder 48.5 (-112, DraftKings)49ers -3 (-108, DraftKings)49ers first to score (-135, DraftKings)Final odds: +535 at DraftKings (wager $100 to win $535)Model's 49ers vs. Cardinals score prediction, picksThe model has the 49ers winning this Week 1 rematch in the majority of simulations, but it does see value in backing the Cardinals on the money line at plus odds as Arizona wins outright in 44% of simulations. The model leans to the Under here, as that hits in nearly 60% of simulations, and this was a very low-scoring game back in Week 3 when both teams were healthier than they are now.49ers vs. Cardinals score prediction: 49ers 25, Cardinals 22 Want more Week 11 NFL picks?You've seen the model's best bets for San Francisco 49ers vs. Arizona Cardinals. Now, get against the spread, total and money-line picks for every Week 11 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in 49ers vs. Cardinals picks, score prediction, SGP for NFL Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/64b154b4-0eef-4ff4-928f-578635888768/thumbnail/1200x675/d7c69c017a28c62fc5d8ec80f8f6717f/christian-mccaffrey-san-francisco-49ers-imagn-images-3.jpg"
      ],
      "datePublished": "2025-11-15T22:02:10.000Z",
      "dateModified": "2025-11-15T22:02:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants vs. Packers: Where to watch NFL Week 11, score prediction, betting odds, sportsbook promos, SGP picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-packers-where-to-watch-nfl-week-11-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/ce0919e5-3778-4b64-92cd-e4de127e9ef0/thumbnail/1200x675/bb3f036de62dbac2bd17c982a9a12d64/jam.jpg",
    "tag": "Sports",
    "date": "2025-11-15T21:46:08.000Z",
    "description": "\n        The New York Giants will turn to their third quarterback of the season when they host the Green Bay Packers in Week 11 of the NFL season. Wit",
    "body": "\n        The New York Giants will turn to their third quarterback of the season when they host the Green Bay Packers in Week 11 of the NFL season. With rookie QB Jaxson Dart injured and Russell Wilson proving ineffective, interim head coach Mike Kafka will give the ball to Jameis Winston. The Packers, meanwhile badly need a win after an ugly Monday Night Football game with the Eagles resulted in Green Bay's second straight loss.Kickoff from MetLife Stadium is set for 1 p.m. ET on FOX. The Packers are 7-point favorites, according to the latest Giants vs. Packers odds. The over/under for total points scored is 43. Before making any Giants vs. Packers picks, make sure you check out the NFL picks from the SportsLine Projection Model.Click here to bet Giants vs. Packers at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Giants vs. PackersBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Giants vs. Packers on SundayWhen: Sunday, Nov. 16Time: 1 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppGiants vs. Packers betting previewOdds: Packers -7, over/under 43The Giants are 5-5 against the spread and 5-5 to the Over. The Packers are 3-6 ATS and 5-4 to the Under. The Over has hit in four of the Giants' last five games.Giants vs. Packers SGPWan'Dale Robinson anytime touchdown scorer (+200)Tyrone Tracey Over 39.5 rushing yards (-114)Christian Watson Over 39.5 receiving yards (-114)Final odds: +794 (wager $100 to win $794)Click here to bet Giants vs. Packers at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Giants vs. Packers score prediction, picksThe SportsLine Projection Model has slight leans to the Packers covering -7 (53% of the simulations) and the Over hitting (52%). Green Bay wins in 70% of the model's simulations, but the Giants offer more betting value at +293 on the money line.Giants vs. Packers score prediction: Packers 27, Giants 18Want more Week 11 NFL picks?You've seen the model's best bets for New York Giants vs. Green Bay Packers. Now, get against the spread, total and money-line picks for every Week 11 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants vs. Packers: Where to watch NFL Week 11, score prediction, betting odds, sportsbook promos, SGP picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/ce0919e5-3778-4b64-92cd-e4de127e9ef0/thumbnail/1200x675/bb3f036de62dbac2bd17c982a9a12d64/jam.jpg"
      ],
      "datePublished": "2025-11-15T21:46:08.000Z",
      "dateModified": "2025-11-15T21:46:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA betting investigation: Multiple teams asked to hand over cell phones, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-betting-investigation-lakers-damon-jones-phones-evidence/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/95838621-9058-46a7-9435-a76d53b310b9/thumbnail/1200x675/c413b7082f94884974d42fb7331618ad/lakers-getty.png",
    "tag": "Sports",
    "date": "2025-11-16T02:29:03.000Z",
    "description": "\n        Multiple NBA teams, including the Los Angeles Lakers, have been asked by the league to hand over cell phones and documents as part of its con",
    "body": "\n        Multiple NBA teams, including the Los Angeles Lakers, have been asked by the league to hand over cell phones and documents as part of its continued investigation into illegal sports betting, according to The Athletic. Late last month, Portland Trail Blazers coach Chauncey Billups, Miami Heat guard Terry Rozier and former player and coach Damon Jones were arrested by the FBI amid a wide-ranging investigation into rigged poker games and illegal sports betting. The scandal rocked the NBA and the sports world and the league has recently faced scrutiny from Congress over its gambling policies and relationship with sportsbooks. \"The NBA engaged an independent law firm to investigate the allegations in the indictment once it was made public,\" an NBA spokesman told The Athletic in a statement. \"As is standard in these kinds of investigations, a number of different individuals and organizations were asked to preserve documents and records. Everyone has been fully cooperative.\"In particular, Congress has sought answers as to why Rozier was allowed to continue playing after the league looked into suspicious betting patterns regarding a March 2023 game. Rozier played in more than 100 games before he was arrested in October. NBA commissioner Adam Silver said last month that the league \"couldn't find anything.\"\n\"Terry, at the time, cooperated and gave the league office his phone. He sat down for an interview. We ultimately concluded that there was insufficient evidence -- despite that abberational behavior -- to move forward,\" Silver said. \"We then worked directly with law enforcement -- as they said at the press conference, the league has been cooperating. That was obviously over two years ago. The federal government has subpoena power, can threaten to put people in jail, can do all kinds of things that the league office can't do. We've been working with them since then.\"\n        \n            \n                NBA gambling scandal: Adam Silver makes first public comments, says he was 'deeply disturbed' by allegations\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nAfter meeting with Congress, the NBA, through an outside law firm, reportedly began contacting teams to request phones, phone records and other items and documents as part of an expanded investigation into illegal gambling. At least 10 Lakers employees are reportedly expected to be asked to surrender phones and phone records. Lakers assistant trainer Mike Mancias and executive administrator Randy Mims have already surrendered their phones and are cooperating with the investigation, per The Athletic. \nNeither Mancias nor Mims have been charged with a crime, nor were they named in either of the indictments filed by the Department of Justice. According to prosecutors, Jones sold information relating to the injury status of Lakers players and on at least one occasion allegedly received information from an unnamed trainer. The players were not named in the indictment, but context points to them being LeBron James and Anthony Davis. \n        \n            \n                NBA gambling investigation: Damon Jones allegedly sold information about LeBron James, Lakers\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nJames reportedly had no knowledge that Jones was selling information about his injury status. \nOn Nov. 6, Jones pleaded not guilty to two charges. He was released on a $200,000 bond and he is prohibited from gambling or making contact with organized crime as part of the bond terms.In the wake of the DOJ's indictments, the NBA has begun the process of reviewing its gambling policies and exploring methods to protect the league and its players. \"Given the spread of legal betting to the majority of U.S. states, the recurrence of integrity issues across sports, and the emergence of novel betting formats and markets,\" the league said in a memo last month. \"this is an opportune time to carefully reassess how sports betting should be regulated and how sports leagues can best protect themselves, their players, and their fans.\"\nThe league is also \"barreling toward substantial changes in team rules for reporting injury statuses,\" according to The Athletic.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA betting investigation: Multiple teams asked to hand over cell phones, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/95838621-9058-46a7-9435-a76d53b310b9/thumbnail/1200x675/c413b7082f94884974d42fb7331618ad/lakers-getty.png"
      ],
      "datePublished": "2025-11-16T02:29:03.000Z",
      "dateModified": "2025-11-16T02:29:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 322 results: Erin Blanchfield scores late submission of Tracy Cortez - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-322-results-highlights-erin-blanchfield-tracy-cortez-submission/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/e5fafef5-8c11-4420-8c67-41c2b55bfaad/thumbnail/1200x675/82c828d1520a66cc540c187eb7588f97/erin-blanchfield-winner-spike-322.jpg",
    "tag": "Sports",
    "date": "2025-11-16T02:20:01.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After getting picked apart on the feet by Tracy Co",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After getting picked apart on the feet by Tracy Cortez's boxing skills for nearly two rounds, women's flyweight contender Erin Blanchfield finally shifted to her A-game of wrestling on Saturday. It didn't take long after that until the fight was over. Blanchfield (14-2) took a huge step closer toward a possible 125-pound title shot by submitting Cortez (12-3) via rear-naked choke in Round 2 of their rematch at UFC 322 inside Madison Square Garden. The finish came at 4:44 as Blanchfield avenged a split-decision loss to Cortez on the regional MMA scene at Invicta FC 34 in 2019.\"I'm really excited,\" Blanchfield said. \"I really wanted to avenge this [loss].\"Be sure to keep up with all the action on Saturday with our live coverage of UFC 322, including round-by-round scoring and updated fight results throughout the night!Cortez controlled the opening round with her quick hands and knees to the body in the clinch. But it was a competitive round in which Blanchfield failed to attempt a single takedown. \nThat eventually changed in Round 2 after a series of even exchanges on the feet that saw both flyweights bleed from the nose. But it was Cortez who ultimately shot first with a successful double-leg takedown that Blanchfield reversed.Blanchfield's first shot came shortly after but it was Cortez, thanks to a blatant grab of the fence that referee Blake Grice never saw, that quickly returned to her feet. A visibly frustrated Blanchfield then turned a standing clinch into a running takedown attempt across the cage that ended with her quickly taking the back of Cortez on the ground. \nShortly after Blanchfield applied the choke and fell backwards, Cortez was quick to tap out.\n\"I actually didn't think the choke was super tight but I could feel the pressure forced her to tap out,\" Blanchfield said. With the win, Blanchfield improved to 8-1 in the UFC after winning her second straight following a loss to Manon Fiorot in a 2024 No. 1 contender's bout via unanimous decision. Cortez, who began her UFC career with five straight wins, accumulated her second loss in her last three fights. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 322 results: Erin Blanchfield scores late submission of Tracy Cortez - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/e5fafef5-8c11-4420-8c67-41c2b55bfaad/thumbnail/1200x675/82c828d1520a66cc540c187eb7588f97/erin-blanchfield-winner-spike-322.jpg"
      ],
      "datePublished": "2025-11-16T02:20:01.000Z",
      "dateModified": "2025-11-16T02:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Conor Benn vs. Chris Eubank 2 results, highlights: Benn gets revenge in rematch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/conor-benn-chris-eubank-2-results-highlights-analysis-knockdowns-rematch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/15/82f6ce85-d3ca-4e3a-8e71-3e27949d851c/thumbnail/1200x675/7843570ee06b20d93ca4d0ccf728cdc6/conor-benn-chris-eubanks-2-fight-action.jpg",
    "tag": "Sports",
    "date": "2025-11-15T23:20:00.000Z",
    "description": "\n        The Benns finally have a win over the Eubanks. On Saturday at Tottenham Hotspur Stadium in London, Conor Benn put on a boxing masterclass to ",
    "body": "\n        The Benns finally have a win over the Eubanks. On Saturday at Tottenham Hotspur Stadium in London, Conor Benn put on a boxing masterclass to win his rematch with Chris Eubank Jr. by unanimous decision.Benn and Eubank's fathers met in a pair of British superfights in the 1990s, with Chris Eubank Sr. winning a 1990 clash for the WBO middleweight title, and drawing with Nigel Benn in their 1993 rematch. This past April, Eubank Jr. defeated Benn in a thrilling Fight of the Year contender.On Saturday, Benn finally won one for the family by dominating the rematch bell to bell, utilizing smart boxing and his speed against the much larger Eubank.Eubank looked stuck in first gear for much of the fight, moving backward and boxing off his back foot and along the ropes while Benn stayed aggressive and committed to the attack. When Eubank did find occasional moments to land counter shots, Benn absorbed the shots well and returned fire to continue pulling away on the scorecards.While there was little doubt of which way the fight was heading on the scorecards as the final round began, Benn put an exclamation point on his victory in that final frame.\nA jab set up a right hand from Benn that connected behind Eubank's ear, taking away his equilibrium and sending him crashing to the canvas.Eubank was able to beat the count, but was knocked down a second time moments later when another chopping right hand connected. Eubank again beat the count and the bell sounded seconds later, but a 10-7 round only added to the disparity on the official scorecards, which read 119-107, 116-110 and 118-108, all in Benn's favor.\nDespite being the bigger man, Eubank was never able to use his size and was often outmuscled by Benn in the clinch. Eubank looked every bit of his 36 years, and with nearly 40 professional fights on his resume, it's possible time and wear caught up to him.\nBenn, 29, has now defeated everyone he has faced as a professional, getting revenge on Eubank for his lone defeat.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Conor Benn vs. Chris Eubank 2 results, highlights: Benn gets revenge in rematch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/15/82f6ce85-d3ca-4e3a-8e71-3e27949d851c/thumbnail/1200x675/7843570ee06b20d93ca4d0ccf728cdc6/conor-benn-chris-eubanks-2-fight-action.jpg"
      ],
      "datePublished": "2025-11-15T23:20:00.000Z",
      "dateModified": "2025-11-15T23:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 322 odds, lines, predictions: Della Maddalena vs. Makhachev picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-322-odds-lines-props-predictions-fight-card-della-maddalena-makhachev-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/15/c6e84134-9eca-4030-84a5-e37f7281848e/thumbnail/1200x675/6a809493aed5713ecf0375d43fe12cad/islan-makhachev-ufc-mma-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-15T23:00:48.000Z",
    "description": "\n        The UFC welterweight championship will be on the line on Saturday when champion Jack Della Maddalena takes on Islam Makhachev at UFC 322: Del",
    "body": "\n        The UFC welterweight championship will be on the line on Saturday when champion Jack Della Maddalena takes on Islam Makhachev at UFC 322: Della Maddalena vs. Makhachev. Della Maddalena won the UFC welterweight championship in his last fight, when he defeated Belal Muhammad at UFC 315 this past May. Makhachev, who is moving up a weight, comes in with a 15-bout winning streak. The main card from Madison Square Garden in New York is set to begin at 10 p.m. ET, with the early preliminaries getting underway at 6 p.m. ET, and the preliminaries at 8 p.m. ET.Makhachev enters as the favorite at -298 (risk $298 to win $100), while Della Maddalena is the underdog at +240 in the latest UFC 322 odds at DraftKings Sportsbook. In the co-main event, defending champion Valentina Shevchenko is the -148 favorite against Zhang Weili (+124) in a women's flyweight championship bout. Before locking in any UFC 322 picks, make sure you see the MMA predictions and betting advice from SportsLine expert Daniel Vithlani.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Vithlani is a highly-analytical UFC bettor who has been a consistent winner for SportsLine members since making his debut in January 2023 with a 5-0 record for UFC 283. In fact, he's up over $1,500 on his UFC main-card sports betting picks.His other highlights include calling an upset for Sean O'Malley (+210) against Aljamain Sterling (-250) at UFC 292 as part of a 4-1 main card and his UFC 299 winners included underdog selections on Dustin Poirier (+190) against Benoit Saint Denis (-230) and Michael Page (+110) against Kevin Holland (-130). Anyone who has followed him at sportsbooks and on betting apps could be way up.Now, Vithlani has studied Jack Della Maddalena vs. Islam Makhachev         from every angle and revealed his top betting picks and best bets. Head to SportsLine to see them. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Della Maddalena vs. Makhachev preview Della Maddalena, 29, has been on a roll since turning pro in March 2016. Although he lost his first two fights, he has not tasted defeat since. In September 2021, he earned a unanimous decision win over Ange Loosa in Dana White's Contender Series 39. He then joined UFC, and defeated Pete Rodriguez by TKO in his debut at UFC 270 in January 2022. In 20 professional fights, Della Maddalena is 18-2 with 12 wins by knockout, two by submission and four by decision.He is a highly decorated fighter, earning ESPN's 2022 UFC Men's Rookie of the Year and 2022 Co-Newcomer of the Year with Jailton Almeida by Cageside Press. He was UFC.com's 2022 Newcomer of the Year. He is a four-time Performance of the Night winner, and has won two Fight of the Night honors. He is No. 8 in the UFC men's pound-for-pound rankings. Check out SportsLine to see his picks and analysis.Makhachev, 34, turned professional in August 2010, and won his first 12 bouts, including his UFC debut in May 2015. At UFC 187, he defeated Leo Kuntz by submission. After being knocked out by Adriano Martins later that year, he has gone on a tear. In 28 career fights, he is 27-1 with five wins by knockout, 13 by submission and nine by decision.He is a former UFC lightweight champion, where he successfully defended his title four times before deciding on moving up in weight class. He is a three-time Fight of the Night winner, and has earned Performance of the Night three times. He has the most UFC lightweight title wins with five, and the most consecutive UFC title defenses at four. He is tied with Kamaru Usman for the second-longest win streak in UFC history at 15. You can only see his picks and analysis at SportsLine. UFC 322: Della Maddalena vs. Makhachev predictionsOne of of Vithlani's UFC 322 picks: He's backing Chepe Mariscal (-102) to pull a small upset against Pat Sabbatini (-118) in a featherweight matchup on the early preliminary card.\"Mariscal is now 5-0 in the UFC and hasn't lost a fight since 2020,\" Vithlani told SportsLine. \"He is a scrappy fighter who welcomes a nasty affair. Mariscal uses his pace, pressure and grittiness to intimidate his opponents and wear on them. His volume-striking attack makes him dangerous, but it's his ability to grapple and scramble that give him the edge in this matchup. Sabatini is a Ju-Jitsu ace, with 13 of his 19 pro wins coming by submission. He is a savvy grappler who can keep his opponents pinned to the mat. However, I have a hard time seeing him do that to Mariscal, who has never been submitted in his 18-6 pro career. Mariscal has a 73% takedown defense rate and has shown the ability to get up when taken down. If this fight plays out on the feet, Mariscal's relentlessness will overwhelm Sabatini.\" See who else to back here. You can make this pick at FanDuel, where new users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make UFC 322: Della Maddalena vs. Makhachev picksVithlani has strong picks for Della Maddalena vs. Makhachev and other bouts on the UFC 322: Della Maddalena vs. Makhachev card. He's also backing a fighter whose \"constant barrage of strikes and takedowns\" will lead to a massive victory. He's sharing who it is only at SportsLine.Who wins UFC 322: Della Maddalena vs. Makhachev, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.UFC 322: Della Maddalena vs. Makhachev main fight card, odds See picks at SportsLine.(Odds subject to change)Jack Della Maddalena (+240) vs. Islam Makhachev (-298) Valentina Shevchenko (-148) vs. Zhang Weili (+124) Sean Brady (-142) vs. Michael Morales (+120) Leon Edwards (+140) vs. Carlos Prates (-166) Beniel Dariush (+160) vs. Benoit Saint-Denis (-192)                      \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 322 odds, lines, predictions: Della Maddalena vs. Makhachev picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/15/c6e84134-9eca-4030-84a5-e37f7281848e/thumbnail/1200x675/6a809493aed5713ecf0375d43fe12cad/islan-makhachev-ufc-mma-imagn-images.jpg"
      ],
      "datePublished": "2025-11-15T23:00:48.000Z",
      "dateModified": "2025-11-15T23:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 322 fight card predictions: Expert picks for Della Maddalena vs. Makhachev - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-322-fight-card-predictions-expert-picks-jack-della-maddalena-islam-makhachev/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/e03c697f-8371-4b7e-91d3-b65c567e537a/thumbnail/1200x675/29d082d9f428667913263053f3612ee2/della-maddalena-makhachev-presser.jpg",
    "tag": "Sports",
    "date": "2025-11-16T00:30:43.000Z",
    "description": "\n        Saturday is a chance for Islam Makhachev and Zhang Weili to make history as both fighters have vacated championships to move up a weight divi",
    "body": "\n        Saturday is a chance for Islam Makhachev and Zhang Weili to make history as both fighters have vacated championships to move up a weight division and challenge for a second title in the featured fights of UFC 322.In the main event, Makhachev will battle welterweight champion Jack Della Maddalena. Makhachev won the lightweight championship in 2022 and successfully defended the title four times before vacating to move to welterweight. Dealla Maddalena will be making his first defense of the title he won in May with a decision win over Belal Muhammad.Be sure to keep up with all the action on Saturday with our live coverage of UFC 322, including round-by-round scoring and updated fight results throughout the night!Meanwhile, Zhang and flyweight queen Valentina Shevchenko have had similar career runs in UFC. Both are among the most decorated champions in the strawweight and flyweight division's history. They have each made numerous title defenses while coming up on the wrong end of a pair of fights with their toughest rivals (Rose Namajunas for Zhang and Amanda Nunes for Shevchenko). Saturday could go a long way in polishing off an already Hall of Fame worthy resume for either woman.\n\n        \n            \n                UFC 322: Why Islam Makhachev's early UFC loss set him on the path to become a potential two-division champ\n                \n                    Brian Campbell                \n            \n                            \n    \n                \n                    \n    \nWith so much happening on Saturday night, let's look closer at the full fight card with the latest odds before we get to our staff predictions and picks for the PPV portion of the festivities that you can consider before hitting the sportsbooks.UFC 322 fight card, oddsOdds via DraftKings SportsbookIslam Makhachev -285 vs. Jack Della Maddalena (c) +230, welterweight titleValentina Shevchenko -135 (c) vs. Zhang Weili +115, women's flyweight titleSean Brady -130 vs. Michael Morales +110, welterweightsCarlos Prates -175 vs. Leon Edwards +145, welterweightsBenoit Saint Denis -180 vs. Beneil Dariush +150, lightweightsBo Nickal -205 vs. Rodolfo Vieira +170, middleweightsGregory Rodrigues -185 vs. Roman Kopylov +154, middleweightsErin Blanchfield -258 vs. Tracy Cortes +210, women's flyweightsMalcolm Wellmaker -590 vs. Ethyn Ewing +440, featherweightsKyle Daukaus -425 vs. Gerald Meerschaert +330, middleweightsPat Sabatini -130 vs. Chepe Mariscal +110, featherweightsFatima Kline -520 vs. Angela Hill +390, women's strawweightsBaisangur Susurkaev -1050 vs. Eric McConico +675, middleweightsMatheus Camilo -162 vs. Viacheslav Borshchev, lightweightsUFC 322 predictions, picksWith such a massive main event on tap, the crew at CBS Sports went ahead with predictions and picks for the main card from Brian Campbell, Brent Brookhouse, Shakiel Mahjouri, Michael Mormile and Brandon Wise.   CampbellBrookhouseMahjouriMormileWiseDella Maddalena (c) vs. MakhachevMakhachevDella MaddalenaMakhachevMakhachevMakhachevShevchenko (c) vs. WeiliShevchenkoShevchenkoShevchenkoShevchenkoZhangBrady vs. MoralesBradyBradyBradyBradyBradyEdwards vs. PratesEdwardsEdwardsEdwardsPratesPratesDariush vs. Saint DenisSaint DenisSaint DenisSaint DenisSaint DenisSaint DenisJack Della Maddalena vs. Islam Makhachev predictionsCampbell: Della Maddalena has the size, power and toughness not to be taken lightly in Makhachev's pursuit of history as a potential two-division champion. JDM also showed enough improvements in his takedown defense against Belal Muhammad that it might not be as easy as some might think for Makhachev to drown him in the grappling department. Still, it's hard to look past just how evenly well-rounded Makhachev's game has truly become and how much of a finishing threat (with 18 stoppages in 27 pro wins) he truly is, whether on the feet or on the ground. Della Maddalena will definitely make him earn it, but this is still Makhachev's fight to lose. And the 10-month layoff that the former lightweight champion enters with should help him feel comfortable at the new weight class. At the end of the day, Makhachev's technical advantages should prove to be the difference.  \nBrookhouse: I'm often guilty of overthinking simple fights, and maybe that's what I'm doing here. Something about Della Maddalena's skillset feels like it's close to what a fighter needs to deal with Makhachev's game. On the feet, Makhachev is solid, but Della Maddalena will have the edge. Makhachev will get takedowns in the fight, but Della Maddalena has good scrambling skills, and training with Craig Jones is sure to have taught the champion a few tricks. Either way, I believe this will be a difficult fight for Makhachev as he meets a tricky fighter in a new weight class.Mahjouri: Della Maddalena is a live dog, don't let Makhachev's well-deserved reputation fool you. Della Maddalena is an elite boxer with rapidly evolving grappling defense. The champ stuffed most of Belal Muhammad's takedowns and, more importantly, wasn't held down for long stretches. Pair that with Makhaev's relative struggles striking with Dustin Poirier, and you can see a case for JDM. With all that said, I'm still siding with Makhachev. The former lightweight champ is a better grappler than Muhammad. Makhachev lands more takedowns more accurately, controls better, and finishes more. Size shouldn't be a major factor either. Della Maddalena, by his own admission, isn't a large welterweight. That'll benefit Makhachev, whose physicality should translate well enough at welterweight. Expect to see Makhachev build his Hall of Fame legacy with a finish.Valentina Shevchenko vs. Zhang Weili predictionsCampbell: There's a reason why this fight has been a virtual pick 'em from a betting standpoint throughout the build to it. A pair of future Hall of Famers and decorated champions with completely evolved skill sets and nary a hole in their respective games to speak about. Both are also as technical as they are tenacious. But something will inevitably have to give in a matchup this close on paper and the biggest things separating the two fighters seems to favor Shevchenko entirely. The former bantamweight contender is slightly bigger, has more big-fight experience and is a more refined striker, particularly as a counter puncher. If Shevchenko's game is slipping at age 37, her back-to-back recent decision wins over former champion Alexa Grasso and Manon Fiorot over the past 14 months haven't shown it. While Zhang is a bit more explosive and could have an edge from the standpoint of five-round cardio should this fight be contested at a high pace, Shevchenko has too much craft not to find a way to hold her off in a technical thriller. \nBrookhouse: This fight should be great, but Shevchenko has shown the ability to neutralize explosive fighters like Weili. Shevchenko is a patient fighter who can mix tactical striking with grinding clinches and takedowns. Weili is a dynamic fighter, but one who operates best when she's free to lead the action. If Shevchenko can routinely dictate the terms of the fight, it's going to be a very long night for Weili. Weili is also coming up a division and now dealing with a stronger fighter with heaps of championship experience. Really, it comes down to the less exciting the fight is, the better things are going for Shevchenko.Mahjouri: Zhang has rounded out her game excellently, but you won't find a better all-around fighter than Shevchenko. The women's flyweight champion can strike and grapple with fantastic technique and defensive responsibility. Zhang's KO power will probably carry up in weight, but against Shevchenko, who hasn't been KOed in 18 UFC fights, it's hard to see the former strawweight queen getting a finish. Shevchenko is a hard fighter to beat on the scorecards. The judges love her, and they'll greet Shevchenko again at the finish line.Wise: While Shevchenko is deserving of her flowers as one of the pioneers of women in UFC, it seems a bit odd for a fight like this to be so close on paper for a champion of her ilk. Shevchenko has been known to bully opponents around at this weight with the relative skill level low at 125 pounds outside of her lone defeat to Alexa Grasso. Zhang, meanwhile, seems to present the most well rounded skill set she has faced since Amanda Nunes in 2017 at bantamweight. The size difference also seems negligible here in going from 115 to 125 pounds and the faceoffs this week seem to indicate just that. Both fighters could cancel out the others' strengths and turn this into an ugly brawl. But if that's the case, give me the fighter who we've seen survive that kind of battle with Joanna Jedrzcyzk before. \nSean Brady vs. Michael Morales predictionsCampbell: Consider this one heck of a style contrast in a matchup still offering strength versus strength from the standpoint of Brady's hard-nosed wrestling against the explosive striking of the 18-0 Morales. Despite the fact that Morales has a solid wrestling base, Brady's appears to be simply at a different level, which puts the onus upon the Philadelphia fighter to crowd Morales as much as possible and pull on his gas tank consistently. Brady has a strong track record of doing exactly that throughout his three-fight win streak against the likes of Kelvin Gastelum, Gilbert Burns and former champion Leon Edwards. While Morales will be dangerous for every second that the fight remains on the feet, Brady's experience edge should shine through in this one provided he can control the terms and not get caught from distance against his knockout hungry foe. Brookhouse: From our UFC 322 best bets: \"This fight may come down to wrestling. Brady averages more than 3.5 takedowns per 15 minutes while Morales defends takedowns at a success rate of 89%. Of course, Morales hasn't faced a murderer's row of great wrestlers and Brady presents a host of new tests for the Ecuadorian. Brady is more battle-tested against better opposition, and -135 feels like a good price on the higher-ranked, more proven fighter.\"Mahjouri: Brady vs. Morales is one of the more compelling fights on the card. Brady is a powerhouse with phenomenal grappling. Morales is a slick knockout artist. What makes the fight curious are their defensive lapses. Brady is a responsible defensive striker, but it's hard to shake how Muhammad -- who has two knockouts in 20 UFC fights -- finished Brady on the feet. Morales' takedown defense isn't foolproof, but no one has managed to keep him down. A grappler vs. striker fight that could go either way, I'll lean with Brady's experience over Morales, the latter of whom has yet to be tested by an elite prime welterweight. \nWho wins UFC 322: Della Maddalena vs. Makhachev, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 322 fight card predictions: Expert picks for Della Maddalena vs. Makhachev - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/e03c697f-8371-4b7e-91d3-b65c567e537a/thumbnail/1200x675/29d082d9f428667913263053f3612ee2/della-maddalena-makhachev-presser.jpg"
      ],
      "datePublished": "2025-11-16T00:30:43.000Z",
      "dateModified": "2025-11-16T00:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oklahoma's Brent Venables was at his mad scientist best in a signature win vs. Alabama - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oklahoma-brent-venables-mad-scientist-signature-win-vs-alabama/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/16ef3495-1cb6-483c-ac96-39c7f6c7bb23/thumbnail/1200x675/b197164da4bb2b00af0535441e4cdbda/brent-venables-1.jpg",
    "tag": "Sports",
    "date": "2025-11-16T02:15:55.000Z",
    "description": "\n        Alabama's doubled up Oklahoma in yardage, but the Sooners' defense dictated the moments that mattered most.Now, the Sooners' College Football",
    "body": "\n        Alabama's doubled up Oklahoma in yardage, but the Sooners' defense dictated the moments that mattered most.Now, the Sooners' College Football Playoff hopes not only have life, but momentum heading into the final two weeks of the regular season.Their hard-hitting 23-21 victory at Alabama was as impressive as any in the sport this season. The Sooners were out-gained 406-212 by the Tide, but forced three turnovers and scored 17 points off those miscues to hand Kalen DeBoer his first home loss as Alabama's head coach.Their 212 yards?  The fourth-fewest yards by an FBS team in a win against a top-five team since 2000. Historic stuff.\nDefensive mastermind Brent Venables was at his best Saturday night inside Bryant-Denny Stadium. He spun Ty Simpson in circles with several exotic blitzes -- a slot cornerback abandoning a tight end to knife in for a second-half sack in the second half was straight out of a mad scientist's lab.The go-ahead 24-yard field goal early in the fourth quarter came only after a strip-sack produced by a backup forced into duty. Reserve defensive end Taylor Wein stepped in for star edge R. Mason Thomas and made life a living nightmare for freshman right tackle Michael Carroll, beating him twice for hurries.Alabama fell in an early 10-0 hole after Ty Simpson threw an 87-yard pick six -- the first of his career -- to Eli Bowen. The Tide bounced back, as they have most of the season, but the turnovers didn't slow and neither did Oklahoma's swarming defense, which sacked Simpson three times in the second half.\n\"They give us a spark whenever we need it,\" OU quarterback John Mateer said after the win. \"They didn't get a whole lot of turnovers at the beginning of the year, but the football gods loved them back because of how hard they play.\"That spark has turned into a fire. Oklahoma's defense has ranked among the nation's best all season, but the lack of takeaways had led to close calls and the rivalry loss to Texas. In the first eight games? Just four turnovers. In back-to-back road wins over ranked opponents? Six takeaways leading to 30 points.This wasn't easily predictable, either. Alabama ripped off three explosive plays on its opening drive of the third quarter and grabbed a 21-20 lead on Daniel HIll's touchdown. The Tide looked like they had answers coming out of halftime.\nThen Oklahoma slammed the door.The Sooners held Alabama to 15 total yards on the next three possessions, including a drive-ending sack and fumble. When Alabama mounted one final push from its own 4-yard line midway through the fourth quarter, Kip Lewis buried a crucial 11-yard sack as Alabama tried to push across midfield. Three snaps later, a last-ditch throw skipped harmlessly short of Ryan Williams as Peyton Bowen closed in.This wasn't your typical blueprint, but the Sooners again proved defense is not only important, it's paramount in heavyweight fights. Venables' pressure packages, even without star players, harkened to his championship game plans as Clemson's defensive coordinator in the mid-2010s. \nThe Sooners now share the national lead in wins over AP-ranked opponents -- tied, fittingly, with Alabama.The Tide may still win the SEC title, but their playoff odds look no better than Oklahoma's. Two-loss teams, even in the SEC, have no breathing room and Alabama must still travel to rival Auburn.The Iron Bowl on The Plains is always unpredictable, even if the Tide haven't lost there since 2019. A lot has changed since then: three full-time Auburn coaches and three interim coaches.\nMeanwhile, Oklahoma proved it can win postseason-style games on the road. The performance was the clearest sign yet of a tremendous turnaround for Venables, who started the year on the hot seat with only four combined wins against ranked opponents in three seasons.Now he has the Sooners on the doorstep of the playoffs.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oklahoma's Brent Venables was at his mad scientist best in a signature win vs. Alabama - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/16ef3495-1cb6-483c-ac96-39c7f6c7bb23/thumbnail/1200x675/b197164da4bb2b00af0535441e4cdbda/brent-venables-1.jpg"
      ],
      "datePublished": "2025-11-16T02:15:55.000Z",
      "dateModified": "2025-11-16T02:15:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quinnen Williams 'super excited' to make Cowboys debut on 'Monday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/new-cowboys-dt-quinnen-williams-super-excited-to-make-dallas-debut-vs-raiders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/93b10b99-2b6a-42e4-a365-46d4f88b86d9/thumbnail/1200x675/0f23c472c757c116b0dfd1858234f5a5/quinnen-williams-jets.jpg",
    "tag": "Sports",
    "date": "2025-11-15T23:34:29.000Z",
    "description": "\n        FRISCO, Texas -- The Dallas Cowboys (3-5-1) made one of the 2025 NFL trade deadline's blockbuster moves by trading for New York Jets All-Pro ",
    "body": "\n        FRISCO, Texas -- The Dallas Cowboys (3-5-1) made one of the 2025 NFL trade deadline's blockbuster moves by trading for New York Jets All-Pro defensive tackle Quinnen Williams on Nov. 4. Williams is now itching to get back on the football field for his Cowboys debut on \"Monday Night Football\" at the Las Vegas Raiders (2-7). Just over three weeks, 22 days to be exact, will have passed between the last time Williams suited up for the Jets in New York's 39-38 road win at the Cincinnati Bengals on Oct. 26 and Monday, Nov. 17 in Las Vegas. \"I'm super excited. ... I haven't played a game in a long minute. I'm super excited not only to play a football game but to play for this organization, man, to play for this team, to play for the guys in our defensive line room, and to play for the guys in this organization,\" Williams said Friday.  ... They took a chance on me and traded for me. ... They feel like I can come in to contribute and help this organization go in the right direction. That's all I plan to do.\"The 27-year-old is healthy. He just ran into having consecutive bye weeks between New York's Week 9 bye and Dallas' Week 10, which created a unique situation for the six-foot-three, 303-pound defensive tackle. Williams spent the Cowboys' bye week getting an individualized plan mapped out with the Dallas training staff to ensure his body felt like he only missed one game on a bye and not two. \n\n        \n            \n                2025 NFL Thanksgiving schedule: Packers, Lions face off, Cowboys host Chiefs as part of holiday triple-header\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \n\"This is the first time I went healthy and haven't played a game, but it's like two weeks and some games... two-and-a-half weeks of something. With this coaching staff and strength and conditioning staff, we did a great job last week because my plan was just to prepare like I was going to play in a game,\" Williams said. \"Do pre-practice like I was going to play in a game because I had a bye week previously. Conditioning-wise, everything-wise, I just hit it like I was still in-season and still played in a game. I didn't play a game on Sunday, but I did a mock game amongst myself.\"What does a solo mock game look like? Williams simulating going hard for his typical allotment of 30 or 40 plays.\"Kind of 30 or 40 reps or sprints or med[icine] ball stuff. Some type of cardio thing where I can still have the same wind and things like that,\" Williams said. \"So coming back to practice this week was easy, and it's a blessing to be healthy.\"\nWilliams is joining the Cowboys at a difficult time with 24-year-old edge rusher Marshawn Kneeland's death from an apparent, self-inflicted gunshot wound occurring on Nov. 6, just two days after the defensive tackle came to Dallas. However, the tragedy has brought everyone in the organization closer together, providing an opportunity for Williams to grow as a man and with his new teammates and coaches. The situation forced him to place a higher value on the personal relationships with teammates outside of football instead of being solely focused on all ball all the time. \"The togetherness through this hardship, through this tragedy has brought everybody together,\" Williams said. \"It was unbelievable man. I've always had to take a step back in my career, especially through this tragedy. I always think to myself winning is everything to me, and I can sometimes get so deep inside myself, deep inside my game, deep inside winning that I forget to build relationships with my teammates and build relationships with my coaching staff. Going through this tragedy with the guys in the organization and with the guys in the locker room has also kind of made me grow as a human being and as a person. You're going to win Super Bowls, you're going to win playoff games with the guys that you love next to you, and you can't love anybody next to you if you don't know them. It definitely taught me a lesson.\"Williams fitting in with Dallas defense on the field Fitting in with the Cowboys on the football field has been seamless for Williams thanks to his connection with Dallas defensive line coach Aaron Whitecotton, his position coach with the Jets from 2021 to 2024 before Whitecotton joined new coach Brian Schottenheimer's staff in Dallas in 2025. After only one season of working under Whitecotton in 2021, Williams erupted for a career-high 12.0 sacks in 2022, earning him first team All-Pro honors and kickstarting three consecutive Pro Bowl seasons.     \n\"It was definitely easy to catch up, man, when it comes down to football. I really trusted my football IQ and the things that I can do, especially coming down to remembering the playbook and remembering what they want me to do,\" Williams said. \"It probably took me one or two days to get the whole playbook down and to come out here and just fit right in, man. ... Whatever coaching staff, whatever the scheme, whatever the team needs me to do to win football games, I'm willing to do what I'm going to do because at the end of the day I just want to win.\"That all-in attitude will be imperative for Williams because he will now be sharing the middle of Dallas' defensive line with two other well-compensated defensive tackles in three-time Pro Bowler Kenny Clark and Osa Odighizuwa, the latter of whom re-signed with Dallas on a four-year, $80 million contract this offseason. Whitecotton and Schottenheimer have said there will clearly be rotations where all three still receive a starter's level of game reps, but there will also be a higher usage of five-down fronts. That's when a defense utilizes five defensive linemen along the line of scrimmage instead of the usual four. That adjustment yielded results for Dallas' pass rush collectively as they matched the team's single-game high in sacks with five against Arizona Cardinals quarterback Jacoby Brissett in Week 9, something the Cowboys also did in Week 5 against Williams' former Jets quarterback Justin Fields. \"Yeah, it's a fair question. It's a good question. I think you saw us last game get into some of the five-down stuff. There are creative ways we can use it with those guys. We don't just have to play five-down to get those guys in the game without giving things away,\" Cowboys coach Brian Schottenheimer said on Thursday. \"We can move pieces around and put certain guys in different spots. I think that's part of what you'll see us do some this game, maybe even more moving forward but when you have that much talent inside, it is a problem for the defense. You talk about stopping the run, you've got penetration, you've got the ability to move those guys, package those guys in the pass rush. It's the closest thing to the quarterback. And then, you know, we are going to play some four-down. And when we do, the good news about having guys like that is they're going to be fresh. They're going to be over there catching their breath, and then when they come in, they're going to be hunting.\"\nThat arrangement is perfectly acceptable for Williams in part because he will now be lining up next to Clark, someone Williams has admired for a long time from afar. Williams said he's watched every snap of Clark's first nine seasons with the Green Bay Packers from 2016 to 2024 to learn from his game. Now, he's ready to be Clark's teammate on Monday night in Las Vegas against the Raiders.  \"It's unbelievable, man, to be able to come in and not only play with but learn from guys like Kenny Clark and Osa. I've been watching Kenny Clark fan for a long time, man, and the things he can do from a two-tech, from a three-tech. I think I watched every single clip of his at Green Bay,\" Williams said. \"Try to learn from, try to take something from [him]. Osa has been unbelievable in his career and been doing great things as well. So to be able to learn from each other, like I said, has brought us together... on the field and off the field. It's gonna be unbelievable to go play on Monday night with them.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quinnen Williams 'super excited' to make Cowboys debut on 'Monday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/93b10b99-2b6a-42e4-a365-46d4f88b86d9/thumbnail/1200x675/0f23c472c757c116b0dfd1858234f5a5/quinnen-williams-jets.jpg"
      ],
      "datePublished": "2025-11-15T23:34:29.000Z",
      "dateModified": "2025-11-15T23:34:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 11 NFL betting guide, expert picks, predictions, player props, DFS, fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-11-nfl-betting-guide-player-props-spreads-parlay-dfs-fantasy-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/25/4b510e24-401b-4940-95ea-9f02bcd052e3/thumbnail/1200x675/9ed942f821d7a4524a4d64f6b78a1918/amon-ra-st-brown-detroit-lions-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-16T01:05:31.000Z",
    "description": "\n        Your Week 11 NFL betting guide would be smart observe the trends, regardless if you want to follow them with Week 11 NFL predictions. The Bro",
    "body": "\n        Your Week 11 NFL betting guide would be smart observe the trends, regardless if you want to follow them with Week 11 NFL predictions. The Browns are the only team undefeated ATS at home, and they are 7.5-point home underdogs to the Ravens, per the latest NFL odds. Meanwhile, the Seahawks are 4-0 ATS on the road as they'll visit the Rams (-3.5) on Sunday. So, should you back the Browns or Seahawks with Week 11 NFL bets or as a part of an NFL parlay?The aforementioned are two of the nine divisional matchups this week, with others including Panthers vs. Falcons (-3.5), Bears vs. Vikings (-2.5), and Chiefs vs. Broncos (+3.5). The likes of Bijan Robinson, Justin Jefferson, Patrick Mahomes and Travis Kelce have had lots of success versus their rivals, so should your Week 11 NFL picks include any of them as part of your NFL DFS strategy, within Fantasy football lineups or among NFL player props? If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 11, SportsLine has you covered with its proven model, Machine Learning Model and team of experts. Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 11 that pays 25-1, and one of the legs is the Cowboys (-3.5, 50) covering against the Raiders on Monday. The model has Dallas covering in 60% of simulations, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $300 in bonus bets + 3 months of NBA League Pass if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Jags' Travis Etienne as one of its top value picks at running back, while Tampa's Cade Otton is among the best values at tight end for Sunday's main slate. Here are its complete Week 11 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Cardinals' Jacoby Brissett as a top-10 Fantasy quarterback this week. Get his full Week 11 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 11 Fantasy football rankings that can be used to make start-sit decisions. The Steelers' Aaron Rodgers is projected to be a top-12 Fantasy quarterback this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model enters Week 11 of the 2025 NFL season up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 11 on a 47-32 run on top-rated picks dating back to 2024 and has revealed picks for every Week 11 NFL game. One of its favorite picks is the Bears (+2.5, 48.5) covering versus Minnesota, which cashes over 50% of the time. You can find the model's picks for every NFL Week 11 game here. You can also use the latest FanDuel promo code to get $150 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Jeff Hochman, who is 5-1 (+485) over his last six picks in Ravens games is backing Cleveland to cover at home versus Baltimore. \"Cleveland has a point differential of -15.3 in unfamiliar territory, while at home, they post a +9.0 point differential in the Dawg Pound. The Ravens crushed the Browns 41-17 as 12.5-point home chalk despite getting outgained 322-242 back in Week 2 with Joe Flacco under center... Myles Garrett called out his team after last week's loss, and the Browns will be highly motivated in this division matchup. With 15-25 mph winds and a 50% chance of light rain, we have the makings of a closer-than-expected low-scoring contest.\" Hochman's NFL best bets for Week 11 can be found here.Eagles vs. Lions 'Sunday Night Football' picksNFC contenders meet on 'Sunday Night Football' as the Lions travel to take on the Eagles. Philadelphia has bounced back from a shocking road loss against the Giants to win three straight. The Lions, meanwhile, blew out Washington last week 44-22, and they've now alternated wins and losses in their last five games. R.J. White is on a sizzling 13-1 run on NFL spread picks, and he's backing Detroit (+2.5).\"The Eagles gutted out a tough win in Green Bay on Monday, but it was not an impressive showing by their offense, which managed eight or fewer yards in six of 10 offensive series,\" he told SportsLine. \"The defense was very much bend but don't break, with the Packers scoring once on six drives into Philly territory. This is a much tougher opponent, especially with Dan Campbell taking over playcalling duties on offense. The Lions also have a D-line capable of neutralizing Philly's strength up front and limiting scoring once again. I expect the Lions to win this game outright.\" Get more 'Sunday Night Football' picks at SportsLine.Cowboys vs. Raiders 'Monday Night Football' picksDallas plays its first ever game in Vegas as the Cowboys and Raiders conclude the Week 12 NFL schedule on 'Monday Night Football.' The Cowboys are 3.5-point favorites, with the over/under at 50. Larry Hartstein is on a 40-24 run on NFL player props (+1122), and he's backing George Pickens to go Over 66.5 total receiving yards. \"George Pickens averages a whopping 3.41 yards per route run against Cover 3 -- a coverage the Raiders use at the NFL's second-highest rate,\" he said. \"He's cleared this prop total in four straight games and seven of the last eight. Pickens will be matched up often with third-round rookie Darien Porter, who allows 12.3 yards per completion and has yet to force an incompletion, per PFF. This game has the highest total on the Week 11 slate, so I'm expecting another big game from Pickens.\" Get more 'Monday Night Football' picks at SportsLine.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 11 NFL betting guide, expert picks, predictions, player props, DFS, fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/25/4b510e24-401b-4940-95ea-9f02bcd052e3/thumbnail/1200x675/9ed942f821d7a4524a4d64f6b78a1918/amon-ra-st-brown-detroit-lions-imagn-images.jpg"
      ],
      "datePublished": "2025-11-16T01:05:31.000Z",
      "dateModified": "2025-11-16T01:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shane Beamer 'wanted to puke' after South Carolina's collapse at No. 3 Texas A&M - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/south-carolina-shane-beamer-historic-collapse-texas-a-m/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/15/6898d8ba-2477-49b9-a5d8-196f6a4f138f/thumbnail/1200x675/5409922bed9fd2f45f34caae50393768/shane-beamer-south-carolina-vs-alabama.jpg",
    "tag": "Sports",
    "date": "2025-11-15T21:41:33.000Z",
    "description": "\n        Shane Beamer said he \"wanted to puke\" as he watched South Carolina squander a 27-point lead in Saturday's 31-30 loss to unbeaten and third-ra",
    "body": "\n        Shane Beamer said he \"wanted to puke\" as he watched South Carolina squander a 27-point lead in Saturday's 31-30 loss to unbeaten and third-ranked Texas A&M. Unsure why his Gamecocks continue to falter in the fourth quarter of games this season, this latest setback was an all-timer, nullifying any remaining shot at bowl season and spiking unrest from one of the nation's most loyal fanbases.From ranked No. 13 in the preseason to losing its seventh game by mid-November after an all-time collapse, this is not what Beamer or anyone associated with South Carolina football envisioned in Year 5South Carolina now holds the dubious honor to be the SEC's first team since 2004 to be leading by 27 points and lose -- snapping a 286-game stretch. The Aggies' triumph at Kyle Field featured touchdowns on Texas A&M's first four possessions after intermission to lead 31-30 with 10:47 to play. Beamer nixed the idea that his team got conservative in the second half.\"You don't look at the scoreboard when you try to dominate something, you just keep going,\" Beamer said, when asked about his team's 30-3 halftime lead.\nAided by several unexplainable sacks taken by LaNorris Sellers after refusing to throw the ball away, South Carolina's final two drives were snuffed out for minimal yardage and the Aggies' comeback was complete, the biggest in program history and a pie-in-the-face for Beamer, who's team now takes the unwanted letdown throne.Texas A&M had minus-9 yards rushing in the first half, went 0-for-6 on third down, turned it over three times, dropped a would-be touchdown reception in the end zone and missed a chip-shot field goal -- execution issues that were uncommon the first nine games of the campaign under Mike Elko.And then? A second-half firestorm to remember for Texas A&M.Reports surfaced before Saturday's game that Elko and the Aggies were in the final stages of a six-year contract extension that would make him one of the nation's highest-paid coaches. What transpired early was not indicative of what helped Elko land the offer from Texas A&M, but his team recovered and Beamer's did not despite holding a lead for the third time this season in the final quarter against a ranked opponent, only to fall.\nBeamer, who was initially rumored to be among the candidates for the open Virginia Tech job, reaffirmed his commitment to South Carolina last month and called the Gamecocks his \"dream job\" before saying he planned on helping the program get things back on track.Those words were three losses ago as South Carolina has faded deeper into irrelevancy and forced Beamer's hand at coaching staff changes. Signed through the 2030 season, Beamer's buyout is $27.9 million if fired without cause before Dec. 1.South Carolina finishes 1-7 in the SEC for the first time since 2015 -- during which former coach Steve Spurrier quit midseason -- and will miss the postseason for the second time in Beamer's tenure.\nCBS Sports spoke to a source close to Gamecocks athletic director Jeremiah Donati earlier this month following South Carolina's road loss to Ole Miss to gauge Beamer's potential future at the program. At the time, the belief was he would get the remainder of the season and the first half of the 2026 campaign before being evaluated.Beamer said last month he felt \"extremely supported\" by Donati, who took over for Ray Tanner, who hired Beamer ahead of the 2021 season.With four SEC jobs currently open as well as other Power Four conference vacancies, it's unlikely South Carolina will open this cycle. This is the type of loss, however, that turns up the heat considerably with home games remaining against Coastal Carolina and Clemson.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shane Beamer 'wanted to puke' after South Carolina's collapse at No. 3 Texas A&M - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/15/6898d8ba-2477-49b9-a5d8-196f6a4f138f/thumbnail/1200x675/5409922bed9fd2f45f34caae50393768/shane-beamer-south-carolina-vs-alabama.jpg"
      ],
      "datePublished": "2025-11-15T21:41:33.000Z",
      "dateModified": "2025-11-15T21:41:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas A&M: Trooper who made contact with South Carolina players 'sent home' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-state-trooper-south-carolina-players-texas-a-m-nyck-harbor-oscar-adaway/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/15/35db6092-8c9a-4a14-aba7-65c6458f10c4/thumbnail/1200x675/792ca0b57eb0a9cac53c971b83778d64/kyle-field-getty.png",
    "tag": "Sports",
    "date": "2025-11-15T21:52:56.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        A state trooper who made contact with South Caroli",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        A state trooper who made contact with South Carolina players Nyck Harbor and Oscar Adaway III during Saturday's SEC showdown with Texas A&M in College Station was relieved of his game-day duties and sent home, the university's police department said.\"The Texas Department of Public Safety (DPS) is aware of the incident that occurred today during the Texas A&M football game,\" the DPS said in a statement. \"The DPS Trooper involved was sent home from the game. Our Office of Inspector General (OIG) is also aware of the incident and will be further looking into the matter. No additional information will be released at this time.\"\nFollowing an 80-yard Harbor touchdown in the final minute of the second quarter, South Carolina's star wideout exited the end zone and his momentum carried him into the tunnel. He appeared to be in discomfort, holding the back of his right leg. Several of his Gamecock teammates followed him into the tunnel, and then walked with him back toward the field. As the players exited the tunnel, they were faced with a state trooper walking the opposite way. The officer bumped into the players, and then turned around and pointed at them while saying something. \nThis incident was just one of several bizarre things that took place in this conference matchup, as the third-ranked Aggies came back from a 30-3 deficit to win 31-30. Texas A&M outscored South Carolina 28-0 in the second half, making it the largest comeback in program history. Marcel Reed and the A&M offense scored on four consecutive possessions amid an improbable comeback. \nTexas A&M improved to 10-0 with the win while South Carolina fell to 3-7.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas A&M: Trooper who made contact with South Carolina players 'sent home' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/15/35db6092-8c9a-4a14-aba7-65c6458f10c4/thumbnail/1200x675/792ca0b57eb0a9cac53c971b83778d64/kyle-field-getty.png"
      ],
      "datePublished": "2025-11-15T21:52:56.000Z",
      "dateModified": "2025-11-15T21:52:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets today: This Week 11 parlay returns 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-11-nfl-picks-today-predictions-odds-best-bets-football-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/06/2b22e72d-f074-461f-9341-174f14c5cbdc/thumbnail/1200x675/33a62776c32e14612c07d69bf8f77157/ceedee-lamb.jpg",
    "tag": "Sports",
    "date": "2025-11-15T23:00:57.000Z",
    "description": "\n        An eye-popping nine divisional games highlight the NFL Week 11 schedule. Among the most intriguing pits the Seattle Seahawks (7-2) against th",
    "body": "\n        An eye-popping nine divisional games highlight the NFL Week 11 schedule. Among the most intriguing pits the Seattle Seahawks (7-2) against the Los Angeles Rams (7-2) with first place in the NFC West on the line. Another huge matchup has the nine-time defending AFC West-champion Kansas City Chiefs (5-4) battling the Denver Broncos (8-2), who hold the top spot in the division. The Rams enter as 3-point favorites, but the teams have split their last six meetings. The Chiefs, meanwhile, are 3.5-point favorites. It is one of nine Week 11 matchups with a spread of 3.5 or fewer.  There are a number of other intriguing matchups on the Week 11 NFL schedule, including Panthers vs. Falcons (-3.5), Buccaneers vs. Bills (-6) as Buffalo looks to rebound from a head-scratching loss at Miami last week, Chargers vs. Jaguars (+3), Bears vs. Vikings (-2.5), 49ers vs. Cardinals (+3) as well as Lions vs. Eagles (-2.5). Before locking in any Week 11 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 11 on a 47-32 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 11 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of around 25-1. You can only see the model's Week 11 NFL picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins:Top Week 11 NFL picksAfter simulating every game 10,000 times, the model is high on the Dallas Cowboys (-3.5, 49.5), to cover against the Las Vegas Raiders on 'Monday Night Football.' The Cowboys are out to snap a two-game losing streak, while the Raiders have dropped three in a row. Dallas is led by veteran quarterback Dak Prescott. In nine games, Prescott has completed 69.3% of his passes for 2,319 yards and 17 touchdowns, with six interceptions and a rating of 98.8. Javonte Williams powers the Dallas ground attack, carrying 139 times for 716 yards (5.2 average) and eight touchdowns.The model has Dallas winning outright 67% of the time and covering in 60% of simulations. See which other NFL parlay picks to make here, and bet the Cowboys to cover here:How to make Week 11 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 11 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 11 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 11 NFL best bets from a model on a 47-32 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets today: This Week 11 parlay returns 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/06/2b22e72d-f074-461f-9341-174f14c5cbdc/thumbnail/1200x675/33a62776c32e14612c07d69bf8f77157/ceedee-lamb.jpg"
      ],
      "datePublished": "2025-11-15T23:00:57.000Z",
      "dateModified": "2025-11-15T23:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Darryn Peterson injury: Could Kansas star, top NBA prospect, miss Duke showdown? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/darryn-peterson-injury-kansas-jayhawks-freshman-nba-draft/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/9eb89eac-27c8-41d8-b4a5-5935251e6c95/thumbnail/1200x675/059e37fe3142e8fb58d35bc609f5fdba/untitled-design-92.png",
    "tag": "Sports",
    "date": "2025-11-16T01:48:13.000Z",
    "description": "\n        Kansas freshman guard Darryn Peterson, the projected No. 1 pick in the 2026 NBA Draft, will be out for the \"immediate future\" due to a hamstr",
    "body": "\n        Kansas freshman guard Darryn Peterson, the projected No. 1 pick in the 2026 NBA Draft, will be out for the \"immediate future\" due to a hamstring injury, coach Bill Self told reporters after his team's 76-57 win over Princeton on Saturday. Peterson has missed his team's last two games due to the injury, and his status for Kansas' marquee matchup against No. 4 Duke on Tuesday remains unclear.\"We're not obviously gonna have him, you know, at least for the immediate future,\" Self said. \"I just don't know how long that'll be.\"\nPeterson, one of the most highly touted guard prospects to come out of the high school ranks in years, made his collegiate debut against Green Bay earlier this month, finishing with 21 points, four rebounds and three assists. In his last appearance against North Carolina on the road, 247Sports' No. 1-ranked player in the 2025 recruiting cycle scored a season-high 22 points in a 87-74 loss.Self told reporters earlier this week that Peterson's hamstring issue has been lingering for \"weeks,\" but he has played through it. Notably, Peterson didn't finish an exhibition game against Louisville due to a cramping issue and also exited the second half against Green Bay due to cramps.\n\n        \n            \n                The future is here: Meet the college basketball stars destined for the 2026 NBA Draft\n                \n                    Adam Finkelstein                \n            \n                            \n    \n                \n                    \n    \n\"He's played with it,\" Self said earlier this week. \"But it's still sore. So medical staff and everybody think it's something that's healing and getting better. But the reality of it is, after the Carolina game, you guys remember that first burst that he had when he stole the ball and had the layup first two points of the game? He didn't do anything bad to it, but he said it just felt different since then, like tight. That's all it is, is tightness.\"Peterson has the fourth-best odds (+950) behind Duke's Cameron Boozer, Texas Tech's JT Toppin and Purdue's Braden Smith to win National Player of the Year, per FanDuel.What makes Darryn Peterson an elite NBA prospect?Peterson has started to create some separation among his peers to become the NBA's No. 1 overall pick in the summer. However, if you ask 10 people who follow the draft closely to predict the first three picks in the draft, you might get 10 different answers. While the top pick has been dominated by forwards, wings and bigs in recent years, Peterson has a chance to become the exception.\nIn CBS Sports' NBA Draft prospect rankings by Adam Finkelstein, Peterson was ranked No. 1, ahead of BYU's AJ Dybantsa and Boozer -- both of whom are wings/forwards at the NBA level.He finished as the top-ranked prospect in last year's recruiting class and begins this draft cycle in the same place. Peterson is a big, playmaking guard who continues to improve each year. His overlap of positional size, length, strength and shot creation is unmatched in this class. In fact, he may be the best domestic guard we've seen in several draft cycles. If the shot-making we've seen early on at Kansas proves sustainable, he could be even better than expected. The last guard taken with the No. 1 pick was Cade Cunningham in 2021. Since 2010, only six prospects who have gone No. 1 have been classified as a guard. Although Cooper Flagg has been utilized as a point guard through the first few weeks his NBA career by the Dallas Mavericks, he is a traditional wing at the NBA level.Part of the intrigue around Peterson is his potential to be a volume scorer at the NBA level. Peterson is also a talented defensive prospect who can defend at a high level because of his size and athleticism. But what stands out the most -- and why he may ultimately go No. 1 -- is his shot making that is second to none in this class. Peterson has all the makings to be an elite scorer at the next level.\nWhat does Darryn Peterson's injury mean for Kansas?Losing Peterson for an extended period of time would be a major issue for the Jayhawks, currently ranked No. 25 in the AP Top 25. It's no secret that Kansas has struggled to generate offense without Peterson on the floor. Peterson has served as the primary ball handler within the offense and is the go-to scorer for the Jayhawks.Even with the jump second-year forward Flory Bidunga has taken on the offensive end, there is a notable absence without Peterson in the lineup. Without Peterson, Kansas will rely more on veteran guard Tre White, who transferred into the program in the offseason from Illinois. He is averaging 10.0 points in three games, tied for third on his team.\nDarryn Peterson could miss showdown with Cameron BoozerIf Peterson does miss the game against Duke next week, it would be a major loss for the Jayhawks and college basketball fans as a whole. The matchup between Peterson and Boozer -- who also projects as a top-three pick this summer -- would've been one college basketball fans hadn't seen in years during the regular season.The last time players faced off in the regular season and also went in the top three of the same NBA Draft was in 2021. That year, Duke's Paolo Banchero -- the No. 1 overall pick in the 2022 draft -- went up against Gonzaga's Chet Holmgren (the No. 2 pick) in an epic showdown. \nThere have been six instances of top-three picks facing off against each other during the regular season and the NCAA Tournament since 2010. The most recent example came this past spring, when Flagg and Duke faced Baylor's VJ Edgecombe (the No. 3 pick) in the second round.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Darryn Peterson injury: Could Kansas star, top NBA prospect, miss Duke showdown? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/9eb89eac-27c8-41d8-b4a5-5935251e6c95/thumbnail/1200x675/059e37fe3142e8fb58d35bc609f5fdba/untitled-design-92.png"
      ],
      "datePublished": "2025-11-16T01:48:13.000Z",
      "dateModified": "2025-11-16T01:48:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]