[
  {
    "title": "Week 14 Fantasy football rankings, sleepers, start-sit lineup advice from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-rankings-projections-sleepers-streamers-week-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/555e5108-d60f-4fb3-8f87-be772c84f50b/thumbnail/1200x675/3f64a785f16c082d8e54c8dbad13887c/caleb-williams-chicago-bears-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-02T17:12:36.000Z",
    "description": "\n        Just when you thought byes were a thing of the past this NFL season, your Week 14 Fantasy football lineups have to account for four teams bei",
    "body": "\n        Just when you thought byes were a thing of the past this NFL season, your Week 14 Fantasy football lineups have to account for four teams being off. That includes Fantasy star quarterbacks like Drake Maye and Jaxson Dart being on a bye, which causes a shuffle in the Week 14 Fantasy football QB rankings. Thus, players like Sam Darnold, Jordan Love, Bo Nix and Trevor Lawrence, who are often a part of Fantasy football start-sit decisions, may appear a bit more promising for this week.Meanwhile, the likes of Tyrod Taylor, Jacoby Brissett and even rookie Tyler Shough all ranked among the top 12 in QB Fantasy points last week. Are any of them worth considering starting with some leagues beginning their 2025 Fantasy football playoffs this week? You could use your gut in deciding who to start, or you can consult with Week 14 Fantasy football projections from a highly reliable source. Before making your Week 14 Fantasy football picks, be sure to check out the Week 14 Fantasy football rankings from the proven computer model at SportsLine. Bet on every NFL Week 14 game at DraftKings Sportsbook, where new users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 initial wager wins:When it comes to ranking players, SportsLine's model beat human experts in Fantasy football for the past several seasons, especially when there were big differences in ranking. Over the course of a season, that could literally be the difference between winning your league or going home empty-handed.The same model has a proven track record providing Fantasy football tips, including being ahead of the curve on players like A.J. Brown, Jonathan Taylor, Derrick Henry, Christian McCaffrey, Alvin Kamara and Jahmyr Gibbs. Anybody who banked on players like those could have made a run at their league title.Now, the model, which simulates every NFL game 10,000 times, has revealed its Fantasy football rankings for Week 14 of the 2025 NFL season. Head to SportsLine now to see them. New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. Top Week 14 Fantasy football picks One surprise in Week 14: The model is fading Bears QB Caleb Williams, who has 10 total touchdowns, versus just one interception, over his last five games and is the QB8 this season. Williams has been the catalyst to Chicago sitting atop the NFC standings and having the No. 6 total offense, and while he's been efficient as of late, he hasn't been overly productive. He's had one or fewer touchdown passes in seven of his last nine games, and with Chicago going 8-1 over that stretch, the Bears won't tinker with their offensive strategy. Chicago takes on Green Bay on Sunday, with the Pack allowing the sixth-fewest Fantasy points to quarterbacks in 2025. Williams averaged just 189.5 passing yards versus the Packers last season, with one total touchdown. Williams may not warrant a spot in Week 14 Fantasy football lineups as he sits outside the top 15 in quarterback rankings.Another curveball: The model is high on Dolphins tight end Darren Waller, who is the TE30 in standard leagues and the TE37 in PPR scoring. The veteran began the year sidelined, then played in a few games only to then head to IR, so he may have flown under the radar for many. But he returned to play last week and had 47 receiving yards, despite playing less than half of the snaps. Over his four games this year in which he received targets, Waller's averaged 41 yards with four total touchdowns. That scoring prowess has a great chance to continue in Week 14 versus the Jets, who have allowed the second-most touchdowns to tight ends. Even when not allowing scores, the Jets are still allowing yards to the position as Kyle Pitts (82 yards) had his most yards in over a calendar year versus New York last week. For more start/sit Fantasy football advice, be sure to check out the rest of the Week 14 Fantasy football rankings.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2  in select states.How to set Week 14 Fantasy football rankingsThe model is also calling for a surprising quarterback you aren't even thinking about to finish in the top three of its Week 14 Fantasy football rankings, despite him sitting outside the top 10 of both positional Fantasy points and Fantasy points per game. This pick could be the difference between winning big and going home with nothing. See the model's entire Week 14 Fantasy football rankings for PPR and standard leagues here.So who should you start and sit this week, and which surprising quarterback could lead you to victory? Visit SportsLine now to get Week 14 Fantasy football rankings for every position, plus see which quarterback is going to come out of nowhere to crack the top three all from the model that has outperformed experts big-time.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 14 Fantasy football rankings, sleepers, start-sit lineup advice from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/555e5108-d60f-4fb3-8f87-be772c84f50b/thumbnail/1200x675/3f64a785f16c082d8e54c8dbad13887c/caleb-williams-chicago-bears-imagn-images.jpg"
      ],
      "datePublished": "2025-12-02T17:12:36.000Z",
      "dateModified": "2025-12-02T17:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Cena's last match in WWE: The Last Time is Now Tournament bracket, final - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/john-cena-last-match-wwe-last-time-is-now-tournament-bracket-results-schedule/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/661211a5-7479-4d30-b7fe-9279a5d28b3b/thumbnail/1200x675/f2233f25eae6b74e350343a50055763d/john-cena-wwe-last-time-now-tournament-results-preview-update-schedule-cbs-sports-pro-wrestling-nov-12-2025-retirement-match-farewell-tour.jpg",
    "tag": "Sports",
    "date": "2025-12-02T18:08:54.000Z",
    "description": "\n\n\n    \n                                    Updated results and complete schedule for the tournament that will determine the opponent for Cena's retir",
    "body": "\n\n\n    \n                                    Updated results and complete schedule for the tournament that will determine the opponent for Cena's retirement match\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 2, 2025\n                            \n                    at\n    1:08 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                WWE\n            \n            \n    \n        John Cena will wrestle his last match at WWE Saturday Night's Main Event on Dec. 13. But the honor to see who gets to face the star before his retirement must be earned, and so WWE superstars are currently battling in The Last Time is Now Tournament, with the winner ultimately becoming Cena's final opponent in Washington, D.C.The Last Time is Now Tournament competition began on the Nov. 10 episode of Monday Night Raw and will continue on the two weekly main roster shows, leading into the fifth and final Saturday Night's Main Event of 2025.Sixteen superstars from Raw, SmackDown, and NXT competed for the unique opportunity to show Cena the door. Two superstars remain: former world heavyweight champion GUNTHER and longtime fan-favorite LA Knight. GUNTHER defeated Solo Sikoa, and Knight upset Jey Uso to secure their spots in the finals.The tournament featured several twists and turns along the way. Two surprise entrants from Cena's past competed in the tournament. Zack Ryder returned for a one-off match on SmackDown, and Dolph Ziggler received a warm ovation for his match on Raw. The Miz lost his opening round match against Uso, but snuck back into the tournament after Sheamus pulled out with an injury.\nTake a look below at the tournament schedule, results, and upcoming match dates. Check back periodically for updates ahead of Cena's last farewell stop on Dec. 13.The Last Time is Now Tournament bracket\n                                                                    WWE\n                                                            The Last Time is Now Tournament matchesFirst roundRusev def. Damian Priest (Raw, Nov. 10)Sheamus def. Shinsuke Nakamura (Raw, Nov. 10)Jey Uso def. The Miz (SmackDown, Nov. 14)LA Knight def. Zack Ryder (SmackDown, Nov. 14)GUNTHER def. Je'Von Evans (Raw, Nov. 17)Solo Sikoa def. Nic Nemeth (Raw, Nov. 17)Carmelo Hayes def. Bronson Reed (SmackDown, Nov. 21)Penta def. Finn Balor (SmackDown, Nov. 21)QuarterfinalsGUNTHER def. Carmelo Hayes (Raw, Nov. 24)Solo Sikoa def. Penta (Raw, Nov. 24)Jey Uso def. Rusev (SmackDown, Nov. 28)LA Knight def. The Miz (SmackDown, Nov. 28)SemifinalsGUNTHER def. Solo Sikoa (Raw, Dec. 1)LA Knight def. Jey Uso (Raw, Dec. 1)  FinalsGunther vs. LA Knight (Raw, Dec. 8)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Cena's last match in WWE: The Last Time is Now Tournament bracket, final - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/661211a5-7479-4d30-b7fe-9279a5d28b3b/thumbnail/1200x675/f2233f25eae6b74e350343a50055763d/john-cena-wwe-last-time-now-tournament-results-preview-update-schedule-cbs-sports-pro-wrestling-nov-12-2025-retirement-match-farewell-tour.jpg"
      ],
      "datePublished": "2025-12-02T18:08:54.000Z",
      "dateModified": "2025-12-02T18:08:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Omarion Hampton injury: Chargers RB likely to return against Eagles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/omarion-hampton-injury-chargers-rb-ankle-eagles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/88102830-0b82-4fc5-ae17-8c860bea322f/thumbnail/1200x675/65b67e56ac8929797ac99b89e8ce0757/hamp.jpg",
    "tag": "Sports",
    "date": "2025-12-02T19:27:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Chargers have a Week 14 showdown w",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Chargers have a Week 14 showdown with the reigning Super Bowl champions on Monday night, and they may get an important piece of their offense back for it. Chargers rookie running back Omarion Hampton is likely to return to the field against the Philadelphia Eagles after missing the last seven games due to an ankle injury, according to CBS Sports' Matt Zenitz. Hampton landed on injured reserve in early October after the Week 5 loss to the Washington Commanders. Hampton entered Week 5 leading all rookies in scrimmage yards with 380, and had his first 100-yard rushing game in Week 4. In five games played, the No. 22 overall pick rushed 66 times for 314 yards and two touchdowns, and caught 20 passes for 136 yards.Kimani Vidal stepped up as the Chargers lead back after Hampton went down. In the past seven games, he rushed for 525 yards and three touchdowns. The former sixth-round pick out of Troy cleared 115 yards rushing in three games, including Sunday's 126-yard outing against the Las Vegas Raiders.While Hampton may return for this primetime matchup, it's still unclear if Justin Herbert will start. The Chargers quarterback underwent surgery to stabilize a fracture in his left, non-throwing hand on Monday, and the team says his status is considered day-to-day. If Herbert cannot go, Trey Lance makes his first start for the Chargers. \nThe 8-4 Chargers reside in second place in the AFC West behind the 10-2 Denver Broncos, and hold the top wild-card spot in the conference. Los Angeles has a 9.5% chance of winning the division, but a 64% chance of making the playoffs, according to SportsLine data expert Stephen Oh.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Omarion Hampton injury: Chargers RB likely to return against Eagles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/88102830-0b82-4fc5-ae17-8c860bea322f/thumbnail/1200x675/65b67e56ac8929797ac99b89e8ce0757/hamp.jpg"
      ],
      "datePublished": "2025-12-02T19:27:26.000Z",
      "dateModified": "2025-12-02T19:27:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dillon Brooks says he won't 'bow down' to LeBron James, Lakers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/dillon-brooks-says-hes-wont-bow-down-to-lebron-james-and-his-33-point-outing-against-the-lakers-proved-it/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/316a840d-3253-4dc1-992f-3dc5906819aa/thumbnail/1200x675/abdd138207ead53af5742b83e187294d/dillon-brooks.jpg",
    "tag": "Sports",
    "date": "2025-12-02T18:24:09.000Z",
    "description": "\n        The Phoenix Suns snapped the Los Angeles Lakers' seven-game winning streak with a heavy dose of trash talking and scoring from Dillon Brooks.",
    "body": "\n        The Phoenix Suns snapped the Los Angeles Lakers' seven-game winning streak with a heavy dose of trash talking and scoring from Dillon Brooks. In the 125-108 blowout win, Brooks led the Suns with 33 points on a night where Devin Booker played just nine minutes after suffering a groin injury.With every made bucket, Brooks let everyone within earshot know he's not afraid of the moment. He hit mid-range jumpers, a couple 3s and finishing tough buckets at the rim that prompted him to do LeBron James' own celebration shrugs in front of him. Brooks was met with continuous booing from the crowd after hitting James' celebration.\nBrooks relished the moment, especially after James jawed with the Suns guard during a timeout that required his Lakers teammates to come and get him. James finished with just 10 points on a 30% shooting night.\n\"I'm a competitor, I don't really like the smiling, the giggling and all that,\" Brooks said. \"Just letting him know that I'm here and that I'm still rising.\"\nWhen asked if James took offense to Brooks' words, the Suns guard didn't mince words on how he feels about the league's all-time leading scorer.\"Always, always, he likes people that bow down, I don't bow down,\" Brooks said. \"That either entices him, or aggravates him.\"Brooks and James have some history going back to the 2023 playoffs when he was still a member of the Memphis Grizzlies. In a Game 2 win of that series in which Brooks made some clutch 3s over James and had a back-and-forth throughout the game, he called the four-time champion \"old.\" Brooks explained the confrontation with James, saying \"I don't care, he's old. ... I poke bears. I don't respect someone until he gives me 40.\"\nJames won the last laugh that round after leading the Lakers to a 4-2 series win. By comparison, Brooks had his worst playoff performance, which ended up being the last time he suited up for the Grizzlies in part because of his on-court antics.Over Brooks' nine-year career he embraces a heel persona. He thrives in getting under his opponents' skin, and uses that to his advantage to help his team win. He's gotten in countless skirmishes, especially during his six years with the Grizzlies. But he's not just an enforcer or a defensive pest whose only capable of playing aggressive defense, he's also a skilled offensive player who can get you a handful of buckets every night. All of that was on full display Monday night against the Lakers, where massive offensive performances back up his talk. Once Green returns, and if Brooks continues this level of play the Suns have the potential to surprise some people in a deep Western Conference. Very few people expected this team to be where they are right now, and even less thought it would be because of Brooks' offensive play. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dillon Brooks says he won't 'bow down' to LeBron James, Lakers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/316a840d-3253-4dc1-992f-3dc5906819aa/thumbnail/1200x675/abdd138207ead53af5742b83e187294d/dillon-brooks.jpg"
      ],
      "datePublished": "2025-12-02T18:24:09.000Z",
      "dateModified": "2025-12-02T18:24:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BYU gains momentum to keep coach Kalani Sitake amid Penn State pursuit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/byu-momentum-keep-kalani-sitake-penn-state-pursuit/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/677fa8fc-2aff-4310-9751-971c44e3af07/thumbnail/1200x675/3c09d055297524cd8e64c5b28b65010f/kalani-sitake-byu-v-ucf.jpg",
    "tag": "Sports",
    "date": "2025-12-02T17:51:29.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Days ahead of the Big 12 Championship Game between",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Days ahead of the Big 12 Championship Game between BYU and Texas Tech, the Cougars are locked in another matchup of sorts as they fight to keep head coach Kalani Sitake in Provo. Sitake emerged as the target of Penn State's search on Monday, per multiple sources. He's been offered by the Nittany Lions and momentum seemed to be trending toward the 50-year-old Sitake taking the Penn State job. However, sources tell CBS Sports that BYU is making an aggressive push over the last 24 hours to keep Sitake home. There is some optimism on BYU's side in talking with sources that they may be able to retain Sitake. Penn State, meanwhile, felt like it basically had a deal in place Monday but there is some uncertainty about what Sitake will choose to do. All of this comes to a head the day before the start of the early signing period and just a few days out from BYU's first appearance in the Big 12 title game. The Cougars (11-1) remain a strong playoff contender and would clinch a spot in the 12-team bracket with a win over Texas Tech. \nAmid all the Penn State discourse that emerged Monday, Sitake met with his team, per a source. He didn't shoot down the Penn State rumors in that meeting. \n        \n            \n                Penn State's cookie problem: Crumbl CEO, other BYU donors make push to keep Kalani Sitake in Provo\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nBut the Cougars donor base has deep pockets, including Crumbl founder Jason McGowan, and they're rallying to keep Sitake, an alumnus of the program, around for the foreseeable future. Sitake is in Year 10 with the Cougars and has a 83-44 overall record with the school. He helped BYU navigate the transition to the Big 12 in 2023. The Cougars are 22-3 over the last two seasons. \nPenn State's coaching search has been a labored and secretive process with a wide range of candidates rumored. Coaches who have been linked with the process include those like Vanderbilt's Clark Lea, Missouri's Eli Drinkwitz and Nebraska's Matt Rhule. All three have received contract extensions since the job opened. Interim head coach Terry Smith has also been a factor in the search.  \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BYU gains momentum to keep coach Kalani Sitake amid Penn State pursuit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/677fa8fc-2aff-4310-9751-971c44e3af07/thumbnail/1200x675/3c09d055297524cd8e64c5b28b65010f/kalani-sitake-byu-v-ucf.jpg"
      ],
      "datePublished": "2025-12-02T17:51:29.000Z",
      "dateModified": "2025-12-02T17:51:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oleksandr Usyk targeting Deontay Wilder for next title defense: 'He is first option' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/oleksandr-usyk-deontay-wilder-heavyweight-boxing/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/40454aff-f460-4e46-9222-e55accf0a744/thumbnail/1200x675/18b4c30a336e4f4a33bbb18bc1d9c589/oleksandr-usyk-getty.jpg",
    "tag": "Sports",
    "date": "2025-12-02T18:02:43.000Z",
    "description": "\n        Deontay Wilder may have fallen out of the top of the heavyweight rankings over the past few years, but division kingpin Oleksandr Usyk would ",
    "body": "\n        Deontay Wilder may have fallen out of the top of the heavyweight rankings over the past few years, but division kingpin Oleksandr Usyk would still like to share the ring with the former champion. Usyk, who holds the WBA, IBF and WBC titles, recently claimed Wilder is his preferred next opponent.\"I spoke with my team and said he is the first option,\" Usyk told Boxing King Media. \"I want to fight Deontay Wilder. I think it's interesting. ... He is a world champion guy. A very famous and strong guy, one of the great heavyweights of the last 10 years.\"Usyk (24-0, 15 KO) last fought in July, dominating Daniel Dubois en route to a fifth round knockout. The win over Dubois saw Usyk crowned undisputed heavyweight champion for the second time in his career, having first accomplished the task with his May 2024 win over Tyson Fury.Usyk was stripped of the IBF title after the Fury win, a result of pursuing the contractually obligated Fury rematch rather than defend against an IBF mandatory challenger. Dubois picked up that IBF title, while Usyk again defeated Fury before grabbing the IBF title back from Dubois.\nUsyk would go on to vacate the WBO title, which has since been won by Fabio Wardley. Usyk is also a former undisputed cruiserweight champion.Wilder (44-4-1, 43 KO) spent the majority of his career as one of the most feared punchers in boxing history. His one-punch knockout power made him a star while also going unbeaten in his first 43 professional fights.Wilder won the WBC title in January 2015 and made 10 successful defenses of the belt before a February 2020 stoppage loss to Fury. A second loss to Fury followed soon after.\nWilder got back in the win column with a first-round knockout of Robert Helenius before dropping a decision to Joseph Parker and suffering a knockout loss to Zhilei Zhang. In those losses, Wilder looked as though he was having trouble pulling the trigger, throwing very few punches and looking as though he'd aged overnight.In June, Wilder returned to the ring, knocking out unheralded Tyrrell Herndon in the seventh round.Wilder is currently ranked No. 13 by the WBC and is unranked by the other three major sanctioning bodies.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oleksandr Usyk targeting Deontay Wilder for next title defense: 'He is first option' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/40454aff-f460-4e46-9222-e55accf0a744/thumbnail/1200x675/18b4c30a336e4f4a33bbb18bc1d9c589/oleksandr-usyk-getty.jpg"
      ],
      "datePublished": "2025-12-02T18:02:43.000Z",
      "dateModified": "2025-12-02T18:02:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Signing Day viewing guide: Race for No. 1 class, players to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/signing-day-recruiting-viewers-guide-battle-for-no-1-flip-drama-and-final-moves-to-track/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/d7aa2ad0-7fd8-48af-bff3-f76e9adadf66/thumbnail/1200x675/4c404a2dd600a62009d5a3b0421fc882/jamesfranklinvirginiatech.jpg",
    "tag": "Sports",
    "date": "2025-12-02T19:55:09.000Z",
    "description": "\n        The finish line ribbon is within reach.Signing Day looms. It is one of the biggest checkpoints in the talent acquisition calendar, with high ",
    "body": "\n        The finish line ribbon is within reach.Signing Day looms. It is one of the biggest checkpoints in the talent acquisition calendar, with high school recruits in the 2026 class set to make things official with their respective college football programs.Here is a quick-hit user guide to get you ready for the start of the Early Signing Period (Dec. 3-5). Watch our National Signing Day show LIVE starting at 10 a.m. ET on the CBS Sports College Football YouTube page for commitments, analysis and reactions. \nGrab a 247Sports subscription today to get inside scoop on your favorite team, expert analysis and opinion on all the day's biggest news and read content across the 247Sports network. \nWhy will Signing Day be so quiet? More than 95% of the recruits in the Top247 rankings had made their college commitments ahead of the college season, a trend that has become more prevalent in the Name, Image and Likeness era as prospects secure agreements early in the process.Signing Day has lost the theatrics. College coaches no longer jostle for the final in-home meeting with a prospect's family, instead handing off most of the responsibility to the program's talent acquisition group.Live announcements, and their accompanying drama, now take place in the spring and summer when recruits are busy wrapping up official visits to schools. Flips and decommitments ramped up the level of activity toward the end of October -- a byproduct of a constantly spinning coaching carousel -- yet it's still expected to be a calm Signing Day.\nPerhaps no statistic is more indicative of how sewn-up recruiting has become than this: the top 13 teams in the Composite Team Recruiting Rankings on the eve of Signing Day were all within the top 13 at the start of the season.Any wiggle room in race for No. 1?With five-star Jared Curtis flipping his commitment from Georgia to Vanderbilt, it's a matter of when, not if, USC signs the nation's top-ranked class.The Bulldogs needed to hang onto Curtis, whom they initially beat out Oregon for, and a few other things to go their way on the flip front for them to chase down the Trojans from behind but now that scenario is out the window.\nAlabama now sits in the No. 2 spot entering the final hours before signatures begin trickling in. A few prospects remain in play for the Tide, including four-star offensive tackle Bryson Cooley, an LSU commit from the state of Mississippi that Lane Kiffin would surely love to hang onto.But any addition from the Tide would theoretically be for naught from a rankings standpoint given that USC appears to be in prime position to land a flip of its own. Blue-chip wide receiver Kayden Dixon-Wyatt, who has been committed to Ohio State since May, could be leaning toward staying out West to play for the Trojans.If USC finishes in first place, it would be the first time since 2008 that a non-SEC program secured the top spot in the recruiting rankings.\nThree players to keep an eye on Wednesday \nChris Henry Jr., WR, Ohio State commitWill the five-star prospect from powerhouse Santa Ana (Calif.) Mater Dei follow through with his longstanding commitment to Ohio State or flip to Oregon? Henry, the son of the late Chris Henry, has continued to be a top priority for Dan Lanning and his staff, despite being on the Buckeyes' list of commits since July 2023. When asked about his status after Mater Dei's final game this season, Henry fanned the flames even further by declining to discuss his recruitment. Could this be a leverage play, which are commonplace in the age of NIL? The Buckeyes continue to feel good about Henry inking his paperwork.\nKayden Dixon-Wyatt, WR, Ohio State commitThe nation's No. 6-rated receiver looks much likelier to flip from the Buckeyes than Henry, his high school teammate. Sources out West have suggested that USC has done a terrific job of sustaining the relationship. Considering the success of pass-catchers like Makai Lemon and Ja'Kobi Lane, on top of the production from true freshman Tanook Hines this season, sources close to the recruitment acknowledge that the opportunity to feature in a Lincoln Riley offense might be too good to decline.\nCarter Gooden, EDGE, UCLAA commit to UCLA since the summer, Gooden has remained in the Bruins' class despite the firing of DeShaun Foster and subsequent coaching search. But it's always an eye-popping development when a committed prospect has an announcement to make, and that's what the nation's No. 90 overall player plans to do live on the CBS Sports College Football YouTube channel on Wednesday. Vanderbilt and Tennessee have continued to lurk, and the high-upside Gooden would be a coup for both SEC programs. The Commodores could be in line for a huge day after the flip of Curtis, while the Volunteers would also be an enticing destination for Gooden whose projectable frame aligns with how they have built their depth in the trenches.\nWhich new coach is being the most active?With just eight names on the Virginia Tech commitment list when James Franklin took the helm on Nov. 17, things were looking bleak on the doorstep of the Early Signing Period.The Hokies ranked 124th overall in the Composite recruiting standings, and were in danger of finishing outside the top 50 for just the second time in the modern recruiting era.Fast forward to this week and it's been flip after flip for Franklin, who needed only two weeks on the job to essentially raid Penn State's class and help Virginia Tech ascend to No. 32 overall.\nFranklin and Co. might not be done -- four-star safety Matt Sieg, a longtime commit to Penn State, is another player who plans to announce a final decision Wednesday on the CBS Sports College Football YouTube channel. The Hokies are battling hometown Pitt for Sieg at the finish line.A large group of visitors that made it to Blacksburg for the Miami game on Nov. 22 set the table for the impressive turnaround, providing a glimpse of what Franklin aspires to accomplish on the recruiting trail.The Hokies haven't signed a top-20 class since 2008, but if the buzz around the program is any indication the Hokies could be a team to monitor closely next cycle.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Signing Day viewing guide: Race for No. 1 class, players to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/d7aa2ad0-7fd8-48af-bff3-f76e9adadf66/thumbnail/1200x675/4c404a2dd600a62009d5a3b0421fc882/jamesfranklinvirginiatech.jpg"
      ],
      "datePublished": "2025-12-02T19:55:09.000Z",
      "dateModified": "2025-12-02T19:55:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Tomlin on hot seat? Coach offers legitimate reason why Steelers fans are justified calling for his head - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-tomlin-on-hot-seat-coach-offers-legitimate-reason-why-steelers-fans-are-justified-calling-for-his-head/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/ae6b1044-a87c-4373-ad25-b8435330d927/thumbnail/1200x675/f4b2f7cae4c07b00dcadb944e24eacb9/tomlin2513.jpg",
    "tag": "Sports",
    "date": "2025-12-02T19:08:23.000Z",
    "description": "\n        Mike Tomlin was inevitably asked about fans chanting for him to be fired during the Steelers' 26-7 loss to the Bills this past Sunday, a loss",
    "body": "\n        Mike Tomlin was inevitably asked about fans chanting for him to be fired during the Steelers' 26-7 loss to the Bills this past Sunday, a loss that dropped Pittsburgh to 6-6 entering Sunday's showdown with the Ravens for first place in the AFC North. While the question was expected, Tomlin's answer was anything but. \"You know, in general, I agree with them,\" Tomlin said. \"From this perspective: football is our game. We're in the sport entertainment business. And so if you root for the Steelers, entertaining them is winning. And so when you're not winning, it's not entertaining. And if you've been in this business, you understand that. And so I respect it. I share frustrations. I understand what makes this thing go and winning is what makes this thing go.\"Tomlin, who was smiling while giving the above response, was incredibly transparent during his longer than usual weekly press conference. An example of that was his response when asked if the Steelers have found an identity. \"Yeah, 6-6, and I don't like it,\" he said. Tomlin acknowledged that the Steelers haven't been good lately (they've lost five of their last seven games), but he made it clear that he hasn't lost confidence in his team or in himself.\n\"It's no different than what you guys do,\" Tomlin said. \"You guys might write a bad article or a couple of bad articles. Does it lessen your confidence in your ability to write articles the next time? I imagine it doesn't because you've been doing it all your adult lives, and it's the same for us as individuals or collective in this business. Certainly, our last performance wasn't up to snuff, but I don't know that it lessens our belief in self or our ability to deliver individually and collectively moving forward.\"Tomlin stayed with the writer analogy when asked if the Steelers' recent struggles have forced him to reevaluate how he does his job. \"Do you when you write a bad article?\" Tomlin asked. \"It certainly does, because if you've got a desire to be great, you better analyze things in a really critical way. And I think that's what you're asking. And certainly, if winning is our agenda, and it is. We're not going to be hypersensitive to that.\" \nTomlin said that while changes will be made \"out of necessity,\" there will be no significant changes to the responsibilities of his assistant coaches. He also did not allude to any possible significant roster changes. Tomlin alluded to Pittsburgh's .500 record again when asked about his team's physicality (a major point of emphasis this offseason) entering Sunday's game against a Ravens team that ran for 299 yards during its win over the Steelers in January's wild card playoff matchup. \"Based on the last performance, not so good, but certainly at different times in this journey, I felt really good about it,\" he said. \"And so I think that could describe a lot of conversations, as I mentioned earlier, when you're sitting at 6-6, for us, it's about absorbing that and understanding that, and plotting our course moving forward, but also understanding that the things that happen to us don't are not vacuum related. ... I'd imagine Baltimore's got similar challenges and issues, because they're sitting at 6-6 as well. And so the team that can manage those things and summon up the good in a more, really consistent way, has a chance to control this game this weekend.\"\nWhile Tomlin may agree with those calling for his job now, he doesn't anticipate that being the case when the 2025 season is said and done. Tomlin's track record of resurrecting seemingly lost seasons would suggest that he and the Steelers are about to go on another unexpected run. Typically, when faced in similar situations, Tomlin's teams have increased their level of physicality and execution while making the critical big plays that often dictates who wins and who losses. The Steelers also typically lean into their strengths on both sides of the ball while either eliminating or minimizing the things that could be considered weaknesses. Furthermore, the Steelers have usually received elevated play from individuals, such as Le'Veon Bell (in 2013 and '16), Ryan Shazier (2016), Minkah Fitzpatrick (2019), T.J. Watt (2021), Kenny Pickett (2022) and Mason Rudolph (2023), among others. \nSteelers' notable in-season turnarounds under Tomlin YearRecord at lowest pointFinal recordPlayoff result20132-68-8N/A20154-410-6Def. by Broncos in Div. round20164-511-5Def. by Patriots in AFC Championship20191-48-8N/A20211-39-7-1Def. by Chiefs in wild card round 20223-79-8N/A20237-710-7Def. by Bills in wild card round As you can see, Tomlin's ability to get his team respond to adversity is well-documented. But while it has led to some salvaged regular seasons, it has largely failed to lead to playoff success. Tomlin will surely receive more outside criticism if Pittsburgh's current playoff drought (which is currently at eight years) doesn't end this January. But before he and the players can get to that point, they first have to win enough of the remaining five games on their regular-season schedule, starting with Sunday's showdown in Baltimore. Speaking of the players, Tomlin feels that he once again has a team that can rise above its current adversity. \"I think the basic premise that we start with in terms of assembling a group, whether it's draft or free agency, is we like good men who happen to be good at football,\" he said. \"Secondarily, we like men who absolutely love football. We believe that those two attributes really lend itself to the discussion that you asked about. The ability to assess, the ability to absorb, the ability to dig in when things get difficult, I think are a little bit easier when you've got good people, and when you've got people that love what it is they do.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Tomlin on hot seat? Coach offers legitimate reason why Steelers fans are justified calling for his head - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/ae6b1044-a87c-4373-ad25-b8435330d927/thumbnail/1200x675/f4b2f7cae4c07b00dcadb944e24eacb9/tomlin2513.jpg"
      ],
      "datePublished": "2025-12-02T19:08:23.000Z",
      "dateModified": "2025-12-02T19:08:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots' Mike Vrabel heavily favored to win NFL Coach of the Year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-mike-vrabel-heavily-favored-nfl-coach-award/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/f2092795-85f6-4c3b-8f67-de1630d59bcb/thumbnail/1200x675/551058a01c071da721670f6218f4b3bf/vrabel.jpg",
    "tag": "Sports",
    "date": "2025-12-02T18:29:31.000Z",
    "description": "\n        The New England Patriots and coach Mike Vrabel improved to 11-2 with their 33-15 victory over the New York Giants on Monday night, and they h",
    "body": "\n        The New England Patriots and coach Mike Vrabel improved to 11-2 with their 33-15 victory over the New York Giants on Monday night, and they have a clear path to secure the No. 1 seed in the AFC. It represents a remarkable turnaround for a team coming off back-to-back 4-13 seasons.The headline of the Patriots' 2025 campaign has been second-year quarterback Drake Maye, who leads the NFL in completion percentage (71.5%), passing yards (3,412) and passer rating (111.9). He is the fifth second-year quarterback to win 10 straight starts, and the previous four all won NFL MVP and/or a Super Bowl during their careers. That list includes John Elway, Dan Marino, Peyton Manning and Lamar Jackson. Maye is favored to win NFL MVP at FanDuel Sportsbook.Maye is not the only reason the Patriots are in the midst of a magical campaign. Credit also needs to be given to Mike Vrabel. Sure, there was general optimism when Robert Kraft hired the legendary Patriots linebacker to take over as lead man, but who saw an 11-win season right off the bat?For that reason, Vrabel is now a relatively heavy favorite to win NFL Coach of the Year.\nNFL Coach of the Year Odds (FanDuel Sportsbook)Coach OddsMike Vrabel, New England Patriots-195Ben Johnson, Chicago Bears+250Mike Macdonald, Seattle Seahawks+650Brian Schottenheimer, Dallas Cowboys+1900Dave Canales, Carolina Panthers+2200Shane Steichen, Indianapolis Colts+2500Liam Coen, Jacksonville Jaguars+2500Vrabel won NFL Coach of the Year once before, in 2021 with the Tennessee Titans. That year, the Titans earned the No. 1 seed in the AFC with a 12-5 record despite dealing with a tremendous amount of injuries, including to star running back Derrick Henry. By the end of the season, the Titans broke an NFL record by playing 91 different players.Vrabel earned the reputation of getting the most out of his players, and that carried over to New England. The Patriots added plenty of new faces this offseason, and those new faces have made immediate impacts. Rookie running back TreVeyon Henderson leads the team in rushing, free-agent signing Stefon Diggs leads the team in receiving, free-agent signing Robert Spillane leads the team in tackles while free-agent signing Harold Landry leads the team in sacks. Whether they are a Patriot that played under Bill Belichick and Jerod Mayo like cornerback Christian Gonzalez, or a recent signing like cornerback Carlton Davis, these guys like playing for Vrabel. \"He came off being a cool guy, personable, players coach,\" Davis said of Vrabel, per ESPN. \"Everybody kind of bought into it, and we kind of created this quick brotherhood and this bond between each other, where we want to play for each other. But we also want to play for him.\"Patriots as legitimate contendersWhile the Patriots have the best record in the NFL, it's still fair to wonder if they are legitimate Super Bowl contenders. According to CBS Sports Research, the Patriots have played the easiest strength of schedule this season. What was the Patriots' key victory? New England upset the Bills in Buffalo in Week 5. But this Bills team hasn't looked like a legitimate contender, dropping games to the Atlanta Falcons, Miami Dolphins and Houston Texans. The Patriots lost to the Las Vegas Raiders and Pittsburgh Steelers early in the year, then played close matchups with the New Orleans Saints, Cincinnati Bengals and Falcons. Monday's win over the Giants felt like New England's first dominant victory since Week 8 against the Cleveland Browns.The Patriots can't do anything about their seemingly easy schedule. All you can do is play who is in front of you. As it stands now, the Philadelphia Eagles (+900), Green Bay Packers (+900), Seahawks (+850) and Los Angeles Rams (+460) have better odds than the Patriots to win the Super Bowl this year. The Patriots have a couple of important matchups ahead of them with the Bills in Week 15 and the Baltimore Ravens the week after that. Whether they are truly the best team in the AFC or not, earning that coveted first-round bye could help in their Super Bowl pursuit. SportsLine's projectionsChances to win AFC East88.1%Chances to win the AFC Championship27.7%Chances to win Super Bowl LX13.6%\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots' Mike Vrabel heavily favored to win NFL Coach of the Year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/f2092795-85f6-4c3b-8f67-de1630d59bcb/thumbnail/1200x675/551058a01c071da721670f6218f4b3bf/vrabel.jpg"
      ],
      "datePublished": "2025-12-02T18:29:31.000Z",
      "dateModified": "2025-12-02T18:29:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boston College to retain Bill O'Brien, increase football financial commitment - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/boston-college-bill-obrien-college-football-commitment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/ae50929a-0187-4e40-9f30-1721f60a5c2f/thumbnail/1200x675/e9a4fe231daa6956f1f55ff32d2b14d7/bob.jpg",
    "tag": "Sports",
    "date": "2025-12-02T19:33:01.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Boston College athletic director Blake James wrote",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Boston College athletic director Blake James wrote a letter to fans confirming coach Bill O'Brien will be back for a third season in Chestnut Hill despite the Eagles' 2-10 record in 2025. James wrote that he still believes O'Brien is the \"right man\" for the job, and most importantly, provided an update on how Boston College will increase its  financial commitment to the football program to allow O'Brien to build the kind of roster that can compete in the ACC. The letter laid out three ways the school will do that. Revenue sharing: Boston College will increase its revenue sharing with athletes to the \"maximum permissible level\" to bring them in line with other Power Four programs in revenue sharing spending after offering a smaller allotment in 2025. Staffing: James vowed that BC will make \"significant investments\" in the operations and administrative staff, with the most notable addition being hiring Kenyatta Watson, a former BC player and the assistant GM at Auburn, as its new general manager. Increased fundraising: James announced Boston College received a $50 million challenge from a donor to match donations to new endowment gifts for athletic scholarships and operational expenses over the next 5-7 years. The school will announce a new fundraising campaign to hit that $50 million match and hopes to exceed it. After going 7-6 in his first season, O'Brien's Eagles took a significant step back in 2025. Their lone win over an FBS opponent came in the season finale against Syracuse, and it was clear they fell behind their ACC counterparts. \nThat is why the investment piece is so important. Bringing in Watson, who was highly regarded as a recruiter over his time working at Auburn, Florida State and Georgia Tech, to lead the way as the GM is a big step towards improving the roster, and he likely asked for assurances that he would have the kind of resources in the form of full revenue sharing to maximize what BC can do in terms of bringing more talent onto the roster. A number of programs successfully passed the hat recently with donors to get their finances in order to either keep a coach happy or make their job more enticing to a bigger name. Virginia Tech got a massive financial commitment before hiring James Franklin, proving a willingness to do what it takes to contend in the ACC, and now Boston College is trying to do the same to give O'Brien every opportunity to build them into a consistently quality program. \nWhile this is a long-term commitment, the 2026 season will prove important for O'Brien to show that these newly invested resources are going to a good cause. Another season at the very bottom of the ACC would surely dampen enthusiasm to invest more into the program. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boston College to retain Bill O'Brien, increase football financial commitment - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/ae50929a-0187-4e40-9f30-1721f60a5c2f/thumbnail/1200x675/e9a4fe231daa6956f1f55ff32d2b14d7/bob.jpg"
      ],
      "datePublished": "2025-12-02T19:33:01.000Z",
      "dateModified": "2025-12-02T19:33:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who's qualified for the 2026 World Cup? Full list of teams so far - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/world-cup-2026-qualified-teams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/36dbda15-88a3-4a0a-b412-388466002c6d/thumbnail/1200x675/83f181ee34ff6535a49f0dea36854c3f/untitled-design-2025-12-02t123331-977.png",
    "tag": "Sports",
    "date": "2025-12-02T19:01:29.000Z",
    "description": "\n        The 2026 FIFA men's World Cup is fast approaching and with almost all the qualifying finished, Friday's draw will confirm the path for most t",
    "body": "\n        The 2026 FIFA men's World Cup is fast approaching and with almost all the qualifying finished, Friday's draw will confirm the path for most teams through the tournament. There new 48 team field. after FIFA decided to expand from the old 32-team format that had been in place since the 1998 World Cup, means 12 groups of four. The 2026 edition will take place in the United States, Canada, and Mexico, kicking off on June 11, 2026, at Estadio Azteca in Mexico City, and ending on July 19 at MetLife Stadium in New York City.Because of the tournament's expansion, Europe is guaranteed 16 slots out of the 48 total teams, while the African confederation (CAF) gets nine, and Asia (AFC) has eight. There will also be a minimum of six each from South America (CONMEBOL) and the Confederation of North, Central America and Caribbean Association Football (Concacaf). On top of this, for the first time in history, the Oceania Football Confederation (OFC) has one guaranteed slot, while the remaining two spots will be decided through intercontinental playoffs.In part thanks to the expansion there are four teams that secured qualification to the first men's World Cup in their history. Uzbekistan, Jordan, Cabo Verde and Curacao will all be at the World Cup for the first time, and more first-timers could join them as the dust settles. With a population of 185,494, Curacao became the smallest nation to ever qualify for the World Cup. Let's take a look at who has already booked their tickets to the World Cup:Already qualified for the 2026 World CupSpots clinched: 42/48World Cup hosts Since the 2026 World Cup is co-hosted by three nations, they all receive an automatic qualifying spot in the tournament. United StatesMexicoCanadaAFC Qualifiers IranUzbekistanSouth KoreaJordanAustraliaJapanQatarSaudi ArabiaConcacaf QualifiersHaitiCuracaoPanamaOFC Qualifier\nNew ZealandCONMEBOL QualifiersArgentinaBrazilEcuadorColombiaParaguayUruguayCAF QualifiersMoroccoEgyptTunisiaGhanaCabo VerdeAlgeriaSouth AfricaSenegalIvory CoastUEFA qualifiersEnglandFranceCroatiaPortugal Norway Germany Netherlands SwitzerlandScotlandSpainAustriaBelgium Chaos in UEFATeams such as England, Portugal, France and Croatia booked their place in the World Cup, as the winners of each qualifying group will head directly to the tournament. But the second-placed team in each group will head to a playoff phase, such as Italy that might miss their third World Cup in a row. Those 12 second-placed teams will be joined by the four best UEFA Nations League group winners.That second round will see 16 teams drawn into four paths with two rounds of single-match playoffs that will lead to a final with the four overall path winners heading to the World Cup. Due to that process, no UEFA teams will take part in the inter-confederation playoffs. These also won't conclude until March of 2026.Who makes the inter-confederation playoffs?The final World Cup participants won't be determined until March of 2026, following the draw for the World Cup groups. A playoff will take place in North America in March, including one team each from the following regions: AFC, CAF, CONMEBOL, OFC, alongside two from Concacaf to determine the final two places in the World Cup. The bottom four teams in the FIFA World Rankings will be drawn into two single-elimination matches, where the winner will advance to face the top two teams in the rankings, with the winners of those two matches qualifying for the World Cup. Currently in the inter-confederation playoffs\nBoliviaDR CongoIraqJamaicaNew CaledoniaSurinameWhen is the World Cup draw?Paths to the World Cup final will be revealed on Dec. 5 in a ceremony taking place at the Kennedy Center in Washington, D.C.. At that time, teams will know what groups they will be drawn into, and while the final teams will still need to be determined, placeholders will be used for their spots in the draw.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who's qualified for the 2026 World Cup? Full list of teams so far - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/36dbda15-88a3-4a0a-b412-388466002c6d/thumbnail/1200x675/83f181ee34ff6535a49f0dea36854c3f/untitled-design-2025-12-02t123331-977.png"
      ],
      "datePublished": "2025-12-02T19:01:29.000Z",
      "dateModified": "2025-12-02T19:01:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: MacKenzie Gore, Freddy Peralta may stay; Mets, Edwin Díaz can't agree - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-mackenzie-gore-freddy-peralta-mets-edwin-diaz-cardinals-wilson-contreras/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/a5e9667d-f696-423e-be2b-bd47d013a687/thumbnail/1200x675/1fda71675c9f538a277f56a7b8c475c3/gore-getty.png",
    "tag": "Sports",
    "date": "2025-12-02T16:46:51.000Z",
    "description": "\n        The 2025-26 Major League Baseball offseason is fully underway, and we're working our way through the sport's offseason calendar. Among other ",
    "body": "\n        The 2025-26 Major League Baseball offseason is fully underway, and we're working our way through the sport's offseason calendar. Among other things, the winter in baseball means a steady supply of rumors regarding free agent signings, trades, and the like. Speaking of which, you can find Tuesday's roundup just below. Nats listening on MacKenzie Gore The Nationals under new lead decision-maker Paul Toboni are listening to trade offers on 26-year-old lefty MacKenzie Gore, ESPN reports, but they're not inclined to move him unless they get a particularly strong proposal. \nGore is coming off a 2025 campaign in which he earned his first All-Star selection, but he faded badly down the stretch. One of the key return pieces in the 2022 trade that sent Juan Soto to the Padres, Gore has an ERA+ of 98 across four MLB seasons. He's under team control through the end of the 2027 season. Brewers inclined to keep PeraltaAfter the Brewers signaled that they may be looking to trim payroll ahead of the 2026 season, many justifiably assumed that ace Freddy Peralta might be on the trade block this winter. While that might yet be the case, ESPN reports that the Brewers for now are inclined to hold the line and enter the 2026 season with Peralta at the front end of a strong rotation that also includes Brandon Woodruff, Jacob Misiorowski, and Quinn Priester. \nEdwin Díaz return still a possibility for MetsThe Mets' signing of high-leverage reliever Devin Williams gives them an option at closer for 2026 and beyond, but the Williams addition doesn't mean a reunion with Edwin Díaz is out of the question. \nDiscussions with Díaz are ongoing, but to get a deal the two sides will need to bridge a gap in terms of contract length, the Athletic reports. Díaz's side is angling for five years coming off a stellar 2025, but the Mets would prefer not to commit more than three years to the right-hander who's going into his age-32 campaign. Notably, Williams is willing to work in a setup role, which at least in theory clears the decks for a Díaz return. First, though, comes the much more significant hurdle of agreeing to terms. Willson Contreras willing to consider tradeCardinals catcher-turned-first baseman Willson Contreras has for some time said he prefers to remain with St. Louis through what's taking shape as a significant rebuild. However, the Athletic reports that stance has changed and Contreras is now willing to consider waiving his no-trade clause for a deal to a contender.\nContreras in 2026 had an OPS+ of 123 with excellent quality-of-contact indicators. He's signed through 2027 and owed $36.5 million over the final two years of his contract. He moved off of the catcher position last season in order to reduce wear and tear and to give way to the Cardinals' glut of catching prospects arriving in the majors. A willingness to return to catching on a part-time basis would likely enhance Contreras' trade value, but it's not yet known whether that's a consideration. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: MacKenzie Gore, Freddy Peralta may stay; Mets, Edwin Díaz can't agree - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/a5e9667d-f696-423e-be2b-bd47d013a687/thumbnail/1200x675/1fda71675c9f538a277f56a7b8c475c3/gore-getty.png"
      ],
      "datePublished": "2025-12-02T16:46:51.000Z",
      "dateModified": "2025-12-02T16:46:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Thomas says U.S. fought over Ryder Cup greens; Keegan Bradley blames himself - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/ryder-cup-bethpage-black-justin-thomas-keegan-bradley/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/4eea59e7-8cd6-4d28-b3be-741718af0ff2/thumbnail/1200x675/37935a633a3380713fce95e168267dce/thomas-putt.jpg",
    "tag": "Sports",
    "date": "2025-12-02T18:01:20.000Z",
    "description": "\n        The 2025 Ryder Cup didn't end up as a lopsided defeat for the United States, thanks to a wild Sunday surge in singles. That was too little to",
    "body": "\n        The 2025 Ryder Cup didn't end up as a lopsided defeat for the United States, thanks to a wild Sunday surge in singles. That was too little too late, considering Europe had built up a massive lead over the first two days to become the first team to win an away Ryder Cup since 2012. There was no shortage of blame passed around after the U.S. side fell short at home, and captain Keegan Bradley bore the brunt of it, especially when it came to complaints about the course setup at Bethpage BlackKnown as one of golf's toughest tests, Bethpage Black was neutered by a decision to cut down the rough. Rain early in the week softened the greens, and the Europeans crushed the Americans across the first two days thanks to a red-hot putting display on greens that lacked the fire most expected. That was apparently a point of contention between the U.S. team and the greens staff at Bethpage Black, and the greens were noticeably quicker on Sunday when the Americans made their charge. Bradley was largely blamed for specifying how the green should run, but Justin Thomas confirmed that the course staff and the U.S. team argued over the green speeds through the week during a recent appearance on the No Laying Up podcast.\n\"I don't know why they weren't at all what Keegan had asked for,\" Thomas said. \"I mean, he had been pretty clear of asking for a certain speed and wanting it fast enough. I watched them argue with us that they were 13s [on the Stimpmeter]. It's like, 'Guys, we play golf every week, like, look on TV at how many guys are leaving putts short. Nobody is getting ... You can't have a putt roll 3-4 feet past the hole. Like, these greens are slow. Speed them up.'\"\"It was just bizarre because that's not something you would expect at a home Ryder Cup. And again, that's not an excuse. They had to adjust to them just as much as we did,\" Thomas added. \"But that's kind of a fun advantage you generally have is being able to [set up the course] a little bit, and it was just so frustrating that we were being fought with and argued with on the speed of the greens that we asked for. So that was bizarre.\"To Thomas' point, none of this is an excuse for the Americans' poor performance on Friday and Saturday. Still, it is certainly not the situation a team wants to experience when choosing the course setup is supposed to be one of the main advantages for the home side. \nThat will be something the PGA of America will have to address ahead the next Ryder Cup staged stateside, as the course staff must be willing to adapt if the greens aren't where the team wants them. Perhaps they were rolling 13 on the Stimpmeter, but if the team says they need to be faster, then you have to try everything you can to speed them up rather than pushing back. At the same time, the U.S. side must be able to adjust and perform better, even if they aren't getting the exact conditions they wanted. Softer greens are harder to speed up, and with the rain that the course took on the week of the Ryder Cup, the U.S. team had to play better in the conditions that confronted them. While cutting down the rough was an own goal by Bradley, the way the greens played was perhaps not his fault after all.\n\"I do know that, once the tournament starts, the Sunday before the Ryder Cup, we lose control of the golf course, the home team,\" Bradley said in a follow-up to Thomas' comments. \"They were given specifications of where to keep the greens, and they felt that they had done that. \"They did a great job. It's so difficult to figure out. There's so much going on, and you want the greens at a certain speed, and they're telling you that they are. You've got to take their word for it. But the greens are so flat that it's difficult, I think, to get the pace that we were looking for. But the course was in great shape.\"You know, the Europeans, they just played so great. I wish that we could blame somebody, but we can't. Blame me. I blame myself for that lost. It would be nice to blame them, but we can't.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Thomas says U.S. fought over Ryder Cup greens; Keegan Bradley blames himself - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/4eea59e7-8cd6-4d28-b3be-741718af0ff2/thumbnail/1200x675/37935a633a3380713fce95e168267dce/thomas-putt.jpg"
      ],
      "datePublished": "2025-12-02T18:01:20.000Z",
      "dateModified": "2025-12-02T18:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heisman Trophy 2025 odds: - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/heisman-trophy-2025-odds-fernando-mendoza-julian-sayin-likely-battling-for-trophy-in-big-ten-title-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/d646a3a6-6e54-46b4-9cd9-dcdd0c67edf6/thumbnail/1200x675/f8635e730256ac59764b61b13fc6f54e/fernando-mendoza-indiana-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-02T17:35:52.000Z",
    "description": "\n        According to the oddsmakers, we are down three players with a realistic chance to win the Heisman Trophy. Indiana quarterback Fernando Mendoz",
    "body": "\n        According to the oddsmakers, we are down three players with a realistic chance to win the Heisman Trophy. Indiana quarterback Fernando Mendoza is the betting favorite at +115, followed by Ohio State quarterback Julian Sayin (+140) and Vanderbilt quarterback Diego Pavia (+300).After the top three is Notre Dame running back Jeremiyah Love at a distant +1000. So barring something crazy, it will likely be either Mendoza, Sayin or Pavia hoisting the 2025 Heisman Trophy on Dec. 13.Bet $1 or more on college football at Caesars Sportsbook and get 20 100% profit boosts using the promo code CBS20X:Heisman Trophy Odds ahead of Week 13 (odds via Caesars)FavoritesFernando Mendoza, Indiana QB (+115)In a year when no one really ran away as the overwhelming favorite, Mendoza has been the most consistent. The Indiana quarterback has been one of the favorites since the Hoosiers blasted Illinois 63-10 on Sept. 20. You can make an argument for Sayin and Pavia. However, I think Mendoza will win the Heisman. Not only did he have a sensational season throwing 32 touchdowns and only five interceptions while leading the Hoosiers to an undefeated season, Indiana is also a great story. Curt Cignetti took over one of the worst programs in college football and turned them into a serious title contender in two years. That could resonate with voters. I expect it to be close, but Mendoza edges out Sayin and Pavia.Julian Sayin, Ohio State QB (+140)A strong case can be made for Sayin to win the Heisman. The sophomore started his first game versus Texas back in August as a bit of an unknown. All he did was throw for over 3,000 yards, 30 touchdowns, and lead Ohio State to an undefeated regular season. The one thing going against Sayin though is I thought he needed to have a big game against Michigan with all the voters watching to nail down the award. Sayin played well throwing for 233 yards and three touchdowns, although because the Buckeyes jumped out to a big lead on a windy day, they didn't need to rely on him as much. In other words, there was no signature moment like Mendoza had against Penn State. It's going to be razor close between Mendoza and Sayin but I think the Ohio State quarterback comes up just short.Diego Pavia, Vanderbilt QB (+300)I love Pavia and if I had a vote, he might get it. I think what he has done helping Vanderbilt become a borderline College Football Playoff team is amazing. He also plays with the kind of moxie that some voters like, including striking the Heisman pose after a touchdown against Tennessee. The problem for Pavia is Vanderbilt lost its two toughest games of the season against Alabama and Texas. He really needed to beat one of those teams to have a realistic shot at winning the award. Pavia will get invited to New York City but a third place finish is the likely outcome.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heisman Trophy 2025 odds: - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/d646a3a6-6e54-46b4-9cd9-dcdd0c67edf6/thumbnail/1200x675/f8635e730256ac59764b61b13fc6f54e/fernando-mendoza-indiana-cbs-imagn.jpg"
      ],
      "datePublished": "2025-12-02T17:35:52.000Z",
      "dateModified": "2025-12-02T17:35:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danilo Gallinari retires: Former Knicks lottery pick, NBA veteran calls it a career - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/danilo-gallinari-retires-knicks-nba/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/6d725d11-3908-4924-97df-78c97fe6c024/thumbnail/1200x675/df6632292e094723b27c881a226ec190/danilo-gallinari.jpg",
    "tag": "Sports",
    "date": "2025-12-02T17:05:51.000Z",
    "description": "\n        Danilo Gallinari, the No. 6 overall pick to the New York Knicks in the 2008 NBA Draft who played for eight different teams across 14 NBA seas",
    "body": "\n        Danilo Gallinari, the No. 6 overall pick to the New York Knicks in the 2008 NBA Draft who played for eight different teams across 14 NBA seasons, retired Tuesday, he announced on social media.\"I don't remember when you really came into my life,\" Gallinari, 37, says in Italian in the accompanying video. \"Maybe the day I first heard the ball bounce or maybe when I realized there was something more beyond that sound. You've been a dream, a refuge, a constant challenge. You made me grow up. You made me fall. You picked me back up, and you taught me to never stop believing and trying. Together we've lived moments that became snapshots in the album of my memories.\"Thanks to you I've met wonderful people, friends, rivals, travel companions. In every battle, every tear, every celebration, there was a piece of your story and of ours. So I say thank you with a heart full of gratitude for every fall, every comeback, every round of applause and every silence and above all for teaching me who I am on and off the court. Our journey doesn't end here. It's just the destination that changes, not because the love is gone, but because sometimes feelings evolve, and every story needs its final chapter. You'll always be a part of me.\"\nAfter spending four years as a professional in Italy, Gallinari declared for the NBA Draft as a 19-year-old and the Knicks drafted him shortly thereafter. After a quiet debut season beset by back injuries, Gallinari averaged 15.1 points per game in 2009-10 and was having another strong campaign in 2010-11 before being one of the major pieces going to the Denver Nuggets in the blockbuster trade that sent Carmelo Anthony to New York.\nGallinari evolved into a key piece in Denver before tearing his ACL late in the 2012-13 season. The injury cost him all of 2013-14, as well. He averaged a then-career-high 19.5 points in 2015-16 and had a strong 2016-17 season, too, but was traded to the Los Angeles Clippers in the 2017 offseason after the Nuggets signed Paul Millsap.Gallinari produced two strong seasons in Los Angeles -- including a career-high 19.8 points in 2018-19 -- before being part of another blockbuster, this time in the deal that sent Paul George to the Clippers and Shai Gilgeous-Alexander to the Oklahoma City Thunder.Oklahoma City traded Gallinari to the Hawks, where he spent two seasons and was then traded to the San Antonio Spurs in the Dejounte Murray deal. The rebuilding Spurs waived Gallinari, who landed shortly thereafter with the Boston Celtics. Gallinari never played for Boston due to a torn ACL suffered less than two months after signing with the team.\nGallinari spent the 2023-24 season with the Washington Wizards -- where he landed as part of the Kristaps Porziņģis trade -- Pistons and Bucks. He spent last season playing for the Vaqueros de Bayamón in Puerto Rico, where he won Finals MVP.Aside from his inclusion in several of the league's biggest trades, Gallinari was known as a skilled offensive big man and a forebear of the small-ball, space-and-pace movements in the NBA. From 2009-10 (his breakout season with the Knicks) to 2019-20, Gallinari made 1,179 3-points, third among all players 6'10\" or taller; only Kevin Durant and Kevin Love made more over that span.Gallinari, who was also a major part of the Italian national team even as recently as this year's FIBA EuroBasket competition, finishes his career with averages of 14.9 points and 4.7 rebounds on 42.8% shooting (38.1% from 3). His 11,607 career points are the most by any Italian player in NBA history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danilo Gallinari retires: Former Knicks lottery pick, NBA veteran calls it a career - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/6d725d11-3908-4924-97df-78c97fe6c024/thumbnail/1200x675/df6632292e094723b27c881a226ec190/danilo-gallinari.jpg"
      ],
      "datePublished": "2025-12-02T17:05:51.000Z",
      "dateModified": "2025-12-02T17:05:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]