[
  {
    "title": "Eetu Luostarinen injury: Panthers forward burned in barbecue 'mishap,' out weeks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/florida-panthers-eetu-luostarinen-injury-update-nhl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/72441f77-19e1-4493-b0a3-559bea465205/thumbnail/1200x675/203bab27e5f99d132926cc8995114aa2/gettyimages-2246104288-2.jpg",
    "tag": "Sports",
    "date": "2025-11-19T23:13:59.000Z",
    "description": "\n        The hits just keep coming for the Florida Panthers, and now they're suffering injuries away from the rink too. On Wednesday, coach Paul Mauri",
    "body": "\n        The hits just keep coming for the Florida Panthers, and now they're suffering injuries away from the rink too. On Wednesday, coach Paul Maurice announced that forward Eetu Luostarinen is expected to miss time after what he described as a \"barbecuing mishap.\"Maurice said that Luostarinen suffered burns in the incident, but it wasn't serious enough that he had to stay overnight in the hospital. Still, Luostarinen was burnt badly enough that Maurice labeled him \"week-to-week,\" and his return timeline may depend on when he's comfortable wearing pads again.\"I'm gonna list him as week-to-week because we don't have a lot of experience with this,\" Maurice said. \"Some of it's when he comes back and feels comfortable putting the equipment on. He wasn't in the hospital overnight. He did get seen by doctors in that vein.\"\n        \n            \n                Connor Bedard, Macklin Celebrini and Leo Carlsson have arrived as the NHL's next wave of superstars\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nLuostarinen joins a laundry list of Panthers on the shelf due to injury. At this point, Florida, currently 10-8-1 on the season, could field quite the starting lineup with its injury report.F Aleksander Barkov (knee)F Matthew Tkachuk (abductor)D Dmitry Kulikov (labrum)F Eetu Luostarinen (burns)F Jonah Gadjovich (upper-body)F Cole Schwindt (arm)With seven players out of the lineup, the Florida lineup will look very different in the coming weeks and months. Maurice said his team, the two-time defending Stanley Cup champion, is just trying to \"survive\" for now, and admitted that missing that number of bodies is \"trouble\" for any team.\nBetween Barkov, Tkachuk, Kulikov, and Luostarinen, the Panthers are down four players who were pivotal in them repeating as Stanley Cup champions last summer. The three forwards combined for 19 goals and 47 assists last postseason, and Kulikov played a key role in the team's shutdown defense.The Panthers will now have to adapt to keep their heads above water in a very competitive Eastern Conference. If they can stay in the fight until reinforcements arrive, they may be better for it.\"We won't be dominant in a lot of games because of the personnel that's out, but we're staying in them,\" Maurice said. \"I think we're getting better in some areas we weren't even great in. We're forced to adapt our style of hockey to the players that are in. Some of that adaptation we'll get to keep. That's the idea. We're trying to do some things differently than we've done in the past.\"\nIf there's any good injury news for the Panthers, it's that Tkachuk could start skating in the next couple of weeks before making his return in December.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eetu Luostarinen injury: Panthers forward burned in barbecue 'mishap,' out weeks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/72441f77-19e1-4493-b0a3-559bea465205/thumbnail/1200x675/203bab27e5f99d132926cc8995114aa2/gettyimages-2246104288-2.jpg"
      ],
      "datePublished": "2025-11-19T23:13:59.000Z",
      "dateModified": "2025-11-19T23:13:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 NWSL Awards: Kansas City Current's Temwa Chawinga wins back-to-back MVP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/2025-nwsl-awards-mvp-rookie-defender-midfielder-coach-best-xi/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/f1869964-a1d8-4337-9bce-70d1a0645b42/thumbnail/1200x675/3d4bc6f30c983521455b7cbe62d18fe1/chawinga.jpg",
    "tag": "Sports",
    "date": "2025-11-20T02:45:53.000Z",
    "description": "\n        The National Women's Soccer League has its first-ever back-to-back MVP winner. Kansas City Current forward Temwa Chawinga was awarded 2025 NW",
    "body": "\n        The National Women's Soccer League has its first-ever back-to-back MVP winner. Kansas City Current forward Temwa Chawinga was awarded 2025 NWSL MVP on Wednesday through a tiered voting process that included players, coaches and executives, media, and fans. She is only the second player to win two NWSL MVP awards.The Malawi international was up against four other candidates, including club teammate Bia Zaneratto. Only Sam Kerr has won two MVP awards, in separate years, along with Golden Boot and best XI honors. Chawinga led the league in scoring with 15 goals in 23 regular-season appearances, and six of her goals were game-winners, matching a record she set last season. Chawinga walked away on the night with three individual awards: MVP, 2025 Golden Boot, and a spot on the NWSL's Best XI. She received them during NWSL Championship week in a special event at the San Jose Civic Center. It's the first-ever NWSL formal awards show and ceremony in its 13-year history. The MVP winner told the media after the ceremony that her favorite goal scored this year was her header goal, which was her first header scored in NWSL, and that winning this year feels different with the added special event.\"We didn't have an event like this. Just sent an email. And last season was like, I didn't know anything. I just came here like \"Okay, we'll see what type of players [and they're] great players. So, I'm so grateful that [media] chose me. The players and the coaches.\"\nHere are the official winners of the NWSL awards with winners in bold:MVPDelphine Cascarino (San Diego Wave FC)Temwa Chawinga (Kansas City Current)Esther González (Gotham FC)Manaka Matsukubo (North Carolina Courage)Bia Zaneratto (Kansas City Current)Defender of the YearJordyn Bugg (Seattle Reign FC)Tara McKeown (Washington Spirit)Avery Patterson (Houston Dash)Izzy Rodriguez (Kansas City Current)Kayla Sharples (Kansas City Current)Goalkeeper of the Year Lorena (Kansas City Current)Claudia Dickey (Seattle Reign FC)Ann-Katrin Berger (Gotham FC)Midfielder of the Year Kenza Dali (San Diego Wave)Debinha (Kansas City Current)Claire Hutton (Kansas City Current)Manaka Matsukubo (North Carolina Courage)Olivia Moultrie (Portland Thorns FC)Rookie of the Year Maddie Dahlien (Seattle Reign FC)Lilly Reale (Gotham FC)Riley Tiernan (Angel City FC)Coach of the YearVlatko Andonovski (Kansas City Current)Adrian Gonzalez (Washington Spirit)Beverly Yanez (Racing Louisville)Best XIGoalkeeper: Lorena (Kansas City Current)Defenders: Avery Patterson (Houston Dash), Kayla Sharples (Kansas City Current), Tara McKeown (Washington Spirit), Avery Patterson (Kansas City Current)Midfielders: Sam Coffey (Portland Thorns), Olivia Moultrie (Portland Thorns), Claire Hutton (Kansas City Current)\nForwards: Manaka Matsukubo (NC Courage), Esther Gonzalez (Gotham FC), Temwa Chawinga (Kansas City Current)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 NWSL Awards: Kansas City Current's Temwa Chawinga wins back-to-back MVP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/f1869964-a1d8-4337-9bce-70d1a0645b42/thumbnail/1200x675/3d4bc6f30c983521455b7cbe62d18fe1/chawinga.jpg"
      ],
      "datePublished": "2025-11-20T02:45:53.000Z",
      "dateModified": "2025-11-20T02:45:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball recruiting: Five-star forward Baba Oladotun commits to Maryland - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-recruiting-five-star-baba-oladotun-commits-maryland/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/32cac612-e0db-49c9-89ae-7ff1c73eff9d/thumbnail/1200x675/3fcfeff91c20079d7d3a8676d4e611aa/untitled-design-2025-11-19t180251-483.png",
    "tag": "Sports",
    "date": "2025-11-20T02:40:55.000Z",
    "description": "\n\n\n    \n                                    Oladotun's commitment gives Maryland the No. 3 class in the 2026 cycle and a foundational recruit to build",
    "body": "\n\n\n    \n                                    Oladotun's commitment gives Maryland the No. 3 class in the 2026 cycle and a foundational recruit to build around\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 19, 2025\n                            \n                    at\n    9:34 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        First-year Maryland coach Buzz Williams made his first major splash on the recruiting trail Wednesday as five-star recruit Baba Oladotun, the No. 10 overall player in the Class of 2026 and the No. 1-ranked player from the state of Maryland, announced his commitment to Williams and the Terrapins program. Oladotun chose Maryland over Georgetown, Kentucky and Arkansas.\"The relationship I built with coach Buzz Williams and the entire coaching staff was really crucial to me,\" he said during his announcement aired live on his YouTube channel. \"They took the time to get to know me and my entire family.\"Oladotun's said his two older sisters go to Maryland so the chance to be close to family -- and close to home as a Maryland native -- was for him a place that offered \"so many opportunities.\" He added his trainers and his entire support system are also there.\nOladotun was originally in the 2027 class and ranked as the No. 1 player before reclassifying in August. 247Sports ranks him as the No. 3 small forward in the class. 247Sports' Director of Scouting, Adam Finkelstein, said this of him this summer after the reclassification. He has been highly productive on the Nike EYBL circuit playing for Team Durant.\nOladotun is a late-blooming jumbo wing, who has continued to grow throughout his high school years and now stands at 6-foot-10 with a 7-foot-1 wingspan. He's still physically undeveloped with a lean frame, boxy shoulders, and high center of gravity, but isn't apprehensive to play through contact and only going to keep getting better as he grows into his body.His game, like his frame, is still a work-in-progress, but loaded with long-term potential. It's the vast scope of his versatile tools that is perhaps most compelling. He's already a threat to make plays as a handler, shoot over top of contesting defenders, or take smaller defenders into the mid-post. He tends to be a bit upright, but he has good hands and is very comfortable with his dribble. He made just 28% of his threes and 63% of his free-throws in EYBL play, and has an elbow that can fly out on his way up into his release, but still soft natural shooting touch to develop.Where he really excels is with his footwork. It comes out in the mid-post area, but even more so at the end of his drives. He has an instinctive ability to navigate the lane in ways that can't be taught, with a full repertoire of maneuvers after he picks up his dribble. He decelerates well, utilizes euros, but also knows when to elongate his strides. He'll even mix in pro-hops, spins, fake-spins, and step-throughs. He's a solid athlete, who can jump off either one foot or two, and can cover ground as more of a long-jumper, but it's really the footwork between his last dribble and before his finish that is so elite.The addition of Oladotun gives Maryland the No. 3-ranked class in the 247Sports Team Rankings behind only Michigan State and Kansas. He joins a class that also includes four-star recruits Kaden House and Adama Tambedou as well as three-star wing Austin Brown.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball recruiting: Five-star forward Baba Oladotun commits to Maryland - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/32cac612-e0db-49c9-89ae-7ff1c73eff9d/thumbnail/1200x675/3fcfeff91c20079d7d3a8676d4e611aa/untitled-design-2025-11-19t180251-483.png"
      ],
      "datePublished": "2025-11-20T02:40:55.000Z",
      "dateModified": "2025-11-20T02:40:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "European playoff draw: What to know, teams, live stream, how to watch, start time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/2026-world-cup-european-playoff-draw-teams-live-stream-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/4b046770-2d77-48b3-b3c6-1952fec008ad/thumbnail/1200x675/fa56293d81328403632595d8f1bf9d54/italy-1.jpg",
    "tag": "Sports",
    "date": "2025-11-19T23:53:07.000Z",
    "description": "\n        The 2026 World Cup is getting closer and while the draw for the upcoming summer tournament will take place on Dec. 5 in Washington D.C., some",
    "body": "\n        The 2026 World Cup is getting closer and while the draw for the upcoming summer tournament will take place on Dec. 5 in Washington D.C., some of the teams are yet to clinch a spot for the most important soccer competition in the world, which next year will take place in the United States, Canada and Mexico. In total, 42 national teams have already clinched a spot for the World Cup, while four European teams will need to clinch it through the UEFA playoffs and the inter-confederation playoffs will determine the last two non-European spots for the World Cup. Here's all you need to know ahead of Thursday's draw: \n        \n            \n                2026 FIFA World Cup qualified teams: Portugal, Germany clinch spot; Haiti, Curacao and Panama punch tickets\n                \n                    Francesco Porzio                \n            \n                            \n    \n                \n                    \n    \nHow to watch Date: Thursday, Nov. 20 | Time: 7 a.m. ETLocation: FIFA HQ, Zurich TV: FS1 | Live stream: Fubo (try for free)Teams qualified for the World CupLet's now take a look at the 42 teams that already clinched a spot for the 2026 World Cup. Since the 2026 World Cup is co-hosted by three nations, they all receive an automatic qualifying spot in the tournament: World Cup hosts: United States, Mexico, CanadaAFC Qualifiers: Iran, Uzbekistan, South Korea, Jordan, Australia, Japan, Qatar, Saudi ArabiaConcacaf Qualifiers: Haiti, Curacao, PanamaOFC Qualifier: New ZealandCONMEBOL Qualifiers: Argentina, Brazil, Ecuador, Colombia, Paraguay, UruguayCAF Qualifiers: Morocco, Egypt, Tunisia, Ghana, Cabo Verde, Algeria, South Africa, Senegal, Ivory Coast\nUEFA qualifiers: England, France, Croatia, Portugal, Norway, Germany, Netherlands, Switzerland, Scotland, Spain, Austria, Belgium Which teams are in European the play-offs?16 teams participate in the European play-offs: 12 runners-up from the European qualifiers group stage plus four teams that have qualified via the 2024-25 UEFA Nations League*.Group runners-up: Albania, Bosnia and Herzegovina, Czechia, Denmark, Italy, Kosovo, Poland, Republic of Ireland, Slovakia, Turkiye, Ukraine, Wales\nNations League route: Romania, Sweden, Northern Ireland, North Macedonia*The four additional teams were selected on the basis of the interim overall 2024-25 Nations League rankings, starting with the best-ranked group winners that have neither qualified directly for the final competition as European qualifiers group winners, nor entered the playoffs already as group runners-up.How does the draw work?The draw will set the eight playoff semifinals and the four final matchups. The 12 group runners-up will be allocated to the top three pots according to their FIFA ranking, while the four UEFA Nations League group winners will be placed in Pot 4. One team from each pot will then be drawn into four distinct playoff paths: Path A, Path B, Path C, and Path D. In every path, the Pot 1 team will face the Pot 4 team in a single-legged semifinal, while the Pot 2 and Pot 3 teams will meet in the other semifinal. The winners of each semifinal will advance to the final, also played as a single match, with the four path winners qualifying for the tournament.Based on the FIFA rankings, the 16 teams are divided into four pots as follows:Pot 1Pot 2Pot 3Pot 4ItalyPolandRepublic of IrelandRomaniaDenmarkWalesAlbaniaSwedenTurkyieCzechiaBosnia and HerzegovinaNorth MacedoniaUkraineSlovakiaKosovoNorthern IrelandThe four play-off paths will be formed in this way:Pot 1: the four top-seeded EQ teams are allocated to semifinals 1, 3, 5 and 7 in the order drawn.Pot 2: the four seeded EQ teams are drawn to the first available position of semifinals 2, 4, 6 and 8.Pot 3: the four unseeded EQ teams are drawn to the first available position of semifinals 2, 4, 6 and 8.Pot 4: the four unseeded UNL teams are drawn to the first available position of semifinals 1, 3, 5 and 7.When are the play-offs taking place? The playoffs will be played in a single-match format. Each path consists of two semifinals, with one seeded team facing one unseeded team. The seeded sides will host their respective semifinals, while the venue for each path's final will be determined in Thursday's draw. The semifinals are scheduled for Thursday, March 26, with the finals to follow on March 31.\nWorld Cup potsThe FIFA 2026 World Cup Final Draw will take place at the John F. Kennedy Center for the Performing Arts in Washington D.C. on December 5 at 12 p.m. ET.  Here's are projected World Cup draw pots after November's international break, with FIFA set to officially announce the pots in the coming days.  Pot 1Pot 2Pot 3Pot 4SpainCroatiaNorwayJordanArgentinaMoroccoPanamaCape VerdeFranceColombiaEgyptGhanaEnglandUruguayAlgeriaCuracaoBrazilSwitzerlandScotlandHaitiPortugalJapanParaguayNew ZealandNetherlandsSenegalTunisiaEuropean Playoff 1BelgiumIranIvory CoastEuropean Playoff 2GermanySouth KoreaUzbekistanEuropean Playoff 3United StatesEcuadorQatarEuropean Playoff 4MexicoAustriaSaudi ArabiaInter-confederation Playoff 1CanadaAustraliaSouth AfricaInter-confederation Playoff 2\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "European playoff draw: What to know, teams, live stream, how to watch, start time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/4b046770-2d77-48b3-b3c6-1952fec008ad/thumbnail/1200x675/fa56293d81328403632595d8f1bf9d54/italy-1.jpg"
      ],
      "datePublished": "2025-11-19T23:53:07.000Z",
      "dateModified": "2025-11-19T23:53:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn vs. Arizona prediction, odds: Best college basketball picks today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/uconn-arizona-odds-prediction-time-2025-college-basketball-picks-for-november-19/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/d551c141-1963-4ac4-88f7-696679c40aeb/thumbnail/1200x675/5f79037d9478222318cde849a1cd188a/solo-ball-uconn-huskies-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-19T21:56:56.000Z",
    "description": "\n        College basketball national title contenders meet in an early-season, top-five battle as the No. 4 Arizona Wildcats travel to take on the No.",
    "body": "\n        College basketball national title contenders meet in an early-season, top-five battle as the No. 4 Arizona Wildcats travel to take on the No. 3 UConn Huskies on Wednesday. Both teams have rolled to a 4-0 start and have picked up some impressive wins. UConn knocked off BYU over the weekend, while Arizona has defeated UCLA and Florida already. Tipoff from Gampel Pavilion is set for 7 p.m. ET. The Huskies are 6.5-point favorites in the latest UConn vs. Arizona odds, while the over/under is 154.5, down two points from the opener. Before making any Arizona vs. UConn picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every college basketball game 10,000 times and has returned over $2,000 in betting profit for $100 players on its top-rated college basketball picks over the past three-plus seasons. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.Now, the model has simulated UConn vs. Arizona 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Arizona vs. UConn:UConn vs. Arizona spread:    UConn -6.5UConn vs. Arizona over/under:    154.5 pointsUConn vs. Arizona money line:    UConn -295, Arizona +235UConn vs. Arizona picks:    See picks at SportsLineUConn vs. Arizona streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make UConn vs. Arizona picksSportsLine's model is going Over on the total (154.5 points). The model is projecting 155 points as the Over hits more than 50% of the time. The model also says one side of the spread hits in more than 60% of simulations. You can head to SportsLine to see the model's men's college basketball picks. So who wins UConn vs. Arizona, and which side of the spread hits in more than 60% of simulations? Visit SportsLine now to see which side of the spread to back, all from the advanced model was profitable on top-ranked college basketball picks last season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn vs. Arizona prediction, odds: Best college basketball picks today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/d551c141-1963-4ac4-88f7-696679c40aeb/thumbnail/1200x675/5f79037d9478222318cde849a1cd188a/solo-ball-uconn-huskies-imagn-images.jpg"
      ],
      "datePublished": "2025-11-19T21:56:56.000Z",
      "dateModified": "2025-11-19T21:56:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Buffalo vs. Miami (Ohio) prediction, odds: Wednesday MACtion picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-ohio-buffalo-prediction-odds-week-13-maction-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/e28e3f64-dd19-4a86-a148-c502491af993/thumbnail/1200x675/c01e8681b25b998499f307d2c4a4d282/jordan-brunson-miami-ohio-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-19T21:46:02.000Z",
    "description": "\n        Teams looking to stay in the MAC championship game conversation clash when the Miami (OH) RedHawks take on the Buffalo Bulls in MACtion on We",
    "body": "\n        Teams looking to stay in the MAC championship game conversation clash when the Miami (OH) RedHawks take on the Buffalo Bulls in MACtion on Wednesday night. The RedHawks (5-5, 4-2 MAC), who have lost two in a row, are 2-3 on the road this season. The Bulls (5-5, 4-2 MAC), who are tied with four other teams including Miami for second in the conference, are 2-3 on their home field.Kickoff from UB Stadium in Buffalo, N.Y., is at 7 p.m. ET. The RedHawks are 2.5-point favorites in the latest Miami vs. Buffalo odds, while the over/under for total points scored is 38.5. Before making any Miami vs. Buffalo picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line and over/under picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Miami vs. Buffalo. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Buffalo vs. Miami:Miami vs. Buffalo                                                                                         spreadMiami -2.5 at DraftKings SportsbookMiami vs. Buffalo                                                                                     over/under38.5 pointsMiami vs. Buffalo                                                                                                                                                                                                     money line Miami -136, Buffalo +114Miami vs. Buffalo                                                                                                                                                                                             picksSee picks at SportsLineMiami vs. Buffalo                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make Miami vs. Buffalo picksSportsLine's model is going Over on the total (38.5). The RedHawks have gone over the total in five of the last nine games, while the Bulls have been over in three of their past five. The teams combined for 40 or more points in five of their last six meetings.         The model has Miami quarterback Henry Hesson throwing for 220 yards and two touchdowns, while Buffalo quarterback Ta'Quan Roberson finds the end zone once, while throwing for more than 185 yards.    The model also says one side of the spread hits well over 50% of the time. You can only get that pick at SportsLine. So who wins Miami vs. Buffalo, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Miami vs. Buffalo spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Buffalo vs. Miami (Ohio) prediction, odds: Wednesday MACtion picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/e28e3f64-dd19-4a86-a148-c502491af993/thumbnail/1200x675/c01e8681b25b998499f307d2c4a4d282/jordan-brunson-miami-ohio-imagn-images.jpg"
      ],
      "datePublished": "2025-11-19T21:46:02.000Z",
      "dateModified": "2025-11-19T21:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Sports Commission sends participation agreement to Power Four conferences - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-sports-commission-nil-rules-regulations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/f65d08fc-948d-493c-8899-13deabf7b1a4/thumbnail/1200x675/f80c9862a2bb622af015827cfdd23947/generic-football-photo-1.jpg",
    "tag": "Sports",
    "date": "2025-11-20T01:33:19.000Z",
    "description": "\n        The long-awaited College Sports Commission participation agreement, viewed as a critical piece for the future of college sports, was sent out",
    "body": "\n        The long-awaited College Sports Commission participation agreement, viewed as a critical piece for the future of college sports, was sent out Wednesday to the Power Four conference schools.  It has been months in the making and delayed, in part, over disagreements on what a penalty structure should look like. The hope is that all of the Power Four schools will sign it and turn it back in within the next two weeks, a critical time period with the early signing period starting Dec. 3 and the transfer portal window opening Jan. 2.The 11-page participation agreement obtained by CBS Sports allows the CSC to enforce agreed upon rules, prevents schools from circumventing the system to sue over enforcement decisions they didn't like (long a problem in the NCAA enforcement model) and requires annual audits of all schools that spent 75 percent or more of the annual rev-share number, among other measures. Notably, it states that it does not override existing state laws.The piece most critical to CSC CEO Bryan Seeley and his team would prevent schools from pursuing jury trials outside of the CSC enforcement and appeal process. There are arbitration opportunities for the schools and student-athletes, but ultimately every participating school will be bound by the final decisions made. Led by Seely, the CSC was created to enforce revenue-sharing and NIL-related issues in the aftermath of the landmark passing of the $2.8 billion House settlement. \nThe document states that if any participant (student-athlete, school or associated entities or state officials) brings any suit or claim against the CSC related to membership rules, investigation or enforcement actions, it would \"forgo and not receive any and all revenue from its conference and not be eligible to compete in the post-season in the sport(s) involved in the investigation or decision.\"Conference commissioners, athletic directors and others hope all 68 Power 4 schools will sign off on the agreement and bring stability to a landscape where litigation -- or the threat of it -- has made it nearly impossible for the NCAA to enforce rules, from NIL to eligibility and everything in between.Once the agreements are signed, Seely and his team will have the runway to crank up the enforcement efforts and prevent salary cap circumvention, among other issues. Currently, every school that opts into the House settlement is able to spend up to $20.5 million annually on direct payments to student-athletes. \nAhead of the House settlement, many programs turned to a popular strategy known as \"front-loading,\" spending as much of their NIL dollars as possible before entering a world where every deal of $600 or more must be submitted to and reviewed by the NIL Go clearinghouse. With the CSC unable to enforce its rules so far, some within the industry have discussed continuing to spend significant NIL \"pay-for-play\" money without making it subject to NIL Go's fair-market-value review.There must be a compelling reason for everyone -- from schools to their most active boosters -- to follow the rules, and an enforceable penalty structure is one way to provide it.The penalties available to the CSC were not detailed in the agreement sent to schools on Wednesday, but they are expected to be finalized soon and codified as NCAA bylaws. One holdup in the participant agreement, sources told CBS Sports, was hesitation within the Big Ten to endorse postseason bans as a potential punishment. After months of discussion, the four power conferences ultimately agreed after limiting the circumstances of a possible postseason ban to: the most egregious violations, disregarding penalties and purposefully obstructing and/or not cooperating with investigations. \nAccording to those familiar with the expected structure, penalties could include a limited postseason ban, financial penalties for schools and individuals, restrictions on the number of transfers a program can take and more. One particularly notable consequence expected to be included is a reduction in how much revenue-share money a school can allocate to a specific team. The CSC cannot reduce the overall $20.5 million cap, but if violations are deemed severe, it could restrict a football program to, for example, 20% of the cap instead of the 75–80% most Power Four schools currently spend.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Sports Commission sends participation agreement to Power Four conferences - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/f65d08fc-948d-493c-8899-13deabf7b1a4/thumbnail/1200x675/f80c9862a2bb622af015827cfdd23947/generic-football-photo-1.jpg"
      ],
      "datePublished": "2025-11-20T01:33:19.000Z",
      "dateModified": "2025-11-20T01:33:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 World Cup inter-confederation playoffs draw: How to watch, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/how-to-watch-2026-world-cup-inter-confederation-playoffs-draw-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/fce80ec9-3704-438a-b31d-7c3166aac7c1/thumbnail/1200x675/70019bcd6fab59ee82d0f6b0b3622eb2/congo.jpg",
    "tag": "Sports",
    "date": "2025-11-19T23:51:39.000Z",
    "description": "\n        The 2026 World Cup is around the corner and while the final draw will take place on Dec. 5 in Washington D.C. some of the remaining teams are",
    "body": "\n        The 2026 World Cup is around the corner and while the final draw will take place on Dec. 5 in Washington D.C. some of the remaining teams are yet to clinch a spot for the most important soccer competition in the world. The competition, hosted next year by the United States, Canada, and Mexico, already has 42 qualified teams, with four European sides set to secure their place through the playoffs in March 2026. Meanwhile, the inter-confederation playoffs will determine the final two non-European spots. Here's all you need to know about the draw that will take place on Thursday:  \n        \n            \n                2026 FIFA World Cup qualified teams: Portugal, Germany clinch spot; Haiti, Curacao and Panama punch tickets\n                \n                    Francesco Porzio                \n            \n                            \n    \n                \n                    \n    \n How to watch  Date: Thursday, Nov. 20 | Time: 7 a.m. ETLocation: FIFA HQ, Zurich TV: FS1 | Live stream: Fubo (try for free) Teams qualified for the World Cup Let's now take a look at the 42 teams that already clinched a spot for the 2026 World Cup. Since the 2026 World Cup is co-hosted by three nations, they all receive an automatic spot in the tournament:  World Cup hosts: United States, Mexico, Canada AFC Qualifiers: Iran, Uzbekistan, South Korea, Jordan, Australia, Japan, Qatar, Saudi Arabia Concacaf Qualifiers: Haiti, Curacao, Panama OFC Qualifier: New Zealand CONMEBOL Qualifiers: Argentina, Brazil, Ecuador, Colombia, Paraguay, Uruguay CAF Qualifiers: Morocco, Egypt, Tunisia, Ghana, Cabo Verde, Algeria, South Africa, Senegal, Ivory Coast UEFA qualifiers: England, France, Croatia, Portugal, Norway, Germany, Netherlands, Switzerland, Scotland, Spain, Austria, Belgium  \n Which teams are in inter-confederation the playoffs? A total of six teams will take part in the inter-confederation playoffs, featuring nations from each of the non-European confederations. Meanwhile, 16 European teams will compete in the European playoffs, which will determine the final four European spots at the 2026 World Cup with that draw also taking place Thursday. The remaining two spots will be awarded through the inter-confederation playoffs, completing the list of 48 teams for the tournament. Let's take a look at the six teams that will be part of the draw on Thursday:AFC: IraqCONMEBOL: BoliviaCAF: Democratic Republic of Congo CONCACAF: Jamaica, SurinameOFC: New Caledonia How does it work? The inter-confederation playoff format splits the six national teams into two groups of three. In each group, the two lower-ranked sides face off in a semifinal, with the winner advancing to face the top-seeded team in the final. The winner of each final secures one of the two remaining spots for the 2026 World Cup. On Thursday, the draw will determine the matchups and every game will be with no return leg. Let's now take a look at the current FIFA rankings ahead of the draw: FIFA RankingNational Team56Democratic Republic of Congo58Iraq70Jamaica76Bolivia123Suriname149New CaledoniaTop seeded teams: Democratic Republic of Congo, IraqUnseeded teams: Jamaica, Bolivia, New Caledonia, Suriname When are the play-offs taking place? The inter-confederation playoffs are scheduled for March 23–31, with dates still to be confirmed. All four matches will be played in Mexico, split between two World Cup venues: the Estadio Akron in Guadalajara and Estadio BBVA in Monterrey, with each stadium hosting two fixtures. Both arenas will also serve as host venues during the 2026 World Cup next summer.\nProjected 2026 World Cup potsThe FIFA 2026 World Cup draw will take place at the John F. Kennedy Center for the Performing Arts in Washington D.C. on December 5 at 12 p.m. ET. Here's are projected World Cup draw pots after November's international break, with FIFA set to officially announce the pots in the coming days. \tPot 1Pot 2Pot 3Pot 4SpainCroatiaNorwayJordanArgentinaMoroccoPanamaCape VerdeFranceColombiaEgyptGhanaEnglandUruguayAlgeriaCuracaoBrazilSwitzerlandScotlandHaitiPortugalJapanParaguayNew ZealandNetherlandsSenegalTunisiaEuropean Playoff 1BelgiumIranIvory CoastEuropean Playoff 2GermanySouth KoreaUzbekistanEuropean Playoff 3United StatesEcuadorQatarEuropean Playoff 4MexicoAustriaSaudi ArabiaInter-confederation Playoff 1CanadaAustraliaSouth AfricaInter-confederation Playoff 2\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 World Cup inter-confederation playoffs draw: How to watch, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/fce80ec9-3704-438a-b31d-7c3166aac7c1/thumbnail/1200x675/70019bcd6fab59ee82d0f6b0b3622eb2/congo.jpg"
      ],
      "datePublished": "2025-11-19T23:51:39.000Z",
      "dateModified": "2025-11-19T23:51:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB finalizes national TV broadcast deals with ESPN, NBC, Netflix for tentpole events - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-national-tv-broadcast-nbc-espn-netflix-home-run-derby-sunday-night-baseball-opening-night-field-of-dreams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/ab7e7592-b47d-4e00-9f3e-ac6d604b94ff/thumbnail/1200x675/afb415e4e535efa72713fa082a944726/raleigh-getty.png",
    "tag": "Sports",
    "date": "2025-11-19T20:34:56.000Z",
    "description": "\n        Major League Baseball announced new national television deals for the 2026-28 seasons with ESPN, NBC, and Netflix on Wednesday. NBC/Peacock w",
    "body": "\n        Major League Baseball announced new national television deals for the 2026-28 seasons with ESPN, NBC, and Netflix on Wednesday. NBC/Peacock will be the new home of Sunday Night Baseball and the first round of the postseason, and return as the host of Sunday morning games. Netflix will air the standalone Opening Night game, the Home Run Derby, and the Field of Dreams Game.\"Our  new media rights agreements with ESPN, NBCUniversal and Netflix provide  us with a great opportunity to expand our reach to fans through  three powerful destinations for live sports, entertainment, and marquee  events,\" commissioner Robert Manfred said in a statement. \"Following  our last World Series game that averaged more than 51 million viewers  globally, these partnerships build on MLB's  growing momentum that includes generational stars setting new standards  for excellence, new rules which have improved the game on the field,  and increases in important fan engagement metrics like viewership,  attendance, participation and social media consumption.  We're looking forward to tapping into the unique areas of expertise  that ESPN, NBCUniversal and Netflix each bring to the sport for the  benefit of our fans.\" The New York Yankees and San Francisco Giants are scheduled to play in next year's Opening Night game on March 25. That is the only game on the schedule that day and it will be a Netflix exclusive. The Minnesota Twins and Philadelphia Phillies will play in the Field of Dreams Game on Aug. 13 in Dyersville, Iowa.Sunday Night Baseball will air only on Peacock, NBC's streaming service, when there are conflicts with the NBA and NFL. Peacock broadcast Sunday morning games from 2022-23 before those games shifted to Roku in 2024.\nESPN, meanwhile, gains rights to the popular MLB.TV service, which allows fans to watch out-of-market games for all 30 teams. ESPN also has in-market rights to six teams (Twins, Arizona Diamondbacks, Cleveland Guardians, Colorado Rockies, San Diego Padres, Seattle Mariners) and the option to add more if they become available. ESPN will also carry 30 exclusive weeknight games.\"This fan-friendly agreement allows us to showcase the great sport of baseball on both a local and national level, while prioritizing our streaming future,\" ESPN chairman Jimmy Pitaro said in a statement.It is not yet clear how ESPN will sell MLB.TV, though the price is expected to remain the same, reports The Athletic. An agreement allowing T-Mobile customers to receive MLB.TV for free is expected to continue as well.\nMLB and ESPN mutually opted out of their previous agreement in February. At the time, Manfred said it \"wouldn't be beneficial to accept a smaller deal to remain on a shrinking platform,\" adding he was unhappy with ESPN's coverage of baseball.ESPN was set to pay MLB $1.65 billion from 2026-28 as part of the previous agreement. National television money is split equally between the 30 teams.Fox will continue to broadcast the All-Star Game, Division Series and Championship Series games, and the World Series.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB finalizes national TV broadcast deals with ESPN, NBC, Netflix for tentpole events - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/ab7e7592-b47d-4e00-9f3e-ac6d604b94ff/thumbnail/1200x675/afb415e4e535efa72713fa082a944726/raleigh-getty.png"
      ],
      "datePublished": "2025-11-19T20:34:56.000Z",
      "dateModified": "2025-11-19T20:34:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kris Boyd shot: Jets CB now stable, says he's starting to breathe on his own - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/kris-boyd-shot-injury-updates-new-york/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/0cffd81e-670f-4357-a15e-2ef5daea542a/thumbnail/1200x675/e9e8c7c3a10f01be700f3715252d4740/boyd.jpg",
    "tag": "Sports",
    "date": "2025-11-20T00:20:02.000Z",
    "description": "\n        New York Jets cornerback Kris Boyd, 29, was upgraded to stable condition Wednesday after he was shot in the abdomen early Sunday morning in N",
    "body": "\n        New York Jets cornerback Kris Boyd, 29, was upgraded to stable condition Wednesday after he was shot in the abdomen early Sunday morning in New York. Boyd was previously listed in critical but stable condition, police said. CBS News reported Monday that a bullet was lodged in Boyd's lung and he underwent surgery.Boyd posted on his Instagram story on Wednesday that he was starting to breathe on his own.\"I'm sorry I have no words at the moment,\" Boyd wrote. \"Just grateful! I'm coming along, starting to breathe on my own now. Sincerely appreciate everyone!\"Jets coach Aaron Glenn addressed the incident for the first time on Wednesday and said Boyd is in good spirits.\n\"That's what eases my mind is that he's in good spirits,\" Glenn said. \"His wife and his kid, they're in good spirits and he'll walk away from this just fine.\"The investigation is ongoing after NYPD received a 911 call on Sunday at 2:09 a.m. ET. On Monday, the police released images of a potential suspect wanted in connection with the shooting. Boyd was with a group on West 38th Street between Seventh Avenue and Broadway when an argument took place with another group. Boyd was then hit by gunfire. Police released surveillance footage and pictures of the person of interest in the shooting, but no arrests have been made.\n\"We are aware of the situation involving Kris Boyd and will have no further comment at this time,\" a Jets spokesperson told CBS Sports NFL insider Jonathan Jones. The NFL did not offer further comment, telling CBS Sports it has been in contact with the franchise.Boyd has not suited up for the Jets this season. He was placed on injured reserve in August after suffering a shoulder injury during a team scrimmage.Several players reacted to the frightening news on Sunday, including Jets defensive end Jermaine Johnson II:\n\"It's tough news to hear,\" Jets tight end Jeremy Ruckert said on Monday. \"You know, one of our guys, and you know we're all thinking of him and wishing him well, and his family. So other than that, we're going to keep everything in-house about what's going on. Just thinking of him and his family.\"Boyd, who played his college football at the University of Texas, was originally a seventh-round pick of the Minnesota Vikings in 2019, also playing for the Arizona Cardinals and Houston Texans. Boyd has spent most of his NFL career on special teams, racking up 105 tackles, three pass defenses and two forced fumbles in 81 career games. The Jets did not play on Sunday after falling to the New England Patriots on Thursday night, 27-14. They will face the Baltimore Ravens on the road in Week 12. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kris Boyd shot: Jets CB now stable, says he's starting to breathe on his own - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/0cffd81e-670f-4357-a15e-2ef5daea542a/thumbnail/1200x675/e9e8c7c3a10f01be700f3715252d4740/boyd.jpg"
      ],
      "datePublished": "2025-11-20T00:20:02.000Z",
      "dateModified": "2025-11-20T00:20:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Sarkisian playing dumb, Julian Sayin's iffy Heisman case lead 'Hater Report' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/steve-sarkisian-plays-dumb-and-is-julian-sayin-seriously-in-the-heisman-mix/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/3519bd1e-ba9d-4c08-ab9e-65b9fd41af50/thumbnail/1200x675/3fc356b3238ea97014e82f657f5a7edb/stevesarkisian.jpg",
    "tag": "Sports",
    "date": "2025-11-20T02:17:19.000Z",
    "description": "\n        Welcome to the College Football Hater Report: A breakdown of some of the players, teams and trends around the sport that deserve ire. If you'",
    "body": "\n        Welcome to the College Football Hater Report: A breakdown of some of the players, teams and trends around the sport that deserve ire. If you're not a fellow pessimist, proceed with caution. This is inspired by Brad Botkin's NBA Hater Report. Steve Sarkisian thinks we're stupidDuring Monday's press conference, Texas coach Steve Sarkisian was asked why his 7-3 team had underachieved this season. Mid-question, he cut in.\"According to who?\" To be fair, it's not Sarkisian's job to care about the preseason AP Poll, where Texas was selected No. 1 for the first time in program history. It's not his job to pay attention to the expectations for his offense, which ranks 13th out of 16 teams in the SEC in yards per game since conference play started. It's not his job to read what people were saying about his program on the heels of a 35-10 loss at Georgia. And he was a day away from learning Texas would drop from No. 10 all the way to No. 17 in the latest College Football Playoff rankings, all but squashing any possible playoff argument out of Austin should the Longhorns win out. But it is Sarkisian's job to know that he took the No. 1 overall quarterback recruit and preseason Heisman contender and delivered a passing offense that rates bottom half in the conference. To see his program's offensive line play fell off a cliff the second that All-American tackle Kelvin Banks left. To realize his teams have 83 total yards rushing against Georgia in three matchups over the last 13 months. To understand that something is wrong with his vaunted defense, which has been exposed through the air in recent weeks. \nSarkisian is getting paid $10.8 million a year to diagnose and fix all these problems. An offseason solution, in this writer's opinion, would include hiring an offensive coordinator. He will be afforded every opportunity to get this program back to the CFP (and by the way, he adamantly said Wednesday he's not leaving). But there are more problems in Austin than at any point since Sarkisian got Texas rolling again, and that just should not be the case. Why play dumb? \nIf the only expectations Sarkisian cares about are his own, then how would he even define an underachievement? Well, an intrepid social media user went back to Nov. 22, 2021 -- almost four years ago to the day – when Sarkisian pretty explicitly laid out the expectations for his program. \"If I was in Year 4 of our program and I had three or four losses already right now and I was banging this drum of where we're going to be three or four years from now and we're still not there, then I would be concerned,\" Sarkisian said at the time. \"...in Year 4, if I'm sitting here with three or four losses, then I would probably be more concerned.\" \nLess than four years later, Texas is 7-3 and coming off a 25-point loss to No. 5 Georgia. Even one month ago, Sarkisian acknowledged the new reality for Texas, which had reached the CFP in 2023 and 2024. \"We've raised the bar from where we were when I got here to where we are now,\" Sarkisian said in October. \"We're a playoff team. That's what we are now. When that becomes the standard, we all have to go hold ourselves to that standard.\" On Monday, though, Sarkisian put the weight of any failed expectations at the feet of \"who voted us No. 1.\"\nSarkisian doesn't have to gaslight his fanbase. It's frustrating to have a disappointing season. But he's basked in enough success in recent years that it would not kill him acknowledge the bar deserves to be higher than 7-3 (with two games to go) after fielding one of the highest investment rosters in the history of college football. Julian Sayin doesn't have a real Heisman case\n                                                                    Getty Images\n                                                            No. 1 Ohio State is the best team in college football, and it's not that close. The Buckeyes are obliterating opponents in all phases and are in great shape to join Georgia as the only back-to-back national champions of the playoff era. In the wake of their success, quarterback Julian Sayin has emerged as the program's candidate for the Heisman Trophy. Wide receiver Jeremiah Smith is the consensus best player in America, but his numbers are lackluster as the Buckeyes spread the ball. So, according to FanDuel, Sayin trails only Indiana's Fernando Mendoza in Heisman odds. \nFrankly, there's a really good case that Sayin is the best quarterback in America. The former five-star recruit is completing 80.1% of his passes for 2,675 yards, 25 touchdowns and only four interceptions. Sayin is on pace to shatter Bo Nix's completion percentage record. When he's called upon, he flashes with the best. The thing is, Sayin is almost never called upon. For a second, let's look at Ohio State's biggest games: No. 1 Texas, No. 17 Illinois and Washington. The Buckeyes approached all three of those games in the same way: They basically punted on the passing game! In those three games, Sayin threw the ball only 25 times per game with an average depth of target of 6.6 yards. Against all other FBS opponents, Sayin has thrown the ball 31.3 times per game for 9.4 yards per attempt. Sayin threw for only 166.7 yards per game in those three wins, compared to 311.5 in the six others. \nThat's not to say there's anything wrong with that. Credit to coach Ryan Day and his staff for putting Sayin in a position to succeed. When the time comes in the College Football Playoff, that game management will pay off, just like it did during a dominant CFP run last season. But certainly, there haven't been many Heisman Trophy winners that a team hid in high-leverage spots. Also, Sayin is -- at best -- the third-best player on his team. Smith and safety Caleb Downs are better by a wide margin. Receiver Carnell Tate and linebacker Arvell Reese have been awesome and could be early 2026 NFL Draft picks. Cases could be made for defensive linemen Caden Curry and Kayden McDonald, and linebacker Sonny Styles too. The Heisman Trophy is about being the most outstanding player in the country, and elevating a program to new heights. While Sayin is a star in the making, he is simply a luxury at Ohio State, not a necessity. There is time to change my mind here. Michigan in the season finale and then, likely, Indiana in the Big Ten Championship give the Buckeyes two marquee opportunities to let Sayin loose in a high-leverage spot -- should they even find themselves in one. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Sarkisian playing dumb, Julian Sayin's iffy Heisman case lead 'Hater Report' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/3519bd1e-ba9d-4c08-ab9e-65b9fd41af50/thumbnail/1200x675/3fc356b3238ea97014e82f657f5a7edb/stevesarkisian.jpg"
      ],
      "datePublished": "2025-11-20T02:17:19.000Z",
      "dateModified": "2025-11-20T02:17:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where Myles Garrett ranks among NFL's all-time pass rushers amid historic 2025 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/myles-garrett-all-time-pass-rusher-rank/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/02/05/7302e80a-2c02-4e43-95b6-e92b8e3a289c/thumbnail/1200x675/1a6a64ee5f6f3d386085bd7c429d938b/getty-myles-garrett-browns.jpg",
    "tag": "Sports",
    "date": "2025-11-19T21:53:39.000Z",
    "description": "\n        The Cleveland Browns may be well on their way to another losing season. They may be poised to add yet another quarterback to their years-long",
    "body": "\n        The Cleveland Browns may be well on their way to another losing season. They may be poised to add yet another quarterback to their years-long carousel under center. But there's at least one positive in the midst of the mess.Myles Garrett.For years, the Pro Bowl pass rusher has racked up sacks to give Cleveland a relatively competitive defense, even while the offense flounders and the top of the staff changes hands. The 2025 NFL campaign has been something special even by Garrett's lofty standards, however. Fresh off a monster performance in which he sacked two-time MVP Lamar Jackson four times to threaten an upset of the Baltimore Ravens, Garrett is up to 15 quarterback takedowns in 10 games as the headliner of a top-five defense. Which means he's also on pace to break the NFL's single-season sack record (22.5), which was set by Michael Strahan in 2001 and tied by T.J. Watt in 2021.\nGarrett, who also leads the league with 22 tackles for loss (tying a career high he set last year), is already the heavy betting favorite for NFL Defensive Player of the Year (-320 at FanDuel Sportsbook). And that might remain the case even if he failed to take another snap. \nWhich raises an even bigger question: Where, exactly, does Garrett rank among all-time pass rushers?Measuring Myles Garrett's all-time standing among pass rushersHis record pace of downing quarterbacks in 2025 already has him at 117.5 sacks for his career, which began in 2014, when the Browns drafted him No. 1 overall out of Texas A&M. That total ranks 24th on the NFL's all-time leaderboard, per Pro Football Reference, though it'd be just outside the top 30 if unofficial sacks are included; the league didn't officially track the statistic prior to 1982. So right off the bat, we can safely call Garrett one of the NFL's top-30 edge defenders of all time. After all, the sacks speak for themselves. It's not every day you come across a veteran with more than 100 under his belt. But even that designation is surely too soft for Garrett, whose physical build is as freakishly imposing as his resume.\nThe first player to log at least 12 sacks in six straight seasons, Garrett has also had no fewer than 14 sacks in a single season since 2020. He's accumulated every major award: Pro Bowls, All-Pros, one Defensive Player of the Year nod and counting. He even got an MVP vote in 2023. He may soon challenge Hall of Famer Reggie White's record of nine straight seasons with at least double-digit sacks, as this year marks eight straight for Garrett.But the biggest thing working in Garrett's favor is his age; he doesn't even turn 30 until the end of this year. He became in 2024 the fourth-fastest player to ever hit 100 career sacks, behind only White, Watt and DeMarcus Ware. He achieved the feat in 115 games, tying the pace of Bruce Smith, the NFL's all-time leader in career sacks.These numbers mean one thing: If Garrett were to retire right now, even before the end of his ninth season, he'd be a virtual lock to enter the Pro Football Hall of Fame. Plenty of players with far less sustained impact have been enshrined as NFL royalty. For the entirety of Garrett's career, save for maybe a rookie season limited to 11 games (in which he still managed seven sacks), no one has questioned him as one of the game's best at his role.\nStill, where does he rank among current or fellow future Hall of Famers? That's a trickier discussion, given longevity is the one thing most players ahead of him on the all-time sack leaderboard have against him. Or do they? Garrett actually ranks first all-time in career sacks per game (0.93) among players with at least five games played, ahead of legends like Reggie White (0.87) and three-time Defensive Player of the Year Lawrence Taylor (0.79). Technically this means Garrett is the most efficient pass rusher in NFL history, averaging almost one sack per game played across nearly a decade of work.A key, of course, is that Hall of Famers trailing Garrett in the sacks-per-game category often played longer than he did. This makes plenty of sense; as you age, extending your NFL career by additional seasons, your sack totals naturally tend to decline. White, for example, played 16 seasons, or seven more than Garrett has already played. Taylor, meanwhile, went 13 seasons before retiring, or four more than Garrett's already played. While they technically ended their careers with worse sack-per-game marks than Garrett has now, they should also be credited for their longevity, remaining NFL staples well into their mid- or even late 30s.Then again, perhaps we should just be crediting Garrett for even warranting placement in the conversation. Consider that every single defender ranked ahead of him on the all-time sacks list played at least several seasons more than he's already logged.\nAll-time sacks leaderboardNote: Italics indicates active player.PlayerCareer SacksSeasons PlayedBruce Smith200.019Reggie White198.016Kevin Greene160.015Julius Peppers159.517Chris Doleman150.515Michael Strahan141.515Jason Taylor139.515Terrell Suggs139.017DeMarcus Ware138.512Richard Dent137.515John Randle137.514Jared Allen136.012Von Miller134.515John Abraham133.515Leslie O'Neal132.514Lawrence Taylor132.513Rickey Jackson128.015Derrick Thomas126.511Dwight Freeney125.516Cameron Jordan125.015Robert Mathis123.014Simeon Rice122.012Clyde Simmons121.515Myles Garrett117.59If Garrett were to maintain his current career average in sacks per season (13.06), it would take roughly two and a half seasons for the perennial Pro Bowler to climb all the way into the top five on the all-time sacks list. Even if his average were to slip to, say, eight sacks per season, he'd need less than another half-decade to reach the upper echelon of the leaderboard, challenging all-timers like Greene, White and maybe even Smith for the top crown.Aside from that, he already ranks 14th in all-time tackles for loss (138), confirming his impact goes beyond just sacks and putting him ahead of legends like Strahan and longtime Chicago Bears linebacker Brian Urlacher.So where do we place Garrett as things stand? There's little doubt he should be considered one of the top-10 most impactful pass rushers of all time, factoring in both the volume of his production and the relatively small sample size with which he's logged it. Consider him, at least for now, like the defensive version of Calvin Johnson, the legendary Detroit Lions wide receiver who posted historic marks, including six straight 1,000-yard seasons and a record 1,964-yard peak, but retired after just nine NFL seasons.We don't expect Garrett to walk away after 2025, by the way, which means he's only on track to enhance his resume and reputation. The only other thing that might catapult his all-time standing even more? Doing exactly what he does for a winning football team.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where Myles Garrett ranks among NFL's all-time pass rushers amid historic 2025 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/02/05/7302e80a-2c02-4e43-95b6-e92b8e3a289c/thumbnail/1200x675/1a6a64ee5f6f3d386085bd7c429d938b/getty-myles-garrett-browns.jpg"
      ],
      "datePublished": "2025-11-19T21:53:39.000Z",
      "dateModified": "2025-11-19T21:53:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandin Cooks landing spots: Five teams that could sign veteran WR after Saints exit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brandin-cooks-released-landing-spots-receiver-saints-steelers-patriots-bills/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/4a141049-64dc-4d35-8aa2-26456d9fdb07/thumbnail/1200x675/14ac0bb59f7c2e114de91002c2c2e479/brandin-cooks-stefon-diggs.jpg",
    "tag": "Sports",
    "date": "2025-11-19T23:55:06.000Z",
    "description": "\n        The New Orleans Saints have released veteran wide receiver Brandin Cooks, the team announced. With New Orleans firmly in rebuilding mode and ",
    "body": "\n        The New Orleans Saints have released veteran wide receiver Brandin Cooks, the team announced. With New Orleans firmly in rebuilding mode and the 32-year-old Cooks potentially looking for a more impactful role on a more competitive team, this move serves as an easy break for both parties.It's also nothing new for Cooks, who has been on five different teams throughout his 12-year career -- though this is the first time he's been released. This season, Cooks had 19 receptions for 165 yards in 10 games (three starts) for the Saints, who will get a better look at younger receivers such as Devaughn Vele, Mason Tipton alongside standout Chris Olave down the stretch. New Orleans is 2-8, starting rookie second-round pick Tyler Shough at quarterback and in the clear early stages of a teardown and rebuild on both sides of the roster. New Orleans traded away Rashid Shaheed and Trevor Penning at the trade deadline.Cooks, who will become a free agent if he goes unclaimed on waivers, could be an intriguing candidate for teams in the playoff mix. Though his production is down this year and has been down for several seasons, he could still mix in as a speedy and reliable (one drop over the past three years) depth option with plenty of postseason experience for a receiver-needy team. These five teams could fit the bill.\n                            \n    \n                                                \n                    \n    Buffalo BillsThe easiest connection to make here is Buffalo. The Bills enter their Week 12 \"Thursday Night Football\" matchup without wide receivers Curtis Samuel and Mecole Hardman and tight end Dalton Kincaid. Buffalo also recently made Keon Coleman inactive for being late to meetings ahead of its Week 11 game against the Tampa Bay Buccaneers. Coleman, Josh Palmer, Khalil Shakir, Tyrell Shavers and Elijah Moore are in line to be Josh Allen's only available receivers in Week 12.\nBuffalo has been willing to take chances on later-career wideouts midseason, including Amari Cooper last year and Hardman this year. Perhaps, given the injuries, inconsistencies and other issues at the position, the Bills would consider bringing Cooks into the mix.\n                            \n    \n                                                \n                    \n    Tampa Bay BuccaneersTampa Bay has similarly been hit hard by receiver injuries. Mike Evans (collarbone) is out until at least the final weeks of the season, Chris Godwin (fibula) hasn't played since Week 5, and Jalen McMillan (neck) hasn't played since a scary fall in the preseason. The Buccaneers have relied on rookies Emeka Egbuka and Tez Johnson and veteran Sterling Shepard for most of the last few months.Cooks could fit the Shepard mode in terms of an undersized veteran, but he could also add some downfield presence as well. Tampa Bay has lost three of four and suddenly finds itself just a half-game up on the Carolina Panthers in the NFC South. It could be worth kicking the tires.\n\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersIt's been a bit of a stop-and-start year for Aaron Rodgers and the Pittsburgh offense, which ranks 28th in yards per game and 22nd in passing yards per game. The team's receptions leader is DK Metcalf at just 37 catches this season. The next four players in that category -- Kenneth Gainwell, Jonnu Smith, Jaylen Warren and Pat Freiermuth -- are running backs or tight ends. Calvin Austin's 22 receptions are the second-most of any wide receiver. For reference, 22 receptions is tied for 122nd in the NFL this season.The Steelers have needed a secondary receiver all year. Austin and Roman Wilson, the younger options, haven't filled that void. Perhaps a veteran like Cooks -- the type of player Mike Tomlin tends to give the benefit of the doubt -- could be of use.\n                            \n    \n                                                \n                    \n    Los Angeles RamsReunion time! Cooks played for Sean McVay's Rams in 2018 and 2019, and more than half a decade later, he could prove a helpful addition for another ring-chasing McVay team. Los Angeles has two tremendous receivers in Puka Nacua and Davante Adams, but the returns have been disappointing further down the depth chart. Tutu Atwell is on IR and Jordan Whittington has 13 catches in 10 games. The Rams lean heavily into formations with three tight ends, but McVay could want more formational flexibility and more reliability from his depth receivers. Cooks could provide that.\n\n                            \n    \n                                                \n                    \n    New England PatriotsCould a different reunion be in the works? Cooks played for the Patriots in 2017, and Mike Vrabel is plenty familiar with Cooks' time with the Houston Texans, when Vrabel was coaching the AFC South-rival Tennessee Titans. New England's offense is soaring thanks to Drake Maye making a huge leap and a vastly upgraded supporting cast led by Stefon Diggs. Mack Hollins provides size and physicality, Kayshon Boutte is a speedy downfield threat, and DeMario Douglas is a crafty slot option.But Boutte has battled a hamstring injury recently, and rookie Kyle Williams hasn't quite made the early impact the Patriots may have hoped for with just three receptions. The Patriots have arrived earlier than expected, and perhaps a veteran option in the room could help down the stretch and into the postseason.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandin Cooks landing spots: Five teams that could sign veteran WR after Saints exit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/4a141049-64dc-4d35-8aa2-26456d9fdb07/thumbnail/1200x675/14ac0bb59f7c2e114de91002c2c2e479/brandin-cooks-stefon-diggs.jpg"
      ],
      "datePublished": "2025-11-19T23:55:06.000Z",
      "dateModified": "2025-11-19T23:55:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lane Kiffin 'just living in the moment' as Ole Miss, Florida, LSU await answer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-ole-miss-florida-lsu-await-answers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/9df46b97-83d1-4c87-bc2d-a77e74d1ab94/thumbnail/1200x675/4bb1416f56625b94ba18f5c3a48adce1/lane-kiffin-ole-miss-vs-florida.jpg",
    "tag": "Sports",
    "date": "2025-11-19T21:04:28.000Z",
    "description": "\n        Lane Kiffin's career has transformed into a reality show, a soap opera packed with so many twists and turns that forecasting the next move fo",
    "body": "\n        Lane Kiffin's career has transformed into a reality show, a soap opera packed with so many twists and turns that forecasting the next move for the hottest coach in college football is a fool's errand.Whether he stays at Ole Miss or bolts for Florida or LSU is anyone's guess. No. 6 Ole Miss (10-1) is on the cusp of its first-ever College Football Playoff, and yet the coach who has led the Rebels to unprecedented success -- three consecutive 10-win seasons -- seems unfazed by the frenzy he helped spark in Oxford. As speculation of his interest -- or lack thereof -- in Florida and LSU's job openings spread, the coach again refused to tip his hand Wednesday.\"I'm saying the same thing for six years,\" Kiffin said on an SEC teleconference. \"I'm not talking about speaking on other jobs. I'm focused on this one.\"\n        \n            \n                Ole Miss wants clarity from Lane Kiffin. He's not in a position to give it. What's next?\n                \n                    John Talty                \n            \n                            \n    \n                \n                    \n    \nIt's true that Kiffin has not left Oxford, working in his office at the Manning Center and leading practices during an open week. His family, however, has not stayed put. His ex-wife, Layla, and other family members flew to Gainesville, Florida on Sunday to visit the city, sources told CBS Sports, and on Monday they caught another flight to Baton Rouge, Louisiana.\nOn Wednesday, Kiffin didn't advance the plot, but he he absolutely stirred the pot. When asked if he felt flattered that three SEC schools are pursuing him as head coach, he responded: \"It doesn't feel good on this call.\"Somehow it's got spun really negatively. I said it before: if programs want your coach, that should be looked at as an amazing thing and a great thing by your fans. So if programs want your coach because you're 10-1 and whatever -- three 10-win seasons in a row, which has never been done in Ole Miss before -- is that a good thing that other programs want your coach because your program's experienced success it's never had? Or would you rather be 5-6 or 6-5 or something right now and no one wants your coach? I would look at it from that perspective.\"The administration understands exactly what's at stake. Gratitude for historic success doesn't erase urgency, and Ole Miss officials hope to secure a commitment from Kiffin by week's end, sources told CBS Sports. The Rebels begin preparations Sunday for the regular-season finale against Mississippi State in the Egg Bowl.\nAthletics director Keith Carter and Kiffin's representatives have been negotiating for more than three weeks, with sources describing late-October conversations -- soon after Florida fired Billy Napier -- as \"positive.\" But that was nearly a month ago, a lifetime in the wild world of college athletics.\"Keith and I have a great relationship. We communicate daily on a lot of things and I love it here,\" Kiffin said. \"it's been amazing. We're in the season that's the greatest run in the history of Ole Miss at this point, having never been at this point. So I think it's really exciting. I think Saturday night (against Florida) was amazing.\"I'm just living in the moment -- it's amazing -- and our players are too. I see their joy about the practice season, where they're at and have so much on the line. It's just awesome to be a part of.\"\nEven so, Kiffin sounded flummoxed when asked by a reporter whether he would coach the Rebels in the Egg Bowl, and fired back with rhetorical questions on Wednesday.\"Do I expect to coach next week?\" he said. \"Why would I not expect to coach next week? I mean, I expected to coach against Florida (last week), too. So I don't even understand the question of how I would not expect to coach next week. Why would I be at work?\"But a clock is still ticking. If he intends to accept a rival SEC job, it's hard to imagine him staying on to shepherd Ole Miss through a playoff run. In that scenario, the Rebels would need a postseason contingency plan for an interim coach. Defensive coordinator Pete Golding and quarterbacks coach Joe Judge would be considered, sources said.\nCBS Sports asked Kiffin outright whether he might take another job before the postseason begins.\"I'm not speaking on other jobs,\" he responded.And so the carousel spins, with three SEC fan bases twisting in the wind.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lane Kiffin 'just living in the moment' as Ole Miss, Florida, LSU await answer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/9df46b97-83d1-4c87-bc2d-a77e74d1ab94/thumbnail/1200x675/4bb1416f56625b94ba18f5c3a48adce1/lane-kiffin-ole-miss-vs-florida.jpg"
      ],
      "datePublished": "2025-11-19T21:04:28.000Z",
      "dateModified": "2025-11-19T21:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The NHL's next wave of superstars has arrived with authority - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/connor-bedard-macklin-celebrini-leo-carlsson-nhl-next-superstars/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/ee15e16f-d7bf-469f-897f-924033d35de3/thumbnail/1200x675/25e45c818321c5f69f8e0e57b0ae2ece/untitled-design-2025-11-19t130516-718.png",
    "tag": "Sports",
    "date": "2025-11-19T21:43:28.000Z",
    "description": "\n        Connor McDavid, Nathan MacKinnon and Auston Matthews are all still in the prime of their respective careers, but the next wave of NHL superst",
    "body": "\n        Connor McDavid, Nathan MacKinnon and Auston Matthews are all still in the prime of their respective careers, but the next wave of NHL superstars aren't content to wait their turn. Connor Bedard, Macklin Celebrini and Leo Carlsson have announced their arrival with authority this season.In the 2023 NHL Draft, Bedard and Carlsson were the top two picks, respectively. One year later, Celebrini was the prize of the draft lottery, going No. 1 overall. None of them can legally drink in the United States, but they're already holding their own against the best players in the world.Celebrini, after his second hat trick of the season, is up to 30 points. That puts him in a tie with the Oilers' McDavid for second in the league. Bedard, following his second hat trick already this season, ranks fourth. That leaves Carlsson, who is really slacking, in eighth place with 26 points. That's impressive for a trio of players aged 20 or younger, but their impact goes much deeper than simply filling up the scoresheet.Each player is the crown jewel of his respective franchise's rebuild, something that brings the hefty weight of expectations and pressure. To this point, they've borne that burden extremely well and flourished in the process.\nThe Chicago Blackhawks, Anaheim Ducks and San Jose Sharks have been moribund franchises for years now, but these young superstars have instilled hope as all three teams aim to throw a wrench into the 2026 Stanley Cup Playoffs picture.Young stars delivering on the hypeIn the case of Bedard, he was billed as the best prospect since McDavid entered the league in 2015. He certainly looked the part as a rookie in 2023-24, posting 61 points in 68 games and winning the Calder Trophy. Last season, however, Bedard regressed on a horrific Blackhawks team. He totaled 67 points in 82 games, and his defensive metrics were cause for concern.Now in his third season, Bedard, 20, has taken a clear leap and looks like a far more confident player than at any point in 2024-25. It's just another reminder that development, even for the best prospects, is rarely linear.\nThis season, Bedard is making opponents look foolish on a consistent basis. His 4.33 points per 60 minutes are seventh in the NHL, per Natural Stat Trick, and he's tied for fifth in the league with 16 five-on-five points. He isn't simply feasting on big power play minutes.Bedard's combination of intelligence, vision and his elite shot make him a threat to make a play from anywhere on the ice. When it comes to his playmaking, Bedard is somewhat reminiscent of Patrick Kane in the way he can almost freeze opposing defenders while he scans the rink to find the best play.Then, of course, there is the skill when he senses blood in the water. Poor Morgan Frost had no chance once Bedard realized he had him dead to rights.\nCelebrini, 19, finished second in Calder Trophy voting last season, but that was only because Lane Hutson was on another planet down the stretch. As an 18-year-old last season, Celebrini was asked to carry the Sharks. He did so admirably and put up 63 points in 70 games.If anyone was worried about a sophomore clump for Celebrini, they can put those fears to bed. He is producing at a rate of 4.39 points per 60 minutes and has equaled Bedard with 16 five-on-five points, per Natural Stat Trick. Again, Celebrini is doing most of the heavy lifting for a Sharks team that lacks any kind of meaningful depth up front.Similar to Bedard, Celebrini has a high hockey IQ and plenty of skill to accompany that, but his compete level jumps off the screen every night as well. Take this game-winning play against the New York Rangers earlier in the season. After a quality scoring chance of his own, Celebrini pursues the puck, wins a battle along the boards and keeps his head up to place a one-timer on a tee for teammate Will Smith.\nOf the three players, Carlsson might be the most well-rounded right now. In addition to a staggering 4.21 points per 60 minutes (good for seventh in the NHL), Carlsson is driving play far better than his two peers. With Carlsson on the ice at five-on-five, the Ducks are controlling 56.1% of the expected goals, per Natural Stat Trick. That's a great number for any player, let alone for a young man who still can't buy himself a drink in any U.S. establishment. (He turns 21 the day after Christmas.) In all fairness to Bedard and Celebrini, some of that discrepancy can be explained by the team around Carlsson, which is filled with a nice mix of veterans and up-and-coming players.Bedard and Celebrini do have Carlsson beat in terms of raw five-on-five production as the young Ducks star has just eight points in that situation. However, Carlsson should close that gap if Anaheim keeps dominating scoring chances and expected goals when he's in the game.\nAt 6-foot-3 and 208 pounds, Carlsson has a clear size advantage over the other two young guns, and he is learning how to use his frame more frequently. In perhaps his nastiest goal of the season, Carlsson showed that he is the full package.Against the Golden Knights, Carlsson gave defenseman Noah Hanifin all he could handle on the forecheck, forced a turnover with a physical play on Brett Howden, got to open ice and finished with one of the smoothest backhands you'll ever see.\nCan they crash the playoff party?It's still very early in the season, but all three players have their team firmly in the playoff mix. Carlsson's Ducks are leading the Pacific Division with 25 points, Bedard's Blackhawks occupy the West's first wild card spot with 24 points, and Celebrini's Sharks are right in the wild card race at 21 points.\nSo, what are the chances that those teams can stay in the race for 82 games? It's tough to say, but it does seem like the Ducks have the best shot of the three. Here are each team's playoff chances, according to MoneyPuck:Ducks: 80.8%Blackhawks: 49.9%Sharks: 13.5%Anaheim is the more complete team, as I mentioned earlier. It has been building toward this longer than the other two, and Carlsson seems like he is the biggest piece to that puzzle.Chicago, while it's certainly improved around Bedard, still has a lot of questions. Spencer Knight is excellent in goal, but the Blackhawks have holes all throughout their defense, and the forward depth is very suspect. On top of that, most of Chicago's underlying numbers indicate that this start is unsustainable.\nThe Blackhawks have a PDO -- which simply adds team shooting and save percentages -- of 1.050. The next closest team is the Pittsburgh Penguins at 1.034. Think of PDO as a temperature gauge in a car. Right now Chicago is running dangerously hot, and it's due for a cool down.You can copy and paste most of that for the Sharks, which have one of the worst defensive groups in the league, although Celebrini probably has more help than Bedard at forward. It's just going to be hard for San Jose to keep opposing teams out of its net enough to stay in the wild card race all season.All that said, we've seen young superstars drag teams kicking and screaming into the playoffs before. Just look at what the Montreal Canadiens did last season. Besides, the most important thing for all three teams is that they're finally making an ascent with their young cornerstones leading the way.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The NHL's next wave of superstars has arrived with authority - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/ee15e16f-d7bf-469f-897f-924033d35de3/thumbnail/1200x675/25e45c818321c5f69f8e0e57b0ae2ece/untitled-design-2025-11-19t130516-718.png"
      ],
      "datePublished": "2025-11-19T21:43:28.000Z",
      "dateModified": "2025-11-19T21:43:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]