[
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-wednesday-february-25-basketball-parlay-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/b6602153-ba06-427d-915c-b82280c453b7/thumbnail/1200x675/55c49bddd383fb9dd9fbcfecf463c515/warriors.jpg",
    "tag": "Sports",
    "date": "2026-02-25T22:55:35.000Z",
    "description": "\n        Wednesday will feature a six-game NBA slate. Among the notable NBA odds are Spurs (-7.5) vs. Raptors, Thunder vs. Pistons (-10.5), Warriors (",
    "body": "\n        Wednesday will feature a six-game NBA slate. Among the notable NBA odds are Spurs (-7.5) vs. Raptors, Thunder vs. Pistons (-10.5), Warriors (-3.5) vs. Grizzlies and Celtics vs. Nuggets (-3.5). The largest NBA spread has Houston as a 13.5-point favorite over Sacramento, though both teams are just 2-3 against the spread over their last five games.What are the NBA best bets for Wednesday, and which combination of picks should you target in a Wednesday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.Bet the NBA with the latest DraftKings promo code, which offers $200 in bonus bets if your first $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model entered Week 19 on a sizzling 38-18 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.  \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +600. You can only see the model's NBA picks at SportsLine.Bet NBA games with the latest FanDuel promo code and get $100 in bonus bets instantly if your first $5+ bet wins:Top NBA picks for Wednesday, Feb. 25After simulating every game 10,000 times, the model is backing the Golden State Warriors (-3.5) to cover the spread against the Memphis Grizzlies at 7:30 p.m. ET. The Warriors have won two previous meetings with the Grizzlies this season and four consecutive games over Memphis overall. The Warriors will be without Kristaps Porzingis (Achilles) and Stephen Curry (knee), while Memphis is without Cedric Coward (knee), Santi Aldama (knee) and Ja Morant (elbow).\nWith Curry out, Brandin Podziemski  has stepped up his play. He's coming off back-to-back double-doubles, and over his last six games, the third-year guard is averaging 15.2 points, 8.7 rebounds, 4.8 assists and 1.3 steals. He scored 23 points versus the Grizzlies earlier this season, which is his second-most points of the season.The model is projecting eight Warriors to score in double-figures, compared to just five for the Grizzlies. Golden State is projected to win by 9 points, with the model is backing Golden State to cover well over 60% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Wednesday, Feb. 25The model also has locked in two more picks, including backing a team to cover well over 60% of model simulations. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Wednesday, and which best bets should you target for a chance at a payout of over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/b6602153-ba06-427d-915c-b82280c453b7/thumbnail/1200x675/55c49bddd383fb9dd9fbcfecf463c515/warriors.jpg"
      ],
      "datePublished": "2026-02-25T22:55:35.000Z",
      "dateModified": "2026-02-25T22:55:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jontay Porter signs with USBL amid lifetime ban from NBA for sports betting - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jontay-porter-usbl-nba-lifetime-ban-gambling/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/122b4a20-5e2a-40c7-81b3-46894c036ac8/thumbnail/1200x675/8122ab22f7f190cc014abef31be7a7bb/gettyimages-2000559410-1.jpg",
    "tag": "Sports",
    "date": "2026-02-25T21:40:00.000Z",
    "description": "\n        Nearly two years after the NBA banned him for life for a violation of league gambling rules, former Toronto Raptors and Memphis Grizzlies for",
    "body": "\n        Nearly two years after the NBA banned him for life for a violation of league gambling rules, former Toronto Raptors and Memphis Grizzlies forward Jontay Porter has a role with a different professional basketball league. The Seattle SuperHawks of the United States Basketball League announced that they signed Porter to their 2026 roster, giving him his first playing opportunity since the exit from the NBA.Porter's arrival in the USBL raises eyebrows, particularly because of the league's stated commitment to fair competition.\"The games we play must be decided on the court,\" the USBL says as part of its league values. \"Every rule we establish, every policy we implement, and every decision we make is guided by a commitment to fair competition. Players, coaches, and fans must be able to trust that the outcomes they witness are earned through skill, preparation, and effort -- nothing else.\"The SuperHawks are one of eight teams in the rebirth of the USBL, which opens its season on March 6. The league originally operated from 1985-2008 and produced a number of eventual NBA players including Manute Bol and Spud Webb.Porter is tied to the FBI investigation into illegal sports betting, which shook the NBA last fall, and he previously pleaded guilty in 2024 to conspiracy to commit wire fraud. Two defendants in the federal case allegedly threatened Porter, forcing him to remain involved in a scheme wherein parties gathered inside information on NBA games and relayed it to bettors.\nIrregular betting activity on Porter's player props in 2024 flagged potential wrongdoing. The NBA found that Porter disclosed information about his health status to a bettor ahead of a March 20 game, and another bettor wagered $80,000 on a parlay that would win $1.1 million if the under hit on Porter's player props. Porter exited from that game due to illness less than three minutes into the contest. The bet was frozen and never paid out.After a separate game earlier that season, DraftKings sent a report to users that stated the under on Porter's made 3-pointers was the biggest winner among all NBA props from Jan. 26, 2024.The NBA also found that Porter placed at least 13 bets on NBA games from January to March 2024 using an associate's account. He wagered a combined $54,094 and netted $21,965. None of those purported bets involved games in which Porter played, but he bet on the Raptors to lose as part of a multi-game parlay.\nPorter's case is one of the few rare instances in which the NBA disciplined a player for violating its gambling policy. The league prohibits anyone affiliated with the NBA from betting on NBA properties and requires players to attend anti-gambling training sessions on an annual basis. It also employs data scientists to monitor sports betting issues.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jontay Porter signs with USBL amid lifetime ban from NBA for sports betting - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/122b4a20-5e2a-40c7-81b3-46894c036ac8/thumbnail/1200x675/8122ab22f7f190cc014abef31be7a7bb/gettyimages-2000559410-1.jpg"
      ],
      "datePublished": "2026-02-25T21:40:00.000Z",
      "dateModified": "2026-02-25T21:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Lone'er Kavanagh? Get to know the flyweight set to headline UFC Mexico City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-mexico-city-loneer-kavanagh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/91837bcc-16f5-4328-a95c-cddc93aafae2/thumbnail/1200x675/34557b2f7d73ca986a15640bb6c5d779/loneer-kavanagh-punch.jpg",
    "tag": "Sports",
    "date": "2026-02-25T21:22:48.000Z",
    "description": "\n        If fortune truly does favor the bold, watch out for flyweight prospect Lone'er Kavanagh in the main event of Saturday's UFC Fight Night card ",
    "body": "\n        If fortune truly does favor the bold, watch out for flyweight prospect Lone'er Kavanagh in the main event of Saturday's UFC Fight Night card in Mexico City. Kavanagh (9-1), the 26-year-old from London who fights out of the Great Britain Top Team gym, agreed to replace the injured Asu Almabayev on just three weeks' notice and face former two-time flyweight champion Brandon Moreno inside Arena CDMX. In his opponent's backyard. In the first five-round bout of his career. Fresh off of a knockout defeat to Charles Johnson last August in the first loss of his career. Not to mention, at an elevation of over 7,000 feet. \"It's an amazing opportunity and it's one of these things that I pray for. So, for it to come up, I have to take it,\" Kavanagh told CBS Sports HQ on Tuesday. \"There was no hesitation, whatsoever [to accept the fight]. Obviously, I had to talk it over with my team to make sure that we were all on the same page. Once we were, it was go time.\"\nJust like Kavanagh, the 32-year-old Moreno will also be looking to bounce back from defeat just two months removed from a second-round TKO loss to Tatsuro Taira -- the first stoppage loss of Moreno's 34-fight pro career -- that elevated Taira to the title level where he will face Joshua Van at UFC 327 in April. But the Kavanagh defeat has some odd synergy with that of Van's first UFC loss. Sign up for Paramount+ and WATCH UFC for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription. Plans start as low as $8.99/month or $89.99/year!Van, the 24-year-old sensation from Myanmar who upset Alexandre Pantoja for the flyweight title in December, also lost by knockout against Charles Johnson in 2024 to snap a red-hot start to his UFC career that began with three straight wins in the span of seven months. Like Kavanagh, Van simply got caught against a dangerous fighter and returned to action quickly just two months later to begin a run of six straight wins over the next 15 months. \nKavanagh had plenty of success in the first round against Johnson last summer but was caught backing up with his hands down along the cage in Round 2 and suffered a flash knockout on a sweeping right hook. \"Obviously, for me, it's about getting better in every fight,\" Kavanagh said. \"Unfortunately, I didn't get the result I wanted in the last fight but there is now stuff to work on. And that's what I have done from my last fight until right now, it's always self improving.\"Before making a splash on \"The Dana White Contender Series\" in 2024, when he knocked out An Tuan Ho in just over two minutes to earn a UFC contract, Kavanagh's name first began to generate buzz in the U.K.-based Cage Warriors promotion, where he won four straight fights beginning in 2022. It's the same respected European regional promotion that helped catapult both Conor McGregor and Paddy Pimblett into star runs inside the Octagon. \nKavanagh considers the path of both fighters as an inspiration for his own journey.\"Of course, coming through the Cage Warriors platform, they set a path to get to the UFC,\" Kavanagh said. \"They set a blueprint. Even my teammate, [UFC featherweight] Nathaniel Wood, came up the same way. So, it's just about following the blueprint.\"Despite a recent TKO loss (and one that Moreno still believes came via an early stoppage), the former two-time flyweight king and first Mexican-born champion in UFC history remains the betting favorite. Moreno, a native of Tijuana who now fights out of Las Vegas, has advantages in everything from experience to fighting in front of a passionate home crowd.\nStill, Kavanagh believes timing is everything. He remains confident about his skills and isn't against going toe-to-toe with Moreno for as long as the five-round bout lasts in order to prove he's the next-big thing at 125 pounds. \"I think it's my mindset, my speed, my timing and my power [that give me an advantage over Moreno,]\" Kavanagh said. \"It's not just about fight IQ. I have an amazing team behind me and we have worked hard for this. It's all going to show on Saturday night.\"I want to look back on my life and see that I've done some cool stuff. The big thing for me is legacy and this is a legendary moment, so I'm looking forward to it It just brings me one step closer to the title and that's what I want. I'm here to get to the top as quick as I can and I'm looking to do whatever it takes to get there.\"\nAsked whether he believes he's getting Moreno at the right time so close to a recent defeat, Kavanagh's answer was telling.\"In terms of catching him at the right time, I don't think there is a right time or a wrong time,\" Kavanagh said. It's just my time.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Lone'er Kavanagh? Get to know the flyweight set to headline UFC Mexico City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/91837bcc-16f5-4328-a95c-cddc93aafae2/thumbnail/1200x675/34557b2f7d73ca986a15640bb6c5d779/loneer-kavanagh-punch.jpg"
      ],
      "datePublished": "2026-02-25T21:22:48.000Z",
      "dateModified": "2026-02-25T21:22:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Team USA women's captain Hilary Knight responds to President Trump's 'distasteful' joke - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/usa-hockey-hilary-knight-president-donald-trump-joke-2026-olympics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/e21e591b-6a89-47ca-b3d6-263b6c6efbbc/thumbnail/1200x675/a138efedfec9904b838edfc1106fa971/gettyimages-2262611985-2.jpg",
    "tag": "Sports",
    "date": "2026-02-25T23:10:57.000Z",
    "description": "\n        In the aftermath of their gold medal sweep at the 2026 Winter Olympics, the U.S. men's and women's hockey teams have been at the center of so",
    "body": "\n        In the aftermath of their gold medal sweep at the 2026 Winter Olympics, the U.S. men's and women's hockey teams have been at the center of some controversy. While the men's team was celebrating its first gold medal win in 46 years, President Donald Trump called to offer his congratulations and joked about inviting the women's team to the State of the Union.\"I must tell you, we're gonna have to bring the women's team,\" Trump said in a video of the call posted to social media. \"I do believe I probably would be impeached.\"The joke elicited audible laughs from several people in the men's locker room. And while the men's team was honored at the State of the Union on Tuesday night, the women's team declined the invitation. In an interview with ESPN, Hilary Knight, the captain of the women's team, described Trump's joke as \"distasteful\" and said it took away from \"amazing gold medal feats\" by women across the board at the Olympics. As for the relationship between the men's and women's hockey teams, Knight said that a \"quick lapse\" has \"overshadowed\" the tight-knit bond that was formed in Italy.\"I think the guys were in a tough spot,\" Knight said. \"It's a shame that this storyline and narrative has blown up and is overshadowing our connection, genuine interest in one another and cheering each other on. We've had phenomenal relationships in the [Olympic] village and supporting each other on the world stage -- and also the professional stages. I look forward to those friendships and acquaintances continuing in great fashion.\"\n\n        \n            \n                U.S. women's hockey team declines invitation to attend the State of the Union\n                \n                    Bryan DeArdo                \n            \n                            \n    \n                \n                    \n    \nKnight, who set the U.S. women's record for Olympic points and goals with her game-tying tally against Canada in the gold medal game, said the story has presented everyone with a chance to re-examine how they talk about women's accomplishments across all disciplines.\"I think this is a really great learning point to really focus on how we talk about women, not only in sport but in industry,\" Knight said. \"Women aren't less than. Our achievements shouldn't be overshadowed by anything else other than how great they are.\"On Wednesday, Jeremy Swayman, a goalie on the men's team, returned to practice with the Boston Bruins and expressed some regret for the way Team USA initially responded to President Trump's joke.\n\"We should've reacted differently,\" Swayman told reporters. \"We know that. We are so excited for the women's team and have so much respect for the women's team. To share that gold medal with them is something that we'll be forever grateful for. Now that we're home, we get to share that together forever, seeing the incredible support we have from the USA and sharing this incredible gold medal.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Team USA women's captain Hilary Knight responds to President Trump's 'distasteful' joke - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/e21e591b-6a89-47ca-b3d6-263b6c6efbbc/thumbnail/1200x675/a138efedfec9904b838edfc1106fa971/gettyimages-2262611985-2.jpg"
      ],
      "datePublished": "2026-02-25T23:10:57.000Z",
      "dateModified": "2026-02-25T23:10:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "McKennie scores late Juve equalizer before extra time Champions League loss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/weston-mckennie-juventus-champions-league-galatasaray/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/cd40577f-2cdb-42c7-a772-4e8c6e773c37/thumbnail/1200x675/4603a2111ce35667bd68046ccbe9df1d/untitled-design-2026-02-25t231924-340.png",
    "tag": "Sports",
    "date": "2026-02-25T23:30:09.000Z",
    "description": "\n        Weston McKennie's impressive goalscoring run continued on Wednesday, this time scoring the crucial goal that ensured Juventus would take Gala",
    "body": "\n        Weston McKennie's impressive goalscoring run continued on Wednesday, this time scoring the crucial goal that ensured Juventus would take Galatasaray to extra time in the UEFA Champions League's knockout phase playoffs before falling 7-5 on aggregate.Juventus entered Wednesday's second leg after a 5-2 defeat in Istanbul last week. They pulled one back in the first half thanks to Manuel Locatelli. Though Lloyd Kelly's red card in the 49th minute complicated matters, Federico Gatti's 70th-minute goal put the Turin-based side within touching distance of extra time. McKennie's goal in the 82nd minute, though, ensured the hosts would get another 30 minutes to prove themselves in the hopes of reaching the round of 16.The hosts earned a free kick on the left flank, the ball looping to the far end of the box, where Teun Koopmeiners was waiting. Koopmeiners, who scored a brace at Galatasaray last week, sent the ball near the opposite post, the ball sailing towards the goal line. McKennie had his eyes on the ball as soon as it neared Koopmeiners' head and made a run to meet it at the post, and then got his head on the ball to ensure it landed in the back of the net.Watch the strike below.\nGalasaray turned things around in extra time and scored twice, first through Victor Osimhen's goal shortly before the halftime break and then another from Barıs Alper Yilmaz in the 119th minute. The victors are now in the Champions League round of 16 for the first time in 12 years and are the first Turkish team since the 2017-18 season to get this far.\nThe goal was McKennie's eighth of the season across all competitions for Juventus, the U.S. men's national team midfielder already in the midst of a career-best goalscoring run. He played as a left wingback on Wednesday, which comes as little surprise for the team's longtime utility player, but he has been in attack-minded roles since Luciano Spalletti became the coach last fall. Spalletti has showcased McKennie's versatility even as attack remains the focus, once describing him as the \"perfect central striker\" and even inserting him there at Galatasaray last week.McKennie finds his footingWin or lose, it's hard not to argue that the knockout phase playoffs were full of good news for the USMNT – McKennie's goal comes a day after Johnny Cardoso scored for Atletico Madrid and a week after Folarin Balogun notched a brace for Monaco. Coupled with the fact that U.S. players across Europe are currently in fine form and others, like Bournemouth's Tyler Adams and PSV's Ricardo Pepi, are returning to the pitch after weeks-long injuries, it feels like the USMNT players are beginning to peak at just the right time as the World Cup nears.McKennie, though, is perhaps the poster child for the USMNT players' upward trajectory. The 27-year-old has made the rare transition from a mere regular in Juventus' lineup to a central part of the team's attack, Spalletti fully utilizing the American's attacking skillset after a handful of predecessors chose otherwise. It has paid off in more ways than one – Juventus have added another dimension to their goalscoring operation, McKennie is useful from set-piece opportunities, and often makes impactful runs to score goals from close range. McKennie's contributions are much-needed for a Juventus team that could use an out-and-out goalscorer, the American doing his best to make up the gaps.From the player's perspective, the goalscoring run is a signal that things have changed for the better in Turin. He has frequently been deemed surplus to requirements, only to stick around to make up the numbers and work his way back into the coach's good graces. There was no adjustment period with Spalletti, though – not only has he been a regular fixture in the new coach's team, Spalletti has gotten the best out of McKennie, no matter the task the player's been assigned. Take Wednesday's match as an example – McKennie regularly finds himself on the wing in Spalletti's set-up, but he rarely plays as a left wingback for the new coach, though he remained an attacking force for a Juventus team in desperate need of goals. He created four chances from that position, his best game of the season in that sense, and later scored at the end of a set-piece sequence.\nMcKennie is expected to be back for the USMNT's friendlies against Portugal and Belgium in March, likely to join the national team for the first time since October after head coach Mauriico Pochettino preferred the player settle in with Spalletti during the November international break. McKennie's form is as great a form of vindication as Pochettino could receive for that choice, leaving the head coach with only good problems as a wide variety of players compete for World Cup roster spots – and starting roles. McKennie's abilities in goal creation and end product leave Pochettino with just as many options as Spalletti to utilize the player's versatility, both skills well-suited for the U.S. coach's high-intensity, attack-minded style of play.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "McKennie scores late Juve equalizer before extra time Champions League loss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/cd40577f-2cdb-42c7-a772-4e8c6e773c37/thumbnail/1200x675/4603a2111ce35667bd68046ccbe9df1d/untitled-design-2026-02-25t231924-340.png"
      ],
      "datePublished": "2026-02-25T23:30:09.000Z",
      "dateModified": "2026-02-25T23:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Titans' cap space balloons to nearly $100 million after releasing two starters - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/titans-release-lloyd-cushenberry-xavier-woods-free-agency/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/31e0f88e-d3e8-420e-a656-d70470ed736c/thumbnail/1200x675/c178fe14ca7577ba9c8a4c168e9302d0/cushenberry.png",
    "tag": "Sports",
    "date": "2026-02-25T23:35:26.000Z",
    "description": "\n        The Tennessee Titans entered Wednesday with almost $100 million in cap space, the most in the NFL. That number increased after the team decid",
    "body": "\n        The Tennessee Titans entered Wednesday with almost $100 million in cap space, the most in the NFL. That number increased after the team decided to release veterans Lloyd Cushenberry and Xavier Woods with the official start of free agency just two weeks away. Tennessee will save about $3.4 million in salary cap space by parting with Cushenberry, who was released with a failed physical designation. They'll save roughly $4 million in cap space by releasing Woods, a veteran safety who played in 11 games last year before a hamstring injury ended his season.\nA former third-round pick of the Denver Broncos, Cushenberry was released less than two years after the Titans signed him to a four-year, $50 million contract. An Achilles injury, however, sidelined him for the final games of the 2024 season. He played in 15 games this past season after starting the year on the team's physically unable to perform list. \nDespite going 3-14 last season, the Titans have put themselves in a position to make a significant leap in 2026. In addition to having the most salary cap space in the NFL, the Titans are also armed with eight picks in the upcoming NFL Draft that includes the No. 4 overall pick. Speaking from the combine, Titans general manager Mike Borgonzi said that the team is going to \"attack both acquisition periods\" while alluding to the upcoming free agency period as well as April's draft. It appears, based on Borgonzi's comments, that the Titans are putting an added emphasis on the draft. \n\"You're trying to build a team and a locker room and a culture, and you do that through the draft,\" he said during an interview with Pat McAfee. \"We're certainly going to have our hand in free agency as well, and there's going to be some great opportunities to add some players in free agency. But really, through, the draft is where you have to build that foundation initially. ... You've got to build it through the draft.\" While the Titans' decision to release Cushenberry and Woods creates new voids in terms of building the roster for 2026, Tennessee clearly has the recourses to fill those voids this offseason. As it currently stands, the Titans' depth chart at center is led by soon-to-be free agency Corey Levin and 2025 undrafted rookie Drew Moss. Kendell Brooks, a fellow former undrafted rookie who has spent the last two seasons in Nashville, is currently slated to replace Woods in the starting lineup . \nWhile the Titans will undoubtedly address both of positions this offseason, the team will likely continue to prioritize improving other areas of greater need on their roster, specifically pass rusher and the skill positions. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Titans' cap space balloons to nearly $100 million after releasing two starters - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/31e0f88e-d3e8-420e-a656-d70470ed736c/thumbnail/1200x675/c178fe14ca7577ba9c8a4c168e9302d0/cushenberry.png"
      ],
      "datePublished": "2026-02-25T23:35:26.000Z",
      "dateModified": "2026-02-25T23:35:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Harden injury: Cavaliers guard reportedly plans to play through fractured thumb - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/james-harden-injury-thumb-fracture-cavaliers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/7ff2682c-6f67-4856-a6eb-96e2c4a086d4/thumbnail/1200x675/100c3c55004132cf10c86b287b8974fb/james-harden-cavaliers.jpg",
    "tag": "Sports",
    "date": "2026-02-26T00:33:31.000Z",
    "description": "\n        MILWAUKEE -- The Cleveland Cavaliers announced that star guard James Harden suffered a fractured right thumb during their 109-94 win over the",
    "body": "\n        MILWAUKEE -- The Cleveland Cavaliers announced that star guard James Harden suffered a fractured right thumb during their 109-94 win over the New York Knicks Tuesday night. Harden played 32 minutes and finished with 20 points, four assists and two rebounds, but a subsequent evaluation of his thumb confirmed the presence of a fracture.Despite the diagnosis, surgery is not required and Harden is not expected to miss much time, per ESPN. The expectation is that Harden will wear a wrap or splint on his hand as he attempts to play through the injury. He was initially listed as questionable for Wednesday night's game against the Milwaukee Bucks before being ruled out. \"A postgame examination by the Cavaliers' medical staff, followed by X-rays taken [Wednesday], confirmed a non-displaced fracture of the distal phalanx,\" the team said. \"Harden will undergo treatment and continued evaluation. An update on his status will be provided as appropriate.\"Cavaliers coach Kenny Atkinson said Wednesday that Harden was not complaining about his thumb during Tuesday's game, and he was unsure when the injury occurred. He declined to go into specifics about a timeline or plan for Harden and said the team will have more information after he's evaluated.\"I don't have my lab coat on, I'm not gonna go there,\" Atkinson said. \"I do think it's early. I think these things take time. Obviously, James is famous for his availability. There's a lot that goes into this. For me to sit here and start making judgments -- we'll have more information once the medical staff looks at him a little more.\"\n\n        \n            \n                NBA MVP Rankings: Victor Wembanyama jumps into top three, Cade Cunningham could win by default\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nIt appears Cleveland has avoided disaster with Harden not being immediately ruled out for a significant period of time. The Cavs have gone 6-1 since trading for Harden in early February. He has established immediate chemistry with Donovan Mitchell in the backcourt, giving Cleveland someone who can take offensive pressure off Mitchell in a way Darius Garland couldn't.\"They're two guys that are hungry to take that next step, and they've hit it off. Kinda been seamless, really,\" Atkinson said of the relationship between Mitchell and Harden. \"Got two guys who are so passionate about the game, they're both hoop junkies, they're both smart and they both have great [work] ethics. Usually, when you have that kind of synergy, it goes well. Really with them I haven't seen any misunderstandings or 'You should have went there.' They've been pretty locked in on the court and off the court. Couldn't have gone better so far.\"Harden is averaging 18.9 points, eight rebounds and 4.6 assists as a member of the Cavs. Before the trade, he averaged 25.1 points, 8.1 rebounds and 4.8 assists in 44 games for the Los Angeles Clippers this season.\nCleveland (37-22) is tied with the Knicks for third in the Eastern Conference and 2.5 games ahead of the Toronto Raptors (34-24). How much the injury impacts Harden remains to be seen as the Cavaliers try to make a deep playoff run.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Harden injury: Cavaliers guard reportedly plans to play through fractured thumb - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/7ff2682c-6f67-4856-a6eb-96e2c4a086d4/thumbnail/1200x675/100c3c55004132cf10c86b287b8974fb/james-harden-cavaliers.jpg"
      ],
      "datePublished": "2026-02-26T00:33:31.000Z",
      "dateModified": "2026-02-26T00:33:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NCAA recommends significant penalties for accepting transfers outside portal window - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ncaa-penalties-college-football-spring-transfer-portal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/881fac27-64f2-4601-a2fd-977799f92593/thumbnail/1200x675/c41d19016fdddf41e2373867d56a00a2/ncaa.jpg",
    "tag": "Sports",
    "date": "2026-02-25T21:32:10.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first year of the NCAA's new single transfer p",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first year of the NCAA's new single transfer portal window for football brought plenty of drama and also loads of complaints about the new-look college football calendar. With spring practices set to begin soon, the NCAA is trying to get ahead of teams potentially circumventing the portal by bringing in additional players to their roster. With the removal of the spring transfer portal window, there is concern from the NCAA that schools could try to add athletes who did not put their name in the portal by simply having them transfer schools as any student would -- withdrawing from their current school and then enrolling at the new school outside of the portal window. To prevent that, the NCAA Division I Football Bowl Subdivision Oversight Committee issued three recommendations to the Division I Cabinet for punishments that they hope would be severe enough to curtail such behavior. \nIf the measure is approved, once an enrolled student-athlete who was not active in the Transfer Portal at the time of transfer participates in any athletically related activity at the next school, the following actions would occur: The head coach would be prohibited from all football (recruiting and on-field coaching) and administrative duties (team meetings) through the sixth contest of the season.The school would be fined 20% of its football budget. The school would be required to reduce the number of roster spots by five for the next season, regardless of the head coach's employment status at the school. If all of those suggestions are adopted, they would be among the strongest penalties the NCAA has ever handed down for a violation -- beyond the actual death penalty. A full six-game suspension for the head coach, a substantial fine from the program's football budget and a reduction in roster spots are far more than just a slap on the wrist. \n        \n            \n                NCAA tampering memo promises penalties for rule-breakers: How Dabo Swinney may have invoked change\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nGiven what we've seen in college sports of late, it seems like a guarantee that the first time these penalties, if adopted, were handed down, lawyers would get involved and the NCAA would find itself in another high-stakes court case over its jurisdiction to prevent such transfers. The key element in the NCAA's favor in that regard is that these penalties don't try to prevent the transfer itself, just the athlete's ability to play for their new school's football team. \nWe'll find out in due time whether the Division I Cabinet accepts this proposal in full or if it is revised. And then it will be up to the coaches and schools to decide whether they want to be the ones to test the legitimacy of this new policy in the court system. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NCAA recommends significant penalties for accepting transfers outside portal window - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/881fac27-64f2-4601-a2fd-977799f92593/thumbnail/1200x675/c41d19016fdddf41e2373867d56a00a2/ncaa.jpg"
      ],
      "datePublished": "2026-02-25T21:32:10.000Z",
      "dateModified": "2026-02-25T21:32:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tremaine Edmunds granted permission from Bears to seek trade - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/tremaine-edmunds-bears-trade/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/29cefb33-47b1-4367-816b-b685e78a0a60/thumbnail/1200x675/4713db2732d93b9b8fad2dbeb6129f69/trem.jpg",
    "tag": "Sports",
    "date": "2026-02-25T18:30:13.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Chicago Bears are exploring parting ways with ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Chicago Bears are exploring parting ways with one of their defensive starters, as the franchise granted permission to linebacker Tremaine Edmunds to seek a trade, per the Chicago Tribune. Edmunds, who turns 28 in May, enters the final year of the four-year, $72 million contract he signed with Chicago in 2023. He's due $15 million in cash with a $17.4 million cap hit in 2026, per Spotrac. Whether the Bears trade or cut Edmunds, they stand to save around $15 million by parting ways with him. Despite missing four games due to a groin injury, Edmunds led the Bears in 2025 with 112 tackles to go along with nine passes defensed, four interceptions and one sack. Edmunds has crossed 100 tackles in all eight of his NFL seasons since being selected by the Buffalo Bills with the No. 16 overall pick in the 2018 NFL Draft, and made back-to-back Pro Bowls in 2019 and 2020.The Bears went 11-6 in the first year of the Ben Johnson era, clinched the NFC North for the first time since 2018, and won their first playoff game since the 2010 campaign with Lovie Smith. Dennis Allen's defense recorded 33 takeaways, which led the NFL, while the Bears set an NFL record by registering seven wins when trailing in the final two minutes of the fourth quarter, including playoffs. \nEdmunds may not be the only notable player Chicago eventually trades or releases this offseason, as general manager Ryan Poles admitted that he has to \"look at all the different scenarios\" when asked about wide receiver DJ Moore at the NFL Scouting Combine. Moore carries a $28.5 million cap hit in 2026, which is the highest on Chicago's salary cap table. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tremaine Edmunds granted permission from Bears to seek trade - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/29cefb33-47b1-4367-816b-b685e78a0a60/thumbnail/1200x675/4713db2732d93b9b8fad2dbeb6129f69/trem.jpg"
      ],
      "datePublished": "2026-02-25T18:30:13.000Z",
      "dateModified": "2026-02-25T18:30:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Late-season Fantasy basketball streamers with real deep-league value - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/top-10-under-the-radar-fantasy-basketball-streamers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/4e57c0bf-9b76-4f3f-a789-9c568df27f4e/thumbnail/1200x675/fa4024723e661ead492465278b6d0e0b/kobe-brown-indiana-pacers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-25T22:18:22.000Z",
    "description": "\n        As the fantasy basketball season winds down, deep-league managers know that streaming can be the difference between climbing the standings an",
    "body": "\n        As the fantasy basketball season winds down, deep-league managers know that streaming can be the difference between climbing the standings and falling short. With injuries, suspensions, and late-season shutdowns reshaping rotations, opportunity is emerging in unexpected places. This article highlights 10 under-the-radar players who are seeing expanded roles and turning increased minutes into tangible production. From recent trade additions to young contributors capitalizing on frontcourt vacancies, these names offer short-term upside with category juice. If you're searching for rebounds, defensive stats, or a 3-point boost, these viable streaming options can provide a timely edge in competitive deep formats.Kobe Brown, PacersBrown joined the Pacers via trade at the deadline. After averaging 8.7 minutes per game through his first 34 appearances of the season with the Clippers, he is up to 27.2 minutes per game with his new squad. He is making good use of his expanded role, averaging 10 points, 7.3 rebounds, 1.5 assists, and 0.7 steals per game, including hauling in a season-high 10 rebounds in the most recent outing. He is likely to continue to see a notable role, as the Pacers work through injury trouble and are not expected to push their regular stars too hard without a shot at the postseason. Guerschon Yabusele, BullsYabusele found a new home with the Bulls via trade in early February and has been thriving ever since. He averaged just 8.9 minutes per game through 41 appearances with the Knicks, but is up to  25.5 minutes per game, including six starts through eight outings since joining the Bulls. He is averaging 10.6 points, six rebounds, 2.1 assists, and 0.8 steals per game with his new squad, including two double-doubles and a single-game season-high of eight assists. He should continue to handle a notable role within their limited frontcourt rotation. Olivier-Maxence Prosper, GrizzliesProsper was locked into a deep bench role for most of the season until late January, when he began to see more consistent action. His playing time picked up after the Grizzlies parted ways with Jaren Jackson, allowing Prosper to take a step up in the rotation. He is averaging 12.7 points, 4.5 rebounds, one assist, and one steal over his last 10 appearances, playing more than 20 minutes in eight. He topped the 20-point mark for the first time this season twice within his last five outings and is converting a blistering 71.4 percent from the field over that span.  \nPaul Reed, PistonsReed has been a solid contributor all season for the Pistons, but was mostly limited in his opportunities, falling behind Jalen Duren and Isaiah Stewart at the center position. However, with Stewart being suspended, Reed has stepped up to deliver an average of 16.3 points, 6.5 rebounds, 1.3 assists, 1.5 steals, and 2.5 blocks, while shooting 64.4 percent from the field over the last four games. While Stewart will be out until March 3, there is still time to take advantage of Reed's expanded role. Julian Strawther, NuggetsStrawther has been making the most of a boost in playing time during the injury absence of Peyton Watson, who is set to remain out for at least another week. Strawther is averaging 15.5 points, 3.7 rebounds, 1.7 assists, and one steal, with 2.3 made 3-pointers per game over six consecutive starts. His ability to contribute on both ends and the addition of his long-range shooting make him stand out from most players on this list. He should continue to prosper in the expanded role until Watson is back, but he will also likely retain a fair amount of playing time beyond that point.  Precious Achiuwa, KingsAchiuwa has seen his role pick up for a while now. But with the more recent addition of Dylan Cardwell to the injury report, as well as Domantas Sabonis being shut down, he is now in line to handle a significant role through the remainder of the season. Achiuwa is averaging 12.8 points, 6.6 rebounds, 1.2 assists, two steals, and one block in 24.8 minutes per game over five consecutive starts. He also has two double-doubles in his last three outings, including his first 20-and-10 game of the campaign in the most recent outing. \nYanic Konan Niederhauser, ClippersKonan Niederhauser saw very limited action to start the season but has earned a notable boost since his squad parted ways with starting center Ivica Zubac. Konan Niederhauser is still in competition with Brook Lopez for minutes at the position, but is making his case as a reliable option, averaging 5.9 points, 4.5 rebounds, and 1.4 blocks in 15.4 minutes per game over the last eight games. He has scored in double digits twice and has hauled in a high of eight rebounds twice in that span. He is also coming off the best defensive display of his young career, with four blocks in the last game. John Konchar, JazzKonchar is settling into his new home with the Jazz after being traded from the Grizzlies, along with Jaren Jackson. He has been a modest contributor throughout his NBA career, showing a knack for long-range shooting. Although he has yet to stand out offensively for his new squad, he has made a strong impression with his defensive impact, an area where he has also shown success in the past. He is averaging 4.2 rebounds and two steals in 22.2 minutes per game across six games. He could be a sneaky add for managers needing a boost in the above-mentioned areas. It is unclear how his playing time may hold up down the stretch, but with the recent injury to Vince Williams, there may be room for him to continue to pick up a fair amount of floor time. Baylor Scheierman, CelticsThe Celtics have cycled through a few different players at the starting wing positions this season, but Scheierman is the most recent standout, as he is averaging 8.2 points, 6.9 rebounds, 2.1 assists, and 0.7 steals over the last 10 games. His field-goal percentage is underwhelming, at 43.7, but he is knocking down 1.6 3s per game as a consolation. The second-year forward also has three double-doubles with points and rebounds among the last 10 games and should continue to enjoy a notable role that is his to lose. \nJa'Kobe Walter, RaptorsWalter is averaging 18.8 minutes per game on the season but has seen a boost and delivered improved production since the beginning of February, where he is averaging 9.1 points, 3.7 rebounds, 1.7 assists, and 1.3 steals, along with two made 3s per game over seven games. He looks to be earning his way by providing an intense defensive effort. There is certainly room for him to solidify a dedicated role as an energy guy off the bench, as the Raptors look to find their rhythm heading towards a postseason run. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Late-season Fantasy basketball streamers with real deep-league value - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/4e57c0bf-9b76-4f3f-a789-9c568df27f4e/thumbnail/1200x675/fa4024723e661ead492465278b6d0e0b/kobe-brown-indiana-pacers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-25T22:18:22.000Z",
      "dateModified": "2026-02-25T22:18:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Todd Monken complimentary of Shedeur Sanders, says Browns will have open QB competition - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/todd-monken-shedeur-sanders-browns-quarterback-competition/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/975cd1f8-05a1-4d6e-bd27-82ff33faf0cf/thumbnail/1200x675/78ac99414761f7e86997a9dd0fbd9a88/shedeur-sanders-browns-5.jpg",
    "tag": "Sports",
    "date": "2026-02-25T19:50:32.000Z",
    "description": "\n        New Cleveland Browns coach Todd Monken complimented Shedeur Sanders for his \"elite playmaking ability\" on Wednesday at the NFL combine, but s",
    "body": "\n        New Cleveland Browns coach Todd Monken complimented Shedeur Sanders for his \"elite playmaking ability\" on Wednesday at the NFL combine, but said he expects to have an open quarterback competition that gets narrowed down as the 2026 regular season approaches.\"Sure he can,\" Monken said about the possibility of Sanders becoming Cleveland's starter. \"I think what you see is elite playmaking ability. That's in him. You've seen it. We've seen it. You saw it in college. You saw it on tape last year. Sure, there's a ways to go, but what rookie isn't? I mean, what first-year player doesn't have a long way to go? So I'm excited to get started with him and all of our quarterbacks and all of our players.\"The Browns also have Deshaun Watson and Dillon Gabriel under contract for 2026. Monken anticipates having an \"open competition\" for the starting job between those three. And while he'd like to have his starter figured out by training camp, that may not be the case.\"I don't know why it wouldn't be an open competition, and I don't mean that harshly, but I don't think there's enough on film over the last couple years, one way or the other, to say, 'Boy, we have a starter at quarterback' yet, whether internally or externally,\" Monken said.\nThe Browns started three quarterbacks -- Joe Flacco, Gabriel and Sanders -- in 2025. Watson did not play at all in 2025; he tore his Achilles midway through the 2024 season and then tore it again a few months later. The Browns traded three first-round picks to the Houston Texans in March 2022 and then gave Watson a fully guaranteed five-year, $230 million contract. The NFL suspended Watson for the first 11 games of the 2022 season in the wake of 20-plus lawsuits alleging sexual misconduct. Ever since, Watson has played poorly and struggled with injuries.\n        \n            \n                Who are the top defensive prospects entering the 2026 NFL combine? Top 5 by position\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \nSanders, a fifth-round pick, started Cleveland's final seven games last season, taking over after his fellow rookie, Gabriel, suffered a concussion in Week 11. Sanders completed 57% of his passes for 1,400 yards, seven touchdowns and 10 interceptions. He also ran for 169 yards and a touchdown and took 23 sacks.Among 43 players with at least 150 dropbacks in 2025, Sanders finished 42nd in touchdown-to-interception rate, 42nd in net yards per pass attempt and 42nd in passer rating. Despite the unkind numbers, Sanders managed to show off some of the playmaking Monken described. Sanders' 11.7 yards per completion was the 10th-highest among that same sample of 43 quarterbacks.\nThe Browns finished 5-12 and fired coach Kevin Stefanski after the season. Monken, who was previously Lamar Jackson's offensive coordinator with the Baltimore Ravens, takes over a team with lots of defensive talent -- led by Defensive Player of the Year Myles Garrett and Defensive Rookie of the Year Carson Schwesinger -- but in dire need of upgrades across the board offensively.\"I think the biggest thing that we want to see from Shedeur is just continued growth,\" Browns general manager Andrew Berry said Tuesday. \"I think he grew a lot from start one to start seven. I think certainly playing more efficiently, not putting the ball in harm's way as much would be important while maintaining the ability to produce out of structure and generate explosive plays.\"You're not going to see all of that in the upcoming months because we're not on the field. So the biggest thing that he can do is learn the new offense, get in with the coaching staff once our offseason program starts, continue to work on his body physically and then make strides when we actually get on the grass.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Todd Monken complimentary of Shedeur Sanders, says Browns will have open QB competition - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/975cd1f8-05a1-4d6e-bd27-82ff33faf0cf/thumbnail/1200x675/78ac99414761f7e86997a9dd0fbd9a88/shedeur-sanders-browns-5.jpg"
      ],
      "datePublished": "2026-02-25T19:50:32.000Z",
      "dateModified": "2026-02-25T19:50:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Footy Fix: Champions League returns as Real Madrid and Vinicius Jr. face Jose Mourinho's Benfica - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-champions-league-returns-as-real-madrid-and-vinicius-jr-face-jose-mourinhos-benfica/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/18/f5f56b87-410b-4d12-91ab-55fade4f839e/thumbnail/1200x675/4c0bbb0fc99ab88c471a682ead4ac8c8/525798-uclm-25-ratio-cbssportshq-slate-1920x1080-1.jpg",
    "tag": "Sports",
    "date": "2026-02-25T18:36:51.000Z",
    "description": "\n        Hello! An upset of historic proportions has already made this a memorable week in the UEFA Champions League and there's more in store as the ",
    "body": "\n        Hello! An upset of historic proportions has already made this a memorable week in the UEFA Champions League and there's more in store as the knockout phase playoffs come to a close. I'm Pardeep Cattry with the latest as an entertaining week continues.📺 Footy fixAll times U.S./EasternWednesday, Feb. 25🇪🇺 UCL: Atalanta vs. Borussia Dortmund, 12:45 p.m. ➡️ Paramount+, CBS Sports Golazo Network🇪🇺 UCL: Juventus vs. Galatasaray, 3 p.m. ➡️ Paramount+, CBS Sports Network🇪🇺 UCL: Paris Saint-Germain vs. Monaco, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Real Madrid vs. Benfica, 3 p.m. ➡️ Paramount+🌎 CCC: Vancouver Whitecaps vs. Cartegines, 9:30 p.m. ➡️ FS2Thursday, Feb. 26🇪🇺 UEL: Stuttgart vs. Celtic, 12:45 p.m. ➡️ Paramount+, CBS Sports Network🇪🇺 UEL: Nottingham Forest vs. Fenerbahce, 3 p.m. ➡️ Paramount+, CBS Sports Network🌎 CCC: Philadelphia Union vs. Defence Force, 7 p.m. ➡️ FS1Who is Moving On?What's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Footy Fix: Champions League returns as Real Madrid and Vinicius Jr. face Jose Mourinho's Benfica - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/18/f5f56b87-410b-4d12-91ab-55fade4f839e/thumbnail/1200x675/4c0bbb0fc99ab88c471a682ead4ac8c8/525798-uclm-25-ratio-cbssportshq-slate-1920x1080-1.jpg"
      ],
      "datePublished": "2026-02-25T18:36:51.000Z",
      "dateModified": "2026-02-25T18:36:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why PSG aren't top-tier Champions League title contenders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/psg-monaco-champions-league-champions-europe/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/2a443d00-70db-4cc2-a190-b96a3374ebd4/thumbnail/1200x675/bd64cecf2d6957fa51e6dec0410b2954/untitled-design-2026-02-26t001503-414.png",
    "tag": "Sports",
    "date": "2026-02-25T23:19:26.000Z",
    "description": "\n        The title defence rolls on, but, in sharp contrast to 12 months ago, Paris Saint-Germain really do not feel like a team who are bound for the",
    "body": "\n        The title defence rolls on, but, in sharp contrast to 12 months ago, Paris Saint-Germain really do not feel like a team who are bound for the final. The dynasty might just be on pause for this season at least.If that seems a curious response to a 2-2 draw that took the holders beyond Monaco then ask yourself this question: how different might this tie have been if the young men from the principality had not contrived to get themselves sent off in the critical moments of both legs? For Aleksandr Golovin in the Stade Louis II read the previously exceptional Mamadou Coulibaly. When he careened into Achraf Hakimi in the 58th minute, Monaco were level in the tie and looked slightly more likely to find its seventh goal. Adi Hutter's side were doing a little with a lot: purposefully breaking out from their lines of five and four without the ball, exploiting the running power of Folarin Balogun out in the channels and getting players up in support of him. They might not have dominated possession -- who does against a Luis Enrique team? -- but they were getting into the right spots and doing with an energy that their illustrious hosts could not match.That is a real problem for PSG, who did get the job done quite swiftly after Coulibaly saw red. Desire Doue's cross from the byline was turned in by Marquinhos, Khvicha Kvaratskhelia pounced on the rebound when Philipp Kohn spilled a long ranger from Achraf Hakimi: these were partly a reward for the final third pressure the hosts applied with their man advantage but no less a reflection of a young opponent who'd had the stuffing knocked out of them by their reduction in numbers. \nxG race from PSG's 2-2 draw with Monaco, whose sending off came in the 58th minute \n                                                                    TruMedia\n                                                            There might have been more in this for Monaco than they realised, Jordan Teze ghosting in at the back post to turn in almost unmarked in a fashion not dissimilar to the opener from Magnes Akliouche. On both occasions, PSG had the numbers to comfortably deal with the situation, and none of them seemed willing to take control of the season. That could scarcely be a greater contrast from last season, when intensity was the defining trait of this team. Luis Enrique's men would outrun anyone in Europe, and at this stage, their blend of quality and industry was shining through so clearly against Ligue 1 opposition that you suspected this was a different outfit to the many who had fallen short in the Champions League.Tonight, you half expected to see one of the old guard ambling around the field out of possession, waiting for the other guys to do the defending and get the ball up to them. It is becoming increasingly clear that PSG relied on Ousmane Dembele for more than just his clutch goals. It is hard to believe that the best pressing Ballon d'Or-level striker of his generation would have allowed Monaco to so easily work their way out of the counter press when PSG frequently gave the ball away in the Monaco half. \nThe issue here is that the 13 total starts Dembele has made this season is altogether more normal for him than the run of fitness he found 12 months ago. Good squad planning means having good cover for the players you know are most vulnerable. It's not entirely clear that a front three of Bradley Barcola, Doue and Kvaratskhelia, with Goncalo Ramos filling in here and there, is that.Dembele is not the only one who is feeling the burn. Fabian Ruiz was missing tonight; it is hard to find a cornerstone of that championship team who hasn't missed time. And that's not a surprise. This was a team coached to hit its peak on May 31, 2025. Then they had to play on for another six weeks and seven games. The Club World Cup exacted a heavy burden. Luis Enrique has tried to mitigate that with rest and rotation, but maybe that explains why so many basic passes were going awry.When they didn't, this was still a team that could run rings around better opponents than Monaco. There is something irresistible about PSG's left winger dragging the opposition out of position to create space for an underlapping Nuno Mendes to fizz in a low cross from the byline. Get Kvaratskhelia going at his man, and it's good night and good luck. Last season, PSG could manufacture those spots a dozen times a night. Now they are flashes of what once was.\nWhat they are now is not a team that exists at the same level as Arsenal and Bayern Munich, the two clear favorites to win this competition. It might not even be enough to get comprehensively clear of Barcelona or Chelsea, the two teams that they could get in Friday's draw. At this stage a year ago PSG seemed to have the momentum to push themselves to the heights they had always dreamed of. Now they are back to the crushing realities of what a team looks like when it doesn't have the energy to match its talent.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why PSG aren't top-tier Champions League title contenders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/2a443d00-70db-4cc2-a190-b96a3374ebd4/thumbnail/1200x675/bd64cecf2d6957fa51e6dec0410b2954/untitled-design-2026-02-26t001503-414.png"
      ],
      "datePublished": "2026-02-25T23:19:26.000Z",
      "dateModified": "2026-02-25T23:19:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vikings are 'exploring all possibilities' at QB this offseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-qb-jj-mccarthy-2026-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/d66423c7-1d12-450d-8c29-16b4dd811ad1/thumbnail/1200x675/fc8d5fb0fdc53717040b3201a8cc1d68/jj.png",
    "tag": "Sports",
    "date": "2026-02-25T19:54:49.000Z",
    "description": "\n        There's no guarantee J.J. McCarthy will start at quarterback for the Minnesota Vikings during the 2026 season, that revelation coming this we",
    "body": "\n        There's no guarantee J.J. McCarthy will start at quarterback for the Minnesota Vikings during the 2026 season, that revelation coming this week from executive vice president of football operations Rob Brzezinski, who said at the NFL combine the franchise is are \"exploring all possibilities\" at the position.The Vikings watched eventual Super Bowl champion Sam Darnold sign with the Seattle Seahawks as a free agent last March after hitching their wagon to McCarthy, a former 2024 first-round pick who was inconsistent during his first campaign as a starter.McCarthy finished with 1,632 yards passing, 11 touchdowns and 12 interceptions over 10 games, going 6-4 overall after missing his rookie season with a knee injury.\"What we do know is we need a level of baseline quarterback play for us to be effective,\" Brzezinski said. \"A lot of this has been J.J. in unfortunate (situations) with some of the injuries and things that he's dealt with, but we're going to explore every opportunity, and I don't think there's anything specifically we're looking for. We can't manufacture anything that's not there. So No. 1, what are the options? Is it reciprocal? Is it financially doable? All those things. There's just a lot of factors that go into it.\"\nNeither Vikings coach Kevin O'Connell, nor Brzezinski, endorsed McCarthy as Minnesota's expected starter during separate interviews in Indianapolis this week. O'Connell did say he felt like McCarthy, who missed the team's regular-season finale in January with a hand injury, could still be a franchise quarterback.O'Connell was previously a firm believer in the former Michigan standout to lead his offense after Minnesota selected him at No. 10 overall two years ago in the draft.\"It's just the timeline is in a different place for all of us than it was at that point,\" O'Connell said this week, via ESPN. \"And I have a responsibility -- we have a responsibility collectively as we put together this team -- to make sure that we use the data that we have at this time and the experiences we have, the feelings that we've had at different times as an organization.\"\nMcCarthy is signed through the 2027 on his four-year rookie deal which includes $21.8 million guaranteed. Brzezinski said the team was not\" ruling anything out\" with their plan at quarterback. Aaron Rodgers is a free agent, along with Malik Willis. There's an expectation Arizona Cardinals quarterback Kyler Murray could be as well since he hasn't spoken with the team since the end of the season.The Indianapolis Colts have a decision to make with Daniel Jones. He's set to hit free agency unless the team franchise tags him or gets him to agree to a new deal.Each of these signal callers could be potential targets for the Vikings if they're not comfortable with moving forward with McCarthy as QB1 for next season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vikings are 'exploring all possibilities' at QB this offseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/d66423c7-1d12-450d-8c29-16b4dd811ad1/thumbnail/1200x675/fc8d5fb0fdc53717040b3201a8cc1d68/jj.png"
      ],
      "datePublished": "2026-02-25T19:54:49.000Z",
      "dateModified": "2026-02-25T19:54:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robert Livingston, key assistant for Deion Sanders at Colorado, leaving for NFL job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/robert-livingston-colorado-deion-sanders-defensive-coordinator-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/25/f9b11a3c-d20a-499a-95ca-26b82b253d0d/thumbnail/1200x675/b7c59fb4262be2f78c26b8bde1076e2a/livingston-sanders-getty.png",
    "tag": "Sports",
    "date": "2026-02-25T19:29:24.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Colorado coach Deion Sanders was forced to shuffle",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Colorado coach Deion Sanders was forced to shuffle his staff ahead of spring practice after defensive coordinator Robert Livingston was hired by the Denver Broncos as their new defensive pass game coordinator, per ESPN. Livingston spent the past two seasons leading the Buffaloes' defense, including their nine-win season in 2024, but is now heading back to the NFL. Livingston worked for the Cincinnati Bengals, first as a scout and then as a defensive assistant, from 2012 to 2023 before joining Sanders' staff in Boulder. Livingston spent two seasons working under Broncos defensive coordinator Vance Joseph early in his career. Livingston's departure is a significant blow for Colorado, and Sanders has elevated linebackers coach Chris Marve to the defensive coordinator, according to multiple reports. Marve previously was the defensive coordinator at Virginia Tech from 2022-24 before coming to Colorado. Marve also had stints as a defensive assistant at Florida State, Mississippi State and Vanderbilt. Colorado looking to rebound after rough 2025 seasonColorado had a dismal 2025 season, going 3-9 overall and just 1-8 in Big 12 play, as the drop-off after losing Heisman Trophy-winning two-way star Travis Hunter and quarterback Shedeur Sanders was dramatic. \nSanders, after inheriting a major rebuilding job, has gone 16-21 over three seasons leading the program. The Buffs went 4-8 in Year 1 before a breakthrough 9-4 record in 2024. After last year's stumble, Sanders proclaimed that he's the \"right man for the job\" in Boulder while outgoing athletic director Rick George consistently backed his coach.\n        \n            \n                Big 12 football power rankings 2026: Texas Tech, BYU remain on top while Utah falls back to pack\n                \n                    Shehan Jeyarajah                \n            \n                            \n    \n                \n                    \n    \nLast month, Colorado hired Fernando Lovo from New Mexico as its new athletic director after George decided to transition into an advisory role. Patience is at an all-time low for high-priced college coaches who don't produce winning seasons. With a new athletic director in place, Sanders faces pressure to deliver a turnaround for the program in 2026. And now he'll do it without Livingston, his proven defensive coordinator.\nSanders has to hope Marve is the right man to lead a new-look defense that took on 25 transfers in this year's portal window in an effort to bounce back and build out that side of the ball. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Livingston, key assistant for Deion Sanders at Colorado, leaving for NFL job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/25/f9b11a3c-d20a-499a-95ca-26b82b253d0d/thumbnail/1200x675/b7c59fb4262be2f78c26b8bde1076e2a/livingston-sanders-getty.png"
      ],
      "datePublished": "2026-02-25T19:29:24.000Z",
      "dateModified": "2026-02-25T19:29:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]