[
  {
    "title": "Team USA women's hockey schedule, scores, standings at 2026 Winter Olympics - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-us-womens-hockey-schedule-results-standings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/a61ab3b2-767e-4499-85d0-04f221f8b056/thumbnail/1200x675/571523b398249c69472e3ffa2a7e4a57/team-usa-womens-hockey-getty.png",
    "tag": "Sports",
    "date": "2026-02-05T18:53:19.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    Hilary Knight and co. are hunting for their third gold medal and first since 2018\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 5, 2026\n                            \n                    at\n    1:45 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After suffering a devastating loss to Canada in the gold medal game four years ago, the U.S. women's hockey team is out for some revenge at the 2026 Winter Olympics. The Americans certainly have the team to compete for another gold medal thanks to a collection of proven Olympic veterans and rising stars, and they got off to a strong start Thursday with a dominant 5-1 win over Czechia. Hayley Scamurra led the way with two goals, team captain Hilary Knight went top shelf late in the second period to extend the lead to 4-1 and Aerin Frankel stopped 13 of 14 shots in net to help the Americans open Olympic play on a positive note.\nAlong with Canada, Team USA is one of just two countries that have won gold in women's ice hockey since the event was added to the Olympics in 1998. The Americans won that inaugural year in Nagano, then endured four straight Canadian victories until 2018, when Team USA struck back with a dramatic overtime win to capture gold in Pyeongchang.Team USA is poised to retake its place atop the international hockey hierarchy, and it enters the Olympics as the favorite to win gold. According to FanDuel Sportsbook, it's another two-horse race between the U.S. (-155) and Canada (+115), at least on paper. The next closest gold medal contenders are Czechia (+6000) and Sweden (+6000).As is typically the case, the Americans have put together a roster that's loaded at every position, and there's a good mix of experience and youth. Knight is making her fifth Olympic appearance, and star Kendall Coyne Schofield will make her fourth Olympic appearance. Defenders Megan Keller and Lee Stecklein are also familiar with the Olympic stage. Meanwhile, rising stars Taylor Heise, Carlone Harvey and Laila Edwards are getting their first taste of Olympic action.The Americans continue this Olympic journey with a matchup against Finland on Saturday, and we'll keep you up to date with each result along the way.\nU.S. women's hockey scheduleAll times EasternPreliminary roundThursday, Feb. 5: USA 5, Czechia 1 USA vs. Finland | Saturday, Feb. 7 | 10:40 a.m. | USA NetworkUSA vs. Switzerland | Monday, Feb. 9 | 2:40 p.m. | USA NetworkUSA vs. Canada | Tuesday, Feb. 10 | 2:10 p.m. | USA NetworkQuarterfinalTBD vs. TBD | Friday, Feb. 13 | 3:10 p.m. | TBDSemifinalTBD vs. TBD | Monday, Feb. 16 | 10:40 a.m. | TBDBronze medal game\nTBD vs. TBD | Thursday, Feb. 19 | 8:40 a.m. | TBDGold medal gameTBD vs. TBD | Thursday, Feb. 19 | 1:10 p.m. | TBD\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Team USA women's hockey schedule, scores, standings at 2026 Winter Olympics - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/a61ab3b2-767e-4499-85d0-04f221f8b056/thumbnail/1200x675/571523b398249c69472e3ffa2a7e4a57/team-usa-womens-hockey-getty.png"
      ],
      "datePublished": "2026-02-05T18:53:19.000Z",
      "dateModified": "2026-02-05T18:53:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Super Bowl picks, AI-generated score prediction for Patriots vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-seahawks-patriots-picks-score-predictions-nfl-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/21/b12a00a8-4a01-4ff8-a574-5ec10eb9c07b/thumbnail/1200x675/81bd9960b90bd632bbf4020dd7cb429b/usatsi-27138890-hunter-henry-patriots-te-2q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2026-02-05T16:53:53.000Z",
    "description": "\nFamiliar Super Bowl foes meet when the Seattle Seahawks battle the New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8. Seattle advanced wi",
    "body": "\nFamiliar Super Bowl foes meet when the Seattle Seahawks battle the New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8. Seattle advanced with a 31-27 win over the Los Angeles Rams in the NFC Championship Game, while New England outlasted the Denver Broncos 10-7 in the AFC Championship Game. The Seahawks (14-3), who have won nine in a row, are making their fourth Super Bowl appearance. The Patriots (14-3), who have won six consecutive games, are making their 12th Super Bowl appearance, extending their own record as no other franchise has more than eight appearances.Kickoff is set for 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. Seattle enters Super Bowl 60 as a 4.5-point (-115) favorite, and the over/under at 45.5 at DraftKings Sportsbook. Seattle is -231 (risk $231 to win $100) on the money line, while New England is +191. Before making any 2026 Super Bowl LX picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Super Bowl LX NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for the game. You can only see the AI predictions for the 2026 NFL Super Bowl LX game schedule here.Why the Seahawks can coverSeattle is known for its defense, allowing 16 or fewer points in six of its past eight games. The Seahawks had the sixth-best defense in the NFL, giving up 285.6 yards per game and a league-low 17.2 points per game. Seattle has been dominant in the run game, giving up just 91.9 yards rushing, which is the third-best in the league. Offensively, the Seahawks had a top-10 offense as well. During the regular season, Seattle tied with San Francisco for the seventh-best offense, averaging 351.4 yards per game. The Seahawks averaged 28.4 points, which was third-best in the NFL. Veteran quarterback Sam Darnold was a big part of the Seattle offense, which had the eighth-best passing attack, averaging 228.1 passing yards per game. See who wins Super Bowl LX predictions and game picks at SportsLine.Why the Patriots can coverLike Seattle, New England has also had a solid defense in 2025-26. The Patriots ended the regular season with the eighth-best defense, allowing 295.2 yards per game. New England allowed the fourth-least amount of points at 18.8 points per game. The Patriots were among the best against the rush, finishing sixth overall, allowing 101.7 rushing yards per game. New England has allowed 16 or fewer points in each of the last five games.Offensively, the Patriots put up the second-most points in the regular-season, averaging 28.8 points per game, behind second-year quarterback Drake Maye. They had the third-best offense at 379.4 yards per game, and were fourth in passing yards at 250.5. New England has scored 26 or more points in eight of its last 10 games. See who wins Super Bowl LX predictions and game picks at SportsLine.How to make 2026 Super Bowl LX picksAfter analyzing Super Bowl LX, SportsLine AI says the Under 45.5 (-112) will hit in a tight, low-scoring matchup. SportsLine AI has also revealed its exact score projection, and a coveted A+ pick on one side that you can see to see now. Visit SportsLine to see the AI's pick. Who wins and covers Super Bowl LX, and which A+ pick should you target now? Visit SportsLine now to see the top NFL picks against the spread, ove/-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Super Bowl picks, AI-generated score prediction for Patriots vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/21/b12a00a8-4a01-4ff8-a574-5ec10eb9c07b/thumbnail/1200x675/81bd9960b90bd632bbf4020dd7cb429b/usatsi-27138890-hunter-henry-patriots-te-2q-2025-1920.jpg"
      ],
      "datePublished": "2026-02-05T16:53:53.000Z",
      "dateModified": "2026-02-05T16:53:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warriors vs. Suns prediction, odds, time: 2026 NBA picks for Thursday, Feb. 5 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/warriors-suns-odds-prediction-time-2026-nba-picks-thursday-february-5/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/379233de-4d34-4625-b4ab-1a0be2043005/thumbnail/1200x675/043a25db8b11e7b982a2c5dd6d756654/draymond-green-golden-state-warriors-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-02-05T16:50:05.000Z",
    "description": "\n        Two Western Conference playoff hopefuls will meet on Thursday's NBA schedule as the Golden State Warriors visit the Phoenix Suns. The Warrior",
    "body": "\n        Two Western Conference playoff hopefuls will meet on Thursday's NBA schedule as the Golden State Warriors visit the Phoenix Suns. The Warriors (27-24) have lost two in a row and are No. 8 in the West standings. The Suns (31-20) have won four of their last five and are seventh in the Western Conference. Steph Curry (knee) and Devin Booker (ankle) are out for their respective teams, while Phoenix guard Jalen Green (hip) is listed as questionable.Tipoff is at 10 p.m. ET from Mortgage Matchup Center in Phoenix. Golden State has won two of three matchups this season. The latest Suns vs. Warriors odds list Phoenix as the 6.5-point favorites, with the over/under at 215.5. Before making any Warriors vs. Suns picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Suns vs. Warriors 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Warriors vs. Suns:Suns vs. Warriors   spread                                                                     Suns -6.5 at DraftKings SportsbookSuns vs. Warriors   over/under:    215.5 pointsSuns vs. Warriors   money line:    Suns -250, Warriors +203Suns vs. Warriors   picks: See picks at SportsLineSuns vs. Warriors   streaming:Prime VideoNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Warriors vs. Suns   picksSportsLine's model has simulated Suns vs. Warriors 10,000 times and is going Over on the total (215.5 points). These teams have frequently engaged in high-scoring affairs when meeting in Phoenix as six of their last eight matchups in the Arizona capital have gone over. Additionally, few teams have eclipsed the total as often as Golden State, which has seen the Over post a 30-21 record this season, which is the third-highest over record in the NBA.Meanwhile, each of the Suns' last three games have eclipsed the total, while two of the last three Warriors games have gone over. The total has dropped six points since first opening at 221.5, and that only favors the Over being hit. The model calls for 221 combined points going on the scoreboard, with the Over hitting 60% of the time.It also says one side of the spread hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Warriors vs. Suns, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Suns vs. Warriors spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warriors vs. Suns prediction, odds, time: 2026 NBA picks for Thursday, Feb. 5 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/379233de-4d34-4625-b4ab-1a0be2043005/thumbnail/1200x675/043a25db8b11e7b982a2c5dd6d756654/draymond-green-golden-state-warriors-imagn-images-1.jpg"
      ],
      "datePublished": "2026-02-05T16:50:05.000Z",
      "dateModified": "2026-02-05T16:50:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Lindsey Vonn shows off intense workout despite serious knee injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-lindsey-vonn-injury-schedule-ruptured-acl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/a63168cd-8ebc-4de8-860e-a1f5c13a82c7/thumbnail/1200x675/8ab8ec9025b97c69bf4ddc4f4d595aca/vonn.png",
    "tag": "Sports",
    "date": "2026-02-05T19:22:17.000Z",
    "description": "\n        American skier Lindsey Vonn posted a workout video Thursday from Milan showcasing her training ahead of her first Olympics event despite suff",
    "body": "\n        American skier Lindsey Vonn posted a workout video Thursday from Milan showcasing her training ahead of her first Olympics event despite suffering a ruptured ACL last week. Vonn was seen squatting without a knee brace and later was doing various stretching, box jumps and calisthenics exercises with a brace on her left leg.Vonn, a three-time Olympic medalist, says her knee is not hurting and there's no swelling despite the ligament damage. The 41-year-old still plans to compete at the Milan Cortina Olympics despite another significant knee injury.\n\"I'm still here. I think I'm still able to fight. I think I'm still able to try,\" Vonn said this week. \"And I will try as long as I have the ability to, I will not go home regretting not trying,\" Vonn said. \"I will do everything in my power to be in that starting gate.\"The skier injured her knee on Jan. 30 during a training crash. Vonn is planning to participate in the downhill event on Feb. 8 and will later decide on the team combined on Feb. 10 and the super-G on Feb. 12 based on her performance and how she feels.\n        \n            \n                Lindsey Vonn plans to ski in Olympics on torn ACL: 'As long as there's a chance, I will try'\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \n\"I have not deviated from my plan. I've been determined,\" Vonn said. \"Normally in the past, there's always a moment where you break down and you realize the severity of things and that your dreams are slipping through your fingers. But I didn't have that this time. I'm not letting this slip through my fingers. I'm gonna do it, end of story.\n\"So I'm not letting myself go down that path. I'm not crying. My head is high, I'm standing tall, and I'm gonna do my best, and whatever the result is, that's what it is. But never say I didn't try.\"Vonn retired in 2019 due to various injuries, but after getting a partial knee replacement in her right knee, she decided to return to the slopes to make one last Olympic run. Vonn has one Olympic gold medal (2010 downhill) and a pair of bronze medals in the Super G (2010, 2018), and came in as a surprising favorite in the downhill and a threat to podium in both disciplines. Her comeback has been a remarkable story, as she entered the Olympics leading in points in the women's downhill -- including two wins -- and has two podium finishes in the Super G. That made the timing of her crash so devastating, but Vonn insists she won't let that crash end her story. At 41, this is likely Vonn's last opportunity at the Winter Olympics.\n\"I've got no doubts in my mind that this is going to be OK,\" Vonn's head coach, Chris Knight, told the AP this week. \"She's been doing box jumps, she's trying everything out, loads and stresses and things like that to just see where she's at and see how she feels and she's pulled up great from everything.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Lindsey Vonn shows off intense workout despite serious knee injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/a63168cd-8ebc-4de8-860e-a1f5c13a82c7/thumbnail/1200x675/8ab8ec9025b97c69bf4ddc4f4d595aca/vonn.png"
      ],
      "datePublished": "2026-02-05T19:22:17.000Z",
      "dateModified": "2026-02-05T19:22:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rams, 49ers to play in NFL's first game in Australia in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-49ers-australia-2026-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/45f4872a-d484-4b3c-8758-4888532eac89/thumbnail/1200x675/c96220c75405052c7f6b306a9f627f8c/cmcla.jpg",
    "tag": "Sports",
    "date": "2026-02-05T19:33:47.000Z",
    "description": "\n        A notable chapter in the the Los Angeles Rams and San Francisco 49ers' rivalry will be written next season, when the two teams take part in t",
    "body": "\n        A notable chapter in the the Los Angeles Rams and San Francisco 49ers' rivalry will be written next season, when the two teams take part in the first NFL game played in Australia. Specifically, Los Angeles and San Francisco will play a regular season game at Melbourne Cricket Ground in Melbourne, Australia. The specific date is yet to be determined. \"Expanding to Melbourne, Australia, a beautiful city with a rich sports history, underlines our ambitions to become a global sport and accelerate international growth,\" NFL commissioner Roger Goodell said. \"We look forward to making history in what is an important market for the NFL and a significant next step in expanding our international footprint.\"While it's been known for a while that the Rams were headed to Australia, their opponent had not been revealed until Thursday. This will be only the 49ers' second international game over the past 13 years and their first since 2022. San Francisco did play in the NFL's first international game when they defeated the Arizona Cardinals in Mexico City back in 2005. \"As we make history with the NFL and bring the first regular season game to Australia, we are pleased to take our annual match-up against our NFC West rival San Francisco 49ers to the MCG,\" Rams president Kevin Demoff said. \"Since we first secured marketing rights to the country in 2021 and more recently since the announcement of this game last year, we have seen tremendous excitement for our team from fans both in Australia and also across the world. We look forward to spending this offseason continuing to deepen our connection with the Melbourne community leading up to the game this fall.\"\nOne of the NFL's better rivalries, the Rams and 49ers split their season series in 2025. Both teams posted 12-5 records during the regular season before advancing to the divisional round of the NFC playoffs. Both teams saw their seasons end at the hands of another NFC West rival in the Seattle Seahawks. The injury-depleted 49ers were soundly defeated by Seattle in the divisional round, while the Rams lost a hard-fought NFC Championship game. The Rams-49ers game in Australia is one of nine international games that will take place in 2026, a two-game increase from 2025. Goodell recently said his goal is to reach 16 international games per season, with every team playing at least one game abroad.\n\"We're getting great reactions from our teams,\" Goodell said during his annual Super Bowl week press conference. \"They all want to play. Our players loved it. One of the greatest things from last season was talking to our players and our coaches about how proud they were to be there and talk about the game to help globalize the game. They felt like ambassadors, and they enjoyed the experience, and that's really part of it.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rams, 49ers to play in NFL's first game in Australia in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/45f4872a-d484-4b3c-8758-4888532eac89/thumbnail/1200x675/c96220c75405052c7f6b306a9f627f8c/cmcla.jpg"
      ],
      "datePublished": "2026-02-05T19:33:47.000Z",
      "dateModified": "2026-02-05T19:33:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cristiano Ronaldo threatens Saudi exit, feels 'betrayed' over transfers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/cristiano-ronaldo-betrayed-threaten-exit-saudi-pro-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/695f0f12-53a8-4f1d-ac45-d62c2d914d2c/thumbnail/1200x675/d2ee4947ab972e12c1d4b7a5d4f5949c/ronaldo.jpg",
    "tag": "Sports",
    "date": "2026-02-05T19:12:08.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cristiano Ronaldo has warned senior figures in the",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cristiano Ronaldo has warned senior figures in the Saudi Pro League that he is prepared to leave the country over his dissatisfaction with recent transfer business in the competition, according to CBS Sports sources.Ronaldo missed Al-Nassr's 1-0 win over Al-Riyadh on Monday with CBS Sports reporting that the 41-year-old was angered by the decision of PIF, who own four of the country's leading clubs, to transfer star player Karim Benzema from Al-Ittihad to Al-Hilal at a time when his squad was not strengthened. At the time, it was hoped that Ronaldo could be swiftly brought back into the fold, and the striker has returned to training. However, his dissatisfaction has only grown with a source close to Al-Nassr telling CBS Sports that Ronaldo feels \"betrayed\" and is now open to bringing his three-year stay in Saudi Arabia to an end.The same source suggested it will require intervention by senior figures within sovereign wealth fund PIF to offer Ronaldo assurances over the future of his club and the Pro League. Ronaldo is yet to win that competition since his departure from Manchester United and his chances of doing so this season likely diminished when Benzema, who had grown unsatisfied at Al-Ittihad, moved to league leaders Al-Hilal and extended his contract by 12 months to the summer of 2027.That is the same year in which Ronaldo's sizeable contract at Al-Nassr expires. If he were to leave early, it could afford him the opportunity to end his career where it began with Portuguese giants Sporting. Leading clubs in Turkey might also offer Ronaldo a chance to extend his career, and there has been a notable trend for business between the Pro League and Super Lig in recent weeks. His contract includes a $59 million (€50 million) release clause.Ronaldo had been expected to return to the Al-Nassr side for Friday's game against Al-Ittihad but that is now a matter of greater speculation with some believing he may look to make his point even more visibly to PIF by sitting out more matches. That could afford Al-Hilal a chance to extend their lead at the top of the Pro League. His signing is already paying dividends with the Ballon d'Or winner scoring a debut hat trick against Al-Akhdoud, while also adding an assist.\nThough Ronaldo is unhappy to see his rivals sign Benzema, it should be noted that that deal was not funded by the PIF or the Pro League and instead by billionaire investor Prince Alwaleed bin Talal. Though Al-Nassr did not make the same splashy acquisitions of their title rivals in January —former Arsenal defender Pablo Mari joining $17 million of Saudi talent — they did invest heavily in the summer, signing Kingsley Coman and Joao Felix.  \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cristiano Ronaldo threatens Saudi exit, feels 'betrayed' over transfers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/695f0f12-53a8-4f1d-ac45-d62c2d914d2c/thumbnail/1200x675/d2ee4947ab972e12c1d4b7a5d4f5949c/ronaldo.jpg"
      ],
      "datePublished": "2026-02-05T19:12:08.000Z",
      "dateModified": "2026-02-05T19:12:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grading 5 college basketball coaches from A-F: Fred Hoiberg shines, Jerome Tang disappoints - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-coaching-grades-a-f-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/d30a89a0-e21e-40c8-a0c1-17b46521ec7a/thumbnail/1200x675/dacc8d82c9cdc9719c653a16bfcd6a28/jerome-tang.png",
    "tag": "Sports",
    "date": "2026-02-05T20:17:28.000Z",
    "description": "\n        The rule for this week's thought exercise was simple: five coaches, five grades on the A-through-F scale. Of course, not all gigs are created",
    "body": "\n        The rule for this week's thought exercise was simple: five coaches, five grades on the A-through-F scale. Of course, not all gigs are created equal, and the weight of expectations is a different beast. For a program like UConn or Duke, any season that ends without a championship can ring a bit hollow. For a first-year coach like Bucky McMillan at Texas A&M, one could argue that the Aggies could fall apart in the SEC race, miss 28 treys in a first-round tourney loss and the 2025-26 season would still, by any objective rating by a computer or a human, be a rounding success.With context, situation and the financials in mind, let's dive in.\n                            \n    \n                                                \n                    \n    Fred Hoiberg, NebraskaHoiberg has long been a wizard on the whiteboard, but this is his finest work yet. Nebraska has zoomed from preseason No. 51 on KenPom all the way up to No. 12, solidifying itself as a legitimate Final Four contender with gutty road wins over Indiana, Illinois and Ohio State. Hoiberg is engineering hands down the best season in Nebraska basketball history, largely thanks to excellent player development and massive roster-building wins on the margins. Braden Frager was a three-star recruit who has transformed into one of the top sixth men in all of college basketball. Pryce Sandfort was just a solid role player at Iowa; he has blossomed into one of the elite shot-makers in college basketball. Jamarques Lawrence left Nebraska for more opportunity at Rhode Island, but he is playing the best basketball of his career in his return to Lincoln. Former walk-on Sam Hoiberg is one of the Big Ten's best defensive players and should be in the running for the league's Defensive Player of the Year award.Nebraska's gorgeous offense orbits around big man Rienk Mast. The tough-as-nails forward has found his All-Big Ten form after missing all of last year with a gutting knee injury. The Dutchman might not be able to win a 100-meter sprint, but he can pass the leather off it and shoot the lights out from downtown. Most importantly, this team is a batch of steely, cold assassins who have taken on the personality of their head coach. In the middle of the heat, Nebraska has kept its cool repeatedly. Conversely, when the Huskers are sluggish in the tundra that is Minnesota in late January, Hoiberg has the fire to rally the troops to erase an eight-point, second-half deficit. \nNebraska has infamously never won an NCAA Tournament game. Hoiberg has a team that can change that, but these Huskers are dreaming of so much more. Grade: AAlso considered: Bucky McMillan, Texas A&M\n                            \n    \n                                                \n                    \n    Will Wade, NC StateWade entered the fray in Raleigh, raring to go.\"Everybody's singing from the same sheet of music,\" Wade said during his opening press conference. \"When that happens at NC State, there's going to be a reckoning for the ACC, there's going to be a reckoning for college basketball. And it's coming. And it's coming soon.\"Heard, chef.Then came the portal where NC State outbid Kansas for coveted Texas Tech transfer Darrion Williams to headline the ACC's second-best transfer haul.\t\nThen came the preseason hype from every nook and cranny of basketball Twitter. Amazingly, that died down in a hurry when the defense went MIA in Maui, allowing 102 to Texas and 85 to a Seton Hall group that sometimes tries to win games by scoring 38 points. And yet, the Pack never folded and has slowly gotten better and better. NC State sits 17-6 overall and 8-2 in ACC play after reeling off five-straight wins, including two barn-burner roadkills over good clubs in Clemson and SMU. NC State has gone from out of the tournament picture in mid-December to angling for seeding in early February. Oh, and it can still dream of chasing the ACC championship.This team's hiccups at multiple levels defensively may keep it from cruising into the upper echelon, but they have also proven Wade right.\n\"I want to be very clear: This is not a rebuild,\" Wade said in that famous presser. \"We're going to be in the top part of the ACC next year, and we're going to the NCAA tournament.\" Grade: BAlso considered: Kevin Willard, Villanova\n                            \n    \n                                                \n                    \n    Mark Pope, KentuckyThe moral of the story in Lexington is that it's never as good as it might seem or as bad as one might assume. The preseason hype around this team has proven to be too lofty. The dumpster fire claims surrounding this team show the opposite side of the coin.So swings the pendulum with a rabid fanbase who just so desperately wants to hang banner No. 9.\nThis Kentucky team isn't going to win the title. It took too many risks in free agency, that much is clear. Signing ballyhooed Arizona State transfer Jayden Quaintance, knowing full well he faced a long road to recovery after a torn ACL, was a bit too aggressive. It also had a few too many miscalculations. In retrospect, Sam Houston State transfer Lamar Wilkerson would've been worth every penny for his snug fit in this scheme. Instead, Indiana gets to enjoy Wilkerson's barrage of buckets. It also got unlucky with a preseason injury to point guard Jaland Lowe that sent everything into a tizzy.But these 'Cats also deserve some credit for getting back up off the mat. Pope has found a rotation that works, and Kentucky is finally shooting the basketball like Pope envisioned in the summer. The 'Cats are shooting a sizzling 36% from 3-point range amid a 7-3 start in league play. That ranks second-best in the SEC. Maybe most importantly, Otega Oweh is playing up to his Preseason Player of the Year abilities again, and freshman big man Malachi Moreno is so clearly going to be a beast … in time. The much-maligned Pope took his earned share of arrows for a disastrous start, but he's kept Kentucky from careening off the road into the abyss. Kentucky isn't a top-10 team, but it will make the NCAA Tournament, and with the right draw, it could make the second weekend. Grade: C \nAlso considered: Darian DeVries, Indiana\n                            \n    \n                                                \n                    \n    Kim English, ProvidenceProvidence had real money to make hay in the portal. It threw bags at proven veterans -- i.e., Vanderbilt's Jason Edwards, Georgia Tech's Duncan Powell and UCF's Jaylin Sellers -- to buff up an offense that was anemic for long stretches in 2024-25. English's roster-building vision was clear: Vets who can score + high-upside freshmen + defense-first returners = NCAA Tournament recipe.It's coalesced into ... something.The Friars are No. 1 in any League Pass Watchability scale. Providence is up to five overtime games this year after a wild, double-overtime win over Butler on Wednesday. They don't turn it over or take the ball away, so the action ping-pongs back and forth with plenty of shot-makers, high-level athletes and not a lick of defense to be found. English had built some analytically savvy defenses in the past, but this group can't guard one action, let alone multiple, without making a back-breaking mistake.\nProvidence has also shown its top-shelf appeal when it rallied to knock off St. John's at Madison Square Garden, but that's a double-edged sword because it makes a 10-13 record (3-9 in the Big East) all the more infuriating to the Friar faithful.English deserves some kudos for accumulating this talent, and Providence has suffered some heartbreaking, flip-a-coin losses that will sting for weeks. But this group has too many good players to be three games under .500. Sellers is a stud. Stefan Vaaks is a promising freshman who can light it up. Jamier Jones is a difference-maker when he's dialed in. Edwards, when healthy, is a threat to score 25 every night.Others have done more with less. Grade: DAlso considered: Scott Drew, Baylor\n                            \n    \n                                                \n                    \n    Jerome Tang, Kansas StateAnother year, another massive Kansas State budget. Another year, another massive Kansas State disappointment. Tang is eyeing down the reality of a third straight season without a NCAA Tournament appearance despite having stuffed NIL coffers that many would envy.\nKansas State sits at 10-12 overall and is tied for dead last in the Big 12, but somehow, it's gone from bad to worse in the last two weeks. Rival Kansas ran Kansas State out of the gym in the second half on Jan. 24. The 86-62 loss was painful, and the unafraid Melvin Council Jr. tossed salt onto the open gash by trolling Tang on the court multiple times with the Wabash Cannonball dance.Last Sunday, Iowa State followed suit and bulldozed Kansas State, 95-61. Bramlage Coliseum, once a house of horrors, was eerily quiet for good reason.Injuries are certainly a factor here to explain Kansas State's downturn, even though star Memphis transfer PJ Haggerty has been productive almost every single outing. Rotation forwards like Elias Rapieque, Mobi Ikegwuruka and Khamari McGriff are all sidelined. Sniper Abdi Bashir is also out for multiple weeks with a stress fracture in his foot. But Kansas State wasn't a good basketball team when those guys were healthy, either. They were all on the floor on Dec. 1 when K-State lost to Bowling Green at home. Tang had everyone available and still got trucked at home by Seton Hall and hammered by Indiana on the road. \nThe injuries have accentuated the spiral, but the roster-building decisions put Kansas State in a bind in the first place. Tang tied up a ton of his cap space into Bashir and Kostic, who have proven to be eerily similar players. Both can really shoot. Both can't guard. It's a problem when two of the highest-paid guys on the roster can't play at the same time. Tang has lamented the fact that both Tyreek Smith and Max Jones were unable to get a waiver to play this season. Those two would've helped immensely, but those were also risky propositions in the first place. Where is a judge in Manhattan, Kansas, when you need a Temporary Restraining Order?Kansas State cares deeply about basketball. It wants to be good, but apathy is starting to set in. It's hard to blame 'em when it's 44-15 Iowa State at the under-four media timeout in the first half. Grade: F\nAlso considered: Shaka Smart, Marquette\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grading 5 college basketball coaches from A-F: Fred Hoiberg shines, Jerome Tang disappoints - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/d30a89a0-e21e-40c8-a0c1-17b46521ec7a/thumbnail/1200x675/dacc8d82c9cdc9719c653a16bfcd6a28/jerome-tang.png"
      ],
      "datePublished": "2026-02-05T20:17:28.000Z",
      "dateModified": "2026-02-05T20:17:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl 2026 weather forecast: Conditions for Patriots vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-weather-forecast-patriots-seahawks-levi-stadium/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/5c4ba90e-21c5-49dd-a116-0c49121ce188/thumbnail/1200x675/0c24e6240b1797a94a58eb75ad73be37/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-02-05T16:58:20.000Z",
    "description": "\n        The stage is set for Super Bowl LX. The Seattle Seahawks and New England Patriots will battle at Levi's Stadium with the opportunity to hoist",
    "body": "\n        The stage is set for Super Bowl LX. The Seattle Seahawks and New England Patriots will battle at Levi's Stadium with the opportunity to hoist the Lombardi Trophy on the line. We know the teams, we know the venue and we know the stakes. But what about the weather?For the first time since Super Bowl LV at Raymond James Stadium in Tampa, Florida, the big game will be held outdoors. The elements were a nonfactor over the past four Super Bowls, which took place in stadiums with roofs. Super Bowl LVI was held at SoFi Stadium (open-air stadium, but with a roof), State Farm Stadium (retractable roof) fended off weather issues in Super Bowl LVII, and Allegiant Stadium (Super Bowl LVIII) and Caesars Superdome (Super Bowl LIX) are both true domes.This time around at Levi's Stadium, the weather will be something both Seattle and New England must account for.\n\n        \n            \n                Super Bowl's most expensive ticket: Here's the view $30,000 will buy you for Patriots-Seahawks\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nAccording to AccuWeather's forecast, Levi's Stadium in Santa Clara, California, is expected to see a high of 67 degrees on Super Bowl Sunday. That's slightly above average for the area, which typically sees temperatures around 62 degrees, and it was 56 degrees at this time last year. The record for the area is 78 degrees, set in 2016.\nThere will be areas of low clouds and fog early, with a chance of rain in the afternoon. AccuWeather's precipitation probability stands at 30%, with a 5% chance of thunderstorms. While small, the thunderstorm possibility is notable, as lightning in the area could trigger a delay if it occurs during the game.In the evening, temperatures will dip considerably to roughly 54 degrees.\nWhere to watch Super Bowl 60Date: Sunday, Feb. 8 | Time: 6:30 p.m. ETLocation: Levi's Stadium (Santa Clara, California)TV: NBCOdds: Seahawks -4.5, O/U 45.5 (via DraftKings Sportsbook)Follow: CBS Sports App \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl 2026 weather forecast: Conditions for Patriots vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/5c4ba90e-21c5-49dd-a116-0c49121ce188/thumbnail/1200x675/0c24e6240b1797a94a58eb75ad73be37/template-pic.jpg"
      ],
      "datePublished": "2026-02-05T16:58:20.000Z",
      "dateModified": "2026-02-05T16:58:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Houston coach Kelvin Sampson NIL recruiting rant: 'We're poor' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/houston-cougars-basketball-coach-kelvin-sampson-rant-on-nil-recruiting-transfer-portal-were-poor/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/d37f4d64-8ed4-4c51-bac4-007b9f9b6422/thumbnail/1200x675/521df381bda3aac878b9d55794e1e439/sampson.png",
    "tag": "Sports",
    "date": "2026-02-05T19:38:17.000Z",
    "description": "\n        Houston coach Kelvin Sampson says it's only a matter of time before the Cougars fail to keep pace with other elite programs in recruiting bec",
    "body": "\n        Houston coach Kelvin Sampson says it's only a matter of time before the Cougars fail to keep pace with other elite programs in recruiting because of his school's NIL situation, a factor he cites as an unfortunate reality for one of college basketball's non-bluebloods.After signing the nation's No. 3 class in the 2025 cycle, Sampson's eighth-ranked Cougars are 20-2 this season coming off an appearance in last year's national championship game, the program's sixth straight run in the NCAA Tournament to the second weekend or further.Sampson's long-winded NIL rant came after Wednesday night's 79-55 win over UCF.\"We participate in NIL like everybody else, we know what our kids' market value is,\" Sampson said. \"Trust me, they're not starving here. They're getting exactly what the market is for them. We have a very poor athletic department. We're poor. We're poor when I got here and we're still poor. We probably have the lowest budget of anybody in Power Four. \"The way our recruiting's going, we're going to have to stop it at some point because we don't have the money to keep bringing in good players. That's not easy for us to do. People ask about recruiting ... teams that have the best recruiting classes usually have the most money. That's the way it is today.\"\nPer Front Office Sports, men's college basketball players account for collectively 20.9% of revenue-sharing dollars for the average school in the 2025-26 academic year. Last summer's House v. NCAA settlement allows schools to share up to $20.5 million annually with athletes, most of which goes to football.While NIL and revenue share contracts are not public, if estimated figures are accurate at Houston, that would total around $4.3 million the Cougars would have to divvy up to their basketball roster. Some schools that are hoops-heavy likely have a larger portion of the pie earmarked for basketball.For context, Houston's football program won 10 games this season under second-year coach Wille Fritz and recently welcomed the nation's 44th-best recruiting class to campus.\nDuke, Michigan State and Kansas currently hold the top basketball classes for 2026. In the 2025 cycle, only Duke and Arizona were slotted ahead of Houston in recruiting.247Sports Director of Basketball Eric Bossi says there's a noticeable recent recruiting uptick at Houston under Sampson, who's been able to navigate the new era without much worry -- at least up to this point.\"Houston does a great job of identifying prospects who fit their mentality and their culture,\" Bossi said. \"And when you combine that with the success that they've had in developing guys for the NBA, particularly some lesser-known guys, like the Marcus Sassers of the world, their pitch has resonated and been effective with today's high school recruit, and they are able to get into some doors they previously were not able to.\n\"I don't think anything has particularly changed in their recruiting strategy. They have always cared about fit in terms of style of play and, more importantly, fit in the culture of the locker room and on a day-to-day basis in the program. They are going after the same type of guys. They are just able to do it at a higher level because of the success that they have been having.\"Sampson signed three of the nation's top 20-rated players last cycle and currently has the No. 16 and No. 55 overall prospects in tow for 2026, per 247Sports. That puts Houston at No. 24 nationally in recruiting for next year.\"We signed Ikenna (Alozie) and Arafan (Diane) for (2026) early, and a lot these kids we have will come back, but who knows who else we'll sign ... it depends on how much money we have,\" Sampson said. \"It's not about who we want to sign, it's who can we afford to sign? Even though we've been doing this NIL thing, it still feels funny for me to even say that. It's like a culture shock that it's even coming out of my mouth. \n\"For so many years, it's illegal to do that. It's legal now, that's why they call it NIL -- now it's legal.\"Sampson mentioned several depth pieces that Houston was able to retain this offseason, but there's no guarantee that level of commitment happens again after the current season.\"I never thought Mercy (Miller) would leave, but I'm around him every day, so I have an advantage because I coach him,\" Sampson said. \"It was a big deal he came back. It was a big deal for Chase (McCarty). Ramon (Walker Jr.) came back. Ced (Cedric Lath) came back. Jacob (McFarland). All our guys came back, so that helps us.\"\nSampson's 319-86 overall at Houston since taking over in 2014, which includes two trips to the Final Four.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Houston coach Kelvin Sampson NIL recruiting rant: 'We're poor' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/d37f4d64-8ed4-4c51-bac4-007b9f9b6422/thumbnail/1200x675/521df381bda3aac878b9d55794e1e439/sampson.png"
      ],
      "datePublished": "2026-02-05T19:38:17.000Z",
      "dateModified": "2026-02-05T19:38:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ayo Dosunmu trade grades: Timberwolves upgrade backcourt; Bulls lack long-term vision - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/ayo-dosunmu-trade-grades-timberwolves-bulls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/7d1ac794-0548-4fa8-b3b2-faab298f70f4/thumbnail/1200x675/b46f1d37dafdb68bc636611a381bd0e2/ayo-imagn.png",
    "tag": "Sports",
    "date": "2026-02-05T17:32:06.000Z",
    "description": "\n        For the second time in the span of three days, the Chicago Bulls and Minnesota Timberwolves have linked up for a trade involving guards. In t",
    "body": "\n        For the second time in the span of three days, the Chicago Bulls and Minnesota Timberwolves have linked up for a trade involving guards. In this deal, the Bulls are sending Ayo Dosunmu and Julian Phillips to the Wolves in exchange for Rob Dillingham, Leonard Miller and four second-round picks, according to ESPN. Previously, the Wolves sent Mike Conley Jr. to the Bulls (since flipped to the Charlotte Hornets) as part of a three-team deal involving the Detroit Pistons. As the two Midwestern squads continue to reshape their rosters -- for opposite reasons -- let's take a closer look at this latest deal with some trade grades. Timberwolves: B+The Wolves' backcourt concerns became obvious on opening night when Conley, who had been their steady starting point guard for the last two-plus seasons, came off the bench and only played 12 minutes. Now 38 years old, Conley was a shell of himself when he did get on the court. \nConley's decline opened up opportunities for the likes of Bones Hyland, Terrence Shannon Jr., Jaylen Clark and the aforementioned Dillingham, and Chris Finch gave all of them a shot in the first half of the season. Only Hyland has even come close to running with the opportunity, and even at his best he's a streaky offensive player. The 32-20 Wolves are coming off back-to-back Western Conference finals appearances and look like a formidable playoff team again. However, it's clear they need to upgrade their roster to get over the hump, which is why they've been desperate to jump into the Giannis Antetokounmpo sweepstakes. Aside from trying to acquire one of the best players in the world, they've also been looking to upgrade their backcourt situation, and finally settled on Dosunmu.A second-round pick back in 2021, Dosunmu has spent his entire career on a mediocre and uninteresting Bulls team, and has had to fight for playing time with the likes of DeMar DeRozan, Zach LaVine, Coby White and Josh Giddey, all of whom have garnered more attention.   \nDuring his time in Chicago, Dosunmu has steadily improved and is now one of the most underrated guards in the league. Through 45 appearances this season, he's averaging a career-high 15 points, three rebounds and 3.6 assists on 51.4/45.1/85.7 shooting splits. Dosunmu can run pick-and-roll, operate as a spot-up threat and loves to get out in transition, and that versatile skillset will make him a perfect fit for the Wolves. He can run their second unit and take on a good chunk of those playmaking responsibilities, but will also have no trouble playing next to Anthony Edwards and Julius Randle.  Additionally, Dosunmu boasts a 6-foot-8 wingspan and has the ability to be a pesky point-of-attack defender. He may not be on the same level as some of the Wolves' elite defenders such as Jalen McDaniels and Rudy Gobert, but he can hold his own.\nThe 26-year-old Dosunmu will be a free agent this summer, and you would expect the Wolves to re-sign him after giving up Dillingham, Miller and four second-round picks to acquire him. Crucially, they now have his Bird rights, which means they can go over the cap to sign him to a new deal. Dosunmu is a great pick-up for the Wolves, and will make them a much better team. If there's any slight criticism of the deal, it would be the aggregate cost of acquiring him. In 2023, the Wolves traded a Utah Jazz 2026 second-round pick and their own 2028 second-round pick to get Miller from the San Antonio Spurs. In 2024, they traded a 2030 first-round pick swap and an unprotected 2031 first-round pick to get Dillingham from the Spurs. Now they've sent both of them, along with four more second-round picks, to get Dosunmu. \nMiller and Dillingham never worked out, so it makes sense to move on and get someone who can help them in the playoffs this season and be a part of their rotation for years to come, but the all-in cost of an unprotected first-round pick, a first-round pick swap and six second-round picks for Dosunmu is steep. Bulls: C-The Bulls were well on their way to another 39-win season and a Play-In Tournament berth, but decided to change course this week and became sellers. Nikola Vučević, Coby White, Kevin Huerter and Dalen Terry have all been sent out in the last few days, and now Dosunmu is on the move. Chicago should have fully committed to this route years ago, and waiting until Vučević, White and Dosunmu, in particular, were on the final years of their contracts has limited what they could get in return. Additionally, the Bulls' long-term plan is unclear considering that they've acquired almost exclusively guards in these deals: Jaden Ivey, Anfernee Simons, Collin Sexton and now Dillingham. And they already have Josh Giddey and Tre Jones signed to long-term deals. \nIn a vacuum, the Dosunmu return is fine. He's a very nice player, but opting to trade him instead of giving him a big extension is an understandable decision. Dillingham is a former top 10 pick, Miller is still young enough that he's worth a flyer and four second-round picks are useful. However, it's impossible to consider the Dosunmu deal in a vacuum. The Bulls have already acquired three small guards this week, all of whom are better than Dillingham, the centerpiece of this deal. And, again, they have Giddey and Jones on the roster. Even if they only keep one of Ivey, Simons and Sexton for next season -- most likely Ivey -- Dillingham would be fourth on the backcourt depth chart with no clear pathway to earning significant playing time. And if they keep more than one, who knows when Dillingham ever gets on the court. The whole point of taking a shot on a \"second draft\" guy like Dillingham is to give them the opportunity they haven't previously received. But given the Bulls' logjam in the backcourt, it's hard to see how Dillingham gets that chance. \nThe Bulls' roster is going to look a lot different by the start of next season, so we'll see how everything shakes out, but this is a strange move in light of all their other trades. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ayo Dosunmu trade grades: Timberwolves upgrade backcourt; Bulls lack long-term vision - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/7d1ac794-0548-4fa8-b3b2-faab298f70f4/thumbnail/1200x675/b46f1d37dafdb68bc636611a381bd0e2/ayo-imagn.png"
      ],
      "datePublished": "2026-02-05T17:32:06.000Z",
      "dateModified": "2026-02-05T17:32:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lakers trade grades: L.A. gets needed shooting by landing Luke Kennard - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lakers-trade-grades-luke-kennard-hawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/9c5567d1-632a-4068-bd48-49b90a75b3b5/thumbnail/1200x675/1d0d2dfb66fd612e0d89127034302833/luke-kennard-getty.png",
    "tag": "Sports",
    "date": "2026-02-05T16:54:49.000Z",
    "description": "\n        Last year, the Los Angeles Lakers landed Luka Dončić at the NBA's trade deadline. The odds were always against them pulling off something sim",
    "body": "\n        Last year, the Los Angeles Lakers landed Luka Dončić at the NBA's trade deadline. The odds were always against them pulling off something similar at this year's deadline. They had only one first-round and one second-round pick to trade, in addition to a few first-round swaps. They are also set for significant cap space in the offseason, and seemingly didn't want to to disturb that space by taking on any long-term money.Their deadline was always going to be understated, limited in all likelihood to a move or two on the margins. And that's what we just got. According to ESPN, the Lakers have traded Gabe Vincent and a 2032 second-round pick to the Atlanta Hawks for sharpshooter Luke Kennard. With no second-round picks remaining, the Lakers are now largely out of ammunition to make significant additions. In other words, they likely have their team for the rest of the 2025-26 season and the playoffs. So let's grade the deal for both sides.\n                            \n    \n                                                \n                    \n    Lakers: C+Common sense dictated that the ideal way for the Lakers to spend this deadline cycle would have been improving their No. 24-ranked defense. Given their limited assets, though, doing so would have been impossible. If they were only trading a second-round pick, trading for defense would have amounted to putting lipstick on a pig. This team has no rim-protection. Its wings aren't good enough. Its three best offensive players are defensive negatives. The Lakers were never fixing this deadline with one second-round pick in a single deadline, and the sort of long-term difference-makers that might've been worth a first-round pick just weren't available in this cycle.So with that said... I understand the idea of leaning all the way into offense. Why not? It's the only way the Lakers are going to win, and it isn't nearly as good as it needs to be. Even with Dončić, LeBron James and Austin Reaves, the Lakers rank just ninth on offense. Yes, injuries are a part of that, but lineups featuring all three are scoring in the 20th percentile in terms of offensive efficiency among all lineups, according to Cleaning the Glass. Most of that is due to nonexistent offensive rebounding and too many turnovers, but shooting is a persistent problem for the Lakers.\nIf the season ended today, the Lakers would set a new NBA record for 2-point field goal percentage. The lead the NBA in free-throw rate by a margin that's the equivalent between second-place and ninth. But again, their offense is only good, not great, and shooting is a big reason for that. JJ Redick had visions of shooting 50 3s a game when he took this job. Yet the Lakers rank just 19th in 3-point attempt rate and 21st in 3-point percentage. If this team is going to be the offensive monster it hoped to be, it needed a quick injection of shooting. The Lakers hoped Dalton Knecht could be that player when they drafted him 17th in 2024. That hasn't panned out. Kennard leads the NBA in 3-point percentage this season. He's done so in two other seasons in his career, and 62.1% of his shots come from deep. The Lakers needed someone like this.\nAnd hey, sometimes a coach needs to be saved from himself when it comes to a favored role player. Vincent played too much. It's not exactly Redick's fault. His other options weren't exactly great. But his size was becoming a major problem on defense and his inability to do much of anything inside of the arc didn't help on offense either. The Lakers turned a player who wasn't really helping them into one who might. It's not franchise-altering, but for a single second-round pick and without taking on any long-term money, it's a reasonable bit of business.\n                            \n    \n                                                \n                    \n    Hawks: C+Atlanta is doing what a Play-In Tournament team probably should be doing: turning players who aren't pieces of the long-term core into draft picks. If the Hawks weren't going to re-sign Kennard after the season, and the addition of Corey Kispert suggested they weren't, getting a second-round pick for him now is a reasonable move. The cap mechanics of the move also make a lot of sense for Atlanta. The Hawks are acquiring Vincent with a $13.1 million trade exception that expired Thursday. In the process, that allowed them to create a new $11 million trade exception for Kennard that will last another year. They effectively bought themselves time to use that exception if they want.\n\n        \n            \n                Kristaps Porziņģis-Jonathan Kuminga trade grades: Warriors, Hawks take upside swings\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nStill, the Hawks have offloaded quite a bit of shooting at this deadline between Kennard and Vit Krejčí. I suppose the team wanted to clear some extra minutes for the newly acquired Jonathan Kuminga, but given the complete lack of shooting the Hawks have gotten out of Dyson Daniels, having Kennard around the space the floor a bit as they evaluate Kuminga might've been helpful. It's not the end of the world. Maybe Buddy Hield, acquired in the Kuminga deal, can occupy that same role, though he's been a far worse shooter than Kennard lately. The point of the Kuminga trade was to figure out if he'd look better under more favorable conditions than he had in Golden State, and cutting into the shooting around him doesn't exactly help on that front. Still a reasonable trade, just not a major win.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lakers trade grades: L.A. gets needed shooting by landing Luke Kennard - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/9c5567d1-632a-4068-bd48-49b90a75b3b5/thumbnail/1200x675/1d0d2dfb66fd612e0d89127034302833/luke-kennard-getty.png"
      ],
      "datePublished": "2026-02-05T16:54:49.000Z",
      "dateModified": "2026-02-05T16:54:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Emmanwori injury: Seahawks DB hurts ankle, says he's 'good to go' for Super Bowl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nick-emmanwori-injury-seahawks-patriots-super-bowl-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/4766fff2-7198-4b46-91fd-f40716f597d0/thumbnail/1200x675/e35d1271bfbc50b55dbfdec31f4ee241/nick-emmanwori2.jpg",
    "tag": "Sports",
    "date": "2026-02-05T20:17:13.000Z",
    "description": "\n        The Seattle Seahawks appear to have avoided a significant setback days before they face the New England Patriots in Super Bowl LX. Nick Emman",
    "body": "\n        The Seattle Seahawks appear to have avoided a significant setback days before they face the New England Patriots in Super Bowl LX. Nick Emmanwori, Seattle's standout rookie safety, was limited during Wednesday's practice after suffering a low ankle sprain. Despite the injury, Emmanwori said that he expects to play on Sunday. \"Feel good,\" he said during Thursday's media availability. \"Training staff has a good plan for me. ... I'll be good to go.\" Emmanwori rolled the ankle while defending a pass during Wednesday's practice. He walked off the field under his own power while being comforted by teammates and coaches, according to a pool report from the Pro Football Writers of America. \"He had an ankle, we brought him in to look at it, and we'll kind of go from here and figure out what are the next steps,\" Seahawks coach Mike Macdonald said Wednesday per the pool reporter on hand. \nOne of the NFL's top-performing rookies this season, Emmanwori has played a key role in Seattle getting to its third Super Bowl and first since the 2014 season. The 35th overall pick in last year's draft, Emmanwori started in 11 of Seattle's 14 regular season games. He tallied 81 tackles, 2.5 sacks, an interception and broke up 11 passes while helping the Seahawks boast the NFL's top-ranked scoring defense. Emmanwori recovered a fumble during Seattle's blowout win over the San Francisco 49ers in the divisional round and broke up three passes during the Seahawks' win over the Los Angeles Rams in the NFC Championship game. While Seattle has an experienced backup in safety Ty Okada, Emmanwori's versatility makes him a valuable commodity in Seattle's defense. \n        \n            \n                Prisco's pick for Seahawks vs. Patriots in Super Bowl 2026: Stout Seattle defense shuts down New England\n                \n                    Pete Prisco                \n            \n                            \n    \n                \n                    \n    \nFour other Seahawks were limited in practice on Wednesday, including quarterback Sam Darnold, who has been nursing an oblique injury he suffered in practice on Jan. 15. Darnold has been limited in each practice since injuring the oblique, and Macdonald said his quarterback is \"right on schedule.\"\n\"We've had this plan here over the last X amount of weeks, and it varies every day,\" Macdonald told the PFWA pool reporter. \"And today he had a great day, so we're right on schedule.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Emmanwori injury: Seahawks DB hurts ankle, says he's 'good to go' for Super Bowl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/4766fff2-7198-4b46-91fd-f40716f597d0/thumbnail/1200x675/e35d1271bfbc50b55dbfdec31f4ee241/nick-emmanwori2.jpg"
      ],
      "datePublished": "2026-02-05T20:17:13.000Z",
      "dateModified": "2026-02-05T20:17:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl 60: Seahawks-Patriots cross-sport props picks vs. NBA players - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/super-bowl-60-seahawks-vs-patriots-cross-sport-props-picks-vs-karl-anthony-towns-other-nba-stars-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/e6cf419f-e187-416f-980b-94415be41fec/thumbnail/1200x675/c25699557aef641167ccffd1e0b6707a/knicks-karl-anthony-towns-imagn.png",
    "tag": "Sports",
    "date": "2026-02-05T17:50:38.000Z",
    "description": "\nConsidering my Chicago Bears have been in the Super Bowl only twice all-time and not in two decades (sigh), my focus on the big game is usually all t",
    "body": "\nConsidering my Chicago Bears have been in the Super Bowl only twice all-time and not in two decades (sigh), my focus on the big game is usually all the excellent cross-sport props provided by the various sportsbooks. I use those a lot personally on a daily basis as I'm a money line favorite bettor and generally pair two higher-priced plays into one cheaper one. For Sunday's Super Bowl 60 between the Seahawks and Patriots from Levi's Stadium in Santa Clara, I let DraftKings do the heavy lifting in that regard. The book also offers cross-sport props with this weekend's WM Phoenix Open on the PGA Tour as well as a few tie-ins with European soccer matches Sunday, but I'll stick with that day's NBA games. If any NBA players are scratched due to injury or rest, then all bets would be void. James Harden being traded to from L.A. to Cleveland eliminated one option. All those NBA games -- ditto college basketball, while the NHL is on its Olympic break -- will be well finished by the 6:30 ET kickoff in a rematch of Super Bowl 49 won by the Patriots 28-24 in Glendale on that memorable last-minute goal-line interception from Russell Wilson. Incidentally, 28-24 in favor of Patriots again is taking the most action at DraftKings on the correct score market. That remains the only 28-24 result in the game. The SportsLine Projection Model forecasts a 24-20 final in favor of Seattle. \nPatriots points (+100) vs. Karl Anthony Towns points (-110)Towns and the Knicks are in Boston on Sunday for an ABC national TV game at noon ET. A not unimportant game, either, in terms of a possible playoff tiebreaker with the Knicks and Celtics jockeying for the second seed in the East behind Detroit. New York reportedly listened to trade offers on KAT but stood pat. He is averaging 19.9 points per game, Towns' fewest since his 2015-16 rookie season with Minnesota. His overall shooting (46.5%) and 3-point shooting (35.6%) are way down from last year. But Towns is averaging 27.5 PPG in two contests against Boston this season. New England's team total  is 19.5. Led by possible NFL MVP Drake Maye, the Patriots averaged 28.8 points in the regular season against one of the easiest slates in recent history, but that number is down to 18.0 PPG in the playoffs and Maye is dealing with a sore shoulder. Seattle led the NFL in allowing 17.2 points during the regular season, becoming the first team with the No. 1 scoring defense to reach the Super Bowl since the 2016 Patriots. In the postseason, the Seahawks are down to 16.5 PPG allowed.Pick: Towns\nJaxon Smith-Njigba catches (+110) vs. Jaylen Brown rebounds (+110)Seattle's breakout star Smith-Njigba, likely to be named NFL Offensive Player of the Year at the NFL Awards show Thursday, became only the fifth player in league history to lead the NFL in receiving yards and reach the Super Bowl. The previous four all won. As for receptions, JSN was fourth this season with 119 catches (averaged 7.0 per game) and fifth in targets with 163. In two playoff games, he has 13 catches. Smith-Njigba will likely be shadowed by the NFL's top cornerbacks in Patriots Pro Bowler Christian Gonzalez. In 14 regular season games, quarterbacks threw his way 62 times and completed just 21 passes. Smith-Njigba's season low is two catches and his high 10 if we include the postseason. His receptions prop line on Sunday is 6.5. Brown and the Celtics are at Madison Square Garden for that noon tip Sunday as we mentioned above with the All-Star having a career season – including a career-best 7.0 rebounds per game. The C's did add some size at the trade deadline in Bulls center Nikola Vucevic (9.0 RPG), so perhaps that eliminates a couple of rebound opportunities for Brown going forward. Brown's season high is 13 rebounds and his low is two. He is averaging 4.0 rebounds in two games this season vs. New York. A tie is +800 and certainly possible, but I'll never bet a tie or draw.Pick: Smith-Njigba\nDrake Maye rush yards (-105) vs. Anthony Edwards PRA (-110) PRA is shorthand for points + rebounds + assists in case you are new to this, and Minnesota Timberwolves superstar Anthony Edwards is averaging 29.7 points, 5.3 rebounds and 3.7 assists per game for a PRA of 38.7. But \"Ant\" is capable of a 40-point night at any time and had 39 as recently as Monday in Memphis. His Timberwolves host the Clippers at 3 p.m. ET Sunday. That should mean Edwards is guarded by one of the great defenders in modern history in Kawhi Leonard, even if he's not quite what he used to be. And Kawhi is always a possibility to miss a game. These teams have met once this season, a 109-106 Wolves home win on Dec. 6. Edwards had an off night at 3-for-11 from the field for 15 points along with six boards and four assists. Leonard played in that one. Might the Patriots' Maye run a bit more in the Super Bowl with that injured shoulder? Maye averaged 26.5 rush yards during the regular season but is up to 47.0 YPG in the postseason. His 141 rush yards in this postseason are more than Tom Brady had in his playoff career (133), by the way. In the regular season, that terrific Seattle defense allowed just 6.7 yards per quarterback scramble, ranking 11th in the league. In the playoffs, opposing attempts have 57 yards on seven plays, averaging 8.1 yards per. Maye's Over/Under rush total Sunday is 38.5 yards.Pick: Edwards\nMack Hollins receiving yards (-105) vs. Kawhi Leonard points (-110)As noted above, Leonard and the Clippers are in the Twin Cities on Sunday afternoon. Leonard's offensive usage should be off the charts after James Harden was traded to Cleveland on Tuesday. Leonard looks as good as ever offensively at age 34, averaging a career-high 27.6 points and with a shot at a rare 50/40/90 season as he's shooting 49.7% from the field, 39.1% from deep and 91.3% from the charity stripe. He has scored at least 20 points in a career-high 29 straight games, the second-longest active streak in the league. In his lone game this season against the Timberwolves, he had 20 points. The Super Bowl often has some unsung heroes and maybe New England journeyman wideout Mack Hollins will be that guy. The 32-year-old, on his fifth different team in five years and sixth overall in the league, had one of his best seasons with 46 catches for 550 yards in 15 games, an average of 36.7 yards per. He missed about a month late with an abdomen injury and didn't return until the AFC title game when he led the Patriots with 51 yards receiving (on just two catches) in that defensive slugfest. Hollins's receiving yards prop line is set at 26.5 yards Sunday, and the SportsLine Projection Model has him at 31 yards.Pick: Hollins\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl 60: Seahawks-Patriots cross-sport props picks vs. NBA players - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/e6cf419f-e187-416f-980b-94415be41fec/thumbnail/1200x675/c25699557aef641167ccffd1e0b6707a/knicks-karl-anthony-towns-imagn.png"
      ],
      "datePublished": "2026-02-05T17:50:38.000Z",
      "dateModified": "2026-02-05T17:50:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots Super Bowl wins ranked: Where Super Bowl LX would fit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-super-bowl-wins-ranked-super-bowl-lx/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/6c03144c-ab23-4a78-9b27-0fedb1058a9c/thumbnail/1200x675/525e5f16c9d9cfaa2fcf9e94a305ca2a/patriotsramssuperbowl.jpg",
    "tag": "Sports",
    "date": "2026-02-05T20:08:00.000Z",
    "description": "\n        The New England Patriots are not hurting for championship memories.This Sunday will mark the 12th Super Bowl the Patriots have participated i",
    "body": "\n        The New England Patriots are not hurting for championship memories.This Sunday will mark the 12th Super Bowl the Patriots have participated in, with six Lombardi Trophy wins of all varieties -- shocking victories, underdog wins, epic comebacks and strong defensive battles.Former Patriots quarterback and seven-time Super Bowl champion Tom Brady was known for saying his favorite ring was the \"next one\" when asked to pick one that stood out. But if he, or Patriots nation, or owner Robert Kraft had to choose, how would the wins rank? And where would Super Bowl LX fit into those rankings if the Patriots defeat the Seattle Seahawks?While punching a ticket to AFC Championship was practically a yearly tradition for a while and Super Bowl trips were not scarce, even the most confident New England resident didn't predict the Patriots would make a Super Bowl return this year. The pure shock factor and unlikeliness of the season is why, if they win, it would rank quite high as far as Super Bowl go.Here's a look at where it would rank and where the other Super Bowl wins rank as well:\n1. Super Bowl XXXVI: Patriots (20) vs. Rams (17), 2002Just like this year's team, that Patriots team was not expected to make it to the big game, never mind win it all. They had missed the playoffs the two years prior, were coming off a five-win season, had a fairly new head coach (with Bill Belichick being in his second year) and were led by a second-year quarterback who seemed to have a lot of talent but still needed to prove himself under the bright lights and against an excellent team. Sound familiar?The Rams, then in St. Louis, were \"The Greatest Show on Turf\" led by MVP quarterback Kurt Warner. The Patriots weren't supposed to win that game and the Rams were 14-point favorites. The Rams had made the Super Bowl twice in three seasons and had far more experience than the team led by draft pick No. 199. The game was tied at 17-17 with 1:30 left and from the booth John Madden said it would be wise for the Patriots to play for overtime, rather than try for a win and have it potentially backfire with a Rams takeaway. \n\"You have to run the clock out and play for for overtime here,\" Madden said. Belichick and offensive coordinator Charlie Weis decided to take the risk. With seven seconds left, Adam Vinatieri sunk a 48-yard kick to continue his legend. Tom Brady and Bill Belichick celebrating their first Super Bowl win as QB and head coach.  \n                                                                    Getty Images\n                                                            This Super Bowl has to rank No. 1, because it was the one that started it all. It kicked off Brady and Belichick's (eventual) Hall of Fame career, began the first of their dynasties and was the first championship win in franchise history. The road to get to the game was just as iconic as the Super Bowl itself, with the \"Tuck Rule\" game still haunting Raiders fans. This Super Bowl also changed how teams were introduced. Up until then, NFL teams introduced their players individually, but Belichick told the league he wanted his team to run out together. The NFL didn't initially agree, but Belichick is known to push for his way, and did so here. Now teams are traditionally introduced as a unit. Super Bowl XXXVI gets the top spot because it set the precedent for the team's identity and catapulted numerous careers.\n2. Super Bowl LI: Patriots (34) vs. Falcons (28) OT, 2017The comeback game earns its rightful spot at No. 2. This game didn't start or close a dynasty, but the greatest comeback in Super Bowl history -- 28-3! -- cannot be overlooked.The season began with Brady serving a four-game suspension for the Deflategate scandal. Quarterbacks Jimmy Garoppolo and Jacoby Brissett got the team to 3-1 in his absence. Brady returned with a vengeance, putting up Pro Bowl numbers and leading the team to an NFL-record ninth Super Bowl appearance.The Patriots were three-point favorites and were the No. 1 seed in the AFC, but didn't look like it through three quarters against the explosive Falcons. Down 28-3 with 2:12 left in the third quarter, the Falcons felt like they had it, so much so that their owner came down to the field to begin the celebration. On the other side of the field was a fired-up Julian Edelman, telling an equally locked in Brady that the game was \"going to be a hell of a story.\" And one hell of a story it was.\nThe Falcons didn't score again and thanks to some incredible catches, a strip sack on Falcons quarterback Matt Ryan and the composure of a team battle-tested postseason team forcing the first overtime in Super Bowl history. A touchdown by running back James White in OT sealed the team's fifth Lombardi Trophy. 3. Super Bowl LX: Patriots vs. Seahawks, 2026If the Patriots defeat the Seahawks on Sunday, I would put the victory as No. 3 all-time. It may seem a little high, but let's dive into why this win would be so significant. All the Patriots' Super Bowl wins came in the Brady-Belichick era, and to get back without them felt like a large task and one that wouldn't come any time soon. From 2020 through 2024, Patriots fans finally got to see how the other half lives. I mean, there are six-year-olds in New England that have never seen the Patriots win a championship. A horror, if you ask them. \nThe Patriots were not even supposed to be that good this year. Better than last year, sure, thanks to a new head coach, a full year of quarterback Drake Maye and building through the draft and free agency, but not Super Bowl-good. Some fans and media went out on a limb this offseason and predicted the Patriots would make the playoffs, which at the time was viewed by some others as a reach after consecutive 4-13 seasons. A Week 1 home loss against the Raiders was an awful sign. A few months later, though, and this is already the largest turnaround in NFL history. New England is 17-3. Mike Vrabel is on the doorstep of being the fifth coach to win a Super Bowl in his first season with the team. A win Sunday would break a tie with Pittsburgh for most Super Bowl wins by a franchise. It would also make Maye the youngest starting quarterback to ever win a Super Bowl. There is doubtless Patriots fatigue, but this is historic stuff and it's coming out of left field. \n        \n            \n                Former Patriots teammate rips Tom Brady for not picking New England in Super Bowl LX: 'That's bullcrap'\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nLike in their first Super Bowl with Brady, most aren't expecting the Patriots to win this game. Seattle is a 4.5-point favorite and looks like the best team in football. A New England win would quiet those who believed the Patriots only made the big game due to an easy schedule and their circumstances, like playing against a backup QB in the AFC Championship.\n4. Super Bowl XXXIX: Patriots (24) vs. Eagles (21), 2005The Patriots secured their first dynasty with a victory over the Eagles to conclude the 2003 season. It marked their third Super Bowl win in four years, becoming just the second team (Cowboys) to accomplish this feat. Brady and Belichick were already a massive threat to the league and hoisting their third Lombardi Trophy cemented their elite status.Brady's 37 completions set a Super Bowl record and was historically significant for other reasons. He crossed the mark of 13 total touchdown passes in the Super Bowl passed Joe Montana's career record, and it also positioned Brady in the \"GOAT\" conversation because the win put him just one ring shy of Montana. New England's defense stepped up in the game as well, forcing four turnovers. This game was a quintessential Patriots win, using all three phases of the game to pull of a victory. New England lost its next two Super Bowls after this, both to the Giants, and would not win again until ...\n5. Super Bowl XLIX: Patriots (28) vs. Seahawks (24), 2015\"Malcolm go!\" is a phrase that immediately excites Patriots fans and deflates Seahawks fans. These teams were evenly matched and were both top seeds in their respective conferences. This game could arguably go higher just based on how infamous the Seahawks' final play was, but I put the Eagles win ahead because it completed a dynasty and made history.Back to that final play I mentioned. The Seahawks had the ball on the one-yard line with less than a minute to go, down 28-24. A score felt given and wouldn't leave the Brady much time to take back the lead. With one of the greatest running backs in the league Marshawn Lynch, it seemed obvious that quarterback Russell Wilson would hand the ball to him, take the lead and win the game. Instead, the Patriots noticed a formation they went over in practice, sent Malcolm Butler onto the field and when Wilson threw the ball, it landed in Butler's arms with devastating consequences. \nThis was the Patriots' first Super Bowl in 10 years. 6. Super Bowl LIII: Patriots (13) vs. Rams (3), 2019This is referred to as a \"boring\" Super Bowl by many and while it wasn't high-scoring or a fun watch for your Super Bowl parties, it did have its appeal. Its lack of scoring is why it's low on the list at No. 6 among our hypothetical seven, but it closed the loop as being Brady and Belichick's final Super Bowls together and thus should not be ranked last. A few neat notes: It tied the Steelers for most Super Bowl wins by a franchise, made Brady (41) and Belichick (66) the oldest starting quarterback and head coach to win a Super Bowl and, gratifying for the age-defying Brady, awarded him the honor of being the first quarterback to win one in his 40s. Two years later and two years older, he'd win another one for the Buccaneers. The game was a rematch Super Bowl XXXVI and seemed fitting that the last championship in that era was the same as their first.  Other fanbases may look down on the lowest-scoring Super Bowl of all time, but Patriots fans have a soft spot for this one. \n7. Super Bowl XXXVIII: Patriots (32) vs. Panthers (29), 2004This was an exciting back-and-forth game and is certainly not one to be forgotten, it just doesn't have the same punch some of the other wins have. This was the Patriots' second Super Bowl win, coming just two years after their first. This time, the Patriots were the favorites.It was the first Super Bowl with two scoreless quarters, coming in the first and third and the teams combined for 37 points in the fourth quarter. This didn't lack juice and is considered one of the most riveting games by the general public, but the other Super Bowls had more of an impact on the franchise itself.Adam Vinatieri was as clutch as ever and kicked a 41-yard field goal with four seconds left to win the game. Brady got his second Super Bowl MVP honor. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots Super Bowl wins ranked: Where Super Bowl LX would fit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/6c03144c-ab23-4a78-9b27-0fedb1058a9c/thumbnail/1200x675/525e5f16c9d9cfaa2fcf9e94a305ca2a/patriotsramssuperbowl.jpg"
      ],
      "datePublished": "2026-02-05T20:08:00.000Z",
      "dateModified": "2026-02-05T20:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Super Bowl preview - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/the-ultimate-super-bowl-lx-fantasy-football-preview-position-by-position-breakdown-dfs-lineups-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/1efc2e90-8a5a-4fd0-aac7-c76923802199/thumbnail/1200x675/7f43fab9815e8b9243531aeffa0b2f32/getty-rashid-shaheed-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-02-05T17:36:30.000Z",
    "description": "\n        Super Bowl LX is finally here, and it feels like an eternity has passed since we were talking about training camp and planning for our Fantas",
    "body": "\n        Super Bowl LX is finally here, and it feels like an eternity has passed since we were talking about training camp and planning for our Fantasy drafts. The 2025 season ends Sunday with the Patriots against the Seahawks, and I hope it's an exciting game.Here, we have you covered with all the information you need about the main offensive players for New England and Seattle. You can see the matchups for each player and what they've done recently, and hopefully it's an asset for any playoff challenge you're still in.I also have several lineup suggestions on DraftKings and FanDuel for the Super Bowl. Remember, with one game, we're looking at a showdown lineup, which includes a Captain spot on DraftKings and an MVP spot on FanDuel. The pricing changes for the Captain spot on DraftKings, and both positions are worth 1.5 more points with their scoring.Hopefully, you'll have a profitable Super Bowl to end your Fantasy campaign, and I hope we'll be talking about this game for many years to come. Good luck, and enjoy Super Bowl LX on Sunday.\nQuarterbackDrake MayeMaye is dealing with a shoulder injury, but he should be fine for the game. He's struggled in the NFL playoffs as a Fantasy quarterback with 20.2 points or less in three games against the Chargers, Texans and Broncos. Those are tough matchups, but Maye did have three passing touchdowns against Houston, as well as rushing for 66 yards against the Chargers and 65 yards against Denver. The Seahawks shut down Brock Purdy in the Divisional Round with just 5.3 Fantasy points, but Matthew Stafford had 34.6 Fantasy points against Seattle in the NFC Championship Game. For the season, the Seahawks were No. 8 in fewest Fantasy points allowed to opposing quarterbacks.Sam DarnoldDarnold is coming off one of the best games of his career in the NFC Championship Game against the Rams with 32.7 Fantasy points. He was at 10.9 Fantasy points or less in each of his previous three games, and we'll see how he does against this New England defense. The Patriots defense has been hot in the playoffs in shutting down Justin Herbert, C.J. Stroud and Jarrett Stidham, who combined for two touchdowns and five interceptions. Those three quarterbacks also scored 10.1 Fantasy points or less. Now, clearly, that's not the most impressive trio of quarterbacks, but New England also finished No. 5 in fewest Fantasy points allowed to opposing quarterbacks for the season. Running backRhamondre StevensonStevenson had a down game at Denver in the AFC Championship Game with just 7.1 PPR points, but he dominated the workload with 25 carries for 71 yards and no catches on two targets. Prior to facing the Broncos, Stevenson had scored at least 12.1 PPR points in five games in a row, and he had six total touchdowns over that span. He also had three games with at least three receptions during that stretch. Seattle finished the season No. 7 in fewest Fantasy points allowed to opposing running backs, and the Seahawks limited Christian McCaffrey in the Divisional Round of the NFL playoffs with 11 carries for 35 yards and five catches for 39 yards on six targets. Kyren Williams (14.1 PPR points) and Blake Corum (10.9 PPR points) had a better game against Seattle in the NFC Championship Game with a combined 19 carries for 94 yards and five catches for 46 yards and a touchdown on five targets. Stevenson will likely share some work with TreVeyon Henderson, but Stevenson is clearly the top running back for New England in this game.\nTreVeyon HendersonHenderson has disappeared during the NFL playoffs with a combined 24 carries for 57 yards and two catches for 7 yards on two targets in three games. He's been overshadowed by Stevenson, and Henderson was limited to three carries for 5 yards and no targets in the AFC Championship Game against the Broncos. Kenneth Walker IIIWalker has played the past two games with Zach Charbonnet (ACL) injured, and Walker has dominated. Charbonnet was injured in the Divisional Round against the 49ers, and Walker had 35.5 PPR points. He also had a standout game against the Rams in the NFC Championship Game with 21.1 PPR points. This is now basically three full games for Walker without Charbonnet this season (he missed Week 3 against New Orleans with a foot injury), and Walker has scored at least 18 PPR points in each outing. In those three games, Walker has six rushing touchdowns, and he has seven catches for 78 yards on seven targets in his past two contests against the 49ers and Rams. The Patriots are tough to run on with defensive lineman Milton Williams on the field. In the past four games against Miami, the Chargers, Houston and Denver since Williams returned from a five-game absence with an ankle injury, those backfields have combined for 71 carries for 148 yards and no touchdowns and 13 catches for 75 yards and no touchdowns on 20 targets. And in the first 11 games of the season when Williams was healthy, the Patriots allowed just two rushing touchdowns to running backs. George HolaniHolani replaced Charbonnet in the NFC Championship Game after missing the previous seven games with a hamstring injury. Holani was the backup to Walker and had three carries for 4 yards and three catches for 27 yards on four targets. He will play behind Walker again in the Super Bowl.\nWide receiverStefon DiggsThrough three playoff games against the Chargers, Texans and Broncos, Diggs has combined for 11 catches for 73 yards and one touchdown on 17 targets. His best game was against Houston with 14 PPR points because he found the end zone, and that was just his second touchdown since Week 10. Seattle finished the season No. 5 in fewest Fantasy points allowed to opposing receivers, but the Seahawks just struggled against the Rams in the NFC Championship Game after Puka Nacua and Davante Adams combined for 13 catches for 254 yards and two touchdowns on 22 targets, and each guy scored at least 18.9 PPR points. In the Divisional Round, the 49ers receivers struggled with a combined three catches for 24 yards on 10 targets. Diggs last played Seattle in Week 9 of the 2020 season and had nine catches for 118 yards on 12 targets when he was with Buffalo.Kayshon BoutteBoutte struggled in the AFC Championship Game at Denver with one catch for 6 yards on six targets, but he played well in the two previous playoff games against the Chargers and Texans with a combined seven catches for 141 yards and a touchdown on nine targets. The Broncos game was the first one all season where Boutte had at least five targets and didn't score at least 13.5 PPR points, and he reached that total in five other outings in 2025.Mack HollinsHollins returned from a four-game absence with an abdomen injury in the AFC Championship Game and had two catches for 51 yards on two targets at Denver. Prior to getting hurt, he was a go-to option for Maye with 17 targets in two games combined against Buffalo and Baltimore in Weeks 15 and 16, and he finished the Ravens game with seven catches for 69 yards on nine targets. For the season, Hollins had six games with at least five targets, and he scored at least 13.9 PPR points in three of them.\nDemario DouglasDouglas scored a touchdown in the Divisional Round against Houston, but he hasn't had more than three targets or three catches in a game since Week 9. He has only scored double digits in PPR three times all season. In the AFC Championship Game, Douglas had no catches on just one target against the Broncos.Jaxon Smith-NjigbaSmith-Njigba had a relatively quiet three-game stretch before exploding in the NFC Championship Game against the Rams with 10 catches for 153 yards and a touchdown on 12 targets. Prior to that, he had scored 16.2 PPR points or less in three games in a row, which was well below his season average of 21.2 PPR points. Including the playoffs, Smith-Njigba had 10 games with at least 10 targets, and he averaged 25.1 PPR points over that span. He should get plenty of chances to make plays in the Super Bowl, although it's not an easy matchup against the Patriots, who finished the season at No. 11 in fewest Fantasy points allowed to opposing receivers. Smith-Njigba should see a lot of New England cornerback Christian Gonzalez, and Courtland Sutton (10.7 PPR points) and Ladd McConkey (6.2 PPR points) have struggled against the Patriots in the playoffs. That said, Smith-Njigba was the No. 2 Fantasy receiver this season behind only Nacua, and he should continue to make plays in this game despite the tough coverage.Cooper KuppThere were only two times this season where Kupp had back-to-back games with double digits in PPR, and one of them just happened in the playoffs against the 49ers and Rams. He had five catches for 60 yards on five targets against San Francisco in the Divisional Round and four catches for 36 yards and a touchdown on six targets against Los Angeles in the NFC Championship Game. Kupp is a former Super Bowl MVP when he helped the Rams beat the Bengals in Super Bowl LVI at the end of the 2021 season with eight catches for 92 yards and two touchdowns on 10 targets. \nRashid ShaheedShaheed has made two splash plays in the playoffs thus far with a 95-yard kickoff return for a touchdown against the 49ers in the Divisional Round and one catch for 51 yards on three targets against the Rams in the NFC Championship Game. He has been held to one catch or less in five games in a row, and he has three games over that span with just one target in each outing. He hasn't scored a touchdown on offense since Week 5 when he was with the Saints, and in 11 games in Seattle, including the playoffs, Shaheed has only scored double digits in PPR just twice. Shaheed played the Patriots in Week 6 when he was still with New Orleans, and he had four catches for 28 yards on six targets. Jake BoboIn two playoff games against the 49ers and Rams, Bobo has two catches for 33 yards and a touchdown on three targets. Prior to the playoffs, Bobo had two catches for 20 yards on two targets for the entire season. It's doubtful that his role expands in the Super Bowl, but it would be fun if he can find the end zone for the second time all year against the Patriots.Tight endHunter HenryHenry did well in the first playoff game for the Patriots against the Chargers in the Wild-Card Round with three catches for 64 yards and a touchdown on five targets. In the past two games against Houston and Denver, Henry has combined for just three catches for 17 yards on five targets, but those were difficult matchups. Seattle finished the season No. 10 in most Fantasy points allowed to opposing tight ends. And in the playoffs, Jake Tonges (five catches for 59 yards on six targets) and Colby Parkinson (three catches for 62 yards on four targets) each made an impact against the Seahawks, which bodes well for Henry in the Super Bowl.\nA.J. BarnerBarner has been quiet in the NFL playoffs with a combined two catches for 13 yards and no touchdowns on three targets against the 49ers and Rams. And he only has two touchdowns since Week 5. The Patriots finished the season at No. 17 in Fantasy points allowed to opposing tight ends and have done well against the position in the playoffs. In three games against Oronde Gadsden II, Dalton Schultz and Evan Engram, New England has allowed a combined seven catches for 96 yards and no touchdowns on eight targets. The Patriots also haven't allowed a touchdown to a tight end in five games in a row.DFS LineupsDraftKingsCAPTAIN: Jaxon Smith-Njigba $17,400FLEX: Sam Darnold $10,800FLEX: Rhamondre Stevenson $8,800FLEX: Cooper Kupp $5,200FLEX: Rashid Shaheed $4,200FLEX: Jake Bobo $1,600CAPTAIN: Drake Maye $16,500FLEX: Rhamondre Stevenson $8,800FLEX: Stefon Diggs $8,600FLEX: Hunter Henry $7,000FLEX: Kayshon Boutte $5,600FLEX: Jake Bobo $1,600CAPTAIN: Rhamondre Stevenson $13,200FLEX: Drake Maye $11,000FLEX: Sam Darnold $10,800FLEX: Kenneth Walker III $9,800FLEX: Mack Hollins $3,600FLEX: Jake Bobo $1,600CAPTAIN: Kenneth Walker IIIFLEX: Drake Maye $11,000\nFLEX: Stefon Diggs $8,600FLEX: Hunter Henry $7,000FLEX: Rashid Shaheed $4,200\nFLEX: Mack Hollins $3,600CAPTAIN: Sam Darnold $16,200FLEX: Jaxon Smith-Njigba $11,600\nFLEX: Hunter Henry $7,000FLEX: Cooper Kupp $5,200FLEX: A.J. Barner $4,800FLEX: Rashid Shaheed $4,200FANDUELMVP: Jaxon Smith-Njigba $19,500FLEX: Drake Maye $12,600FLEX: Sam Darnold $11,800FLEX: Mack Hollins $6,400FLEX: Rashid Shaheed $5,800FLEX: Jake Bobo $3,400MVP: Drake Maye $18,900FLEX: Rhamondre Stevenson $10,400FLEX: Stefon Diggs $9,600FLEX: Hunter Henry $7,600FLEX: Kayshon Boutte $7,200FLEX: Rashid Shaheed $5,800MVP: Sam Darnold $17,700FLEX: Jaxon Smith-Njigba $13,000FLEX: Stefon Diggs $9,600FLEX: Cooper Kupp $8,600FLEX: Rashid Shaheed $5,800FLEX: A.J. Barner $5,200MVP: Rhamondre Stevenson $15,600FLEX: Drake Maye $12,600FLEX: Sam Darnold $11,800FLEX: Kenneth Walker III $11,200FLEX: A.J. Barner $5,200FLEX: Jake Bobo $3,400MVP: Kenneth Walker III $16,800FLEX: Drake Maye $12,600FLEX: Stefon Diggs $9,600FLEX: Hunter Henry $7,600FLEX: Mack Hollins $6,400FLEX: Rashid Shaheed $5,800\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Super Bowl preview - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/1efc2e90-8a5a-4fd0-aac7-c76923802199/thumbnail/1200x675/7f43fab9815e8b9243531aeffa0b2f32/getty-rashid-shaheed-seahawks.jpg"
      ],
      "datePublished": "2026-02-05T17:36:30.000Z",
      "dateModified": "2026-02-05T17:36:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]