[
  {
    "title": "Ryder Cup 2025: Tom Watson 'ashamed' of fan behavior at Bethpage, congratulates Europe for victory - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/golf/news/ryder-cup-2025-tom-watson-ashamed-of-fan-behavior-at-bethpage-congratulates-europe-for-victory/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/617a6019-3624-4d8d-86a1-cc4ab41a5e95/thumbnail/1200x675/dc1d0a3a452edefc1f11a6864d9f0d7f/adobe-express-file-13.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:37:59.000Z",
    "description": "Rory McIlroy and the rest of the European team overcame the hostility of a number of unruly fans at the 2025 Ryder Cup to defeat the United States in a rout. The lopsided results over the weekend at Bethpage...",
    "body": "<div>\n        <p>Rory McIlroy and the rest of the European team overcame <a target=\"_blank\" href=\"https://www.cbssports.com/golf/news/rory-mcilroy-proud-to-win-with-what-we-had-to-go-through-after-difficult-day-with-fans-at-2025-ryder-cup/\">the hostility of a number of unruly fans</a> at the 2025 Ryder Cup to defeat the United States in a rout. The lopsided results over the weekend at Bethpage Black set a segment of an already boisterous crowd over the line, and former United States Ryder Cup captain Tom Watson spoke out against the behavior.</p><p>The disruptive and at times insulting taunts from a minority of fans prompted the event to increase its police presence and security detail as the weekend progressed.</p><p>\"I'd like to congratulate @RyderCupEurope on their victory,\" <a target=\"_blank\" href=\"https://x.com/TomWatsonPGA/status/1972670995224834528\">Watson said on social media</a>. \"Your team play the first few days was sensational. More importantly, I'd like to apologize for the rude and mean-spirited behavior from our American crowd at Bethpage. As a former player, Captain and as an American, I am ashamed of what happened.\"</p><a href=\"https://www.cbssports.com/golf/news/2025-ryder-cup-everything-rory-mcilroy-said-about-verbal-abuse-from-fans-at-bethpage-after-europes-victory/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>2025 Ryder Cup: Everything Rory McIlroy said about verbal abuse from fans at Bethpage after Europe's victory</p>\n                <p>\n                    Robby Kalland                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"2025 Ryder Cup: Everything Rory McIlroy said about verbal abuse from fans at Bethpage after Europe's victory\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/b244f495-7056-4e30-bcac-3cfb2c8681fc/thumbnail/270x152/b1388e9c299d27c3a4e451cd581c23a4/rory-erica.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>McIlroy took exception to the nature and timing of the jeers, which were mostly targeted toward him as the European captain. He was seen on Friday <a target=\"_blank\" href=\"https://x.com/jamescolgan26/status/1971669997362860148\">giving an apparent crude gesture</a> to the crowd, and on Saturday, <a target=\"_blank\" href=\"https://x.com/BPINewsOrg/status/1971954704914804785\">he cursed toward the crowd</a> before a shot from the rough and refused the putt until fans quieted down during his backswing. A PA announcer even stepped down from her role after leading a vulgar chant directed towards McIlroy.</p>\n<p>McIlroy's wife, Erica, was also a target of the obnoxious behavior. A fan after Saturday's round threw a beverage at the McIlroys that made contact with her hat.</p><p>\"I don't think we should ever accept that in golf. I think golf should be held to a higher standard than what was seen out there this week,\" <a target=\"_blank\" href=\"https://www.cbssports.com/golf/news/2025-ryder-cup-everything-rory-mcilroy-said-about-verbal-abuse-from-fans-at-bethpage-after-europes-victory/\">McIlroy said after Europe completed its victory</a>. \"Golf has the ability to unite people. Golf teaches you very good life lessons. It teaches you etiquette. It teaches you how to play by the rules. It teaches you how to respect people.</p><p>\"Sometimes this week we didn't see that. So no, this should not be what is acceptable in the Ryder Cup. But, you know, we will be making sure to say to our fans in Ireland in 2027 that what happened here this week is not acceptable.\"</p>\n<p>Europe won the Ryder Cup for the second consecutive time and, in turn, became the first away team to win since it did so in 2012 at Medinah. The Europeans dominated their way to an early lead with commanding results in Friday's foursomes and four-balls, and they did not waver on Saturday. The United States rallied with an 8½ -3½ session victory on Sunday, but it was not enough to overcome the hole the Americans dug themselves into over the first two days.</p>\n            </div>"
  },
  {
    "title": "Monday Night Football NFL player props: Self-learning AI likes Jake Browning Over 219.5 passing yards - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-nfl-player-props-self-learning-ai-likes-jake-browning-over-219-5-passing-yards/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/c41caf59-93be-4775-aa13-5aef58550dff/thumbnail/1200x675/f1844d41c6c63c953678c12864522cb1/jake-browning-bengals-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-09-29T21:10:23.000Z",
    "description": "The Week 4 NFL schedule concludes with another two-game 'Monday Night Football' slate. There's a staggered start with Jets vs. Dolphins at 7:15 p.m. ET and Bengals vs. Broncos kicking an hour later, and both...",
    "body": "<div>\n<p>The Week 4 NFL schedule concludes with another two-game 'Monday Night Football' slate. There's a staggered start with Jets vs. Dolphins at 7:15 p.m. ET and Bengals vs. Broncos kicking an hour later, and both games have an over/under of 44.5 points. Joe Burrow (toe) remains out for Cincinnati, though the Jets will have Justin Fields (concussion) back in the lineup. Bengals tight end Noah Fant (concussion) has been ruled out. How should those injury situations shape your Monday NFL prop picks at quarterback and surrounding positions?</p><p>Nome notable Monday Night Football player prop lines include Fields with an over/under of 183.5 yards, Ja'Marr Chase at over/under 68.5 receiving yards and Bo Nix at 1.5 touchdown passes. Before making any Monday Night Football NFL prop picks, <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">you need to see the Seahawks vs. Cardinals prop predictions powered by SportsLine's Machine Learning Model AI</a>.</p><p>Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. </p><p>For Jets vs. Dolphins and Broncos vs. Bengals <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> on Monday Night Football, the Machine Learning Model  has evaluated the NFL player prop odds and provided NFL prop picks. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">You can only see the Machine Learning Model player prop predictions for here</a>.</p><h2>Top NFL player prop bets for 'Monday Night Football'</h2><p>After analyzing the Seahawks vs. Cardinals props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Browning goes Over 219.5 passing yards (-112).</p><p>Browning is an experienced backup who saw extensive action in 2023 with Burrow out an extended period that year. He's stepping in again in 2025 due to Burrow's toe injury, which will have him out multiple months, and thus far he's 1-1. His first action against Jacksonville led to a win and 241 passing yards, though he did take a step back last week in a loss with just 140 yards. </p><p>SportsLine's model is projecting 261.8 yards for Browning as he's in a spot where the Bengals might have to play from behind. He has excellent targets in Chase and Tee Higgins, and the model rates this as a strong 4.5-star play. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">See more NFL props here</a>.</p><h2>How to make NFL player prop bets for Dolphins vs. Jets and Broncos vs. Bengals</h2><p>In addition, the SportsLine Machine Learning Model has revealed several other strong picks, including a five-star pick on one of the biggest names in action on Monday. <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">See who it is here</a>.</p><p><strong>Which Bengals vs. Broncos and Jets vs. Dolphins prop bets should you target for Monday Night Football? <a href=\"https://www.sportsline.com/insiders/week-4-monday-night-football-ai-props-best-player-props-for-jets-dolphins-and-broncos-bengals/#ttag=09292025_agg_cbssports_picks_football_nfl_AI_MNFAIprops\" target=\"_blank\">Visit SportsLine now to see the top  props, all from the SportsLine Machine Learning Model</a>.</strong></p>\n            </div>"
  },
  {
    "title": "Kawhi Leonard investigation: Everything Clippers star said about NBA's probe into Aspiration endorsement deal - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nba/news/kawhi-leonard-investigation-everything-clippers-star-said-about-nbas-probe-into-aspiration-endorsement-deal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/1a7b2cc1-9d3e-4ffe-91cd-b8dc7bb27b91/thumbnail/1200x675/edb7d3916c977eb2bca60fb107decaa3/kawhi.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:53:59.000Z",
    "description": "While most NBA media day press conferences follow a similar script, there was genuine intrigue about what we'd hear from the Clippers and most notably Kawhi Leonard. Monday was the first time Leonard answered...",
    "body": "<div>\n        <p>While most <a target=\"_blank\" href=\"https://cbssports.com/nba/\">NBA</a> media day press conferences follow a similar script, there was genuine intrigue about what we'd hear from the <a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/LAC/los-angeles-clippers/\">Clippers</a> and most notably <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/1715792/kawhi-leonard/\">Kawhi Leonard</a>. </p><p>Monday was the first time Leonard answered questions from the media since the bombshell reports of alleged cap circumvention tied to a questionable endorsement deal with the now-bankrupt company Aspiration. Leonard never did anything publicly to endorse Aspiration, which made the $28 million deal he signed with them (and the additional $20 million deal for stock in the company) look extremely fishy. </p><p>Steve Ballmer and the Clippers had financial ties to the company as well, creating further questions that the league is now investigating. While they have issued numerous statements about various reports, Leonard offered his first comments Monday. The star spent the first three minutes of his press conference answering questions about the situation, and here is everything he said. </p><a href=\"https://www.cbssports.com/nba/news/kawhi-leonard-investigation-what-potential-punishments-could-mean-for-the-clippers-steve-ballmer-and-the-nba/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Kawhi Leonard investigation: What potential punishments could mean for the Clippers, Steve Ballmer and the NBA</p>\n                <p>\n                    Sam Quinn                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Kawhi Leonard investigation: What potential punishments could mean for the Clippers, Steve Ballmer and the NBA\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/24/96b6485a-8cd7-4bb3-bda1-14d2d99b96ad/thumbnail/270x152/e27e174961f9093288b6b0b0daa9c5c7/kawhi-getty-7.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>When asked about if there was any difficulty to dealing with the distraction of the reports and the investigation as the season got started, Leonard quickly shrugged it off. </p>\n<p>\"It's easy for me,\" Leonard said. \"I don't read headlines or do conspiracy theories or anything like that. It's about the season and what we've got ahead of us right now. Tomorrow we'll start camp, and see what we got.\"</p><p>When asked if he had any reaction to the reports or a statement about the situation, Leonard had a brief response. </p><p>\"Um, no. The NBA's gonna do their job. None of us did no wrongdoing. And, yeah, that's it,\" Leonard said. \"We invite the investigations. It's not gonna be a distraction for me or the rest of the team.\"</p>\n<p>Leonard was asked whether he was aware of the details of the contract, what he was supposed to receive from Aspiration and what he was supposed to do for that compensation. </p><p>\"I understand the full contract and the services I had to do,\" Leonard said. \"Like I said, I don't deal with the conspiracies or clickbait analysts or journalism that's going on. So that's what it is.\"</p><p>When pressed on the reports he didn't actually do anything as part of the deal, Leonard shifted the focus to this being an old story for him. </p>\n<p>\"I don't think it's accurate. But, it's old,\" Leonard said. \"This is all new to you guys. The company went bankrupt awhile ago, so, we already knew this was going to happen.\" </p><p>Leonard was then asked if he got paid everything he was owed and said he had not. </p><p>\"Uh, no. But the company went belly up,\" Leonard said. \"It was fraud, as everybody knows. If you want any more questions or details about that company you need to ask the owner or whoever else is involved in the fraud that went on.\" </p>\n<p>He was asked if the reports he was still owed $7 million was accurate, he said he didn't know the exact number but thought it was actually more. </p><p>\"I'm not sure, I gotta look back at the books,\" Leonard said. \"No, it's more than that for sure.\"</p><p>Finally, he was asked if he knew how much he made from that deal, and he couldn't recall.</p>\n<p>\"No, it was like two, three, four years ago,\" Leonard said. </p><p>From that point the conversation shifted to basketball, but it was certainly a fascinating back-and-forth to open his presser, with ESPN's Ramona Shelburne, who did the first sit-down interview with Steve Ballmer after the story broke, asking the questions about the contract details. </p><p>Calling it a conspiracy theory and then confirming many of the details about the contract was interesting, to say the least. Noting he was owed more than the $7 million initially reported is also noteworthy, and the league will undoubtedly look into all of this. </p><p>Leonard echoed the Clippers' line of welcoming the investigation, but we'll find out once that investigation is completed -- which likely won't be for some time -- if Leonard and the Clippers said that for good reason, or if the league sees the situation differently, as most others do from what's been reported.  </p>\n            </div>"
  },
  {
    "title": "NFL Week 6 schedule changes: Buccaneers vs. 49ers move to later spot; Patriots vs. Saints receive 'demotion' - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-6-schedule-changes-buccaneers-vs-49ers-move-to-later-spot-patriots-vs-saints-receive-demotion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/96e38b07-9804-4649-b329-9a8244f09f67/thumbnail/1200x675/51aba120ee8b3d2ef3ef83d17ec8373d/baker.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:50:38.000Z",
    "description": "Getty Images                                    The NFL made two changes to the Week 6 schedule for very obvious reasons. The Buccaneers' home game against the 49ers moved from 1 p.m. ET to a 4:25 p.m....",
    "body": "<div>\n    <div>\n    <figure><img alt=\"baker.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/96e38b07-9804-4649-b329-9a8244f09f67/thumbnail/770x433/701c5cef69a91e566f9bbebb6711cc3f/baker.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The NFL made two changes to the Week 6 schedule for very obvious reasons. </p><p>The <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/TB/tampa-bay-buccaneers/\">Buccaneers</a>' home game against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SF/san-francisco-49ers/\">49ers</a> moved from 1 p.m. ET to a 4:25 p.m. kickoff, <a href=\"https://www.buccaneers.com/news/bucs-49ers-game-nfl-week-six-flexed-425-pm\" target=\"_blank\">the league announced Monday</a>. To make room for that change, the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NO/new-orleans-saints/\">Saints</a>' home game against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NE/new-england-patriots/\">Patriots</a> moved from 4:25 p.m. to 1 p.m. Both games air on CBS.</p><p>One can assume that the schedule changes had something to do with the records of each team. The Buccaneers and 49ers both have 3-1 records, while the Patriots and Saints are a combined 2-6. The Saints are one of just two teams that are 0-4. </p><p>It's somewhat ironic that the Patriots -- the NFL's most successful team this century -- moved out of a 4:25 game. The change, however, likely has more to do with their Week 6 opponent than it does about the current state of the Patriots. </p><p>At 0-4, the Saints are clearly a team that is in the middle of a rebuilding season under first year head coach Kellen Moore. Through four games, the Saints have been outscored by an average of nearly 14 points per game. New Orleans did put up a good fight this past Sunday before allowing two late touchdowns in an eventual 31-19 loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/BUF/buffalo-bills/\">Bills</a> in Buffalo. </p>\n<p>Rest assured that there will be more changes to the NFL's schedule in the weeks to come, specifically when it comes to prime time games. </p>\n            </div>\n    </div>"
  },
  {
    "title": "NFL DFS Monday Night Football: Best Jets-Dolphins, Broncos-Bengals daily fantasy picks for DraftKings, FanDuel - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-monday-night-football-best-jets-dolphins-broncos-bengals-daily-fantasy-picks-for-draftkings-fanduel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/05/be0aaed6-c09a-4fd0-a8d1-70c5abdcfa18/thumbnail/1200x675/2240723f6d49fbc4a035cfe287d6a932/bo-nix-imagn.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:46:55.000Z",
    "description": "The Week 4 NFL schedule concludes with a 'Monday Night Football' doubleheader. The Miami Dolphins host the New York Jets at 7:15 p.m. ET, and the Denver Broncos host the Cincinnati Bengals at 8:15 p.m. ET....",
    "body": "<div>\n        <p>The Week 4 NFL schedule concludes with a 'Monday Night Football' doubleheader. The Miami Dolphins host the New York Jets at 7:15 p.m. ET, and the Denver Broncos host the Cincinnati Bengals at 8:15 p.m. ET. Both games have an over/under of 44.5 points, meaning fantasy points could be a bit hard to come by. The Dolphins are 2.5-point favorites in their matchup, while the Broncos are -7.5 in the later kick, so those potential game flows could play into NFL DFS strategy. The NFL DFS player pool is headlined by Tyreek Hill, Breece Hall, Tua Tagovailoa, Bo Nix, Courtland Sutton, Tee Higgins and Ja'Marr Chase. All are expected to be popular NFL DFS picks and centerpieces of NFL DFS lineups. </p><p>Who are the top NFL DFS picks for Dolphins vs. Jets and Bengals vs. Broncos, and which daily Fantasy sleepers should you target to differentiate your NFL DFS lineups and NFL DFS stacks? Before making any NFL DFS picks for Monday Night Football on sites like DraftKings and FanDuel, <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">be sure to check out the NFL DFS lineup advice, strategy and player stacks from SportsLine NFL daily Fantasy expert Jimmie Kaylor</a>. </p><p>Kaylor is a <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> and DFS expert for SportsLine, who opened the 2022 NFL season by winning DraftKings' NFL Showdown Thursday Kickoff Millionaire contest. He edged out over 355,000 other entrants in the contest and also has multiple five-figure tournament wins on his DFS resume. Kaylor has covered the NFL and college football for close to a decade as a member of the Pro Football Writers of America, and his background as a former college and NFL player gives him a unique perspective when building his fantasy lineups and locking in his betting picks. </p><p>Now, Kaylor has turned his attention to 'Monday Night Football' and just locked in his top daily Fantasy football picks. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">You can only see his Monday Night Football DFS picks and analysis at SportsLine</a>.</p><p><em>New users can </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=dfs\" target=\"_blank\"><em>get $50 in Pick6 credits at DraftKings when they play $5</em></a><em>: </em></p><h2>Top NFL DFS picks, lineups, stacks for Monday Night Football</h2><p>One of Kaylor's top DFS picks for 'Monday Night Football' is Broncos quarterback Bo Nix, who has an over/under of 221.5 passing yards. As a rookie in 2024, Nix started all 17 games and delivered a solid performance, throwing for 3,775 yards on 376 of 567 attempts with 29 touchdowns and 12 interceptions, while adding 430 rushing yards and four rushing scores. His passer rating for 2024 was 93.3, and he finished the season ranked as QB6 in CBS Sports' final fantasy football rankings. </p><p>Through three weeks in 2025, Nix's numbers have been more modest: 535 passing yards on 61 of 95 passing (64.2 %), with five touchdowns, three interceptions, and a passer rating of 83.4. He's also rushed for 71 yards. Nix faces a Bengals defense that has given up 79 points in the team's last two games. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">See who else to roster here</a>.</p><p>Part of Kaylor's optimal NFL DFS strategy also includes rostering Bengals wide receiver Tee Higgins. In 2024, Higgins played in 12 games and recorded 73 receptions for 911 yards (12.5 yards per catch) and a career-high 10 receiving touchdowns. He ranked second on the Bengals (behind Triple Crown winner Ja'Marr Chase) in catches, yards, and touchdowns.  </p><p>In 2025, Higgins has seven catches for 104 yards, averaging 14.9 yards per reception, with one touchdown. With Denver expected to lock reigning NFL Defensive Player of the Year Patrick Surtain II on Chase, Higgins could be in line for an increase in targets. In one game gainst the Broncos in 2024, Higgins caught 11 passes for 131 yards and three scores. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">You can see the rest of Kaylor's NFL DFS picks here</a>.</p><p><em>New users can see the latest </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>FanDuel promo code</em></a></span><em> to </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\"><em>get $300 in bonus bets at FanDuel if your $5 bet wins</em></a><em>:</em></p><h2>How to build NFL DFS lineups for Monday Night Football</h2><p>Kaylor is also targeting another undervalued player who could explode for huge numbers on Monday Night Football. This pick could be the difference between winning your tournaments and cash games or going home with nothing. <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">You can only see who it is, and get the rest of Kaylor's NFL DFS picks, at SportsLine</a>. </p><p><strong>So who is Jimmie Kaylor including in his optimal NFL DFS lineups for the doubleheader on Monday Night Football, and which under-the-radar NFL DFS picks offer huge value? <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/#ttag=09282025_agg_cbssports_dfs_football_nfl_jimmiekaylor_MondayNightFootballDFS\" target=\"_blank\">Visit SportsLine now to see optimal NFL DFS picks, rankings, advice, and stacks, all from SportsLine's proven DFS expert who won a single-game millionaire maker tournament</a>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Steelers injuries: Jalen Ramsey, Calvin Austin III expected to miss multiple weeks - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-injuries-jalen-ramsey-calvin-austin-iii-expected-to-miss-multiple-weeks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/0ff20a33-6fdc-4209-bfe0-494365eb7803/thumbnail/1200x675/45f24b40a9aefc789d50a2fd208b2636/ramseyweek1.jpg",
    "tag": "Sports",
    "date": "2025-09-29T19:36:23.000Z",
    "description": "Getty Images                                    It's safe to say that the Pittsburgh Steelers' bye week came at the right time. The Steelers endured several notable injuries during their Week 4 over the...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"ramseyweek1.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/0ff20a33-6fdc-4209-bfe0-494365eb7803/thumbnail/770x433/45634a1b5c1e8491da3a62df0c9861da/ramseyweek1.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>It's safe to say that the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/PIT/pittsburgh-steelers/\">Pittsburgh Steelers</a>' bye week came at the right time. The Steelers endured several notable injuries during their Week 4 over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIN/minnesota-vikings/\">Vikings</a> in Dublin, specifically ones to starting cornerback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2071515/jalen-ramsey/\">Jalen Ramsey</a> and starting receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2866214/calvin-austin-iii/\">Calvin Austin III</a>. </p><p>Ramsey and Austin are both expected to miss several games, <a href=\"https://x.com/gerrydulac/status/1972522791888122331\" target=\"_blank\">according to</a> the Pittsburgh Post-Gazette's Gerry Dulac. Ramsey sustained a hamstring injury during <a href=\"https://www.cbssports.com/nfl/news/steelers-vs-vikings-live-updates-score-highlights-week-4-ireland/live/\" target=\"_blank\">Pittsburgh's 24-21 win over the Vikings</a>. Austin sustained a shoulder injury that led to him <span><a href=\"https://www.cbssports.com/nfl/news/steelers-calvin-austin-being-evaluated-in-dublin-hospital-after-suffering-shoulder-injury-in-win-over-vikings/\" target=\"_blank\">spending time in a Dublin-area hospital</a></span>. </p><p>Both losses are significant ones for the Steelers, who go into their Week 5 bye with a 3-1 record and in first place in the AFC North. </p><p>Ramsey enjoyed a solid start to his Steelers career. He made the game-clinching tackle during Pittsburgh's Week 1 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">Jets</a> and made an interception the following week in a loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SEA/seattle-seahawks/\">Seahawks</a>. He appeared to score a touchdown off of a fumble return during Sunday's game before officials overturned the play.</p>\n<p>Austin is second on the team in both receiving yards and touchdown receptions. He caught a key touchdown in Pittsburgh's Week 1 win over the Jets and made the game-winning score during the team's Week 3 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NE/new-england-patriots/\">Patriots</a>. </p>\n<p>Fortunately for the Steelers, they have a very capable backup cornerback in <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123075/brandin-echols/\">Brandin Echols</a>, who made a big interception in the end zone during the Steelers' win over the Patriots. The Steelers are also expected to have starting cornerback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3125620/joey-porter-jr/\">Joey Porter Jr</a>. back in the fold soon; he was a limited practice participant last week as he has continued to work his way back from a hamstring injury. </p><p>Replacing Austin won't be as easy, but the Steelers have several candidates. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2247046/ben-skowronek/\">Ben Skowronek</a>, a special teams standout who caught <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/419780/aaron-rodgers/\">Aaron Rodgers</a>' first touchdown pass as a Steeler back in Week 1, is among them. Veteran Scotty Miller and second-year wideout <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3169495/roman-wilson/\">Roman Wilson</a> may also be called upon to contribute more to the offense during Austin's absence. </p>\n<p>The Steelers have some time to figure things out before their next game. They won't play again until division rival Cleveland comes to town in Week 6. The Steelers then hit the road for a prime time game in Cincinnati before returning home to host the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/GB/green-bay-packers/\">Packers</a> in another prime time showdown. </p>\n            </div>\n    </div>"
  },
  {
    "title": "Dolphins vs. Jets prediction, odds, start time: 2025 NFL Week 4 Monday Night Football picks from proven model - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-vs-jets-prediction-odds-start-time-2025-nfl-week-4-monday-night-football-picks-from-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/05/c50841a5-6b18-4d32-9078-7e8f5d0ed8ac/thumbnail/1200x675/bb9f2d7c748b84eefafbc3b2d9c652de/tua-imagn-1.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:50:29.000Z",
    "description": "A two-game 'Monday Night Football' slate in NFL Week 4 begins with the Miami Dolphins hosting the New York Jets. These divisional rivals are both winless on the season, and only one team in league history has...",
    "body": "<div>\n        <p>A two-game 'Monday Night Football' slate in NFL Week 4 begins with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> hosting the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>. These divisional rivals are both winless on the season, and only one team in league history has ever made the postseason after an 0-4 start. Miami (0-3) fell 31-21 to Buffalo in its most recent contest last Thursday, making it 0-3 for the first time since 2019. New York lost 29-27 in Week 3 to Tampa, as the Jets are 0-3 for the fourth time since 2019, which is the most in the NFL over that span. Cornerback and new acquisition Jarvis Brownlee (ankle) and edge Jermaine Johnson (edge) are out for New York.</p><p>Kickoff is at 7:15 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., where the home team has won nine straight meetings with the Jets. Miami is a 2.5-point favorite in the latest Dolphins vs. Jets odds, and the over/under for total points scored is 44.5. Before making any Jets vs. Dolphins picks, be sure to <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">see what the SportsLine projection model has to say</a>. </p><p><em>New users can also target the <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings promo code</a>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$200 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a><em>:</em></p><p>The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated <a href=\"https://www.sportsline.com/nfl/picks/\" target=\"_blank\">NFL picks</a> since its inception. The model is on a sizzling 39-19 run on top-rated picks dating back to 2024. Anybody following its <a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a> picks at <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a> and on <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">betting sites</a> could have seen strong returns.  </p><p>Now, the model has zeroed in on <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_NYJ@MIA/\" target=\"_blank\">Dolphins vs. Jets</a>. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">You can head to SportsLine now to see its picks.</a> Here are several <a href=\"https://www.cbssports.com/nfl/odds/\" target=\"_blank\">NFL odds</a> and betting lines for Jets vs. Dolphins:</p><table><tbody><tr><td><p>Dolphins vs. Jets spread</p></td><td><p>Dolphins -2.5 at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings Sportsbook</a></p></td></tr><tr><td><p>Dolphins vs. Jets over/under</p></td><td><p>44.5 points</p></td></tr><tr><td><p>Dolphins vs. Jets money line </p></td><td><p>Dolphins -150, Jets +125</p></td></tr><tr><td><p>Dolphins vs. Jets picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Dolphins vs. Jets streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Jets can cover</h2><p>New York couldn't have asked for a better opponent to see on Monday Night Football as the Dolphins are 1-7 over their last eight primetime games. That includes four straight Miami defeats at home in primetime, and the team has lost five of its last six MNF appearances overall. Also, the mini-bye that Miami is coming off after playing last Thursday doesn't appear to help their chances of covering as the Dolphins are 0-4 against the spread with a rest advantage since the start of 2024.</p><p>The Jets have a potent running attack with a number of talented backs, plus mobility with the quarterback position with Justin Fields cleared from the concussion protocol. The team entered Week 4 ranking in the top 10 in both rushing yards per game and rushing scores, despite <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a> yet to find the end zone in 2025. Than run game should undoubtedly get boosted by the pass game, as that's what Miami's defense tends to do for opponents. The Dolphins are first team since the merger to allow nine total touchdowns and zero turnovers to their opposing starting quarterbacks in each of the team's first three games. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>Why the Dolphins can cover</h2><p>Playing at home has certainly been an advantage for the Dolphins in this series as they've won nine straight home matchups with the Jets. All of them have been by more than the spread of 2.5 points as the Dolphins have a 10.4-point average margin of victory during this run. Additionally, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a> has had success versus his divisional rival no matter where the games have taken place as the quarterback is undefeated in five starts against the Jets, including averaging 277.5 passing yards, a 76% completion rate and a 3:0 TD:INT over his last two versus New York.</p><p>The Dolphins offense has come to life after an eight-point Week 1, particularly the run game, as the team rushed for 130 yards last week versus Buffalo. Miami is averaging 5.4 yards per carry on the year, which ranks fourth in the NFL, while the team ranks No. 1 in third-down conversion percentage and fourth in redzone scoring. That offense can take advantage of deficiencies with the Jets defense, as New York hasn't had a takeaway, ranks in the bottom 10 in run defense and is in the bottom five in scoring defense. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See which team to back at SportsLine</a>. </p><p><em>Check out the latest </em><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/betmgm-promo-code/\"><em>BetMGM promo code</em></a><em> CBSSPORTS, where new users can </em><a target=\"_blank\" href=\"https://martech.cbssports.com/bt/redirect/prod?b=betmgm&c=sport\"><em>get up to $1,500 in bonus bets if your first bet loses</em></a><em>.</em></p><h2>How to make Jets vs. Dolphins picks</h2><p>For this NFL Week 4 Monday Night Football game of Dolphins vs. Jets, the model is leaning over the total, projecting 50 combined points. It also says one side of the spread hits in almost 60% of simulations. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\">See what it is at SportsLine</a>.</p><p><strong>Who wins Jets vs. Dolphins, and which side of the spread hits almost 60% of the time? </strong><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-prediction-line-odds-proven-model-releases-spread-pick-for-2025-nfl-week-4-monday-night-football/#ttag=09282025_agg_cbssports_picks_football_nfl_model_JetsDolphinsMNF\" target=\"_blank\"><strong>Visit SportsLine now to see which side of the Dolphins vs. Jets spread you need to jump, all from the model that is 39-19 on top-rated picks since 2024</strong></a><strong>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Jets vs. Dolphins prediction, odds, time: 2025 NFL Week 4 Monday Night Football picks from expert on 18-9 roll - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-vs-dolphins-prediction-odds-time-2025-nfl-week-4-monday-night-football-picks-from-expert-on-18-9-roll/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/baecf821-c61b-4716-8f73-d972c50ad141/thumbnail/1200x675/debae254e76050bb8e6a85ff5cb1fa5c/justin-fields-new-york-jets-imagn-imges.jpg",
    "tag": "Sports",
    "date": "2025-09-29T20:10:21.000Z",
    "description": "Teams looking to get into the win column clash when the New York Jets face the Miami Dolphins in a key AFC East matchup on Monday Night Football. New York is coming off a 29-27 loss at Tampa Bay, while Miami...",
    "body": "<div>\n        <p>Teams looking to get into the win column clash when the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a> face the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> in a key AFC East matchup on Monday Night Football. New York is coming off a 29-27 loss at Tampa Bay, while Miami dropped a 31-21 decision at Buffalo in Week 3. The Jets (0-3), who are 0-2 in the conference, are 0-1 within the division. The Dolphins (0-3), who are 0-3 in the conference, are 0-2 against AFC East foes. Cornerbacks Storm Duck (ankle) and Jason Marshall Jr. (hamstring) have been ruled out for Miami.</p><p>Kickoff from Hard Rock Stadium in Miami Gardens,  Fla., is set for 7:15 p.m. ET. The Dolphins lead the all-time series 61-57-1, including wins in eight of the past 10 matchups. The Dolphins are 2.5-point favorites in the latest Jets vs. Dolphins odds from SportsLine consensus, while the over/under for total points scored is 44.5. Before making any Jets vs. Dolphins picks, <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">make sure you check out what SportsLine expert, Emory Hunt, has to say</a>. </p><p><em>New users can also target the </em><span><a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\"><em>DraftKings promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>$300 in bonus bets instantly plus over $200 off NFL Sunday Ticket</em></a><em>:</em></p><p>Hunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007, and a former running back at Louisiana-Lafayette. He knows the game from a player's perspective. </p><p>Hunt's dedication to analysis of all levels of college and professional football helped go 88-67-2 (+1474) on all <a target=\"_blank\" href=\"https://cbssports.com/nfl/picks/experts/\">NFL picks</a> over the past two years. He is also 18-9 (+805) on his last 27 against-the-spread picks in New York Jets games. Anyone who has followed him could be way up.</p><p>Now, Hunt has zoned in on <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_NYJ@MIA/\" target=\"_blank\">Jets vs. Dolphins</a>. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">You can head to SportsLine now to see his picks</a>. Here are several <a href=\"https://www.cbssports.com/nfl/odds/\" target=\"_blank\">NFL odds</a> and <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> lines for Dolphins vs. Jets:</p><table><tbody><tr><td><p>Jets vs. Dolphins     spread</p></td><td><p>Dolphins -2.5 at DraftKings Sportsbook</p></td></tr><tr><td><p>Jets vs. Dolphins     over/under</p></td><td><p>44.5 points</p></td></tr><tr><td><p>Jets vs. Dolphins     money line </p></td><td><p>Dolphins -150, Jets +125</p></td></tr><tr><td><p>Jets vs. Dolphins     picks</p></td><td><p><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See picks at SportsLine</a></p></td></tr><tr><td><p>Jets vs. Dolphins     streaming </p></td><td><p><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=416484&sharedid=HTW\" target=\"_blank\">Fubo</a> (Try for free)</p></td></tr></tbody></table><h2>Why the Dolphins can cover</h2><p>Veteran quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741209/tua-tagovailoa/\">Tua Tagovailoa</a> leads the Miami offense. In three games this season, he has completed 62 of 89 passes for 575 yards (69.7%) and five touchdowns with four interceptions. In a 33-27 loss to the New England Patriots in Week 2, he completed 26 of 32 passes for 315 yards and two touchdowns with one interception. In his last matchup against the Jets in 2024, he helped guide the Dolphins to a 32-26 overtime win on Dec. 8. In that game, he completed 33 of 47 passes (70.2%) for 331 yards and two touchdowns.</p><p>His top target has been wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a>. He has 15 receptions for 198 yards (13.2 average) and one touchdown. Hill has three explosive plays of 20 yards or more, including a long of 47, with 30 yards after the catch and 12 first-down conversions. In the loss to New England, he caught six passes for 109 yards. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See which team to back at SportsLine</a>. </p><h2>Why the Jets can cover</h2><p><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1273205/justin-fields/\">Justin Fields</a> (concussion) has cleared protocol and is in line to get the start. He'll lean on wide receiver <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123864/garrett-wilson/\">Garrett Wilson</a>, who leads the team with 21 receptions for 229 yards (10.9 average) and two touchdowns. He has two explosive plays of 20 yards or more, including a long of 33, with 59 yards after the catch and 10 first-down conversions.</p><p>Fourth-year running back <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123469/breece-hall/\">Breece Hall</a> is off to a solid start to the season. In three games, he has rushed 38 times for 157 yards (4.1 average), while catching eight passes for 78 yards, including a long of 33. In a season-opening 34-32 loss to the Pittsburgh Steelers, he carried 19 times for 107 yards (5.6 average). In 43 career games, he has 550 carries for 2,490 yards and 14 touchdowns. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See which team to back at SportsLine</a>.</p><p><em>New users can also check out the latest </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>FanDuel promo code</em></a></span><em> to </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>get $300 in bonus bets after placing a $5 bet</em></a></span><em>:</em></p><h2>How to make Jets vs. Dolphins  picks</h2><p>For Monday Night Football's Jets vs. Dolphins matchup, Hunt is leaning under the total, but he also says a critical X-factor makes one side of the spread a must-back. <a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\">See what it is at SportsLine</a>.</p><p><strong>Who covers in Jets vs. Dolphins and what critical x-factor do you need to know about? </strong><a href=\"https://www.sportsline.com/insiders/jets-vs-dolphins-odds-line-time-proven-football-expert-makes-his-nfl-week-4-monday-night-football-picks/#ttag=09292025_agg_cbssports_picks_football_nfl_hunt_JetsDolphins\" target=\"_blank\"><strong>Visit SportsLine now to see which side of the Jets vs. Dolphins spread you need to jump, all from the expert who returned $805 to $100 players over his last 27 New York Jets picks</strong></a><strong>, and find out.</strong></p>\n            </div>"
  },
  {
    "title": "Twins fire Rocco Baldelli: Another MLB manager job opens up as Minnesota moves on - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/twins-fire-rocco-baldelli-another-mlb-manager-job-opens-up-as-minnesota-moves-on/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/688ae897-66d4-4f1e-8dd1-613b6f0cdb7d/thumbnail/1200x675/cdc8d343728d291b092c8e5f053c7749/rocco-baldelli-getty-1.png",
    "tag": "Sports",
    "date": "2025-09-29T20:23:57.000Z",
    "description": "After losing 90-plus games for the first time since 2016, the Minnesota Twins have fired manager Rocco Baldelli, the team announced Monday. A club option in his contract for the 2026 season was exercised last...",
    "body": "<div>\n        <p>After losing 90-plus games for the first time since 2016, the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIN/minnesota-twins/\">Minnesota Twins</a> have fired manager Rocco Baldelli, the team announced Monday. A club option in his contract for the 2026 season was exercised last offseason.</p><p>\"Over  the past seven years Rocco has been much more than our manager. He has  been a trusted partner and teammate to me in leading this organization,\"  president of baseball operations Derek Falvey said in a statement. \"Together we shared a deep care  for the Twins, for our players and staff, and for doing everything in  our power to put this club in the best position to succeed. Along the  way we experienced some meaningful accomplishments,  and I will always be proud of those, even as I wish we had ultimately  achieved more.\"</p><p>\"After ongoing internal discussions, we believe this is the right time for a change in leadership of our Major League team. These decisions are never easy, particularly given the respect we have for Rocco,\" owner Joe Pohlad added in a statement \"He led with professionalism and care for both his players and our organization, and we are grateful for the way Rocco represented the Twins. Rocco, Allie and their children will always be part of the Twins family, and we wish them the very best moving forward.\"  </p><p>Minnesota went 70-92 this season, their worst record since going 59-103 in 2016, though Baldelli was hardly the biggest reason. The Twins were a not dreadful 51-57 on trade deadline day, then they dealt away 10 MLB players, including <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2000028/carlos-correa/\">Carlos Correa</a> and their five best relievers. They then proceeded to go 19-35 the rest of the way, the second-worst record in baseball.</p>\n<p>Baldelli, 44, just completed his seventh season as Twins' manager. He guided the team to the postseason in 2019, 2020, and 2023, and in 2023 they won their first postseason series since 2002. In seven years under Baldelli, the Twins went 527-505 (.511) and won three AL Central titles (2019, 2020, 2023).</p><p><span><a href=\"https://www.cbssports.com/mlb/news/twins-ownership-wont-sell-mlb-team-after-exploring-sale-part-of-our-family-story/\" target=\"_blank\">The Pohlad family recently announced they will not sell the Twins</a></span>, and they have aggressively cut payroll in recent seasons. With a rebuild underway, it is likely more trades and payroll-cutting is on the way this offseason. Baldelli figures to be replaced with a young, possibly first-time manager.</p>\n<p>Baldelli was the second manager let go on Monday. The Giants also parted ways with Bob Melvin. The Twins and Giants are looking for new managers, as are the Orioles, Rockies and Nationals. Baltimore, Colorado and Washington all finished the season with interim skippers.</p>\n            </div>"
  },
  {
    "title": "Brock Purdy injury: 49ers QB felt toe soreness after loss to Jaguars; status for Week 5 vs. Rams up in the air - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brock-purdy-injury-49ers-qb-felt-toe-soreness-after-loss-to-jaguars-status-for-week-5-vs-rams-up-in-the-air/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/d2a048dd-b3ec-4f70-be8f-cd5a0c5ae9c0/thumbnail/1200x675/eb0ebbda3c1eead058930b21593d86ab/untitled-design-9.png",
    "tag": "Sports",
    "date": "2025-09-29T18:52:16.000Z",
    "description": "49ers quarterback Brock Purdy felt soreness in his toe following a 26-21 loss to the Jacksonville Jaguars on Sunday, and his status for Week 5 against the Los Angeles Rams on Thursday is up in the air. Purdy...",
    "body": "<div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SF/san-francisco-49ers/\">49ers</a> quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2961306/brock-purdy/\">Brock Purdy</a> felt soreness in his toe following a 26-21 loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/JAC/jacksonville-jaguars/\">Jacksonville Jaguars</a> on Sunday, and his status for Week 5 against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAR/los-angeles-rams/\">Los Angeles Rams</a> on Thursday is up in the air. Purdy missed Weeks 2 and 3 because of a turf toe injury and returned to the lineup Sunday for the first time since Week 1. </p><p>Purdy is set to be evaluated further Monday.</p><p>\"Hopefully we'll find out more later today, but any time guys are sore and hurting on a Monday, you usually don't stress too much about it,\" <a href=\"https://www.espn.com/nfl/story/_/id/46423038/49ers-qb-brock-purdy-status-again-air-due-tore-soreness\" target=\"_blank\">Shanahan said.</a> \"But anytime you have a Thursday game, it's a totally different element. So, I'm concerned with anybody who's not totally healthy at this moment, but we'll have to get more information on that later today to really have a clue of what to speculate.\"</p><p>Purdy finished 22 of 28 for 309 yards with two touchdowns and two interceptions in the loss. Immediately after the game, Purdy told reporters that his toe didn't bother him and he \"felt good\" throughout the game.</p><p>\"I think just getting back out there and throwing and getting into a rhythm, being down two weeks, coming back and feeling out my body and everything, obviously how my toe feels,\" Purdy said. \"Honestly, I don't know the answer to that. But obviously I'm going to watch this film, look at my mechanics and be real with myself and try to fix that.\"</p>\n<a href=\"https://www.cbssports.com/nfl/news/robert-saleh-and-liam-coen-have-heated-exchange-following-jaguars-upset-win-over-49ers/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>'I will f--- your world up': Robert Saleh to Liam Coen in heated exchange after Jaguars' win over 49ers</p>\n                <p>\n                    Jordan Dajani                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"'I will f--- your world up': Robert Saleh to Liam Coen in heated exchange after Jaguars' win over 49ers\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/077ea7b4-bd14-4e7a-80a4-e4b15243a626/thumbnail/270x152/d7ca446f32082ae79fc940ed2f321f3c/untitled-design-2025-09-28t234625-814.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>If Purdy doesn't play in Week 5, backup quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2741202/mac-jones/\">Mac Jones</a> would likely get his third start of the season. Jones (knee) was dealing with an injury himself following his team's Week 3 16-15 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/ARI/arizona-cardinals/\">Arizona Cardinals</a>. Despite being limited in practice last week, Jones was active against Jacksonville.</p><h2>49ers could also be without their top wide receivers</h2><p>Purdy isn't the only player on offense who could be questionable for this week's game against Los Angeles. 49ers wide receivers <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3122949/ricky-pearsall/\">Ricky Pearsall</a> (knee) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2180514/jauan-jennings/\">Jauan Jennings</a> (ribs) also dealt with injuries during the loss to the Jaguars. Pearsall injured his knee after attempting to make a catch on the sideline, while Jennings was drilled while catching a two-point conversion in the second half.</p><p>Pearsall was dealing with a knee injury throughout last week and was limited in practice. Pearsall went back into the game for one play after suffering the injury, but didn't return after taking himself out of the game.</p><p>\"I was testing out my knee,\" Pearsall said. \"I fell pretty hard on that play on the sideline, trying to keep my feet in bounds, and I fell pretty hard on my knee. I was just feeling pain and a little bit of instability. I wasn't trying to mess with it.\"</p>\n<p>The 49ers are already without star tight end <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2818265/george-kittle/\">George Kittle</a>, who landed on injured reserve following his team's Week 1 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SEA/seattle-seahawks/\">Seahawks</a>. The Rams opened as a 3.5-point favorite against their NFC West rival (per <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\">FanDuel</a>. As of Monday afternoon, the line jumped to 5.5.</p>\n            </div>"
  },
  {
    "title": "Week 4 NFL player props, MNF predictions, odds: Top Dolphins vs. Jets, Broncos vs. Bengals picks - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-4-nfl-player-props-mnf-predictions-odds-top-dolphins-vs-jets-broncos-vs-bengals-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/05/9986d537-8f7d-4e90-98c6-deafe5b4e5bf/thumbnail/1200x675/94250076d4e9ace1de3bf40997b780d7/bo-nix-broncos-imagn.jpg",
    "tag": "Sports",
    "date": "2025-09-29T21:08:06.000Z",
    "description": "NFL player props continue to grow in popularity with bettors and a double-dose of Monday Night Football opens up the possibilities for building NFL same-game parlays and SGPx tickets in Week 4. Dolphins vs....",
    "body": "<div>\n        <p>NFL player props continue to grow in popularity with bettors and a double-dose of Monday Night Football opens up the possibilities for building NFL same-game parlays and SGPx tickets in Week 4. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Dolphins</a> vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">Jets</a> kicks off at 7:15 p.m. ET, and then <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DEN/denver-broncos/\">Broncos</a> vs. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/CIN/cincinnati-bengals/\">Bengals</a> begins at 8:15 p.m. ET, and the wide receiver play should be strong in both games. <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2131163/tyreek-hill/\">Tyreek Hill</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3123864/garrett-wilson/\">Garrett Wilson</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2218461/courtland-sutton/\">Courtland Sutton</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2966320/jamarr-chase/\">Ja'Marr Chase</a> are all bona fide No. 1 options, and they're sure to attract a lot of attention in Monday Night Football player props.</p><p>Meanwhile, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3121193/bo-nix/\">Bo Nix</a> has a juicy matchup against a struggling Cincinnati pass defense, and over 1.5 passing touchdowns for the second-year QB is one of our top NFL prop picks. Nix and the Broncos are favored by 7.5 points, according to the latest NFL odds, and the over/under for Broncos vs. Bengals is 44.5. With NFL props available for almost every player in every game at <a href=\"https://www.cbssports.com/betting/news/best-betting-apps/\" target=\"_blank\">sportsbooks</a>, SportsLine's proven computer model can help you find value to add to your Jets vs. Dolphins and Bengals vs. Broncos picks. They can also help new users take advantage of <a href=\"https://www.cbssports.com/betting/news/sportsbook-promos/\" target=\"_blank\">sportsbook promos</a> like the latest <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\">FanDuel Sportsbook</a>, which offers new users <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\">$300 in bonus bets if your first $5 bet wins</a>:</p><p>The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated <a href=\"https://www.sportsline.com/nfl/picks/\" target=\"_blank\">NFL picks</a> since its inception. The model went 39-19 on top-rated picks in 2024. Anybody following its <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> picks at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">sportsbooks</a> and on <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/best-betting-apps/\">betting sites</a> could have seen strong returns. Now, the model has revealed its top Dolphins vs. Jets or Broncos vs. Bengals NFL player prop picks: </p><p><strong>Best Monday Night Football player prop picks for Week 4:<br /></strong></p><ul><li>Bo Nix, Broncos, Over 1.5 passing touchdowns (+105)</li><li><a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3171161/devon-achane/\">De'Von Achane</a>, Dolphins, anytime touchdown scorer (-115)</li><li>Courtland Sutton, Broncos, Over 62.5 receiving yards (-114)</li><li>Parlay these picks for +619 odds at <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">DraftKings</a> (odds subject to change), where new users get <a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\">over $200 off NFL Sunday Ticket and $200 in bonus bets</a>:</li></ul><h2>Bo Nix, Broncos, Over 1.5 passing touchdowns (+105)</h2><p>His sophomore season in the NFL is off to a sluggish start, but this could be the matchup to kick-start things for Nix. The Bengals ranked 25th in pass defense entering Week 4 and have already surrendered six passing touchdowns on the season. Meanwhile, Nix might have only thrown for 535 yards over the first three weeks, but he has thrown five touchdown passes overall and has thrown for multiple TDs in 11 of his 20 career regular-season starts. <strong>The model predicts that the throws for 2.34 touchdowns on average</strong>, making plus money here a stellar deal.</p><h2>De'Von Achane, Dolphins, anytime touchdown scorer (-115)</h2><p>Achane has scored in two of three games to start the season despite Miami's struggles, and he's now up to 25 career touchdowns in 31 games. What's even better than the bulk for betting a running back is the balance, as 14 of his scores have come on the ground and 11 have come through the air. He's one of few running backs who score a large chunk of their team's touchdowns in the league who are unlikely to be phased out based on the game script. <strong>The model predicts that he scores 0.86 touchdowns on average</strong>, yet these odds suggest he scores only 53% of the time.</p><h2>Courtland Sutton, Broncos, Over 62.5 receiving yards (-114)</h2><p>Sutton had a strange performance against the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/IND/indianapolis-colts/\">Colts</a> in Week 2, where he was only targeted four times and finished with one catch for six yards. That feels fluky considering he was targeted nine times in Week 1 and finished with six catches for 61 yards and a score, then was targeted eight times and had six catches for 118 yards and another touchdown in Week 3. Since Nix took over as the starter, he's averaging 63.3 yards per game, and a bad Cincinnati pass defense is a big reason why <strong>the model is projecting that he averages 67 yards</strong>.</p><h2>Want more Week 4 Monday Night Football picks?</h2><p><strong>You've seen the model's <a target=\"_blank\" href=\"https://cbssports.com/nfl/picks/experts/\">NFL picks</a> for Jets vs. Dolphins and Bengals vs. Broncos player props for Week 4. Now, <a href=\"https://www.sportsline.com/nfl/picks/#ttag=09292025_agg_cbssports_picks_football_NFL_model_Week4MNFplayerpropsFREE\" target=\"_blank\">get NFL Week 4 projections for every player prop at SportsLine</a>.</strong></p><p><strong>Also at SportsLine:</strong></p><p>SportsLine expert R.J. White, who is 31-22 on his last 53 NFL picks, has revealed his best bets for both Monday Night Football games. <a href=\"https://www.sportsline.com/experts/14890/rj-white/?league=nfl#ttag=09292025_agg_cbssports_picks_football_NFL_model_Week4MNFplayerpropsFREE\" target=\"_blank\">You can find them here.</a></p>\n            </div>"
  },
  {
    "title": "Today's top games to watch, best bets, odds: Jets at Dolphins, Bengals at Broncos and more - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-jets-at-dolphins-bengals-at-broncos-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/fa9b072d-3767-4ef2-b51e-6e63f59a090a/thumbnail/1200x675/47255dd9fd22d5d3a2739b4d59e11412/bo-nix-cbs.jpg",
    "tag": "Sports",
    "date": "2025-09-29T19:30:39.000Z",
    "description": "Monday will be twice as nice for NFL fans, who will be able to take in a Monday Night Football doubleheader that begins on the East Coast and finishes out west. The night kicks off with two winless AFC East...",
    "body": "<div>\n<p>Monday will be twice as nice for <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> fans, who will be able to take in a Monday Night Football doubleheader that begins on the East Coast and finishes out west. The night kicks off with two winless AFC East rivals—the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a> (0-3) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIA/miami-dolphins/\">Miami Dolphins</a> (0-3)—looking for their first victory of the season, at Hard Rock Stadium in South Florida. The evening concludes with two teams trying to bounce back from losses last week: the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/CIN/cincinnati-bengals/\">Cincinnati Bengals</a> (2-1) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DEN/denver-broncos/\">Denver Broncos</a> (1-2) meeting at Empower Field in Denver.</p><p>The first game features two teams that have been offensively challenged so far this season. The Dolphins have scored 21 points or fewer in two of three games this season and are averaging 18.7 points per game; just five teams average fewer. Meanwhile, the Jets are averaging just 271.7 total yards per game. That ranks 27th in the <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a>.</p><p>The New York offense, however, is set to get an important piece back. Starting quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1273205/justin-fields/\">Justin Fields</a>, who missed last week's game with a concussion, was a full participant in practice on Thursday, Friday and Saturday and <span><a href=\"https://www.cbssports.com/nfl/news/is-justin-fields-starting-tonight-vs-dolphins-latest-on-jets-qbs-status-after-missing-game-with-concussion/\" target=\"_blank\">is expected to start on Monday</a></span>.</p><p>The Jets have lost nine straight games in Miami, with their last victory coming in 2014. The Dolphins are 2.5-point favorites on Monday.</p><p>In the second game, Bengals quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2180355/jake-browning/\">Jake Browning</a> is set to make his second start this season in place of the injured <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2179798/joe-burrow/\">Joe Burrow</a>, who is out for three months with a toe injury. Browning's first start went poorly; he completed 19-of-27 passes for 140 yards, one touchdowns and two interceptions in a 48-10 blowout loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/MIN/minnesota-vikings/\">Vikings</a>. (The 38-point defeat was the largest in franchise history.) Browning entered Week 4 with the most interceptions thrown in the league despite not having played until the second quarter of Week 2.</p><p>Browning will face a Broncos team that is coming off back-to-back losses on field goals as time expired, first to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/IND/indianapolis-colts/\">Colts</a> and then to the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAC/los-angeles-chargers/\">Chargers</a>. Denver blew seven-point leads in the second halves of both losses. </p><p>Both of those defeats came on the road, and Monday's game will at home where the Broncos have proven to be tough recently. They have won six straight games at Empower Field, which is their longest home winning streak since they won 11 over the 2014-15 seasons. During the winning streak, Denver has averaged 32.7 points per game and has outscored its opponents by 19.8 points a game. </p><p>The Broncos are 7.5-point favorites over the Bengals.</p><p>While the Monday Night Football doubleheader is the marquee attraction on the sporting landscape on the day, there are other options on the sporting landscape. </p><p>Below is a snapshot of what to watch and bet for Monday, Sept. 29. <em>All times Eastern.</em></p><h2>NFL best bets, where to watch</h2><h3>Jets at Dolphins</h3><p><strong>Time:</strong> 7:15 p.m. | <strong>Location: </strong>Miami | <strong>TV:</strong> ESPN | <strong>Stream: </strong><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=365718\" target=\"_blank\">Fubo</a> (Try for free)</p><p><strong><a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_NYJ@MIA/\" target=\"_blank\">SportsLine picks</a> -- Model: </strong>Dolphins -2.5 | <strong>Expert:</strong> Dolphins -2.5 (R.J. White)</p>\n<p>Both defenses have provided little resistance this season. The Dolphins have given up 32.3 points a game this year, which ranks 30th in the NFL. The Jets haven't been much better, allowing 31.0 points a game (29th in the league). However New York's defense also must deal with the loss of linebacker <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/3116461/quincy-williams/\">Quincy Williams</a> and edge defender Jermaine Johnson Jr., who are out Monday. The SportsLine Projection Model, which simulates every NFL game 10,000 times, gives Miami a 59% chance to cover and assigns a \"B\" grade to Dolphins -2.5. \"Miami is getting healthier and has a great home field advantage, and with the Jets defense looking almost as bad as Miami's, I'll back the home team here,\" White says.</p><h3>Bengals at Broncos</h3><p><strong>Time:</strong> 8:15 p.m. | <strong>Location: </strong>Denver | <strong>TV:</strong> ABC | <strong>Stream: </strong><a href=\"https://www.fubo.tv/welcome/leagues/191277?irad=356362&irmp=365718\" target=\"_blank\">Fubo</a> (Try for free)</p><p><strong><a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20250929_CIN@DEN/\" target=\"_blank\">SportsLine picks</a> -- Model: </strong>Broncos -7.5 | <strong>Expert:</strong> Broncos -7.5 (Micah Roberts)</p>\n<p>The Denver pass rush has a favorable matchup going up against Cincinnati's pass protection. The Bengals are allowing pressures on 44.9% of dropbacks this season; only the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/TEN/tennessee-titans/\">Titans</a> (45.6%) and Jets (50%) have been worse. Meanwhile, the Broncos are averaging 4.0 sacks per game, which is the best rate in the league. Poor pass protection is only one of the problems with the Cincinnati offense. The Bengals rank last in the league in rushing yards per game (49.0) and second-to-last in total yards per game (220.7). \"I see the Broncos' strength with their pass rush having their way with the Bengals offensive line and helping create a Broncos win by 10 points or more,\" Roberts says. The SportsLine Projection Model says Denver has a 55% chance to cover and gives a \"B\" grade to Broncos -7.5.</p><p><strong>More <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> best bets</strong></p><ul><li>Best <span><a href=\"https://www.cbssports.com/nfl/news/best-sportsbook-promos-for-monday-night-football-betting-promos-for-jets-dolphins-bengals-broncos/\" target=\"_blank\">sportsbook promos for Dolphins-Jets, Bengals-Broncos</a></span></li><li>Model's <span><a href=\"https://www.cbssports.com/nfl/news/week-4-nfl-player-props-mnf-predictions-odds-top-dolphins-vs-jets-broncos-vs-bengals-picks/\" target=\"_blank\">top player props for Monday night</a></span></li><li>Model's <span><a href=\"https://www.cbssports.com/betting/news/dolphins-vs-jets-broncos-vs-bengals-anytime-touchdown-scorer-odds-picks-back-devon-achane-on-mnf/\" target=\"_blank\">anytime touchdown scorer props for Monday night</a></span></li><li>Will Brinson's <span><a href=\"https://www.cbssports.com/nfl/news/nfl-week-4-monday-night-football-betting-guide-best-bets-for-jets-vs-dolphins-bengals-vs-broncos/\" target=\"_blank\">top Monday Night Football plays</a></span></li><li>Jimmie Kaylor's <a href=\"https://www.sportsline.com/insiders/nfl-dfs-picks-jets-vs-dolphins-broncos-vs-bengals-fantasy-lineup-advice-monday-night-football-projections-for-draftkings-fanduel-from-millionaire-maker-contest-winner/\" target=\"_blank\">top DFS picks for Dolphins-Jets, Bengals-Broncos</a> ($)</li></ul><h2>Looking ahead</h2><h3>Tigers at Guardians </h3><p><strong>Time:</strong> Tuesday, 1:08 p.m. | <strong>Location: </strong>Cleveland | <strong>TV:</strong> ESPN | <strong>Stream: </strong><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=365718\" target=\"_blank\">Fubo</a> (Try for free)</p><p><strong><a href=\"https://www.sportsline.com/mlb/game-forecast/MLB_20250930_DET@CLE/\" target=\"_blank\">SportsLine picks</a> -- Model:</strong> Guardians +139 | <strong>Expert:</strong> Guardians +1.5 -138 (Matt Severance)</p><p>The Cleveland Guardians and Detroit Tigers collide in Game 1 of their best-of-three American League Wild Card Series on Tuesday at Progressive Field. The Guardians enter the postseason as arguably the hottest team in baseball, having gone 19-4 over their final 23 games to overtake the Tigers and win the AL Central. Meanwhile Detroit is reeling, having gone 3-13 over its last 16 games, which includes a 1-5 record against Cleveland. The Game 1 pitching matchup features the Tigers' <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/3126008/tarik-skubal/\">Tarik Skubal</a> (13-6, 2.21 ERA) against the Guardians' <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2837689/gavin-williams/\">Gavin Williams</a> (12-5, 3.06). \"Williams has been about as good [as Skubal] of late -- team has won his past five overall -- and Cleveland owned the Tigers in the season series to steal the Central,\" Severance told SportsLine. The SportsLine Projection Model gives the Guardians a 48% chance to win and assigns a \"B\" grade to the Cleveland money line (+139).</p>\n            </div>"
  },
  {
    "title": "Mets manager Carlos Mendoza will return for 2026 season despite collapse, says executive David Stearns - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mets-manager-carlos-mendoza-will-return-for-2026-season-despite-collapse-says-executive-david-stearns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/54f5f87c-c695-4371-b044-78a85e79ae93/thumbnail/1200x675/8b762bc4a614e8acf2b2618eb39153e7/mendoza-getty.png",
    "tag": "Sports",
    "date": "2025-09-29T19:52:22.000Z",
    "description": "Getty Images                                    Despite collapsing out of a postseason berth the last few weeks, Carlos Mendoza will return as manager of the New York Mets next season, president of...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"mendoza-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/54f5f87c-c695-4371-b044-78a85e79ae93/thumbnail/770x433/8469757a7b96c6ff9dd0375539aafd8c/mendoza-getty.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p><span><a href=\"https://www.cbssports.com/mlb/news/inside-the-mets-collapse-how-juan-soto-and-the-340-million-club-imploded-all-the-way-out-of-a-playoff-berth/\" target=\"_blank\">Despite collapsing out of a postseason berth the last few weeks</a></span>, Carlos Mendoza will return as manager of the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/NYM/new-york-mets/\">New York Mets</a> next season, president of baseball operations David Stearns said Monday. The rest of the team's coaching staff will be evaluated in the coming weeks.</p><p>\"Carlos will be back next year,\" Stearns said, flatly.</p><p>Mendoza, 45, just wrapped up his second season with the Mets. He guided them to an 89-73 record and surprising run to the NLCS in 2024. This year, the Mets were 45-24 on June 12, the best record in baseball, but they went 38-55 the rest of the way, the fifth-worst record in the game. They went 83-79 overall and missed the playoffs on the final day of the season.</p><p>Stearns hired Mendoza two years ago. He was not a holdover manager from the previous front office regime, which may have bought him some rope following the team's collapse. Clearly though, some changes will be made. Things are never kept status quo after a team crumbles like this. Changes to Mendoza's coaching staff may only be the start.</p>\n<a href=\"https://www.cbssports.com/mlb/news/inside-the-mets-collapse-how-juan-soto-and-the-340-million-club-imploded-all-the-way-out-of-a-playoff-berth/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Inside the Mets' collapse: How Juan Soto and the $340 million club imploded all the way out of a playoff berth</p>\n                <p>\n                    Mike Axisa                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Inside the Mets' collapse: How Juan Soto and the $340 million club imploded all the way out of a playoff berth\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/28/c4dbc679-07a4-4ad3-8e70-a40ce0335f2f/thumbnail/270x152/8f11c40a4e1ddd69f61148f6a6678f38/soto-imagn-1.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Franchise home run leader <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2447476/pete-alonso/\">Pete Alonso</a> <span><a href=\"https://www.cbssports.com/mlb/news/pete-alonso-free-agency-mets-slugger-says-hell-opt-out-this-winter-but-well-see-what-happens/\" target=\"_blank\">said he will opt out of his contract and test free agency</a></span> following Sunday's loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIA/miami-marlins/\">Miami Marlins</a>, which officially eliminated the Mets. Other than Alonso, <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/1741213/starling-marte/\">Starling Marte</a>, and a few role players, there is not much coming off New York's roster via free agency. Stearns & Co. have their work cut out for them.</p><p>Of course, the Mets have a strong core in place. <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/1894627/francisco-lindor/\">Francisco Lindor</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2507367/juan-soto/\">Juan Soto</a> are an excellent 1-2 punch in the lineup, and the club has impressive rotation. As bad as the collapse was, the Mets are not far away from contention at all. </p><p>The Mets and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/CIN/cincinnati-reds/\">Cincinnati Reds</a> finished with identical 83-79 records. Cincinnati won the season series (4-2) and got the third wild card spot via tiebreaker.</p>\n<p>Owner Steve Cohen <span><a href=\"https://www.cbssports.com/mlb/news/mets-owner-steve-cohen-apologizes-to-fans-after-brutal-collapse-the-result-was-unacceptable/\" target=\"_blank\">apologized for the team's season earlier Monday</a></span>. </p>\n            </div>\n    </div>"
  },
  {
    "title": "Ravens star DT Nnamdi Madubuike out for remainder of 2025 season due to neck injury - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-star-dt-nnamdi-madubuike-out-for-remainder-of-2025-season-due-to-neck-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/83ea6d0c-c8db-4d71-a8ef-ddb884d760fc/thumbnail/1200x675/c272486a902a2e623172459c2093f75d/nnam.jpg",
    "tag": "Sports",
    "date": "2025-09-29T19:07:27.000Z",
    "description": "Getty Images                                    The 1-3 Baltimore Ravens are banged-up on both sides of the ball, and one of their stars is now out for the remainder of the year. Coach John Harbaugh...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"nnam.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/29/83ea6d0c-c8db-4d71-a8ef-ddb884d760fc/thumbnail/770x433/70c2dbd1c157beb8ed55cc2a7bff3493/nnam.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The 1-3 <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/BAL/baltimore-ravens/\">Baltimore Ravens</a> are banged-up on both sides of the ball, and one of their stars is now out for the remainder of the year. Coach <a href=\"https://x.com/Ravens/status/1972731554595024909\" target=\"_blank\">John Harbaugh announced</a> Monday that defensive tackle <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2249188/nnamdi-madubuike/\">Nnamdi Madubuike</a> would miss the rest of the season due to the neck injury suffered in the Week 2 victory over the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/CLE/cleveland-browns/\">Cleveland Browns</a>. </p><p>Baltimore placed Madubuike on<span><a href=\"https://www.cbssports.com/nfl/news/nnamdi-madubuike-injury-ravens-place-pro-bowl-defensive-lineman-on-injured-reserve-with-neck-injury/\" target=\"_blank\"> injured reserve last week</a></span>, but the initial hope was that he could return at some point in the year. That will no longer happen. In his two games this season, Madubuike recorded seven tackles, two sacks and three QB hits. </p><p>Madubuike is an incredibly important part of this Ravens defense. In 2023, he racked up 56 tackles and 13 sacks to go along with 33 QB hits, which led to him signing a <span><a href=\"https://www.cbssports.com/nfl/news/ravens-justin-madubuike-signs-massive-4-year-extension-that-reportedly-makes-him-1-of-nfls-highest-paid-dts/\" target=\"_blank\">four-year, $98 million deal</a></span>. Madubuike followed that up with a 6.5-sack campaign in 2024, which earned him Pro Bowl honors for the second straight year. His 56 pressures in 2024 ranked third among all defensive tackles. </p><p>The Ravens are off to their first 1-3 start since 2015, and they are allowing the most points per game (33.3) through four contests in franchise history. This defense has allowed at least 37 points in three out of the first four games of the season, granted Baltimore's schedule has been tough with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/BUF/buffalo-bills/\">Buffalo Bills</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DET/detroit-lions/\">Detroit Lions</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/KC/kansas-city-chiefs/\">Kansas City Chiefs</a>. </p>\n<p>Sunday's 37-20 loss to the Chiefs was particularly deflating, as cornerback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2139775/marlon-humphrey/\">Marlon Humphrey</a>, linebacker <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2180472/roquan-smith/\">Roquan Smith</a>, cornerback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/26699779/nate-wiggins/\">Nate Wiggins</a>, quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2181169/lamar-jackson/\">Lamar Jackson</a> and offensive tackle <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2005667/ronnie-stanley/\">Ronnie Stanley</a> were injured during the game. Baltimore will have to embrace the \"next man up\" mentality. Up next is the 1-3 <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/HOU/houston-texans/\">Houston Texans</a> at home on Sunday. </p>\n            </div>\n    </div>"
  },
  {
    "title": "Cubs vs. Padres 2025 Wild Card Series schedule, scores: Where to watch MLB playoff games, TV coverage - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/cubs-vs-padres-2025-wild-card-series-schedule-scores-where-to-watch-mlb-playoff-games-tv-coverage/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/28/0459e213-1f7b-4abe-a232-3ced16dcec76/thumbnail/1200x675/e330ef33f661fc50c6f4ffd9e740f51e/cubs-padres-getty.png",
    "tag": "Sports",
    "date": "2025-09-29T19:41:05.000Z",
    "description": "Getty Images                                    The best-of-three Wild Card Series begins Tuesday night at Wrigley Field. The Chicago Cubs will host the San Diego Padres and the winner will advance to...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"cubs-padres-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/28/0459e213-1f7b-4abe-a232-3ced16dcec76/thumbnail/770x433/ac73674a78b56ce7d89018d22e798790/cubs-padres-getty.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The best-of-three Wild Card Series begins Tuesday night at Wrigley Field. The <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/CHC/chicago-cubs/\">Chicago Cubs</a> will host the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/SD/san-diego-padres/\">San Diego Padres</a> and the winner will advance to take on the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIL/milwaukee-brewers/\">Milwaukee Brewers</a>, the National League's No. 1 seed. Both the Cubs and Padres were the second-place finishers in their divisions (NL Central and NL West, respectively), hence their wild card positions.</p><p>You can check out the complete 2025 <a target=\"_blank\" href=\"https://cbssports.com/mlb/\">MLB</a> playoff schedule and bracket. Below is the Wild Card Series schedule for the Cubs vs. Padres:</p><table><tbody><tr><th><br />  </th><th>Date</th><th>Start time/score</th><th>TV</th></tr><tr><td><p><strong>Game 1</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Tues., Sept. 30</p></td><td><p>3:08 p.m. ET</p></td><td><p>ABC</p></td></tr><tr><td><p><strong>Game 2</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Weds., Oct. 1</p></td><td><p>3:08 p.m. ET</p></td><td><p>ABC</p></td></tr><tr><td><p><strong>Game 3</strong> \t\t\t\t</p></td><td><p>Thurs., Oct. 2</p></td><td><p>TBA</p></td><td></td></tr></tbody></table><h2> Where to watch Game 1<br />  </h2><p><strong>Date:</strong> Tuesday, Sept. 1 | <strong>Time:</strong> 3:08 p.m. ET<br /> <strong>Location:</strong> Wrigley Field (Chicago)<br /><strong>TV channel: </strong>ABC | <strong>Live stream</strong>: <a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&ftv_campaign=MLB_Wild_Card_Series_Teams_TBA\" target=\"_blank\">Fubo</a> (try for free)<br /> <strong>Probable pitchers:</strong> RHP Nick Pivetta (SDP) vs. LHP Matthew Boyd (CHC)<br /><strong>Odds:</strong> CHI -123 | SDP +101 (via <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings</a>)</p>\n<p>Here now is what you need to know about each team in the Wild Card Series:</p><h2>Wild Card Series storylines</h2><p><strong>Cubs:</strong> The Cubs are in the postseason for the first time since 2020, and for the first time in a full 162-game season since 2018. They have not won a playoff series since 2017. Chicago made a blockbuster trade for outfielder <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2184352/kyle-tucker/\">Kyle Tucker</a> this past winter and has largely delivered, at least until finger and calf injuries sabotaged his second half. Tucker will be a free agent this coming offseason. A strong postseason would help the Cubbies and also serve him well come contract time. <span><a href=\"https://www.cbssports.com/mlb/news/cade-horton-injury-cubs-pitcher-likely-out-of-mlb-playoffs-through-nlds-after-suffering-broken-rib/\" target=\"_blank\">The Cubs will be without rookie Cade Horton through at least the NLDS because of a rib injury</a></span>. He might have been their Game 1 starter this postseason otherwise. Chicago scored the fourth-most runs per game and allowed the eighth-fewest runs per game in 2025. The Brewers and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/PHI/philadelphia-phillies/\">Philadelphia Phillies</a> were the only other teams to rank in the top eight of each.</p>\n<p><strong>Padres: </strong>This is the fourth postseason trip in six years for the Padres, who went to the playoffs five times in their first 50 seasons. They had a 2-1 series lead over the rival <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/LAD/los-angeles-dodgers/\">Los Angeles Dodgers</a> in last year's NLDS, but did not score another run in the series, and were eliminated. This year's team is built around run prevention. The Padres were middle of the pack in runs scored despite hitting the third-fewest home runs. Their bullpen, even with <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/1846226/jason-adam/\">Jason Adam</a> injured, is the best and deepest in the sport. Their path to success is scratching out a few runs early, then turning a lead over to <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2836849/jeremiah-estrada/\">Jeremiah Estrada</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/26911802/mason-miller/\">Mason Miller</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2803408/adrian-morejon/\">Adrian Morejon</a>, and closer <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/26861461/robert-suarez/\">Robert Suarez</a>.</p>\n            </div>\n    </div>"
  }
]