[
  {
    "title": "Kings vs. 76ers prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/kings-76ers-odds-prediction-spread-time-2026-nba-picks-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/2fbc3213-afec-46f1-9a09-1556deff5f6e/thumbnail/1200x675/df5885a79b551a9b2160f00eb0541b8f/joel-embiid-76ers.jpg",
    "tag": "Sports",
    "date": "2026-01-29T22:43:58.000Z",
    "description": "\n        The Sacramento Kings look to snap a six-game losing streak when they battle the Philadelphia 76ers in an inter-conference matchup on Thursday",
    "body": "\n        The Sacramento Kings look to snap a six-game losing streak when they battle the Philadelphia 76ers in an inter-conference matchup on Thursday. Sacramento is coming off a 103-87 loss at New York on Tuesday, while Philadelphia topped Milwaukee 139-122 that same night. The Kings (12-36), who are fifth in the Pacific Division, are 3-20 on the road this season. The 76ers (25-21), who are fourth in the Atlantic Division, are 13-13 on their home court. Keegan Murray (ankle) is out for Sacramento as is Russell Westbrook (foot). Joel Embiid (knee) is listed as probable.Tip-off from Xfinity Mobile Arena in Philadelphia is set for 7 p.m. ET. The 76ers lead the all-time series 174-130, but the teams have split each of the past four games. Philly is a 10.5-point favorite in the latest 76ers vs. Kings odds from DraftKings Sportsbook, while the over/under for total points scored is 230.5. Before making any Kings vs. 76ers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Kings vs. 76ers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for 76ers vs. Kings:Kings vs. 76ers                                                                                                                 spread:    Philadelphia -10.5 at DraftKings    Kings vs. 76ers                                                                                                                               over/under:    230.5 pointsKings vs. 76ers                                                                                                                               money line:    Sacramento +483, Philadelphia -368Kings vs. 76ers                                                                                                                               picks:    See picks at SportsLineKings vs. 76ers                                                                                                                               streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Kings vs. 76ers picksAfter 10,000 simulations of Sixers vs. Kings, SportsLine's model is going Over on the total (229.5). The Over has hit in four of the last five Sacramento games, and in three of their last five Philadelphia matchups. Sacramento is 5-5 against the spread in its last 10 games, while the 76ers are 4-6 ATS in their last 10.The SportsLine model is projecting Sacramento's DeMar DeRozan to score 19.2 points on average and be one of five Kings players to score 14.4 or more points. Philadelphia's Tyrese Maxey, meanwhile, is projected to have 26.7 points as six 76ers players score 11.5 points or more.It has also generated an against-the-spread pick that hits nearly 70% in simulations. You can head to SportsLine to see the model's NBA picks. So who wins Kings vs. Sixers, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Kings vs. 76ers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kings vs. 76ers prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/2fbc3213-afec-46f1-9a09-1556deff5f6e/thumbnail/1200x675/df5885a79b551a9b2160f00eb0541b8f/joel-embiid-76ers.jpg"
      ],
      "datePublished": "2026-01-29T22:43:58.000Z",
      "dateModified": "2026-01-29T22:43:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thunder vs. Timberwolves prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/thunder-timberwolves-odds-prediction-time-spread-2026-nba-picks-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/982a81b6-ed6b-431c-a346-c9f35f1a1957/thumbnail/1200x675/ce4670dd5fdc6e26a088e667e3919cf6/untitled-design-2026-01-14t005630-112.png",
    "tag": "Sports",
    "date": "2026-01-30T00:25:30.000Z",
    "description": "\n        The two teams who met in last season's Western Conference Finals will get reacquainted on Thursday's NBA schedule as the Oklahoma City Thunde",
    "body": "\n        The two teams who met in last season's Western Conference Finals will get reacquainted on Thursday's NBA schedule as the Oklahoma City Thunder visit the Minnesota Timberwolves. OKC (38-10) won that West Finals series in five games and is coming off a 104-95 victory over New Orleans on Tuesday. Minnesota (29-19) has won back-to-back outings, most recently defeating Dallas, 118-105, on Wednesday. Guard Jalen Williams (hamstring) is out for Oklahoma City. Mike Conley (back) is out for Minnesota, while Rudy Gobert (ankle) is questionable. Tipoff is at 9:30 p.m. ET from the Target Center in Minneapolis. These teams have alternated wins and losses over their last eight regular-season matchups, with the Wolves prevailing in the last meeting. The latest Timberwolves vs. Thunder odds have OKC as 6.5-point favorites per DraftKings Sportsbook, while the over/under for total points scored is 228.5. Before making any Thunder vs. Timberwolves picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   Now, the model has simulated Timberwolves vs. Thunder 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Thunder vs. Timberwolves:Timberwolves vs. Thunder                                                                                                        spread:    Oklahoma City -6.5 at DraftKings    Timberwolves vs. Thunder                                                                                                                       over/under:    228.5 pointsTimberwolves vs. Thunder                                                                                                                       money line:    Thunder -229, Timberwolves +188Timberwolves vs. Thunder                                                                                                                       picks:See picks at SportsLineTimberwolves vs. Thunder                                                                                                                      streaming:Prime VideoNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:\nHow to make Thunder vs. Timberwolves picksAfter 10,000 simulations of Wolves vs. Thunder, SportsLine's model is going Over on the total (228.5). Three of their last four matchups in Minnesota have gone Over, and these are two of the most potent offenses in the NBA. The Thunder lead the league in scoring and rank among the top three in field goal percentage, 2-point percentage and free throw percentage. As for the Wolves, they own the No. 5 scoring offense and also boast top-5 rankings in field goal percentage and 3-point percentage.OKC will be without defensive ace Alex Caruso (adductor) and All-Defensive member in Jalen Williams, while Cason Wallace (hip), who ranks second in the NBA with 2.1 steals per game, is questionable. That's lots of firepower on the defensive end for the Thunder, which is why the model projects them to allow nearly 5 more points than their regular season average. With that, the Over hits 51.8% of the time.It has also generated an against-the-spread pick that hits well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Thunder vs. Wolves, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Timberwolves vs. Thunder spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thunder vs. Timberwolves prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/982a81b6-ed6b-431c-a346-c9f35f1a1957/thumbnail/1200x675/ce4670dd5fdc6e26a088e667e3919cf6/untitled-design-2026-01-14t005630-112.png"
      ],
      "datePublished": "2026-01-30T00:25:30.000Z",
      "dateModified": "2026-01-30T00:25:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bucks vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/bucks-wizards-odds-prediction-spread-time-2026-nba-picks-bets-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/04/22/b6df075c-1f17-438d-bda7-c6a435d4fa04/thumbnail/1200x675/f07334e1a2f6adfb00c93a020cc49fae/kuzma.jpg",
    "tag": "Sports",
    "date": "2026-01-29T22:48:34.000Z",
    "description": "\n        Two teams hoping to stay afloat in the Eastern Conference will meet on Thursday's NBA schedule as the Milwaukee Bucks visit the Washington Wi",
    "body": "\n        Two teams hoping to stay afloat in the Eastern Conference will meet on Thursday's NBA schedule as the Milwaukee Bucks visit the Washington Wizards. The Bucks (18-27) have lost three in a row and are without Giannis Antetokounmpo (calf). The Wizards (11-34) did manage to win their last game, which ended a nine-game losing streak. Alex Sarr (illness) is listed as questionable for the Wizards, while Kevin Porter Jr. (oblique) is also out for Milwaukee.Tipoff is at 7 p.m. ET from the Capital One Arena in Washington, D.C. The Wizards have won two of three matchups this season. The latest Wizards vs. Bucks odds have Milwaukee as 2.5-point favorites per DraftKings Sportsbook, while the over/under for total points scored is 222.5. Milwaukee is at -135 on the money line (risk $135 to win $100), with Washington priced at +114 (risk $100 to win $114). Before making any Bucks vs. Wizards  picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Wizards vs. Bucks 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Bucks vs. Wizards:Wizards vs. Bucks                                                                                                        spread:    Milwaukee -2.5 at DraftKings    Wizards vs. Bucks                                                                                                                       over/under:    222.5 pointsWizards vs. Bucks                                                                                                                       money line:    Bucks -134, Wizards +113Wizards vs. Bucks                                                                                                                       picks:    See picks at SportsLineWizards vs. Bucks                                                                                                                      streaming:Prime VideoNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Bucks vs. Wizards  picksAfter 10,000 simulations of Wizards vs. Bucks, SportsLine's model is going Under on the total (222.5). With a 27-18 Under record this season, no team has seen their games hit the Over fewer times than the Bucks. The Under is 4-1 over Milwaukee's last five games and is 6-2 over its last eight contests. Meanwhile, the Wizards have failed to reach the total in three of their last four games.When the Bucks travel, the Under is hit in 67% of games as the Under has a 16-8 mark for Milwaukee on the road. With the Bucks down their two leading scorers in Antetokounmpo and Porter, and with Washington ranking 26th in scoring, the model is behind the Under hitting on Thursday. The total fails to get reached in 55.2% of simulations, per SportsLine's advanced model.It has also generated an against-the-spread pick where one side has all of the value. You can head to SportsLine to see the model's NBA picks. So who wins Bucks vs. Wizards, and which side of the spread has all of the value? Visit SportsLine now to see which side of the Wizards vs. Bucks spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bucks vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/04/22/b6df075c-1f17-438d-bda7-c6a435d4fa04/thumbnail/1200x675/f07334e1a2f6adfb00c93a020cc49fae/kuzma.jpg"
      ],
      "datePublished": "2026-01-29T22:48:34.000Z",
      "dateModified": "2026-01-29T22:48:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WWE Royal Rumble 2026 predictions: Picks for who will win each 30-person match - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-royal-rumble-2026-predictions-entrants-card/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/24ec7966-133a-45f6-90e1-54a1bc3a11c9/thumbnail/1200x675/c287349b00b3f00594a98dd380075e4e/jey-uso-2025-royal-rumble-winner.jpg",
    "tag": "Sports",
    "date": "2026-01-30T00:42:34.000Z",
    "description": "\n        Two superstars will change their fortunes at the WWE Royal Rumble. On Saturday, one man and one woman will secure world title matches at Wres",
    "body": "\n        Two superstars will change their fortunes at the WWE Royal Rumble. On Saturday, one man and one woman will secure world title matches at WrestleMania 42. Every year, the Royal Rumble jump-starts the Road to WrestleMania. Superstars throw each other over the top rope with hopes of winning the Rumble. This year, Cody Rhodes seeks to become only the second superstar to win three Rumbles, a feat achieved only by \"Stone Cold\" Steve Austin. That's a tall task with a stacked field featuring Roman Reigns, Jacob Fatu and Bron Breakker.Nine former world champions are set for the women's Rumble, including Becky Lynch and Liv Morgan. Rounding out the card is Drew McIntyre's first undisputed WWE title defense against Sami Zayn, plus the potential finale of \"The Phenomenal\" AJ Styles. It's a high-stakes retirement match pitting Styles' career against Gunther's Rumble spot.\n        \n            \n                WWE burning questions for the Road to WrestleMania 42: Who wins the Royal Rumble, Elimination Chamber and more\n                \n                    Shakiel Mahjouri                \n            \n                            \n    \n                \n                    \n    \nWith so many big matches set for the event, let's take a look at what   the CBS Sports pro wrestling experts think will happen when the action   goes down in Riyadh, Saudi Arabia.\n2026 WWE Royal Rumble predictionsMen's Royal Rumble match: While WWE pulled a brilliant move last year by having Jey Uso win the Rumble to the surprise of everyone, it feels as though there is a good chance that this year's edition gets the \"expected winner\" treatment. Breakker is very clearly positioned to challenge CM Punk for the world heavyweight championship at WrestleMania. While Oba Femi might be the man who has the standout Rumble performance, Breakker has the backing of The Vision, who has agreed to help Breakker get the win. It's not the most shocking outcome, but it makes plenty of sense to set up a big match for WrestleMania. Pick: Breakker wins -- Brent Brookhouse (also Shakiel Mahjouri)Women's Royal Rumble match: Where is Belair? She contributed to the best match of WrestleMania 41 weekend, a women's world title match with Rhea Ripley and Iyo Sky. During the match, she suffered a finger injury that sidelined her for over eight months. In July, Belair told CBS Sports that she was at \"the tail end of this healing process,\" but we still haven't seen her wrestle. She re-entered the women's world title scene on the road to WrestleMania last year. I cross my fingers that she does the same this year as a surprise entrant. Pick: Belair wins -- Mahjouri (also Brookhouse) Undisputed WWE Championship -- Drew McIntyre (c) vs. Sami Zayn: Sometimes, you have to just look at a match and think, \"Hey, why not?\" It's fairly clear that Zayn will eventually have a run with a world title, and this is an easy opportunity to put the title on him for a month or two before taking it off of him ahead of WrestleMania. It probably makes sense to keep the title on McIntyre, but if we aren't going to get surprising Rumble winners, why not a surprising title change? Pick: Zayn wins -- Brookhouse\nMcIntyre and Zayn both deserve solid world title reigns, but the defending champ deserves it slightly more. This version of McIntyre has repeatedly fallen short, or had his reign ended the same night it started. McIntyre must win his first title defense, especially amid his feuds with Rhodes and Fatu. I'm not sure McIntyre enters WrestleMania, let alone leaves it, with the undisputed WWE title, but he should hold it past the Rumble. Pick: McIntyre wins -- Mahjouri  AJ Styles vs. Gunther: Do I want Gunther to win? No. I want Styles, my all-time favorite professional wrestler, to deny a loss that would see him retire. I want him to steal Gunther's Rumble spot and win the 30-man match, 10 years after he debuted at the same event, before he retires in 2026. I want him to headline WrestleMania and further his phenomenal legacy. The story is right there. Sometimes the obvious decision is the right one, but I'm not confident WWE will see it through. Reports about creative shake-ups inspire some hope, but not enough to pick against the modern-day legend killer. Pick: Gunther wins -- Mahjouri  Styles isn't going to lose a retirement match. Sure, they could do a rerun of the referee missing Gunther tapping out only for Gunther to win and then reverse the decision on Raw, but that feels unnecessarily complicated. Rather than jumping through unnecessary hoops, Styles should just get the win and continue along his final year as an active wrestler. Pick: Styles wins -- Brookhouse  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WWE Royal Rumble 2026 predictions: Picks for who will win each 30-person match - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/24ec7966-133a-45f6-90e1-54a1bc3a11c9/thumbnail/1200x675/c287349b00b3f00594a98dd380075e4e/jey-uso-2025-royal-rumble-winner.jpg"
      ],
      "datePublished": "2026-01-30T00:42:34.000Z",
      "dateModified": "2026-01-30T00:42:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 predictions, best bets to consider for the main card in Australia - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-predictions-odds-best-bets-alexander-volkanovski/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/22fda8a6-2c4b-4580-8cc6-0ba223077e77/thumbnail/1200x675/faa8726ed81107fbfd26d814dad41a77/alex-volkanovski-shirtless-325.jpg",
    "tag": "Sports",
    "date": "2026-01-30T00:55:24.000Z",
    "description": "\n        UFC 325 is set to go down in Australia this Saturday, making for a second consecutive weekend with a numbered UFC event. In the night's main ",
    "body": "\n        UFC 325 is set to go down in Australia this Saturday, making for a second consecutive weekend with a numbered UFC event. In the night's main event, featherweight champion Alexander Volkanovski will face Diego Lopes in a rematch.Volkanovski won the first meeting at UFC 314 by unanimous decision. That win kicked off Volkanovski's second reign as champion after he'd dropped the title to Ilia Topuria in February 2024.The rest of the card is loaded with fights with the potential to deliver serious action.As with any UFC pay-per-view event, there's sure to be plenty of action at the sportsbook window, and with that in mind, we are taking a look at the best bet to make for every main card fight at UFC 325.\nSign up for Paramount+ and watch UFC 325 live on Saturday night for no additional fee -- every UFC numbered event and UFC Fight Night is included with the price of your subscription! Plans start as low as $8.99/month or $89.99/year!After going 31-25 for our best bets in 2025, we kicked off 2026 by going 3-2 at UFC 324. Now we look ahead to this weekend, with our only rule remaining that all bets must be at odds of -250 or better. Let's take a look at this week's picks with odds via DraftKings Sportsbook.  Bet UFC 325 at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:\nQuillan Salkilld\tvs.\tJamie MullarkeyQuillan Salkilld via KO/TKO/DQ (-145)Salkilld scored two massive knockouts in three 2025 victories, including the CBS Sports Knockout of the Year. Mullarkey is 4-4 since 2022, and he has been stopped by knockout or TKO in all four of his losses. Salkilld averages 1.3 more strikes landed per minute and absorbs nearly one less. All of that adds up to a fair chance that Salkilld scores yet another viral knockout to rile up his countrymen.Tai Tuivasa\tvs.\tTallison TeixeiraTallison Teixeira via KO/TKO/DQ (-225)Teixeira is coming off a disappointing TKO loss to Derrick Lewis on a somewhat questionable stoppage. That said, Tuivasa is on a five-fight losing skid and lacks the unique physical tools Teixeira has. Teixeira is a towering 6-foot-7, giving him a five-inch advantage in height over Tuivasa. Teixeira utilizes all four limbs well in his attack and that should allow him to bully Tuivasa both at distance and in the clinch. This seems like it will be Tuivasa's last ride in the UFC.Rafael Fiziev\tvs.\tMaurício RuffyRafael Fiziev moneyline (+100)Fiziev vs. Ruffy is a very even fight on paper, which means you have to find the little edges where the fight can be decided. Both men have power in their strikes, though Ruffy may be a little more fluid in his attack. But in Ruffy's most recent fight, a second-round submission loss to Benoit Saint Denis, he was taken down repeatedly and showed no ability to get off his back. Fiziev has never been a guy who focuses on his grappling, except that he has six takedowns in his two most recent fights. His team has no doubt planned for exploiting that weakness in Ruffy's game and that gives Fiziev enough of an edge to take him in this pick'em fight.\nDan Hooker\tvs.\tBenoit Saint DenisBenoit Saint Denis via KO/TKO/DQ or Submission (-130)Saint Denis suffered a pair of brutal back-to-back losses to Dustin Poirier and Renato Moicano in 2024 but has rebounded with three impressive victories. Hooker represents the exact kind of opponent that Saint Denis can unload his entire game on. Hooker is very wide-open in his attack, absorbing as many significant strikes as he lands per minute and with good, but not great, takedown defense. Saint Denis averages nearly five takedowns per 15 minutes, while Hooker defends takedowns at 77%. Saint Denis should be able to take advantage of Hooker's defensive holes, both in striking and in grappling. Once Saint Denis gets rolling, he should be able to find a finish against Hooker, who has seven stoppage losses in his career.Alexander Volkanovski vs.\tDiego LopesAlexander Volkanovski moneyline (-148)I struggle to see any reason why this rematch looks much different from the first meeting. Volkanovski is one of the craftiest fighters of the era, rarely making mistakes. There's no shame in losing to Islam Makhachev and Ilia Topuria, who may be the two best fighters on the planet. Is Lopes in that group? I don't believe so. Lopes is good enough to get the win, as he showed when he hurt Volkanovski late in their first meeting. But Volkanovski is the better all-around fighter, and he is the favorite for a reason. We'll roll with Volkanovski to repeat his victory and continue to build his resume as one of the greatest featherweights in history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 predictions, best bets to consider for the main card in Australia - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/22fda8a6-2c4b-4580-8cc6-0ba223077e77/thumbnail/1200x675/faa8726ed81107fbfd26d814dad41a77/alex-volkanovski-shirtless-325.jpg"
      ],
      "datePublished": "2026-01-30T00:55:24.000Z",
      "dateModified": "2026-01-30T00:55:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325: What Alexander Volkanovski and Diego Lopes can change in rematch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-main-event-fight-alexander-volkanovski-diego-lopes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/1a39050e-110d-42dc-bfa8-0e6f3cb9e63e/thumbnail/1200x675/c50476890915f355684c96948b2799b5/volkanovski-lopes-shirtless-presser.jpg",
    "tag": "Sports",
    "date": "2026-01-30T01:35:38.000Z",
    "description": "\n        Nine months after he outpointed Diego Lopes for the vacant featherweight title, Alexander Volkanovski will make the first defense of his seco",
    "body": "\n        Nine months after he outpointed Diego Lopes for the vacant featherweight title, Alexander Volkanovski will make the first defense of his second title reign on Saturday in a rematch headlining UFC 325 in Sydney, Australia. The biggest narrative surrounding the rematch, which was booked just months after Lopes rebounded to finish Jean Silva in a thrilling slugfest headlining Noche UFC in September, is whether Lopes (27-7) can improve at all on his performance at UFC 314 when he dropped and twice hurt Volkanovski (27-4) but was unable to put him away in a clear decision loss. Even though Lopes even getting the immediate rematch was somewhat controversial in the eyes of fans considering he leapfrogged top contenders Movsar Evloev (who defeated him in 2023) and Lerone Murphy, the 31-year-old native of Brazil has said all of the right things about what he learned from his loss to Volkanovski. \"When I look back at the first fight, I know that I had big moments but I am grateful because the first fight with Volk taught me a lot of different things [about] my life and my career,\" Lopes told CBS Sports on Wednesday. \"I fixed those things and now I am a completely different fighter compared to the first fight. Now, I have the experience [of] fighting five rounds and now I have the experience of being in the main event with the cameras behind me. Nothing is new for me now so I don't have the pressure.\"\nSign up for Paramount+ and watch UFC 325 live on Saturday night for no additional fee -- every UFC numbered event and UFC Fight Night is included with the price of your subscription! Plans start as low as $8.99/month or $89.99/year!Lopes, who moved to Mexico at age 19 to become a jiu-jitsu instructor and where he has now set up shop at the Lobo Gym in Guadalajara, now readily admits the moment was too big for him nine months ago and it forced him to abandon his wrestling, throw away his coaches' gameplan and methodically follow Volkanovski around the cage -- without cutting it off -- in search of a one-punch knockout. \n        \n            \n                UFC 325 predictions, odds, best bets: Alexander Volkanovski, Benoit Saint Denis among top picks to consider\n                \n                    Brent Brookhouse                \n            \n                            \n    \n                \n                    \n    \nThe simplistic nature of Lopes' attack turned out to be easy pickings for Volkanovski, who picked Lopes apart in the opening round (before surviving a knockdown of his own in Round 2) and was able to turn back the clock by reclaiming the 145-pound title he had lost one year earlier via second-round knockout against Ilia Topuria. It's likely because Lopes made the fight so easy for Volkanovski in their first meeting that the 37-year-old legend isn't expecting a more difficult time in the rematch.\n\"I think there is a lot that I can capitalize on [because] I'm capable of changing things and [utilizing] a new strategy,\" Volkanovski told CBS Sports on Wednesday. \"Whether I want to take him down or fight at short range, I feel like I can make whatever adjustments are needed. But for him -- and this is not a knock on him -- but, what is he capable of? I hear people say that he is going to improve so much but I don't think I saw that in his last fight, to be honest. \"How much is he capable of changing? And, if he tries to, is that going to hold him back from what he does best? If he tries to outstrategize me, I think that just makes it a lot harder for him. And if he does plan on doing that, that's going to completely change halfway through the first round.\" The biggest potential improvement for Lopes should come on the ground. Not only does he have an excellent submission base as the longtime jiu-jitsu coach of former UFC women's flyweight champion Alexa Grasso, he has committed himself to improving upon his wrestling game after all but abandoning it against Volkanovski. \nLopes, who made multiple trips in 2025 to Oklahoma State University to train under the guidance of former U.S. Olympic gold medalist David Taylor, showed improvements on the ground against Silva last fall when he utilized takedowns and top control to dominate his countryman in the opening round by landing heavy damage. \"In the first fight, many people asked me why I didn't try to take [Volkanovski] down,\" Lopes said. \"It's because I just tried to finish him with a big punch and a big connection but I forgot the gameplan. At the weigh in, I told my coach that maybe I would try to take him down but [Volkanovski] was a lot shorter, which makes it difficult. He is also so physically strong, too. But this time, I am more calm and more confident. Now, I want to take him down and use my jiu-jitsu and be more of a mixed martial artist.\"Although Volkanovski praised the danger level of Lopes' high-level submission game and the improvements he showed in taking Silva down, he doesn't expect it to be much of a factor in their second fight. \n\"For me, bring that on,\" Volkanovski said. \"Everyone knows about my takedown defense and wherever he takes it, I think it's going to be a rough night for him. I just have to prevent him from landing that big shot.\" \nIt's that one big shot that Volkanovski does have a lot of respect for. Lopes bloodied the left eye of Volkanovski in Round 2 and later dropped him in the closing seconds with a clubbing overhand right. Lopes also won Round 4 on two of the three judges' scorecards after hurting him with a right uppercut to the left eye that forced a wincing Volkanovski to shoot for a takedown.\"You have to put [Lopes' power] right up there because if you just look at the technique, even when he's landing, it's not even pure technique,\" Volkanovski said. \"It's sort of out of position punches. He even has a weird style sort of punch where mechanically it's not how you would fire a punch. Like, Ilia Topuria has got this perfect technique so you can understand why there is so much power behind it. But [Lopes] doesn't even need technique and it's just sheer power. \n\"I was hurting after that fight, I'll be honest. I had stitches all over me and was banged up. I had stitches inside my mouth and obviously I couldn't see out of my eye during the fourth round. So, I definitely felt the punches after, anyway.\"Volkanovski, who hasn't fought since his victory over Lopes, said that he loves when critics mention his age because that only makes his victories more sweet. Lopes, meanwhile, said that he hopes to bring the same type of chaos to the rematch that he thrived in during his wild second round against Silva, which ended with Lopes knocking him out with a spinning back elbow. For Volkanovski, a victory would give him a sixth featherweight title defense, which would place him one short of Jose Aldo's UFC record for the division and further make the case for \"Alexander the Great,\" who defeated Aldo by decision in 2019, as the greatest 145-pound fighter in history. But for Lopes, the motivation to bring home a world title is entirely different. \n\"I left my house like 11 years ago and I told my mom and my dad, 'Look, I'm leaving. I'm trying to look for the best life for all of us and I promise one day I will be champion of UFC,'\" Lopes said. \"Now, I have like 50 percent of this accomplished in my life. I can [provide] the best life for my mom, my dad and my brothers but I have one more thing and that's [to be] the best. I have this chance now. My goal is to take the belt and take a flight back to my city [of Manaus, Brazil] and to take the belt and say, 'Mom and dad, here. My promise is accomplished.'\"Who wins Volkanovski vs. Lopes, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $21,000 on his UFC picks since May 19, 2018, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325: What Alexander Volkanovski and Diego Lopes can change in rematch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/1a39050e-110d-42dc-bfa8-0e6f3cb9e63e/thumbnail/1200x675/c50476890915f355684c96948b2799b5/volkanovski-lopes-shirtless-presser.jpg"
      ],
      "datePublished": "2026-01-30T01:35:38.000Z",
      "dateModified": "2026-01-30T01:35:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samford vs. Furman prediction, odds, time, spread: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/samford-furman-odds-prediction-spread-time-2026-college-basketball-picks-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/06/807b9d2e-e3fc-41c6-b100-10aa3d3ce6cf/thumbnail/1200x675/5a24b27d96e6ce212c529b69ff438346/usatsi-24860668.jpg",
    "tag": "Sports",
    "date": "2026-01-29T20:15:34.000Z",
    "description": "\n        The Samford Bulldogs battle the Furman Paladins in a key Southern Conference matchup on Thursday. Samford is coming off a 75-64 win over Chat",
    "body": "\n        The Samford Bulldogs battle the Furman Paladins in a key Southern Conference matchup on Thursday. Samford is coming off a 75-64 win over Chattanooga on Saturday, while Furman downed UNC-Greensboro 89-66 on Friday. The Bulldogs (10-11, 3-5 SoCon), who are tied for sixth in the conference, are 3-7 on the road this season. The Paladins (14-7, 5-3 SoCon), who are tied for third in the Southern Conference, are 8-3 on their home floor.Tip-off from Timmons Arena in Greenville, S.C., is set for 5 p.m. ET and will air on CBS Sports Network. Furman leads the all-time series 30-12, including a 77-73 win on Jan. 14. The Paladins are 6.5-point favorites in the latest Furman vs. Samford odds from DraftKings Sportsbook, while the over/under for total points scored is 148.5. Furman is at -299 on the money line (risk $299 to win $100). Before making any Samford vs. Furman picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 13 on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and it is on a 6-0 roll on college basketball side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Samford vs. Furman 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Furman vs. Samford:Samford vs. Furman                                                                                                                                                        spread:    Furman -6.5 at DraftKings SportsbookSamford vs. Furman                                                                                                                                       over/under:    148.5 pointsSamford vs. Furman                 money line:    Samford +233, Furman -292Samford vs. Furman                                                                                                                                                                     picks:    See picks at SportsLineSamford vs. Furman                                                                                                                                                                     streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Samford vs. Furman picksSportsLine's model is going Over on the total (148.5 points). The Over has hit in five of the last seven Samford games, and in each of the last two Furman games. The Bulldogs are 3-5 against the spread in their last eight games, while the Paladins are 4-6 ATS in their last 10.The model projects the Bulldogs to have three players register 11.6 points or more, including Jadin Booth's projected 19.5 points. The Paladins, meanwhile, are projected to have four players score 11.3 or more points, led by Alex Wilkins, who is projected to score 19.8 points. The model projects a combined total of 154 points as the Over clears in well over 60% of simulations.The model also says one side of the spread hits nearly 60% of the time. You can only see that pick at SportsLine.So who wins Furman vs. Samford, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the Samford vs. Furman spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samford vs. Furman prediction, odds, time, spread: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/06/807b9d2e-e3fc-41c6-b100-10aa3d3ce6cf/thumbnail/1200x675/5a24b27d96e6ce212c529b69ff438346/usatsi-24860668.jpg"
      ],
      "datePublished": "2026-01-29T20:15:34.000Z",
      "dateModified": "2026-01-29T20:15:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie Carragher opens up about turning down Liverpool role, mental health - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/jamie-carragher-career-pressure-mental-health-liverpool-fc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/208d195d-23dd-404b-b782-759d62d25496/thumbnail/1200x675/18bebbad9bd454ac9abb63f609305136/carra.jpg",
    "tag": "Sports",
    "date": "2026-01-29T23:13:45.000Z",
    "description": "\n        One moment can change the trajectory of your life without even realizing it. This is especially something that can be the case with athletes,",
    "body": "\n        One moment can change the trajectory of your life without even realizing it. This is especially something that can be the case with athletes, where even over the course of a season, things can change drastically at the drop of a hat. Former Liverpool player and current CBS Sports analyst Jamie Carragher opened up on a situation like that in his own career as a player on Kickin' It on Paramount+.In his final season before retiring, Carragher said that he spoke with incoming Liverpool manager Brendan Rodgers over the phone, and the possibility of Carragher taking up a role as a player manager during the 2012-13 season came up. As Carragher recounts, it could've changed his entire career. \"We had a chat on the phone. We were on the phone for about an hour and a half, two hours just talking football and ideas and at the end of that conversation he offered me a coaching job as in a player coach because I said to him on the phone, 'You're a young manager, I'm an experienced player and I don't want you thinking that I'm going to put pressure on you like that like I'm going to be a problem for you if I'm not playing. I shouldn't be playing for Liverpool right now.'\"At that point, Carragher would've had a chance to see how he felt about coaching by testing the waters, but it didn't come to be. Rodgers never followed up on that discussion, and Carragher didn't ask him about it either, but he did acknowledge that it could've taken him on the management route instead of the current broadcast path.\nJust three or four months after that, he joined Sky Sports as a pundit, and the rest is history. But taking into account how he has seen management impact people in soccer, there is a chance that he wouldn't have enjoyed management in comparison to soccer punditry.\"I saw what the job did to two of the managers who were the biggest influence on me, Rafa Benitez and Gerard Houllier. I looked up to them, I had so much respect for them, they helped me so much,\" Carragher said. \"But the way I like to describe it is the guy who walked in the door on the first day was just a shadow of himself from the guy who walked out six years later.\"The mental toll that managing takes is something that Jurgen Klopp mentioned when leaving Liverpool, and even Argentina's Lionel Scaloni has also talked about why he's considered leaving the job because of it. There's constant pressure to be at your best each day, and it's only natural for it to take a mental toll after a while. Similar struggles face athletes as well, which is one of the reasons that Carragher doesn't miss being on the pitch, saying he is much happier now than when he played. The feeling that he misses the least is losing, but he explained that while he won't get the highs that the sport brings, he also won't experience the lows.\n\"Liverpool is great when things are going well, but a lot of that is joy and relief because you have 4-5 days when you can just relax and look forward to the game next week,\" Carragher said.\"Not every player is like that, and this isn't a criticism of them. I just think my whole life, from being six or seven, football has been in my head constantly every single day. I think I was too hard on myself, and I don't think I enjoyed it enough ... I should've given myself a little bit of slack. If I didn't play well or made a mistake, I'd be in my head for days.\" Carragher did speak about those mental issues with someone, but even when he was at the top of his game, he needed it being in the pressure cooker that is the Premier League. The cost of perfection in these situations made him believe that he couldn't make a mistake and cost the team points. Losing a ball in the air away to Atletico Madrid in the Champions League, which led to a draw for the Reds, was a bit of a sliding doors moment for Carragher, as he knew that he shouldn't be putting himself through that. \nHe spoke with someone every few months, and it was important to be able to speak to someone about what he was going through during his career, both the positive and the negative. This is an aspect of soccer that has been talked about more in recent years, but Carragher encourages others not be afraid to talk through things, finding it helpful in his situation.\n\"I needed the help when I was at my best,\" Carragher said. He spoke with someone every few months, and it was important to be able to speak to someone about what he was going through during his career, both the positive and the negative. This is an aspect of soccer that has been talked about more in recent years, but Carragher encourages others not be afraid to talk through things, finding it helpful in his situation.\n\"I needed the help when I was at my best,\" Carragher said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie Carragher opens up about turning down Liverpool role, mental health - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/208d195d-23dd-404b-b782-759d62d25496/thumbnail/1200x675/18bebbad9bd454ac9abb63f609305136/carra.jpg"
      ],
      "datePublished": "2026-01-29T23:13:45.000Z",
      "dateModified": "2026-01-29T23:13:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why new Yankees pitcher with a 6.18 career ERA could surprise in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/new-yankees-pitcher-angel-chivilli-trade/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/6f1d51a3-304a-4837-b828-b94e63b671d4/thumbnail/1200x675/7300855874b7b300e8b8e38c5dd02b53/angel-chivilli-getty.png",
    "tag": "Sports",
    "date": "2026-01-29T21:51:45.000Z",
    "description": "\n        The New York Yankees made a small trade with the Colorado Rockies on Wednesday, sending out minor-league first baseman T.J. Rumfield in excha",
    "body": "\n        The New York Yankees made a small trade with the Colorado Rockies on Wednesday, sending out minor-league first baseman T.J. Rumfield in exchange for right-hander Angel Chivilli. The Yankees haven't made many external additions this winter, so making an exception for a reliever coming off a season in which he surrendered an ERA over 7.00 (7.06, to be exact) would seem like an odd use of time and resources.Indeed, the 23-year-old Chivilli appeared in 73 games for the Rockies over the past two seasons, compiling marks that include a 6.18 ERA (78 ERA+) and a 2.15 strikeout-to-walk ratio. Last year alone, Baseball-Reference's estimates had him close to a win below replacement level. That's a fancy way of saying that he was perceived as pitching way worse than if the Rockies had picked a minor-league reliever at random and afforded him the same opportunity. Why bother?Because a deeper look at Chivilli's game reveals why he's a solid bet to far outperform his career statistics heading forward. Here are three particular reasons why Chivilli is an intriguing add.1. Innate traitsEarlier this winter, the Seattle Mariners traded catcher Harry Ford to the Washington Nationals for reliever Jose A. Ferrer. Ford is a top-100 prospect, albeit one whose value to the Mariners was diminished by Cal Raleigh's presence behind the plate; Ferrer, meanwhile, is a left-hander coming off a much better season than his inflated 4.48 ERA indicates.  \nWhy is that relevant to this deal? Because it demonstrates, among other points, that teams no longer look at ERA when they're evaluating pitchers. Additionally, they're not focused just on past performance when they're projecting the future. The Mariners can all but bank on Ferrer pitching better for them because of his quality arsenal and some of his underlying metrics.Chivilli is not as good as Ferrer, but there are more than a few similarities between them. They both throw hard (each average over 97 mph on their fastballs) with comparable capacities for spin, and they have close to identical arm angles and release points. The key differences are that Ferrer is left-handed; that he's fully leaned into throwing a sinker instead of a four-seamer (something that the Yankees may task Chivilli with doing); and that he has a nasty changeup with good sinking action (something else the Yankees may try to tweak with Chivilli).Those are legitimate differences and they help explain why Ferrer netted a top-100 prospect and Chivilli did not. Still, the comparison is less important than the larger takeaway, with that being that pitchers cannot be assumed to be finished products anymore, not when they have loud innate traits.\n2. Low-hanging fruitThere's clear room for improvement with Chivilli's game even if he doesn't add to or otherwise modify his arsenal. Part of that is because he's escaping Coors Field, the most favorable offensive environment in the majors. Part of it, too, is because his pitch mix leaves room for optimizing.Last year, Chivilli threw his fastball 46% of the time -- that despite it being his worst pitch from a swing-and-miss perspective. His secondary pitches, a changeup and slider, both had whiff rates above 40%. Yet Chivilli threw fewer than 20% sliders despite it grading as his best weapon through the eyes of various public-facing pitch-quality models.There's more to more to this than just throwing the pitch with the most whiffs, especially if the pitcher in question lacks the usability to throw said offerings for strikes often enough. Even so, it's easy to look at Chivilli and envision the Yankees having him follow the pathway cut out by Fernando Cruz, who upped his splitter usage by 20 percentage points (all the way over 60%) upon joining the Yankees.\nThat's the kind of low-hanging fruit that inspires confidence Chivilli will be much better heading forward than you might otherwise expect given his body of work.3. OptionsYou can be excused if \"can this player be sent to the minors?\" isn't one of the first questions you ask of a new addition. Front offices have to be mindful of the answer to that question, however, as an essential part of the team-building process -- particularly when it comes to assembling a bullpen.For those unaware, most players receive several minor-league \"options\" that kick into effect after the player is placed on the 40-player roster. MLB now caps how many times a player can be sent down throughout a season, but for three seasons (and sometimes four, in case of injury) the player can be moved between the majors and minors without requiring a trip through waivers. In other words, that player's team can rely on them being part of their depth chart for the rest of the year.\nChivilli, for his part, has another option year remaining. That's especially important to the Yankees, who are projected to have just three optionable pitchers in their bullpen: Camilo Doval, Fernando Cruz, and Jake Bird. Doval and Cruz aren't heading to the minors unless something goes wrong, and the Yankees can only hope that Bird fares better than last year's introduction to New York. Regardless, the Yankees are largely landlocked with their bullpen and needed some optionable depth in a bad way.It's easy to see a scenario where Chivilli opens the season in the minors, where he can serve as insurance against injury/underperformance and work on some suggested tweaks away from the public eye that comes with pitching in the majors. At some point throughout the year, he's going to be summoned for a real opportunity to pitch for the big-league club -- and he just might surprise.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why new Yankees pitcher with a 6.18 career ERA could surprise in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/6f1d51a3-304a-4837-b828-b94e63b671d4/thumbnail/1200x675/7300855874b7b300e8b8e38c5dd02b53/angel-chivilli-getty.png"
      ],
      "datePublished": "2026-01-29T21:51:45.000Z",
      "dateModified": "2026-01-29T21:51:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Today: Bounceback candidates to target for 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-today-bounceback-candidates-to-target-for-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/19/8dae2703-6fd1-43bc-bb23-2589e7f6aa34/thumbnail/1200x675/32067c0b75a564eb513c660ac93b8c79/jayden-daniels-commanders-11.jpg",
    "tag": "Sports",
    "date": "2026-01-30T03:39:25.000Z",
    "description": "\n\n\n    \n                                    Injuries, coaching changes and new opportunities could fuel major rebounds in 2026\n        \n              ",
    "body": "\n\n\n    \n                                    Injuries, coaching changes and new opportunities could fuel major rebounds in 2026\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 29, 2026\n                            \n                    at\n    4:08 pm ET\n                        \n                •\n            \n            7 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        On our latest Fantasy Football Today podcast, we talked about players we're hoping to see rebound in 2026 after they struggled in 2025. Whether due to injury, poor play or just hoping for a change of scenery, these are guys we expect to get better next year.  Three excellent selections from Heath Cummings were Lamar Jackson, Justin Jefferson and Terry McLaurin. And, as you'll hear in the show, Adam Aizer expects three offenses that struggled in 2025 to get better in 2026 with Philadelphia, Tampa Bay and the Chargers. I'll cover my guys here with a bonus in Brock Bowers. As of now, these are all players I plan to target in 2026. BOUNCEBACK CANDIDATES Jayden Daniels In 2024, Daniels was the No. 5 Fantasy quarterback as a rookie at 23.9 points per game. His Average Draft Position in 2025 was the No. 4 quarterback, but he struggled with injuries and was limited to just seven games. He also averaged only 18.6 Fantasy points per game. But he averaged 22.4 Fantasy points in his first five outings, and it's easy to see him getting back to a high level in 2026 if he can stay healthy. He passed for 3,568 yards, 25 touchdowns, and nine interceptions in 2024, along with 891 rushing yards and six touchdowns. His rushing potential is elite, and the Commanders will hopefully add some talent in the passing game, especially since Deebo Samuel and Zach Ertz are pending free agents. I like Daniels as a top-five Fantasy quarterback in 2026.  Justin Herbert Herbert had a solid season in 2025 at 21.8 Fantasy points per game, but I'm hoping he'll get back to the level of production he had in the first two years of his career when he averaged at least 26.3 Fantasy points per game over that span. For starters, getting tackles Rashawn Slater (knee), who missed the entire season, and Joe Alt (ankle), who was limited to six games, back healthy for a full year will be huge. With Alt healthy, Herbert averaged 25.1 Fantasy points per game in 2025. Along with a healthy offensive line, Herbert should benefit with the addition of new offensive coordinator Mike McDaniel, who helped Tua Tagovailoa lead the NFL in passing yards in 2023. This could be a huge season for Herbert in 2026, and he has top-five upside if things go right.  Kenneth Walker III We'll see how Walker finishes the 2025 campaign since he's playing against New England in Super Bowl LX. But things are looking up for Walker in 2026 if he decides to return to Seattle. Zach Charbonnet (ACL) was injured in the Divisional Round of the NFL playoffs against San Francisco, and it's doubtful he'll be ready for the start of next season. Including the game against the 49ers, Walker played nearly three full games without Charbonnet in 2025 and averaged 24.9 Fantasy points over that span. Walker is a free agent this offseason, so we'll see where he plays in 2026, but I'm hopeful he returns to the Seahawks. He could be worth drafting as early as Round 2 in the majority of leagues, depending on how much time Charbonnet might miss next year.  Bucky Irving In the first four games of the 2025 season, when Irving was healthy, he looked like a star when he averaged 18 PPR points per game. He then missed seven games due to injury, and he struggled down the stretch by scoring 10.8 PPR points or less in each of his final four outings. Tampa Bay changed offensive coordinators this offseason, with Zac Robinson taking over, and he was just the play-caller in Atlanta with Bijan Robinson, which is a plus for Irving. Rachaad White is also an unrestricted free agent and isn't expected to return, and Sean Tucker is a restricted free agent. Most likely, Irving will share touches with Tucker, but I still have high hopes for Irving in 2026. Along with what he did to start 2025, he also closed the 2024 campaign by scoring at least 16.3 PPR points in seven of his final nine games. Depending on what happens this offseason, I plan to draft Irving no later than Round 3 in the majority of leagues.  Breece Hall I thought Hall would struggle in 2025, and he averaged a career-low 13.1 PPR points per game. He had respectable stats with 243 carries for 1,065 yards and four touchdowns and 36 catches for 350 yards and a touchdown on 48 targets, but we know he's capable of more. He averaged at least 15.1 PPR points per game in the first three seasons of his career, and I can see him getting back to that level of production -- or better -- in 2026. He's a free agent this offseason, but Jets general manager Darren Mougey has already said the team would like to retain Hall, whether that's on a new deal or the franchise tag. Ideally, he would leave the Jets and join a better offense, especially with an established quarterback, and then we can see just how good Hall really is in a better environment. But if he remains with the Jets, he can still be a standout Fantasy option, and hopefully the team keeps building on offense for 2026. I'm willing to draft Hall as early as Round 3 in the majority of leagues.  CeeDee Lamb Lamb had the worst Fantasy season of his career since his rookie campaign when he averaged just 14.4 PPR points per game in 2025. In 14 games, he had 75 catches for 1,077 yards and three touchdowns on 117 targets. Lamb was overshadowed by George Pickens, who led Dallas with 93 catches for 1,429 yards and nine touchdowns on 137 targets, and he averaged 17.2 PPR points per game. The easiest path for Lamb to rebound is if Pickens leaves the Cowboys since he's a free agent, and then Lamb would be a top-three Fantasy receiver in the majority of leagues. But I still value Lamb as a top-five Fantasy receiver even if Pickens returns. Dak Prescott still favors Lamb, who averaged at least 17.7 PPR points per game in each of the two previous seasons prior to 2025. That's the level of production I'm expecting for Lamb, and he should be a first-round pick in all formats in 2026.  A.J. Brown Brown had a down season in 2025 when he averaged just 15.1 PPR points per game, which was his lowest total since joining the Eagles in 2022. But it wasn't as bad as you might think. From Weeks 12-17, which includes the Fantasy playoffs, Brown averaged 19.8 PPR points per game, which is standout production. He had four games with at least 10 targets over that span, and he was back to being the alpha of the passing game. The Eagles just hired Sean Mannion to be their new offensive coordinator, and hopefully that will make Brown happy. We don't know if Philadelphia plans to trade Brown, although that seems unlikely given his contract. I'm still planning to draft Brown as a borderline No. 1 Fantasy receiver in the majority of leagues if he stays with the Eagles, and I'll target him as early as Round 3.\nLadd McConkey McConkey, along with Herbert, should benefit with the addition of McDaniel as the offensive coordinator, especially if Keenan Allen leaves as a free agent. McConkey just had a terrible season in 2025 at 11.7 PPR points per game, which was a huge drop-off from his 2024 production when he averaged 15.1 PPR points. But in 2025, McConkey had 11 games with at least six targets, and he averaged 14.2 PPR points per game over that span. McConkey should be the No. 1 receiver for McDaniel, who helped Tyreek Hill have consecutive seasons with at least 119 catches, 1,710 yards, seven touchdowns and 170 targets in Miami in 2022-23. McConkey won't do that, and he'll compete for targets with Quentin Johnston, Tre Harris and Oronde Gadsden II even if Allen is gone. But I'm excited for McConkey entering his third season in the NFL, and I would draft him as early as Round 3.  Brock Bowers Bowers was the No. 2 PPR tight end last season at 14.7 points per game, but he was far behind Trey McBride, who averaged 18.6. Bowers missed five games due to a knee injury, but he played hurt for three games after initially getting injured in Week 1. He missed three games after that and returned in Week 9 against Jacksonville and scored 43.3 PPR points. He has the potential to produce like McBride, if not better, but we still have questions for Bowers in 2026. We know he'll have a new quarterback (likely Indiana's Fernando Mendoza with the No. 1 overall pick) and a new head coach, and both of those guys should feature Bowers in 2026. I'm excited to see what happens in Las Vegas this offseason, and Bowers is worth drafting toward the end of Round 2 or beginning of Round 3 in all leagues.  Sam LaPorta LaPorta missed the final eight games of the season in 2025 with a back injury, but he's expected to be fine for the start of 2026. And I like the addition of new offensive coordinator Drew Petzing for LaPorta. Petzing was on Cleveland's offensive staff from 2020-22 (tight ends coach and quarterbacks coach), and the Browns tight ends had a target share of at least 26.2 percent over that span, with Austin Hooper twice being second on the team in targets. Then, Petzing went to Arizona as the offensive coordinator from 2023-25, and McBride led the Cardinals in targets for three years in a row. Arizona tight ends also had a target share of at least 32.4 percent in all three seasons. LaPorta averaged 14.1 PPR points per game as a rookie in 2023 and scored at least 13.3 PPR points in six of his final seven outings in 2024. He only averaged 11.9 PPR points per game in 2025 before getting hurt, but I plan to draft him as a top-seven Fantasy tight end with a mid-round pick in all leagues in 2026.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Today: Bounceback candidates to target for 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/19/8dae2703-6fd1-43bc-bb23-2589e7f6aa34/thumbnail/1200x675/32067c0b75a564eb513c660ac93b8c79/jayden-daniels-commanders-11.jpg"
      ],
      "datePublished": "2026-01-30T03:39:25.000Z",
      "dateModified": "2026-01-30T03:39:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Farmers Insurance Open leaderboard: Brooks Koepka makes PGA Tour return - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/farmers-insurance-leaderboard-2026-brooks-koepka-pga-tour-return/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/c089ace4-147d-4cb3-bc12-3f72df92f246/thumbnail/1200x675/0813774ba055fae51d581e6ae5bc88b3/brooks-koepka-farmers-return-g.jpg",
    "tag": "Sports",
    "date": "2026-01-30T00:10:33.000Z",
    "description": "\n        It is not often that five-time major champion Brooks Koepka is nervous, but nerves are what he expressed Tuesday when speaking with the media",
    "body": "\n        It is not often that five-time major champion Brooks Koepka is nervous, but nerves are what he expressed Tuesday when speaking with the media La Jolla, California, ahead of his return to the PGA Tour. Getting the hard part out of the way, Koepka was able to focus on golf alone Thursday as he signed for an opening 1-over 73 at the 2026 Farmers Insurance Open.\"[I was nervous] just because I care,\" Koepka said. \"I think I've fallen back in love with the game. And honestly, watching my son play a little bit and wanting to be able to see him watch me, or I guess want him to watch me play well and realize how much this game's given me, how fun it is and how cool it is to just be out here.\"Koepka's score positions him 11 strokes behind first-round leader Justin Rose, who blitzed the North Course at Torrey Pines with a stellar 10-under 62. As for those who played on the more difficult South Course, like Koepka, Seamus Power was the low man with a 7-under 65. Power and Koepka will face a less stern test on Friday as the North Course was more than three strokes easier than the South Course in Round 1.Not only did Koepka's return mark his first start on the PGA Tour (not including major championships) since the 2022 WGC-Dell Technologies Match Play, but Thursday saw him take his first competitive reps since the Alfred Dunhill Links Championship in early October 2025. As such, some form of rust was inevitable as he played alongside Max Homa and Ludvig Åberg.\n\"I felt like it was pretty good,\" Koepka said. \"I struck it really well. I didn't hit enough fairways. If I was able to get to the back of the ball, I felt like I hit a good quality shot. Didn't really make any putts besides 18 right there. Yeah, it felt good. It's been a while since I played competitive golf, so I like the way I'm playing. I just need to kind of play my way into it.\"For Koepka, it came off the tee and on the greens as he struggled to consistently position himself in the short grass, carding a single birdie despite giving himself a handful of quality looks. The 35-year-old started with a sweet-looking swing into the par-4 1st, where his approach left him 10 feet for an initial birdie that was not meant to be.Koepka hit his first four greens in regulation as he battled the right off the tee and put a bogey on the scorecard along the coast on the par-4 4th, where he required three putts from just about 50 feet. A missed opportunity came on the accessible par-5 6th as Koepka caught a ride on the par train as he rounded the turn in 1 over.\nHe did well to get through a difficult stretch of the golf course unscathed and arrived at the par-5 13th with a real chance to get back to even. After lashing a fairway wood out of the rough and short of the green, Koepka was on the receiving end of an unfortunate break as his third settled long of the green, leaving him a difficult up-and-down. Unable to save par, Koepka drifted to 2 over.The bogey may have brought another square to Koepka's scorecard, but it was also followed by fluid, compact swings. Koepka split his last two fairways and four greens in regulation. His second into the par-5 finisher sizzled through the green, leaving him another difficult scramble opportunity that he cashed in on to return to 1 over.\nAll in all, Koepka did not appear that far off. He was required to be defensive on most of his birdie putts as he left himself looks from above the hole. The breaks did not necessarily bounce his way, either. As the round progressed, he settled into his own. He remained patient and composed, and the good news is it will only get easier from here on out -- both because his play will take place on the North Course on Friday and because the noise surrounding his return should only get quieter.\n\"[I'm appreciating] everything,\" Koepka said. \"Just the opportunity to be out here. I think that's the main thing. Just being out here and seeing how quickly this has all kind of come together. It's kind of blown my mind, and I'm just grateful to be out here and have a chance to compete with these guys.\"Rose rises to the occasion on the North CourseThe ageless wonder! Rose ripped off 10 birdies late on Thursday to shoot up the leaderboard and command the solo first-round lead. The 45-year-old is no stranger to taking it deep early in the Farmers Insurance Open, as he opened his 2019 tournament with a 63. He ended up winning that event and looks keen to do the same just seven starts removed from his last victory at the St. Jude Championship in last summer's FedEx Cup Playoffs.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Farmers Insurance Open leaderboard: Brooks Koepka makes PGA Tour return - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/c089ace4-147d-4cb3-bc12-3f72df92f246/thumbnail/1200x675/0813774ba055fae51d581e6ae5bc88b3/brooks-koepka-farmers-return-g.jpg"
      ],
      "datePublished": "2026-01-30T00:10:33.000Z",
      "dateModified": "2026-01-30T00:10:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Gabriela Jaquez's breakout season and vocal leadership are powering UCLA - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/shooters-shoot-how-gabriela-jaquezs-breakout-season-and-vocal-leadership-are-powering-uclas-title-hopes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/f9d44061-b70c-462b-98d9-be81413b07da/thumbnail/1200x675/71901193a2cccdb883ab27c9a6252e92/gabriela-jaquez-entrance.png",
    "tag": "Sports",
    "date": "2026-01-29T20:12:23.000Z",
    "description": "\n        UCLA center Lauren Betts has only attempted two 3-pointers in her entire collegiate career, both this season. But every time she has an oppor",
    "body": "\n        UCLA center Lauren Betts has only attempted two 3-pointers in her entire collegiate career, both this season. But every time she has an opportunity to shoot from distance, nobody cheers louder than teammate Gabriela Jaquez.\"It's so cool to just see her growth,\" Jaquez told CBS Sports. \"I love her expanding her game to a perimeter shooter sometimes. I feel like I'm one of the biggest encouragers of her to shoot those shots. I'm like, 'Yeah Lauren, shoot a 3, shoot a 3!' I just want her to do it so bad.\"Jaquez is a big believer in instilling confidence in those she cares about, even when it comes to her NBA brother Jaime Jaquez Jr. When the Miami Heat forward was having a bad game recently, she sent him a text of encouragement.\"I just told him in one of his games when he was struggling with his shot, I'm just like, 'Shoot the ball. You can make a shot,'\" she said. \"Just something simple like that.\"\n\"Shooters shoot\" is practically Jaquez's motto and she's clearly been taking her own advice. She recently received a vote for Most Improved Player in the CBS Sports midseason awards, which was earned after going from shooting 52.3% from the floor and 34.8% from beyond the arc last season to 58% and 46.5% her senior year. Her 14.8 points per game might not sound that impressive, but she is one of the top contributors for a team that spreads its offense and has six players averaging over 9 points per game.She is not necessarily shooting a huge amount of 3-pointers every game, but she gets the job done when needed. Jaquez has gone 5 of 6 from 3-point range twice this season, including against a ranked Tennessee team late November when she scored a season-high 29 points.It has taken a lot of reps and help from coaches, but she has gained a lot of confidence as a shooter.\n\"I would say holding my follow through, making sure my elbow is in on my shooting pocket. I think two things were just really big,\" Jaquez said when asked what she worked on during the offseason. \"And then staying consistent and shooting the same way every time.\"\nBesides her shooting skills, Jaquez has helped the team by being a vocal leader on and off the court. After their loss against Texas during the Players Era tournament, UCLA had a players' only meeting led by Jaquez and Charlisse Leger-Walker. Since then, the Bruins are the No. 2 team in the country and have won 15 straight games for a 20-1 overall record. They are also one of just two undefeated teams in Big Ten conference play.UCLA is hosting the other undefeated team in the conference, No. 8 Iowa, on Sunday afternoon. It will be a big matchup, but Jaquez's advice for her teammates has been the same all season.\n\"I try to keep it simple, especially with my teammates,\" she said. \"Just being like, 'Guys, we know what to do.' And they kind of, not make fun of me, but kind of laugh. I'm just like, 'We play basketball. Do what we need to do and we'll be ok.' I just try to keep it not too serious. Obviously it's serious, but try to keep it simple.\"The game between No. 2 UCLA and No. 8 Iowa is set for Sunday at 4 p.m ET and will be available on FOX.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Gabriela Jaquez's breakout season and vocal leadership are powering UCLA - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/f9d44061-b70c-462b-98d9-be81413b07da/thumbnail/1200x675/71901193a2cccdb883ab27c9a6252e92/gabriela-jaquez-entrance.png"
      ],
      "datePublished": "2026-01-29T20:12:23.000Z",
      "dateModified": "2026-01-29T20:12:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NBA Slam Dunk Contest participants: Who is competing at All-Star Weekend? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-slam-dunk-contest-participants-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/efe55edb-6fb9-4a96-a42a-edb5a5c8a0c3/thumbnail/1200x675/46ef53e30b823d491b8a8d1bb46591f0/jaxson-hayes-getty.png",
    "tag": "Sports",
    "date": "2026-01-29T21:49:51.000Z",
    "description": "\n        Los Angeles Lakers center Jaxson Hayes and San Antonio Spurs rookie Carter Bryant have accepted invitations to participate in the 2026 Slam D",
    "body": "\n        Los Angeles Lakers center Jaxson Hayes and San Antonio Spurs rookie Carter Bryant have accepted invitations to participate in the 2026 Slam Dunk Contest at NBA All-Star Weekend in Los Angeles, according to ESPN. As of Thursday, no other invitees have been named.Hayes recently went between the legs for a slam on a fastbreak against the Chicago Bulls and is know for his high-flying theatrics. Hayes, a 7-footer, is averaging 6.4 points and 3.9 rebounds per game this season for the Lakers.\n                    JAXSON HAYES GOES BETWEEN THE LEGS FOR THE SLAM 🤯 pic.twitter.com/DCUKpU2HR0— NBA (@NBA) January 27, 2026\n    \nBryant, an athletic first-year player out of Arizona, has played in 37 games this season as a first-round pick. He is averaging 2.5 points and 1.7 rebounds in 8.1 minutes per game. \nThree-time Dunk Contest champion Mac McClung will not participate in next month's event after he was waived by the Indiana Pacers in November following a three-game stint.\n        \n            \n                2026 NBA All-Star Game rosters: 10 starters announced for new-look ASG\n                \n                    Cameron Salerno                \n            \n                            \n    \n                \n                    \n    \nWhile his NBA opportunities have been limited, McClung made a reputation as a supreme athlete with elite dunking ability. He won the league's midseason extravaganza at each of the last three All-Star weekends. McClung also boasts a track record as a G League standout and won the MVP award at the end of a stellar year with the Osceola Magic last fall.\nNBA All-Star Weekend will take place Feb. 13-15 at the Intuit Dome in Inglewood, California, home of the Los Angeles Clippers. The Dunk Contest is scheduled for Feb. 14. The 10 starters for the All-Star Game -- which will feature a new format -- were announced last week.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NBA Slam Dunk Contest participants: Who is competing at All-Star Weekend? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/efe55edb-6fb9-4a96-a42a-edb5a5c8a0c3/thumbnail/1200x675/46ef53e30b823d491b8a8d1bb46591f0/jaxson-hayes-getty.png"
      ],
      "datePublished": "2026-01-29T21:49:51.000Z",
      "dateModified": "2026-01-29T21:49:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League winners and losers: Jose Mourinho's Benfica come up clutch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-winners-and-losers-matchday-8/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/d527014f-5e48-4e0f-bef0-9d0f59a9032c/thumbnail/1200x675/20c46c0fb91cb95fb3cf09ca6d70f783/benfica-1.jpg",
    "tag": "Sports",
    "date": "2026-01-29T20:51:57.000Z",
    "description": "\n        What a day, what a day. A topsy-turvy Champions League league phase wrapped up in epic fashion, as 61 goals were scored, teams went back and ",
    "body": "\n        What a day, what a day. A topsy-turvy Champions League league phase wrapped up in epic fashion, as 61 goals were scored, teams went back and forth to push for winners, and we even got a goal from a goalkeeper. Matchday 8 had something for everyone, and while we'll mourn the loss of the Americans who won't be making it to the knockouts as well as Antonio Conte's Napoli and Roberto De Zerbi's Marseille, this was an ending for the ages, so let's take a look at some winners and losers from the final day of the league phase:Winner: Jose MourinhoFrom being confronted by Benfica supporters during the weekend because of them not being happy with the team's results lately, to taking down Real Madrid to push for an unlikely knockout stage berth. When Mourinho took over Benfica, they had already dropped two matches in the league phase, and it would take two more Champions League matches for Benfica to pick up their first points. They won three of their last four matches, but even then, it took a stoppage-time goal from keeper Anatoliy Trubin to make it happen. Not only is he the fifth keeper to score a goal in UCL play, but Mourinho didn't even realize that it was needed after going ahead 3-2 when chaos was ensuing. \"When I made the last changes, [Franjo] Ivanovic and Antonio Silva, I was told [that] is enough, so let's close the door. When I made the changes a few seconds later, they tell me we need one more goal, but I cannot make more changes, so that was the lucky point to get a free kick that allows us to go there with the big guy,\" Jose Mourinho said after the game. What a night under the lights in Europe.\"It's a wild moment in a game that had a bit of everything, and while it was a poor loss for Real Madrid, Champions League play always needs more Mourinho, and that's just what we're getting. \nLosers: NapoliWhile on one hand, you'd like to put Conte here, the Italian manager has been excellent at making it out of chaos unscathed. I mean, the man went from floundering at Tottenham to winning a Scudetto at Napoli. But they were unable to get the win they needed over Chelsea to move to the knockout stage. It has been the story of Napoli's season where they're so close to competing while also being so far from where they need to be. Some of this can be chalked up to not having a healthy Romelu Lukaku, who Conte was able to get a lot out of last season, but they're now nine points off Inter's pace for the Scudetto. It's hard to win a league title bin back to back campaigns, but a loss could see Napoli slip all the way to sixth behind Como. They are in the Coppa Italia for a chance at silverware this season but even that won't be enough to call the campaign a success. Watch out for the next poor result that Napoli have, because that could be when we get the biennial event of Conte walking away from a club.Winner: The league phase format\"This is unbelievable. Wow. We might never get another moment like this,\" CBS Sports Golazo analyst Jamie Carragher said after the matches wrapped with Benfica's crazy goal. And he's right.Genuinely, I can't count the number of changes that happened with teams shuffling during the final stages of the day. Three new teams, Bodo/Glimt, Club Brugge, and Benfica, all got into the top 24 on the final day of play, and half of the teams in the top eight also shifted. The new Champions League format has not only meant that there's drama for the final day, but it has also given the smaller sides around the world better chances to make it to the knockouts, which can lead to tremendous amounts of money to help these clubs come back and do it all again. Take Bodo/Glimt for example, last season they made a European knockout for the first time ever in Europa Leauge and now here they are taking out Manchester City and Atletico Madrid in Champions League play to one up themselves. While there are valid questions of whether the richest clubs are getting too far ahead of the pack -- and we'll get to those -- it's clear that this tournament does mean something to the bigger teams in smaller leagues. And with teams in some of the larger leagues around the world faltering, this could mean something for the UEFA club coefficients that determine how many clubs get into each European competition and who gets automatic qualification without needing to go through the playoffs. More of this, please.\nLosers: The Champions League contingent of the AmericansEight Americans made appearances in the league phase of the Champions League: Sergino Dest, Malik Tillman, Weston McKennie, Folarin Balogun, Yunus Musah, Johnny Cardoso, Ricardo Pepi, and Marvin Dills. But only four remain in the knockouts, with none gaining automatic berths to the round of 16. Tillman's Bayer Leverkusen, Cardoso's Atletico Madrid, McKennie's Juventus, and Balogun's Monaco will all keep moving on. 18-year-old Dills just made his Champions League debut for Eintracht Frankfurt on the final day of action against Tottenham; the others were heavily involved for their teams. While it's not their fault that they got knocked out, it is unfortunate that the contingent is halved in one day when it seemed like all of them could survive into the next round. Given how the bracket looks for the knockout phase, this is a number that could drop drastically as well.Winner: The Premier LeagueSix Premier League teams entered the Champions League, and five occupy the top eight of the league phase table, while the sixth finished 12th after a draw against the reigning champs in Paris Saint-Germain. Tottenham can't buy a win in the Premier League, but they navigated the league phase with ease after a season where they won the Europa League while finishing in 17th place. Newcastle United winger Anthony Gordon talked a bit about it while this may be the case in his pre-match availability ahead of facing PSG. \"I think in the Champions League, teams are much more open. They all try to play; it's less transitional. I think in the Premier League it's become more physical than I've ever known it to be,\" Gordon said. \"It's like a basketball game, sometimes it's so relentless physically. There's not much control, it's just a running game, and it's about duels. Who wins the duels wins the game or moments.\n\"The Champions League is a bit more of an older style of game. It's a bit more football-based, where teams come and try to play proper football. I think in the Premier League, to see a lot more long throw-ins, set pieces It's become a lot slower and set-piece based, I would say.\"It offers an interesting lens into play, and when you see players like Xavi Simons who have struggled in the Premier League but are doing well in Champions League play, Gordon's words have some merit. Of course, it's one of the best English teams at attacking and defending set plays, who sit atop the pile at this stage in Arsenal, but even they were able to mix it up to keep the squad fresh while competing on all fronts. English teams have won three of the last 10 Champions League finals, which is second to Real Madrid, carrying the LaLiga flag with five, while Germany and France have netted one a piece so maybe there is a shift in power in the water.Losers: Real Madrid Out of the Copa Del Rey and also out of the top eight of the Champions League, the Alvaro Arbeloa era isn't getting off to the greatest start for Real Madrid. He also won't have Raul Asencio and Rodrygo available for the first leg of the knockout phase after receiving red cards in stoppage time of their loss to Benfica. But not only did Real Madrid get knocked out, but they were dominated from start to finish, allowing 22 shots and an xG of 2.99 while holding 66% of the possession during the match. Sure, Los Blancos may need the extra games to get their defense into gear, but they could either face Benfica again in a two legged tie or a Bodo/Glimt side that just took it to Atletico Madrid and Manchester City and beat them. These are the kinds of runs that can lead to a third manager in a season, since getting knocked out before the round of 16 would be an unacceptable result for Real Madrid.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League winners and losers: Jose Mourinho's Benfica come up clutch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/d527014f-5e48-4e0f-bef0-9d0f59a9032c/thumbnail/1200x675/20c46c0fb91cb95fb3cf09ca6d70f783/benfica-1.jpg"
      ],
      "datePublished": "2026-01-29T20:51:57.000Z",
      "dateModified": "2026-01-29T20:51:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giannis Antetokounmpo trade explainer: How Bucks and their biggest star got here - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/giannis-antetokounmpo-trade-explainer-bucks-landing-spots/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/b51828ff-f5cd-4d87-8d03-8a9ecf77915f/thumbnail/1200x675/9982dd5c9d1171420b93c39d7d712af1/giannis-getty-38.png",
    "tag": "Sports",
    "date": "2026-01-29T23:06:18.000Z",
    "description": "\n        MILWAUKEE -- The 2026 NBA trade deadline is set for 3 p.m. ET on Feb. 5. With one week remaining, all eyes are turned to Milwaukee to see wha",
    "body": "\n        MILWAUKEE -- The 2026 NBA trade deadline is set for 3 p.m. ET on Feb. 5. With one week remaining, all eyes are turned to Milwaukee to see what will happen with Giannis Antetokounmpo, who is currently sidelined with a right calf strain that will keep him out until after the All-Star break. As Brian Windhorst noted last week, \"Giannis is the trade deadline. There is really not a lot of other players out there that can move the needle. There is very small to no market for Ja Morant or Anthony Davis. The entire league is watching Giannis.\"The two-time MVP has spent his entire career with the Bucks, but his time in Milwaukee appears to be nearing an end. Whether Giannis gets traded by Feb. 5 or in the summer, the move will have league-altering implications.On Wednesday, ESPN reported that Antetokounmpo is \"ready for a new home\" and teams across the league have \"received a sense that the Bucks are more open than ever to Antetokounmpo offers between now and the deadline.\" That does not guarantee that the Greek Freak is dealt before Feb. 5. He is under contract through 2027, and there's a good chance this saga stretches into the summer when the Bucks, and interested teams, have more flexibility. As Shams Charania also noted, the Bucks are \"not in a rush to complete a move.\"\nAhead of the deadline and what could be one of the biggest trades in NBA history, here's a complete guide to the Antetokounmpo situation. How did we get here?In Game 2 of the Bucks' first-round playoff series against the Chicago Bulls in 2022, Khris Middleton stepped on a wet spot, took an awkward spill and sprained the MCL in his left knee. That injury derailed the Bucks' title defense. They went on to lose in the second round that season to the Boston Celtics -- and put Middleton on a downward health spiral that neither he nor the Bucks ever recovered from. Middleton played just 33 games during the 2022-23 season, but the Bucks still earned the No. 1 seed in the Eastern Conference. Early in Game 1 of their first-round series against the Miami Heat, Antetokounmpo suffered a back injury after a hard fall and did not return. He missed the next two games, and though he returned for Game 4, the Bucks suffered improbable collapses in that contest and Game 5 to become the fifth No. 1 seed to lose to a No. 8 seed in the first round of the playoffs. \nThe Bucks' choke in 2023 led to drastic changes. Championship-winning coach Mike Budenholzer was fired and replaced by Adrian Griffin, and championship-winning point guard Jrue Holiday was traded to the Portland Trail Blazers in exchange for Damian Lillard. The stunning move to acquire Lillard also cost the Bucks their unprotected 2029 first-round pick and unprotected swap rights in 2028 and 2030. It did, however, help convince Antetokounmpo to sign an extension -- the deal he is currently on, which will expire in 2027, assuming he does not pick up his player option for 2028. There was plenty of excitement about Lillard's arrival, but despite the Bucks' strong start in his first season with the club, trouble was brewing. Notably, the veteran locker room quickly turned on Griffin, and the first-time head coach was fired in January of 2024 despite a 30-13 record. He was soon replaced by Doc Rivers, who struggled to match Griffin's initial success. The Bucks went 17-19 to close Rivers' first season, in part due to injuries to Middleton, Antetokounmpo and Lillard. Antetokounmpo did not play in the posteason due to a calf injury, while Lillard missed two games of their first-round series against the Indiana Pacers due to an Achilles strain. The Bucks were bounced in the first round again. Middleton was sidelined again to begin the 2024-25 campaign, and the Bucks got off to a 2-8 start. Though they eventually turned things around, it was clear that Middleton was no longer his old self and the team was not a serious title contender. They shipped Middleton to the Wizards at the deadline for Kyle Kuzma in an attempt to get younger and more athletic, while also creating some financial flexibility, which allowed them to add Kevin Porter Jr. and Jericho Sims as well. None of it mattered once Lillard was diagnosed with a blod clot in his calf in March. Lillard sat out the remainder of the regular season, but made a surprise return in the playoffs. He did not look like right, however, and tore his Achilles in Game 4 of the Bucks' first-round series with the Pacers, which they eventually lost in five games. \nThe vultures started circling for a Giannis trade the second Lillard's Achilles tear was confirmed, but the Bucks fended them off in the summer. They made a stunning decision to waive Lillard and stretch the remaining $103 million on his contract over the next five years, then used the cap space that freed up to sign Myles Turner. The desperate ploy to keep Antetokounmpo around worked -- at least initially. After an exciting 4-1 start to this season, the Bucks have been one of the worst teams in the league, and the vibes have trended steadily downward. Antetokounmpo has been limited to 30 games, and they've had other injury problems, but the team has no hope of making any noise in the Eastern Conference. They're in 11th place as the calendar flips to February.You can take issue with the Bucks' decisions, some of which were more desperate and short-sighted than others -- trading five second-round picks for Jae Crowder in 2023 stands out as particularly foolish -- but you can't fault their effort. They did everything in their power to extend their window and keep Antetokounmpo in town for as long as possible, and dealt with some horrible luck along the way. Now, with Antetokounmpo sidelined indefinitely and the final year of his contract approaching, the writing is on the wall. \nWhat has Antetokounmpo said about a trade?A lot. And some of it contradictory. Let's run through some notable quotes from Giannis over the last four months.Oct. 7, 2025: \"I've said this many times: I want to be in a situation that I can win. I believe in this team. I believe in my teammates. I'm here to lead this team to wherever we can go. It's definitely going to be hard. We're going to take it day by day, but I'm here. So all the extra stuff does not matter.\"I've communicated with my teammates, communicated with the people I respect and love, that the moment I step on this court or in this facility, I wear this jersey, the rest does not matter. I'm locked into whatever I have in front of me. Now, if in six, seven months I change my mind, I think that's human, too.\"\nOct. 28, 2025: \"Right now I'm here, representing my team and that's it. We beat the Knicks. (The trade rumor) doesn't really matter. What matters right now is we have a game in two days against Golden State, try to stay locked in and get two in a row. I didn't read that article. Try to stay away from all that -- rumors, speculation and trades and all this. It doesn't concern me one bit.Dec. 18, 2025: \"If my agent is talking to the Bucks about (a trade), he's his own person. He can have any conversation he wants. At the end of the day, I personally have not had the conversation with the Bucks. I'm still locked in, locked in on my teammates, most importantly locked in on me getting back healthy.\"Jan. 8, 2026: \"I am not (going anywhere). I am invested in this team. I want to turn this team around. I want to play good basketball. I want to be healthy. I want to help my teammates. I wanna win games. The last six games we've played, we're 4-2. We have a lot of games in front of us. I'm locked the f--- in. I'm locked in. My priority is just staying healthy.\n\"My plan is to be here for the rest of my career. If they don't want me … I'm not the one in charge. I am an employee.\"There will never be a chance, and there will never be a moment that I will come out and say, 'I want a trade. That's not … in … my … nature. OK?\"Jan. 13, 2026: \"I was definitely booing back. When I get booed, I boo back. I've been doing that all season. You guys haven't been with me on the road. Whenever I get booed, I boo back.\n\"I play basketball for my teammates, I play basketball for myself and my family. When people don't believe in me I don't tend to be with them, I tend to be against them. I tend to do what I'm here to do, what I'm good at. I think I'm like a maverick. I've always been that way, so it won't change now. It doesn't matter if I'm at home or away. I've never been a part of something like that before and I don't think it's fair. I don't. But everybody has their opinion to do what they want to do. I'm not gonna tell them what to do and how they should act when we don't play hard or when we lose games or when we're not where we're supposed to be. And I don't think anybody has the right to tell me what or how I should act on the basketball court after I've been here 13 years and I'm basically the all-time leader in everything.\"Jan. 19, 2026: \"I don't know (if I'll finish the season with the Bucks). I take it day-by-day,\"Jan. 21, 2026: \"I'm not the guy that will yell and cuss his teammates out and demand the ball. I've never done that in my career, but I feel like I've played with teammates that kinda understand the gravity that I can cause for our team and how I can create for my teammates or for myself and how I can help the team be more successful. But maybe for some reason -- I don't understand. \n\"Maybe because we're young, maybe because we're not playing well, maybe because guys think it's their turn, they want to carry the team on their back and try to turn this around, but I really don't get it. I really don't It's not like I'm not trying to be aggressive. I'm really trying to be aggressive. I have coaches, people that talk to me, they told me there's this thing that's called the white swan and the black swan. You gotta be the black swan and be more aggressive and demand the ball. It's something I've never done in my whole career. Maybe I gotta do it more.\"We're not playing hard. We're not playing to win. We're not playing together. Our chemistry is not there. Guys are being selfish. Guys will try to look for their own shot instead of looking for the right shot for the team.\"Where do trade talks stand?It's important to note that, according to Chris Haynes, Antetokounmpo still has not requested a trade. \n\"Nothing has changed on Giannis' end. Nothing has changed there. The new news is the Bucks' willingness to listen now. That is different,\" Haynes reported Wednesday. \"As far as Giannis is concerned, he had not requested a trade. I don't foresee him ever requesting a trade.\"But while Antetokounmpo may never walk into Jon Horst's office and demand to be traded, that doesn't mean that he's opposed to playing elsewhere. That's been clear since the offseason, when Charania reported that Antetokounmpo had interest in playing for the Knicks, who engaged in trade talks with the Bucks. Antetokounmpo is signed through 2027, with a player option for 2028 that he is assuredly going to decline to become an unrestricted free agent in the summer of 2027. The closer he gets to free agency, the more pressure that puts on the Bucks. They were able to convince him to sign an extension in 2023, and will be able to offer him another one in October if he's still on the roster, but it seems unlikely that he'll re-up this time around. As much as the Bucks clearly do not want to trade him, letting him walk for nothing in 2027 would be much worse than acquiring a number of draft picks and young players -- especially when it's clear this team is not a contender. Thus, as Charania reported, the Bucks are now willing to take calls ahead of the deadline. At the very least, the next week will give Horst and Co. a look at the market and what they could possibly get for the 10-time All-Star. But because Antetokounmpo is signed until 2027, the Bucks have the ability to wait until the summer if they think there will be better deals available then. It's also worth noting that Antetokounmpo is making $54 million this season, and trading a player with that sort of salary mid-season is complicated due to the restrictions on teams that are above the luxury tax. The Bucks' lack of future draft picks is another complicating matter. They do not control their own pick until 2031, which means they can't just trade Antetokounmpo and tank for a few years. That will affect what they ask for in return for their superstar. Which teams are in the mix?It's rare for players of Antetokounmpo's caliber to become available, and plenty of teams will be interested. However, Antetokounmpo's impending free agency status means that teams interested in trading for him will have to ask the same questions the Bucks have apparently answered for themselves: does he want to be here long-term, and will he sign an extension?A team like the Portland Trail Blazers, which controls three of the Bucks' future first-round picks (unprotected 2029 selection and unprotected 2028 and 2030 swap rights), could make arguably the best offer. But it's unlikely Antetokounmpo would sign an extension in Portland, even with Holiday and Lillard in the mix. To no surprise, then, the leading candidates to acquire Antetokounmpo are all either contenders or big market teams. According to both ESPN and The Athletic, the main suitors are the New York Knicks, Miami Heat, Golden State Warriors and Minnesota Timberwolves, and the Bucks have already received \"aggressive\" offers. \n        \n            \n                Giannis Antetokounmpo trade landing spots: Three teams that work now and six more that could strike in summer\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nWhile Charania reported during the offseason that the Knicks were the only team that Antetokounmpo wanted to play for aside from the Bucks, Antetokounmpo's thinking as since changed. Per ESPN, Antetokounmpo is \"not expected to focus on one destination.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giannis Antetokounmpo trade explainer: How Bucks and their biggest star got here - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/b51828ff-f5cd-4d87-8d03-8a9ecf77915f/thumbnail/1200x675/9982dd5c9d1171420b93c39d7d712af1/giannis-getty-38.png"
      ],
      "datePublished": "2026-01-29T23:06:18.000Z",
      "dateModified": "2026-01-29T23:06:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]