[
  {
    "title": "Tiger Woods at 2026 Masters? 15-time major champion does not rule out playing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/tiger-woods-masters-2026-playing/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/07/18/dbc254db-a8d3-44ef-9c35-23172d176341/thumbnail/1200x675/dd3c5e84639fcbad46ee7467d49e03ff/usatsi-tiger-woods.jpg",
    "tag": "Sports",
    "date": "2026-02-17T19:25:50.000Z",
    "description": "\n        Asked if he would rule out teeing it up at the 2026 Masters, Tiger Woods responded with a simple, one-worded answer, \"No.\" Speaking ahead of ",
    "body": "\n        Asked if he would rule out teeing it up at the 2026 Masters, Tiger Woods responded with a simple, one-worded answer, \"No.\" Speaking ahead of the 2026 Genesis Invitational, where he serves as the tournament host, the 15-time major champion was unable to give a firm timeline on his return to competitive golf, though the 50-year-old did confirm that he is at least eyeing Augusta National in April as a possible landing spot.\"I'm trying [to come back], put it that way,\" Woods said. \"The disc replacement has been one thing. It's been a challenge to -- I've had a fused back and now a disc replacement, so it's challenging. \"And now, I entered a new decade, so that number is starting to sink in and has us thinking about the opportunity to be able to play in a cart. That's something that, as I said, I won't do out here on [the PGA Tour] because I don't believe in it. But on the Champions Tour, that's certainly that opportunity.\"Woods announced in October 2025 that he underwent another back surgery, this one to replace a collapsed lumbar disc. The procedure came as he was already recovering from a torn Achilles, which also required surgery and caused him to miss the entire 2025 season.\n\"The Achilles was not an issue. I can't dunk a basketball anymore, so I don't have to worry about that,\" Woods said with a smirk. \"As far as the disc replacement, it's just sore. It takes time. [Will Zalatoris] went through it, and it took him a while to come back. I'm a little bit older than Willy Z. It's probably going to take me a little bit longer. \"My body has been through a lot. It's just one of those things where it's each and every day, I keep trying, I keep progressing, I keep working on it, trying to get stronger, trying to get more endurance in this body and trying to get it at a level at which I can play at the highest level again.\"Despite being on screen cheering on his Jupiter Links team in TGL, Woods has not hit a shot in competition since the 2024 Open. That season, he played in only five events and was forced to withdraw from the Genesis Invitational before missing the cuts at the PGA Championship, U.S. Open and The Open. \nThe only time Woods saw weekend action was the Masters, where he set the tournament record with his 24th straight made cut and finished in solo 60th, last among those who played the weekend.\"I'm able to [hit full shots],\" Woods said. \"Not well every day, but I can hit them.\"The Masters is less than two months away with play beginning on Thursday, April 9.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tiger Woods at 2026 Masters? 15-time major champion does not rule out playing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/07/18/dbc254db-a8d3-44ef-9c35-23172d176341/thumbnail/1200x675/dd3c5e84639fcbad46ee7467d49e03ff/usatsi-tiger-woods.jpg"
      ],
      "datePublished": "2026-02-17T19:25:50.000Z",
      "dateModified": "2026-02-17T19:25:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Mark Cuban believes the NBA should 'embrace tanking' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-tanking-mark-cuban-adam-silver/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/f1041dc0-f268-4c57-831b-4cf46b29be55/thumbnail/1200x675/82d6bb107d3556e4b6ec4ca9fc5e8cc7/cuban.png",
    "tag": "Sports",
    "date": "2026-02-17T20:03:50.000Z",
    "description": "\n        Former Dallas Mavericks majority owner Mark Cuban says the NBA needs to focus on prioritizing its fans by creating memorable experiences and ",
    "body": "\n        Former Dallas Mavericks majority owner Mark Cuban says the NBA needs to focus on prioritizing its fans by creating memorable experiences and not concern itself with tanking, this coming after commissioner Adam Silver promised over the weekend to increase punishment for tanking following recent significant fines for the Utah Jazz and Indiana Pacers.In a social media post Tuesday, Cuban said the NBA should \"embrace tanking\" and admitted to doing so during his time with the Mavericks. Tanking is advantageous toward moving up in the draft, creating value with trades and extended cap room, all factors that could lead to a league championship, Cuban explained.\"When I got into the nba, they thought they were in the basketball business.  They aren't,\" Cuban wrote. \"They are in the business of creating experiences for fans.    Few can remember the score from the last game they saw or went to.  They can't remember the dunks or shots.  What they remember is who they were with.  Their family, friends, a date.  That's what makes the experience special. \"Fans know their team can't win every game.  They know only one team can win a ring.  What fan that care about their team's record want is hope.   Hope they will get better and have a chance to compete for the playoffs and then maybe a ring.\"The NBA is \"misguided\" in their perception of what fans want, Cuban claims. He said fans understand the benefits of tanking and said the league should worry more about affordability of games and its in-arena experiences moreso than competitive games.\"You know who cares the least about tanking, a parent who cant afford to bring their three kids to a game and buy their kids a jersey of their fave player,\" Cuban wrote.\n        \n            \n                Adam Silver forced to address competitiveness, Clippers, more crises amid commissioner's most challenging year\n                \n                    John Gonzalez                \n            \n                            \n    \n                \n                    \n    \nDallas drafted former franchise favorite Luka Dončić at No. 3 overall in 2018, but wouldn't have been in that lottery position had the Mavericks not finished 24-58 overall and 13th in the West the previous campaign. Dončić went on to lead Dallas to its third NBA Finals appearance in franchise history in 2024 when it lost to the Boston Celtics.Now in his 12th season as commissioner, Silver says there's gray area when it comes to the subjectiveness of tanking and understands why teams try and disguise it. He mentioned the \"conundrum\" taking place with rampant tanking and not be able to differentiate between teams that are actually bad and ones simply manipulating performance to try and improve their draft position.\nSilver said the league has even considered taking away draft picks for blatant tanking among \"every possible remedy\" this season.\"In the old days, it was just sort of an understanding among partners in terms of behavior,\" Silver said during All-Star Weekend. \"I think what we're seeing is modern analytics where it's so clear that the incentives are misaligned. ... Are we seeing behavior that is worse this year than we've seen in recent memory? Yes, is my view. Which was what led to those fines, and not just those fines but to my statement that we're going to be looking more closely at the totality of all the circumstances this season in terms of teams' behavior, and very intentionally wanted teams to be on notice.\"The Mavericks are currently one of seven teams with 19 or fewer wins this season with 24 or so games left to play for each. Only three finished with that number or fewer last fall.\nTo Cuban's point, Silver acknowledged the league's diehard fans and said he hopes to not lose sight \"of the people who support this league day in and day out.\" The league reprimanded Indiana and Utah last week for \"overt\" tanking after certain high-profile players were held out of recent action.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Mark Cuban believes the NBA should 'embrace tanking' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/f1041dc0-f268-4c57-831b-4cf46b29be55/thumbnail/1200x675/82d6bb107d3556e4b6ec4ca9fc5e8cc7/cuban.png"
      ],
      "datePublished": "2026-02-17T20:03:50.000Z",
      "dateModified": "2026-02-17T20:03:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tyreek Hill breaks silence after Dolphins' release, vows 2026 comeback - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/tyreek-hill-dolphins-release-motivated-for-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/895a48a0-55c8-452b-a5fe-8fbf6937526d/thumbnail/1200x675/a38351ab430edeacbf7e1fea833e991d/tyreek.png",
    "tag": "Sports",
    "date": "2026-02-17T20:16:27.000Z",
    "description": "\n        Tyreek Hill has no hard feelings following his release from the Miami Dolphins and wants the rest of the NFL to know he's anxious to get back",
    "body": "\n        Tyreek Hill has no hard feelings following his release from the Miami Dolphins and wants the rest of the NFL to know he's anxious to get back on the field for the 2026 season. Grateful for the opportunity in Miami after four seasons with the franchise, the five-time All-Pro broke his silence this week after the roster move and said he is focused on a return to playing at an elite level.Hill's release comes ahead of contract guarantees that would've taken effect during the 2026 season. Hill suffered a devastating, season-ending knee injury in September and is expected to miss much of the offseason in recovery.\"Every chapter in life has taught me something. This one taught me leadership, resilience and mostly gratitude,\" Hill wrote Monday on Instagram. \"The love I have for this game is unexplainable. And right now, this offseason, for the first time ever, The Cheetah is all the way turned up and locked in. Focused. The Cheetah don't slow down, ever.\"Hill recorded 21 catches for 265 yards and a touchdown last season prior to injury, this coming after his production totals in 2024 marked the lowest of his career. By cutting Hill and three others on Monday in a series of cost-cutting decisions, the Dolphins saved nearly $70 million in cap space ahead of next season.\nHill said he felt \"loved\" in Miami and singled out Dolphins fans.\"Y'all are different man,\" Hill wrote. \"The way you showed up for us week after week, no matter the outcome — that love was real. I feel it thru out the city and every time I stepped into Hard Rock. Miami, you have became my home.\"Hill's first two seasons with the Dolphins were arguably the best of his career, at least individually altering a pair of 119-catch, 1,700-yard campaigns. His 13 touchdown catches in 2023 were the second-most in a single season during his career.Hill spent his first six years with the Kansas City Chiefs, one of the teams who could pursue him as an unrestricted free agent for the first time in his career. Hill is an eight-time Pro Bowl selection and won a Super Bowl in Kansas City to end the 2019 season.\nHill's 11,363 career receiving yards rank ninth-most by a player in his first 10 seasons in NFL history, and his 28 touchdowns of 50 yards or longer are the fourth-most all time. Despite last season's injury, Hill should command considerable interest from a list of playoff-anxious suitors in need of a reliable target in the passing game.Potential landing spots could include the Bills, Chargers, 49ers and Patriots — teams who could all use assistance from a premier wideout who already have a franchise quarterback in tow for next season.Hill's medical evaluations during the court process will be vital to his future signings. After his knee dislocation in Week 4 last season, Hill underwent successful surgery for an ACL tear and is already walking without a brace.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tyreek Hill breaks silence after Dolphins' release, vows 2026 comeback - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/895a48a0-55c8-452b-a5fe-8fbf6937526d/thumbnail/1200x675/a38351ab430edeacbf7e1fea833e991d/tyreek.png"
      ],
      "datePublished": "2026-02-17T20:16:27.000Z",
      "dateModified": "2026-02-17T20:16:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How more marquee matchups in college basketball will impact NCAA Tournament seeding - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ncaa-tournament-committee-bracket-field-seeding-rematches/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/201da65d-4da2-45ba-83b3-a785e059af04/thumbnail/1200x675/8fa35065f088c840c9731db8486f8c58/gettyimages-2205546086-1.jpg",
    "tag": "Sports",
    "date": "2026-02-17T19:57:42.000Z",
    "description": "\n        Don't be surprised to see some potential nonconference rematches in the second round of the NCAA Tournament bracket when the field of 68 is r",
    "body": "\n        Don't be surprised to see some potential nonconference rematches in the second round of the NCAA Tournament bracket when the field of 68 is revealed March 15 during Selection Selection Sunday on CBS.    One of the issues on the NCAA's radar for 2026 is how the proliferation of blockbuster games in November and December could make such meetings largely unavoidable during the bracketing process.    \"I think it's quite possible that we will see more of those nonconference repeat matchups this year as a result of the fact that there were more high-major versus high-major, ranked games in the top 25 this year,\" NCAA senior vice president of basketball Dan Gavitt told CBS Sports.    \n        \n            \n                Bracketology: Houston squanders chance to validate itself as fourth No. 1 seed as UConn elevates\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nTrying to avoid rematchesHistorically, bracketing principles prioritized avoiding nonconference rematches through the Sweet 16.    \nCurrent NCAA bracketing principles state that nonconference rematches \"should be avoided in the First Four and first round.\" Avoiding potential second round rematches of such contests is listed as a \"secondary consideration\" for the committee.     That phrasing grants the committee some leeway to produce a bracket that contains potential Round of 32 rematches between the litany of projected NCAA Tournament teams that played each other in a historic November/December for college basketball.     There have been 175 regular season nonconference games played between high-major teams so far this season, and that tally will rise again Saturday, when No. 1 Michigan and No. 3 Duke square off. By contrast, there were 146 such games last season. Furthermore, there have been 44 nonconference games between ranked teams this season compared to 31 a year ago, per Sports Reference data.    \nGavitt called the trend \"great for college basketball overall\" and \"great for the tournament committee as well.\"     The upshot for the committee could be a decision matrix. Principles state the committee \"will not consider\" moving teams up or down a seed line to avoid a nonconference rematch. While the committee can — and often does — move teams within a seed line to avoid those rematches, that's not a perfect solution.    In some cases, the only alternative to avoiding a nonconference rematch is to create a conference rematch.\nMore marquee gamesHere is the rundown of how many ranked vs. ranked nonconference regular season games there have been over recent years. The 2020-21 season was omitted due to the impact of the COVID-19 pandemic.        \t \t \t \t\t\t\t\tSeasonRanked vs. ranked   nonconference games2025-26442024-25312023-24282022-23332021-22172019-20252018-19262017-18222016-17302015-16212014-1524\t\t\t\t11-season average27.4That is an unavoidable reality in the evolving landscape of college basketball.    In the 2015 NCAA Tournament, there were 11 multi-bid leagues and no conference received more than seven bids. There were just 24 regular season nonconference games between ranked teams that season.    \nIn those days, before everyone was mashed together into one big pot of teams that largely just plays each other, adhering to stringent rematch rules was easier.     This year, just seven leagues are projected to get multiple bids, and four conferences are on pace to place eight or more teams in the field according to the CBS Sports Bracketology model. Additionally, there were a whopping 20 more nonconference games played between ranked teams this season than in the 2014-15 season.    Committee reacts to realignment by relaxing rulesBut amid the collapse of the Pac 12 and the consolidation of the \"high-major\" class into just five leagues, the committee leaned into the winds of change before last season.    \n\"I think the committee did a really good job anticipating what the result of conference realignment could mean in terms of the principles and procedures for establishing the bracket of the tournament,\" Gavitt said.    In 2025, the rub was that the committee produced a final bracket containing three potential second-round rematches between SEC teams, which was an unavoidable byproduct of that league receiving a historic 14 NCAA Tournament bids.     Principles permit such rematches, so long as the teams in question met only once prior to the NCAA Tournament. If they met twice, they can't play before the Sweet 16, and if they played three times they cannot meet until the Elite Eight.    \nGavitt emphasized that the committee also did not move a team up or down last year to avoid potential conference rematches. Doing so would only be a \"very last resort,\" and doing so to avoid a nonconference rematch is prohibited by bracketing principles.    Bottom line: seed integrity is more important than avoiding a second-round rematch.    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How more marquee matchups in college basketball will impact NCAA Tournament seeding - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/201da65d-4da2-45ba-83b3-a785e059af04/thumbnail/1200x675/8fa35065f088c840c9731db8486f8c58/gettyimages-2205546086-1.jpg"
      ],
      "datePublished": "2026-02-17T19:57:42.000Z",
      "dateModified": "2026-02-17T19:57:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Los Angeles mayor calls for Casey Wasserman to resign from 2028 Olympic committee - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/los-angeles-mayor-casey-wasserman-resignation-2028-olympics-epstein-files/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/3efc3f98-13d8-4e25-aa59-7b4b0b807c6a/thumbnail/1200x675/4307534e9cab202cc662af3a399d0a45/wasserman.png",
    "tag": "Sports",
    "date": "2026-02-17T18:00:45.000Z",
    "description": "\n        Days after confirming his intentions to sell his talent agency in the wake of documents connecting him to Jeffrey Epstein and Ghislaine Maxwe",
    "body": "\n        Days after confirming his intentions to sell his talent agency in the wake of documents connecting him to Jeffrey Epstein and Ghislaine Maxwell, Casey Wasserman has now lost the favor of Los Angeles Mayor Karen Bass, who is urging him to resign as head of the 2028 Los Angeles Olympics organizing team.LA28 board's executive committee decided after meeting last Wednesday that Wasserman would remain in his position as chair of the organizing committee. \"My job, as mayor of Los Angeles, is to make sure out our city is completely prepared to have the best Olympics that has ever happened in Olympic history, os my focus is a little different\" Bass told CNN. \"But the behavior of Maxwell, what they were involved in, is abhorrent and it's an issue I've worked on for a long time.\"Bass said she doesn't have the power to \"fire\" Wasserman since LA28, the committee leading the Olympic, holds that discretion and has since supported the talent mogul. She is not part of the LA28 board with voting power and said the decision to keep Wasserman around as organizing chair was unfortunate.The International Olympic Committee has not commented on Wasserman and has pushed all questions to the LA28 board. \n\"I understand there are many conversations happening at this moment but I will not make any further comment,\" IOC spokesman Mark Adams said Tuesday. \"This is obviously a matter for the board of LA28 still at this stage.\"Wasserman, 51, told employees last week in a memo he was \"deeply sorry for personal mistakes,\" referencing provocative emails sent to Maxwell, Epstein's former girlfriend, that were released.Wasserman founded his industry-leading talent agency in 2002. According to his Olympics bio, Wasserman also serves as President and CEO of the Wasserman Foundation, a private family foundation founded in 1952 by his grandparents, Lew and Edie Wasserman. \nMany of Wasserman's clients dissociated from him last week in various public postings, including singer Chappell Roan and former USWNT star Abby Wambach.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Los Angeles mayor calls for Casey Wasserman to resign from 2028 Olympic committee - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/3efc3f98-13d8-4e25-aa59-7b4b0b807c6a/thumbnail/1200x675/4307534e9cab202cc662af3a399d0a45/wasserman.png"
      ],
      "datePublished": "2026-02-17T18:00:45.000Z",
      "dateModified": "2026-02-17T18:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenneth Walker contract: Seahawks unlikely to franchise tag Super Bowl MVP, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/kenneth-walker-free-agency-seahawks-franchise-tag/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/46c4e891-fdc0-4e5d-9ee8-61cd76488e78/thumbnail/1200x675/71a006f534e65fcdba6fc834783a83e0/gettyimages-2260607864-1.jpg",
    "tag": "Sports",
    "date": "2026-02-17T15:42:45.000Z",
    "description": "\n        If the Seattle Seahawks bring star running back Kenneth Walker III back for the 2026 season, they will likely have to do so through free agen",
    "body": "\n        If the Seattle Seahawks bring star running back Kenneth Walker III back for the 2026 season, they will likely have to do so through free agency. The team is unlikely to use its franchise tag on the Super Bowl MVP, according to ESPN, as it works to retain multiple standouts from its championship-winning roster. The window to use franchise or transition tags is now open and runs through March 3, and Walker was viewed as the Seahawks' most likely tag candidate.Placing a franchise tag on Walker would cost the Seahawks $14.1 million, and while they have ample cap space, ESPN reports that Super Bowl taxes will likely cause the team to avoid using its tag altogether. General manager John Schneider has only used the tag twice in his 16-year tenure.Walker will become an unrestricted free agent next month and projects as one the best players on the market. He exhausted his rookie contract at the end of the 2025 season and will be in for a sizable pay raise after carrying a $2.7 million cap number during his fourth year in Seattle. If the Seahawks were to use the franchise tag on Walker, he would become the fourth-highest-paid running back in the league behind only Saquon Barkley, Christian McCaffrey and Derrick Henry.That is a high value for a running back who handled 43.6% of his team's carries during the regular season. Zach Charbonnet continued to cut into Walker's workload during a breakout season in which he racked up a team-high 12 touchdowns. But when Charbonnet suffered a season-ending torn ACL, Walker proved his ability to put an offense on his shoulders.Walker averaged 139 scrimmage yards per game in the postseason and scored four touchdowns during the Super Bowl run, nearly matching the five he tallied in the regular season. He was integral in the Super Bowl victory itself when he rushed for 135 yards against the stout New England Patriots front and became the first running back to win the game's MVP honor since 1997.\nEven if he hits the open market, Walker could reasonably return to Seattle for 2026 and beyond.\"I've been here four years, so I've gotten to know a lot of stuff about Seattle, and a lot of the city, and I feel like they feel good about me as well,\" Walker said this month. \"If it was my choice, though, I'd definitely stay.\"Coach Mike Macdonald said the Seahawks \"of course\" want Walker back. Making that happen while retaining other key free agents and potentially extending star wide receiver Jaxon Smith-Njigba is the challenge.\nIf Walker and the Seahawks cannot come to terms on a new deal, the Michigan State product would become a top priority for running back-needy teams. The Jacksonville Jaguars, New York Jets, Carolina Panthers and Kansas City Chiefs are among those to watch as their ballcarriers hit free agency, as well.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenneth Walker contract: Seahawks unlikely to franchise tag Super Bowl MVP, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/46c4e891-fdc0-4e5d-9ee8-61cd76488e78/thumbnail/1200x675/71a006f534e65fcdba6fc834783a83e0/gettyimages-2260607864-1.jpg"
      ],
      "datePublished": "2026-02-17T15:42:45.000Z",
      "dateModified": "2026-02-17T15:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/16/522b40bd-12de-4d2d-9811-e288fec09d91/thumbnail/1200x675/0db2cc78f1d6b13b1b07f8c87f2a2105/usatsi-28253942.jpg",
    "tag": "Sports",
    "date": "2026-02-17T19:02:47.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA will try to improve upon those numbers in 2026, and they have some golden opportunities to do just that. Both the men's and women's hockey team should be in the running for a gold medal, Jordan Stolz is a favorite in speed skating, Chloe Kim is hitting the halfpipe in snowboarding and Mikaela Shiffrin will once again be on the ski slopes. And figure skaters Alysa Liu and Ilia Malinin have high potential to reach the podium.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Norway has won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    138930\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    941124\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    69520\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    66113\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    58316\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    57416\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    55212\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    52310\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    47617\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    451019\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    34512\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    3115\n            \n        \n    \n        GBR\n    \n    \n        Great Britain\n    \n\n    3003\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    2204\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    2114\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    1236\n            \n        \n    \n        BRA\n    \n    \n        Brazil\n    \n\n    1001\n            \n        \n    \n        KAZ\n    \n    \n        Kazakhstan\n    \n\n    1001\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    0336\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0314\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0112\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0112\n            \n        \n    \n        GEO\n    \n    \n        Georgia\n    \n\n    0101\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0044\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/16/522b40bd-12de-4d2d-9811-e288fec09d91/thumbnail/1200x675/0db2cc78f1d6b13b1b07f8c87f2a2105/usatsi-28253942.jpg"
      ],
      "datePublished": "2026-02-17T19:02:47.000Z",
      "dateModified": "2026-02-17T19:02:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB Players Association head Tony Clark expected to resign, months before CBA expires, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-players-association-tony-clark-resigns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/44e46568-3404-45b2-9491-23c274d73686/thumbnail/1200x675/9b030d62b87654d6a7d415ece9f11694/clark-getty.png",
    "tag": "Sports",
    "date": "2026-02-17T18:34:58.000Z",
    "description": "\n        Tony Clark, executive director of the MLB Players Association, is expected to resign, The Athletic reported Tuesday. The stunning news comes ",
    "body": "\n        Tony Clark, executive director of the MLB Players Association, is expected to resign, The Athletic reported Tuesday. The stunning news comes just months before the current collective bargaining agreement is set to expire on Dec. 1.\"You definitely don't want things to be a distraction going into December,\" Marcus Semien, a member of the MLBPA's executive subcommittee, told reporters, including the New York Post, on Tuesday, adding Clark did not discuss his resignation with union leadership ahead of time. \"So that's all I can really say. Maybe (that is) why this is happening now.\"  Clark and the MLBPA are under federal investigation by the Eastern District of New York. Prosecutors are looking into whether a licensing company co-founded by the MLBPA and the NFL players union, OneTeam Partners, was being used to financially enrich the union leaders. The full scope of the investigation into the company is unclear, but members of the executive subcommittee have been in contact with federal officials, according to The Athletic.An MLBPA-owned youth baseball company, Players Way, is also under investigation for alleged financial impropriety. The company is said to have held few live events for kids even though the MLBPA put $3.9 million into the company. Players Way executives and consultants reportedly received six-figure salaries despite the company's lack of events.\n\n        \n            \n                Six major issues for Tony Clark's MLBPA replacement: Salary cap, international draft, more negotiating tasks\n                \n                    Mike Axisa                \n            \n                            \n    \n                \n                    \n    \n\"I think so,\" Semien added when asked whether Clark is resigning due to the investigations. \"Because up to this point, before any investigations, I've had the ultimate confidence in Tony Clark to lead this player group. I've had the ultimate confidence in Bruce Meyer to be the lead negotiator for this player group.\"Three former members of the MLBPA's executive subcommittee -- Jack Flaherty, Lucas Giolito, and Ian Happ -- attempted to remove Meyer as the union's deputy director in December 2024. Flaherty, Giolito, and Happ were then voted out of the subcommittee. There are eight players on the subcommittee: Semien, Chris Bassitt, Jake Cronenworth, Pete Fairbanks, Cedric Mullins, Paul Skenes, Tarik Skubal, and Brent Suter.   CBA negotiations typically begin during the spring and get serious in April and throughout the summer. Clark's expected resignation comes at a precarious time for MLB, as the upcoming labor negotiations are expected to get ugly. Both sides, in fact, have warned of the likelihood of a labor stoppage, though each blames the other, of course. \n\"In a bizarre way, it's actually a positive,\" commissioner Rob Manfred said last year of a lockout. \"There is leverage associated with an offseason lockout and the process of collective bargaining under the (National Labor Relations Act) works based on leverage. The great thing about offseason lockouts is the leverage that exists gets applied between the bargaining parties.\"The salary cap -- proposed by the owners -- is again the biggest sticking point, as the league presents the idea of teamwide payroll minimums and maximums under the guise of parity. The union has always held that it will never accept a salary cap. Other issues expected to come up for debate include playoff expansion and an international draft.Clark, 53, joined the MLBPA in 2010 following a 15-year playing career. He was unanimously approved as the union's executive director in December 2013, following the death of Michael Weiner. Clark has overseen the last two CBA negotiations.\nIt's unclear who will take over Clark's role in the players' union, but subcommittee member Brent Suter told The Athletic that the MLBPA will use an interim leader, citing the desire to \"keep everything as stable as we can this year.\" Clark was scheduled to begin his annual spring training tour Tuesday, though his meeting with the Cleveland Guardians has reportedly been canceled already.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB Players Association head Tony Clark expected to resign, months before CBA expires, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/44e46568-3404-45b2-9491-23c274d73686/thumbnail/1200x675/9b030d62b87654d6a7d415ece9f11694/clark-getty.png"
      ],
      "datePublished": "2026-02-17T18:34:58.000Z",
      "dateModified": "2026-02-17T18:34:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Genesis Invitational predictions, odds, picks for Tiger Woods' signature event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-2026-predictions-odds-picks-field-rankings-pga-tour-tiger-woods/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/9f5517a2-b8f7-42e5-976b-461de2df3cf8/thumbnail/1200x675/8cce4991e9b78d14f4a8ee184e54e0e2/genesis-invitational-2023-wide-g.jpg",
    "tag": "Sports",
    "date": "2026-02-17T19:37:53.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    The second signature event in as many weeks features Tiger welcoming the best in the game to Riviera Country Club\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 17, 2026\n                            \n                    at\n    11:12 am ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The PGA Tour's West Coast swing will reach an exciting conclusion this week in a return to Southern California for the 2026 Genesis Invitational. Back to Riviera Country Club after being unable to use the golf course due to the Los Angeles wildfires in 2025, the PGA Tour's best players will partake in the second signature event of the season with a significant purse on the line.Unlike last week's AT&T Pebble Beach Pro-Am, the Genesis Invitational will feature a cut at the 36-hole mark (one of three signature events that slice the field), trimming the field to the top 50 players and ties, along with those within 10 strokes of the leader.That should not be a problem for world No. 1 Scottie Scheffler, who headlines a field that features 18 of the top 20 players in the Official World Golf Rankings. Scheffler returns to Riviera for the first time with a mallet putter in his bag, as this was the site in 2024 where his frustrations on the greens reached a boiling point.The run he has been on since, which includes 18 straight top 10 finishes dating back to March 2025, has been leagues above the rest of the world. Still, Scheffler is seeking his first win at Riviera -- a golf course neither Tiger Woods nor Jack Nicklaus were unable to conquer during their careers.Speaking of Woods, while he will not be playing this week, he serves as the tournament's host once again. The 15-time major champion handed the trophy to Ludvig Åberg at Torrey Pines last year, and he has previously shaken the hands of Genesis Invitational champions in the field like Hideki Matsuyama and Max Homa.\nWorld No. 2 Rory McIlroy hopes that it will be him this weekend as he makes start No. 2 on the PGA Tour this season. McIlroy played well in his season debut at Pebble Beach, where he effectively returned to his blade irons, but he was ultimately upended by others' big numbers on the scorecard.Californians Xander Schauffele, J.J. Spaun, Patrick Cantlay, Sahith Theegala and Homa hope to win in their home state. Meanwhile, Justin Rose, Collin Morikawa and Scheffler aim to grab their second wins of the season, joining Chris Gotterup as a multiple-time winner before the calendar flips to March.2026 Genesis Invitational scheduleDates: Feb. 19-22Location: The Riviera Country Club — Pacific Palisades, CaliforniaPar: 71 | Yardage: 7,383 | Architect: G.C. Thomas, Jr. // W.P. BellPurse: $20,000,0002026 Genesis Invitational field, oddsOdds via DraftKings Sportsbook\nScottie Scheffler (3-1)Rory McIlroy (15-1): Where McIlroy wins at this stage in his career matters almost as much as what he wins, and a potential trophy at Riviera certainly piques his interest. McIlroy played better as the rounds progressed at Pebble Beach; all he needed to do was clean up the scorecard, which he did Sunday by maneuvering through the course without a bogey en route to a closing 64. McIlroy had a run of three top 10s across four tournament appearances at Riviera from 2019-22 but hasn't been at his best in his last two trips.Xander Schauffele (23-1): Schauffele is making slight improvements by the week with a top 20 finish at Pebble Beach providing a glimpse into his game being closer than it may appear. The two-time major champion is driving the ball beautifully, just needing to clean up some stuff on and around the greens to start being competitive again. This should be a good spot for him, as he had a chance to win this tournament on the back nine in 2024 before Matsuyama made his run.Tommy Fleetwood (23-1): Quietly snuck his way into a T4 finish at Pebble Beach last week where he did everything extremely well. After some middling play in the Middle East, the reigning FedEx Cup champion looked like the player who raised that trophy at the Tour Championship last year. He has improved in every trip to Riviera with finishes of T37, T28, T20 and T10 to his name. If that trend continues, Fleetwood will be in the mix come Sunday.Hideki Matsuyama (25-1): One of many recent Masters winners to reign supreme at Riviera alongside the likes of Adam Scott, Bubba Watson and Dustin Johnson. Matsuyama returns this year in stellar form after notching four straight top 13 finishes with his playoff loss at the WM Phoenix Open and T8 at Pebble Beach hindered by his driving. There will be no hiding from that club this week, but if he figures it out, he has as good a chance as anyone to step into that winner's circle.Russell Henley (25-1)Cameron Young (29-1)Patrick Cantlay (29-1)Sam Burns (31-1)Collin Morikawa (31-1): Stating that he finally started to play golf and not \"golf swing\" again, the results followed for Morikawa. He was probably overdue for a win with the number of close calls he had experienced since that 2023 Zozo Championship victory, and it came on the shoulders of his typically elite iron play. No one is suggesting he's suddenly back to being a top five player in the world, even if the Official World Golf Rankings say as much; his short game still has ample room for improvement.2026 Genesis Invitational picks\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Scottie Scheffler\n                    \n            \n            \n        \nWinner (3-1): If Scheffler doesn't start by spotting the field 10 strokes on Thursday, he should be atop the leaderboard on Sunday. That's what Scheffler has done the past two weeks, and he nearly pulled off the impossible at Pebble Beach on Sunday by overcoming an eight-stroke deficit thanks to a three-eagle performance and a final-round 63. Scheffler is stunting with the driver and short game at the moment, and if his iron play starts to behave like it did Sunday, he should grab his second trophy of the season.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Harris English\n                    \n            \n            \n        \nContender (45-1): Not too many players are driving the ball more efficiently than English at the moment. A winner in California last season at Torrey Pines, English should have a chance to raise another trophy in the Golden State at a golf course where he has racked up finishes of solo seventh and T12 in his last two trips. In four starts this season, English has four to -30 finishes but no top 20 finishes. That could change this week given his proficiency with the mid irons.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Ryan Gerard\n                    \n            \n            \n        \nSleeper (75-1): Not too many youngsters are going to fare well at Riviera their first time seeing it, but Gerard may be the exception. Now that the shine has worn off via a T45 finish at Pebble Beach, the 26-year-old price has taken a hit and we will happily be there to scoop it up. He started his year with three straight top 11 finishes, and his game translates better to some of the more legitimate tests on the PGA Tour.Who will win the 2026 Genesis Invitational, and which longshots will stun the golfing world? Visit SportsLine now to see the projected leaderboard, all from the model that's nailed 16 golf majors heading into the weekend, and find out. \n            \n    \n\n        \n    \n                                            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Genesis Invitational predictions, odds, picks for Tiger Woods' signature event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/9f5517a2-b8f7-42e5-976b-461de2df3cf8/thumbnail/1200x675/8cce4991e9b78d14f4a8ee184e54e0e2/genesis-invitational-2023-wide-g.jpg"
      ],
      "datePublished": "2026-02-17T19:37:53.000Z",
      "dateModified": "2026-02-17T19:37:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UNC basketball recruiting: Tar Heels land 5-star Dylan Mingo over Baylor, Penn State - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/unc-basketball-recruiting-dylan-mingo-commitment-five-star-prospect/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/20/b34e9b64-11f3-4463-bccc-6088d3dff16a/thumbnail/1200x675/e49c2409835af9e689ed7ed65c252bca/getty-dylan-mingo.jpg",
    "tag": "Sports",
    "date": "2026-02-17T17:42:50.000Z",
    "description": "\n        Five-star guard Dylan Mingo committed to North Carolina on Tuesday. The 6-foot-5 guard out of Long Island Lutheran High School in New York is",
    "body": "\n        Five-star guard Dylan Mingo committed to North Carolina on Tuesday. The 6-foot-5 guard out of Long Island Lutheran High School in New York is the No. 8-ranked prospect in the Class of 2026. Hubert Davis has now reeled in a top-10 recruit in back-to-back recruiting classes in Mingo and the brilliant Caleb Wilson.UNC outlasted Baylor and Penn State for Mingo's commitment. Mingo's older brother, Kayden, is currently Penn State's starting point guard, but the appeal of UNC was too hard to pass up.\"I chose North Carolina for North Carolina itself,\" Mingo said on ESPN's First Take. \"Seeing everything after they won the [Duke] game had a huge impact on my decision. It's so joyful. The players looked so joyful. If you heard Seth Trimble and Caleb Wilson, if you heard them speak after, they talked about how much they loved their community and loved North Carolina. They would do anything for it.\" Mingo was a stat-sheet stuffer for the PSA Cardinals in the EYBL circuit, averaging nearly 18 points, eight rebounds, three assists and two steals. A painful high-ankle sprain has sapped some of his explosiveness throughout his senior season at Long Island Lutheran, but UNC is bullish that Mingo can regain his footing ahead of the 2026-27 campaign. \nMingo just turned 18 last October, making him one of the younger players in the Class of 2026.\"He has the ability to get wherever he wants with the ball in his hands,\" said Adam Finkelstein, 247Sports' Director of Scouting. \"Mingo has a tight handle, can break his defender down with combo-moves, navigate a crowded lane instinctively, make reads out of ball-screens, utilize both hands, and create for himself and others. He is also a terrific perimeter rebounder, a very disruptive defender, and simultaneously capable of guarding multiple positions.\"Mingo joins burgeoning wing Maximo Adams — who ranks No. 25 in the Class of 2026 — in a UNC recruiting class that could serve as a potential launching pad for a different style of play for the Tar Heels.\nDuke has turned into the top dawg in the ACC using a ton of positional size at every single position. UNC hasn't had that for long stretches, especially during the Elliot Cadeau-RJ Davis backcourt marriage.Mingo is all of 6-foot-5 with a 6-foot-10 wingspan. Adams is a 6-foot-7 wing who can pass, dribble and shoot. If UNC can retain emerging 6-foot-5 freshman point guard Derek Dixon and 6-foot-6 sharpshooter Luka Bogavac, the Tar Heels will boast the most perimeter size the program has seen in years.North Carolina's potential starting lineup in 2026-27G Derek DixonG Dylan MingoG Luka BogavacF Jarin StevensonC Henri Veesaar (or a big man from free agency if Veesaar stays in the 2026 NBA Draft)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UNC basketball recruiting: Tar Heels land 5-star Dylan Mingo over Baylor, Penn State - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/20/b34e9b64-11f3-4463-bccc-6088d3dff16a/thumbnail/1200x675/e49c2409835af9e689ed7ed65c252bca/getty-dylan-mingo.jpg"
      ],
      "datePublished": "2026-02-17T17:42:50.000Z",
      "dateModified": "2026-02-17T17:42:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Caleb Wilson injury update: North Carolina star to return 'soon,' Hubert Davis says - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/caleb-wilson-injury-update-north-carolina-basketball/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/9f0f9ca6-8c1a-430c-bbe5-27077bcded99/thumbnail/1200x675/9e8d739b95c120278d7b288d8e84cc46/usatsi-28239735-1-1.jpg",
    "tag": "Sports",
    "date": "2026-02-17T18:02:35.000Z",
    "description": "\n        When North Carolina star Caleb Wilson broke his hand in last Tuesday's loss at Miami, initial fears were that the freshman may have played hi",
    "body": "\n        When North Carolina star Caleb Wilson broke his hand in last Tuesday's loss at Miami, initial fears were that the freshman may have played his final college basketball game. While he remains without an official timetable to return, Tar Heels coach Hubert Davis said Monday that Wilson will \"be back on the floor soon,\" which indicates he could make an impact for the No. 16 Tar Heels in the final weeks of the season and perhaps into the NCAA Tournament.Imaging taken upon the team's return to Chapel Hill last week revealed a fracture in Wilson's left hand. He has worn a splint since the diagnosis, which Davis said has not prevented him from participating in practice nor being a vocal leader.\"He is great,\" Davis said on his radio show. \"If I said 'OK,' I think he would play with his cast on or his splint. I think he would. He's just champing at the bit to come back, because obviously he loves playing, but he loves his teammates and he loves playing here.\"That Wilson is purportedly motivated to return to action for UNC is key. As a potential top-five NBA Draft pick, he could call it a season, focus on returning to full strength and shift his attention to the draft process. A desire to finish what he started with the Tar Heels, however, could mean Wilson has more college basketball ahead of him.\n\n        \n            \n                North Carolina lands five-star Dylan Mingo over Baylor and Penn State\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \nWilson's return to the lineup is critical for UNC as it seeks a deep NCAA Tournament run. His 19.8 points and 9.4 rebounds per game are irreplaceable, and his 66 dunks on the year led the nation at the time of his injury and emphasize his status as one of the nation's premier interior threats.The Tar Heels fared well in their first game without Wilson. In fact, they overcame an additional absence, too, as Henri Veesaar also missed the 79-65 win over Pittsburgh on Saturday. But UNC's play is likely unsustainable without Wilson on the floor.\"A huge determining factor of us playing well on Saturday was also Caleb,\" Davis said. \"I didn't see him on the bench, but I've seen highlights. He was great on the bench. I mean, he was so encouraging. His voice was in the locker room, was in the huddle. What a great example, because very easily Caleb could be within himself and go 'woe is me' and separate himself from the team because he's hurt. He did the exact opposite. He's in practice. He's dribbling with his right hand. He's in the huddles.\"\nJarin Stevenson and Luka Bogavac stepped up admirably with Wilson and Veesaar sidelined. If they can keep the ship afloat until the elite frontcourt is back at 100%, UNC could stay in line for a favorable seed in the Big Dance. The Tar Heels are a projected No. 6 seed in the latest CBS Sports bracketology.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Caleb Wilson injury update: North Carolina star to return 'soon,' Hubert Davis says - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/9f0f9ca6-8c1a-430c-bbe5-27077bcded99/thumbnail/1200x675/9e8d739b95c120278d7b288d8e84cc46/usatsi-28239735-1-1.jpg"
      ],
      "datePublished": "2026-02-17T18:02:35.000Z",
      "dateModified": "2026-02-17T18:02:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLBPA leader Tony Clark expected to resign: Six tasks for his successor - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlbpa-tony-clark-cba-negotiations-salary-cap-international-draft-playoff-expansion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/9947c0e2-c31b-40ee-9b48-a54443987ad1/thumbnail/1200x675/478a61530b0c930b9298e40657771d58/clark-getty-1.png",
    "tag": "Sports",
    "date": "2026-02-17T16:44:10.000Z",
    "description": "\n        With the collective bargaining agreement set to expire on Dec. 1, the MLB Players Association is suddenly looking for a new executive directo",
    "body": "\n        With the collective bargaining agreement set to expire on Dec. 1, the MLB Players Association is suddenly looking for a new executive director. Tony Clark, the union's leader since 2013, will reportedly resign amid federal investigations into financial impropriety. Clark and the MLBPA are being investigated over licensing money and also a youth baseball initiative.\"I think so,\" Marcus Semien, a member of the MLBPA's executive subcommitee, said when asked whether Clark is resigning due to the investigations.  \"Because up to this point, before any investigations, I've had the  ultimate confidence in Tony Clark to lead this player group. I've had  the ultimate confidence in Bruce Meyer to be the lead negotiator for  this player group.\"Meyer, the union's deputy director and lead negotiator, remains with the MLBPA. CBA negotiations typically begin in the spring and really heat up around Opening Day. It is unclear who could replace Clark, though the union will want a new executive director in place soon. Clark's replacement must of course be voted on and approved by the players. Subcommittee member Brent Suter told The Athletic that there will be an interim leader to \"keep everything as stable as we can this year.\"The timing of Clark's resignation is definitely not great. CBA negotiations are always contentious and that will again be the case come December. The 2022-23 lockout lasted a record 99 days and commissioner Rob Manfred has made it pretty clear another lockout is coming. \"In a bizarre way, it's actually a positive,\" Manfred said last year about a lockout.\nClark, 53, joined the union in 2010 and was unanimously approved as executive director following Michael Weiner's death in December 2013. He oversaw two CBA negotiations and had three years to prepare for his first negotiation in 2016. His replacement will not have that luxury. The next executive director will jump right into CBA talks.Here are six major issues Clark's eventual replacement will have to tackle once CBA talks begin with MLB.Salary capLong story short, CBA negotiations are about money. Everything else is secondary. There is a giant pile of money and the two sides haggle because they each want a bigger piece. MLB has done a good job selling a salary cap as necessary to improve competitive balance, but make no mistake, it is about money. Above all, a salary cap restricts player salaries and boosts franchise values.\nMLB has pursued a salary cap since the 1880s. They seek one every CBA negotiation. The question this time is how dug in are the 30 owners? They could see Clark's abrupt resignation as a moment of weakness for the union, and push harder for a salary cap than ever. (Remember, very few current owners were around to experience how much the 1994-95 strike damaged the game.)The union has resisted a salary cap -- MLB is the only non-capped league in North America -- and figures to do so again this CBA negotiation. It is easy to be a doomer about these things and expect games to be missed in 2027, and maybe they will be, but it is way too early to say that for certain. MLB's national television deals are up in 2028. Losing games would be terrible for business.Also, a salary cap is not a simple yes or no item. Even if the MLBPA relents and agrees to a salary cap, the two sides have to agree on how the whole thing would work. What counts as baseball-related revenue and what percentage do the players receive? What's the cap? What's the floor? How do you implement it? The yes/no is the easy part. Figuring out the system is the real fight.\nRevenue sharingWith or without a salary cap, the revenue sharing system is likely to be adjusted in the next CBA. Currently, every team puts 48% of its local revenue (local television deal, tickets, concessions, etc.) into the pot, then each team takes out an equal 1/30th share. Big-market teams pay more into revenue sharing than they take out. Small-market teams take out more than they pay in.Baseball has always had a revenue disparity problem but it has never been this extreme. Between payroll and competitive balance tax, the Dodgers fielded a $516 million roster in 2025, or more than the bottom five payroll teams combined. Adjusting the revenue sharing program will pit the owners against each other. After that, they have to take it to the MLBPA and get the union's approval too.ArbitrationMLB has sought to eliminate the arbitration process and replace it with a pay-for-play formula, where player salary is determined strictly by their performance. Tarik Skubal's recent record $32 million arbitration win is likely to ramp up those efforts. Arbitration is a key item for the MLBPA. They're against anything that takes away a player's ability to negotiate his salary. They'll fight to keep arbitration.\nPostseason expansionThe postseason only grows larger -- it never shrinks -- and playoff expansion has really ramped up in recent years. Here are how many teams qualified for the postseason throughout baseball history (ignoring the 2020 pandemic season):1903-68: 2 teams (World Series only)1969-93: 4 teams (Championship Series added)1994-2011: 8 teams (Division Series added)2012-21: 10 teams (Wild Card Game added)2022-present: 12 teams (Wild Card Series added)MLB pushed for a 14-team postseason field during the last CBA negotiation and the MLBPA held the line at 12 teams. That gives the union a negotiating chip this time around. The players want playoff expansion too. It means more players get a chance at a World Series and (more importantly) there's more postseason revenue to go around. They will use it as a bargaining chip though.I have no idea what the next CBA will bring (no one does right now), but I am more confident in it bringing a 14-team postseason field than I am anything else.\nInternational draftAmateur players in the United States, Canada, and Puerto Rico are subject to the draft every summer. Amateur players everywhere else in the world are free agents who can sign with any team. Once upon a time, teams could pay international free agents whatever they wanted. Nowadays it is still a free agent system, though there is a hard cap on spending in place each summer.During the last CBA negotiation, MLB offered to eliminate the qualifying offer system in exchange for an international draft. The MLBPA said no. MLB will try again for an international draft because it will keep costs down. The union could use it as a bargaining chip -- \"We'll give you an international draft for this, this, and that\" -- though they have opposed an international draft to date.ExpansionMLB is in the middle of its longest expansion drought since the league first expanded in 1961. Manfred has said he wants to put the wheels in motion for expansion before he retires in January 2029. That does not mean there will be 32 teams for the 2029 season. It just means Manfred wants the process to begin. Soliciting expansion bids, reviewing proposals, that kind of thing.\nThe union will surely be on board with expansion because it means more roster spots and more jobs. I'm not sure baseball is ready for expansion (there's barely enough pitching for 30 teams as it is), but it's coming either way. Expansion is unlikely to be a sticking point during CBA talks. It's just something that has to get put on the table and agreed to along the way.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLBPA leader Tony Clark expected to resign: Six tasks for his successor - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/9947c0e2-c31b-40ee-9b48-a54443987ad1/thumbnail/1200x675/478a61530b0c930b9298e40657771d58/clark-getty-1.png"
      ],
      "datePublished": "2026-02-17T16:44:10.000Z",
      "dateModified": "2026-02-17T16:44:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women's Bracketology: Vanderbilt stays a No. 2 seed despite upset of Texas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-bracketology-ncaa-tournament-projections-feb-17-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/193b5240-cb3b-450f-986e-4682999f1ecb/thumbnail/1200x675/ad04339389f3f4f76c2d847d32ad88bc/bracketology-2-17.jpg",
    "tag": "Sports",
    "date": "2026-02-17T18:50:16.000Z",
    "description": "\n        Sometimes, the last impression you leave is the strongest. Vanderbilt dominated Texas from the jump on Thursday in a matchup of No. 1 seed ho",
    "body": "\n        Sometimes, the last impression you leave is the strongest. Vanderbilt dominated Texas from the jump on Thursday in a matchup of No. 1 seed hopefuls, leading by 12 points after the first quarter and by as many as 26 points before ultimately winning 86-70. It was the Longhorns' second-largest regular-season loss in the last five seasons. Still, they had a better resume than Vanderbilt in nearly every other metric, including the nation's two best wins against UCLA and South Carolina at neutral sites.Yet, Vanderbilt surprisingly received the final No. 1 seed in the selection committee's top-16 reveal on Saturday. But that No. 1 seed status for the Commodores was short-lived, as they fell on Sunday at Georgia while Texas picked up a road win at Tennessee. Vanderbilt is now our top No. 2 seed with head-to-head wins over both Texas and Michigan potentially looming large.For now, though, Texas's overall resume gives it the edge. Here's a look at how both teams compare entering this week.\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    W-L24-324-3NET47WAB36Quad 110-36-3Head-to-HeadLostWonThe rest of the top-16 reveal went mostly as expected. UConn remained the No. 1 overall seed despite UCLA's sizable advantage in Quad-1 wins, and Duke was rewarded for more than two straight months of undefeated play by rising to the No. 10 overall seed.Bracketology -- Feb. 17SeedFort Worth 1Sacramento 2 Fort Worth 3Sacramento 41\n                            \n    \n                                                \n                    \n    \n        \n                            Huskies\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bruins\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Gamecocks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Longhorns\n                    \n    \n    16\n                            \n    \n                                                \n                    \n    \n        \n                            Bison\n                    \n    \n    UC San Diego/Cal BaptistChattanooga/Alabama A&M\n                            \n    \n                                                \n                    \n    \n        \n                            Knights\n                    \n    \n    8\n                            \n    \n                                                \n                    \n    \n        \n                            Cyclones\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lady Bulldogs\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Orange\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ducks\n                    \n    \n    9\n                            \n    \n                                                \n                    \n    \n        \n                            Cornhuskers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Tigers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Illini\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cowgirls\n                    \n    \n    5\n                            \n    \n                                                \n                    \n    \n        \n                            Golden Gophers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Mountaineers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Rebels\n                    \n    \n    12\n                            \n    \n                                                \n                    \n    \n        \n                            Owls\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Eagles\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Aztecs\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    4\n                            \n    \n                                                \n                    \n    \n        \n                            Sooners\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Wildcats\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Spartans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Terrapins\n                    \n    \n    13\n                            \n    \n                                                \n                    \n    \n        \n                            Cowboys\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Racers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Bulldogs\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lady Techsters\n                    \n    \n    6\n                            \n    \n                                                \n                    \n    \n        \n                            Lady Raiders\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lady Volunteers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Huskies\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Tar Heels\n                    \n    \n    11\n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Stags\n                    \n    \n    Colorado/Virginia\n                            \n    \n                                                \n                    \n    \n        \n                            Bison\n                    \n    \n    3\n                            \n    \n                                                \n                    \n    \n        \n                            Buckeyes\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Blue Devils\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Horned Frogs\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Hawkeyes\n                    \n    \n    14\n                            \n    \n                                                \n                    \n    \n        \n                            Leathernecks\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Panthers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cougars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Phoenix\n                    \n    \n    7\n                            \n    \n                                                \n                    \n    \n        \n                            Fighting Irish\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Trojans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Wolfpack\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Crimson Tide\n                    \n    \n    10\n                            \n    \n                                                \n                    \n    \n        \n                            Rams\n                    \n    \n    Virginia Tech/Arizona St.\n                            \n    \n                                                \n                    \n    \n        \n                            Bulldogs\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Wildcats\n                    \n    \n    2\n                            \n    \n                                                \n                    \n    \n        \n                            Lady Tigers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Commodores\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Wolverines\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    15\n                            \n    \n                                                \n                    \n    \n        \n                            Colonels\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Midshipmen\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vandals\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Catamounts\n                    \n    \n    Last four inVirginia TechArizona StateColoradoVirginiaFirst four outStanfordClemsonRichmondUtahNext four outSouth Dakota StateBYUCaliforniaKansasWhat to watch forMinnesota looks to grab hosting spotAfter debuting as a No. 9 seed in our first projections of the season, Minnesota has steadily risen and now finds itself on the No. 5 line, knocking on the door of a coveted top-four seed and hosting spot. It would be just the second time the Golden Gophers have ever received a top-four seed - they were a No. 3 seed in the 2004-05 season, recording a program-best 26 wins and reaching the Sweet 16.Minnesota has ranked in the top 20 of the NET rankings all season long but lacked the quality wins to justify a higher seed until its current eight-game win streak that began on Jan. 21 at Oregon. All four of Minnesota's Quad-1 wins have come during this stretch, which has seen the team rise to No. 9 in the NET and No. 21 in WAB.This week provides a golden opportunity to keep the pedal to the metal, with home games against current No. 3 seed Ohio State and No. 4 seed Michigan State. A win in the latter contest could be enough to wrestle the Spartans' hosting spot away.Columbia gives the Ivy League a second bid...for nowWhile Minnesota has risen from a No. 9 seed to a No. 5 seed over the past month, Princeton has done the opposite. After losing a second game of the season to Columbia, the two teams are now tied atop the Ivy League, and Columbia's head-to-head tiebreaker gives it the projected auto bid.With Princeton remaining in the current NCAA Tournament field, that means the Ivy League is a two-bid conference, taking away an at-large spot from the bubble (sorry, Stanford). However, it remains to be seen if that will hold, as Columbia almost certainly needs to win the Ivy League Tournament to reach March Madness.But even if the Lions do win the Ivy League Tournament, Princeton might find itself on the outside looking in if it loses another game in the regular season. The Tigers have four games left on the schedule, with a Quad-2 contest at Harvard being the main challenge. In the first meeting between the teams this season, Princeton needed overtime in order to win at home. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women's Bracketology: Vanderbilt stays a No. 2 seed despite upset of Texas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/193b5240-cb3b-450f-986e-4682999f1ecb/thumbnail/1200x675/ad04339389f3f4f76c2d847d32ad88bc/bracketology-2-17.jpg"
      ],
      "datePublished": "2026-02-17T18:50:16.000Z",
      "dateModified": "2026-02-17T18:50:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft: Top 5 prospects at each offensive position - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/nfl-draft-2026-combine-offensive-rankings-top-5-by-position/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/0b78eaee-44c0-453c-9104-5c98225969e4/thumbnail/1200x675/ef99c1b757028efebae944b940104376/fernando-mendoza.jpg",
    "tag": "Sports",
    "date": "2026-02-17T16:43:50.000Z",
    "description": "\n        If you're looking for quarterbacks, running backs or tight ends outside of the first round, chances are you're going to be disappointed. If y",
    "body": "\n        If you're looking for quarterbacks, running backs or tight ends outside of the first round, chances are you're going to be disappointed. If you want offensive linemen or receivers, you'll have a much higher chance of success.The 2026 NFL Draft class is one where evaluators will have to work overtime to stack their boards. It won't be like 2021 or 2024, when you could throw a dart in the top 10 and hit a future All-Pro.That doesn't mean there aren't future All-Pros to be had, but rather that they aren't as obvious on tape.Quarterback\n                                                                    USATSI\n                                                            Fernando      Mendoza, IndianaTy Simpson,      AlabamaGarrett      Nussmeier, LSUCade      Klubnik, ClemsonDrew Allar, Penn StateThere's a clear tier after No. 1 in this class and then another clear tier after No. 2. Heck, No. 3 on this list was benched last season. That's how thin this class is. \nFernando Mendoza won't be confused for Andrew Luck as a prospect anytime soon, but I'd argue his floor is higher than even last year's No. 1 overall pick, Cam Ward. Mendoza has the size, arm strength, quick processing and calmness under pressure to excel in the league. His intangibles are also off the charts after leading Indiana to a Cinderella national title.Ty Simpson will be the most debated quarterback in this class for a couple of reasons. First, he has only one year of starting experience. Second, he dealt with a back injury down the stretch and then cracked a rib against Indiana that ultimately forced him out of the game. There are plenty of high-end throws and performances on his tape to get excited about, but also enough ugly ones to give evaluators pause. In a weak quarterback class, though, chances are he still lands in Round 1.\n        \n            \n                2026 NFL mock draft: Cowboys go all-in on defense with top-10 trade as Jets, Steelers pass on QBs\n                \n                    Josh Edwards                \n            \n                            \n    \n                \n                    \n    \nRunning back\n                                                                    Getty Images\n                                                            Jeremiyah      Love, Notre DameJadarian      Price, Notre DameKaytron      Allen, Penn StateJonah      Coleman, WashingtonDemond      Claiborne, Wake ForestThere are precisely two running backs who will be in my top 100 this year, and both were on the same team last fall. That's a far cry from last year's class, which saw 10 players rise to starter or committee-starter roles at some point during their rookie seasons.\nJeremiyah Love is yet another special prospect at the position and has a chance to go inside the top 10 like Ashton Jeanty did last spring. He didn't handle the same workload Jeanty did -- he never eclipsed 200 rushing attempts in a season -- but Love has the kind of big-play ability everyone is chasing at the position.Love's teammate, Jadarian Price, is no slouch, either, with exceptional vision, speed and run pacing. He'll consistently maximize runs between the tackles despite not having ideal size. After that, there may not be another starter in this class. That's why I even included a pure scat back in Demond Claiborne in my top five. At least he has a role I know he can succeed in as a space back. I can't say that about too many other backs in this class.Wide receiver\n                                                                    Getty Images\n                                                            Jordyn      Tyson, Arizona St.Carnell      Tate, Ohio StateOmar Cooper      Jr., IndianaMakai Lemon,      USCKC      Concepcion, Texas A&MThis top five has a little something for everyone. If you want a do-it-all No. 1, Jordyn Tyson is your man. His ability to run the full route tree is truly special for a prospect. It's his injury history (missed time in three straight seasons) and middling play strength that hold him back from elite status.\nCarnell Tate is a ready-made deep threat with the most effortless ball skills in the class. He didn't drop a single pass this season and hauled in 12 of 14 contested catches, according to PFF. Omar Cooper Jr. is the YAC weapon who can turn underneath routes into first downs consistently. He has the kind of running back build to carry that over to the NFL. Cooper's 27 broken tackles were the fourth-most in college football.Makai Lemon is your rugged slot receiver who isn't afraid to do the dirty work over the middle. \nAnd finally, KC Concepcion is your explosive vertical threat who will terrify opposing defensive coordinators when left one-on-one. With 19 career drops, though, Concepcion's ball skills will scare off some teams.Tight end\n                                                                    Getty Images\n                                                            Kenyon      Sadiq, OregonMichael      Trigg, BaylorNate      Boerkircher, Texas A&MMax Klare,      Ohio StateJosh Cuevas,      AlabamaThis is not last year's tight end class -- that's for sure. Last year saw five tight ends drafted in the top 50. This year, I'd be willing to bet we don't see more than one. That will be Kenyon Sadiq. The 20-year-old, built like a jumbo running back, is one of the more intriguing prospects in the class. He's likely to fill a similar role to what Harold Fannin Jr. did for the Browns last year as a movable TE2 who's asked to block more in space than inline. If opposing defenses treat him like a receiver, he gives you an advantage in the run game. If they treat him like a tight end, he gives you an advantage as a receiver.\nAfter him, Michael Trigg is easily the next-best athlete in the class. The only problem is he shows little interest in doing traditional tight end things (i.e., blocking). I almost ranked him with the wide receivers for that reason, but he has such a massive frame that if someone can light a fire under him as a blocker, he could be a problem.After those two, there may not be much dynamism. Nate Boerkircher, however, is the most complete inline option in the draft class. His ball skills, fluid routes and play strength make him a strong candidate to be more productive in the pros than he was in college.Offensive tackle\n                                                                    Getty Images\n                                                            Kadyn      Proctor, AlabamaSpencer      Fano, UtahCaleb Lomu,      UtahBlake      Miller, ClemsonMax      Iheanachor, Arizona StateThis is the position that will spark countless debates from now until draft time. Ultimately, the deciding factor for my OT1 was potential. \nIt's hard not to see the special reps on Kadyn Proctor's tape. The 6-foot-7, 369-pound offensive tackle, who was No. 2 on Bruce Feldman's Freaks List last fall, is a physical outlier in every sense of the word. What separates him from other jumbo tackles like Evan Neal is his balance. You won't find many reps on his tape where he loses his footing or goes tumbling to the turf. That's a big selling point for someone who doesn't turn 21 until the summer.While Proctor is like an NBA lottery pick, Spencer Fano is a much safer bet. His mirroring ability is the best in the draft class. The biggest concern is his arm length, and even then, there are plenty of successful tackles in the league within his range. His teammate Caleb Lomu is another easy mover in pass protection, albeit with a more glaring flaw. His play strength must improve before he can hold up to the rigors of NFL power.\nAfter those three, there's a drop-off in proficiency, but not in athletic traits. Both Blake Miller and Max Iheanachor are high-end athletes whose tools are easy to get excited about. They both fall into the more developmental tier, though.Interior offensive line\n                                                                    Getty Images\n                                                            Francis      Mauigoa, Miami (FL)Olaivavega Ioane,      Penn StateConnor Lew,      AuburnChase      Bisontis, Texas A&MEmmanuel      Pregnon, OregonWhat a fun interior offensive line class. Francis Mauigoa has been a right tackle his entire Canes career, but I love his work in a phone booth so much that I'd kick him inside. The power in his hands and his anchor will serve him well against NFL defensive tackles. The top true guard in college football this past fall was fellow Samoan Olaivavega \"Vega\" Ioane. He put together impeccably clean tape from start to finish. He has an ideal guard frame with unmatched consistency in pass protection.\nThe top true center on my board is Auburn's Connor Lew, who is one of the youngest players in the entire draft class. He was only 18 years old when he first broke into the Tigers' starting lineup and won't turn 21 until next August. While his play strength needs to improve, his technique is already top-notch. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft: Top 5 prospects at each offensive position - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/0b78eaee-44c0-453c-9104-5c98225969e4/thumbnail/1200x675/ef99c1b757028efebae944b940104376/fernando-mendoza.jpg"
      ],
      "datePublished": "2026-02-17T16:43:50.000Z",
      "dateModified": "2026-02-17T16:43:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology Bubble Watch: UCLA, Ohio State looking for big wins to boost resume - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-bubble-watch-ncaa-tournament-bracket-field-of-68-predictions-ucla-ohio-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/17/71a49910-49c4-4528-bd99-682cad4e1d39/thumbnail/1200x675/c05e6e86d90bb7e4a3d1c3d3b4b97358/uclabubblewatch.jpg",
    "tag": "Sports",
    "date": "2026-02-17T16:46:08.000Z",
    "description": "\n        Ohio State and UCLA are inching toward Selection Sunday in similar positions, as both need to fortify their resumes in order to feel confiden",
    "body": "\n        Ohio State and UCLA are inching toward Selection Sunday in similar positions, as both need to fortify their resumes in order to feel confident that their names will be called when the field of 68 is revealed. That's why Tuesday night is so important for both.The Buckeyes are hosting No. 24 Wisconsin while UCLA is playing at No. 15 Michigan State in a couple of Big Ten showdowns that will impact the bubble picture. Beating the Badgers still won't bring Ohio State's first Quad 1 victory, but it would give the Buckeyes a third victory over a team currently projected in the field by the CBS Sports Bracketology model.UCLA has two Quad 1 victories, but its only win over a team in the projected field came against Purdue on Jan. 20. The Bruins are coming off an 86-56 loss at Michigan and could use a pick-me-up before they return to Los Angeles to host a potent Illinois team on Saturday.Tuesday night is loaded with huge games featuring bubble implications across the national landscape. From the mid-major ranks to the Big Ten and the SEC and places in between, there's something at stake in gyms across the country. Here's the full rundown in this edition of the bubble watch.\n\n        \n            \n                Bracketology: Houston squanders chance to validate itself as fourth No. 1 seed as UConn elevates\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nCheck out the CBS Sports Bracketology model's latest bracket at the Bracketology hub                                All times ET                  Bubble teams in action Tuesday\n                            \n    \n                                                \n                    \n    Miami Universityat UMass 7 p.m. (ESPN+)Entering the day: No. 11 seed (via autobid)Game status: Quad 3Four of Miami University's final six regular season games are on the road. Of those four, this one is the toughest. UMass (15-11, 6-7 MAC) has won four straight at home, and the Minutemen own also own victories over ACC foes Florida State and Boston College. For more on how much (or how little) margin for error the Redhawks have, check out this piece.\n\n                            \n    \n                                                \n                    \n    TCUat UCF 7 p.m. (ESPN+)Entering the day: Last Four InGame status: Quad 1TCU has won three straight and five of its last seven to recover from a 1-4 start to Big 12 play and reach a level 6-6 in conference action. The stretch includes a win over No. 6 Iowa State, which adds to a collection of wins that also includes No. 12 Florida and No. 24 Wisconsin. If not for a season-opening home loss to New Orleans that is killing its resume, TCU would have far more breathing room.\n                            \n    \n                                                \n                    \n    VCUvs. George Washington 8 p.m. (CBS Sports Network)Entering the day: First Four OutGame status: Quad 3Neutral site November victories over South Florida and Virginia Tech are close to being considered Quad 1 wins. But for now, VCU is 0-4 in Q1 opportunities. That could change Friday night when VCU travels to face No. 18 Saint Louis in an Atlantic 10 blockbuster. First, the Rams must contend with a capable George Washington team that is coming off a 19-point win over a quality George Mason squad.\n\n                            \n    \n                                                \n                    \n      Virginia Techat Miami 8 p.m. (ACC Network)Entering the day: Next Four OutGame status: Quad 1Virginia Tech picked up a massive Quad 1 A win at Clemson last week and then promptly gave back all that ground with a Quad 3 home loss to Florida State. So, here we are again with the Hokies heading on the road against a quality opponent with something to prove. If last week's sequence becomes a trend, Virginia Tech will win this game and then lose at home to Wake Forest on Saturday. \n                            \n    \n                                                \n                    \n    UCLAat No. 15 Michigan State 8:30 p.m. (NBC Sports Network)Entering the day: No. 10 seedGame status: Quad 1For a team with a respectable 17-8 (9-5 Big Ten) record in a rugged league, UCLA's resume is weirdly bland. The Bruins have just one victory over a team currently projected in the NCAA Tournament field. Taking down Michigan State on the road would be the sort of season-defining result that would make the home stretch less stressful. But it will take a much better effort than what the Bruins put forth in a 30-point loss at Michigan on Saturday.\n\n                            \n    \n                                                \n                    \n    Ohio Statevs. No. 24 Wisconsin 8:30 p.m. (FS1)Entering the day: First Four OutGame status: Quad 2Even a home win over Wisconsin might not be enough to end Ohio State's quest for a Quad 1 victory. With the Badgers hovering around the low 30s in NET, this one will be right on the cut line. The Buckeyes rate as a top-40 team in predictive metrics, but they need to put some meat on their resume. While this one may not technically check the \"Quad 1\" box, it would still bring a projected 5-7 spot leap in Ohio State's Wins Above Bubble ranking, which currently sits in the high 40s. That would be huge.\n                            \n    \n                                                \n                    \n    New Mexicovs. Air Force 9 p.m. (Mountain West Network)Entering the day: First Four OutGame status: Quad 4\nPlaying Air Force (3-22, 0-14 Mountain West) brings absolutely no benefit to Mountain West bubble teams. New Mexico is expected to add a laughable 0.01 to its Wins Above bubble metric with a win, and it will have to win by a wide margin to avoid falling in some of the predictive metrics that appear on its NCAA team sheet.\n                            \n    \n                                                \n                    \n    Georgiaat Kentucky 9 p.m. (ESPN)Entering the day: No. 11 seedGame status: Quad 1Georgia has dropped five of its past six games, turning a once-promising season into a tense bubble ride. Four of those losses have come by 15+ points, which suggests the Bulldogs are legitimately reeling and not just dealing with the ebbs and flows of a rough schedule. Against that backdrop, they head to Rupp Arena, where they have not won since 2009. Everything is fine! (It's not fine).\n                            \n    \n                                                \n                    \n    San Diego Statevs. Grand Canyon, 10 p.m. (CBS Sports Network)Entering the day: Last Four InGame status: Quad 3\nThis is a revenge spot for San Diego State, which took a 70-69 loss at Grand Canyon on Jan. 21. The Aztecs are right on the cut line and can't afford a fringe Quad 2/3 loss. Falling here would send the Aztecs plummeting to around 50th in Wins Above Bubble, which is on the outer fringes of at-large territory in that vitally important resume metric.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology Bubble Watch: UCLA, Ohio State looking for big wins to boost resume - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/17/71a49910-49c4-4528-bd99-682cad4e1d39/thumbnail/1200x675/c05e6e86d90bb7e4a3d1c3d3b4b97358/uclabubblewatch.jpg"
      ],
      "datePublished": "2026-02-17T16:46:08.000Z",
      "dateModified": "2026-02-17T16:46:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]