[
  {
    "title": "San Jose State vs. Utah State odds, picks, predictions, best bets from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/san-jose-state-utah-state-prediction-odds-2025-week-8-friday-college-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/d132e5bf-93c6-4630-a99f-efc08118e1e0/thumbnail/1200x675/1b1d9c5cc5bf1b29054471cbb4742d0b/walker-eget-sjsu-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-17T20:11:24.000Z",
    "description": "\n        Mountain West rivals will square off in college football Week 8 action as the Utah State Aggies host the San Jose State Spartans on Friday. T",
    "body": "\n        Mountain West rivals will square off in college football Week 8 action as the Utah State Aggies host the San Jose State Spartans on Friday. The Aggies (3-3, 1-1) are looking to end a two-game skid after losses to Vanderbilt and conference rival Hawaii. The Spartans are also looking to get back into the win column, falling 3-28 to Wyoming their last time out.Kickoff from Maverik Stadium is set for 9 p.m. ET on CBS Sports Network. The Aggies are 4-point favorites in the latest San Jose State vs. Utah State odds, and the over/under for total points scored is 61.5. Before making any Utah State vs. San Jose State picks, be sure to see what the SportsLine projection model has to say.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has zeroed in on Utah State vs. San Jose State. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for SJSU vs. Utah State in Week 8:San Jose State vs. Utah State spreadUtah State -4 at DraftKings SportsbookSan Jose State vs. Utah State over/under61.5 pointsSan Jose State vs. Utah State money line Utah State -187, SJSU +155San Jose State vs. Utah State picksSee picks at SportsLineSan Jose State vs. Utah State streaming Fubo (Try for free)  Why San Jose State can coverThe Spartans are a solid 3-3-0 ATS through six games this season, even covering as a 37-point underdog in Week 2 against Texas. Quarterback Walker Eget was held without a touchdown in that game, but has been on fire ever since, and leads the Mountain West with 1,816 passing yards. He has been especially good against conference opponents, completing 73.1% of his passes for 629 with seven touchdowns and no interceptions. Eget will be SJSU's weapon to cover as underdogs against an Aggies defense that allows 257.2 passing yards and 32.7 points per game. See which team to back at SportsLine. Why Utah State can coverThe Aggies are 5-1-0 ATS this season and are 2-0-0 ATS as a 4-point favorite or greater. They are also undefeated at home this season -- while SJSU has yet to win a road game -- and have outscored visiting opponents 125-53. Utah State quarterback Bryson Barnes has played particularly well at home, averaging 10.6 yards per pass with a 71.4% completion rate and 6-1 TD-INT ratio. He also adds 81 carries for 309 rushing yards and six touchdowns on the ground. San Jose State's defense is good at defending the rush but struggles to contain a good passing game, so Barnes' dual abilities could be the Aggies covering the spread in another home victory. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Utah State vs. SJSU picksFor San Jose State vs. Utah State in Week 8, the model is leaning over the total, and also says one side of the spread hits in well over 60% of simulations. See what it is at SportsLine.Who wins SJSU vs. Utah State, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Utah State vs. San Jose State spread you need to jump, all from the model that is a combined 39-27 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "San Jose State vs. Utah State odds, picks, predictions, best bets from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/d132e5bf-93c6-4630-a99f-efc08118e1e0/thumbnail/1200x675/1b1d9c5cc5bf1b29054471cbb4742d0b/walker-eget-sjsu-imagn-cbs.jpg"
      ],
      "datePublished": "2025-10-17T20:11:24.000Z",
      "dateModified": "2025-10-17T20:11:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League picks: Liverpool v Manchester United prediction, odds, start time for Sunday, Oct. 19 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/premier-league-picks-liverpool-v-manchester-united-prediction-odds-start-time-for-sunday-oct-19/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/07/c84272a3-b81e-4243-a550-049ffab42f20/thumbnail/1200x675/0403237634e0a93ab543d8f708b90f60/liverpool.jpg",
    "tag": "Sports",
    "date": "2025-10-17T20:06:54.000Z",
    "description": "\nLiverpool returns to action for the first time in two-plus weeks when they welcome Manchester United to town in an English Premier League match on Su",
    "body": "\nLiverpool returns to action for the first time in two-plus weeks when they welcome Manchester United to town in an English Premier League match on Sunday, Oct. 19. Liverpool enters the contest second in the Premier League table behind just Arsenal, while Manchester United sits 10th amid a lackluster start. Kickoff is set for 11:30 a.m. ET. Liverpool is a -165 favorite (wager $165 to win $100) on the money line at DraftKings while Manchester United is a +425 underdog (wager $100 to win $425). A draw is priced at +320, and the over/under for total goals scored is 3.5 (Over +105, Under -130). Before locking in your bets for Liverpool vs. Manchester United, check out SportsLine soccer Jon Eimer's top plays for this contest.Eimer finished 2023 as SportsLine's No. 1 soccer expert, posting a 248-234-12 (+25.93 units) record on SportsLine article picks. Eimer has been red-hot in 2025, posting a profit in multiple leagues, including the Premier League, Champions League, La Liga and more. Anyone following his soccer betting picks at sportsbooks and on betting apps could have seen huge returns.  Here are Eimer's best bets for Liverpool vs. Manchester United on Sunday:Liverpool ML (-150, FanDuel) -- 1u Liverpool to score in both halves (+100, BetMGM) -- 1uCan international break fix Liverpool's form? Liverpool has not played a competitive match since they lost to Chelsea 2-1 on Oct. 4. While they are still second on the table, that loss to Chelsea marked their third consecutive loss across all competition. They lost to Crystal Palace and Chelsea in league play, and also lost in a stunner to Galatasaray 1-0 in Champions League play. This team was struggling with form and consistency before the break, but frankly, I think the break will have done some serious good for Arne Slot's men. Liverpool came out scorching hot in their first month of league play before burning themselves out a bit. I think a couple weeks off, even though they have plenty of players with International duty, will help them mentally reset and prepare to take on a struggling Manchester United squad. Manchester United's continued mediocrity  While Liverpool has struggled with consistency, no side has struggled with it more than Ruben Amorim's United squad. Sitting with three wins, three losses and a draw, this team defeated Sunderland and Chelsea, and in the same 30-day period, lost to Manchester City and Brentford. This team is loaded with strong attacking talent in the likes of Benjamin Sesko, Mason Mount and Bryan Mbeumo who are struggling to find their form and are under performing for United. While the break did help their opponents Liverpool, only time will tell what it did for the visitors. This is a tricky match to predict, but I see Liverpool returning to their winning ways, as a night at Anfield will surely help propel them to three points against a disjointed opponent. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League picks: Liverpool v Manchester United prediction, odds, start time for Sunday, Oct. 19 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/07/c84272a3-b81e-4243-a550-049ffab42f20/thumbnail/1200x675/0403237634e0a93ab543d8f708b90f60/liverpool.jpg"
      ],
      "datePublished": "2025-10-17T20:06:54.000Z",
      "dateModified": "2025-10-17T20:06:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs left tackle Josh Simmons to miss second straight game due to personal reasons - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-left-tackle-josh-simmons-to-miss-second-straight-game-due-to-personal-reasons/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/02911bc7-8dc5-4660-95e1-0ddc38347b44/thumbnail/1200x675/45e72a4e94b65fe58deb0120d1f44705/gettyimages-2239619983.jpg",
    "tag": "Sports",
    "date": "2025-10-17T20:03:01.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After missing his team's Week 6 win over the Detro",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After missing his team's Week 6 win over the Detroit Lions due to what was described as a \"family situation,\" Kansas City Chiefs rookie left tackle Josh Simmons was ruled out of the team's Week 7 game against the Las Vegas Raiders on Friday after missing practice throughout the week for personal reasons. Simmons, the No. 32 overall pick in this year's draft out of Ohio State,  returned home to California prior to Kansas City's matchup against Detroit last week and Chiefs coach Andy Reid offered very few details about the situation when speaking with reporters. Simmons was expected to play last week but was abruptly listed as \"questionable\" on Sunday afternoon with the team using the \"personal\" designation. A few hours later, Simmons was downgraded to out.When asked by reporters about Simmons' status or if there was a timeline for his return to the team, Reid declined comment and deferred to general manager Brett Veach, who he said is \"handling everything there.\" Likewise, quarterback Patrick Mahomes said little, electing to keep the matter of if he and Simmons had spoken private.\"I'll keep conversations kind of between us,\" Mahomes told reporters. \"But I'm always praying for him. I'm praying for all my teammates, so I'm always praying for him. I'll just keep everything else kind of private to us.\"\nWith Simmons out of the lineup, backup Jaylon Moore served as the Chiefs' starting left tackle and is set to do the same this week.Simmons was the only Chiefs player to be ruled out on Friday's injury report, with all other players listed as full participants in practice with no game designation. Players who practiced in full include running back Brashard Smith (illness), wide receivers Hollywood Brown (Achilles), Nikko Remigio (thumb) Xavier Worthy (shoulder/ankle) and Rashee Rice (Not Injury Related), right tackle Jawaan Taylor (knee), defensive end Charles Omenihu (ankle) and defensive lineman Jerry Tillery (elbow)\nNow 3-3 on the year after beating the Lions, the Chiefs will host the Las Vegas Raiders on Sunday. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs left tackle Josh Simmons to miss second straight game due to personal reasons - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/02911bc7-8dc5-4660-95e1-0ddc38347b44/thumbnail/1200x675/45e72a4e94b65fe58deb0120d1f44705/gettyimages-2239619983.jpg"
      ],
      "datePublished": "2025-10-17T20:03:01.000Z",
      "dateModified": "2025-10-17T20:03:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "J.J. McCarthy injury update: Vikings QB (ankle) out again; Carson Wentz to start vs. Eagles in revenge spot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/j-j-mccarthy-injury-update-vikings-qb-ankle-out-again-carson-wentz-to-start-vs-eagles-in-revenge-spot/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/59df8556-5475-4176-9f53-7d2f8d953e5a/thumbnail/1200x675/bf1df852dfb141c652e6fab3f8707501/carson-wentz.jpg",
    "tag": "Sports",
    "date": "2025-10-17T19:51:25.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The revenge game is on. On Friday, Minnesota Vikin",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The revenge game is on. On Friday, Minnesota Vikings coach Kevin O'Connell announced that quarterback Carson Wentz would make his fourth consecutive start in Week 7 vs. the Philadelphia Eagles, as J.J. McCarthy continues to heal from his ankle injury. Max Brosmer will serve as Wentz's backup, while McCarthy will be the emergency third quarterback. Wentz is 2-1 as Minnesota's starter this season, having completed 69% of his passes for 759 yards, five touchdowns and two interceptions. He has brought more stability and consistency to the position after McCarthy struggled mightily in Week 2's 22-6 loss to the Atlanta Falcons, the game where the second-year signal-caller was injured. Wentz spent the first five seasons of his NFL career with the Eagles, who selected him with the No. 2 overall pick in the 2016 NFL Draft. In his second season, Wentz led Philly to an 11-2 start before he suffered a torn ACL. Nick Foles replaced him at quarterback, and led the Eagles to a Super Bowl LII victory.\n\n        \n            \n                Carson Wentz revenge game? Why Vikings QB may (or may not) be extra motivated to beat Eagles in Week 7\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \nWhile Wentz returned to the starting lineup the following season, he simply wasn't the same player he was to begin his NFL career. Wentz won 18 of his first 29 games (18-11), then went 17-21-1 in his final 39 starts for the Eagles before he was traded to the Indianapolis Colts in 2021. Wentz went one-and-done in both Indianapolis and with the Washington Commanders before accepting backup jobs with the Los Angeles Rams and Kansas City Chiefs. But now at age 32 he's back starting and winning football games.\nWentz has made one start against the Eagles, which came in 2022 with the Commanders. In a 24-8 loss, he completed 25 of 43 passes for 211 yards without a touchdown. Sunday, he gets another shot at Philly with his Vikings listed as 2.5-point underdogs at FanDuel. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "J.J. McCarthy injury update: Vikings QB (ankle) out again; Carson Wentz to start vs. Eagles in revenge spot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/59df8556-5475-4176-9f53-7d2f8d953e5a/thumbnail/1200x675/bf1df852dfb141c652e6fab3f8707501/carson-wentz.jpg"
      ],
      "datePublished": "2025-10-17T19:51:25.000Z",
      "dateModified": "2025-10-17T19:51:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fulham vs. Arsenal live stream, where to watch Premier League online: Piero Hincapie adds depth for Gunners - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/fulham-vs-arsenal-live-stream-where-to-watch-premier-league-online-piero-hincapie-adds-depth-for-gunners/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/053f0df8-0cd8-441f-a46b-34e0bcfe7576/thumbnail/1200x675/2567643be7743aef94c35a5f464f516d/untitled-design-2025-10-17t211850-655.png",
    "tag": "Sports",
    "date": "2025-10-17T19:27:50.000Z",
    "description": "\nIs the best defense in the sport about to get even better? Perhaps not in its starting XI, but with Piero Hincapie at last available following his de",
    "body": "\nIs the best defense in the sport about to get even better? Perhaps not in its starting XI, but with Piero Hincapie at last available following his deadline day move from Bayer Leverkusen, there is a chance that Mikel Arteta's side is about to add even more aggression, determination and full throttled force.The Ecuador international has managed to play just one minute for his new club since his loan move, a groin issue sidelining him until the international break. Hincapie has now returned to training and, although he will have a battle on his hands in establishing himself over Gabriel or Riccardo Calafiori on the left side of defense, he is certain to bolster Arsenal's options at a time when the fixture list offers no quarter.Nor will Hincapie when he is vying with his opponents. When the time came during the summer to reluctantly indulge Jakub Kiwior's desire to move for more first team football, the assumption had been that Arsenal would have to accept a downgrade in their defensive cover. Instead they secured a favorable deal -- a loan with an option both Leverkusen and Arsenal can activate and which both clubs expect to be made permanent -- for a player who could prove to be superior.Playing across the left flank for Xabi Alonso's Leverkusen, the 23-year-old established himself as one of the most promising young defenders in Europe. In many ways he fits the archetype of versatility embodied by the likes of Josko Gvardiol: at full back he can get into dangerous positions, move possession up the field and is very capable of playing a more reserved, inverted role while his team mate on the other side bombs on. As a center back in a back three he could get forward, pass from deep and dominate his duels. It would be damning Hincapie with insufficient praise to say that he could do a job when Calafiori or Gabriel go down.Not that Arteta would have to trust his assessment nor that of the scouting team in deciding whether Hincapie was the one. He had as good an inside source as a manager could wish for; the benefit of an almost four decaded friendship with the by then departed Alonso.Did he speak to the former Leverkusen, now Real Madrid manager when he was mulling a move for Hincapie? \"For sure, I had to,\" said Arteta. \"I mean, someone like him that I know so well, trust him and who had him for a few years, it's very valuable information to have. \"He was super complimentary of him for many different reasons and it was good to confirm what I saw, and some of the things that you obviously learn from that conversation that you probably weren't very aware of.\"Those things will stay between Arteta and Alonso, but the former was not exactly shy in heralding the talents of his new signing. \"He's a player who is going to help us a lot, he's going to bring something different to the team. We need to get him going, get him to the speed that is necessary to compete at this level and gradually to where we want.\"What you're going to see is his aggression, his determination. He's a player who goes full gas to every single action, especially in defending. And with the ball, whether he plays a left-center back or a fullback, a player who is very clean on the ball. Again, someone who really wants to penetrate, whether it's with the ball, his positioning, and it will bring a different character and emotion to the team.\"It is hard to believe that Arteta's defense really needs more. After all they have conceded just three goals in their first seven Premier League games, only one of which came from open play. Allowing just 0.62 xG per game should seem unsustainable for most team. For Arsenal it doesn't feel that far from the norm. \"The more we do those things in a lot of parameters throughout the season and establish ourselves in those categories at the highest level, the bigger the chance will be to achieve what we want,\" said Arteta.Of course Arsenal only increase the odds with such excellent defending, they don't obliterate them entirely. After all on their last trip to Craven Cottage Fulham were held to two shots worth a combined 0.16 xG. Somehow Marco Silva's side got a point. For the most part Arteta responded to games like this one, of which there were a few too many last season, by adding greater variety to his attack, enough that an absence such as Martin Odegaard's over the coming weeks doesn't look like hindering them to anywhere near the same extent it might have 12 months ago.Hincapie represents the other side of that recruitment drive, one that gives Arsenal a chance to make those >0.25 xG games a little bit more frequent. There are 70 possible quartets from the eight defenders Arteta has available to him, with his new signing in the mix it is hard to fathom up more than a handful that don't make for a intimidating physical unit. So yes, the best might actually be about to discover it can get even better.How to watch Fulham vs. Arsenal, oddsDate: Saturday, Oct. 18 | Time: 12:30 p.m. ETLocation: Craven Cottage -- LondonLive stream: PeacockOdds: Fulham +500; Draw +300; Arsenal -182\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fulham vs. Arsenal live stream, where to watch Premier League online: Piero Hincapie adds depth for Gunners - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/053f0df8-0cd8-441f-a46b-34e0bcfe7576/thumbnail/1200x675/2567643be7743aef94c35a5f464f516d/untitled-design-2025-10-17t211850-655.png"
      ],
      "datePublished": "2025-10-17T19:27:50.000Z",
      "dateModified": "2025-10-17T19:27:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Oregon vs. Rutgers: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/where-to-watch-oregon-vs-rutgers-tv-channel-kickoff-time-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/c7922fdc-21f3-4c48-8a85-d40bbb481cca/thumbnail/1200x675/6cd2931362f91d3c2cb96d0240c2242c/gettyimages-2235231868-1.jpg",
    "tag": "Sports",
    "date": "2025-10-17T19:30:37.000Z",
    "description": "\n        No. 8 Oregon is days removed from its first loss of the season and has to travel all the way across the country for its bounce-back opportuni",
    "body": "\n        No. 8 Oregon is days removed from its first loss of the season and has to travel all the way across the country for its bounce-back opportunity. Rutgers hosts the Ducks in Week 8 for what will be the first all-time matchup between the schools. It is a \"welcome to the Big Ten\" trip for Oregon, which is set to make its furthest trip east since joining the conference last year. It is also the second venture to the Eastern Time Zone in three games for the Ducks, who in their last road game defeated Penn State in a double-overtime thriller.Dan Lanning has never lost consecutive games as a head coach. The Ducks' leader is a perfect 6-0 in games following losses. That is troublesome history for Rutgers as it seeks to pull off one of the biggest upsets in modern program history. The Scarlet Knights have not defeated a top-25 team since 2009.Bet Oregon vs. Rutgers at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass with a winning $5 wager:Not only would a win in this spot go down in Rutgers history, but it would also snap a three-game skid and give Greg Schiano his first Big Ten victory of the season.\nWhere to watch Oregon vs. Rutgers liveDate: Saturday, October 18 | Time: 6:30 p.m. ETLocation: SHI Stadium -- Piscataway, New JerseyTV: Big Ten Network | Stream: Fubo (Try for free)Oregon vs. Rutgers: Need to knowDucks look to get right: Oregon's Week 7 loss came as the result of an uncharacteristic performance on both sides of the ball. The troubles started up front, where the offensive line surrendered six sacks after giving up just one across the five previous games. The Ducks' running back committee could not get its wheels turning behind that line, either. Jordon Davison, Noah Whittington and Jayden Limar combined for just 103 yards, and quarterback Dante Moore erased a quarter of that production with the sacks he took.Road warriors: Oregon's most recent loss away from Autzen Stadium came all the way back in October 2023. The Ducks are on a tear in road games with nine consecutive victories, good for the longest active streak in college football by a significant margin. Baylor's five straight away wins are the second most, for context on this tremendous run. Traveling to the other side of the country has its challenges, but the demands of the Big Ten did not overwhelm the Ducks over their first year and a half in the league.\nThe Greek Rifle: It's a fitting nickname this season for Athan Kaliakmanis, the sixth-most productive passer in college football. His 297.5 yards per game are not the product of some outlier, either; he racked up at least 249 yards in every contest this season, including 330 against an Iowa defense that ranks as one of the stingiest groups in college football. The fourth-year veteran is completing passes at by far a career-best rate and has this offense humming like never before in his stints at both Rutgers and Minnesota.Taking care of the ball: Few teams in the country protect the rock with as much care as Oregon and Rutgers. They are two of eight teams in the FBS without a lost fumble on the year, and they are tied for sixth nationally in fewest turnovers with three each. The Scarlet Knights will likely need to stay clean in the turnover department in order to pull off an upset. They are 20-2 in turnover-free games since 2020.Oregon vs. Rutgers prediction, pickOne of the hallmarks of the Lanning era at Oregon is that his Ducks take care of business against overmatched opponents. Upsets are tremendously rare, and more often than not, the Ducks start fast and pile on. That was the case in their first four games of the year, including one against a Big Ten opponent, when they won by an average margin of 41.5 points. Rutgers should be able to move the ball some, but its defense has yet to hold a Big Ten opponent under 31 points. Oregon should get right and do so without much resistance. Pick: Oregon -17.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Oregon vs. Rutgers: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/c7922fdc-21f3-4c48-8a85-d40bbb481cca/thumbnail/1200x675/6cd2931362f91d3c2cb96d0240c2242c/gettyimages-2235231868-1.jpg"
      ],
      "datePublished": "2025-10-17T19:30:37.000Z",
      "dateModified": "2025-10-17T19:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 7 NFL longshot parlay picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-longshot-parlay-picks-props-week-7-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/e8c9db2e-4719-443a-9cc8-8bd0ae216134/thumbnail/1200x675/b8352ffd6f2f1a0accee77c7da8476e9/bo-nix-j-k-dobbins-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-17T19:27:46.000Z",
    "description": "\n        The Week 7 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the",
    "body": "\n        The Week 7 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the NFL playoff picture. The Los Angeles Chargers (-1.5, 48.5) host the Indianapolis Colts in matchup between teams at the top of the early AFC standings, and the Dallas Cowboys (+1.5, 54.5) host the Washington Commanders in a NFC East rivalry game that projects to be a high-scoring affair. The Sunday slate wraps up with the Atlanta Falcons taking on the San Francisco 49ers (-1.5, 47) in a NFC showdown. Lastly, 'Monday Night Football' features a two-game slate with Buccaneers vs. Lions (-5.5, 52.5) and Texans vs. Seahawks (-3, 41.5).Effectively building NFL parlay picks can pay off big in your NFL betting strategy. NFL parlays come with a much greater risk than straight bets, but they also carry the potential of a much bigger reward. Before making any Week 7 NFL picks and parlays, you need to see the Week 7 NFL longshot parlay from SportsLine's proven computer simulation model that pays out well over $21,000 on a $10 bet. You can bet this NFL parlay using the latest DraftKings promo code, which offers $300 in bonus bets if your initial $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 42-25 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Week 7 NFL odds, it's locked in its betting picks to form a 5-leg NFL parlay that could pay out well over $21,000 for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 7 NFL parlay picksFor Week 7, one of the model's parlay picks is backing the Broncos at the alternate line of -9.5 against the Giants, a bet that returns +118. The standard spread is Denver -7, but the model has spotted an opportunity to go bigger here. The Broncos are projected to win 75% of the time and to cover -7 well over 50% of the time, and the model's winning margin is 10 points, leaving room to play alternate lines. The Broncos have been one of the better teams in the AFC in 2025, and they may have the best defense in the entire NFL. Denver is coming off a 13-11 win over the New York Jets in London, and enters this matchup riding a three-game winning streak.The Broncos have stormed out to a 4–2 start, their best opening since 2016. Quarterback Bo Nix leads the way with 1,277 passing yards and nine touchdowns, while J.K. Dobbins has churned out 442 rushing yards and four scores. On defense, Nik Bonitto tops the team with eight sacks, and the team is bolstered by standout play from Zach Allen and reigning NFL Defensive Player of the Year Patrick Surtain II. See the rest of the picks in the Week 7 NFL parlay here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make NFL parlay picks for a payout of well over $21,000The parlay also includes four additional picks from SportsLine's computer model, including a first touchdown scorer prop bet that returns +900. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for Week 7 that can be combined into a parlay that returns well over $21,000 on just a $10 bet? And what optimal first touchdown scorer bet returns +900? Visit SportsLine now to see the top Week 7 NFL picks from SportsLine's proven model that can be combined for a parlay that pays well over $21,000, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 7 NFL longshot parlay picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/e8c9db2e-4719-443a-9cc8-8bd0ae216134/thumbnail/1200x675/b8352ffd6f2f1a0accee77c7da8476e9/bo-nix-j-k-dobbins-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2025-10-17T19:27:46.000Z",
      "dateModified": "2025-10-17T19:27:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Jays vs. Mariners ALCS Game 5 odds, predictions, line, picks, bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/blue-jays-mariners-prediction-odds-line-time-2025-mlb-playoff-betting-picks-alcs-game-5/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/f085ddd3-67e9-4d9e-8473-75805563d7a2/thumbnail/1200x675/dfef6b755536e7885cf4839f39480fd6/cal-raleigh-seattle-mariners-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-17T19:57:38.000Z",
    "description": "\n        Game 5 of the ALCS between the Toronto Blue Jays and Seattle Mariners takes place on Friday. After the Mariners jumped out to a 2-0 lead, the",
    "body": "\n        Game 5 of the ALCS between the Toronto Blue Jays and Seattle Mariners takes place on Friday. After the Mariners jumped out to a 2-0 lead, the Blue Jays stormed back to win two straight games. Toronto beat Seattle 8-2 on Thursday to even the series. Bryce Miller (4-6, 5.68 ERA) will start for Seattle. Kevin Gausman (10-11, 3.59 ERA) counters for Toronto. First pitch from T-Mobile Park in Seattle is set for 6:08 p.m. ET. Toronto is a -113 favorite on the money line (risk $113 to win $100) in the latest Blue Jays vs. Mariners odds from DraftKings Sportsbook, with the Mariners as -106 underdogs (risk $106 to win $100). The total number of runs Vegas thinks will be scored, or the over/under, is 7. Before making any Blue Jays vs. Mariners picks, be sure to see the MLB predictions and betting advice from SportsLine's proven computer model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every MLB game 10,000 times. It enters the ALCS and NLCS rounds of the 2025 MLB playoffs a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Blue Jays vs. Mariners and just locked in its picks and MLB predictions. You can head to SportsLine now to see the model's picks. Here are several MLB odds and betting lines for Blue Jays vs. Mariners:Blue Jays vs. Mariners         money lineToronto -113, Seattle -106 at DraftKings SportsbookBlue Jays vs. Mariners         over/under7 runsBlue Jays vs. Mariners         run line Toronto -1.5 (+153)Blue Jays vs. Mariners         picksSee picks at SportsLineBlue Jays vs. Mariners         streaming Fubo (Try for free)Why the Blue Jays can winFirst baseman Vladimir Guerrero Jr. has been fantastic this postseason. He leads the team in batting average (.455), home runs (5), RBI (11) and hits (15). Guerrero Jr. went 2-of-5 with a solo home run in his last outing. He's now recorded two-plus hits five times in the playoffs.Third baseman Ernie Clement enters this game with a .452 batting average, with 16 total hits, two doubles and six runs driven in this postseason. In Game 4 win, he was 2-of-5 with two base hits. The Blue Jays have seven players with at least five RBI in this postseason. See which team to back at SportsLine.\nWhy the Mariners can winFirst baseman Josh Naylor has been the most consistent bat for the Mariners. He's first on the team in batting average (.324), along with 12 total hits, two home runs, and three RBI this postseason. Last night in the loss, Naylor was 3-of-3 with a solo home run for Seattle.Catcher Cal Raleigh is an additional force offensively, as he owns a .314 batting average with three home runs and six total RBI in the 2025 MLB playoffs. In Game 1 versus the Blue Jays, Raleigh belted a home run. During the regular season, the 28-year-old led the MLB in home runs (60) and was third in RBI (125). See which team to back at SportsLine. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make Blue Jays vs. Mariners picksSportsLine's model is leaning Over on the total, projecting 8.8 runs, and it says one side of the money line has all the value. You can head to SportsLine to see the model's MLB picks. So who wins Blue Jays vs. Mariners, and which side of the money line has all the value? Visit SportsLine now to see which side you need to jump on, all from the model that has crushed its MLB picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Jays vs. Mariners ALCS Game 5 odds, predictions, line, picks, bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/f085ddd3-67e9-4d9e-8473-75805563d7a2/thumbnail/1200x675/dfef6b755536e7885cf4839f39480fd6/cal-raleigh-seattle-mariners-imagn-images.jpg"
      ],
      "datePublished": "2025-10-17T19:57:38.000Z",
      "dateModified": "2025-10-17T19:57:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Saban 'shocked' by Tua Tagovailoa's comments on Dolphins leadership, apparent locker room dysfunction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nick-saban-shocked-by-tua-tagovailoas-comments-on-dolphins-leadership-apparent-locker-room-dysfunction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/bb797185-f787-4c31-b3b9-4aba111fa431/thumbnail/1200x675/44f937da7ed909a6ad707fda29860e53/adobe-express-file-22.jpg",
    "tag": "Sports",
    "date": "2025-10-17T18:29:43.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Miami Dolphins quarterback Tua Tagovailoa publicly",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Miami Dolphins quarterback Tua Tagovailoa publicly called out some of his teammates amid the squad's 1-5 start for either showing up late to or skipping players-only meetings altogether. His questioning of team leadership and pointed comments toward a segment of the roster made waves throughout the NFL, and his college coach at Alabama, the legendary Nick Saban, said he was \"shocked\" that Tagovailoa went public with his frustration.Tagovailoa later apologized to his teammates for making the eyebrow-raising comments but insisted that he had the right intentions.\"I was really shocked that Tua did what he did when he threw some guys under the bus,\" Saban said on 'The Pat McAfee Show.' \"Maybe they're not playing the way they should play. I'm not taking up for the guys. But you don't say that about your teammate. But I really was proud of the way he came back and sort of took accountability for making a mistake.\"\n        \n            \n                Tua Tagovailoa issues apology to teammates for his comments following the Dolphins' latest loss\n                \n                    Bryan DeArdo                \n            \n                            \n    \n                \n                    \n    \nApparent dysfunction in the locker room could be partially to blame for the Dolphins' disastrous start to the season. That Tagovailoa put some of his teammates on blast in a public setting may only make matters worse for one of the NFL's most downtrodden teams, even though he later took accountability for the mistake.\n\"I am proud of the way he handled it, but one of the things that I always try to tell our players is you never criticize another player,\" said Saban. \"In my entire coaching career, you never, ever saw me criticize one of our players. I think everybody's gotta take responsibility for what they can control. If you start worrying about things that you can't control, that's going to start affecting things that you can control. But if everybody takes responsibility for their own self-determination and do what they can do to make the team better.\"Dolphins coach Mike McDaniel responded to Tagovailoa's comments and called them a \"misguided representation\" of the situation. He also said that the public setting after a loss was not an appropriate spot for his quarterback to air his grievances.The Dolphins reportedly held a players-only meeting after their Week 1 blowout loss to the Indianapolis Colts, and it is unclear how many times the roster convened privately from the coaching staff since then. That initial meeting did not produce immediate results in the win column. The Dolphins proceeded to lose a pair of divisional games to the New England Patriots and Buffalo Bills in the ensuing two weeks. Their lone victory on the year came in Week 4 against the New York Jets. \nMiami will look to get back in the win column on Sunday on the road against the Cleveland Browns. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Saban 'shocked' by Tua Tagovailoa's comments on Dolphins leadership, apparent locker room dysfunction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/bb797185-f787-4c31-b3b9-4aba111fa431/thumbnail/1200x675/44f937da7ed909a6ad707fda29860e53/adobe-express-file-22.jpg"
      ],
      "datePublished": "2025-10-17T18:29:43.000Z",
      "dateModified": "2025-10-17T18:29:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Indiana vs. Michigan State: Stream, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/where-to-watch-indiana-vs-michigan-state-live-stream-kickoff-time-odds-prediction-week-8/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/40e50901-f86b-48e1-bc34-9a79d2efec03/thumbnail/1200x675/7c5b952634990a81c5b8d24de83d414f/usatsi-27303668.jpg",
    "tag": "Sports",
    "date": "2025-10-17T18:45:37.000Z",
    "description": "\n        Two Big Ten rivals meet in Bloomington this Saturday, as the 3-3 Michigan State Spartans take on the undefeated No. 3 Indiana Hoosiers. After",
    "body": "\n        Two Big Ten rivals meet in Bloomington this Saturday, as the 3-3 Michigan State Spartans take on the undefeated No. 3 Indiana Hoosiers. After 1,257 football polls released by the Associated Press, Indiana is ranked in the top three for the first time. Indiana is coming off a statement victory over Dan Lanning's Oregon Ducks. This Hoosiers defense forced two turnovers and held Oregon to just 3 of 14 on third downs in a game that came down to the wire. As for Michigan State, it has lost three straight contests after beginning the season 3-0. The most recent loss came in the form of a surprising upset, as the rejuvenated UCLA Bruins walked into East Lansing and handed the Spartans a 38-13 loss. UCLA scored 28 unanswered points in the second and third quarters. Will Indiana immediately live up to its No. 3 ranking, or could Michigan State catch the Hoosiers by surprise? Let's break down this Big Ten matchup, but first, here's how you can watch. All stats courtesy of CBS Sports ResearchWhere to watch Indiana vs. Michigan State liveDate: Saturday, Oct. 18 | Time: 3:30 p.m. ETLocation: Memorial Stadium -- Bloomington, IndianaStream: Peacock\nIndiana vs. Michigan: Things to know The Old Brass Spittoon: Indiana and Michigan State are battling for the Old Brass Spittoon trophy, which was first awarded in 1950. The trophy was purchased from an antique shop in Lansing by the Michigan State junior class president for $25. Fernando Mendoza: No. 1 overall pick? It's no longer Garrett Nussmeier or LaNorris Sellers. Indiana quarterback Fernando Mendoza is the betting favorite to be selected No. 1 overall in the 2026 NFL Draft. His 17 passing touchdowns rank No. 1 in the Big Ten and fourth in the FBS, and he has completed 71.2% of his passes with just two interceptions. Not bad for the California transfer that was a three-star high school recruit.Hoosier horrors for QBs: Indiana's defense is again elite. Its 229 yards of total offense allowed per game currently ranks No. 4 in the FBS. This defensive front has registered 22 sacks and a 40% quarterback pressure percentage, both which lead the Big Ten. The Hoosiers have racked up 19 sacks in the last four games, including six last week at Oregon.\nSpartans in the red zone: Not much has gone right for the Spartans as of late, but did you know that Michigan State has a 78.3% red zone touchdown percentage? That's the highest mark in the Big Ten, and ranks No. 10 in the FBS. When the Spartans get to the red zone, good things happen. The problem has been getting there, however.Indiana vs. Michigan State prediction, pickThere's no getting around the fact that 28 points is a large number, but Michigan State is 1-7 against the spread in its last eight games vs. top-five teams. Additionally, you should know that Indiana is 5-0 against the spread when favored by 26 or more points. Half of Indiana's wins this season have come by at least 47 points.Perhaps Michigan State will remain in striking distance in the first half, but keep in mind Indiana's +103 point differential in the second half this season ranks best in the FBS. Pick: Indiana -27.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Indiana vs. Michigan State: Stream, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/40e50901-f86b-48e1-bc34-9a79d2efec03/thumbnail/1200x675/7c5b952634990a81c5b8d24de83d414f/usatsi-27303668.jpg"
      ],
      "datePublished": "2025-10-17T18:45:37.000Z",
      "dateModified": "2025-10-17T18:45:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL line movement for Week 7: Falcons vs. 49ers among top games with biggest shifts - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-line-movement-for-week-7-falcons-vs-49ers-among-top-games-with-biggest-shifts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/28/2d8a6dc8-0c71-4387-bf3e-212fdb97277f/thumbnail/1200x675/3f0a736271e53341797b584484b9018b/imagn-bijan-robinson-falcons.jpg",
    "tag": "Sports",
    "date": "2025-10-17T18:19:45.000Z",
    "description": "\n        There's another loaded week of games for Week 7 of the 2025 NFL season, and as is usually the case, betting lines have moved for some of thes",
    "body": "\n        There's another loaded week of games for Week 7 of the 2025 NFL season, and as is usually the case, betting lines have moved for some of these contests. If you're interested in NFL betting, be sure to check out which games have seen the biggest line movement ahead of the weekend. Here, we look at the NFL Week 7 schedule with odds courtesy of BetMGM Sportsbook, where new users can get up to $1,500 in bonus bets if their first bet loses.Miami Dolphins at Cleveland BrownsOpen: O/U 41.5Now: O/U 37\nThis game may get ugly. Not only is there a pair of uninspiring quarterbacks under center in Dillon Gabriel and Tua Tagovailoa, but there's heavy rain and wins expected with gusts up to 50 mph here. With a weather advisory in place, this total has plummeted from 41.5 at open to now just 37 over at BetMGM.Carolina Panthers at New York JetsOpen: New York -1.5Now: Carolina -1.5\nThe Jets are the NFL's lone winless team, and their best shot of a win may be this Sunday when they face a Panthers side that really struggles away from home. The Jets were favored at open, but they're now home underdogs. New York will be without top receiver Garrett Wilson, which is a big blow for a struggling passing game that doesn't have that many weapons. Washington Commanders at Dallas CowboysOpen: Washington -2.5Now: Washington -1\nThe Commanders had a big win over the Chargers two weeks ago, but they lost an ugly one to the Bears on Monday with turnovers being a big issue. They're still favored on the road against a Dallas team that can't stop anyone defensively right now, but Washington is now favored by just a single point after opening the week at -2.5.Atlanta Falcons at San Francisco 49ersOpen: San Francisco -3Now: San Francisco -2\nThe 49ers welcome the Falcons to town for Sunday Night Football this week, and these teams enter the weekend on very different notes. San Francisco lost 30-19 to Tampa Bay as Mac Jones tossed two picks in place of the injured Brock Purdy, while Atlanta handed Buffalo just its second loss of the year when the two teams faced off on Monday Night Football. The Falcons have won two in a row since that ugly 30-0 loss to Carolina. Tampa Bay Buccaneers at Detroit LionsOpen: Detroit -4.5Now: Detroit -5.5\nThe Bucs are tied with the Indianapolis Colts for the best record in the NFL, and their next test is a big one as they visit the Lions in Detroit on Monday. The Lions lost a primetime clash to the Kansas City Chiefs on Sunday Night Football last week, which ended with safety Brian Branch getting into a scrum that resulted in a suspension for this game. Even with Branch out, this line has moved in Detroit's favor from -4.5 to -5.5. The Bucs may get Mike Evans back, but standout rookie Emeka Egbuka is expected to be out, and it looks unlikely that running back Bucky Irving will return for this game. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL line movement for Week 7: Falcons vs. 49ers among top games with biggest shifts - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/28/2d8a6dc8-0c71-4387-bf3e-212fdb97277f/thumbnail/1200x675/3f0a736271e53341797b584484b9018b/imagn-bijan-robinson-falcons.jpg"
      ],
      "datePublished": "2025-10-17T18:19:45.000Z",
      "dateModified": "2025-10-17T18:19:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Clemson vs. SMU: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/where-to-watch-clemson-vs-smu-tv-channel-kickoff-time-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/d4848f40-0846-4708-bba8-3912b44b53d3/thumbnail/1200x675/583707bb3cde6e0ce4e43d2cd4c2c63d/kevin-jennings-smu.jpg",
    "tag": "Sports",
    "date": "2025-10-17T18:30:40.000Z",
    "description": "\n        Clemson will host SMU in a battle of two teams that have underachieved during the first half of the 2025 season. However, both programs are r",
    "body": "\n        Clemson will host SMU in a battle of two teams that have underachieved during the first half of the 2025 season. However, both programs are riding two-game winning streaks entering Saturday's pivotal ACC contest.Clemson was viewed as a preseason national title contender but started off the season with a 1-3 record. After being dissected in a loss at the hands of Syracuse, Clemson has looked dominant in back-to-back wins against North Carolina and Boston College over the past two weeks. Quarterback Cade Klubnik has looked like the Heisman contender that many expected with five touchdowns during the two-game span, though his status for this game is uncertain due to an ankle injury. On the other hand, SMU suffered losses to both Baylor and TCU out of the gate. However, the Mustangs have bounced back in a big way with victories over Syracuse and Stanford to begin ACC play. Star quarterback Kevin Jennings has tossed six touchdowns in that stretch, including a four-touchdown performance against Syracuse earlier this month.Where to watch SMU vs. Clemson liveDate: Saturday, October 18 | Time: 3:30 p.m. ETLocation: Memorial Stadium -- Clemson, South CarolinaTV: ACC Network | Stream: Fubo (Try for free)\nSMU vs. Clemson: Need to knowSMU must get pressure on the QB: SMU currently leads the ACC in sacks (19) and are coming off a six-sack performance against Stanford. That's going to be a nice feather to have in their cap against the Tigers, particularly if facing a backup if Klubnik is unable to go. If the Mustangs are able to win the battle in the trenches, they can definitely stay in this game.SMU needs to establish running game: It's no secret that Jennings is the straw that stirs the drink when it comes to the SMU offense. Jennings can carve up a defense through the air, but the Mustangs need to lean on their rushing attack on a frequent basisin this contest. SMU is averaging 127.0 yards per game on the ground this season, which is good for 10th in the conference. Senior running back T.J. Harden has put together some impressive performances this season, but is only averaging 3.7 yards per carry across his last three games. Getting Harden going early could result in an even more dangerous offensive attack for the Mustangs.\nSMU vs. Clemson prediction, pickFool me once, shame on you. Before I even finish that classic saying, Clemson won't fool me twice. The Tigers have looked better in recent weeks, but it's not like they were lighting up stellar competition. Death Valley isn't the easiest place to play, but SMU has the weapons to keep this one close much like they did in the 2024 ACC Championship Game. Given Clemson's track record, I'll gladly take the points in a battle between two teams that are fairly evenly matched -- especially if Klubnik is limited. The point spread may fluctuate a lot until kickoff, so take as many points as the books will give you. Pick: SMU +10\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Clemson vs. SMU: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/d4848f40-0846-4708-bba8-3912b44b53d3/thumbnail/1200x675/583707bb3cde6e0ce4e43d2cd4c2c63d/kevin-jennings-smu.jpg"
      ],
      "datePublished": "2025-10-17T18:30:40.000Z",
      "dateModified": "2025-10-17T18:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UWCL Power Rankings: USWNT's Alyssa Thompson goal keeps Chelsea among top teams, Barcelona look unstoppable - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uwcl-power-rankings-uswnts-alyssa-thompson-goal-keeps-chelsea-among-top-teams-barcelona-look-unstoppable/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/fcb3dc9c-c470-4adf-a30b-b8957f87def7/thumbnail/1200x675/98c0305c49907860aae1e07d678787e0/untitled-design-2025-10-17t214656-345.png",
    "tag": "Sports",
    "date": "2025-10-17T19:49:20.000Z",
    "description": "\n        The new era of UEFA Women's Champions League is off to a riveting start, and after two matchdays, the revamped league phase has delivered ple",
    "body": "\n        The new era of UEFA Women's Champions League is off to a riveting start, and after two matchdays, the revamped league phase has delivered plenty of drama and unpredictability. The exciting football it promised has presented new questions for clubs, both contenders and hopefuls alike, with current title holders Arsenal stumbling and debutants OH Leuven snatching up points. From historic debuts to dominant statements and last-minute game changers, there were plenty of highlight-worthy moments, including first Champions League goals for U.S. national team players Lily Yohannes and Alyssa Thompson. The new tournament format has set the stage for a wild ride to the final in Oslo, Norway. But who are the teams that flexed their power, and which clubs are reevaluating after two rounds of league phase play? If you're keeping track of where teams landed ahead of the tournament, check out our previous power rankings.How to watchParamount+ will be a one-stop shop for all things Champions League, while CBS Sports Network and CBS Sports Golazo Network will have select matches and additional coverage. Each day's broadcast begins with UEFA Women's Champions League Today on both Paramount+ and CBS Sports Golazo Network before the early kickoffs, while Paramount+ and CBS Sports Network will have an hour-long pre-match show before the later matches. Post-match coverage will air on Paramount+ and CBS Sports Network, while CBS Sports Golazo Network will have a new edition of Scoreline to close out the day's action.\nCBS Sports' new UEFA Women's Champions League Today studio show will be anchored by Hannah Cash, while Jen Beattie, Janelly Farias, Darian Jenkins, Kelley O'Hara, and Ali Riley will serve as analysts. Chris Wittyngham will handle play-by-play duties and will be paired with Beattie and Jenkins, while Anita Jones will report pitchside and Christina Unkel will serve as the rules analyst.Here's where teams stack up after two rounds of the league phase:1. FC Barcelona (+2)The group scored 11 goals over their first two games, and there's not exactly a weakness to pluck away at, but losing midfielder Patri Guijarro to a broken foot will absolutely change some of the chemistry moving forward. Still, with two dominant showings against teams where they had the overall better roster, they're the best team in the tournament at the moment. 2. OL Lyonnes (--)The French giants set the tone when they knocked current title holders Arsenal off their pedestal during matchday one and followed it up with a blowout win against St. Polten. Haitian international Melchi Dumornay was outstanding in Lyon's tournament opener, and 18-year-old Lily Yohannes is making it harder to keep her on limited minutes\n3. Wolfsburg (+3)A lively start for the Frauen Bundesliga side. A pair of wins to begin their Champions League campaign. Midfielder Janina Minge proved an integral component to the attack with two goals, and it's a crucial two wins with more challenging competition ahead of them. 4. Chelsea FC (--) The Blues couldn't quite find their footing against Twente during their opening match, but settling for a draw led to a performance with more bite against Paris FC. Alyssa Thompson showed no fear in her two consecutive Champions League starts, and the winger has officially made roster selection that much harder for head coach Sonia Bompastor moving forward after scoring her first goal for Chelsea.\n5. Arsenal (-4)The title holders got the honor of being first on the power rankings to start the tournament, but they've quickly fallen outside the \"big four\" concept. Lackluster form is haunting this side, and they just can't seem to shake it off. Manager Renee Slegers will have to make adjustments to get the group to put together a full 90-minute performance instead of second-half spurts. \n6. Real Madrid (+2)Made a quick example of Roma on matchday one before skirting by a struggling PSG the following game. Still, in elite competition, a win is a win, but the potential loss of Linda Caicedo for an extended period will be a difficult adjustment to make. The Colombian international produced three assists, and her playmaking won't be easy to replace. 7. Juventus (--)The group will feel hard done by conceding a chaotic late-game goal on matchday two against Bayern Munich. Captain Cristina Girelli has even called for more VAR support for goal line technology, but a narrow loss doesn't discredit the squad's performance over two games. They handled business where they were able, and they'll remain a difficult side to face down the stretch.8. Manchester United (+4)Back in the Champions League after a year-long absence, and the Red Devils are making the most of it. Two wins to start their tournament and have goalkeeper Phallon Tullis-Joyce to thank for maintaining the narrow wins. The USWNT keeper has become a face of the franchise and has five UWCL cleansheets from qualifying. \n9. Atletico Madrid (+2)The franchise is tapping into spooky season and rising from the dead. After some underachieving play in Liga F and missing out on more meaningful Champions League play, Atletico Madrid are back and with a vengeance. A statement win on opening day was worthy of praise, but they missed an opportunity to capitalize on a player advantage on matchday two. 10. Bayern Munich (-5)The Bundesliga side was on the ugly end of matchday one highlights, looking like a team with no fight and no answers. They had a much better showing on their second day out, but not enough to truly shift perceptions. They'll need more convincing performances if they want to climb back up the rankings.11. Twente (+4)An honorable start to the tournament by holding Chelsea to a draw, and looked poised for a run of two games with success. Unfortunately, they won't rise any higher on the rankings after late game mental lapse that led to a loss. \n12. OH Leuven (+6)The most hopeful of the hopefuls, OH Leuven has emerged as the leader of the underdog pack. Two solid performances to open their tournament, including their first-ever league phase win, the Belgians are not going to lie down to those who underestimate them.13. Paris FC (-3)You simply cannot let your opportunities slip away from you, and Paris FC struggled with that as they kicked off their league phase. They were unable to maintain a lead against a debutant side and had no answers against a more experienced team, hard to see where the adjustments can be made.14. Benfica (--)The Portuguese side came out losers on the end of some respectable performances. Unfortunately, the road will only get harder from here as other teams are managing decent form, and there's still Barcelona on the horizon.\n15. Valerenga (+2)The Norwegian club was unable to obtain any points out of their first games, but they did manage to score their first league phase goal thanks to Sara Horte. They were able to manage their goal differential, and if they can pull off any upset in the next round, anything can happen.16. Paris Saint-Germain (-3)A former great? A fall from grace? A spiral into irrelevance? How about all the above after a poor showing over the opening two rounds of the new league phase? There's too much talent on this roster to underperform the way they have been, and that's only going to start more questions about first-year head coach Paulo César.17. Roma (-8)A huge tumble down the rankings. This club had a chance to be underdogs but now they walk away in a whimper after a poor start to the tournament. They're backed into a corner now, needing points and to chip away at goal differential, and the schedule will do them no favors.\n18. St. Polten (-2)No points, last in goal differential, and last in our power rankings now. Showed no signs of life and they might be flatlining before the tournament really gets cranked up. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UWCL Power Rankings: USWNT's Alyssa Thompson goal keeps Chelsea among top teams, Barcelona look unstoppable - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/fcb3dc9c-c470-4adf-a30b-b8957f87def7/thumbnail/1200x675/98c0305c49907860aae1e07d678787e0/untitled-design-2025-10-17t214656-345.png"
      ],
      "datePublished": "2025-10-17T19:49:20.000Z",
      "dateModified": "2025-10-17T19:49:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's top games to watch, best bets, odds: Brewers look to avoid elimination, CFB and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-brewers-look-to-avoid-elimination-cfb-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/97a487c2-1d5c-4152-9a9a-fcb5253e9bb9/thumbnail/1200x675/b92d6b32f2c52e013462b243ac356494/pv-shohei-ohtani-pitching-00-00-16-20-still001.jpg",
    "tag": "Sports",
    "date": "2025-10-17T19:08:43.000Z",
    "description": "\nBaseball's biggest star has a chance to lead his team to the World Series on the sport's biggest stage Friday as Shohei Ohtani leads the way for the ",
    "body": "\nBaseball's biggest star has a chance to lead his team to the World Series on the sport's biggest stage Friday as Shohei Ohtani leads the way for the Los Angeles Dodgers when they host the Milwaukee Brewers in Game 4 of the National League Championship Series. First pitch is set for 8:38 p.m. ET from Dodger Stadium. Ohtani will be on the mound, and he's also a threat at the plate as he attempts to put the Dodgers in a position to become the first back-to-back World Series champions since the New York Yankees won three straight from 1998-2000.The Dodgers took command of the NLCS with a 3-0 lead behind a 3-1 victory in Game 3. Right-hander Tyler Glasnow delivered eight strikeouts in 5 2/3 innings on Thursday. This followed a complete-game win from right-hander Yoshinobu Yamamoto in Game 2 and eight strong innings in Game 1 from left-hander Blake Snell.Ohtani has never faced the Brewers in his career as a pitcher. It's unclear who will start for the Brewers as manager Pat Murphy as been noncommittal regarding who he will send to the mound, Although the Dodgers have had modest offensive output, the Brewers have been even worse. Milwaukee has scored just one run in each of the three games and has registered 10 total hits, with three of those from Caleb Durbin.\"Against these guys, it's going to take more than what we've shown so far,\" Durbin said. \"Whether that's just digging deeper, making an adjustment, we have to be better.\"Los Angeles is a -200 betting favorite (risk $200 to win $100), while Milwaukee is priced at +170 in the latest MLB sportsbook odds for Brewers vs. Dodgers. The over/under for total runs scored is 7.5. In addition to the monster MLB contest, we'll preview an NHL matchup between the Canucks and Blackhawks and a college football showdown between Minnesota and Nebraska. The following is a snapshot of what to watch for Friday, Oct. 17. All times Eastern. MLB best bets today, where to watchBrewers at DodgersTime: 8:38 p.m. | Location: Los Angeles | TV: TBS | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Brewers +170 | Expert: Dodgers -1 (Micah Roberts)  The SportsLine Projection Model likes the reeling Brewers to stave off elimination in Game 4 on Friday, with its simulations suggesting massive value in backing the underdog. The model's 10,000-game simulation sees Milwaukee staying alive with an outright victory about 50% of the time, a whopping disparity from the implied sportsbook odds of around 37.5%. However, SportsLine's Micah Roberts (+836 on MLB picks) doesn't share the model's optimism for the Brewers. He believes their offensive funk, in which they have scored three total runs in this series, is a sign of disarray from which they won't recover. He envisions the Dodgers rolling again in Game 4 and is willing to lay the run with the Dodgers in order to fetch more favorable odds. More MLB best betsMLB expert Matt Snyder's top plays for Brewers vs. Dodgers\nNHL best bets today, where to watchCanucks at Blackhawks  Time: 8:30 p.m. | Location: Chicago | TV: ESPN+ | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 5.5 goals | Expert: Blackhawks +120 (Bruce Marshall) The model has a slight lean toward the favored Canucks to win, but its stronger play is the Over on the posted total. Its 10,000-game simulation projects an average of 6.1 goals scored in the contest, providing enough value on the total. The teams have seen their last four combined games result in 30 total goals. SportsLine expert Bruce Marshall (+423 last 10 NHL picks) is siding with the underdog Blackhawks. He points out that Vancouver's Kevin Lankinen will be in goal instead to give rest to starter Thatcher Demko, and he sees that as an edge for Chicago. He also likes what he has seen thus from Chicago and is expecting another solid effort from the Blackhawks, who have won two straight following an 0-3 start. College football best bets today, where to watchNebraska at Minnesota Time: 8 p.m. | Location: Minneapolis | TV: FOX | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Minnesota ML +230 | Expert: Minnesota +7.5 (Matt Severance)The SportsLine Projection Model and SportsLine experts are in lockstep in supporting the Golden Gophers as a touchdown-plus home underdog against the Cornhuskers. The model sees an outright upset as a very real possibility, with its 10,000-game simulation showing Minnesota as the winner nearly half the time. This is in stark contrast to the implied sportsbook odds of around 32% and a projected final score of 24-23 in Nebraska's favor illustrates the degree to which the model views this matchup as a coin flip. SportsLine's Matt Severance (+540 on Nebraska picks) agrees, and he happily grabbed the +7.5 even though he missed the opening number of +9.5. Severance reasons that this is an air-tight matchup and is comfortable taking a full touchdown worth of points as he, similar to the model, envisions a one-score game either way. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's top games to watch, best bets, odds: Brewers look to avoid elimination, CFB and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/97a487c2-1d5c-4152-9a9a-fcb5253e9bb9/thumbnail/1200x675/b92d6b32f2c52e013462b243ac356494/pv-shohei-ohtani-pitching-00-00-16-20-still001.jpg"
      ],
      "datePublished": "2025-10-17T19:08:43.000Z",
      "dateModified": "2025-10-17T19:08:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louisville vs. Miami odds, picks, predictions, bets from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-louisville-prediction-odds-line-time-2025-college-football-week-8-friday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/fa9d0fbe-7794-42bc-bb22-c9d39d7f3f4c/thumbnail/1200x675/bcbb92ea771aa1e315e2fe8b670c339e/carson-beck-miami-hurricanes-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-17T18:00:27.000Z",
    "description": "\n        Carson Beck and the second-ranked Miami (Fla.) Hurricanes look to stay perfect on the season when they battle the Louisville Cardinals in an ",
    "body": "\n        Carson Beck and the second-ranked Miami (Fla.) Hurricanes look to stay perfect on the season when they battle the Louisville Cardinals in an ACC matchup on Friday night. Louisville is coming off a 30-27 overtime loss to Virginia on Oct. 4, while Miami defeated Florida State 28-22 that same night. The Cardinals (4-1, 1-1 ACC), who are 0-1 against ranked opponents, are 1-0 on the road this season. The Hurricanes (5-0, 1-0 ACC), who are 2-0 against unranked opponents, are 4-0 on their home field in 2025.Kickoff from Hard Rock Stadium in Miami Gardens, Fla., is at 7 p.m. ET. Miami leads the all-time series 11-4-1, but Louisville has won four of the last six, including a 38-31 decision in 2023. The Hurricanes are 12.5-point favorites in the latest Louisville vs. Miami odds, while the over/under for total points scored is 49.5 via SportsLine consensus. Before making any Louisville vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Louisville vs. Miami. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Miami vs. Louisville:Louisville vs. Miami                                                                 spreadMiami -12.5 at DraftKings SportsbookLouisville vs. Miami                                                                           over/under49.5 pointsLouisville vs. Miami                                                                           money line Miami -503, Louisville +380Louisville vs. Miami                                                                   picksSee picks at SportsLineLouisville vs. Miami                                                                     streaming Fubo (Try for free)  Why Miami can coverBeck has led the Hurricanes' offensive attack in his first season with the program after four years at Georgia, completing 102 of 139 passes (73.4%) for 1,213 yards and 11 touchdowns with three interceptions in five games. He has also rushed for one touchdown. In last week's win over Florida  State, he completed 20 of 27 passes (74.1%) for 241 yards and four touchdowns. In a 49-12 win over South Florida on Sept. 13, he completed 23 of 28 passes (82.1%) for 340 yards and three touchdowns with two interceptions. He also rushed six times for 28 yards and a score. Also leading the Miami offense is junior running back Mark Fletcher Jr. He has carried 78 times for 428 yards (5.5 average) and five touchdowns. He also has five receptions for 53 yards. In a 26-7 win over Florida on Sept. 20, he rushed 24 times for 116 yards and one touchdown. He carried 16 times for 120 yards and two touchdowns in the win over USF. See which team to back at SportsLine. Why Louisville can coverFormer USC quarterback Miller Moss is Louisville's signal caller. The transfer senior, who played four years with the Trojans, has completed 120 of 179 passes (67%) for 1,358 yards and seven touchdowns with four interceptions for a 139.2 rating. In last week's loss to No. 24 Virginia, he completed 34 of 48 passes (70.8%) for 329 yards and two touchdowns with one interception. He also rushed for one touchdown.His top target is senior wide receiver Chris Bell. In five games, he has 35 receptions for 502 yards (14.3 average) and four touchdowns. In the loss to Virginia, he caught 12 passes for 170 yards (14.2 average) and two touchdowns. In a 34-27 win over Pittsburgh on Sept. 27, he caught 10 passes for 135 yards and one score. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Miami vs. Louisville picksSportsLine's model is going Over on the total, projecting 64 combined points. It also says one side of the spread hits in nearly 70% of simulations.     You can only get the pick at SportsLine. So who wins Miami vs. Louisville, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Louisville vs. Miami spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisville vs. Miami odds, picks, predictions, bets from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/fa9d0fbe-7794-42bc-bb22-c9d39d7f3f4c/thumbnail/1200x675/bcbb92ea771aa1e315e2fe8b670c339e/carson-beck-miami-hurricanes-imagn-images.jpg"
      ],
      "datePublished": "2025-10-17T18:00:27.000Z",
      "dateModified": "2025-10-17T18:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]