[
  {
    "title": "NFL DFS picks, Cowboys vs. Vikings: Top daily Fantasy lineups for 'Sunday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-cowboys-vikings-daily-fantasy-picks-lineups-advice-stacks-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/28/55cdbcaf-8cf4-4d5b-a23d-8194a9e9d702/thumbnail/1200x675/cdecf71b65c35e87501a22231ac880b9/usatsi-27193750-jordan-addison-vikings-wr-4q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2025-12-14T23:52:58.000Z",
    "description": "\nThe Minnesota Vikings head to Dallas to take on the Cowboys in the Week 15 edition of 'Sunday Night Football' at 8:20 p.m. ET. Dallas ranks third in ",
    "body": "\nThe Minnesota Vikings head to Dallas to take on the Cowboys in the Week 15 edition of 'Sunday Night Football' at 8:20 p.m. ET. Dallas ranks third in the NFL in scoring offense as it is powered by big names like Dak Prescott, CeeDee Lamb and George Pickens. Minnesota hasn't been as successful offensively, but with skill players like Justin Jefferson, Jordan Addison and T.J. Hockenson to consider for NFL DFS picks, the Vikings still deserve a long look from daily Fantasy players.How should you build your NFL DFS lineups for 'Sunday Night Football,' and which sleepers, like potentially Malik Davis or Jalen Nailor, should factor into your NFL DFS strategy? Before making any Vikings vs. Cowboys DFS picks on sites like FanDuel or DraftKings for 'Sunday Night Football', be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. \nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Sunday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Vikings vs. CowboysOne of McClure's top NFL DFS picks for 'Sunday Night Football' is Prescott. He leads the NFL in passing yardage with 3,637 yards and he's fourth among quarterbacks in Fantasy production. He's found a new level the past few weeks, throwing for at least 320 yards in his past three games and throwing for a total of nine touchdowns over the past four outings, making him a strong NFL DFS pick for 'Sunday Night Football,' especially with Lamb cleared to play after passing concussion protocol. See who else to roster at SportsLine. Bet Dak Precott to go Over 264.5 passing yards at DraftKings:\nMcClure is also building his 'Sunday Night Football' NFL DFS strategy around Vikings receiver Jordan Addison. He's been a big part of the offense the past two weeks with 17 combined targets leading to nine receptions during that span. Dallas has given up more Fantasy points to opposing receivers than any other defense this year, and cornerback Trevon Diggs (knee) is out for the Cowboys. See more NFL DFS picks at SportsLine. How to set Cowboys vs. Vikings DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Cowboys vs. Vikings: Top daily Fantasy lineups for 'Sunday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/28/55cdbcaf-8cf4-4d5b-a23d-8194a9e9d702/thumbnail/1200x675/cdecf71b65c35e87501a22231ac880b9/usatsi-27193750-jordan-addison-vikings-wr-4q-2025-1920.jpg"
      ],
      "datePublished": "2025-12-14T23:52:58.000Z",
      "dateModified": "2025-12-14T23:52:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs eliminated from NFL playoffs as Patrick Mahomes suffers torn ACL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-eliminated-from-playoffs-mahomes-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/fb8ffbe6-33c4-47f8-b29c-e5214c350f9d/thumbnail/1200x675/8d9639eca4ff2f96c3c7c036fe2dc109/patrick-mahomes.jpg",
    "tag": "Sports",
    "date": "2025-12-15T00:32:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Kansas City Chiefs on Sunday were eliminated f",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Kansas City Chiefs on Sunday were eliminated from playoff contention. Their 10-year streak of making the playoffs is over. Their nine-year streak of winning the AFC West has come to an end. And their streak of making the AFC title game in every year of Patrick Mahomes' career and the Super Bowl in each of the previous three seasons are finished as well.The Chiefs were eliminated by virtue of their loss to the Los Angeles Chargers, the Buffalo Bills' victory over the New England Patriots, the Jacksonville Jaguars' win over the New York Jets and the Houston Texans' win over the Arizona Cardinals. They came into the day with only the slimmest of playoff hopes, but those hopes were dashed as they fell 16-13 in a tightly contested, defense-dominated game against their division rivals. \nThe loss was Kansas City's seventh one-score defeat of the season, with the Chiefs continuing to struggle in close contests just a year after dominating such games by going 11-0 in them during the 2024 regular season. The Chiefs were at one point 5-3 and seemingly recovered from their cold start to the season, but they lost five out of six games to fall all the way out of contention.Worse yet, Mahomes limped off the field late in the game with what appeared to be a serious knee injury. After undergoing an MRI, the team officially announced later on Sunday that the three-time Super Bowl champion suffered a torn ACL. In the announcement, Kansas City noted that Mahomes and the team are currently exploring surgical options. \nMahomes was down and in pain for several minutes and eventually had to be helped into the locker room by the training staff. Gardner Minshew entered in his place and played out the final drive for the Chiefs, only to be intercepted on his final pass attempt of the game, sealing both the loss and the Chiefs' fate. \nJust before the official news came out of Mahomes' torn ACL, he posted a message on X that seemed to indicate the severity of the injury. \n\"Don't know why this had to happen,\" Mahomes posted. \"And not going to lie it's hurts. But all we can do now is Trust in God and attack every single day over and over again. Thank you Chiefs kingdom for always supporting me and for everyone who has reached out and sent prayers. I Will be back stronger than ever.\" \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs eliminated from NFL playoffs as Patrick Mahomes suffers torn ACL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/fb8ffbe6-33c4-47f8-b29c-e5214c350f9d/thumbnail/1200x675/8d9639eca4ff2f96c3c7c036fe2dc109/patrick-mahomes.jpg"
      ],
      "datePublished": "2025-12-15T00:32:14.000Z",
      "dateModified": "2025-12-15T00:32:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patrick Mahomes injury update: Chiefs QB has torn ACL, vows to return - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patrick-mahomes-injury-kansas-city-chiefs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/a1b381fe-1fd1-435d-aad1-5e7f3b6d6cf5/thumbnail/1200x675/a72e1f2edba7069d276cbb9b1581df48/untitled-design-2025-12-14t134555-134.png",
    "tag": "Sports",
    "date": "2025-12-15T00:31:18.000Z",
    "description": "\n        Patrick Mahomes sustained a left knee injury in the Kansas City Chiefs' 16-13 loss to the Los Angeles Chargers on Sunday and departed from th",
    "body": "\n        Patrick Mahomes sustained a left knee injury in the Kansas City Chiefs' 16-13 loss to the Los Angeles Chargers on Sunday and departed from the game with 1:53 remaining. An MRI later on Sunday confirmed that the superstar quarterback sustained a torn ACL in that knee, the team announced, and Mahomes and the team are exploring surgical options for the season-ending injury.The injury occurred while Mahomes was rolling out toward the sideline and throwing the ball downfield. A Chargers defender pulled him to the ground during the throw, and his leg bent awkwardly as he lost his footing.\"Don't know why this had to happen,\" Mahomes said on social media. \"And not going to lie it's hurts. But all we can do now is Trust in God and attack every single day over and over again. Thank you Chiefs kingdom for always supporting me and for everyone who has reached out and sent prayers. I Will be back stronger than ever ⏰\"Mahomes remained down on the field for multiple minutes while trainers examined his leg. He was in clear discomfort and removed his helmet before rising to his feet and walking into the medical tent. Trainers then helped him walk up the tunnel and into the locker room.\n\"I don't know, but it doesn't look good,\" Reid said of the severity of Mahomes' injury before an MRI revealed the ligament damage. \"You guys saw it. We'll just see where it goes.\"\nThe Chiefs trailed, 16-13, when Mahomes left the contest. He completed 16 of 28 passes for 189 yards without a touchdown, and he threw one interception and took five sacks. Mahomes did find the end zone with his legs, however, and took two carries for 15 yards and a touchdown. Gardner Minshew closed the game in relief of Mahomes and could not deliver a game-tying or go-ahead scorePatrick Mahomes injury clouds Chiefs' outlook for 2025 and beyondWith the loss and the results in other games on Sunday, the Chiefs are eliminated from playoff contention. Kansas City faced a number of elimination scenarios entering Week 15, and a string of results occurred in the early window to dash its postseason homes. The loss to the Chargers, combined with the Jaguars' win over the Jets, the Bills' win over the Patriots and the Texans' win over the Cardinals triggered a nightmare outcome for the Chiefs, who will watch the playoffs from home for the first time since 2014.The 10-year playoff streak was the second longest in NFL history behind the Patriots' 11-year run from 2009-19. This is thus the first time in Mahomes' nine-year career that he will not participate in the postseason.\nWith this appearing to be the end of the line for Mahomes in 2025, it could conclude a golden era of Chiefs football. Kansas City will await a decision this offseason from tight end Travis Kelce as he decides whether to continue playing or to enter retirement. The Mahomes-Kelce era marked one of the all-time great quarterback-tight end pairings and produced nine AFC West titles, five AFC crowns and three Super Bowl championships.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patrick Mahomes injury update: Chiefs QB has torn ACL, vows to return - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/a1b381fe-1fd1-435d-aad1-5e7f3b6d6cf5/thumbnail/1200x675/a72e1f2edba7069d276cbb9b1581df48/untitled-design-2025-12-14t134555-134.png"
      ],
      "datePublished": "2025-12-15T00:31:18.000Z",
      "dateModified": "2025-12-15T00:31:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Vikings prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-vikings-prediction-odds-time-week-15-sunday-night-football-picks-nfl-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/eeb1b3f0-f0f7-41e9-b7c5-b3ce5fd06f5b/thumbnail/1200x675/71783ec45a57dc71348ddbfcfc8c90e7/dak-prescott-2.jpg",
    "tag": "Sports",
    "date": "2025-12-15T00:02:05.000Z",
    "description": "\nTeams outside of the NFC playoff picture will meet on 'Sunday Night Football' when the Dallas Cowboys host the Minnesota Vikings. Dallas (6-6-1) is c",
    "body": "\nTeams outside of the NFC playoff picture will meet on 'Sunday Night Football' when the Dallas Cowboys host the Minnesota Vikings. Dallas (6-6-1) is coming off a Thursday loss to Detroit, 44-30, which ended the Cowboys' three-game win streak. Minnesota (5-8) ended a four-game slide with a stunning 31-0 victory over Washington in Week 14. The Vikings would be eliminated from playoff contention with a loss to Dallas. Jake Ferguson (calf) is active for the Cowboys, as is CeeDee Lamb who passed concussion protocol. OL Christian Darrisaw is inactive for Minnesota.Kickoff is at 8:20 p.m. ET from AT&T Stadium in Arlington, Texas. Dallas has won each of the last three meetings, which all came on the road. The latest Vikings vs. Cowboys odds have Dallas as 5.5-point favorites, while the over/under for total points scored is 47.5 via SportsLine consensus. Dallas is 7-6 against the spread this season, while Minnesota is 5-8 versus the line. Before making any Cowboys vs. Vikings picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Vikings vs. Cowboys. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends for Cowboys vs. Vikings:Vikings vs. Cowboys                                                                 spreadDallas -5.5 at DraftKings SportsbookVikings vs. Cowboys             over/under47.5 pointsVikings vs. Cowboys                                                                                                                                                                             money line Dallas -249, Minnesota +204Vikings vs. Cowboys                                                                                                                                                                     picksSee picks at SportsLineVikings vs. Cowboys                                                                                                                                                                       streaming Fubo (Try for free)  \nWhy the Vikings can coverPlaying at home hasn't been much of an advantage for the Cowboys in this series, as the Vikings sport a 7-2 record over their last nine regular season trips to Dallas. Last week saw Minnesota play its most complete game of the year, scoring its second-most points (31) while allowing its fewest (0) as J.J. McCarthy had his best game as a pro. The second-year QB had three passing touchdowns and no turnovers as he has a great chance of continuing that type of production versus Dallas' 31st-ranked scoring defense, especially with it still missing CB Trevon Diggs (knee). The Cowboys rank dead last, however, in passing defense, with additional bottom-two rankings in both third-down defense and redzone defense. The Vikings' defense is light years ahead of the Cowboys, with the former ranking No. 3 in the redzone and No. 4 against the pass. See which team to back at SportsLine. Why the Cowboys can coverThe Cowboys have covered in four of their last five home games in 2025, while the Vikings have dropped four of their last five, overall, versus the spread. Dallas' success is predicated on its offense, which is elite, as Dak Prescott leads the NFL in both passing yards and QBR, as the Cowboys rank first in total yards and third in points scored. At home, the Cowboys are averaging 32.7 points, which is twice as much as the 16 ppg that the Vikings are averaging outside of Minneapolis. Additionally, no team has committed more turnovers than the Vikings, who also have the league's second-worst turnover differential, and giving the ball away will only allow Dallas' high-octane offense to put more points on the scoreboard. See which team to back at SportsLine.How to make Cowboys vs. Vikings picksSportsLine's model has simulated Vikings vs. Cowboys 10,000 times is going Over on the total, projecting 50 combined points. It also says one side of the spread hits in over 60% of simulations in an A-rated pick.         You can only get the pick at SportsLine. So who wins Cowboys vs. Vikings, and which side of the spread hits over 60% of the time in an A-rated pick? Visit SportsLine now to see which side of the Vikings vs. Cowboys spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Vikings prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/eeb1b3f0-f0f7-41e9-b7c5-b3ce5fd06f5b/thumbnail/1200x675/71783ec45a57dc71348ddbfcfc8c90e7/dak-prescott-2.jpg"
      ],
      "datePublished": "2025-12-15T00:02:05.000Z",
      "dateModified": "2025-12-15T00:02:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 15 overreactions or reality? Josh Allen for MVP? Zac Taylor out in Cincy? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-15-overreactions-josh-allen-for-mvp-zac-taylor-done-in-cincinnati/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/2fa82b5a-cc28-4ce8-a879-be64b457bfb1/thumbnail/1200x675/47daaa616362ffecf47f83199a024238/template-pic.jpg",
    "tag": "Sports",
    "date": "2025-12-14T23:09:42.000Z",
    "description": "\n        Week 15 lived up to the hype. Leading up to the slate, it was poised to be one of, if not the, defining weekend of the 2025 regular season. A",
    "body": "\n        Week 15 lived up to the hype. Leading up to the slate, it was poised to be one of, if not the, defining weekend of the 2025 regular season. As the action unfolded, we started to see the playoff picture come into focus, particularly with teams that will not be vying for a Lombardi Trophy this winter. Most notably, the Kansas City Chiefs and Cincinnati Bengals were officially eliminated from playoff contention, meaning neither Patrick Mahomes nor Joe Burrow will be a factor in the AFC. That's good news for Josh Allen, who helped the Buffalo Bills rally from a 21-point deficit against the New England Patriots to keep his team's hopes of leaping into first place in the AFC East alive. Naturally, there are numerous takeaways from the pandemonium that Week 15 produced. But which of those takeaways are something that will have legs for the final three weeks, and which are merely an overreaction? Below, we'll determine just that by taking a look at some of the notable storylines from Week 15 and figure out which we should take seriously and which we should chalk up as a mere overreaction. Josh Allen has played himself into the MVP conversationOverreaction vs. reality: RealityJosh Allen was sensational in Week 15. The Bills QB kept his team's hopes of winning the division alive by rallying from a 21-point deficit over the New England Patriots in Foxborough. Allen led a second-half rally that saw Buffalo outscore New England 28-7, and the defending NFL MVP led five straight touchdown drives in the process. Allen finished the day throwing for three touchdowns to go with his 193 yards through the air and a 123.1 passer rating. \nThis was the third time this season that the Bills rallied from a deficit of 10 or more points, and the second in as many weeks. Not only does this latest comeback win keep Buffalo in range of the AFC East crown, but it should also thrust him into the MVP conversation with Drake Maye (who he just defeated) and Matthew Stafford. Allen just notched his third season with at least 25 passing touchdowns and 10 rushing touchdowns, which is the most in NFL history. If he gets Buffalo back atop the division, there's a strong case for a back-to-back MVP.\n        \n            \n                2025 NFL playoff picture, standings: Bills stay alive in the AFC East race, Chiefs eliminated from contention\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nEagles have fixed their issues on offenseOverreaction vs. reality: OverreactionPhiladelphia looked like a well-oiled machine during Sunday's 31-0 win over the Raiders. Jalen Hurts completed 12 of his 15 passes for 175 yards and three touchdowns, while adding 39 yards on the ground. This was Hurts' first game with three or more passing touchdowns since Week 8, and he had just four passing touchdowns over his last five games combined. Meanwhile, the Eagles averaged 5.9 yards per play and converted 10 of their 13 third-down situations in the win. While this was encouraging for the offense, I wouldn't exhale fully if I were Philly. The Las Vegas Raiders are arguably the worst team in the NFL, and have struggled mightily in the secondary. Had the Eagles not had their way with them through the air in Week 15, it would've been a five-alarm fire. Simply put, they did what they were supposed to do and snapped a three-game losing skid in the process. Lucky for them, they get another easy matchup next week against a poor Commanders pass defense, so the good times should continue to roll. Have they actually fixed their issues, though? That remains to be seen. \nZac Taylor coached his last meaningful game for BengalsOverreaction vs. reality: RealityJoe Burrow made headlines this week when he made ominous comments about his playing future. However, I think more eyes should be on his coach. After a shutout loss to the Baltimore Ravens, Cincinnati is officially eliminated from playoff contention, which should make the seat under Zac Taylor hotter than the surface of the sun. While he may not get the boot in the immediate aftermath of this contest, I believe he coached his last meaningful game for Cincinnati in Week 15, with the club potentially looking for new leadership once the regular season officially concludes. When you pair Burrow's comments with the lackluster effort we saw unfold in Week 15, this feels like an organization that has no one to inspire, which falls on the shoulders of Taylor. Jaguars are the best team in the AFC SouthOverreaction vs. reality: OverreactionThe Jaguars just notched their fifth straight win and is 10-4 on the season, which keeps them in first place in the AFC South. While the Jags are the No. 3 seed in the conference, I still have a hard time thinking they are the best in their own division, let alone one of the top clubs in the AFC. Trevor Lawrence was spectacular in Week 15, throwing for five touchdowns and adding a rushing score.\nAs impressive as it was, we have to point out that it came against the lowly New York Jets, and this current winning streak hasn't seen them beat a ton of powerbrokers in the NFL (Chargers, Cardinals, Titans, Colts, Jets). Next week's game at Denver will be a better barometer as to who this team actually is, and how we should view it in the overall playoff picture in the AFC. I think if you gave every playoff team in the AFC some truth serum, each would confess rather playing Jacksonville than Houston at the moment.  Shedeur Sanders played his way out as Browns QB of the futureOverreaction vs. reality: RealityIt was a memorable day for Shedeur Sanders for all the wrong reasons. The Browns quarterback struggled mightily in a 31-3 loss to the Chicago Bears, completing just 51.4% of his passes for 177 yards, no touchdowns, and three interceptions. Those turnovers should be Cleveland's biggest concern as the Browns continue to evaluate the rookie as a potential franchise quarterback. \nSanders had just two interceptions over his first three career starts, so to see the floor fall out from under him here may be the first domino that takes him out of consideration as the QB of the future. Certainly, Sanders didn't do himself any favors in convincing the Browns to steer clear of drafting a young signal-caller.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 15 overreactions or reality? Josh Allen for MVP? Zac Taylor out in Cincy? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/2fa82b5a-cc28-4ce8-a879-be64b457bfb1/thumbnail/1200x675/47daaa616362ffecf47f83199a024238/template-pic.jpg"
      ],
      "datePublished": "2025-12-14T23:09:42.000Z",
      "dateModified": "2025-12-14T23:09:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 in bonus bets by targeting Lions-Rams, Broncos-Packers, Vikings-Cowboys - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-lions-rams-broncos-packers-vikings-cowboys/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-14T19:26:21.000Z",
    "description": "\n        Sports bettors can spice up Sunday's NFL Week 15 games with the latest DraftKings promo code, which gives new users $200 in bonus bets if you",
    "body": "\n        Sports bettors can spice up Sunday's NFL Week 15 games with the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. Many of the NFL games with playoff implications occur later on Sunday, including a Sunday Night Football matchup when the Dallas Cowboys host the Minnesota Vikings. The Cowboys, who at 6-6-1 are in the playoff mix, have been elite at home in recent weeks, with victories over both teams that played in last year's Super Bowl. That's a trend the SportsLine Projection Model expects to continue on Sunday Night Football, backing the Cowboys to cover as 5.5-point favorites in its NFL best bets at DraftKings Sportsbook, down a half-point from the opener. Cowboys vs. Vikings has an over-under of 47.5, down one from the opening line, and the model is calling for a 30-20 Dallas victory.A pair of SportsLine's top experts have picked a side from games in the 4 p.m. ET slate that could vie for the game of the week for Rams vs. Lions (+6, 54.5) and Packers vs. Broncos (+1.5, 42.5). Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Sunday NFL best bets at DraftKings SportsbookBroncos (+1.5) vs. PackersLions (+6) vs. RamsCowboys (-5.5) vs. VikingsCombining the model's three picks into a Sunday NFL parlay at DraftKings would result in a payout of +576 (risk $100 to win $576). Bet it at DraftKings here:\nBroncos (+1.5) vs. Packers\"Is the marketplace overmanaging and overthinking too much for this clash? The Broncos should not be underdogs at home against anybody, not with a 10-game SU win streak,\" legendary SportsLine expert Bruce Marshall said. \"The fact Denver is winning these games close shouldn't be held against Sean Payton's crew; their style of game simply is methodical, with few big plays these days on offense, and the defense is good enough to win most games. Margins can start to expand for Denver when the stop unit begins to convert pick-sixes and scoop-and-scores like a year ago. That hasn't happened as much this season, but the Broncos keep winning as Bo Nix and the offense do just enough each week. Note the Pack has covered just three of its last 12 away.\" Back the Broncos at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Lions (+6) vs. Rams\"I have the Rams as the best team in the league in my power ratings, but I'm jumping on the Lions with this line at 6 at DraftKings,\" SportsLine NFL expert R.J. White said. \"Detroit has the No. 1 scoring offense in the league after a big game against the Cowboys, with a top-five mark in net yards per pass attempt and yards per rush. Recent losses have come down to uncharacteristic struggles on fourth down, and a typical day on that front will allow them to stay close. There are a few teams I trust more to get a backdoor cover if needed as well. The lookahead was 4.5 and the Lions had a much-needed big win. Why the inflation? I think this line should be 4.\" Back Detroit at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Cowboys (-5.5) vs. VikingsThe Cowboys are 4-1-1 straight up at home this season, and 4-2 against the spread at AT&T Stadium. Dallas defeated the Eagles, 24-21, and the Chiefs, 31-28, at home over the last three weeks, and this current version of the Vikings isn't nearly the competition level of the two teams that played in last year's Super Bowl. Dallas is third in the NFL in scoring at 29.3 ppg this season, including 32.7 ppg at home. Dallas gave up 44 points on the road to the Lions last week, but their defense has performed much better at home since adding to the unit at the trade deadline. Vikings quarterback J.J. McCarthy has the third-worst quarterback rating of 48 QBs this season. The Vikings are 26th in the league at 19.6 ppg this season, and the model doesn't expect Minnesota to be able to keep pace with Dallas, projecting the Cowboys to cover in 60% of simulations. Back the Cowboys at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more NFL picks?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 in bonus bets by targeting Lions-Rams, Broncos-Packers, Vikings-Cowboys - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-14T19:26:21.000Z",
      "dateModified": "2025-12-14T19:26:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Panthers vs. Saints picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/panthers-saints-where-to-watch-nfl-week-15-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/069dde1f-cf57-4495-bd3d-9d8da8955357/thumbnail/1200x675/d1b42b200abe546aa54777ae85f27b89/bryce-young-panthers.jpg",
    "tag": "Sports",
    "date": "2025-12-14T16:52:38.000Z",
    "description": "\nThe Carolina Panthers will look to stay in contention for the NFC South crown that they're competing with the Tampa Bay Buccaneers for when they visi",
    "body": "\nThe Carolina Panthers will look to stay in contention for the NFC South crown that they're competing with the Tampa Bay Buccaneers for when they visit a struggling New Orleans Saints team in Week 15. The Panthers are 7-6 and have a legit shot of making the postseason for the first time since 2017, while the 3-10 Saints are just trying to get some momentum entering 2026. The Saints picked up one of their three wins against this Panthers team on Nov. 9, and Carolina, which is coming off a bye week, surely hasn't forgotten that. Kickoff from Caesars Superdome is set for 4:25 p.m. ET. The Panthers are 2.5-point favorites, per the latest Panthers vs. Saints odds from DraftKings, and the over/under for total points scored is 40.5. The Panthers are -146 money line favorites (risk $146 to win $100), while the Saints are +123 underdogs. Before making any Panthers vs. Saints picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Panthers vs. Saints on SundayWhen: Sunday, Dec. 14Time: 4:25 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppPanthers vs. Saints betting previewOdds: Panthers -2.5, over/under 40.5This was a low-scoring affair last time these teams met, with the two sides combining for just 24 points in a Saints upset win. Carolina has been good against the spread this year at 8-5, while New Orleans is 5-8 ATS. The Panthers are also 7-6 to the Over this year, while the Saints are 4-9.Panthers vs. Saints SGPPanthers -2.5Under 40.5Saints Under 9.5 first half pointsBet it at DraftKings:\nModel's Panthers vs. Saints score prediction, picksThe Panthers are looking to become the first team besides the Bucs to win the NFC South since 2020, and a win over a lowly Saints team is definitely needed to help with that quest. However, the model thinks the Saints are the team to back here as it has New Orleans not just covering the majority of the time, but winning outright in nearly 60% of simulations at plus money.Panthers vs. Saints score prediction: Saints 24, Panthers 21\nWant more Week 15 NFL picks?You've seen the model's best bets for Carolina Panthers vs. New Orleans Saints. Now, get against the spread, total and money-line picks for every Week 15 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Panthers vs. Saints picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/069dde1f-cf57-4495-bd3d-9d8da8955357/thumbnail/1200x675/d1b42b200abe546aa54777ae85f27b89/bryce-young-panthers.jpg"
      ],
      "datePublished": "2025-12-14T16:52:38.000Z",
      "dateModified": "2025-12-14T16:52:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Diamondbacks bring back Merrill Kelly; Rangers not shopping Corey Seager - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-diamondbacks-merrill-kelly-cardinals-brendan-donovan-mariners-giants-yankees-luis-robert/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/a6b5c58b-f94b-4c0d-bc50-5bb10cb4ae2e/thumbnail/1200x675/4f2bdc79949639e596fb4c2271c8b436/seager-getty.png",
    "tag": "Sports",
    "date": "2025-12-14T20:45:41.000Z",
    "description": "\n        The 2025-26 MLB offseason is six weeks old and so far 21 of our top 50 free agents have signed and our No. 1 trade candidate has been dealt. ",
    "body": "\n        The 2025-26 MLB offseason is six weeks old and so far 21 of our top 50 free agents have signed and our No. 1 trade candidate has been dealt. Spring training is two months away and there is still a lot of player movement to come between now and then. Here now are Sunday's hot stove happenings.  Rangers not shopping Seager\nRangers POBO Chris Young said flatly During an appearance on MLB Network Radio on Sunday that the team is \"not shopping Corey Seager.\" With the Rangers expected to cut payroll (or at least not raise it), contenders have reportedly called Texas about Seager in recent weeks. The 31-year-old two-time World Series MVP is owed $31 million a year for another six years.You can parse Young's words and focus on the fact \"not shopping\" is not the same thing as \"not trading,\" though my guess is that is just a function of a live radio interview. Every team listens to offers for every player every offseason. They wouldn't be doing their job if they didn't. The Rangers will listen on Seager. That does not mean they're eager to trade him though.AL East teams pursuing King\nFree-agent right-hander Michael King has three AL East teams chasing him (Orioles, Red Sox, Yankees), reports the Boston Globe. He declined the $22.025 million qualifying offer from the Padres earlier this offseason and therefore is attached to draft pick compensation, potentially affecting his market. We ranked King as the 17th-best free agent available this winter.\nKing, 30, knows the AL East well from his time with the Yankees, who sent him to San Diego in the Juan Soto trade. He had a terrific 2024 that saw him finish seventh in the NL Cy Young voting. Shoulder and knee injuries derailed his 2025, though he's seen as something of a buy-low candidate, especially since he's proven he can start or be an effective multi-inning setup man.  D-backs bring back Kelly  \nArizona's search for pitching has led them to a familiar face. The Diamondbacks and Merrill Kelly are reuniting on a two-year contract worth $40 million, reports The Athletic. Kelly, 37, had been with the D-backs since 2019 before being traded to the Rangers for three prospects at this summer's deadline. We ranked him as the 27th-best free agent available this offseason.  Zac Gallen is a free agent and unlikely to return to the D-backs, who will also be without Corbin Burnes to begin 2026 (he had Tommy John surgery in June and won't return until after the All-Star break at the earliest). Kelly will step into a rotation that includes the recently signed Michael Soroka and holdovers Ryne Nelson, Brandon Pfaadt, and Eduardo Rodriguez.  \n  Frontrunners emerge for Donovan  \nThe Giants and Mariners have emerged as the frontrunners for Cardinals super utility guy Brendan Donovan, reports The Athletic. St. Louis hopes to land multiple prospects in return, most likely pitchers given the team's needs. The Cardinals are not prioritizing short-term wins and Donovan, 28 and two years away from free agency, doesn't align with the club's contention cycle.  Second base is Donovan's best position and the Giants and Mariners both have openings at the keystone, the latter after Jorge Polanco bolted for the Mets. Donovan has played every position except catcher and center field in the big leagues though. He's a good hitter and one of those players you can always find a way to get into a lineup. He's been a popular trade target this winter.    Several teams interested in Robert  \nThe Mets, Padres, and Pirates are among the teams with interest in White Sox center fielder Luis Robert Jr., according to Francys Romero. The ChiSox declined to trade Robert at the deadline and instead picked up his $20 million club option for 2026, hoping to get a better return in the offseason. Chances are Chicago will have to eat some of that money to facilitate a trade.\nRobert, 28, has not hit much the last two years, though he remains a top flight defensive center fielder and baserunner. He's two years removed from a 38-homer season. Given the dearth of quality center fielders in the sport right now, there are worse dice rolls than the 28-year-old Robert. If the White Sox don't like the offers this winter, they could keep him and try again at the deadline.    \tYankees interested in Romero  \nThe Yankees are among the teams with interest in Cardinals lefty reliever JoJo Romero, reports the St. Louis Post-Dispatch. Romero, 29, is a year away from free agency, making it likely St. Louis will move him this offseason. The sinker specialist has posted an above-average ground ball rate throughout his career and even closed at times this past season.  New York already has a ground ball lefty in sidewinder Tim Hill, though they place an emphasis on ground balls and limiting home runs in the late innings, hence their interest in Romero. Quality lefty relievers are imperative in the AL East, which houses lefty hitters Roman Anthony, Jarren Duran, Jonathan Aranda, Gunnar Henderson, Brandon Lowe, and Daulton Varsho, among others.   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Diamondbacks bring back Merrill Kelly; Rangers not shopping Corey Seager - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/a6b5c58b-f94b-4c0d-bc50-5bb10cb4ae2e/thumbnail/1200x675/4f2bdc79949639e596fb4c2271c8b436/seager-getty.png"
      ],
      "datePublished": "2025-12-14T20:45:41.000Z",
      "dateModified": "2025-12-14T20:45:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers vs. Dolphins prediction, odds: 'Monday Night Football' picks today from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-dolphins-prediction-odds-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/13/42b76484-b9c7-4cca-949a-90547ef2e040/thumbnail/1200x675/6065226995a0c806240503903bf08e12/tua-tagovailoa-miami-dolphins-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-14T18:19:08.000Z",
    "description": "\nA pair of AFC playoff hopefuls will meet in a pivotal 'Monday Night Football' matchup to conclude NFL Week 15 as the Miami Dolphins visit the Pittsbu",
    "body": "\nA pair of AFC playoff hopefuls will meet in a pivotal 'Monday Night Football' matchup to conclude NFL Week 15 as the Miami Dolphins visit the Pittsburgh Steelers. Miami (6-7) has won six straight, most recently defeating the Jets, 34-10, to get back into postseason contention. Pittsburgh (7-6) is coming off a 27-22 win over Baltimore and sits atop the AFC North. The Steelers lead the all-time series by the narrowest of margins, 15-14.Kickoff is at 8:15 p.m. ET from Acrisure Stadium in Pittsburgh. Miami won the last matchup, 16-10, back in 2022. The latest Dolphins vs. Steelers odds have Pittsburgh as 3-point home favorites, while the over/under for total points scored is 42.5. Before making any Steelers vs. Dolphins     picks, be sure to see the NFL predictions from SportsLine's projection model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 15 on a 50-35 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Miami vs. Pittsburgh. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Steelers vs. Dolphins:Dolphins vs. Steelers            spreadSteelers -3 at DraftKings SportsbookDolphins vs. Steelers                over/under42.5 pointsDolphins vs. Steelers                money line Steelers -175, Dolphins +147Dolphins vs. Steelers                picksSee picks at SportsLineDolphins vs. Steelers        streaming Fubo (Try for free)\nWhy the Dolphins can coverWinners of four straight, the Dolphins have covered in three of those games and are 7-4 ATS over their last 11 games. Miami's defense has risen to the occasion as of late, holding each of its last four opponents to 17 points or fewer while also notching 10 takeaways during this stretch. On offense, Mike McDaniel has a rushing unit that ranks fifth in yards per carry and eighth in yards per game. De'Von Achane is on pace for nearly 2,000 scrimmage yards, while Jaylen Wright had 107 yards and a touchdown last week. The Dolphins also get to face a Pittsburgh defense that is reminding no one of the Steel Curtain, as the Steelers rank 27th or worse in total yards allowed, passing defense and third-down defense. See which team to back at SportsLine.Why the Steelers can coverThis game is in Pittsburgh at night, which plays into the forecast calling for a game time temperature of 25 degrees. That's relevant because Miami has lost 13 straight games with temps under 40 degrees, as Tua Tagovailoa is 0-8 in his career in such contests. The Dolphins quarterback has had a season to forget, as he leads the NFL with 14 interceptions and now has to face a Pittsburgh defense which has racked up the second-most takeaways (23). As for Aaron Rodgers, he's coming off a season-high of 284 passing yards and also rushed for his first score since 2022 in last week's win over Baltimore. He faced the Dolphins twice last year while with the Jets, and the four-time MVP totaled five passing touchdowns and averaged 306.5 yards through the air. See which team to back at SportsLine. How to make Steelers vs. Dolphins           picksFor Dolphins vs. Steelers on 'Monday Night Football,' the model is leaning Over the total, projecting 45 combined points. It also says one side of the spread has all of the value. See what it is at SportsLine.Who wins Steelers vs. Dolphins, and which side of the spread has all of the value? Visit SportsLine now to see which side of the Dolphins vs. Steelers spread you need to jump, all from the model that is 50-35 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers vs. Dolphins prediction, odds: 'Monday Night Football' picks today from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/13/42b76484-b9c7-4cca-949a-90547ef2e040/thumbnail/1200x675/6065226995a0c806240503903bf08e12/tua-tagovailoa-miami-dolphins-imagn-images.jpg"
      ],
      "datePublished": "2025-12-14T18:19:08.000Z",
      "dateModified": "2025-12-14T18:19:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants not altering game plan for Jaxson Dart after another injury scare - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/new-york-giants-jaxson-dart-injury-scare/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/f34376b0-444e-4459-94e8-b5ea9e014202/thumbnail/1200x675/d61cc2837e17ce4883a7818764fb46af/gettyimages-2251906892-2.jpg",
    "tag": "Sports",
    "date": "2025-12-14T23:26:09.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants got a scare in the fourth quar",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants got a scare in the fourth quarter when Jaxson Dart exited the game after taking a hit from two Washington Commanders defenders. Dart was able to return a few plays later, but it prompted more questions about how the Giants and interim coach Mike Kafka are protecting their franchise quarterback.On a first-and-goal play, Dart tried to run for a touchdown when he was met by Javon Kinlaw and Eddie Goldman, who make up a combined 639 pounds of defensive lineman. Dart left the field and took the well-trodden path to the blue injury tent.\nFortunately for the Giants, Dart was able to return for the fourth-down play, but the rookie quarterback has taken too many hits like that throughout the season. In November, Dart missed two games due to a concussion. Despite that -- and today's scare -- Kafka said the team won't change much about its offensive game plan.   \"We're not gonna change much in terms of how we play the game,\" Kafka said. \"I think just having the thought process for how we scheme it up. We had a couple opportunities where he's protected and he's got somebody in front of him. On that one particular play where he got out, that was a pass. I think there's not much you can do there. Of course we have his health, and everyone's health, in mind when we call plays.\"\nKafka added that Dart's mobility is one of his \"great strengths, and there's no denying that. Dart ran six times for 63 yards against the Commanders. It's just a matter of Dart recognizing when to protect himself.\"He knows,\" Kafka said. \"He's a smart football player. He knows when he needs to protect himself and when he needs to go make a play. I trust him to do that. That's probably the most important thing. The guys on the field trust him to do that.\"\nThe 2-12 Giants have three games remaining, and the team has been out of playoff contention for a while now. (New York does, however, at the moment, still own the top pick in the 2026 NFL Draft.) Keeping Dart healthy down the stretch should be a priority for New York, but it sounds like the team won't be holding him back on the ground.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants not altering game plan for Jaxson Dart after another injury scare - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/f34376b0-444e-4459-94e8-b5ea9e014202/thumbnail/1200x675/d61cc2837e17ce4883a7818764fb46af/gettyimages-2251906892-2.jpg"
      ],
      "datePublished": "2025-12-14T23:26:09.000Z",
      "dateModified": "2025-12-14T23:26:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Vikings props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-cowboys-nfl-player-props-sgp-sunday-night-football-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/64774720-e41f-4be5-b6b8-7e5666b705b0/thumbnail/1200x675/ebf3e8d7e9d601649930e4e68fbbce44/dak-prescott-dallas-cowboys-3.jpg",
    "tag": "Sports",
    "date": "2025-12-14T23:49:27.000Z",
    "description": "\nThe Dallas Cowboys look to keep their NFC playoff hopes alive when they battle the Minnesota Vikings in Week 15 'Sunday Night Football' at 8:20 p.m. ",
    "body": "\nThe Dallas Cowboys look to keep their NFC playoff hopes alive when they battle the Minnesota Vikings in Week 15 'Sunday Night Football' at 8:20 p.m. ET from AT&T Stadium in Arlington, Texas. The Cowboys, who are second in the NFC East, trail the first-place Philadelphia Eagles by just 1.5 games with four remaining. They are 2.5 games out of the final Wild Card spot, held by the Chicago Bears. The game will feature quarterback J.J. McCarthy and the Vikings against quarterback Dak Prescott and the Cowboys. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which Dallas is favored by 5.5 points.Prescott has played at a high level all season, completing 69% of his passes for 3,637 yards and 26 touchdowns. McCarthy, meanwhile, has struggled at times. In seven games, he has completed 56% of his passes for 1,092 yards and nine touchdowns with 10 interceptions. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Justin Jefferson, Aaron Jones or T.J. Hockenson of the Vikings or Javonte Williams, CeeDee Lamb or George Pickens of the Cowboys. Before betting any Vikings vs. Cowboys props for Sunday Night Football, you need to see the Cowboys vs. Vikings prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Justin Jefferson anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Vikings vs. Cowboys NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Cowboys vs. Vikings prop picks. You can only see the Machine Learning Model player prop predictions for Vikings vs. Cowboys here.Top NFL player prop bets for Vikings vs. CowboysAfter analyzing the Vikings vs. Cowboys props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Cowboys quarterback Dak Prescott goes under 1.5 passing touchdowns (+170). Prescott is facing a defense coming off a shutout, and a game in which he threw for just one touchdown and two interceptions in a 44-30 loss at Detroit. He has thrown for one or fewer touchdowns in five games this season.Prescott is also going against the fourth-best passing defense in the league. The Vikings are giving up an average of 172.3 passing yards per game. Minnesota has the eighth-best defense overall. The SportsLine Machine Learning Model projects Prescott to have 1.2 touchdown passes and gives this prop a 4.5 out of 5-star prop rating. See more NFL props here. Bet Prescott to go Under 1.5 passing touchdowns at DraftKings:\nHow to make NFL player prop bets for Vikings vs. CowboysIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has five additional NFL props that are rated 4 stars or better. You need to see the Machine Learning Model analysis before making any Vikings vs. Cowboys prop bets for Sunday Night Football.Which Cowboys vs. Vikings prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Vikings vs. Cowboys props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Vikings props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/64774720-e41f-4be5-b6b8-7e5666b705b0/thumbnail/1200x675/ebf3e8d7e9d601649930e4e68fbbce44/dak-prescott-dallas-cowboys-3.jpg"
      ],
      "datePublished": "2025-12-14T23:49:27.000Z",
      "dateModified": "2025-12-14T23:49:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers fear Micah Parsons tore ACL vs. Broncos, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/green-bay-packers-micah-parsons-injury-update/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/bc889fef-9177-46a7-b74a-d3feb399f122/thumbnail/1200x675/6f7b7517e9ed6c610dd81e324aca80ff/par.jpg",
    "tag": "Sports",
    "date": "2025-12-15T01:00:37.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers may have to finish out the 2",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers may have to finish out the 2025 season without their most important defensive player, as the team believes pass rusher Micah Parsons suffered a torn ACL during their Week 15 loss to the Denver Broncos, accoridng to multiple news outlets. Further testing is required to confirm the initial diagnosis. On a first-and-10 in the third quarter, Parsons fought his way to Broncos quarterback Bo Nix, but planted awkwardly with his left leg. He immediately went down holding his knee. Check out what happened here:\nParsons remained on the turf for several moments as he was attended to by trainers. Players from both teams took knees around the star pass rusher -- who was eventually able to get up and walk to the locker room with the medical staff. \nEntering Sunday, Parsons had recorded 39 tackles, 12.5 sacks, 26 QB hits and a forced fumble this season. He became the first player since sacks became an official stat in 1982 to begin a career with five seasons of at least 12 sacks.The Packers of course acquired Parsons from the Dallas Cowboys this offseason in exchange for defensive tackle Kenny Clark and two first-round picks. Once the trade was official, Green Bay gave Parsons the contract extension he was seeking -- a four-year, $188 million deal. \nParsons was regarded by the franchise as an X factor for a potential Super Bowl run, but now, Green Bay will have to move forward without its sack leader. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers fear Micah Parsons tore ACL vs. Broncos, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/bc889fef-9177-46a7-b74a-d3feb399f122/thumbnail/1200x675/6f7b7517e9ed6c610dd81e324aca80ff/par.jpg"
      ],
      "datePublished": "2025-12-15T01:00:37.000Z",
      "dateModified": "2025-12-15T01:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Urban Meyer reacts to Sherrone Moore saga: 'I said a prayer for that family' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/urban-meyer-reaction-sherrone-moore-michigan/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/a81bc722-eaf7-4d2b-89f0-7550a6b2bac5/thumbnail/1200x675/f27b3537f684a67bddbbb2fb57b3dce5/urban.png",
    "tag": "Sports",
    "date": "2025-12-14T19:19:21.000Z",
    "description": "\n        Former Ohio State coach and multiple national champion Urban Meyer is sympathizing with the family of Sherrone Moore following his firing thi",
    "body": "\n        Former Ohio State coach and multiple national champion Urban Meyer is sympathizing with the family of Sherrone Moore following his firing this week at Michigan, stemming from an inappropriate relationship with a staff member. Meyer says the conversation is independent of football after Moore was arrested and charged with felony home invasion and stalking after the ordeal.\"Last night, I said a prayer for that family. I mean, you've got three little girls,\" Meyer said on this week's The Triple Option Podcast. \"You've got a guy that was on top of the world a week ago. They're up 6-0 on the Buckeyes at home. And then, also, you wake up, and they're in this situation. Rivalries aside, this is all human element. \"Now, this is something that, from what you read, that's some serious stuff that went on. And just, all of a sudden, you start seeing the impact. Forget football. Who cares about football?''Moore, a 39-year-old married father of three, was terminated for cause following a university investigation that signaled a clear violation of policy. Michigan likely will be off the hook for nearly all of Moore's $14 million buyout since he was fired for cause.\nMeyer went 83–9 in nearly seven full seasons at Ohio State and was unbeaten against Michigan before stepping down in 2018. In 2021, he served as coach of the Jacksonville Jaguars for only 13 games before he was fired during a tumultuous season, that included missing a plane ride home after a road game, locker room issues and a former player accusing Meyer of kicking him during warmups. Meyer denied the incident, but the team fired him later that same day.Michigan finished 8-5 in Moore's debut season last fall before improving to 9-3 this year. The Wolverines had a chance to be in the final College Football Playoff discussion during rivalry weekend prior to a loss to the Buckeyes. Moore served a two-game suspension to start this season for his involvement in the sign-stealing scandal centered around Connor Stalions during the Jim Harbaugh era.\nAs it stands, Michigan is preparing for a Citrus Bowl appearance against Texas under interim coach Biff Poggi. Moore's last call with media prior to his firing was a call with reporters surrounding the Wolverines' postseason matchup and how many players were considering skipping the contest. Moore would not answer a question concerning NIL contract language involving certain Michigan players being incentivized to play in the game. He also said Michigan wouldn't know how many of its draft-eligible players would opt-out of the matchup in Orlando, but expected \"a lot more playing than not playing.\"\"We just really want guys that want to play in the game,\" Moore said. \"You don't want to have to promote people based on [if] they get rev share to play in the game. You want guys that just want to play football.\" \nJust under 72 hours later, Moore was fired and soon after detained by the Saline (Mich.) Police Department and turned over to police in Pittsfield Township prior to charges being filed. In the aftermath of Moore's firing, Michigan is now looking inward and the university's board of regents authorized a law firm to expand its investigation into the athletic department.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Urban Meyer reacts to Sherrone Moore saga: 'I said a prayer for that family' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/a81bc722-eaf7-4d2b-89f0-7550a6b2bac5/thumbnail/1200x675/f27b3537f684a67bddbbb2fb57b3dce5/urban.png"
      ],
      "datePublished": "2025-12-14T19:19:21.000Z",
      "dateModified": "2025-12-14T19:19:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 15 injuries for bettors to know include Jayden Daniels, Geno Smith - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-week-15-injury-report-jayden-daniels-christian-mccaffrey-geno-smith-more-injuries-for-bettors-to-know/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/9ba602fb-8eab-4ec3-be43-adfc80417a80/thumbnail/1200x675/f9c3e1e60c2462860b5a7e4bbbd35eae/jayden-daniels.jpg",
    "tag": "Sports",
    "date": "2025-12-14T20:23:17.000Z",
    "description": "\nWe've reached Week 15 of the 2025 NFL season, and while some teams aim to make late-season pushes into the postseason, others are keeping one eye on ",
    "body": "\nWe've reached Week 15 of the 2025 NFL season, and while some teams aim to make late-season pushes into the postseason, others are keeping one eye on the upcoming NFL Draft and the other on their roster to see which players should and shouldn't return. Making things more complicated at this stage of the year is injuries, and there are quite a few notable ones for bettors to know for Week 15. Here's a breakdown of the most important injuries of Week 15, as well as what NFL betting lines look like per the latest DraftKings Sportsbook odds. We will update this post with inactives lists for every team prior to kickoff. All times Eastern.Ravens at Bengals (1 p.m. ET)CIN WR Tee Higgins (concussion, out)\nStar Cincinnati receiver Tee Higgins is out this week with his second concussion of 2025, both of which have occurred over the last month. The Ravens need a win to try and keep pace with Pittsburgh for the division lead after dropping two games in a row to fall to 6-7.The Ravens are 2.5-point favorites, while the total is very high at 51.5.Raiders at Eagles (1 p.m. ET)LV QB Geno Smith (right shoulder and back, out)PHI OT Lane Johnson (foot, out)\nKenny Pickett will be under center for the Raiders against his old team,as the former first-round pick will start in place of the injured Geno Smith, who's dealing with shoulder and back injuries. The Eagles will again be without star tackle Lane Johnson, which is bad news against Maxx Crosby. Vegas is a 12.5-point underdog here, with the total at just 38.5.Cardinals at Texans (1 p.m. ET)AZ WR Marvin Harrison Jr. (heel, out)HOU RB Nick Chubb (ribs, out)\nMarvin Harrison Jr. headlines another lengthy injury list for the Cardinals, who have lost five in a row and are just 3-10 on the year. The Texans are on the opposite end of the spectrum, having won five in a row, but they are without veteran running back Nick Chubb against a lackluster Arizona defense.Houston is a 9.5-point favorite, and the total sits at 42.5.Chargers at Chiefs (1 p.m. ET)LAC WR Quentin Johnston (groin, out)KC WR Hollywood Brown (personal, out)KC OL Trey Smith and Jawaan Taylor (out)\nThe Chargers aren't the only AFC West team with issues on the offensive line, as two Kansas City starters are out for this matchup on Sunday. The Chiefs will also be without veteran receiver Hollywood Brown in this must-win matchup, while the Chargers will be without receiver Quentin Johnston as he's dealing with a groin issue.Kansas City is a 6-point favorite, and the total is 40.5.Bills at Patriots (1 p.m. ET)No major injuries of note\nArguably the game of the week sees the Bills visit the Patriots in an AFC East clash. New England has won 10 in a row after a 1-2 start and is aiming to spoil the Bills' bid to win the division for the sixth year in a row. Buffalo is favored by 1.5, and the total is 49.5.Jets at Jaguars (1 p.m. ET)NYJ QB Tyrod Taylor (groin, out)NYJ QB Justin Fields (knee, out)NYJ TE Mason Taylor (neck, out)\nA weird season for the Jets will be made even weirder this weekend with undrafted rookie Brady Cook starting at quarterback with both Tyrod Taylor and Justin Fields out. Cook completed 14 of his 30 attempts last week in relief of an injured Taylor, and he won't have reliable tight end Mason Taylor to throw to in this matchup with the AFC South-leading Jaguars.Jacksonville is favored by 13.5. The total is 41.5.Commanders at Giants (1 p.m. ET)WASH QB Jayden Daniels (left elbow, out) WASH WR Deebo Samuel (illness, available)WASH RB Chris Rodriguez (groin, out)\nThe Commanders' offense is beat up with Jayden Daniels ruled out after returning last week only to get knocked out once again. Marcus Mariota will start, and he'll have Deebo Samuel to throw to as the veteran receiver is good to go. Washington won't have Chris Rodriguez Jr. in its running back rotation as he's out with a groin injury.The Giants are 2.5-point favorites, and the total is 46.5.Browns at Bears (1 p.m. ET)CLE TE David Njoku (knee, out)CLE RB Dylan Sampson (calf and hand, out)CLE CB Denzel Ward (calf, out)CHI WR Rome Odunze (foot, out)\nCleveland will be down two weapons on offense with veteran tight end David Njoku and rookie running back Dylan Sampson both ruled out. Top cornerback Denzel Ward is also out for the Browns' elite defense. For Chicago, the Bears are still without receiver Rome Odunze.Chicago is favored by 7.5, and the total is 38.5.Panthers at Saints (4:25 p.m. ET)NO RB Alvin Kamara (knee and ankle, out)\nThe main injury here is that the Saints will be without top running back Alvin Kamara once again. The veteran is out with knee and ankle injuries in this divisional clash with the Panthers, who can take first place in the NFC South with a win thanks to Tampa Bay's loss on Thursday.Carolina is a 2.5-point favorite, and the total is 40.5.Lions at Rams (4:25 p.m. ET)DET S Brian Branch and Kerby Joseph (out)LAR WR Davante Adams (hamstring, available)\nThis massive NFC clash sees the Lions again dealing with major injuries on defense, and that's especially true in the secondary as both of the team's starting safeties are out. The Rams expected Davante Adams to play, and he's officially been listed as active for the game.The Rams are 6-point favorites while the total is the highest of the Week 15 slate at 54.5.Colts at Seahawks (4:25 p.m. ET)IND QB Riley Leonard (knee, will be active)IND CB Sauce Gardner (calf, out)\nThe big story here is who will start at quarterback for the Colts. Daniel Jones tore his Achilles last week and is out for the year, so Indianapolis signed Philip Rivers, who last played in 2020, to the practice squad. Rookie Riley Leonard played in place of Jones last week and also suffered an injury, but he'll be active in Seattle. Whether he starts is another question altogether. Defensively, the Colts will be down star cornerback Sauce Gardner against the Seahawks' high-flying offense.The Seahawks are 13.5-point favorites, and the total is 42.5.Packers at Broncos (4:25 p.m. ET)GB RB Josh Jacobs (knee, available)\nThe Packers and Broncos square off in what very well could be a Super Bowl preview on Sunday, and Green Bay is going to have its top running back on the field as Josh Jacobs is good to go.Denver is a 2.5-point favorite at home. The total is 42.5.Titans at 49ers (4:25 p.m. ET)SF RB Christian McCaffrey (back, available)\nStar 49ers running back Christian McCaffrey was added to the injury report on Saturday with a back injury ahead of Sunday's matchup with Tennessee. However, he was expected to play and has indeed been listed as active for the game.San Francisco is favored by 12.5 while the total sits at 44.5.Vikings at Cowboys (8:20 p.m. ET)DAL TE Jake Ferguson (calf, questionable)\nIt looks like Dallas' offense will be at full strength, which wasn't a certainty entering the week. Star receiver CeeDee Lamb cleared concussion protocol and will suit up this week, while tight end Jake Ferguson is expecting to play on Sunday despite being listed as questionable.Dallas is favored by 5.5 points. The total is 48.5.Dolphins at Steelers (8:15 p.m. ET, Monday)PITT LB T.J. Watt (lung, out)\nStar Pittsburgh edge rusher T.J. Watt won't suit up this week after he suffered a collapsed lung that required surgery after a dry needling treatment. It's unclear if or when Watt will return this season for the AFC North-leading Steelers.The Steelers are 3-point favorites at home. The total is 42.5. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 15 injuries for bettors to know include Jayden Daniels, Geno Smith - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/9ba602fb-8eab-4ec3-be43-adfc80417a80/thumbnail/1200x675/f9c3e1e60c2462860b5a7e4bbbd35eae/jayden-daniels.jpg"
      ],
      "datePublished": "2025-12-14T20:23:17.000Z",
      "dateModified": "2025-12-14T20:23:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 NFL playoff picture, standings: Chiefs eliminated, Mahomes injured Week 15 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-playoff-picture-standings-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/f92f29cb-f1b0-497c-b880-f57492a90163/thumbnail/1200x675/10ad0eb9812b47a7f74a1515bc6da1c3/patrick-mahomes.jpg",
    "tag": "Sports",
    "date": "2025-12-14T22:22:34.000Z",
    "description": "\n        Coming into it, Week 15 had the potential to be the defining weekend in the NFL and, so far, it's living up to the hype. There were several p",
    "body": "\n        Coming into it, Week 15 had the potential to be the defining weekend in the NFL and, so far, it's living up to the hype. There were several playoff scenarios at play this weekend, and the overall picture is starting to crystallize. One thing that is not wrapped up, however, is the AFC East crown. The New England Patriots had an opportunity to secure the division on Sunday with a win, but the Buffalo Bills rallied from a 21-point deficit to keep those hopes of winning the AFC East alive for at least another week. Meanwhile, the Cincinnati Bengals are officially eliminated from the playoffs after the Baltimore Ravens secured a key AFC North win to keep their playoff pursuit going. Maybe the most significant development, however, came at Arrowhead Stadium where the Kansas City Chiefs have been officially eliminated from playoff contention. Moreover, Patrick Mahomes left the contest late in the fourth quarter due to a left knee injury. Beyond those heavyweight matchups from the early window, there is still plenty of action to go. That includes the Lions (8-5) traveling west to face the NFC's top seed, the Rams (10-3), in another Jared Goff-Matthew Stafford revenge game. Meanwhile, 44-year-old Philip Rivers is set to make his first start in 1,800 days for the Colts, marking the longest layoff by a quarterback over 40 before starting an NFL game, as Indianapolis takes on the Seahawks (10-3).\nWith an epic Week 15 slate unfolding before our eyes, now is the perfect time to take a live look at the playoff picture. Below, we'll break down who's currently in and out of the postseason through the early afternoon, and will update as Sunday progresses.  AFC standingsDenver Broncos (11-2)New England Patriots (11-3)Jacksonville Jaguars (10-4)Pittsburgh Steelers (7-6)Los Angeles Chargers (10-4)Buffalo Bills (10-4)Houston Texans (9-5)\n                            \n    \n                                                \n                    \n    1. Denver Broncos (11-2)Remaining schedule: vs. Packers, vs. Jaguars, at Chiefs, vs. ChargersAfter winning their 10th straight game last week, the Broncos are back atop the AFC as the No. 1 seed. They currently have the edge over New England thanks to a superior conference record (7-2 vs. 6-3).While the conversation is currently about whether or not the Broncos can secure the No. 1 seed, it shouldn't be overlooked that they have a solid cushion in the AFC West and are primed to win it for the first time since 2015. \n\n                            \n    \n                                                \n                    \n    2. New England Patriots (11-3)Remaining schedule: at Ravens, at Jets, vs. DolphinsThe Patriots had an opportunity to clinch the AFC East with a win over Buffalo on Sunday, but blew a 21-point lead in Week 15 to snap their winning streak. New England remains in first place in the division, but the Bills are lurking. Beyond Buffalo, this loss currently doesn't help the Patriots in their pursuit of Denver for the No. 1 seed. \n                            \n    \n                                                \n                    \n    3. Jacksonville Jaguars (10-4)Remaining schedule: at Broncos, at Colts, vs. TitansThe Jaguars have now won five straight games following a blowout victory against the New York Jets. That helps keep them in first place in the AFC South over the surging Houston Texans.  \n\n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (7-6)Remaining schedule: vs. Dolphins, at Lions, at Browns, vs. RavensPittsburgh is back in first place in the AFC North after defeating the Ravens; however, there's still a lot to be determined in this division. Baltimore just took down the Cincinnati Bengals, so a lot will be riding on the Steelers' matchup against the Miami Dolphins on Monday night, especially with another head-to-head matchup with Baltimore still on deck in Week 18. \n                            \n    \n                                                \n                    \n    5. Los Angeles Chargers (10-4)Remaining schedule: at Cowboys, vs. Texans, at BroncosThe Chargers notched their 10th win of the season and eliminated the Kansas City Chiefs from playoff contention on Sunday with a nail-biting win at Arrowhead. That victory not only keeps them as the No. 1 wild card team, but they are still within range of Denver in the AFC West. \n                            \n    \n                                                \n                    \n    6. Buffalo Bills (10-4)Remaining schedule: at Browns, vs. Eagles, vs. JetsIt cannot be overstated how important Buffalo's comeback win over the Patriots was. After erasing another double-digit deficit, the Bills are still alive in the AFC East race, meaning there is still a line to a higher seed and a home playoff game.\n\n                            \n    \n                                                \n                    \n    7. Houston Texans (9-5)Remaining schedule: vs. Raiders, at Chargers, vs. ColtsAfter starting the year 0-3, the Texans have clawed back into the playoff picture as the No. 7 seed and are coming off an impressive win over the Cardinals at home. They've now won six straight and are on the heels of the Jaguars in the AFC South, so there is room for this climb to go even higher.In the huntThe Colts (8-5) are mathematically still in the hunt, but have a difficult road forward with Daniel Jones out for the season and Philip Rivers set to start against Seattle. The team that may have the best chance of this group to make the postseason is the Ravens (7-7), especially after shutting out the Bengals to move back to .500 on the year. That has them right behind the Steelers (who play on Monday) in the AFC North with one more head-to-head still to go in the regular-season finale.\nSurprisingly, the Dolphins (6-7) are still lurking on the outskirts after winning four straight games, but a lot needs to go right. On top of likely needing to win out, Miami would need some wild card contenders to collapse, as it currently loses head-to-head tiebreakers to the Colts, Chargers and Ravens. \n        \n            \n                Predicting the entire 2025 NFL playoff bracket and Super Bowl winner as we enter Week 15\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nNFC standingsLos Angeles Rams (10-3)Green Bay Packers (9-3-1)Philadelphia Eagles (9-5)Carolina Panthers (7-6)Seattle Seahawks (10-3)Chicago Bears (10-4)San Francisco 49ers (9-4)\n                            \n    \n                                                \n                    \n    1. Los Angeles Rams (10-3)Remaining schedule: vs. Lions, at Seahawks, at Falcons, vs. CardinalsThe Rams bounced back nicely after their upset loss to the Panthers in Week 13 by blowing out the Cardinals, 45-17. Matthew Stafford looked more like his MVP self as well, throwing for three touchdowns. That win helped push them atop the NFC as the No. 1 seed, but they'll need to finish strong to hold onto this spot. Specifically, these next two weeks against Detroit and then at Seattle will give us further clarity on where L.A. will ultimately end up.\n\n                            \n    \n                                                \n                    \n    2. Green Bay Packers (9-3-1)Remaining schedule: at Broncos, at Bears, vs. Ravens, at VikingsGreen Bay is back atop the NFC North after taking down the Bears at home. The Packers offense came through in the clutch, particularly some hard running by Josh Jacobs late. While the Packers may have recaptured the top spot in the division, things are still very much up in the air in the NFC North, especially if they fall to the Broncos in Denver on Sunday before taking on the Bears again in Week 16.  \n                            \n    \n                                                \n                    \n    3. Philadelphia Eagles (9-5)Remaining schedule: at Commanders, at Bills, vs. CommandersPhiladelphia snapped a three-game losing streak on Sunday with a blowout win against the Raiders. Jalen Hurts bounced back nicely with three passing touchdowns, and the victory helps the Eagles hold firm atop the NFC East. \n\n                            \n    \n                                                \n                    \n    4. Carolina Panthers (7-6)Remaining schedule: at Saints, vs. Buccaneers, vs. Seahawks, at BuccaneersThe Panthers moved into sole possession of first place in the NFC South for the first time all season after the Buccaneers' 29-28 upset loss to the Falcons on \"Thursday Night Football\" kicked off Week 15.Carolina has won six of its past nine games and comes out of its Week 14 bye recharged for the stretch run. The Panthers currently hold a slim, half-game edge, but the division remains very much up for grabs with two head-to-head matchups against Tampa Bay still to come.\n                            \n    \n                                                \n                    \n    5. Seattle Seahawks (10-3)Remaining schedule: vs. Colts, vs. Rams, at Panthers, at 49ersSeattle is in a pretty comfortable position coming out of Week 14. The Seahawks are just one of two teams in the entire conference with double-digit wins. However, the problem is that the only other team with 10 wins is the Rams, who beat them out at the moment due to the head-to-head tiebreaker. \nThat said, they still have one more game against L.A. in Seattle, and have a healthy position as a wild card entry if they cannot unseat them for the NFC West crown. They also catch a break in Week 15, facing an Indianapolis Colts team that just lost Daniel Jones (Achilles) for the year. \n                            \n    \n                                                \n                    \n    6. Chicago Bears (10-4)Remaining schedule: vs. Packers, at 49ers, vs. LionsThe Bears have notched double-digit wins on the season after soundly taking down the Cleveland Browns at Soldier Field. That helps them not only stay in the wild card race, but they are also still in play for the NFC North crown with a pivotal matchup against the Packers on deck in Week 16. \n                            \n    \n                                                \n                    \n    7. San Francisco 49ers (9-4)Remaining schedule: vs. Titans, at Colts, vs. Bears, vs. SeahawksThe Niners were on the bye in Week 14, so they'll be well-rested for the final four games. Out of the gate, it's pretty favorable for San Francisco, hosting a 2-11 Titans team before visiting the Colts, who will be without Jones. That creates a strong path to securing a wild card spot, but there is room for this team to go even higher if the pieces fall into place. \nThe 49ers split the head-to-head series with the Rams and currently have a better division record, so they'd leapfrog them if they find themselves with the same record. Meanwhile, the club also owns the head-to-head tiebreaker over Seattle thanks to a Week 1 win before they square off in the regular-season finale. So, there is a path for the 49ers to win the NFC West and possibly end up as the No. 1 seed. In the huntThe Lions (8-5) picked up a key win over the Cowboys in Week 14, vaulting them into the No. 8 seed. Detroit's high-octane offense gives it a real chance to push back into the playoff picture, though the challenge ramps up this week with a road trip to face the Rams.Tampa Bay (7-7), meanwhile, is doing its best to hand the NFC South to Carolina. The Buccaneers have lost five of six games since their Week 9 bye, including a stunning 29-28 loss to the already eliminated Falcons on in Week 15, when they blew a 28-14 fourth-quarter lead. The silver lining: Tampa Bay still controls much of its fate, with two games against the Panthers among its final three, giving it a direct path to reclaim the division lead.The Cowboys (6-6-1) took what could be a critical blow with their loss to Detroit. Dallas now likely needs to win out -- and get considerable help -- to sneak into the postseason, either through the NFC East or as a wild card.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 NFL playoff picture, standings: Chiefs eliminated, Mahomes injured Week 15 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/f92f29cb-f1b0-497c-b880-f57492a90163/thumbnail/1200x675/10ad0eb9812b47a7f74a1515bc6da1c3/patrick-mahomes.jpg"
      ],
      "datePublished": "2025-12-14T22:22:34.000Z",
      "dateModified": "2025-12-14T22:22:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]