[
  {
    "title": "NFL picks for Week 18, score predictions, best bets from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-18-picks-ai-score-predictions-spreads-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/22/59bd56af-7f52-4932-ad43-a216e5ca48be/thumbnail/1200x675/c63b392b59c6075e261a72fd6b780ea1/puka-nacua-imagn-lar.jpg",
    "tag": "Sports",
    "date": "2026-01-01T14:54:35.000Z",
    "description": "\nThe NFL Week 18 schedule features two games on Saturday and 14 on Sunday, including a 'Sunday Night Football' matchup between the Baltimore Ravens an",
    "body": "\nThe NFL Week 18 schedule features two games on Saturday and 14 on Sunday, including a 'Sunday Night Football' matchup between the Baltimore Ravens and Pittsburgh Steelers. The AFC North title and a playoff spot will be on the line when Derrick Henry and the Ravens battle Aaron Rodgers and the Pittsburgh Steelers. The NFC South championship will also be on the line when the Carolina Panthers take on the Tampa Bay Buccaneers on Saturday afternoon. The Ravens are favored by 3.5 points at DraftKings Sportsbook, while the Seahawks are 1.5-point favorites.Sunday's largest spreads include Titans vs. Jaguars (-12.5), Colts vs. Texans (-10.5) and Dolphins vs. Patriots (-10.5). Besides the Seahawks vs. 49ers, the smallest spreads in Week 18 include Saints vs. Falcons (-3.5), Lions vs. Bears (-3) on Sunday and Panthers vs. Buccaneers (-2.5) on Saturday. Seattle, San Francisco and Denver all face scenarios where if they win, then they claim their respective conference's No. 1 overall seed. Before making any Week 18 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 18 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 16 games. You can only see the AI predictions for the Week 18 NFL schedule here.Top Week 18 NFL AI picksAfter analyzing every game in Week 18, the AI says the Rams (-7.5, 46.5), who have already clinched a postseason berth, cover comfortably against the Cardinals. \nThe Cardinals have gone over in five of their last eight games, while the over has hit in three of the last four head-to-head meetings. Bet the Over 47.5 in the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nLos Angeles has won seven of the last 10 meetings with Arizona and is expected to win comfortably once again. A win would be their third in a row over the Cardinals. Los Angeles earned a 45-17 win in the Dec. 7 meeting at Arizona. SportsLine AI rates the Steelers as a B spread pick and also predicts a 31-20 win on average. See its other Week 18 football predictions and football picks at SportsLine, and bet the Rams at DraftKings here:\nHow to make Week 18 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 18. You need to see the AI's NFL picks before making any Week 18 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 18 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 18, score predictions, best bets from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/22/59bd56af-7f52-4932-ad43-a216e5ca48be/thumbnail/1200x675/c63b392b59c6075e261a72fd6b780ea1/puka-nacua-imagn-lar.jpg"
      ],
      "datePublished": "2026-01-01T14:54:35.000Z",
      "dateModified": "2026-01-01T14:54:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets today: This Week 18 parlay returns nearly 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-18-nfl-picks-football-parlay-odds-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/7fb96e11-25af-4019-8970-79399057ff7d/thumbnail/1200x675/e6523eca9ec925f5bf13a3abda9869f6/zach-charbonnet.jpg",
    "tag": "Sports",
    "date": "2026-01-01T15:24:06.000Z",
    "description": "\nThe NFL playoff picture will finalize after the NFL Week 18 schedule. The top seeds in both the AFC and NFC are still at stake, as is who is going to",
    "body": "\nThe NFL playoff picture will finalize after the NFL Week 18 schedule. The top seeds in both the AFC and NFC are still at stake, as is who is going to take the NFC South and AFC North title and the playoff spot that comes with it. The winner of the Seattle vs. San Francisco game will get the top seed in the NFC, while Denver is one win away from being the top seed in the AFC. If the Broncos falter against the Los Angeles Chargers, New England can take top honors with a win over Miami.    There are a number of important matchups on the Week 18 NFL schedule, including two on Saturday with Panthers vs. Buccaneers (-2.5) and Seahawks vs. 49ers (+1.5). The rest of the slate is Sunday, including Colts vs. Texans (-10.5), Packers vs. Vikings (-6.5), Lions vs. Bears (-3), Chargers vs. Broncos (-12.5), Dolphins vs. Patriots (-10.5) and Commanders vs. Eagles (-6). The Ravens (-3.5) face the Steelers on 'Sunday Night Football' in Pittsburgh with the AFC North on the line. Lamar Jackson (back) returned to practice on Wednesday after sitting out last week's game.Before locking in any Week 18 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 18 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of over 25-1. You can only see the model's Week 18 NFL picks at SportsLine.Top Week 18 NFL picksAfter simulating every game 10,000 times, the model is high on the Seattle Seahawks (-1.5, 49.5) to cover against the San Francisco 49ers on Saturday night. Bet our Seahawks vs. 49ers SGP at DraftKings below, and see our 25-1 Week 18 NFL parlay at SportsLine.\nThe Seahawks are led by quarterback Sam Darnold. In 16 games this season, he has completed 67.2% of his passes for 3,850 yards and 25 touchdowns with 14 interceptions and a 99.2 rating. He has also rushed 29 times for 86 yards (3.0 average). In Sunday's 27-10 win over the Carolina Panthers, he completed 18 of 27 passes for 147 yards and one touchdown.The model has Seattle winning outright well over 50% of the time and covering in nearly 60% of simulations in an A-rated spread pick. See which other NFL parlay picks to make here.How to make Week 18 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 18 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 18 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 18 NFL best bets from a model on a 53-37 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets today: This Week 18 parlay returns nearly 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/7fb96e11-25af-4019-8970-79399057ff7d/thumbnail/1200x675/e6523eca9ec925f5bf13a3abda9869f6/zach-charbonnet.jpg"
      ],
      "datePublished": "2026-01-01T15:24:06.000Z",
      "dateModified": "2026-01-01T15:24:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Alabama vs. Indiana, Georgia vs. Ole Miss in CFP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-to-get-200-bonus-bets-alabama-indiana-georgia-ole-miss-cfp/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-01T14:56:41.000Z",
    "description": "\n        Sports bettors can ring in 2026 with a College Football Playoff tripleheader, including two of the nation's biggest programs in action in the",
    "body": "\n        Sports bettors can ring in 2026 with a College Football Playoff tripleheader, including two of the nation's biggest programs in action in the final two games of the day. The Alabama Crimson Tide take on the Indiana Hoosiers at 4 p.m. ET in the Rose Bowl, followed by the Georgia Bulldogs vs. Ole Miss Rebels in the Sugar Bowl at 8 p.m. ET in a pair of CFP quarterfinal games, and the current DraftKings promo code gives new users $200 in bonus bets if your first $5 bet wins. Despite Alabama being a three-loss team and going against undefeated Indiana, the SportsLine advanced computer model is backing the Crimson Tide as 7-point underdogs as one of its Thursday best bets at DraftKings Sportsbook. The model also has a Thursday best bet from the NBA, backing the Dallas Mavericks to upset the Philadelphia 76ers as +114 underdogs at DraftKings. One of SportsLine's top experts also has a pick on Georgia vs. Ole Miss. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 11 of the 2025-26 NBA season on a sizzling 32-14 roll on top-rated NBA spread picks dating back to last season, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Thursday best bets at DraftKings SportsbookAlabama (+7) vs. IndianaMavericks (+114) to defeat the 76ersGeorgia (-6.5) vs. Ole MissCombining the model's three picks into a Thursday parlay at DraftKings would result in a payout of +693 (risk $100 to win $693). Bet it at DraftKings here:\nAlabama (+7) vs. Indiana (-108)It's difficult to imagine Alabama as a full touchdown underdog against Indiana based on name recognition, but the Hoosiers have earned their No. 1 seed with an undefeated, Big Ten championship season, including a 13-10 victory over Ohio State in the conference final. However, despite Alabama suffering three losses this year, the Crimson Tide still have one of the most talented rosters from top to bottom in the nation, and as reminded once again on Wednesday in Miami's upset over Ohio State, the CFP is an entirely new season from what happened over the past few months. Junior quarterback Ty Simpson has proven ready to take over as the Alabama starter, throwing for 3,500 yards and 28 touchdowns compared to five interceptions this season. The Crimson Tide play in their ninth CFP over the last 12 years, as the program is used to this environment, which can't hurt on Thursday. The model projects Alabama to cover in 63% of simulations. Back Alabama at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Mavericks (+114) to defeat the 76ersThe Mavericks enter on a three-game losing streak, however, those all results came on the road, and they return to Dallas on Thursday. The Mavericks defeated the Nuggets, 131-130, as 6.5-point underdogs on Dec. 23 in their most recent home game, and they have won five straight in Dallas. The Mavericks were underdogs in four of those home games as well, so they have thrived in similar situations to Thursday as of late. Mavericks center Anthony Davis has missed the last two games, but he's off the injury report for Thursday. The 10-time All-Star is averaging 20.5 points and 10.9 rebounds per game this season, with rookie Cooper Flagg adding 19.4 ppg. The 76ers are 1-3 over their last four games, with their one win coming in a 139-136 overtime contest against the Grizzlies. The model projects the Mavericks to win in 62% of simulations, despite being plus-money underdogs. Back the Mavericks at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Georgia (-6.5) vs. Ole Miss (-108)\"Georgia had eight full possessions in the first meeting and scored points on all eight of them,\" SportsLine expert Tom Fornelli said. \"Ole Miss' defense has been its biggest weakness all year, and will prove to be again here, only this time the offense won't be able to keep up as long.\" Back the Bulldogs at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more College Football Playoff picks and NBA picks on Thursday?You've seen some of the model's Thursday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Alabama vs. Indiana, Georgia vs. Ole Miss in CFP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-01T14:56:41.000Z",
      "dateModified": "2026-01-01T14:56:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon vs. Texas Tech prediction, odds, line: 2026 Orange Bowl and CFP quarterfinal picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oregon-texas-tech-prediction-odds-time-2026-orange-bowl-college-football-playoff-quarterfinal-picks-cfp-best-bets-spreads/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/85590731-a20a-40e1-914a-4a6674ed57a8/thumbnail/1200x675/9c922de757b46b57782ff9ca78ed4201/jacob-rodriguez.png",
    "tag": "Sports",
    "date": "2026-01-01T15:20:58.000Z",
    "description": "\n        The fifth-ranked Oregon Ducks take on the fourth-ranked Texas Tech Red Raiders in a College Football Playoff quarterfinal matchup at the Oran",
    "body": "\n        The fifth-ranked Oregon Ducks take on the fourth-ranked Texas Tech Red Raiders in a College Football Playoff quarterfinal matchup at the Orange Bowl on Thursday. Oregon defeated James Madison 51-34 on Dec. 20 in a CFP first-round matchup, while Texas Tech defeated BYU 34-7 in the Big 12 Championship Game on Dec. 6. The Ducks (12-1), who finished third in the Big Ten, have won seven in a row and are 2-1 against ranked opponents. The Red Raiders (12-1), who tied for first in the Big 12, have won six consecutive games and are 3-0 against ranked foes.Kickoff from Hard Rock Stadium in Miami Gardens, Fla., is at noon ET. Oregon leads the all-time series 3-0, including a 38-30 win in 2023. The Ducks are 2.5-point favorites in the latest Oregon vs. Texas Tech odds, while the over/under for total points scored is 50.5 via SportsLine consensus. Oregon is at -129 on the money line (risk $129 to win $100). Before making any Texas Tech vs. Oregon picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Oregon vs. Texas Tech. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Texas Tech vs. Oregon:Oregon vs. Texas Tech                                                                                                                                                                                     spreadOregon -2.5 at DraftKings SportsbookOregon vs. Texas Tech                                                                                                                                                                                 over/under50.5 pointsOregon vs. Texas Tech                                                                                                                                                                                                                                                                                                 money line Oregon -129, Texas Tech +110Oregon vs. Texas Tech                                                                                                                                                                                                                                                                                         picksSee picks at SportsLineOregon vs. Texas Tech                                                                                                                                                                                                                                                                                           streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. Why Oregon can coverSophomore quarterback Dante Moore is a big reason for the Ducks' success. In 13 games, he has completed 72.4% of his passes for 3,046 yards and 28 touchdowns with just eight interceptions and a 170.1 rating. He also has rushed 58 times for 196 yards (3.4 average) and two touchdowns. In the win over James Madison, he completed 19 of 27 passes for 313 yards and four touchdowns with two interceptions. He also rushed for a five-yard touchdown.Among his top receivers is senior wide receiver Malik Benson. In 13 games, he has 36 receptions for 645 yards (17.9 average) and six touchdowns. In the win over James Madison, he caught five passes for 119 yards (23.8 average) and two touchdowns. He had five catches for 102 yards and one touchdown in a 26-14 win at Washington on Nov. 29. See which team to back at SportsLine.Why Texas Tech can cover Senior quarterback Behren Morton leads the Red Raiders' offense. In 11 games this season, he has completed 67% of his passes for 2,643 yards and 22 touchdowns with four interceptions. He has thrown seven touchdowns with no interceptions over the past four games. In the win over BYU, he completed 20 of 33 passes for 215 yards and two touchdowns.Powering the Texas Tech ground attack is sophomore running back Cameron Dickey. In 13 games, he has carried 198 times for 1,095 yards and 14 touchdowns. He also has caught 24 passes for 216 yards (9.0 average) and two touchdowns. In a 29-7 win over BYU on Nov. 8, he carried 23 times for 121 yards (5.3 average) and one touchdown. See which team to back at SportsLine.How to make Oregon vs. Texas Tech picksSportsLine's model is going Over on the total, projecting 58 combined points. It also says one side of the spread hits in nearly 60% of simulations. You can see the model's pick at SportsLine.So who wins Oregon vs. Texas Tech, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the Oregon vs. Texas Tech spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon vs. Texas Tech prediction, odds, line: 2026 Orange Bowl and CFP quarterfinal picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/85590731-a20a-40e1-914a-4a6674ed57a8/thumbnail/1200x675/9c922de757b46b57782ff9ca78ed4201/jacob-rodriguez.png"
      ],
      "datePublished": "2026-01-01T15:20:58.000Z",
      "dateModified": "2026-01-01T15:20:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, picks, predictions, best bets today: This Thursday parlay returns well over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-thursday-january-1-basketball-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/16690827-61c8-4f5d-9ea8-206c917cde61/thumbnail/1200x675/246bba8b216627939dac66500604b141/james-harden-clippers.jpg",
    "tag": "Sports",
    "date": "2026-01-01T15:12:12.000Z",
    "description": "\n        A five-game NBA schedule highlights New Year's Day's 2025-26 NBA slate. Among the notable NBA odds include Rockets (-11.5) vs. Nets, Heat vs.",
    "body": "\n        A five-game NBA schedule highlights New Year's Day's 2025-26 NBA slate. Among the notable NBA odds include Rockets (-11.5) vs. Nets, Heat vs. Pistons (-5.5), 76ers (-2.5) vs. Mavericks, Celtics (-9.5) vs. Kings and Jazz vs. Clippers (-12.5). The Los Angeles Clippers will look to extend their winning streak to six games, while Dallas looks to snap a three-game losing skid.      What are the NBA best bets for New Year's Day, and which combination of picks should you target in a New Year's Day NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 11 of the 2025-26 NBA season on a sizzling 32-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of well over +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $250 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Thursday, Jan. 1After simulating every game 10,000 times, the model is backing the Clippers (-12.5) to cover the spread against the Utah Jazz in Los Angeles at 10:30 p.m. ET. The Clippers have won four of the last five meetings with the Jazz, although Utah posted a 129-108 win in their last meeting on Oct. 22. Utah is 5-5 against the spread in their last 10 games, while Los Angeles is 7-3 ATS in its last 10. The Clippers have also won each of the last three games against the Jazz played in Los Angeles.The Jazz will be without Georges Niang (foot), Ace Bailey (hip) and Jusuf Nurkic (foot), while the Clippers will be missing Bogdan Bogdanovic (hamstring) and Ivica Zubac (ankle). The Jazz (15-18) are fifth in the Northwest Division, trailing first-place Oklahoma City by 16 games, and have lost six of the past 10 games. The Clippers (11-21), who are fourth in the Pacific, are 5-5 in their last 10 games.The model is projecting four Jazz players to score 11.4 or more points, led by Lauri Markkanen, who is projected to score 24.1 points. The model also says five Clippers players will score 10.3 points or more, led by Kawhi Leonard's 28.7 points. The model is also projecting that this game will be decided by double digits as Los Angeles covers in nearly 70% of simulations. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Thursday, Jan. 1The model also has locked in two more picks, including another bet that hits well over 60% of the time. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Thursday, and which best bets should you target for a chance at a payout of well over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, picks, predictions, best bets today: This Thursday parlay returns well over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/16690827-61c8-4f5d-9ea8-206c917cde61/thumbnail/1200x675/246bba8b216627939dac66500604b141/james-harden-clippers.jpg"
      ],
      "datePublished": "2026-01-01T15:12:12.000Z",
      "dateModified": "2026-01-01T15:12:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Dynasty TE Rankings and Tiers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/2026-dynasty-fantasy-football-tight-end-rankings-and-tiers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/ca5221af-715d-4847-a028-80272fd7a656/thumbnail/1200x675/78bb257f84fac3455c965b22c3f28472/untitled-design-2025-11-04t114241-752.png",
    "tag": "Sports",
    "date": "2026-01-01T15:26:55.000Z",
    "description": "\n        Happy New Year! While redraft managers are entering into the quiet time of year, one of my favorite things about Dynasty Fantasy Football is ",
    "body": "\n        Happy New Year! While redraft managers are entering into the quiet time of year, one of my favorite things about Dynasty Fantasy Football is that there is no offseason. We are rapidly moving into 2026 NFL Draft prospect analysis and will soon start delivering our prospect profiles to get you ready for your rookie drafts. But first, it's time to update my Dynasty rankings at each position, and in this first installment of 2026, I am also including a look at my top three tiers at each position. At the tight end position, it has been a year of transition. Travis Kelce may be saying goodbye, David Njoku battled injuries and got replaced, and George Kittle turned 32 and missed six games due to injury. Thankfully, we had an elite rookie class to fill the void.Tier 1Brock Bowers, TE, RaidersTrey McBride, TE, CardinalsTier 1 is the same as it was a year ago, and in the same order. I would understand if you put McBride ahead of Bowers after this past season. I haven't because I think there is significant risk that McBride takes at least a small step backwards next year, and mostly because Bowers played hurt on the worst offense in football this year. Hopefully, the Raiders do some significant work to improve that side of the ball in the offseason. Having the No. 1 pick sure would help. Tier 2Colston Loveland, TE, BearsHarold Fannin Jr., TE, BrownsTyler Warren, TE, ColtsTucker Kraft, TE, PackersSam LaPorta, TE, LionsOronde Gadsden II, TE, ChargersKyle Pitts, TE, Falcons\nThis is a mega tier, and honestly, it is probably a bit too big. The three rookies at the top definitely belong in the same tier, and the four guys below them are not far behind. Pitts is the wild card in this group and probably deserves a tier of his own. Pitts set a career high in catches and touchdowns this year, just turned 25 years old, and is a free agent. His landing spot could go a long way towards determining whether he belongs in this tier.On the most recent episode of FFT Dynasty, I had Dan Schneier on to offer his takes on what we saw in 2025 and what it means for 2026. We talked Jaxson Dart, Marvin Harrison Jr., Harold Fannin, and more. Check it out:Tier 3AJ Barner, TE, SeahawksIsaiah Likely, TE, RavensMason Taylor, TE, JetsDalton Kincaid, TE, BillsTerrance Ferguson, TE, RamsTheo Johnson, TE, GiantsGeorge Kittle, TE, 49ersThis tier is such a mixed bag that I am not sure you can summarize it in a paragraph. What I am sure of is that people will think I have Kittle way too low, but injuries aren't the only reasons he's slotted here. Outside of touchdowns, his efficiency fell off a cliff in 2025, and he averaged a career low in yards per catch and YAC/reception. He's still awesome, but Father Time is undefeated, and he may have landed his first punches in 2025.\nHere is the first edition of my 2026 Dynasty TE rankings:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Dynasty TE Rankings and Tiers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/ca5221af-715d-4847-a028-80272fd7a656/thumbnail/1200x675/78bb257f84fac3455c965b22c3f28472/untitled-design-2025-11-04t114241-752.png"
      ],
      "datePublished": "2026-01-01T15:26:55.000Z",
      "dateModified": "2026-01-01T15:26:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Dynasty RB Rankings and Tiers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/2026-dynasty-fantasy-football-wide-receiver-rankings-and-tiers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/84d7af25-a79a-41b8-831e-a78a203fd1e2/thumbnail/1200x675/4064c15b9354d0c4f5bbbadf36a9b661/imagn-jaxon-smith-njigba-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-01-01T15:26:09.000Z",
    "description": "\n        Happy New Year! While redraft managers are entering into the quiet time of year, one of my favorite things about Dynasty Fantasy Football is ",
    "body": "\n        Happy New Year! While redraft managers are entering into the quiet time of year, one of my favorite things about Dynasty Fantasy Football is that there is no offseason. We are rapidly moving into 2026 NFL Draft prospect analysis and will soon start delivering our prospect profiles to get you ready for your rookie drafts. But first, it's time to update my Dynasty rankings at each position, and in this first installment of 2026, I am also including a look at my top three tiers at each position. At the wide receiver position, the top three tiers include my top 10 wide receivers, who will all be 27 years old or younger to start the 2026 season. While this was a difficult season at the position in Fantasy Football, the future still looks very bright.Tier 1Ja'Marr Chase, WR, BengalsJaxon Smith-Njigba, WR, SeahawksPuka Nacua, WR, RamsChase is the mainstay in this tier. He has been my WR1 in these rankings since Week 5 of the 2024 season. He has been top three in these rankings since October of 2021. And he doesn't even turn 26 years old until March 1st. That being said, Smith-Njigba is two years younger and outscored Chase this year, so it would not be that surprising if Chase's reign at the top ends soon.Tier 2Amon-Ra St. Brown, WR, LionsMalik Nabers, WR, GiantsCeeDee Lamb, WR, CowboysJustin Jefferson, WR, Vikings\nLamb and Jefferson have long been a part of that top tier with Chase. But they are the oldest wide receivers in my top 10, and they are both coming off down years. For Lamb, it will be very important to see whether the team is able to hold on to George Pickens. Pickens is a problem for Lamb's touchdown upside and the biggest target threat he has played with. Jefferson just needs better quarterback play and a better connection with his quarterback. Hopefully, they figure that out this offseason, because if Jefferson's 2026 looks like his 2025, then he won't be in the top 12 much longer.On the most recent episode of FFT Dynasty, I had Dan Schneier on to offer his takes on what we saw in 2025 and what it means for 2026. We talked Jaxson Dart, Marvin Harrison Jr., Harold Fannin, and more. Check it out:Tier 3Drake London, WR, FalconsRashee Rice, WR, ChiefsNico Collins, WR, TexansThis is the most interesting tier to me, because all three of these guys could go either direction. London flashed the top five upside we all believed he had for about six weeks in the middle of the 2025 season. But once again, the Falcons will enter 2026 with QB questions that could derail London's ascent to stardom. Rice was once again remarkable in another small sample size. In his last 17 games, including the playoffs, Rice has 114 catches for 1,307 yards and 8 TDs. But that has come across three seasons in a very unique role, and his QB may not be ready for Week 1. Collins is enormously talented, but coming off a down year with some young target competition emerging in the second half. Any of these guys could be in Tier 2 or Tier 4 by September.\nHere is the first edition of my 2026 Dynasty WR rankings:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Dynasty RB Rankings and Tiers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/84d7af25-a79a-41b8-831e-a78a203fd1e2/thumbnail/1200x675/4064c15b9354d0c4f5bbbadf36a9b661/imagn-jaxon-smith-njigba-seahawks.jpg"
      ],
      "datePublished": "2026-01-01T15:26:09.000Z",
      "dateModified": "2026-01-01T15:26:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 18 odds, lines, spreads, predictions: Picks from 10,000 computer simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-18-nfl-odds-lines-spread-picks-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/16/0b101dfd-09a8-4bfe-a1f0-e309237fc15e/thumbnail/1200x675/7b4f5d2de971e72d3e54749b85e529c6/jakobi-meyers.jpg",
    "tag": "Sports",
    "date": "2026-01-01T15:06:52.000Z",
    "description": "\nAll of your Week 18 NFL picks will come on divisional contests as the league moved to this scheduling format a few years ago. Many of these matchups ",
    "body": "\nAll of your Week 18 NFL picks will come on divisional contests as the league moved to this scheduling format a few years ago. Many of these matchups carry meaning for playoff seeding such as Panthers vs. Buccaneers (-2.5) and Seahawks vs. 49ers (+1.5) on Saturday, plus Broncos vs. Chargers (+12.5) and Ravens vs. Steelers (+3.5) on Sunday. Then there are games to make Week 18 NFL predictions on where one team is fighting for seeding while the other has already been eliminated from postseason contention. Some of these include Texans vs. Colts (+10.5) and Patriots vs. Dolphins (+10.5).Motivation and incentive shouldn't be overlooked with your NFL best bets and when scouring the latest Week 18 NFL odds. The largest of the NFL spreads has Jacksonville as 12.5-point favorites over the Titans as the Jags could still land the No. 2 seed in the AFC. Meanwhile, one of the slimmest lines has the Bears favored by 3 points over Detroit as Chicago can clinch the No. 2 seed with a win. All of the updated Week 18 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 18 NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 18 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Week 18 NFL predictionsWe can tell you one of the model's strongest Week 18 NFL picks is that the Packers (+6.5, 36.5) cover at Minnesota on Sunday at 1 p.m. ET. Green Bay is locked into the No. 7 seed and could rest its starters, including a banged-up Jordan Love, but it should still have enough to stay within a touchdown versus an imbalanced Vikings team. Minnesota had 3 passing yards in its Christmas win over Detroit, which is the fewest by any team in a win in 19 years. The Vikings rank 29th in total offense, 30th in turnover differential and dead last in giveaways. Also, since Matt LaFleur became coach in 2019, Green Bay owns the NFL's third best spread record (19-10) as a road underdog. The model has Green Bay prevailing versus the spread nearly 70% of the time. See which other teams to pick here, and bet the Packers using the DraftKings promo code, which offers $200 in bonus bets if your bet wins right here:\nAnother one of its Week 18 NFL predictions: the Jaguars (-12.5, 47.5) cover versus the Titans in over 50% of simulations in a Sunday kickoff at 1 p.m. ET. The Jags have won seven straight, can wrap up the division with a Week 18 win, and have a shot at the AFC's No. 1 seed if they get some help. So, motivation won't be a question for Jacksonville, which is 6-1 straight up and 5-2 ATS over its last seven matchups versus Tennessee. The Jaguars also boast the league's best home spread record (6-1) in 2025, while the Titans are one of two teams to rank in the bottom five in both scoring offense and scoring defense. SportsLine's model predicts Jacksonville to cover, as well as the over hitting 60% of the time. See which other teams to pick here, and bet the Jags to cover at DraftKings:\nHow to make Week 18 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 18 NFL schedule and just revealed six teams projected to win by double-digits, potentially giving you a huge payday by playing the alternate lines. You can only get every pick for every game at SportsLine.So what Week 18 NFL picks can you make with confidence, and which six picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 18 NFL betting odds, lines, live spreads, scoresGet Week 18 NFL picks at SportsLineGameSpreadTotalPicksPanthers at Buccaneers (Saturday)TB -2.544SEE  PICKS HERESeahawks at 49ers (Saturday)SEA -1.549.5SEE  PICKS HERESaints at FalconsATL -3.543.5SEE  PICKS HEREColts at TexansHOU -10.539.5SEE  PICKS HEREBrowns at BengalsCIN -7.544.5SEE  PICKS HERETitans at JaguarsJAX -12.547.5SEE  PICKS HEREPackers at VikingsMIN -6.536.5SEE  PICKS HERECowboys at GiantsDAL -3.551.5SEE  PICKS HEREJets at BillsBUF -738SEE  PICKS HERELions at BearsCHI -350.5SEE  PICKS HEREChargers at BroncosDEN -12.537.5SEE  PICKS HEREChiefs at RaidersKC -5.536.5SEE  PICKS HERECardinals at RamsLAR -7.546.5SEE  PICKS HEREDolphins at PatriotsNE -10.545.5SEE  PICKS HERECommanders at EaglesPHI -741SEE  PICKS HERERavens at SteelersBAL -3.541SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 18 odds, lines, spreads, predictions: Picks from 10,000 computer simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/16/0b101dfd-09a8-4bfe-a1f0-e309237fc15e/thumbnail/1200x675/7b4f5d2de971e72d3e54749b85e529c6/jakobi-meyers.jpg"
      ],
      "datePublished": "2026-01-01T15:06:52.000Z",
      "dateModified": "2026-01-01T15:06:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Week 18: Optimal daily Fantasy lineups for Saturday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-week-18-saturday-buccaneers-panthers-49ers-seahawks-daily-fantasy-football-lineups-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/18/badc4bf4-b425-414b-bd2e-77bcc0a17446/thumbnail/1200x675/3c0eecfa99ebb30e9cd9b41bb59d4b68/mike-evans.jpg",
    "tag": "Sports",
    "date": "2026-01-01T15:16:16.000Z",
    "description": "\nWith most season-long Fantasy leagues now complete, daily Fantasy football takes an even bigger spotlight during the Week 18 NFL schedule. The first ",
    "body": "\nWith most season-long Fantasy leagues now complete, daily Fantasy football takes an even bigger spotlight during the Week 18 NFL schedule. The first slate comes on Saturday as Panthers vs. Buccaneers (-2.5, 44) is a 4:30 p.m. ET and Seahawks vs. 49ers (+1.5, 49.5) is at 8 p.m. ET. Both games carry heavy implications for the NFL playoff picture, so you don't have to worry about starters resting or teams holding back on this slate. With big names like Christian McCaffrey, Jaxon Smith-Njigba, Rico Dowdle and Bucky Irving in the NFL DFS player pool, how should you craft your NFL DFS lineups? Before making any Saturday NFL DFS picks, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure.You can also bet props like McCaffrey as anytime TD scorer (-185) using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Monday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Week 18 SaturdayOne of McClure's top NFL DFS picks for Saturday is Smith-Njigba. The third-year pro has made the leap into the elite tier of receivers this season as he ranks in the top 10 in every major receiving category, including leading the league with 1,709 receiving yards. He's been targeted a whopping 25 times combined over the past two weeks, so defensive adjustments have not impacted Seattle's desire to target him. The Niners have given up the 21st-most Fantasy points to opposing wide receivers. See who else to roster at SportsLine.You can also bet on Smith-Njigba to go Over 101.5 receiving yards (-112) at DraftKings:\nMcClure is also rostering Bucs receiver Mike Evans. He returned from a two-month absence due to a collarbone injury on Nov. 11, and he's been instantly a huge part of the offense. He's been targeted 28 times combined in his three games back, and he's scored two touchdowns in that span as well. Evans has a history of crushing the Panthers as he's scored eight times combined in their last six meetings. See more NFL DFS picks at SportsLine.Bet Evans to go Over 53.5 receiving yards (-114) at DraftKings:\nHow to set Week 18 Saturday NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on Saturday. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Saturday, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Week 18: Optimal daily Fantasy lineups for Saturday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/18/badc4bf4-b425-414b-bd2e-77bcc0a17446/thumbnail/1200x675/3c0eecfa99ebb30e9cd9b41bb59d4b68/mike-evans.jpg"
      ],
      "datePublished": "2026-01-01T15:16:16.000Z",
      "dateModified": "2026-01-01T15:16:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football bowl and 2025-26 CFP picks, predictions: Legendary Vegas expert reveals best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-playoff-quarterfinals-spread-picks-predictions-expert-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/c6dbb6f0-ea53-4f92-81a2-ca782d0542b7/thumbnail/1200x675/15716500072a4b41aea5b7fa9bc46232/usatsi-27595763.jpg",
    "tag": "Sports",
    "date": "2026-01-01T13:30:47.000Z",
    "description": "\n        The College Football Playoff quarterfinals are set to continue on New Year's Day with the remaining three matchups. Indiana (-7.5) is the big",
    "body": "\n        The College Football Playoff quarterfinals are set to continue on New Year's Day with the remaining three matchups. Indiana (-7.5) is the biggest favorite, per the latest college football odds, over Alabama, while the other contests are Oregon vs. Texas Tech (+2.5) and Ole Miss vs. Georgia (-6.5). The CFP semifinals will then take place next Thursday and Friday but not before there's another four bowl matchups you can make college football picks on in between.There are four standard bowl games on Friday, which includes No. 17 Arizona, which will be the last ranked team to take the field during the 2025-26 college football bowl season. The Wildcats are at -1.5 to utilize college football bets on as they face SMU in the Holiday Bowl on Friday at 8 p.m. ET. Before locking in any college football picks on those games or any others during bowl season, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 53-42 run on his official SportsLine college football picks as well. Anyone following could have seen strong returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for every bowl and CFP game and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football bowl predictionsOne of the top college football picks Marshall is recommending for the remaining 2025-26 bowl schedule: He is backing Navy (-7.5) to cover against Cincinnati in the Liberty Bowl on Jan. 2. The Bearcats have been decimated by opt outs and the transfer portal, with the most notable absence being coveted quarterback Brendan Sorsby, who is headed to the portal. Navy, which will have virtually its entire roster available, won three straight to close the regular season, while Cincinnati lost four straight entering this matchup.\"These two had met most recently as 2022, when Cincy won 20-10 but didn't cover (-18.5) when both were members of American, and before Bearcats moved to Big 12,\" Marshall told SportsLine. \"The Midshipmen have won last three and covered in last seven bowls -- all but one of those under Ken Niumatalolo before Brian Newberry beat Oklahoma last year.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:\nHow to make college football bowl and CFP picksMarshall has evaluated every other matchup, and he's backing a team on a massive 12-1 run against the spread. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles, and find out.2025-26 college football bowl oddsSee full college football bowl picks, odds, predictions here(odds subject to change)Thursday, Jan. 1CFP quarterfinal/Orange Bowl: Oregon vs. Texas Tech (+2.5, 51.5)CFP quarterfinal/Rose Bowl: Alabama vs. Indiana (-7, 47.5)CFP quarterfinal/Sugar Bowl: Ole Miss vs. Georgia (-6, 55.5)Friday, Jan. 2Armed Forces Bowl: Rice vs. Texas State (-14.5, 57.5)Liberty Bowl: Navy vs. Cincinnati (+7.5, 54.5)Holiday Bowl: Arizona vs. SMU (+2.5, 52.5)Duke's Mayo Bowl: Wake Forest vs. Mississippi State (-3, 53.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football bowl and 2025-26 CFP picks, predictions: Legendary Vegas expert reveals best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/c6dbb6f0-ea53-4f92-81a2-ca782d0542b7/thumbnail/1200x675/15716500072a4b41aea5b7fa9bc46232/usatsi-27595763.jpg"
      ],
      "datePublished": "2026-01-01T13:30:47.000Z",
      "dateModified": "2026-01-01T13:30:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL MVP odds: Drake Maye overtakes Matthew Stafford heading into Week 18 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-mvp-odds-can-matthew-stafford-make-up-ground-on-drake-maye-in-week-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/1d3c81bc-61fc-435f-994c-ebcd0f2f7ecd/thumbnail/1200x675/0fc2dc42ede2caee0bdb3fbb8e25fcfb/drake-mayee.jpg",
    "tag": "Sports",
    "date": "2026-01-01T12:30:38.000Z",
    "description": "\nThe New England Patriots and Los Angeles Rams have playoff implications in Week 18 of the 2025 NFL season but both franchises will also be looking to",
    "body": "\nThe New England Patriots and Los Angeles Rams have playoff implications in Week 18 of the 2025 NFL season but both franchises will also be looking to feature their respective quarterbacks, who are basically going head to head for the 2025 NFL MVP award. Second-year quarterback Drake Maye has been a major part of New England's resurgence, leading the Patriots to their first AFC East division title since 2019 with 4,203 yards, 30 touchdowns and just eight interceptions heading into the season finale. Maye also has just over 400 yards on the ground with four rushing scores. The Patriots can clinch the top seed in the AFC if they win and the Broncos lose to the Chargers.\nThe Rams were in the driver's seat for the No. 1 seed in the NFC but faltered over the last two weeks and will now be hitting the road. Matthew Stafford, who dealt with back issues in training camp and the preseason to the point where it was expected he would start the season on injured reserve, has played every game for L.A. so far. He's thrown for 4,448 yards, 42 touchdowns and just eight interceptions on the year. It's a new career high in touchdown passes for the veteran, who achieved 41 touchdowns in two previous seasons (2011 and 2021). L.A. will be either the No. 5 or No. 6 seed in the playoffs.\nThere are other contenders for NFL MVP at DraftKings, but Maye is the odds-on favorite after dominating the Jets in Week 17 (256 yards, five touchdowns) while Stafford had an off performance (269 yards, two touchdowns, three interceptions) in a loss to the Falcons on Monday Night Football. Here's a look at the latest NFL MVP odds at DraftKings and how bettors should approach the market.NFL MVP odds (via DraftKings)Drake Maye, Patriots: -295Matthew Stafford, Rams: +225Trevor Lawrence, Jaguars: +20000Caleb Williams, Bears: +25000Christian McCaffrey, 49ers: +30000Josh Allen, Bills: +30000Sam Darnold, Seahawks: +40000Bo Nix, Broncos: +40000C.J. Stroud, Texans: +50000Justin Herbert, Chargers: +50000Jaxon Smith-Njigba, Seahawks: +50000Jalen Hurts, Eagles: +50000Baker Mayfield, Buccaneers: +100000The last few weeks have taken a toll on Stafford's case, especially with Maye dominating. The Patriots have the narrative edge here, with Maye leading the franchise back to prominence after Tom Brady and Bill Belichick's departure. Stafford has the better overall numbers and could get some legacy votes due to his tenure. If Maye was a small-market quarterback, the oddsmakers might still lean towards Stafford. But we saw what happened last year with Josh Allen winning over Lamar Jackson even though the latter had superior stats. It's hard to bet on Stafford at this stage, especially since the Rams might not play him the entire game against Arizona in Week 18 since there's not much incentive for them regarding playoff seeding. Maye is likely to play until the game is in hand against Miami.One player who is surprisingly low on this board is McCaffrey, who has turned in one of his most dominant seasons ever. He's 110 yards away from becoming the only player to achieve a 1,000-yard rushing and receiving season in the same year twice. The 49ers have been hit with injuries all year but McCaffrey has kept them afloat and could potentially land them the No. 1 seed in the NFC. That's worth more than +30000, but this has largely become a quarterback award. McCaffrey is +250 to win OPOY and that's where I'd bet on him to be rewarded for his campaign.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL MVP odds: Drake Maye overtakes Matthew Stafford heading into Week 18 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/1d3c81bc-61fc-435f-994c-ebcd0f2f7ecd/thumbnail/1200x675/0fc2dc42ede2caee0bdb3fbb8e25fcfb/drake-mayee.jpg"
      ],
      "datePublished": "2026-01-01T12:30:38.000Z",
      "dateModified": "2026-01-01T12:30:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spurs star Victor Wembanyama hyperextendeds knee, but reportedly avoids major issue - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/victor-wembanyama-injury-spurs-knicks-awkward-landing/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/bb044ba7-08f0-4318-a09a-ecea5e79f08b/thumbnail/1200x675/79806510bbe451a3ea5dc305140527c7/untitled-design-2025-12-31t194721-289.png",
    "tag": "Sports",
    "date": "2026-01-01T13:09:12.000Z",
    "description": "\n        San Antonio Spurs star Victor Wembanyama left Wednesday's 134-132 win over the New York Knicks with a slight hyperextension in his left knee.",
    "body": "\n        San Antonio Spurs star Victor Wembanyama left Wednesday's 134-132 win over the New York Knicks with a slight hyperextension in his left knee. Initial tests came back negative and ruled out a major injury, according to ESPN.Webanyama jumped for a rebound and landed awkwardly with 10:32 left in the fourth quarter. His left foot moved forward as he approached the ground, which caused his knee to bend inward. He fell to the floor and grabbed his knee in pain, and after he returned to his feet, he limped off the court and into the locker room for examination.While he returned to the bench after a short stay in the locker room, the Spurs determined Wembanyama's night over after 24 minutes of action. He scored 31 points and racked up 13 rebounds before his premature exit.\"Have not been able to talk to the medical staff yet, but I saw what everybody else saw,\" Spurs coach Mitch Johnson said postgame. \"There's a visual there, but obviously he finished the game on the bench with his teammates, so that made me feel good. I have no idea what to say, but it was good to see him walk back out and be able to finish the game on the bench with his teammates.\"\nWembanyama said he expects to be back for the Spurs' next game, a Friday road contest versus the Indiana Pacers.\"Feeling good, just sore,\" Wembanyama said. \"I was 'this' close to coming back in the game. They had to hold me back.\"The Spurs trailed the Knicks, 102-96, when Wembanyama left the game but rallied to eliminate the deficit as part of a 71-point second half. Both teams entered the day in second place in their respective conferences, and the contest was a critical one as they remain locked in chases with the Oklahoma City Thunder and Detroit Pistons for the top spots.\nWembanyama, a reigning All-Star and former Rookie of the Year, has been instrumental in the Spurs' rise toward the top of the Western Conference this season. He averaged 24 points per game over the first 20 games of the year and is on pace to average a double-double for the third consecutive season to open his career. He has become an even more potent offensive weapon this season with a career-high 51.4% shooting clip.Wembanyama's injury is reminiscent of the one Nikola Jokić sustained on Monday. The Denver Nuggets superstar was diagnosed with a hyperextended knee -- which will sideline him for at least four weeks -- after he also had his leg bend awkwardly in the middle of game action.The Spurs already spent a month this season without Wembanyama due to a separate injury. The third-year star sustained a calf strain against the Golden State Warriors on Nov. 14 and did not return until Dec. 13 against the Oklahoma City Thunder. He eased back into the lineup, coming off the bench for six games before returning to the starting five on Dec. 27. Wednesday's contest was just his third start since the calf injury.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spurs star Victor Wembanyama hyperextendeds knee, but reportedly avoids major issue - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/bb044ba7-08f0-4318-a09a-ecea5e79f08b/thumbnail/1200x675/79806510bbe451a3ea5dc305140527c7/untitled-design-2025-12-31t194721-289.png"
      ],
      "datePublished": "2026-01-01T13:09:12.000Z",
      "dateModified": "2026-01-01T13:09:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL awards update, analysis: The race for the 2025 MVP isn't over yet - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-awards-update-analysis-the-race-for-the-2025-mvp-isnt-over-yet/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/95b03871-f7c6-43d8-8591-9a66553b53e4/thumbnail/1200x675/73febab7d234efd780a319af8c8c3e31/matthew-stafford-rams.jpg",
    "tag": "Sports",
    "date": "2026-01-01T13:58:50.000Z",
    "description": "\nThe NFL MVP Award usually is given to a quarterback, as players at that position have won it on 48 occasions since the AP began presenting the honor ",
    "body": "\nThe NFL MVP Award usually is given to a quarterback, as players at that position have won it on 48 occasions since the AP began presenting the honor in 1957 -- 30 times more than running backs. A signal-caller has taken the trophy home each of the last 12 years and 17 of the past 18, with Minnesota Vikings running back Adrian Peterson being the lone non-QB recipient over that span, back in 2012.There has been no shortage of candidates for MVP during the 2025 NFL season, although most of them fell out of contention at one point or another. Meanwhile, previous two-time winners Patrick Mahomes and Lamar Jackson never really garnered any consideration. The former did not perform at an elite level as his Kansas City Chiefs failed to reach the postseason for the first time in his nine-year career. The latter missed three of the Baltimore Ravens' games in October with a hamstring injury, played poorly numerous times upon his return and sat out in Week 17 with a back issue.Daniel Jones was an early frontrunner for MVP after guiding the Indianapolis Colts to eight wins in the first 10 games, but the team returned from its Week 11 bye and lost three straight, with the 28-year-old playing with a fractured leg in those contests before suffering a season-ending torn Achilles in the last one. The Colts' losing streak has reached six games in his absence and their playoff drought has climbed to five years.Dak Prescott enters Week 18 with a league-leading 4,482 passing yards and ranks third with 30 touchdown tosses, but the Dallas Cowboys didn't help his cause for MVP. They were 3-5-1 prior to their bye and followed a three-game winning streak with a three-game slide to slip out of the playoff picture. Baker Mayfield seemed like a strong contender as he had the Tampa Bay Buccaneers heading toward their fifth consecutive NFC South title with a 6-2 record. But like Indianapolis, the Buccaneers have been a different team since their bye as they have lost seven of their last eight contests. Tampa Bay still can capture the division crown but needs to defeat the first-place Carolina Panthers in their season finale and hope the Atlanta Falcons either tie or lose to the New Orleans Saints. However, Mayfield has no chance to seize the MVP trophy.Aaron Rodgers is the only player to win back-to-back MVPs since Peyton Manning repeated in 2009, doing so in 2020 and 2021 while with the Green Bay Packers. The 42-year-old Pittsburgh Steelers QB will maintain that distinction for at least one more year. While Josh Allen of the Buffalo Bills has shown glimpses of the form that earned him the award last season, he didn't perform at that level on a regular basis and the team's five-year reign atop the AFC East came to an end, although they did earn a wild card berth.Jared Goff is third in the NFL with 4,233 passing yards and second with 33 TD throws, but the Detroit Lions also faltered after their bye, losing six of nine and missing the playoffs. Bo Nix of the Denver Broncos, Seattle Seahawks QB Sam Darnold and Trevor Lawrence of the Jacksonville Jaguars enter Week 18 with an opportunity to help their teams finish with the No. 1 seed in their conferences, but their statistics -- while impressive -- aren't those expected of an MVP. And Caleb Williams improved greatly from his 2024 rookie season to help the Chicago Bears end their four-year playoff drought and capture their first NFC North title since 2018, but he likely won't receive any first-place votes.That leaves two true candidates to consider for the 2025 MVP honor. Matthew Stafford of the Los Angeles Rams has the numbers, as he tops the NFL with a career-high 42 touchdown passes and trails league leader Prescott in passing yards by only 34 with 4,448, which marks the 10th time he has eclipsed the 4,000-yard mark. However, the playoff-bound Rams have lost back-to-back games and three of their last five, ending their chances of repeating as NFC West champions. Will their late dropoff affect the AP's decision to reward the 37-year-old Stafford for his stellar production?The oddsmakers at DraftKings Sportsbook think so, as Stafford is the second favorite to win the MVP Award at +225. The favorite is Drake Maye, who is one of the reasons the New England Patriots have rebounded from back-to-back 4-13 seasons and and won their first AFC East title since 2019.Selected with the third overall pick in the 2024 NFL Draft, Maye showed signs of becoming another franchise quarterback for the Patriots as a rookie and has made believers of many this year. The 23-year-old is third in the league with 30 touchdown tosses -- exactly twice as many as he had in 13 games last season -- and fourth with 4,203 passing yards (2,276 in 2024).After New England lost two of its first three contests this campaign, Maye helped orchestrate a 10-game winning streak that catapulted the team to the top of the AFC East. The Patriots uncharacteristically squandered a 21-point lead against Buffalo in Week 15 and dropped a 35-31 decision, but Maye -- who ran for two TDs versus the Bills -- refused to allow them to have a letdown as he threw for a season-high 380 yards and two scores in a 28-24 triumph at Baltimore the following week and had five touchdown tosses in last Sunday's 42-10 rout of the hapless New York Jets.Thanks in large part to Maye's poise, confidence and natural ability, New England has a chance to obtain the No. 1 seed in the AFC this weekend as it needs to defeat the visiting Miami Dolphins and have the Broncos lose to the Los Angeles Chargers at home. Maye's attributes also helped make him a -295 favorite for the MVP Award at DraftKings. The only thing at stake for the Rams in Week 18 is their playoff seeding, and that could be determined a day before they even take the field Sunday against the woeful Arizona Cardinals, who are 3-13 and have lost eight in a row. If the San Francisco 49ers defeat the Seahawks on Saturday, the Rams would be the sixth seed in the NFC. But if Seattle wins, they climb up to No. 5 by beating Arizona.Rams head coach Sean McVay plans to play Stafford against the Cardinals regardless, but how long he keeps him in the game is unknown. Maye, who threw for two touchdowns and ran for another in New England's 33-27 triumph at Miami in Week 2, also is expected to be under center this Sunday, but he is unplayable for MVP at this price, so getting a plus-money return by taking Stafford and hoping he puts up big numbers against Arizona's 26th-ranked defense is the better option.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL awards update, analysis: The race for the 2025 MVP isn't over yet - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/95b03871-f7c6-43d8-8591-9a66553b53e4/thumbnail/1200x675/73febab7d234efd780a319af8c8c3e31/matthew-stafford-rams.jpg"
      ],
      "datePublished": "2026-01-01T13:58:50.000Z",
      "dateModified": "2026-01-01T13:58:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maresca out at Chelsea with immediate effect - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/enzo-maresca-leaves-chelsea-head-coach-departs-relationship-ownership-sours/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/f22d9d41-a236-4e76-afb0-efa79b4bb4e5/thumbnail/1200x675/0caa82861129f62350b8228bb40fccd6/untitled-design-2026-01-01t142808-703.png",
    "tag": "Sports",
    "date": "2026-01-01T13:43:07.000Z",
    "description": "\n        Enzo Maresca has left his position as Chelsea head coach with immediate effect as club and manager concluded that their increasingly embitter",
    "body": "\n        Enzo Maresca has left his position as Chelsea head coach with immediate effect as club and manager concluded that their increasingly embittered relationship could not continue.An on-field wobble has been a contributory factor in Maresca's departure, barely 18 months in the five year deal he signed in the summer of 2024, but it was the increasingly strained ties between the Italian and the rest of the club hierarchy which appear to have proven fatal. The now-former Chelsea manager's explosive comments after a 2-0 win over Everton, bemoaning the \"worst 48 hours\" since joining the club, brought about an extraordinary ratcheting up of tension at Stamford Bridge and the deterioration of relations between the ownership, sporting directors and the head coach.Maresca's comments, which proceeded links between him and a potential vacancy at Manchester City, proved to be unfortunately timed from his perspective. Chelsea have won just one of their last six Premier League games and sit 15 points behind leaders Arsenal, the second half of the season shaping up to be a battle for Champions League qualification. It was in that context that the club chose to frame the departure of a coach who won them two pieces of silverware in his first season in charge.\"During his time at the club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup,\" said Chelsea. \"Those achievements will remain an important part of the club's recent history, and we thank him for his contributions to the club. With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the Club believe a change gives the team the best chance of getting the season back on track. We wish Enzo well for the future.\"\nChelsea are expected to move quickly in pursuit of a replacement with Liam Rosenior of sister club Strasbourg a contender for the vacancy. They have not named an interim head coach ahead of Sunday's visit to Manchester City. Maresca's departure, perhaps at the end of the season, had been a growing possibility throughout a season in which the 45-year-old had not always bitten his tongue when discussing his employers. One of the first public fallouts of the year came when the head coach very publicly pushed for the signing of a new center back following a major injury to Levi Colwill, only for the hierarchy to block that wish over a fear that it would limit minutes for Josh Acheampong, who has struggled to feature regularly under Maresca.The discord that emerged in the aftermath of the Club World Cup has emerged on further occasions too, none more notable than his outburst after the win against Everton. It was subsequently suggested that Maresca had not taken kindly to feedback on his approach in a defeat to Atalanta while it has since been reported that there had been tension between the Italian and the medical department over the minutes load of some players.\nThough Maresca delivered the expected win of the Conference League, a top four finish in the Premier League and a Club World Cup triumph that was capped with a tactical masterclass against Paris Saint-Germain, Chelsea supporters did not entirely warm to the Italian. Indeed his room to maneuver only shrunk when he and his players were booed off at Stamford Bridge after Tuesday's 2-2 draw with Bournemouth, after which Maresca did not appear for his post-match press conference.Fan rancor is unlikely to ease with Maresca's departure, however. Both parties might be entitled to question the reconstruction of the squad that delivered a top-four finish last season and are now tracking for nine points fewer. Some of that is explained by injuries to Colwill and Cole Palmer. A bit more by a rash of red cards that may be down to the management of players, but may also be an inevitable function of one of the league's youngest teams.Plenty more might be down to the recruitment strategy spearheaded by controlling co-owner Behdad Eghbali and carried out by co-sporting directors Laurence Stewart and Paul Winstanley. Over his first two seasons at the club Nicolas Jackson had proven himself to be one of the Premier League's most promising young strikers, but was pushed out on loan to make room for Joao Pedro and Liam Delap, neither of whom have impressed. Estevao has lived up to the hype since arriving from Brazil, but it is not at all clear yet that Jamie Gittens and Alejandro Garnacho are upgrades on Noni Madueke and Jadon Sancho, whose loan Chelsea paid a penalty fee to not turn into a permanent move. Meanwhile it has proven hard for Maresca to find a reliable pairing of young center backs with Colwill sidelined.\nAs with many of his predecessors -- his successor will be the seventh coach to take charge of Chelsea since BlueCo bought the club in 2022 and the 25th change in manager since the year 2000 -- Maresca will leave Stamford Bridge feeling his long term employment prospects have not been greatly harmed. Tasked with restoring the club to the Champions League, the former Leicester City boss leaves having won the fourth most points in the Premier League since the start of last season and with comfortably the fourth best non-penalty expected goal difference. Victories over PSG, Liverpool and Barcelona pointed to his big game nous, though he struggled to deliver consistent results against the sort of opponents Chelsea were expected to beat.Once head of their elite development squad and a first team assistant, Maresca may well figure in Manchester City's considerations should Pep Guardiola leave in the summer though CBS Sports sources consider it far from a given that he would secure what would be one of the game's most highly coveted vacancies.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maresca out at Chelsea with immediate effect - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/f22d9d41-a236-4e76-afb0-efa79b4bb4e5/thumbnail/1200x675/0caa82861129f62350b8228bb40fccd6/untitled-design-2026-01-01t142808-703.png"
      ],
      "datePublished": "2026-01-01T13:43:07.000Z",
      "dateModified": "2026-01-01T13:43:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ole Miss staff leaning on NFL experience ahead of CFP rematch with Georgia - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-staff-drawing-on-nfl-experience-for-college-football-playoff-rematch-against-georgia/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/31/54d15be8-aa60-476e-942d-cdf948881338/thumbnail/1200x675/82b5da09f334900bf703103436271ee7/rj-sugar-bowl-1.jpg",
    "tag": "Sports",
    "date": "2026-01-01T14:52:02.000Z",
    "description": "\n        \r\nNEW ORLEANS -- The College Football Playoff Selection Committee has shown no hesitation in sending teams against the same opponent twice. A",
    "body": "\n        \r\nNEW ORLEANS -- The College Football Playoff Selection Committee has shown no hesitation in sending teams against the same opponent twice. According to research by the Tulsa World, there had been 105 rematches in the history of the sport since World War II before this year's CFP -- which has already featured two (Alabama vs. Oklahoma and Tulane vs. Ole Miss). After first-round results, the team that won the initial meeting is 9-28 in bowl or playoff rematches. Most rematches historically occur in conference championship games, which only began in 1992.\r\n\r\n\r\nIt's a dynamic Ole Miss quarterbacks coach Joe Judge knows well from his time in the NFL, where postseason meetings can result in teams facing each other three times in one year.\r\n\r\n\r\n\"It's actually a whole lot more fun,\" Judge said. \"The first time around. There's a large emphasis on Xs and Os schematics, systems and how they match up and all stuff. By the time you get the second time, personnel is the main focus. You have to look at the tape and say they're watching the same tape we are. Where do we struggle? What matchup do they have on us? What are they gonna try to expose again? How do we protect that? And then, also, where do we mismatch them? How do we really feature that matchup and find a way to get to it again, and then knowing they're gonna have a plan for it as well, you look situationally. What do you think they'll adjust within their game plan? Maybe some things you had left over from your game plan. How can you dress that up.\"\r\n\r\n\r\nThere is always a chess match at play -- the \"I know that you know that I know\" dynamic. The key for both sides will be avoiding the \"overthinking\" trap.\r\n\n\r\nOne significant personnel change favors Georgia. Bulldogs deep threat Colbie Young was injured on the third offensive play in the first meeting. He'll be healthy going into this game, which will force Ole Miss to defend differently. \r\n\r\n\r\nOther than that, these two teams' core identities are largely fixed. Any changes will likely be cosmetic, with occasional bursts of spontaneity.\r\n\r\n\r\nRest vs. rust\r\n\r\n\r\nGeorgia also faces the challenge of a long layoff. The Bulldogs last played Dec. 6 in the SEC championship game, resulting in 25 days between games. Ole Miss had a 22-day layoff before its opener against Tulane and knew for 15 days it would face the Green Wave at home in Oxford. \r\n\n\r\nGeorgia, meanwhile, arrives with the benefit of 11 additional days of on-site preparation. The rest-versus-rust debate remains complicated. Last season, all four teams that received first-round byes lost, though two of them -- Arizona State and Boise State -- were double-digit underdogs and not true top-four teams. Oregon famously lost 41-21 to Ohio State after beating the Buckeyes at home earlier in the year, while Georgia fell narrowly to Notre Dame in this same Sugar Bowl setting.\r\n\r\n\r\n\"I feel like [last year] there was a lot of relaxation at the start of prep, and that came in to bite us in the game, for sure,\" Georgia tight end Lawson Luckie said. \"So this year, I feel like there's been such an emphasis on not having those emotions of getting repetitive -- of getting bored with the prep coach always says. Like, don't get tired of doing the right thing.\"\r\n\r\n\r\nPlayoff layoffs are familiar territory for Georgia under Kirby Smart as a veteran of the four-team CFP format. The 12-team expansion brings the added complication of facing an opponent that played more recently and may be closer to game shape. Smart has consulted coaches in both college football and the NFL who have experience managing postseason layoffs. He declined to offer specifics but explained the challenge.\r\n\n\r\n\"You can run all you want, but you can't get in game shape until you play a football play,\" Smart said. \"Football consists of sprinting 10 to 15 yards, tackling somebody, getting up, going back to it, again. Repeat that, repeat that. Repeat that. You don't do that in layoffs. You don't go tackle live and hit people and risk injury, especially this time of year. So the fundamentals, blocking [and} tackling can deteriorate really quickly if you're just worried about being in shape. So we try to attack it all. \r\n\r\n\r\n\"We try to simulate things, make things happen. As coaches, you get really comfortable, and you don't, don't make decisions in critical moments, and next thing you know, you're out there in special teams, if something happens you haven't prepared for or in the season, you have a routine to follow. So there are things you try to simulate as best you can. But there's no sport where you have this long of layoff. Not basketball, not football, not baseball, where you go from playing once to 25-30 days playing again.\"\r\n\r\n\r\nSmart's point is underscored by a play in last year's Sugar Bowl loss to Notre Dame. The Irish ran their special teams unit off the field on a critical late fourth down and substituted the offense, catching Georgia off guard. A flustered Bulldogs defense jumped offsides, gifting Notre Dame a new set of downs and allowing more clock to bleed.\r\n\n\r\n\"That had everybody confused because we ain't never seen it before,\" Georgia linebacker and special teams player Raylan Wilson said. \"A lot of coaches do that now, like, because you see it on TV, or you see it on film, and they'll use it themselves. That was kind of crazy. That was a crazy feeling. I'm running on and off the field. I don't know if I'm supposed to be out there or on the sideline. I just came back on the sideline.\"\r\n\r\n\r\nIndicative of Georgia learning from its mistakes, the Bulldogs used a similar tactic against Mississippi State earlier this season. Taken together -- the rematch factor, extended layoffs and the win-or-go-home stakes of a bowl game that isn't a national title -- the Georgia-Ole Miss sequel represents a distinctly 2025 college football scenario.\r\n\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ole Miss staff leaning on NFL experience ahead of CFP rematch with Georgia - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/31/54d15be8-aa60-476e-942d-cdf948881338/thumbnail/1200x675/82b5da09f334900bf703103436271ee7/rj-sugar-bowl-1.jpg"
      ],
      "datePublished": "2026-01-01T14:52:02.000Z",
      "dateModified": "2026-01-01T14:52:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]