[
  {
    "title": "de la cruz second-half slump explained - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/elly-de-la-cruz-second-half-slump-time-to-reset-expectations-for-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/28/0b3559b8-0e73-4629-bda2-d42c2eb2f9ac/thumbnail/1200x675/fb84f73755a0dc5952518b4c2deab4b1/usatsi-27195133-elly-de-la-cruz-reds-ss-hr-2nd-2025-1920.jpg",
    "tag": "Sports",
    "date": "2025-11-21T00:53:13.000Z",
    "description": "\n        Elly De La Cruz has been a bit of a lightning rod in Fantasy Baseball over the years, but at the mid-way point of the 2025 season, it sure lo",
    "body": "\n        Elly De La Cruz has been a bit of a lightning rod in Fantasy Baseball over the years, but at the mid-way point of the 2025 season, it sure looked like the boosters and believers were right: This guy wasn't just one of the most exciting talents in baseball; he was one of the very best all-around players in the game.By the time the All-Star break rolled around, De La Cruz had taken a step forward in pretty much every way possible. He had played every game and was on pace for a monstrous season, hitting .284/.359/.495 with a 30-homer, 42-steal, 225 combined runs and RBI pace. He had cut his strikeout rate to a very manageable 24.3% rate and was the No. 5 player in Fantasy.De La Cruz kept right on hitting for the final 10 days of July, but things fell apart for him shortly after – he hit just .224 in August and was even worse in September, ultimately putting up just a .236/.303/.363 line in the second half. The strikeout rate jumped back up to 28.1% and he stopped impacting the ball with authority, with his xwOBA dropping to just .273 and cratering his overall numbers. Even the speed, which has always been there for De La Cruz, disappeared, as he ran at just a 30-steal pace. Because he was hurt. Of course, he was hurt.We heard whispers of De La Cruz playing through a \"nagging\" quad injury, but it wasn't until the past few days that the club finally confirmed the extent of the injury. Reds president of baseball operations Nick Krall was talking to the Cincinnati Reds Hot Stove League show Wednesday, where he was asked about De La Cruz's defensive regression in 2025, and Krall denied that the team was considering moving De La Cruz from shortstop and noted that De La Cruz's second-half struggles had a very simple explanation: \n\"Towards the end of July, he was dealing with a partially torn quad. And he has been rehabbing; he was at the ballpark today,\" Krall said. \"He's been rehabbing this whole offseason. To his credit, he played every day. He tried to grind through it. He tried to play through it.\"Krall tried to walk that quote back in an interview with the Cincinnati Enquirer the next day, noting that when he said \"partial tear on the radio,\" he meant \"strain\" and that it was \"more nagging than serious.\" A strain is, of course, a partial tear, and as RedLegNation.com notes, it's hard to make sense of a \"nagging\" injury that also still requires treatment a month and a half after the season and four months after the injury was initially suffered. De La Cruz is personally to be commended for his willingness to push through this injury, and with the Reds chasing a playoff spot, the team's decision to let him is understandable. But whether it is understandable or defensible isn't what I'm interested in here. \nWhat I'm interested in is the confirmation that De La Cruz's second-half slump wasn't just a slump. It wasn't just something that happens, a sign of the inherent volatility of his profile. It was also, very clearly, a result of him playing through an injury he probably should have taken time off. That has been my assumption since September, but getting that confirmation does make it much easier to figure out how to value De La Cruz in 2026. Am I saying we should just take his first half at face value and throw out the second half entirely? Kind of. De La Cruz was clearly starting to figure things out. You could see that with the much-improved plate discipline, overall swing decisions, and contact skills, which he was managing without sacrificing the high-end exit velocities he has always been known for. Yes, he was running less than in 2024, and I suspect the days of 60-plus steal upside from De La Cruz are probably gone – not because he isn't capable, but because it just doesn't make sense for the Reds to risk injury with their best player. \nBut hey, he was still on a 30-homer, 40-steal pace, something only Jose Ramirez actually managed in 2025. If De La Cruz can keep that strikeout rate on the right side of 25% like he was in that first half, a 40-homer season isn't out of the question as he continues to mature. Now that we have confirmation of the nature and extent of the injury in the second half, I'm much more willing to give De La Cruz a pass for his struggles. I'm expecting 30 homers and 40 steals in 2025, and probably a pretty good batting average, too. On a Reds offense that should continue to improve, that should also make 100-plus runs and 100-ish RBI a reasonable expectation, too. De La Cruz has slipped a tiny bit in early NFBC drafts to an 8.22 ADP, behind Ramirez, Juan Soto, Tarik Skubal, and Corbin Carroll; that's the right range for him, but I think I might take De La Cruz over all of them. If what he showed in the first half of last season was real, he deserves it. And, given his age and prodigious skill set, another step forward to the truly elite tier isn't out of the question. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "de la cruz second-half slump explained - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/28/0b3559b8-0e73-4629-bda2-d42c2eb2f9ac/thumbnail/1200x675/fb84f73755a0dc5952518b4c2deab4b1/usatsi-27195133-elly-de-la-cruz-reds-ss-hr-2nd-2025-1920.jpg"
      ],
      "datePublished": "2025-11-21T00:53:13.000Z",
      "dateModified": "2025-11-21T00:53:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A.J. Brown throws subtle shade at Saquon Barkley as Eagles' drama continues - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/aj-brown-eagles-off-field-drama-saquon-barkley/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/903648f0-3dd2-4903-81bf-0224616282d2/thumbnail/1200x675/e3c492d8e3926261d2c9f491fe9b056a/brownsaquon.jpg",
    "tag": "Sports",
    "date": "2025-11-21T00:32:05.000Z",
    "description": "\n        Despite being 8-2 and fresh off a Super Bowl win, there continues to be a lot of negativity surrounding the Philadelphia Eagles. At the foref",
    "body": "\n        Despite being 8-2 and fresh off a Super Bowl win, there continues to be a lot of negativity surrounding the Philadelphia Eagles. At the forefront of this negativity has been wideout A.J. Brown, the Eagles' talented yet disgruntled receiver who hasn't been shy about voicing his frustration with his and the offense's underwhelming production through 10 games. Brown threw more gas on the fire on Thursday when asked about speculation that he isn't the same player that he once was. \"I guess Saquon ain't the same player either, then,\" Brown said. \"I don't care about that.\"\nObviously, Brown putting the spotlight on Barkley's struggles this season is not a good look. It's yet another example of the missteps Brown has taken this season, both on and off the field. On the field, Brown has often appeared either frustrated, moody, dejected, disinterested, or a combination of all four. It's worth questioning if his negative body language has contributed to his and the Eagles' offensive struggles this season. Off the field, Brown has made headlines for the wrong reasons. His recent comments on a livestream reportedly led to him having a 10-minute conversation with Eagles owner Jeffrey Lurie. \nWhile he may not be going about it the best way, Brown's frustration is coming from a good place. He wants to have a larger role in the offense in an effort to help the unit realize its full potential. \nBrown may the figurehead of the current lack of brotherly love in Philadelphia, but he isn't alone. On Wednesday, for example, Eagles quarterback Jalen Hurts had to field questions stemming from a report that coaches and teammates have grown frustrated with him. \"I guess I get a lot of attention when things are going well and when things are not going so well,\" Hurts said. \"I never run away from holding myself accountable, and I think that's exactly what I've taken the approach of doing. I take great pride in what we do on offense. I take great pride in how we go out there and play as a team and what our flow is. I think we've got work to do, and that obviously starts with me. That's always my approach. That's always me looking internally first in everything that we do and then in due time rising above.\"\nWhile they may be the most dysfunctional Super Bowl caliber team since the 1995 Cowboys, the Eagles still have a lot of football ahead of them. And despite their dysfunction, Philadelphia is currently sitting at 8-2 and are running away with the NFC East title. Things may look bleak now, but winning cures a lot of things, especially a win against an arch rival. Fortunately for the Eagles, they have a chance to do just that in Dallas against the rival Cowboys on Sunday. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A.J. Brown throws subtle shade at Saquon Barkley as Eagles' drama continues - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/903648f0-3dd2-4903-81bf-0224616282d2/thumbnail/1200x675/e3c492d8e3926261d2c9f491fe9b056a/brownsaquon.jpg"
      ],
      "datePublished": "2025-11-21T00:32:05.000Z",
      "dateModified": "2025-11-21T00:32:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Thursday Night Football' prediction, odds: Bills vs. Texans picks from expert on 114-90 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-line-spread-texans-bills-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/933a98b8-3973-48e6-a50f-be14960bcaae/thumbnail/1200x675/d2e48aa697878b2000a77d32648655a8/shakir.jpg",
    "tag": "Sports",
    "date": "2025-11-21T00:14:31.000Z",
    "description": "\n        The Houston Texans eye their third consecutive win when they take on the Buffalo Bills in a key 'Thursday Night Football' matchup. Buffalo is",
    "body": "\n        The Houston Texans eye their third consecutive win when they take on the Buffalo Bills in a key 'Thursday Night Football' matchup. Buffalo is coming off a 44-32 win over the Tampa Bay Buccaneers, while Houston defeated the Tennessee Titans 16-13. The Bills (7-3), who are second in the AFC East, are 2-2 on the road this season. The Texans (5-5), who are third in the AFC South, are 3-2 on their home field. Houston quarterback C.J. Stroud (concussion) has been ruled out, paving the way for Davis Mills to make another start. Bills receiver Keon Coleman is inactive for the second straight week. Buffalo is 5-5 against the spread this season, while Houston is 4-6 versus the line.Kickoff from NRG Stadium in Houston is set for 8:15 p.m. ET. Houston leads the all-time series 7-5 and has won five straight home meetings. The Bills are 5-point favorites in the latest Bills vs. Texans odds, while the over/under for total points scored is 44.5. Buffalo is at -265 on the money line (risk $265 to win $100), while Houston is a +215 underdog (risk $100 to win $215). Before making any Bills vs. Texans picks, make sure to check out the Thursday Night Football predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the NFL. He is an outstanding 114-90-2 (+2078) on his last 206 NFL picks. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Bills vs. Texans and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Texans vs. Bills:Bills vs. Texans                 spreadBuffalo -5 at DraftKings SportsbookBills vs. Texans                       over/under44.5 pointsBills vs. Texans                       money line Buffalo -265, Houston +215Bills vs. Texans                   picksSee picks at SportsLineBills vs. Texans                       streaming Amazon PrimeWhy the Bills can winVeteran quarterback Josh Allen powers the Buffalo offense. In 10 games this season, Allen has completed 69.6% of his passes for 2,456 yards and 18 touchdowns with seven interceptions. He has also rushed 65 times for 351 yards (5.4 average) and 10 touchdowns. In Sunday's win at Tampa Bay, Allen completed 19 of 30 passes for 317 yards and three touchdowns with two interceptions. He also carried six times for 40 yards and three touchdowns.Running back James Cook III is closing in on his third consecutive 1,000-yard rushing season. In 10 games, he has carried 182 times for 968 yards (5.3 average) and seven touchdowns. He also has 21 receptions for 190 yards and one touchdown. He has had five 100-yard rushing games, including a 19-carry, 216-yard and two-touchdown performance in a 40-9 win at Carolina on Oct. 26. See which team to back at SportsLine. Why the Texans can winStroud could miss the game, paving the way for Davis Mills to get the start. In four games this season, Mills has completed 72 of 120 passes (60%) for 726 yards and three touchdowns with one interception. Mills has also rushed 10 times for 44 yards and one score. In Sunday's win over the Titans, he completed 26 of 41 passes (63.4%) for 274 yards and one touchdown.  Helping lead the Houston passing attack is fifth-year veteran Nico Collins. In nine games, he has 49 receptions for 642 yards (13.1 average) and four touchdowns. He has had one explosive play of 20 yards or more, including a long of 54, with 152 yards after the catch and 29 first-down conversions. In the win over Tennessee, he caught nine passes for 92 yards and one touchdown. Additionally, recent results overwhelmingly favor the Texans, who have won each of the last five meetings in Houston between the teams. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Bills vs. Texans  picksWhite has analyzed Bills vs. Texans from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Bills vs. Texans, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Bills vs. Texans spread you need to jump on, all from the expert that is 114-90-2 on his last 206 NFL picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Thursday Night Football' prediction, odds: Bills vs. Texans picks from expert on 114-90 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/933a98b8-3973-48e6-a50f-be14960bcaae/thumbnail/1200x675/d2e48aa697878b2000a77d32648655a8/shakir.jpg"
      ],
      "datePublished": "2025-11-21T00:14:31.000Z",
      "dateModified": "2025-11-21T00:14:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Domantas Sabonis injury: Kings center hurts knee, will be out at least 3-4 weeks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/domantas-sabonis-injury-sacramento-kings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/6cc3fd16-8daf-43bf-b2eb-f95a7a34e092/thumbnail/1200x675/0b3f6025dff702e176ff65256fef03a2/domantas-sabonis-kings.jpg",
    "tag": "Sports",
    "date": "2025-11-20T23:03:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kings standout Domantas Sabonis has a partially to",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kings standout Domantas Sabonis has a partially torn meniscus and will be re-evaluated in three to four weeks, per ESPN's Shams Charania.Sabonis, 29, missed Sacramento's game Wednesday -- a 113-99 loss to the Thunder -- with the knee injury, and now the full extent of the ailment shows he will be out much longer.It's yet a rough turn of events for the Kings, who are 3-12 and 14th in the Western Conference standings. Sabonis, who had missed three games prior this season due to a variety of ailments, is averaging 17.2 points and 12.3 rebounds per game this season, and he has led the NBA in rebounds per game in each of his three full seasons with Sacramento so far. This year, the struggling Kings have the NBA's third-worst rebounding percentage in the NBA.Sacramento has dealt with a bevy of injuries this season, including to promising forward Keegan Murray (thumb), who is yet to make his season debut. Now, it will be without its best player for the foreseeable future.\nDrew Eubanks and Precious Achiuwa will likely see a bump in playing time during Sabonis' absence.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Domantas Sabonis injury: Kings center hurts knee, will be out at least 3-4 weeks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/6cc3fd16-8daf-43bf-b2eb-f95a7a34e092/thumbnail/1200x675/0b3f6025dff702e176ff65256fef03a2/domantas-sabonis-kings.jpg"
      ],
      "datePublished": "2025-11-20T23:03:26.000Z",
      "dateModified": "2025-11-20T23:03:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills vs. Texans predictions, odds: 'Thursday Night Football' picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-texans-prediction-odds-line-thursday-night-football-picks-nfl-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/7bc7566c-a613-4fad-803d-bfe32d3eacc7/thumbnail/1200x675/744ea6b8e7fd3fca3f9837f7d70810a2/sheldon-rankins-texans.jpg",
    "tag": "Sports",
    "date": "2025-11-21T00:23:16.000Z",
    "description": "\n        The Buffalo Bills and Houston Texans will meet on 'Thursday Night Football,' with both squads playing some of their best ball as of late. Eac",
    "body": "\n        The Buffalo Bills and Houston Texans will meet on 'Thursday Night Football,' with both squads playing some of their best ball as of late. Each has won three of its last four, with Buffalo (7-3) sitting second in the AFC East, while Houston (5-5) is third in the AFC South. The Bills knocked off Tampa, 44-32, in Week 11, as Josh Allen accounted for six total touchdowns. Meanwhile, Houston recorded a 16-13 Sunday victory over Tennessee giving the Texans their second straight win with Davis Mills filling in for C.J. Stroud (concussion), who remains out. Inactive for Buffalo are tight end Dalton Kincaid and receiver Keon Coleman. The Bills are currently the No. 5 seed in the AFC, while Houston is the No. 8 seed.Kickoff is at 8:15 p.m. ET from NRG Stadium in Houston. The Texans have won five straight home games versus Buffalo, including a 23-20 triumph last season. The latest Texans vs. Bills odds have Buffalo as a 5-point favorite, after opening as 2.5-point favorites. The over/under for total points is 44.5. Buffalo is at -265 on the money line (risk $265 to win $100), while Houston is at +215 (risk $100 to win $215). Before making any Bills vs. Texans picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $200 in bonus bets if your $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Now, the model has zeroed in on Houston vs. Buffalo. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Bills vs. Texans:Texans vs. Bills   spreadBuffalo -5 at DraftKings SportsbookTexans vs. Bills    over/under44.5 pointsTexans vs. Bills     money line Buffalo -265, Houston +215Texans vs. Bills     picksSee picks at SportsLineTexans vs. Bills   streaming Amazon PrimeWhy the Bills can coverAllen showed why he is the reigning MVP and a candidate to go back-to-back with his Sunday performance versus the Bucs. He had three passing touchdowns and three rushing touchdowns for the second such game with those stats in his career, and no other player in NFL history even has one such regular season game. With his dual-threat ability, plus James Cook, Buffalo leads the league in rushing offense. On the other side of the ball, Buffalo is elite at defending through the air, ranking in the top five in both passing yards allowed and passing touchdowns given up. Struggling to move the ball through the air would cause tons of problems for Houston, as the Texans have a bottom-10 rush offense and rank 31st in red-zone scoring. Also, Houston is winless against the spread (0-3) as an underdog in 2025. See which team to back at SportsLine.Why the Texans can coverThere's no better unit in all of football than Houston's defense, which boasts No. 1 rankings in both scoring defense and total defense. The Texans have no holes on that side of the ball, with additional top-three rankings versus the run, versus the pass and on third downs. Houston also has a big edge in the all-important turnover differential metric at +7, compared to the Bills being at +1. Additionally, the Bills' No. 31 run defense could get a middling rush offense like Houston's going, and you can't ignore the recent history of this series. The Texans are 5-0 outright and 4-1 against the spread over their last five home games versus Buffalo, while the Bills are 3-5 ATS as a favorite this season.. See which team to back at SportsLine.How to make Bills vs. Texans picksFor the NFL Week 12 'Thursday Night Football' game of Texans vs. Bills, the model is leaning Under the total, projecting 43 combined points. It also says one side of the spread hits in over 50% of simulations. See what it is at SportsLine.Who wins Bills vs. Texans, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Texans vs. Bills spread you need to jump, all from the model that is 48-33 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills vs. Texans predictions, odds: 'Thursday Night Football' picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/7bc7566c-a613-4fad-803d-bfe32d3eacc7/thumbnail/1200x675/744ea6b8e7fd3fca3f9837f7d70810a2/sheldon-rankins-texans.jpg"
      ],
      "datePublished": "2025-11-21T00:23:16.000Z",
      "dateModified": "2025-11-21T00:23:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL says it 'will fight' to keep USWNT superstar Trinity Rodman amid growing interest - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-trinity-rodman-contract-transfer-europe-usl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/0cfdf954-3091-454b-9575-e3872177e99a/thumbnail/1200x675/7b9d8b9d5144a44eab875f689bccd6f1/washington-spirit-trinity-rodman.jpg",
    "tag": "Sports",
    "date": "2025-11-20T22:28:48.000Z",
    "description": "\n        NWSL commissioner Jessica Berman said the league \"will fight\" to keep Trinity Rodman as a bidding war of sorts emerges for the U.S. women's n",
    "body": "\n        NWSL commissioner Jessica Berman said the league \"will fight\" to keep Trinity Rodman as a bidding war of sorts emerges for the U.S. women's national team star, who will be out of contract after Saturday's NWSL Championship (8 p.m. ET on CBS and Paramount+). Rodman's deal with the Washington Spirit, who will face Gotham FC on Saturday, expires upon the conclusion of the 2025 season with her future currently unclear. The Spirit remain in the mix to re-sign her but three clubs out of England's Women's Super League are interested, as are the USL Super League side D.C. Power, according to The Athletic.Most of the contenders for Rodman's signature, including the Power, are reportedly currently able to offer higher wages than the Spirit are because of the restraints of the NWSL's salary cap. The cap will sit at $3.3 million in 2026 and will rise incrementally each year until it reaches $5.1 million in 2030 but Rodman's contract status has raised concerns about the current structure, which Berman tried to dispel in a press conference on Thursday.\"Specifically, as it relates to Trinity and candidly, any other top player in the world, we want those top players here in the NWSL and particularly, we want Trinity in the NWSL and we will fight for her and we are excited to see her compete in the championship on Saturday,\" Berman said.Berman said she believes the NWSL's selling points are greater than just compensation.\n\"We really believe that there is a holistic picture that players evaluate and the reason we believe this is because we hear it from players in our league and around the world,\" she continued. \"I go and sit with the players on every single team in the NWSL every season and they tell me that yes, compensation matters but they also think about compensation not just from the perspective of what their club is paying them … We also know that our market here in the U.S. has more interest in supporting female athletes and women sports than any other market in the world and then there's all the other components outside of compensation, which I referenced earlier, the other three Css, which is the competition, the club and the coaching and we believe on a holistic basis If you're a player who wants to be performing at your best and wants to be valued and supported and feel like you have the opportunity to train in a best-in-class environment with the best-in-class league, that the NWSL is the place for you.\"The salary cap will grow as dictated by the collective bargaining agreement between the league and the NWSL Players Association, the most recent version ratified in 2024. The CBA does include the ability to raise the cap outside of the scheduled yearly increases but Berman did not signal that changes to the current structure were imminent.\"We do not believe that NWSL is a charity,\" Berman said. \"We believe it's a business and in order to treat it like a business, it means that the amount that our teams are investing has to have a rational relationship to revenue and so when we go through that process of reviewing the overall ecosystem and the value proposition that we're offering to top talent and to our players and we're looking at the amount being invested in training facilities, in stadiums, in compensation for players, we have to look at it in the context of where our business is at and of course, as I said earlier, we've made incredible strides in a very short period of time to drive commercial growth, both at the league level and our clubs, but that is the lens that we consistently look at it through.\"\nShould Rodman leave the NWSL, she would join a growing list of USWNT players who recently moved to Europe like Alyssa Thompson and Naomi Girma, though she would easily be the most high-profile to do so. The prospect of Rodman leaving for the Power is a unique one, though – like the NWSL, the USL Super League has been sanctioned by U.S. Soccer as a Division I league, but the clubs' means and budgets are generally more modest than the NWSL's. In its short history, it has acted more as a developmental tool for NWSL clubs, who have sent players on loan to counterparts in the USL Super League, rather than as a destination for top-tier players.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL says it 'will fight' to keep USWNT superstar Trinity Rodman amid growing interest - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/0cfdf954-3091-454b-9575-e3872177e99a/thumbnail/1200x675/7b9d8b9d5144a44eab875f689bccd6f1/washington-spirit-trinity-rodman.jpg"
      ],
      "datePublished": "2025-11-20T22:28:48.000Z",
      "dateModified": "2025-11-20T22:28:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louisiana vs. Arkansas State prediction: Thursday Sun Belt picks from 10K sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/louisiana-arkansas-state-prediction-odds-week-13-sun-belt-conference-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/07/9ac58602-6b1c-495a-b793-dcf24277eb31/thumbnail/1200x675/c825a6708713f165a756116830246095/untitled-design-24.jpg",
    "tag": "Sports",
    "date": "2025-11-20T22:38:49.000Z",
    "description": "\n        Teams on the fringe of the Sun Belt Conference West Division title chase clash when the Louisiana Ragin' Cajuns face the Arkansas State Red W",
    "body": "\n        Teams on the fringe of the Sun Belt Conference West Division title chase clash when the Louisiana Ragin' Cajuns face the Arkansas State Red Wolves on Thursday night. Louisiana is coming off a 42-39 win over Texas State on Nov. 8, while Arkansas State dropped a 27-21 decision to Southern  Mississippi that same day. The Ragin' Cajuns (4-6, 3-3 SUN), who have won two in a row, are 1-4 on the road this season. The Red Wolves (5-5, 4-2 SUN), who have won four of five, are 3-2 on their home field in 2025. Arkansas State is 7-3 versus the spread this season, while Louisiana is 5-5 against the line.Kickoff from Centennial Bank Stadium in Jonesboro, Ark., is at 7:30 p.m. ET. Louisiana leads the all-time series 30-22-1, but Arkansas State holds a 13-11-1 edge in games played in Jonesboro. The Red Wolves are 2.5-point favorites in the latest Louisiana vs. Arkansas State odds, while the over/under for total points scored is 53.5 via SportsLine consensus. Before making any Arkansas State vs. Louisiana picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line and over/under picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Louisiana vs. Arkansas State. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Arkansas State vs. Louisiana:Louisiana vs. Arkansas State                                                                                             spreadArkansas State -2.5 at DraftKings SportsbookLouisiana vs. Arkansas State                                                                                         over/under53.5 pointsLouisiana vs. Arkansas State                                                                                                                                                                                                         money line Louisiana +117, Arkansas  State -140Louisiana vs. Arkansas State                                                                                                                                                                                                 picksSee picks at SportsLineLouisiana vs. Arkansas State                                                                                                                                                                                                   streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make Louisiana vs. Arkansas State picksSportsLine's model is going Over on the total (53.5). The Ragin' Cajuns have gone over the total in each of the last three games, while the Red Wolves are 7-3 against the spread in their last 10 games. The teams combined for 54 or more points in each of their last four meetings.             The model has Louisiana quarterback Daniel Beale throwing for more than 240 yards and two touchdowns, while Arkansas State quarterback Jaylen Raynor throws for nearly 250 yards and two touchdowns. SportsLine's advanced projections call for 59 combined points to be scored. The model also says one side of the spread hits well over 60% of the time. You can only get that pick at SportsLine. So who wins Arkansas State vs. Louisiana, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Louisiana vs. Arkansas State spread to jump on, all from the advanced model that is profitable on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisiana vs. Arkansas State prediction: Thursday Sun Belt picks from 10K sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/07/9ac58602-6b1c-495a-b793-dcf24277eb31/thumbnail/1200x675/c825a6708713f165a756116830246095/untitled-design-24.jpg"
      ],
      "datePublished": "2025-11-20T22:38:49.000Z",
      "dateModified": "2025-11-20T22:38:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thursday Night Football SGP best bets: Bills vs. Texans same-game parlay picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-texans-sgp-thursday-night-football-same-game-parlay-picks-nfl-best-bets-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/ca5b726f-1c84-497e-be74-af3a78856556/thumbnail/1200x675/be099a9f5d9d25e646220874211d344a/davis-mills.png",
    "tag": "Sports",
    "date": "2025-11-21T00:19:03.000Z",
    "description": "\n        'Thursday Night Football' kicks off NFL Week 12 with a pair of AFC playoff hopefuls battling as the Buffalo Bills visit the Houston Texans. C",
    "body": "\n        'Thursday Night Football' kicks off NFL Week 12 with a pair of AFC playoff hopefuls battling as the Buffalo Bills visit the Houston Texans. C.J. Stroud (concussion) is out, but creating a Texans vs. Bills SGP could still lean on several big names like Josh Allen, James Cook and Nico Collins. With both teams possessing top-3 passing defenses, though, many may lean on the running backs with NFL props and when looking to construct a winning NFL same-game parlay. Additionally, not only is Stroud out, but Buffalo will be without Dalton Kincaid and Keon Coleman, both of whom are inactive.The Bills are favored by 5.5 points, per the latest NFL odds, and the over/under is 43.5. Apart from Cook, Houston's tandem of Woody Marks and Nick Chubb could factor into NFL player props and TNF best bets. One also can't forget about what Allen can do on the ground as he had three rushing scores last week and has the shortest NFL odds as an anytime touchdown scorer at -125. What combination of prop bets and predictions should comprise your TNF SGP? Before locking in any Texans vs. Bills picks for your 'Thursday Night Football' SGP, be sure to see the Bills vs. Texans prop predictions powered by SportsLine's Machine Learning AI.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. Now, the model has analyzed Texans vs. Bills on 'Thursday Night Football' and locked in three confident best bets for an NFL SGP. If you successfully parlay its picks, you'd be looking at a payout of almost 6-1. You can only see the Machine Learning Model player prop predictions for Houston vs. Buffalo here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top 'Thursday Night Football' SGP picksAfter simulating Bills vs. Texans, SportsLine's Machine Learning Model says Texans quarterback Davis Mills goes Under 211.5 passing yards (-112 at FanDuel). Mills has looked impressive in a couple of start but that came against the lowly Titans and the Jaguars' 26th-ranked passing defense. He will face a much more formidable foe on TNF in Buffalo, which possesses the league's No. 2 pass defense. The Bills have held each of their last two opposing quarterbacks to exactly 173 passing yards.Only three quarterbacks have gone Over 211.5 passing yards versus Buffalo in 2025, including the likes of Patrick Mahomes and Drake Maye. Mills isn't on their level, and with Buffalo having the 31st-ranked run defense, Houston should heavily lean on the ground game. The AI model projects Mills to have 169.2 passing yards. This NFL prop is rated 4.5 stars and could be a part of a winning Thursday Night Football SGP. See which other TNF same-game parlay picks to make here,How to make Texans vs. Bills   SGP picksIn addition, the SportsLine Machine Learning Model has seven other NFL props that are rated 4 stars or better that could be a part of your Bills vs. Texans SGP picks. You can only see the Machine Learning Model's Thursday Night Football NFL parlay at SportsLine.What are the model's top TNF same-game parlay picks you should target with your Texans vs. Bills predictions? Visit SportsLine now to see the Thursday Night Football SGP from the SportsLine Machine Learning Model and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thursday Night Football SGP best bets: Bills vs. Texans same-game parlay picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/ca5b726f-1c84-497e-be74-af3a78856556/thumbnail/1200x675/be099a9f5d9d25e646220874211d344a/davis-mills.png"
      ],
      "datePublished": "2025-11-21T00:19:03.000Z",
      "dateModified": "2025-11-21T00:19:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Bills vs. Texans: Live stream, kickoff time, odds, pick for TNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-bills-vs-texans-live-stream-prediction-preview-tnf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/bb557e8a-1b4d-441b-b44e-7e72279515f5/thumbnail/1200x675/afdd871f1964f68f52dfec04d12b1821/billlls.jpg",
    "tag": "Sports",
    "date": "2025-11-20T21:46:47.000Z",
    "description": "\n        NFL Week 12 kicks off with an AFC showdown in the Lone Star State, as the 5-5 Houston Texans welcome Josh Allen and the 7-3 Buffalo Bills to ",
    "body": "\n        NFL Week 12 kicks off with an AFC showdown in the Lone Star State, as the 5-5 Houston Texans welcome Josh Allen and the 7-3 Buffalo Bills to town. The Texans are coming off their second straight victory, a 16-13 win against division rival Tennessee Titans, while the Bills emerged on the right side of a 44-32 shootout with the Tampa Bay Buccaneers. It will be Davis Mills under center again for the Texans, as C.J. Stroud will miss a second straight start due to his concussion. Mills is 2-0 this season as a starter and is averaging 283 passing yards per game. He's scored four total touchdowns, thrown one interception, but also been sacked six times in those contests. You can bet Texans vs. Bills at FanDuel Sportsbook, where new users get $150 in bonus bets with a winning $5 wager:The Bills got back to their winning ways last week in a game that featured nine lead changes, but they are still 1.5 games behind the surprising New England Patriots in the AFC East. Between facing a backup quarterback and a bottom-10 rushing attack, this is a big opportunity for Buffalo.\nIt's probably safe to say that another six-touchdown outing is probably not in the cards for Allen, but the NFL's reigning MVP does have an 8-0 record on Thursdays. Six of those victories have come on the road, although Houston has not been kind to Allen who is 0-3 when playing deep in the heart of Texas.Let's break down this week's edition of \"Thursday Night Football,\" but first, here's how you can watch the game. Where to watch Bills vs. Texans liveDate: Thursday, Nov. 20 | Time: 8:15 p.m. ETLocation: NRG Stadium -- HoustonStream: PrimeFollow: CBS Sports AppOdds: Bills -5.5; O/U 43.5 (via FanDuel)Bills vs. Texans: Need to knowDavis Mills struggled in his one start vs. Buffalo. While Mills has been winning as of late, his one career start vs. the Bills back in 2021 was a disaster. He completed 11 of 21 passes for 87 yards, zero touchdowns and a career-high four interceptions in a 40-0 loss. Josh Allen has bad luck in Houston. Allen has an 83-37 record as a starter in the regular season, but he's had bad luck in H-Town. The Bills have lost on walk-off field goals in Houston twice when Allen has started.Bills run defense is an issue. The Bills have the No. 2 pass defense in the NFL, allowing 169.7 yards per game. However, the run defense is a major problem. Buffalo allows the second-most rushing yards per game with 153.0, and has allowed six rushing touchdowns of 30 or more yards this season -- which are tied for the most through 10 games in NFL history.Best defense in the NFL? Many believe the Denver Broncos have the best defense in the NFL, but that title may belong to the Texans. Houston allows a league-low 258.1 total yards per game, and is the stingiest when it comes to allowing points on the board at 16.3 per game. And that 16.3 is the fewest allowed through 10 games by a team without a winning record since 2003! Houston has allowed fewer than 20 points in seven of 10 games this season.Not-ready-for-prime-time players? The Bills are 2-2 in prime time this season, but have lost their past two night games. The Texans on the other hand have lost both of their prime-time matchups this year. Bills vs. Texans prediction, pick\nAllen may not love playing in Houston, but he certainly likes playing on Thursdays. Allen has the best Thursday record (8-0) by a starting quarterback since 1950. He's scored 290 total touchdowns in his career, which are the most all-time by a player 30 years old or younger, and has the most total touchdowns in the NFL this season with 28. All that to say, he's good enough to rise above this vaunted Texans defense. \nThe Texans mounted an impressive comeback against the Jacksonville Jaguars in Week 10 and found a way to win in Tennessee last Sunday despite not scoring a single point in the first half, but the Bills are a different kind of test. Buffalo covers the spread in prime time. Pick: Bills -5.5; Under 43.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Bills vs. Texans: Live stream, kickoff time, odds, pick for TNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/bb557e8a-1b4d-441b-b44e-7e72279515f5/thumbnail/1200x675/afdd871f1964f68f52dfec04d12b1821/billlls.jpg"
      ],
      "datePublished": "2025-11-20T21:46:47.000Z",
      "dateModified": "2025-11-20T21:46:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 12 PPR Cheat Sheet: Start/Sit Guide - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-ppr-cheat-sheet-for-lineup-decisions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/9a810e3f-ee74-44e1-8057-d2b7ea16fff9/thumbnail/1200x675/b3e5ad719663425b9929ed1d70ad5e32/tee-higgins-cincinnati-bengals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-20T22:33:22.000Z",
    "description": "\n\n\n    \n                                    Matchup ratings for every player in Week 12 for PPR leagues\n        \n                                     ",
    "body": "\n\n\n    \n                                    Matchup ratings for every player in Week 12 for PPR leagues\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 20, 2025\n                            \n                    at\n    5:33 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Lineup Cheat Sheet was created so that you could get quick answers to your Fantasy start/sit questions with the analysis already built in. For detailed rationale, check out my latest content, including my weekly Lineup Decisions column.                      What do the numbers mean?\nAll of my analyses from the week, from data points to matchup outlooks to game-flow predictions, are basically represented by a number on a confidence scale from 1-10. The higher the number next to a player's name, the more confident I am that you should start him. The numbers are not a projection, just a confidence score to help you pick who to start. Every relevant player for this week is here, so if a player isn't listed, don't start him.                      To find a specific player, use your search function -- CTRL-F on PCs and Command-F on Macs. If neither of those are options, or if you're on a mobile device, you can scroll by game. If you're still unsure, just send a note on X.com (@daverichard) and I'll give it a look, time permitting. Remember to use the #AskFFT hashtag!                      If you're reading this on Sunday, please refer to our weekly rankings, which are updated in real time.                  Ready to get off on the right foot? Here's how to approach every play for this week in PPR leagues, and you can find our Non-PPR cheat sheet.\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nBillsRTG (MAX 10)TexansRTG (MAX 10)Josh Allen8.9Davis Mills5.0James Cook8.4Woody Marks6.42Ty Johnson2.65Nick Chubb2.3Khalil Shakir6.1Nico Collins8.3Tyrell Shavers2.32Jayden Higgins4.46Dawson Knox3Jaylin Noel2.48Bills DST 7.1Christian Kirk2.28\t\t\t\t \t\t\t\t Dalton Schultz5.5\t\t\t\t \t\t\t\t Texans DST 7.0\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nJetsRTG (MAX 10)RavensRTG (MAX 10)Tyrod Taylor3.7Lamar Jackson7.3Breece Hall6.95Derrick Henry8.18John Metchie III3.42Keaton Mitchell2.45Adonai Mitchell2.75Zay Flowers6.45Mason Taylor4.19Mark Andrews5.85Jets DST 2.3Ravens DST 8.7\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nSteelersRTG (MAX 10)BearsRTG (MAX 10)Mason Rudolph3.8Caleb Williams6.4Jaylen Warren5.92D'Andre Swift6.9Kenny Gainwell5.31Kyle Monangai4.52DK Metcalf6.18Rome Odunze6.62Roman Wilson3.32DJ Moore4.8Calvin Austin III2.9Luther Burden III4.18Pat Freiermuth3.3Colston Loveland3.95Jonnu Smith2.62Bears DST 6.6Steelers DST 6.4\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nPatriotsRTG (MAX 10)BengalsRTG (MAX 10)Drake Maye8.8Joe Flacco6.7TreVeyon Henderson7.2Chase Brown7.12Rhamondre Stevenson4.4Tee Higgins8.45Stefon Diggs6.68Andrei Iosivas5.48Kayshon Boutte5.9Noah Fant4.5Mack Hollins4.22Bengals DST 2.1Hunter Henry4.48\t\t\t\t \t\t\t\t Patriots DST 7.4\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nGiantsRTG (MAX 10)LionsRTG (MAX 10)Jaxson Dart6.6Jared Goff8.3Tyrone Tracy Jr.5.1Jahmyr Gibbs9.05Devin Singletary4.56David Montgomery6.2Wan'Dale Robinson6.12Amon-Ra St. Brown8.55Isaiah Hodgins2.55Jameson Williams7.3Theo Johnson5.22Brock Wright3.15Giants DST 2.2Lions DST 8.6\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nVikingsRTG (MAX 10)PackersRTG (MAX 10)J.J. McCarthy4.7Jordan Love6.3Aaron Jones6.5Emanuel Wilson6.65Jordan Mason4.05Chris Brooks2.42Justin Jefferson7.4Romeo Doubs6.35Jordan Addison5.52Christian Watson6.32T.J. Hockenson4.28Matthew Golden2.68Vikings DST 5.3Packers DST 7.2\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nColtsRTG (MAX 10)ChiefsRTG (MAX 10)Daniel Jones5.8Patrick Mahomes7.2Jonathan Taylor8.9Kareem Hunt5.3Michael Pittman6.55Isiah Pacheco4.02Alec Pierce6.25Rashee Rice8.52Josh Downs5.45Xavier Worthy5.0Tyler Warren6.92Marquise Brown4.24Colts DST 5.4Travis Kelce6.7\t\t\t\t \t\t\t\t Chiefs DST 6.5\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nSeahawksRTG (MAX 10)TitansRTG (MAX 10)Sam Darnold6.5Cam Ward2.8Kenneth Walker III6.48Tyjae Spears4.3Zach Charbonnet4.54Tony Pollard3.55Jaxon Smith-Njigba9.7Chimere Dike4.2Rashid Shaheed4.12Elic Ayomanor3.5Cooper Kupp3.4Chigoziem Okonkwo4.6AJ Barner3.98Titans DST 2.4Seahawks DST 9.8\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nJaguarsRTG (MAX 10)CardinalsRTG (MAX 10)Trevor Lawrence5.9Jacoby Brissett7.9Travis Etienne7.22Zonovan Knight4.42Bhayshul Tuten4.82Michael Carter2.38LeQuint Allen2.5Michael Wilson7.28Jakobi Meyers5.65Greg Dortch4.26Parker Washington5.05Trey McBride8.85Jaguars DST 6.3Cardinals DST 3.8\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nBrownsRTG (MAX 10)RaidersRTG (MAX 10)Shedeur Sanders1.8Geno Smith3.6Quinshon Judkins6.15Ashton Jeanty7.1Jerry Jeudy4.1Tre Tucker5.35Cedric Tillman3.65Tyler Lockett3.85Harold Fannin Jr.5.02Brock Bowers8.15David Njoku4.38Raiders DST 6.7Browns DST 7.6\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nEaglesRTG (MAX 10)CowboysRTG (MAX 10)Jalen Hurts6.8Dak Prescott6.9Saquon Barkley7.25Javonte Williams7.15DeVonta Smith7.02CeeDee Lamb8.6A.J. Brown6.38George Pickens7.38Dallas Goedert5.4Jake Ferguson6.05Eagles DST 7.5Cowboys DST 6.2\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nFalconsRTG (MAX 10)SaintsRTG (MAX 10)Kirk Cousins3.2Tyler Shough4.9Bijan Robinson9.1Alvin Kamara5.98Tyler Allgeier4.44Chris Olave7.5Darnell Mooney4.78Juwan Johnson6.02Kyle Pitts5.28Saints DST 6.0Falcons DST 5.8\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nBuccaneersRTG (MAX 10)RamsRTG (MAX 10)Baker Mayfield7.7Matthew Stafford8.5Sean Tucker5.32Kyren Williams7.18Rachaad White4.08Blake Corum2.7Emeka Egbuka8.02Puka Nacua9.45Tez Johnson5.68Davante Adams7.8Sterling Shepard4.15Colby Parkinson3.2Cade Otton6.08Terrance Ferguson2.52Buccaneers DST 4.6Rams DST 5.7\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nPanthersRTG (MAX 10)49ersRTG (MAX 10)Bryce Young6.0Brock Purdy7.5Rico Dowdle8.5Christian McCaffrey9.8Tetairoa McMillan7.32Brian Robinson Jr.2.5Xavier Legette4.58Jauan Jennings6.3Panthers DST 4.2Ricky Pearsall6.28\t\t\t\t \t\t\t\t George Kittle7.35\t\t\t\t \t\t\t\t 49ers DST 5.0\n            \n    \n\n        \n\n    \n            \n    \n            \n\n                    \n         Now Playing \n                    \n    \n                                        \n            \n                        \n                                                            \n                                    \n    \n                                                                                                    \n                                    \n                                                                                    \n                                                                                                    Week 12 PPR Cheat Sheet \n                                                                                            \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     3 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 12 lineup decisions\n                                                                                                                                                \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     18 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 12 Start 'Em & Sit 'Em\n                                                                                                                                                \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     1 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 12 WR preview\n                                                                                                                                                \n                                        \n                                                    Heath Cummings\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                                                \n                    \n            \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 12 PPR Cheat Sheet: Start/Sit Guide - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/9a810e3f-ee74-44e1-8057-d2b7ea16fff9/thumbnail/1200x675/b3e5ad719663425b9929ed1d70ad5e32/tee-higgins-cincinnati-bengals-imagn-images.jpg"
      ],
      "datePublished": "2025-11-20T22:33:22.000Z",
      "dateModified": "2025-11-20T22:33:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs assistant pushes back on President Trump's critiques of NFL kickoff rules - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/president-donald-trump-nfl-kickoff-rules-kansas-city-chiefs-dave-toub/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/8b638120-7832-48b3-9bd7-7d873706d7e0/thumbnail/1200x675/aa33809615bbc182a771850281304d5d/gettyimages-2166386172-1.jpg",
    "tag": "Sports",
    "date": "2025-11-20T21:20:51.000Z",
    "description": "\n        The first two years of the dynamic kickoff era in the NFL brought an uptick in returns, fulfilling the league's goal of increasing action on ",
    "body": "\n        The first two years of the dynamic kickoff era in the NFL brought an uptick in returns, fulfilling the league's goal of increasing action on special teams. The shift in formats in 2024 brought fairly radical changes, and the NFL continues to assess and tweak its rules to find the sweet spot between excitement and safety. Many coaches embraced the refreshed kickoff model, but it is not without its points of contention, including the elimination of surprise onside kicks and introduction of the 35-yard touchback.President Donald Trump is among those to voice displeasure with the dynamic kickoff format. Earlier this season, he called it \"demeaning\" to the game of football and said he urged commissioner Roger Goodell to revert to more traditional rules.Kansas City Chiefs special teams coach Dave Toub was not having any of that criticism, though.\"He doesn't even know what he's looking at,\" Toub said in Thursday's media availability. \"He has no idea what's going on with the kickoff rule. Take that for what it's worth. I hope he hears it.\"\nTrump's primary point of contention pertains to the delay from the kick to the moment coverage players are allowed to move. Players on the kicking team line up on the opposing 40-yard line while players on the receiving team stand between their own 30-and 35-yard lines and are not allowed to move until the ball lands or hits a returner.\"I hate the kickoff in football,\" Trump said last week on \"The Pat McAfee Show.\" \"I think it's so terrible. I think it's so demeaning. I think it hurts the game, it hurts the pageantry. I've told that to Roger Goodell. And I don't think it's any safer. I mean, you still have guys crashing into each other. It's the opposite of what the game -- the ball is in the air, nobody's moving. It's supposed to be when the ball is in the air, when the ball is played, you're supposed to be moving. The pageantry of the game is so badly hurt.\"In an effort to further increase the frequency of returns, the NFL ahead of the 2025 season modified its touchback rule, bringing the ball out to the 35-yard line instead of the 30 (in the first year of the dynamic kickoff model) or the 25 (prior to dynamic kickoffs).Returns are up again in 2025The experimental year of the dynamic kickoff format delivered precisely what the NFL sought: an increase in return frequency. The return rate grew to 32.8%, up from the 21.8% mark from the final year of the old format (which was the lowest rate in NFL history). The average length of return also ballooned from 23 yards to 27.5 yards.But it was not the dramatic increase the league desired, so it made the change this year to touchbacks in an effort to further improve the odds of a return. So far, so good in that regard. \nLeague data obtained by The Athletic showed that through Week 7, players returned an astounding 79.3% of kickoffs, marking more than a 100% uptick from the first seven weeks of the 2024 season. Lengthy returns are also up significantly this season. There were 32 returns of at least 40 yards through Week 7 this year, more than double the 13 from that same time period a year ago.Players may not be in motion while the ball is in the air like Trump said he prefers. But once they get the green light, they produce more action than they did under previous kickoff formats.Injury rate fluctuates with format changesTrump contested that dynamic kickoffs are no safer than standard kickoffs, but NFL data from 2024 indicated otherwise. The league said that the concussion rate on kickoffs dropped by 43% in the first year of the dynamic model and that the overall injury rate was the same as on all plays from scrimmage.\nHowever, with the uptick in returns in 2025 also came more concussions. League data showed that, through Week 7, the rate of concussions per 100 kickoffs jumped from 0.09 last year to 1.18 this year. The NFL acknowledged that the uptick in overall injuries was expected.Player safety was among the reasons for the move to the dynamic kickoff format, and the restriction of full-speed movement projected to reduce serious injuries.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs assistant pushes back on President Trump's critiques of NFL kickoff rules - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/8b638120-7832-48b3-9bd7-7d873706d7e0/thumbnail/1200x675/aa33809615bbc182a771850281304d5d/gettyimages-2166386172-1.jpg"
      ],
      "datePublished": "2025-11-20T21:20:51.000Z",
      "dateModified": "2025-11-20T21:20:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UEFA Women's Champions League: Chelsea prove they can go toe-to-toe with mighty Barca - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/chelsea-barcelona-uefa-womens-champions-league-measuring-stick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/5599f39a-60d1-49a5-b655-0bc525f8b6ff/thumbnail/1200x675/89c447f86bf392185f8582e776a882ff/chelseafc.jpg",
    "tag": "Sports",
    "date": "2025-11-20T23:11:21.000Z",
    "description": "\n        Back in April, the margins between Chelsea and Barcelona seemed unbridgeable, 4-1 defeats home and away cementing the sense that European foo",
    "body": "\n        Back in April, the margins between Chelsea and Barcelona seemed unbridgeable, 4-1 defeats home and away cementing the sense that European football's finest club were streaking away from the field. Seven months later and the English champions know just how close they are. What were the margins Thursday? The inches that Ellie Carpenter somehow contrived to find when it seemed so much easier for the scorer of a brilliant opener to double her tally. The flick of the post that denied Wieke Kaptein off Alyssa Thompson's delicate touch. The subatomic particles by which Catarina Macario was offside when her header had unleashed delirium at Stamford Bridge.On many another day, this would have been a win to send a statement to the rest of Europe. Then again, if Chelsea continue to perform at this level, they need not worry too much about that. They will get the points needed for a top-four finish and a swift passage to the quarterfinals. What will matter is the statement sent to Barcelona. This doesn't look like a team who are semifinal fodder in waiting. If these two meet again, they should do so as evenly matched foes.Indeed, if anyone will have to adjust it might be Barcelona, who never really found an answer for what Chelsea wanted to do to them. The hosts had judged their game plan to a tee. When Barcelona had the ball at the back, blue shirts converged on central areas, waiting as long as they had to for Cata Coll to get possession moving. If she wanted to tiptoe 15 yards up the pitch, no matter. Chelsea would not be baited into flinching first in the standoff. If they could stay patient, let Barcelona make the first move, they had a good sense of what would happen next. Even a midfield with Alexia Putellas and Aitana Bonmati can't pass its way around every roadblock. Sometimes they'd be played through but more infrequently than you might have expected.\nWhen Chelsea did get the ball back, they knew the weak points to hit. Claudia Pina's justified proclivity to vacate her left wing berth and Esmee Brugts' commitment to driving up the field opened up a clear avenue for the breakaway. Carpenter charged into it and kept charging until she found herself just inside the penalty area, a ferocious swing of her right boot serving as evidence that sometimes you can't blame a goalkeeper for being beaten at their near post.A poacher's finish off a scrappy corner from Ewa Pajor had Barcelona level but it did not deliver the rhythm that the Catalans had established early on. Their pursuit of it was further disrupted by a lengthy break in play in the first half as broadcast facilities at Stamford Bridge went haywire. Ten minutes in 30-degree conditions is hardly conducive to anyone performing at the highest level and Bonmati and Putellas in particular seemed to ease off after both breaks.Their first dropped points of the European season will matter little for Barcelona and it would be easy to say that they meandered to the final whistle because they never needed more than the point they clung onto. To do so would be to give discredit to Chelsea though.\nAcross the field, their organization was exemplary. In a way not dissimilar to how she throttled the Spanish at the Euros, Lucy Bronze would track whichever of Putellas, Pina or Pajor happened to be serving as the left winger in that particular passage of play. Carpenter, the dynamo on Chelsea breakaways, dropped back to ensure that wherever her teammate went, a right back was still on hand.Should Barcelona get through, then they found Naomi Girma to be at the top of her game. Nights like these call for so much from top players but often what is required can boil down to the simplest things. For Girma, this was a day for proper old school center backing. See ball, clear ball. There'll be plenty of other opportunities to demonstrate her abilities to progress possession.On this night, it was more important that Chelsea demonstrate their worth as a rival to Barcelona for the biggest prizes. Their collective responses at the final whistle said just how much there would have been to gain from a win. Sonia Bompastor shook her head, Nathalie Bjorn threw her arms up in frustration. There but for the grace of a few pixels went a win.\nAnd yet in the huddle that soon followed, you sensed a different view was emerging. The heavy favorites to win the Champions League had come to town, perhaps not as the best version of themselves, and Chelsea had been better than them. That may matter a great deal when this competition reaches its decisive games.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UEFA Women's Champions League: Chelsea prove they can go toe-to-toe with mighty Barca - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/5599f39a-60d1-49a5-b655-0bc525f8b6ff/thumbnail/1200x675/89c447f86bf392185f8582e776a882ff/chelseafc.jpg"
      ],
      "datePublished": "2025-11-20T23:11:21.000Z",
      "dateModified": "2025-11-20T23:11:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 NFL stretch run: Which coaches and players have the most at stake? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-stretch-run-coaches-qbs-rising-stars-under-pressure/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/084386d1-74ca-4263-8af6-38118589f7cf/thumbnail/1200x675/25a146a45a442256fab76f3fce784404/tua-tagovailoa-josh-mcdaniel-dolphons-g.jpg",
    "tag": "Sports",
    "date": "2025-11-20T22:27:37.000Z",
    "description": "\n        We're heading into the stretch run of the NFL season now, and the stakes are getting higher. For everybody. Not just the teams, in terms of t",
    "body": "\n        We're heading into the stretch run of the NFL season now, and the stakes are getting higher. For everybody. Not just the teams, in terms of their playoff positioning or even the draft. But also for individual players and coaches, whether in terms of their performance on the field or their potential futures. With that in mind, we thought now was as good a time as any to take stock of the people in the league with the most at stake over the final third of the season. We separated the candidates into three separate groups: the coaches, the quarterbacks and the other players.Without further ado...The CoachesMike McDaniel, Kevin Stefanski, Pete Carroll and Chip Kelly, Raheem MorrisBrowns' coach Kevin Stefanski \n                                                                    Getty Images\n                                                            McDaniel is reportedly safe for the rest of the season. Supposedly, Dolphins ownership wants to keep him around beyond this year as well. But not having alignment between the front office and the coaching staff is always dicey, and whoever is hired as the new general manager could decide to go in a different direction. How the Dolphins play down the stretch could have a significant effect on that decision, whenever it comes. The Browns remain a disaster. They're now 5-22 over the last two seasons. It wouldn't be surprising if they decided to make a change this offseason, even if it was expected that they'd be bad this year. Beyond that, it wouldn't be surprising if Stefanski decided he wanted a change this offseason and decided to chase one of the other open jobs, given how bleak the prospects are in Cleveland.\nThe Raiders are also a disaster, and it really looks like they don't have much of a clue what to do on either side of the ball. Particularly on offense, things are... brutal. They don't have a plan to get the ball to their best players; they can't block; the Geno Smith experiment has been a failure. The Raiders reportedly have confidence in the John Spytek-led front office, but it's not hard to see them pivoting away from the oldest coach in league history after a season that's gone the way this one has so far, assuming it continues this way for the rest of the year. Terry Fontenot was one of the general managers on the hottest seats in our hot seat rankings earlier this week, and one way for a GM to take the pressure off himself is to lay it off on the coaching staff. The Falcons have regressed pretty badly from one year to the next and it's not like Morris has an extensive track record of success as a head coach to fall back on here. If Atlanta plays its way into a top-five pick that is headed to the Rams, we could definitely see a change here. The QuarterbacksTua Tagovailoa, Daniel Jones, J.J. McCarthy, Kirk CousinsVikings quarterback J.J. McCarthy \n                                                                    Getty Images\n                                                            Tagovailoa has been extremely up and down this season, and it's been mostly down. He's gone from leading the NFL in passing yards two years ago to leading the league in interceptions this year, and his yards per attempt average has plummeted since his career high all the way back in 2022. His contract is massive, but the Dolphins can't really save money by cutting him this offseason, though they can do so by trading him. \nThe Colts traded two first-round picks for Sauce Gardner and reportedly believe enough in Jones that they want to give him a new contract this coming offseason. But we've seen some signs over the last few weeks of Jones regressing into some bad habits in terms of sacks, fumbles and interceptions, and if that continues down the stretch of the season, it could change Indianapolis' plans. We saw something similar happen with Sam Darnold in Minnesota last year. Indy doesn't have a McCarthy type waiting in the wings, but that might not matter if Jones falters. If he stabilizes, though, he's likely going to get paid a handsome amount. McCarthy is already getting the \"well, we don't know about his future in Minnesota\" type of reporting, just five starts into his career. It's been pretty bleak out there for him, so it's not hard to see why that's been the case. The Vikings moved on from Darnold to hand him the job and that looks like the wrong decision so far, but McCarthy has a chance to show down the stretch why they were willing to do so. If he continues to struggle, though, the Vikings could be looking to move on pretty quickly. It'd be wild, but it's possible. Cousins is going to start down the stretch for the Falcons and this following slate of games is likely going to determine whether he sticks in the league or his career is over. The results when he's been counted on this year and last haven't been encouraging and he won't have top target Drake London for at least a week, so it's hard to see him making a run at a significant contract this offseason. (The Falcons are clearly going to cut him given the financial realities they'd face by keeping him around, and nobody is going to trade for him at his base salary.)\nThe OthersTrey Hendrickson, Kyle Pitts, Breece Hall, Mark Andrews, Jaelan PhillipsBengals' Trey Hendrickson \n                                                                    Getty Images\n                                                            These players are all pending free agents, so they have a lot to play for down the stretch of the season. Hendrickson has yet to return to practice for the Bengals, who are 3-7 and set to play the Patriots this week, without Ja'Marr Chase. If Hendrickson doesn't return soon and the Bengals continue to stack losses, he may decide just to shut it down for the rest of the year to preserve his body ahead of his foray into the market. He's going to be 31 years old in a few weeks, but there should be plenty of time left for him as a premium edge rusher if he gets a three- or four-year deal -- it's just a matter of how much that deal is worth. Pitts has underwhelmed through the first five seasons of his career, regressing badly amid injuries and limited playing time after his spectacular rookie year, when he caught 68 passes for 1,026 yards. But he has an opportunity over the next few weeks, with Drake London likely out, to prove that he can be a top-level target if featured in the passing game.\nHall was reportedly available for a third-round pick at the trade deadline, but nobody paid that price. He's flashed extremely high-level rushing ability throughout his career, but he's also had periods where he looked extremely ordinary. If he can put together a nice stretch run with Tyrod Taylor under center, maybe he can earn himself a sizable free-agent contract this offseason from one of the running back-needy teams.Andrews is probably in his final season with the Ravens, given the team is more likely to re-sign, well, Isaiah Likely, given the players' ages and Andrews' declining production in recent seasons. But he's still auditioning for a new contract. He probably needs to perform better than his current 8.6 yards-per-catch average over the next few weeks to earn himself a multi-year deal worth a significant amount of money.Phillips is already excelling for the Eagles and has the potential to earn himself a ton of money by continuing to play at that level for the next several weeks and into the playoffs. He has occasionally been an electric edge rusher throughout his career and again looks like that right now, but injury issues have plagued him going all the way back to college and it might be viewed as a significant risk to give him a long-term, big-money deal. If he plays well enough, though, teams could be willing to overlook that history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 NFL stretch run: Which coaches and players have the most at stake? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/084386d1-74ca-4263-8af6-38118589f7cf/thumbnail/1200x675/25a146a45a442256fab76f3fce784404/tua-tagovailoa-josh-mcdaniel-dolphons-g.jpg"
      ],
      "datePublished": "2025-11-20T22:27:37.000Z",
      "dateModified": "2025-11-20T22:27:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Bills vs. Texans: 'Thursday Night Football' daily fantasy lineup advice - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-bills-texans-fanduel-draftkings-daily-fantasy-lineups-advice-thursday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/163ca527-97af-418f-b513-6e36473d0b2d/thumbnail/1200x675/5b71fed819ed48462b722eb5df3b6d79/josh-allen-buffalo-bills-6.jpg",
    "tag": "Sports",
    "date": "2025-11-21T00:32:01.000Z",
    "description": "\n        NFL Week 12 commences with the Buffalo Bills visiting the Houston Texans on 'Thursday Night Football' at 8:15 p.m. ET. Houston quarterback C.",
    "body": "\n        NFL Week 12 commences with the Buffalo Bills visiting the Houston Texans on 'Thursday Night Football' at 8:15 p.m. ET. Houston quarterback C.J. Stroud (concussion) has been ruled out. With Stroud out, those involved in NFL DFS contests will gravitate towards making a Josh Allen and James Cook NFL DFS stack with the Bills being top-heavy, while under-the-radar options include Khalil Shakir and Ty Johnson. As for Houston, its top daily Fantasy football pick is Nico Collins, who has thrived no matter who has thrown him passes, but the Texans' running back pairing shouldn't be overlooked.Veteran Nick Chubb may not be what he once was, but he can still move the chains and is a nice complement to Woody Marks. The rookie is a good bet for double-digit touches weekly, and he also won't set back your NFL DFS salary cap too much, thus allowing you to still include higher-priced players in TNF DFS lineups. Outside of Stroud, others ruled out include Buffalo's Dalton Kincaid (hamstring) as well as receiver Keon Coleman, who is inactive for the second straight week. Before making any NFL DFS picks for Bills vs. Texans on 'Thursday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to Texans vs. Bills vs on 'Thursday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Top NFL DFS picks for Bills vs. TexansPart of McClure's NFL DFS strategy for 'Thursday Night Football' is Bills quarterback Josh Allen, who has an over/under of 224.5 passing yards and 33.5 rushing yards. The reigning MVP nearly single-handedly won many NFL DFS contests for whomever rostered him last week with 317 yards and three touchdowns through the air, plus 40 yards and three scores on the ground. He's the only player in NFL history to record at least three rushing scores and three passing scores in a regular season game. Allen has multiple total touchdowns in all but one game this season and leads all quarterbacks in Fantasy points for the fourth time in his career. While Houston has an elite defense, it is susceptible on the ground to quarterbacks as each of the last three it faced had at least 33 rushing yards, despite each being less mobile than Allen. See who else to roster at SportsLine.Another of McClure's NFL DFS picks is Texans tight end Dalton Schultz. He's come on strong as of late with Davis Mills under center. Schultz has at least six catches and 51 yards in each of the last three weeks, with one total touchdown. He's averaging 60.5 receiving yards over his last six games and is on pace to have career highs in both catches and yards this season. He also showed out in his last primetime game, going for season highs in both receptions (nine) and yards (98) on MNF versus Seattle. Buffalo hasn't faced many top-tier TEs this season, but Travis Kelce -- who has fewer targets and catches than Schultz in 2025 -- had 66 yards and 2-point score versus the Bills in Week 9. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set NFL DFS lineups for Texans vs. BillsMcClure is targeting another undervalued player who could explode for huge numbers on 'Thursday Night Football.' This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Thursday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Bills vs. Texans: 'Thursday Night Football' daily fantasy lineup advice - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/163ca527-97af-418f-b513-6e36473d0b2d/thumbnail/1200x675/5b71fed819ed48462b722eb5df3b6d79/josh-allen-buffalo-bills-6.jpg"
      ],
      "datePublished": "2025-11-21T00:32:01.000Z",
      "dateModified": "2025-11-21T00:32:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football lineup decisions: Start/sit decisions for every game on the slate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-12-lineup-decisions-your-guide-to-the-toughest-starts-sits-and-flexes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/9aa50579-8046-4fd8-84fe-376cd8ab7df9/thumbnail/1200x675/619f2c1a8859a5b2abde8f8b535a6cd2/caleb-williams.jpg",
    "tag": "Sports",
    "date": "2025-11-20T22:37:22.000Z",
    "description": "\n        Fantasy Football is all about the matchups. Even though you drafted your team with certain hopes and intentions, your weekly lineup decisions",
    "body": "\n        Fantasy Football is all about the matchups. Even though you drafted your team with certain hopes and intentions, your weekly lineup decisions shouldn't be determined by the order you picked your players in. You need to check who your players play and make sure you've got the right guys in -- and the wrong guys out.               We can take some educated guesses based on coaches film, meaningful data, healthy personnel, defensive schemes, track records, and key details of offenses. The things we know can help us minimize the impact of the things we don't know. This should lead to better decisions being made.                We'll go through every game and highlight the players who aren't obvious starts and sits (because you don't need to be told to sit Noah Fant). You should feel more comfortable starting or sitting players based on the information given, and feeling comfortable with your Fantasy lineup before the games start is the best feeling in the world.                  All lines from Caesars Sportsbook.                                                    \n\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nIn their past four games, excluding garbage time, the Bills have given up a ridiculous 5.8 yards per carry, a 12.9% explosive rush rate, and six touchdowns to running backs! The Texans haven't faced many opponents with this porous of a rush defense this year but when they have, they've dialed up the RB runs -- 30 times in Week 4, 27 times in Week 5 and, curiously, 21 times in Week 11. That might make you feel good about their chances of actually committing to the run, but two big factors remain: One, the Texans have a grand total of one running back with 12.5-plus PPR points in those three super-favorable matchups because they've insisted so much on splitting carries. Two, if the Bills build a lead, then the Texans will almost certainly abandon their run game. No doubt the matchup is encouraging, as is Woody Marks' snap share (72%) and touches (35!) over the past two weeks, but he's not as explosive as De'Von Achane or even Sean Tucker, both of whom ripped the Bills defense over their last two games. Marks qualifies as a low-end No. 2 Fantasy running back, especially in PPR, but there's all kinds of downside.  When the Texans aren't rushing -- and by their metrics, they throw about 60% of the time -- they should expect the Bills to get pressure on Davis Mills. Buffalo is one of the best teams in the league at getting pressure on the quarterback without having to blitz. Last week, Mills shortened up his average time to throw, resulting in efficient numbers but nothing exciting against the Titans. When he's gotten the ball out quickly over his past three games (under 2.5 seconds), Nico Collins has been his top target (37.7% target per route run rate) followed by Jayden Higgins (27.5%) and Dalton Schultz (26.8%). This is about the most encouraging stat I can come up with in favor of Schultz, who typically wins as a short-area target but faces a Bills pass defense that has routinely shut down tight ends (sometimes they end up blocking more than running routes like Cade Otton did last week). If you start Schultz, you might have to settle for 9 of 10 PPR points because of the matchup, which stinks because Schultz has delivered at least 11 PPR points in each of his past three games (all with Mills) and five of his past six. MUST STARTS: Josh Allen, James Cook, Nico Collins STARTS: Woody Marks (low-end No. 2 RB), Dalton Schultz (low-end TE), Bills DST, Texans DST \nFLEX: Khalil Shakir SITS: Davis Mills, Jayden Higgins, Dawson Knox (desperation TE), Christian Kirk, Keon Coleman, Ty Johnson, Nick Chubb, Dare Ogunbowale, Ray Davis \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nStatistically, there isn't a big drop-off between Tyrod Taylor and Justin Fields on the season, but throw out Week 1 when Fields played well against a Steelers defense he was familiar with and Taylor has Fields beat by a small margin on pretty much every passing category. The film shows that Taylor is better at figuring out coverages and is more willing to attack deep. The problem is that Baltimore's pass defense has only improved as the season has progressed, while their run defense still leaves something to be desired (an 18.2% explosive rush rate allowed in their past four games). Fields' rushing would have stressed the Ravens defensive front! Instead, bank on as much Breece Hall as the Jets can squeeze into the game, including through the air; Taylor's track record includes throwing to his tight ends and Hall had six targets Taylor's Week 3 start. There isn't any other Jets player worth trusting.  MUST-STARTS: Lamar Jackson, Derrick Henry STARTS: Breece Hall, Mark Andrews, Zay Flowers (low-end No. 2 WR), Ravens DST SITS: Tyrod Taylor, Mason Taylor, Isaiah Likely, John Metchie, Adonai Mitchell, DeAndre Hopkins, Keaton Mitchell, Justice Hill, Isaiah Davis, Jets DST \n\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nI'm going to assume the Steelers will go back to heavy man-to-man coverage after playing a ton of zone last week against Joe Flacco. It should mean a lot of Cover-1 defense, which Williams has struggled against this season (one touchdown and an 84.4 QB rating on the year, and it's been even worse in his past five). The Steelers can really bring the pass rush that way and ultimately impact the Bears passing game, which is bad for Caleb Williams and Rome Odunze. The Steelers have allowed 12 receivers to exceed 15 PPR points on the season including three Colts in Week 9, but they've tightened up in their past two games (Ladd McConkey and Tee Higgins each made a spectacular touchdown catch); they even shut down Ja'Marr Chase last week. Playing Jalen Ramsey at safety has made a positive difference. Odunze has been at his best versus man-to-man coverage, but when Williams has been pressured Odunze's target per route run rate flops from 26.5% (no pressure) to 13.7% (pressure). Odunze has landed single-digit PPR points in half of Williams' sub-24-point outings this year. That might be too much risk for Fantasy managers to trust.  DK Metcalf continues to see safeties play over to his side and on his routes, making him tougher to throw to downfield. The Steelers deserve props for using Metcalf more on shorter crossing routes but it means he'll need even better target volume to land over 10 PPR points, something he's done once in his past five. At least the matchup is relatively favorable -- the Bears have leaned into zone coverage in their past couple of games, partially because their secondary is in rough shape, and Metcalf sees a higher target share and better receiving efficiency against zone coverage than man-to-man, even if his average depth of target is less than half as deep. The Bears did a wonderful job limiting Justin Jefferson and Jordan Addison last week but some (not all) of that had to do with mistakes that Minnesota made. Maybe there's enough here to feel okay about Metcalf as a flex.  STARTS: D'Andre Swift, Jaylen Warren (borderline No. 2/3 RB), Rome Odunze (No. 2 WR), Bears DST (low-end DST) \nFLEX: DK Metcalf, Kenneth Gainwell (PPR), Kyle Monangai (non-PPR)  SITS: Caleb Williams (high-end No. 2 QB), Aaron Rodgers, Luther Burden III (stash), DJ Moore, Colston Loveland, Pat Freiermuth, Calvin Austin III and Roman Wilson (desperation WRs), Jonnu Smith, Steelers DST  \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nTreVeyon Henderson had some really great moments over his past three games but the return of Rhamondre Stevenson probably will warrant a split in snaps -- just maybe not quite as unbalanced as before. In the three games before Stevenson's absence, Henderson played at most 29.3% of the snaps logged at least four fewer carries than Stevenson. I'd like to think that Henderson's explosive element could get him at least 45% of the snaps while Stevenson hangs on to important duties like short-yardage/goal-line carries and pass protection while still managing some runs. Mike Vrabel did mention this week he wanted to make sure Stevenson could handle his normal volume coming back from injury, so maybe that means he'll see a downtick in snaps. Additionally, former Patriots running back and current CBS Sports HQ football analyst Damien Harris told me that Pats playcaller Josh McDaniels, whom Harris played for, is very detail-oriented and that Stevenson does more of the little things better than Henderson. That figures to still go a long way with McDaniels. If there's good news it's that the Bengals have allowed 13 running backs to notch at least 15 PPR points in 10 games this season, so there's a possibility both running backs come through in Week 12. There's a chance everyone on the Patriots comes through because this Bengals defense is so bad.  MUST-STARTS: Drake Maye STARTS: Joe Flacco (low-end No. 1 QB), Tee Higgins, Chase Brown, TreVeyon Henderson (low-end No. 2 RB), Stefon Diggs, Patriots DST \nFLEX: Rhamondre Stevenson (non- & half-PPR), Andrei Iosivas (PPR), Kayshon Boutte SITS: Ja'Marr Chase (suspended this week), Noah Fant (high-end No. 2 TE as long as Mike Gesicki is out), Hunter Henry (high-end No. 2 TE), Mack Hollins, DeMario Douglas, Samaje Perine, Bengals DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nThe Jameson Williams post-bye bump is very real and very likely to continue. For starters, he's been great in each of three games and doing so on 6 or 7 targets per contest with a steady 10.0 average depth of target. My colleague Jacob Gibbs has noted how effective Williams has been on horizontal routes (digs, crossers, posts, etc.), a change in role from earlier in the season. But it's really just as simple as knowing that for however long Sam LaPorta is out, Williams should shine. He's especially clobbered man-to-man coverage, which seems to be the preferred way the Giants defense plays, especially on third downs and when they're trailing in the second halves of games. Also, all three of Jared Goff's biggest games this season have been lopsided Lions blowout wins; two of those came after losses the week prior. There's a chance for another one of those bounce-back gems this week.  \nMUST-STARTS: Jahmyr Gibbs, Amon-Ra St. Brown STARTS: Jared Goff, Jameson Williams, David Montgomery (low-end No. 2 RB), Lions DST FLEX: Wan'Dale Robinson (PPR) SITS: Jaxson Dart (borderline No. 1/2 QB), Theo Johnson (high-end No. 2 PPR TE), Devin Singletary (desperation RB), Tyrone Tracy Jr., Isaiah Hodgins, Brock Wright, Giants DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nJ.J. McCarthy was off-target on eight throws by my count including two of his interceptions last week and a third pass that should have been picked. His receivers dropped at least four passes also. Candidly, this passing offense looked disjointed until their final drive in which McCarthy overcame a drop and a tipped pass, hit Jordan Addison on a hitch on fourth down and eventually found him again for a touchdown on a sort-of late throw to give the Vikings a one-point lead with 50 seconds left. Had McCarthy connected better than that with his receivers earlier in the game then the narrative would be different going into this week's matchup. Instead he'll face a Packers defense that's struggled to pressure the quarterback on its past three games (three sacks total) but has evolved into a strong run defense unit over the past couple of games. It's going to be a little tough to trust McCarthy's receivers fully since the whole passing unit has been so off -- McCarthy has completed just 50.5% of his passes for 5.5 yards per attempt since coming back from injury.  \nMUST STARTS: Justin Jefferson (high-end No. 2 WR) STARTS: Emanuel Wilson (No. 2 RB), Aaron Jones, Romeo Doubs and Christian Watson (both low-end No. 2 WRs), Packers DST FLEX: Jordan Addison SITS: Jordan Love (high-end No. 2 QB), J.J. McCarthy, Jordan Mason, T.J. Hockenson, Dontayvion Wicks, Jalen Nailor, Chris Brooks, Vikings DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nThe Chiefs are going to be focused on hounding Daniel Jones in hopes of creating some turnovers. Pass rush pressure has played a role in forcing him into 12 sacks, three fumbles lost and four interceptions in his past two games, so expect Steve Spagnuolo to dial up some exotics. Indy can combat that by having Jones get the ball out fast, but he's never been much of a snap-and-throw guy this season, often relying on his pocket mobility to keep plays alive. He's struggled with exactly that in his last two games and could be his downfall in a third. Only two quarterbacks -- Josh Allen and Trevor Lawrence -- have done better than 21 Fantasy points against the Chiefs in their past eight, a list that includes Jalen Hurts, Jared Goff, Lamar Jackson and Bo Nix.  \nIf the matchup is going to be challenging for Jones then it'll be challenging for his pass-catchers too. Just three receivers have topped 15 PPR points against the Chiefs this year, and two were in Week 1. Of the 11 receivers with seven-plus targets, six did manage to top 13 PPR points (half also exceeded 15). These are tough correlations for Michael Pittman, Alec Pierce and Josh Downs' Fantasy managers to wrestle with. And unless the Colts dominate time of possession, they won't all see a lot of targets unless Jonathan Taylor is bottled up. Deep targets (15-plus air yards) to receivers have been caught at a 64.3% clip against the Chiefs in their past three games for 27.1 yards per grab, a big shift from earlier in the year and something the Broncos exploited last week. Pierce has dominated that role for Indy and could make him worth the Fantasy gamble. Kansas City is much better on shorter throws, which is where Pittman and Downs tend to get the majority of their targets. They could catch a lot of passes but not break them for big plays.  MUST-STARTS: Patrick Mahomes, Jonathan Taylor, Rashee Rice, Tyler Warren STARTS: Michael Pittman, Travis Kelce, Chiefs DST (low-end starter; might not use them again until Week 14) FLEX: Alec Pierce, Kareem Hunt SITS: Daniel Jones, Josh Downs (desperation PPR WR), Xavier Worthy, Marquise Brown, Brashard Smith, JuJu Smith-Schuster, Colts DST  \n\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nTennessee deserves credit for stopping Woody Marks and the Texans' run game last week, absorbing 21 RB runs and giving up just 2.9 yards per carry. Getting Jeffery Simmons back and next to fellow behemoth T'Vondre Sweat absolutely impacts how offenses run the ball, even when running to the edges. So while it's cool that the Seahawks coaching staff has finally realized that Kenneth Walker is their best rusher, the matchup this week is not good at all, especially if rookie guard Grey Zabel is out. What it might mean is Sam Darnold getting a rich bounce-back opportunity against a Titans defense that's afforded at least 27 Fantasy points to three of the past four quarterbacks they've faced. It might mean an efficient game for Darnold -- think 250-2-0 for a stat line.  MUST-STARTS: Jaxon Smith-Njigba STARTS: Kenneth Walker III, Seahawks DST  SITS: Sam Darnold (borderline No. 1/2 QB), Cam Ward, A.J. Barner and Chig Okonkwo (desperation PPR TEs), Zach Charbonnet (desperation RB), Tyjae Spears (desperation PPR RB), Tony Pollard, Chimere Dike, Rashid Shaheed, Cooper Kupp, Titans DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nWhat else do you need to see from Jacoby Brissett to believe in his ability to rack up stats? His worst game during his five-week stretch as the Cardinals starter has been 23.4 Fantasy points, and now he'll take on a Jaguars defense that gave up 31-plus Fantasy points to three straight quarterbacks before collapsing Justin Herbert in Week 11. I suppose there's some cause for concern for Brissett if his offensive line is down to its third-string right tackle and a backup guard, but even then he should be able to get the ball out quick to his receivers. That's actually been a secret for Brissett -- he has over 100 yards passing in 4 of 5 games just from his receivers adding yards after the catch. The Jaguars are capable of bringing pressure and have seven sacks in their past three games, but only 15 for the season. It's enough to trust Brissett -- and his top targets -- for Week 12.  MUST-STARTS: Trey McBride STARTS: Jacoby Brissett, Michael Wilson (especially in PPR), Travis Etienne,  FLEX: Zonovan Knight, Greg Dortch (low-end PPR flex), Bhayshul Tuten (low-end flex), Jakobi Meyers SITS: Trevor Lawrence, Parker Washington (desperation PPR WR), Michael Carter, Jaguars DST, Cardinals DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nThis will obviously be a big step-up in class for the Cowboys defense after they dominated the Raiders on Monday, but it's going to end up as a big test for the Eagles offense, too. Down potentially two starting offensive linemen including veteran stud right tackle Lane Johnson, Philly will need answers for the Cowboys' replenished front that includes party crasher Quinnen Williams and linebackers Logan Wilson and DeMarvion Overshown, each of whom played great. Maybe there's room for Jalen Hurts to strike downfield against the likes of cornerback Caelen Carson, but he'll also have to navigate that Dallas front and certainly throw with better accuracy than he did last week. Before the Cowboys' trade deadline moves I would have believed in that happening, but now I'm not as confident, especially since his pass protection has taken a significant hit. The Cowboys have gotten a pass rush pressure rate north of 40% in six of their past seven games, so this isn't something spurred on by Williams' arrival but is definitely enhanced by it. It's easier to lower expectations for Hurts after he's been below 15 Fantasy points in two straight games against tough defenses, but pulling him from lineups altogether figures to be tougher. MUST-STARTS: Jalen Hurts, CeeDee Lamb, Saquon Barkley STARTS: Dak Prescott (low-end No. 1 QB), Javonte Williams, George Pickens, DeVonta Smith, A.J. Brown, Jake Ferguson, Dallas Goedert, Eagles DST  SITS: Jahan Dotson, Tank Bigsby, Cowboys DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nIt's not fair to judge Shedeur Sanders off of his second half last week when he seemed unprepared -- a week's worth of practice should help him understand what's asked of him. But this is still a tough scene for him against a Raiders defense desperate for a win and more than capable of lining up against this Browns offense. Browns coach Kevin Stefanski kept things really simple for Dillon Gabriel not just in his first start but pretty much every start, and he'll do the same for Sanders. That means a lot of short throws and easy reads to prevent Sanders from holding the ball too long. That was a problem for him at Colorado, frequently drifting so far back out of the pocket that it added over five yards to many throws. If the Browns can give him some clean pockets, Sanders will surprise with some good completions, but that may not happen all that often behind an offensive line giving up the second-highest pass rush pressure rate this season. Expect a bumpy performance from Sanders, and thus disappointing stats from Browns pass-catchers, but nothing as bad as last week. MUST-STARTS: Brock Bowers STARTS: Ashton Jeanty, Quinshon Judkins, Harold Fannin Jr. (low-end No. 1 TE), Browns DST, Raiders DST FLEX: Tre Tucker SITS: Geno Smith, Shedeur Sanders, David Njoku, Tyler Lockett, Jerry Jeudy, Cedric Tillman, Raheem Mostert, Dylan Sampson, Jerome Ford \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nIn his Week 8 start against a then-weak Miami defense Kirk Cousins was sensitive to pass rush pressure, without velocity on most of his throws, 9 of 19 passing on throws of five-plus air yards, touchdownless and under 10 Fantasy points. Last week he 14 dropbacks filling in for an injured Michael Penix Jr. and looked the same. The Falcons would be insane not to try to ride its run game for as long as possible, even if the Saints run defense has actually looked passable in its past three games (3.7 yards per carry, 4.9% explosive rush rate allowed). Kyle Pitts stepped up as a short-area target for Kirk Cousins in Week 8 and should be that again, giving him some upside in PPR. No one should be ready to trust anyone else in the Falcons passing game, including Darnell Mooney who will assume No. 1 receiver duties this week. MUST-STARTS: Bijan Robinson STARTS: Chris Olave, Juwan Johnson, Kyle Pitts (low-end PPR TE) FLEX: Alvin Kamara, Tyler Allgeier (non-PPR) SITS: Tyler Shough, Kirk Cousins, Darnell Mooney, Falcons DST (high-end No. 2 DST), Saints DST (kind of a sneaky sleeper) \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nThe Rams have been rolling, but a lack of pass rush pressure over their last three games could give Baker Mayfield the time he needs to rock that secondary for a big game. Since their Week 8 bye, L.A. has accumulated just one sack and a pass rush pressure rate of 29.4%. Sam Darnold made this defense look like superstars with his four interceptions, and Tyler Shough was all about getting the ball out of his hands quickly in his first start, but Mac Jones came through for a 29.1 blockbuster in Week 10. Mayfield is capable of matching that mark, especially since his run game doesn't figure to be as promising this week -- the Rams have given up just 3.6 yards per rush and a paltry 2.9% explosive rush rate over their past four games (garbage time excluded). I'm encouraged to give all the top players in the Bucs passing game a lineup spot this week.   MUST-STARTS: Kyren Williams, Puka Nacua, Davante Adams STARTS: Matthew Stafford, Baker Mayfield, Emeka Egbuka,  FLEX: Tez Johnson, Sean Tucker (non-PPR) SITS: Rachaad White (desperation PPR RB), Sterling Shepard (desperation WR), Colby Parkinson, Terrance Ferguson, Blake Corum, Rams DST (high-end No. 2 DST), Buccaneers DST \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nTetairoa McMillan surprised me last week -- I didn't think he'd have the opportunities to rack up numbers, nor did I think the Panthers would be able to protect Bryce Young against a good Falcons pass rush. I'll take the L on McMillan and apply the lesson learned last week to this week: When Young has time to throw, especially against an inferior defense, expect good things for McMillan. The 49ers are among the worst in the league in terms of pass rush pressure -- they have eight sacks since Week 3 when Nick Bosa went down with an injury. Between that and the 49ers putting up points of their own against the Panthers' suspect defense, it's fair to expect another solid game for Young and potentially a great game for McMillan. After all, it was this 49ers defense that afforded Michael Wilson the chance to perform like Larry Fitzgerald last week -- and he was just one of three Cardinals pass catchers to top 15 PPR points. At least one receiver has turned in 13.6 PPR points against the 49ers in four straight games. I'd like to think I would be encouraged to start McMillan this week even if he had struck out last week.  MUST-STARTS: Christian McCaffrey, George Kittle STARTS: Brock Purdy, Rico Dowdle, Tetairoa McMillan FLEX: Jauan Jennings and Ricky Pearsall (both borderline No. 2/3 PPR WR), Xavier Legette (low-end flex)SITS: Bryce Young, Jalen Coker, Ja'Tavion Sanders, Brian Robinson Jr., 49ers DST, Panthers DST \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football lineup decisions: Start/sit decisions for every game on the slate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/9aa50579-8046-4fd8-84fe-376cd8ab7df9/thumbnail/1200x675/619f2c1a8859a5b2abde8f8b535a6cd2/caleb-williams.jpg"
      ],
      "datePublished": "2025-11-20T22:37:22.000Z",
      "dateModified": "2025-11-20T22:37:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]