[
  {
    "title": "Computer model locks in Seahawks vs. Panthers picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/panthers-seahawks-where-to-watch-nfl-week-17-score-prediction-betting-odds-sportsbook-promos-sgp/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-12-28T17:13:31.000Z",
    "description": "\nTwo NFC division leaders square off in Week 17 action when the Seattle Seahawks visit the Carolina Panthers. Each team is coming off a massive divisi",
    "body": "\nTwo NFC division leaders square off in Week 17 action when the Seattle Seahawks visit the Carolina Panthers. Each team is coming off a massive divisional win, with Seattle upsetting the Los Angeles Rams in a thrilling Thursday Night Football affair to move to 12-3 and in the driver's seat for both the NFC West title and the No. 1 seed in the conference, while the Panthers beat the Tampa Bay Buccaneers to enter Week 17 with a slim lead in the division. Those teams meet again in Week 18 in a game that may very well be a win-or-go-home situation for both sides.Kickoff from Bank of America Stadium is set for 1 p.m. ET on CBS and Paramount+. The Seahawks are seven-point road favorites per the latest Seahawks vs. Panthers odds from DraftKings, while the over/under for total points scored is 42.5. Seattle's over/under for total team points is 24.5, while Carolina's is 17.5. Before making any Panthers vs. Seahawks picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Seahawks vs. Panthers on SundayWhen: Sunday, Dec. 28Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppSeahawks vs. Panthers betting previewOdds: Seahawks -7, Over/Under 42.5The Seahawks and Panthers have both over-performed in comparison to preseason expectations, and that's especially true when it comes to their records against the spread. Seattle is 10-5 ATS this year while Carolina is 9-6. The Seahawks have seen nine of their 15 games go Over the total, while the Panthers are 7-8 to the Over this year.Seahawks vs. Panthers SGPPanthers +7Over 42.5Zach Charbonnet anytime touchdownBet it at DraftKings:\nModel's Seahawks vs. Panthers score prediction, picksThe model projects another Seahawks win in their quest to win the NFC West and take home the No. 1 seed, but it does think Carolina will continue to be competitive. The model has the Panthers covering 52% of the time and winning outright 34% of the time. The Over hits in nearly 60% of simulations. Seahawks vs. Panthers score prediction: Seahawks 27, Panthers 20\nWant more Week 17 NFL picks?You've seen the model's best bets for Seattle Seahawks vs. Carolina Panthers. Now, get against the spread, total and money-line picks for every Week 17 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Seahawks vs. Panthers picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg"
      ],
      "datePublished": "2025-12-28T17:13:31.000Z",
      "dateModified": "2025-12-28T17:13:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Eagles vs. Bills picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-bills-where-to-watch-nfl-week-17-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/9bed288b-a0bd-4f92-844e-ab610b1a3b8e/thumbnail/1200x675/e37d8fea14392ce28308718b54977d93/jalen-hurts-philadelphia-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-28T20:22:25.000Z",
    "description": "\nThe Philadelphia Eagles come in as the NFC East champions, but the Buffalo Bills have work to do to retain their AFC East title when they host this N",
    "body": "\nThe Philadelphia Eagles come in as the NFC East champions, but the Buffalo Bills have work to do to retain their AFC East title when they host this NFL Week 17 matchup. The Eagles (10-5) hit a rough patch and went on a three-game losing skid because of an inconsistent offense but have bounced back to score 60 points in winning their past two games. The Eagles have been leaning on running back Saquon Barkley as the weather turns frigid, while the Bills have won four in a row with James Cook carrying a big part of the load. Kickoff from Highmark Stadium is set for 4:25 p.m. ET. The Bills are 2.5-point home favorites in the latest Eagles vs. Bills odds from DraftKings, while the over/under for total points scored is 44.5. Buffalo's over/under for total team points is 24.5, while Philadelphia's is 20.5. Before making any Bills vs. Eagles picks of your own, you have to see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Eagles vs. Bills on SundayWhen: Sunday, Dec. 28Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppEagles vs. Bills betting previewOdds: Bils -2.5, Over/Under 44.5The Eagles are 9-6 against the spread this season and 10-4 ATS in their past 14 road games. They are 4-2 ATS in their past four against the Bills. Buffalo is 7-8 ATS and has won 16 of its past 17 games at Highmark Stadium. The total has gone Under in six of Philadelphia's last seven games, but the Over has hit in four of Buffalo's past six. The Eagles have won 11 of their past 13 matchups with AFC teams.Eagles vs. Bills SGPBills MLOver 44.5Josh Allen Over 196.5 passing yardsBet it at DraftKings:\nModel's Eagles vs. Bills score prediction, picksThe model has the Bills winning outright 54% of the time and covering the spread in 53% of simulations. It's also leaning hard on the Over, with that coming in at a 58% clip. Allen has gone Over his passing yards total in four of his past five home starts, and the props model is projecting him to throw for more than 230 yards.Eagles vs. Bills score prediction: Bills 26, Eagles 23Want more Week 17 NFL picks?You've seen the model's best bets for Philadelphia Eagles vs. Buffalo Bills. Now, get against the spread, total and money-line picks for every Week 17 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Eagles vs. Bills picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/9bed288b-a0bd-4f92-844e-ab610b1a3b8e/thumbnail/1200x675/e37d8fea14392ce28308718b54977d93/jalen-hurts-philadelphia-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-12-28T20:22:25.000Z",
      "dateModified": "2025-12-28T20:22:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bears vs. 49ers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bears-49ers-nfl-player-props-sgp-sunday-night-football-same-game-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/982135f2-303b-4453-81ba-ee5611a5147f/thumbnail/1200x675/01ce9c0458012a0911a12612902ff438/brock-purdy-san-franciscio-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-29T00:05:14.000Z",
    "description": "\nTeams in a battle for the NFC's top overall seed clash when the Chicago Bears meet the San Francisco 49ers in Week 17 'Sunday Night Football' at 8:20",
    "body": "\nTeams in a battle for the NFC's top overall seed clash when the Chicago Bears meet the San Francisco 49ers in Week 17 'Sunday Night Football' at 8:20 p.m. ET from Levi's Stadium in Santa Clara, Calif. The Bears (11-4) have already won NFC North, while the 49ers (11-4), who are second in the NFC West, trail the Seattle Seahawks by one game. The matchup will feature quarterback Caleb Williams against quarterback Brock Purdy. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which San Francisco is favored by 3.5 points.Williams has played well at times this season, and has completed 57.8% of his passes for 3,400 yards and 23 touchdowns. Purdy, meanwhile, has played in seven games and has completed 68.8% of his passes for 1,737 yards and 17 touchdowns. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like D'Andre Swift, Kyle Monangai and DJ Moore of the Bears, as well as Christian McCaffrey, Brian Robinson Jr. and Jauan Jennings of the 49ers. Before betting any Bears vs. 49ers props for Sunday Night Football, you need to see the Bears vs. 49ers prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Christian McCaffrey anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Bears vs. 49ers NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided 49ers vs. Bears prop picks. You can only see the Machine Learning Model player prop predictions for Bears vs. 49ers here.Top NFL player prop bets for Bears vs. 49ersAfter analyzing the Bears vs. 49ers props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says 49ers quarterback Brock Purdy goes over 1.5 passing touchdowns (-206). Purdy has thrown for two or more touchdowns in five of seven games. In the 48-27 win over the Indianapolis Colts on Monday night, he threw five touchdown passes, while throwing one interception. Additionally, Chicago has the 18th-best passing defense in terms of yards, but just three teams have allowed more passing scores than the Bears.Purdy threw for 295 yards and three touchdowns in a 37-24 win over the Tennessee Titans on Dec. 14. The SportsLine Machine Learning Model projects Purdy to have 2.4 touchdown passes and gives this prop a 3.5 out of 5-star prop rating. See more NFL props here. Bet Purdy to go Over 1.5 passing touchdowns at DraftKings:\nHow to make NFL player prop bets for Bears vs. 49ersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has nine NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Bears vs. 49ers prop bets for Sunday Night Football.Which Bears vs. 49ers prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top 49ers vs. Bears props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bears vs. 49ers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/982135f2-303b-4453-81ba-ee5611a5147f/thumbnail/1200x675/01ce9c0458012a0911a12612902ff438/brock-purdy-san-franciscio-49ers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-29T00:05:14.000Z",
      "dateModified": "2025-12-29T00:05:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Bears vs. 49ers: Best daily Fantasy lineups for 'Sunday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-bears-49ers-daily-fantasy-lineups-draftkings-fanduel-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/2d8f93f5-663d-4942-a552-31a7607ab8f0/thumbnail/1200x675/e3172fe9c9c2d4314f9adf381d3938d6/cmc49ers.jpg",
    "tag": "Sports",
    "date": "2025-12-28T23:22:21.000Z",
    "description": "\nThe San Francisco 49ers host the Chicago Bears in the Week 17 edition of 'Sunday Night Football' at 8:20 p.m. ET. Both teams are battling for playoff",
    "body": "\nThe San Francisco 49ers host the Chicago Bears in the Week 17 edition of 'Sunday Night Football' at 8:20 p.m. ET. Both teams are battling for playoff positioning, so they won't be holding anything back as the regular season begins to wind down. Top options in the NFL DFS player pool include Christian McCaffrey, Caleb Williams, D'Andre Swift and Brock Purdy. Both teams have some injury concerns at the skill positions with Chicago receiver Rome Odunze (foot) ruled out and the Niners listing tight end George Kittle (ankle) and Ricky Pearsall (knee, ankle) as questionable.How should you build your NFL DFS lineups for 'Sunday Night Football,' and which sleepers should factor into your NFL DFS strategy? Before making any Bears vs. 49ers DFS picks, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure.You can also bet props like D'Andre Swift as anytime TD scorer (+140) using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Sunday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Bears vs. 49ersOne of McClure's top NFL DFS picks is San Francisco running back Christian McCaffrey. One of the premier daily Fantasy options in the league, McCaffrey enters this matchup on a five-game touchdown streak. He also had 146 scrimmage yards last week against the Colts. He produced 117 of those on the ground, but his two touchdowns came via short passes, illustrating how tough it is to contain him for opposing defenses. See who else to roster at SportsLine.You can also bet on McCaffrey to go Over 117.5 rushing + receiving yards (-113) at DraftKings:\nHe's also building around Bears tight end Colston Loveland. He's still being used in plenty of two tight-end sets with Cole Kmet, but Loveland, the rookie out of Michigan, has become the clear TE1 in this offense. Ben Johnson's offense produced huge numbers for Sam LaPorta as a rookie and second-year player in 2023 and 2024, and Loveland is pacing in the same direction. The Niners are tough overall on defense, but have given up the 22nd most Fantasy points to opposing tight ends. See more NFL DFS picks at SportsLine.Bet Loveland to go Over 40.5 receiving yards (-112) at DraftKings:\nHow to set 49ers vs. Bears NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Bears vs. 49ers: Best daily Fantasy lineups for 'Sunday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/2d8f93f5-663d-4942-a552-31a7607ab8f0/thumbnail/1200x675/e3172fe9c9c2d4314f9adf381d3938d6/cmc49ers.jpg"
      ],
      "datePublished": "2025-12-28T23:22:21.000Z",
      "dateModified": "2025-12-28T23:22:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giannis Antetokounmpo explains controversial dunk to end Bucks vs. Bulls game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/giannis-antetokounmpo-dunk-bucks-bulls-trade-rumors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/788878dc-3362-41d5-84e3-c65811a8d73c/thumbnail/1200x675/f0f8d05467e11395259f5de496b78021/giannis-antetokounmpo.jpg",
    "tag": "Sports",
    "date": "2025-12-28T18:55:58.000Z",
    "description": "\n        Giannis Antetokounmpo returned from an eight-game absence Saturday night to lead the Milwaukee Bucks to a 112-103 win over the Chicago Bulls.",
    "body": "\n        Giannis Antetokounmpo returned from an eight-game absence Saturday night to lead the Milwaukee Bucks to a 112-103 win over the Chicago Bulls. The two-time MVP poured in 29 points, which he capped off with a fastbreak windmill dunk in the final two seconds after the game was already well decided.After the final buzzer sounded, Bulls forward Nikola VucevicVučević and guard Coby White approached Antetokounmpo to share their irritation with his unnecessary dunk which led to both benches emptying to defuse the situation.\n\"We're 11th in the East,\" Antetokounmpo said. \"Got to keep finding an identity. And if that's to get a little bit of scrappy at the end, so be it. We're not champs. Why should we play the clock out and have respect and fair play? We're fighting for our lives right now.\"The Bucks went 2-6 in Antetokounmpo's absence, and are just 13-19 on the season. While it's a night-and-day difference when Giannis is on the floor, the Bucks struggled to consistently string together wins, even in a weak Eastern Conference.\"This is real tough,\" Antetokounmpo said. \"I've been 13 years in the league. If we keep on losing, probably half of the team not going to be here. We're not going to make the playoffs. I really don't care. At the end of the day, I just want to be available, be healthy and help my team win. And if [a windmill dunk] is what has to happen for everybody to wake up and understand, we're fighting for our lives and we got to get our hands dirty, so be it.\"\nBulls players took exception with Antetokounmpo's actions.\"He shouldn't have dunked the ball,\" White said after the game. \"It's disrespectful to the game. I said, 'Bro, you're better than that.' The game is over with. Why you got to do that? It's a respect thing.\"Vučević tried to rationalize Antetokounmpo's actions, saying, \"I'm assuming Giannis was mad about that report that came out the Bulls didn't want to trade for him.\"\nTrade hype hovered over the Bucks for most of the season after a report surfaced that Antetokounmpo may request one by midseason. There are conflicting reports about his actual willingness to request a trade, but comments last night suggest he is not happy with the state of things in Milwaukee.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giannis Antetokounmpo explains controversial dunk to end Bucks vs. Bulls game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/788878dc-3362-41d5-84e3-c65811a8d73c/thumbnail/1200x675/f0f8d05467e11395259f5de496b78021/giannis-antetokounmpo.jpg"
      ],
      "datePublished": "2025-12-28T18:55:58.000Z",
      "dateModified": "2025-12-28T18:55:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers coach Matt LaFleur looking to 'pump the brakes' on the Malik Willis hype - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/green-bay-packers-matt-lafleur-malik-willis-jordan-qb-quarterback/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/758321e9-ac97-4c41-9859-60cbfb57db2b/thumbnail/1200x675/dd90b25c1613b6e9f6479e9d89cbd63c/will.jpg",
    "tag": "Sports",
    "date": "2025-12-28T23:39:33.000Z",
    "description": "\n        Green Bay Packers quarterback Malik Willis caught the attention of the NFL world on Saturday night, when he turned in an impressive performan",
    "body": "\n        Green Bay Packers quarterback Malik Willis caught the attention of the NFL world on Saturday night, when he turned in an impressive performance in a 41-24 loss to the Baltimore Ravens. The former third-round pick of the Tennessee Titans completed 18 of 21 passes for 288 yards and one touchdown, and led Green Bay in rushing with 60 yards and two more touchdowns.Willis became the first quarterback all-time to complete 85% of his passes while averaging 13 yards per attempt, and rush for 60 yards. His 13.7 yards per attempt were the most by a quarterback with 50 rushing yards in a game in the last 50 seasons. Willis looked like he could be a starting NFL quarterback, which led some to wonder if coach Matt LaFleur could keep Willis in the starting lineup over Jordan Love when he recovers from his concussion and left shoulder injury. LaFleur told reporters on Sunday that he's excited about how Willis is playing, but wants to \"pump the brakes\" when it comes to Willis overtaking Love on the depth chart. \"I think Jordan Love is playing some pretty high-level football and it's great that we feel the same about Malik and his ability to go in there,\" LaFleur said. \"I thought he's had two really back-to-back outstanding performances. So we're in a good spot with that position. Certainly have a lot of confidence in both of those guys, but it's pretty clear that Jordan is our franchise quarterback and when he's healthy, he's going to be our starter. So I just want to squash all that.\"\nLove is 9-5-1 as the starter this season, and has completed 66.3% of his passes for 3,381 yards, 23 touchdowns and six interceptions. While LaFleur says Love is playing high-level football, he's lost two straight starts following a four-game win streak. Love registered his first multi-interception game of the season against the Denver Broncos in Week 15, then threw for just 77 yards before exiting the Week 16 matchup against the Chicago Bears with his concussion. Willis entered and sparked the offense, completing 9 of 11 passes for 121 yards and a touchdown in the eventual overtime loss. \nYou also have to remember that the Packers signed Love to a four-year extension worth $220 million in 2024. He's on the books through 2028, but there's no ignoring the fact that Willis has been impressive in his limited action with Green Bay.Malik Willis' career as starterTitansPackersW-L1-22-1Completion percentage51%80%Passing yards per game78.0204.0TD-INT0-33-0Passer rating39.0132.4As a prospect hailing from Liberty, Willis was lauded for his dual-threat ability, but it was also understood that he was a project. Even in his three starts with Tennessee, Willis wasn't trusted to throw the football. Following his rookie season, the Titans traded up in the second round of the 2023 NFL Draft to select quarterback Will Levis, who started nine games over Willis when Ryan Tannehill was injured that year. On roster cutdown day in 2024, the Titans traded Willis to the Packers for a seventh-round pick. Willis flashed his potential shortly after arriving in Green Bay, as he started for an injured Love in a Week 2 victory against the Indianapolis Colts, then was given the opportunity to face off against his former team in Nashville in Week 3. Willis threw for 202 yards and a touchdown in that 30-14 victory over the Titans, and added another touchdown on the ground. \nThe Packers will have to be prepared to lose Willis, as he is set to become a free agent this offseason. With what he accomplished on Saturday night, Willis has become an intriguing candidate on the quarterback carousel. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers coach Matt LaFleur looking to 'pump the brakes' on the Malik Willis hype - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/758321e9-ac97-4c41-9859-60cbfb57db2b/thumbnail/1200x675/dd90b25c1613b6e9f6479e9d89cbd63c/will.jpg"
      ],
      "datePublished": "2025-12-28T23:39:33.000Z",
      "dateModified": "2025-12-28T23:39:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Myles Garrett: Steelers 'more worried' about him sacking Aaron Rodgers than outcome - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/myles-garrett-steelers-aaron-rodgers-winning-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/974c223b-112d-48f5-9489-844709ced06c/thumbnail/1200x675/4928b8a0630aaf212f93859049a08a7e/myles-garrett-browns-2.jpg",
    "tag": "Sports",
    "date": "2025-12-29T00:16:08.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Pittsburgh Steelers weren't on the wrong end o",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Pittsburgh Steelers weren't on the wrong end of a record-setting Myles Garrett sack. They were, however, on the wrong end of the scoreboard, and Garrett believes there was a strong correlation between the two.\n\"To an extent, I feel like they were more worried about keeping me away from Aaron [Rodgers] than, you know, getting the win, and I think that's what came back to bite them,\" Garrett said after the Browns' 13-6 upset win in Cleveland. \"They'll have to fight it out with Baltimore next week, but I'm just proud of the guys for fighting and getting this win. That's the main thing, and I'm always gonna keep it that.\"Garrett, who was often chipped by a running back or tight end or outright double-teamed, managed just two pressures on 43 pass rush snaps, a 4.7% rate. That was his second-lowest of the season; he had just a 4.2% pressure rate in the Week 6 game against Pittsburgh.Garrett remains at 22 sacks on the season, one behind breaking the record of 22.5 shared by Michael Strahan (2001) and T.J. Watt (2021). Sunday represented Garrett's first game without at least a half-sack since that aforementioned Week 6 game against Pittsburgh. The Cleveland defense still dominated, though: Alex Wright and Grant Delpit both sacked Rodgers, who had a season-low 4.3 yards per attempt. As a result, the Steelers will host the Baltimore Ravens for the AFC North title in Week 18; Pittsburgh could have clinched the division with a win in Cleveland.\nGarrett, meanwhile, will have one more shot at the record when the Browns visit the Cincinnati Bengals in Week 18. Garrett had two sacks in the Week 1 matchup between the two teams.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Myles Garrett: Steelers 'more worried' about him sacking Aaron Rodgers than outcome - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/974c223b-112d-48f5-9489-844709ced06c/thumbnail/1200x675/4928b8a0630aaf212f93859049a08a7e/myles-garrett-browns-2.jpg"
      ],
      "datePublished": "2025-12-29T00:16:08.000Z",
      "dateModified": "2025-12-29T00:16:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Maxx Crosby injury: Raiders' DE to evaluate future with Las Vegas after move to IR - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/maxx-crosby-injury-raiders-future-decision-ir/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/544dcac9-0280-418a-8cba-a3d6e731bf4c/thumbnail/1200x675/18dd065609e26f32118581357d086e8c/maxx.jpg",
    "tag": "Sports",
    "date": "2025-12-28T18:22:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL world has seen the last of Maxx Crosby thi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL world has seen the last of Maxx Crosby this season. Is it possible this is also the last of him with the Las Vegas Raiders? The Raiders shut down Crosby due to a knee injury, placing him on injured reserve. However, this was a decision with which the five-time Pro Bowler \"vehemently\" disagreed, according to Jay Glazer of Fox. Crosby argued he is healthy enough to play, and wanted to finish out the season. This decision will cause Crosby to evaluate his future with the Raiders organization, according to NFL Media. Glazer reports he spoke with Crosby on the phone, and relayed that the star pass rusher is \"not a happy camper right now.\" Crosby is set to have a meniscus trim, which is not a major procedure. On Saturday, he posted pictures and videos of him playing basketball and on a trampoline to his social media, which showed that he's not in debilitating pain that would force him off the field. The Raiders even felt the need to release a statement explaining their decision to place Crosby on injured reserve:\n\"After deliberate and thorough consultation with multiple top medical professionals, it became clear that this decision is in the best interest of both the franchise and the player. Maxx is the ultimate warrior, and he has fought extremely hard to compete each week with his teammates since injuring his knee mid-season.\"We are grateful for his extraordinary contributions. He is a true Raider on and off the field. We look forward to his leadership and toughness into 2026 and beyond.\"In 15 games played, Crosby recorded 73 tackles, 28 tackles for loss, 20 QB hits, 10 sacks, six passes defensed and his first career interception. Just nine months ago, Crosby signed a three-year, $106.5 million extension that includes $91.5 million guaranteed. The contract made him the highest-paid non-quarterback in NFL history at the time. Crosby wanted to remain loyal to the franchise that selected him in the fourth round out of Eastern Michigan in 2019, even though he's seen just one winning season. It's possible things may have changed. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Maxx Crosby injury: Raiders' DE to evaluate future with Las Vegas after move to IR - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/544dcac9-0280-418a-8cba-a3d6e731bf4c/thumbnail/1200x675/18dd065609e26f32118581357d086e8c/maxx.jpg"
      ],
      "datePublished": "2025-12-28T18:22:26.000Z",
      "dateModified": "2025-12-28T18:22:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Whittingham's courting of quarterback Bryce Underwood begins at Michigan - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-kyle-whittinghams-bryce-underwood/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/c9076ea8-046f-4be7-a7fd-ac8a3ffda5f8/thumbnail/1200x675/f64b521c1c5c6d0cdb0d4c0614bd2914/underwood.png",
    "tag": "Sports",
    "date": "2025-12-28T21:10:24.000Z",
    "description": "\n        New Michigan coach Kyle Whittingham has dozens on 1-on-1 meetings with players to finish up over the next few days before tackling talent acq",
    "body": "\n        New Michigan coach Kyle Whittingham has dozens on 1-on-1 meetings with players to finish up over the next few days before tackling talent acquisition in the transfer portal, but first, roster retention is of utmost importance.Whittingham said Sunday during his introductory press conference that the first player he sat down with was freshman quarterback Bryce Underwood, the top-rated player in the 2025 recruiting cycle who has eclipsed 2,500 yards of total offense this season ahead of Wednesday's battle against Texas in the Citrus Bowl.\"I did a lot of listening,\" Whittingham said of his 45-minute conversation with Underwood. \"I wanted feedback from him, I wanted to get to know him. Everything from growing up, family, what's important to him -- it was a great conversation. He's a special young man. Carries himself the right way, you got to have a quarterback that has that 'it' factor and Bryce definitely has that 'it' factor.\"Along with a ton of talent. Big, strong kid. 6-foot-4, 225-plus pounds. His ceiling is very high, and the offense that we are going to bring in here I think will suit him to a T. I think he's going to really, really excel and have a great experience here.\"\nAhead of Whittingham's meeting with Michigan's starting quarterback in Orlando, Underwood said he was \"excited\" to chat with the former Utah coach given his expansive resume of success.\"Very excited to figure out what kind of guy he is. I don't really know too much about him. I'm just excited to figure out what kind of guy he is,\" Underwood said. Underwood said he's made no plans for beyond the bowl game for 2026 and will \"figure it out\" with his family.\nCBS Sports' Matt Zenitz reported this weekend that Whittingham is targeting Utah offensive coordinator Jason Beck as his play-caller in Ann Arbor, a necessary potential acquisition given his impact on the Utes' offense this season.Utah ranked second nationally in rushing this season at 269.7 yards per game on the ground and fifth nationally in scoring at 41.1 points per game. Whittingham acknowledged Sunday that Michigan's offense will bring a \"physicality-first\" mindset and everything starts for the Wolverines at the line of scrimmage.If Underwood returns, he'll be the headliner for a Michigan offense expected to bring back ballcarrier Jordan Marshall, several players up front and wideout Andrew Marsh, among others. Asked what kind of offense Michigan will have in 2026, Whittingham went into detail on his plan.\n\"Spread. We're going to base it out of the spread,\" Whittingham said. \"Eleven personnel will be our base personnel group. We're going to run the football efficiently. The only people that were in the same category as us [at Utah] were the service academies -- Air Force, Navy. Otherwise, I believe that if you can run the football effectively, everything happens off of that.\" Raw as a passer during his first season in the Big Ten, Underwood completed 61.1% of his passes for 2,229 yards with nine touchdowns and six interceptions. He's comfortable and capable as a runner, an area that could be further developed under Whittingham's preferred scheme.Utah quarterback Devon Dampier rushed for 687 yards and seven touchdowns this season while backup Byrd Ficklin, a freshman, managed 503 yards and 10 scores on just 56 attempts.\nWhittingham, who went 177-88 with the Utes, was hired to stabilize a program in disarray following the firing of Sherrone Moore, a bitter ending to a scandal-ridden era that overlaps Michigan's unbeaten, national title campaign in 2023.Whittingham said Michigan was one of a handful of jobs across the country that he would say \"yes\" to when the search landed on him.\"What you can expect? Physicality will be our calling card,\" Whittingham said. \"We were the most physical team in whatever league we played in. I believe in running the football and defending the run. If you can win the line of scrimmage, be physical up front.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Whittingham's courting of quarterback Bryce Underwood begins at Michigan - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/c9076ea8-046f-4be7-a7fd-ac8a3ffda5f8/thumbnail/1200x675/f64b521c1c5c6d0cdb0d4c0614bd2914/underwood.png"
      ],
      "datePublished": "2025-12-28T21:10:24.000Z",
      "dateModified": "2025-12-28T21:10:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Curt Cignetti's success at Indiana is boring by design -- and built to last - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/curt-cignettis-success-indiana-simplicity/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/2abb85f6-d604-48d4-bfe6-91a4f31e39d1/thumbnail/1200x675/a8ccf6712647bb70382872191549e428/curt-cignetti-cfp-feature-1.jpg",
    "tag": "Sports",
    "date": "2025-12-28T16:19:40.000Z",
    "description": "\n        Everyone wants to know how Curt Cignetti's Indiana has done it. One of the hardest things about building a college football program is not ju",
    "body": "\n        Everyone wants to know how Curt Cignetti's Indiana has done it. One of the hardest things about building a college football program is not just achieving success, but sustaining and improving upon it. Yet for Indiana, eleven wins in 2024 and a College Football Playoff berth turned into a 13-0 record and a No. 1 seed in 2025. The Hoosiers were played off the field by Notre Dame and Ohio State last season, then beat Oregon on the road by two scores and defeated the Buckeyes en route to a Big Ten championship this year. It may look like only two more wins, but in college football, the gulf between great and elite can be depressingly wide (ask Penn State).Indiana's success is boring by design and, like all teams, a reflection of its head coach. It's deliberate. It's competent. The Hoosiers block, tackle and execute. They are vegetables in a society obsessed with the fast-food version of success. It would be easier to pinpoint the \"why\" if there were something flashy about it, but Cignetti's approach -- and his prowess as a scout and developer of talent -- simply wins (Google it), to the tune of a 24-2 record in two seasons for a program that entered 2025 as the losingest in FBS history. Indiana finds talent -- however unheralded it may be -- evaluates it, develops it and deploys it. There is no wunderkind young coordinator with a gimmick scheme on either side of the ball. There aren't five-star prospects across the roster. True, Indiana has the Heisman Trophy winner in Fernando Mendoza, but he is not a transcendent athletic freak like Cam Newton. Mendoza was a former two-star recruit who produced on a bad Cal team before coming to IU through the transfer portal.\nWhen Indiana athletic director Scott Dolson set out to replace Tom Allen in December 2023, he established criteria based on what had worked at comparable programs such as North Carolina, Duke and others in the Big Ten. From there, the department built a candidate profile, and one of the required boxes was experience as a recruiting coordinator. Cignetti fit it. He held that role for six years at NC State under Chuck Amato and spent four years as a recruiting coordinator on Nick Saban's original Alabama staff. That emphasis ran counter to what was en vogue in college football, as many power-conference programs chased an NFL-style model with an empowered front office and a coach less involved in roster construction.Cignetti comes from a coaching family. He grew up around the West Virginia program while his father, Frank Sr., coached there in the 1970s. Frank Sr. later led Indiana University of Pennsylvania to perennial Division II contender status from 1986-2005. \nCignetti's brother, Frank Jr., has been a journeyman assistant coach with multiple stops in college football and the NFL. Curt remembers going to Mountaineer Field and watching his father and then-WVU coach Bobby Bowden study the game on 16-millimeter film.\"Whether you're an offensive lineman, a defensive lineman, a skill player on either side of the ball, even quarterbacks, you have to have a certain amount of movement skills to be successful on the football field,\" Frank Jr. said. \"So it all starts from the ground up: ankle flexion, the knee bend, the hips, the ability to bend from the hips. And this, you know, has been in football forever. I can remember being a young coach, my father talking about those three traits when you watch film.\"That perspective speaks to how Curt Cignetti views the game. The Hoosiers are not reinventing the wheel. They are excelling at identifying foundational truths of athleticism and emphasizing fundamentals. Ankle flexion, for instance, contributes to how an athlete loads energy in the lower body and can indicate explosive potential. It is a tenet across all sports, but especially football, which demands sudden changes of direction -- cutting through a hole, snapping off a route or dropping weight to deliver force when making a tackle or taking on a block. Players who bend at the waist can indicate stiff ankles and an inability to achieve an athletic stance with proper hip and knee bend. In other words, a waist-bender is likely to have limits to their athletic ceiling.\n\"The first time in my life I'd ever heard the term ankle stiffness and knee stiffness was from coach Saban and Curt Cignetti,\" former Temple and Georgia Tech head coach Geoff Collins said. \"I'd never heard that term in my life. Now I constantly use it. I'd never heard that before, but it's real. I'm watching America's Home Videos with my daughter with my nine-year-old daughter today, and there's some kid doing some gymnastics and I'm like, 'Oh my, look at that ankle stiffness.'\"Collins worked at Alabama as director of player personnel under Cignetti and Saban. Together, they helped identify and build the recruiting classes that laid the foundation for Saban's dynasty with players such as Julio Jones and Mark Ingram. Collins recalls the meticulous nature of their evaluations. Even with Jones widely regarded as the best receiver in his high school class, the staff still watched every snap of his senior season to better understand his floor and ceiling.Film sessions with Cignetti and Saban were not highlight cutups showing \"the good, bad and ugly.\" They were exhaustive studies of how a player operated from the first snap to the last. How did he respond after giving up an explosive play? How did he perform on the snap after a pancake block? Saban often talked about treating every play as its own event, a process-driven approach divorced from outcomes. It has become something of a meme how displeased Cignetti appears whether Indiana wins by one touchdown or seven. Echoing Saban, Cignetti seemed more impressed by a narrow win over a middling Penn State on Omar Cooper's toe-tapping late touchdown than by a 53-point rout of Illinois that featured dominance in all three phases.\nFrom Alabama, Cignetti bet on himself by taking the head coaching job at IUP, following in his father's footsteps and leading the Crimson Hawks to multiple double-digit win seasons before a two-year stint at FCS Elon.As coach of the Phoenix, Cignetti remained true to his evaluation process, staying closely involved and offering instant feedback to assistants while they recruited. With far fewer resources, he was unafraid to stick to his convictions about player fit.\"I was an area coach, and there was this tight end who had a ton of Group of Five offers,\" former Elon assistant Jerrick Hall said. \"And I'm thinking he has Group of Five offers, surely he can be good enough for Elon. So when I said that to him, and he gave me that instant feedback, and he said, 'This is not the type of tight end we're looking for. We're looking for more of a blocking type of tight end.' So even though this kid had multiple G5 offers, he had higher stuff than us; he wasn't attractive because he wasn't a fit for our scheme.\"\nHall also remembers seeing James Carpenter at a summer camp. Carpenter arrived as an offensive lineman, and Hall -- now Navy's defensive line coach -- thought he was undersized. Cignetti saw something on tape. Carpenter walked on at James Madison in Cignetti's first season in 2019, when the program was still in the FCS. He developed into an All-Sun Belt performer in 2022 after JMU moved up and later became a reliable contributor at Indiana in 2024.Consider defensive standouts D'Angelo Ponds, Aiden Fisher and Mikail Kamara. Each starred at James Madison, followed Cignetti to Indiana and flourished as All-Americans against a higher level of competition. They fit what Cignetti values, and their presence reflects Indiana's staff continuity. Multiple assistants followed him from JMU, including defensive coordinator Bryant Haines, and only one assistant from the 2024 Indiana staff did not return for 2025. Cignetti's recent contract extension ensures the Hoosiers' staff salary pool remains competitive within the Big Ten.Indiana does have capable front-office staff. Director of player personnel Matt Wilson was recently named FootballScoop.com's GM of the year. Still, final evaluation decisions rest with Cignetti -- a model that has worked so far.\n\"I think Curt would be a great NFL GM, because he would minimize mistakes in the draft process,\" Frank said. \"He would minimize mistakes in the free agent process. Because really, that's what he's doing today, right? He is the GM. He is evaluating the film. He is making the final decisions, and one thing he puts a premium on is production, and then he knows what he's looking for in the athletic traits, the athletic skills of every position.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Curt Cignetti's success at Indiana is boring by design -- and built to last - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/2abb85f6-d604-48d4-bfe6-91a4f31e39d1/thumbnail/1200x675/a8ccf6712647bb70382872191549e428/curt-cignetti-cfp-feature-1.jpg"
      ],
      "datePublished": "2025-12-28T16:19:40.000Z",
      "dateModified": "2025-12-28T16:19:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colston Loveland among expert's best Week 17 NFL player prop bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-picks-colston-loveland-prop-among-sportsline-experts-best-bets-for-week-17/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/13f549f0-f02c-4b9b-ab27-6f1b85cbad6f/thumbnail/1200x675/71d9455c4a944cf6734806d758b9c0ad/colston-loveland-chicago-bears-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-28T15:41:14.000Z",
    "description": "\nA pair of division titles - the final two postseason berths - could be secured in Week 17 of the 2025 NFL season. The Pittsburgh Steelers can capture",
    "body": "\nA pair of division titles - the final two postseason berths - could be secured in Week 17 of the 2025 NFL season. The Pittsburgh Steelers can capture their first AFC North crown since 2020 with a road victory against the Cleveland Browns, and the Carolina Panthers can end Tampa Bay's four-year reign in the NFC South with a home win against the Seattle Seahawks and a Buccaneers loss to the Dolphins in Miami.Pittsburgh (9-6), which defeated Cleveland 23-9 at home in Week 6, will make its fifth trip to the playoffs in six seasons and render its Week 18 showdown with the Baltimore Ravens meaningless by posting its fourth consecutive victory. The Browns are looking to snap their four-game losing streak.Carolina (8-7), which hasn't won the division since 2015, gained the upper hand in the NFC South by edging Tampa Bay 23-20 at home last week. It was the third straight setback and sixth in seven games for the Buccaneers (7-8), who must end their slide keep alive their postseason hopes as they host the Panthers in a potential clash for the division title in Week 18.For Sunday's matchups, top sportsbooks have set the passing yards prop for Pittsburgh's Aaron Rodgers at 183.5 yards, Jaxon Smith-Njigba of Seattle's receiving yards prop at 90.5 and the rushing yards prop for Tampa Bay's Bucky Irving at 62.5.Before you play a side on Rodgers, Smith-Njigba, Irving or any player prop for Week 17 of the NFL season, you need to see what SportsLine player prop expert PropBetGuy has to say. The expert is +1267 on his last 73 NFL player prop picks. Here are his picks and analysis.Darnell Washington Over 26.5 receiving yards\nAnother week, another Washington Over.Washington has cleared this receiving yards line in four of his last seven games when fully healthy, coinciding with a bump in his snap and route share. The Steelers will be without receivers DK Metcalf and Calvin Austin on Sunday, which should create even more opportunities for the massive tight end.The Browns employ man coverage at the league's highest rate, and Washington now owns the highest target rate of the Steelers' pass catchers against man (23.5%, per PFF), sans Metcalf.The weather will be rough but Washington's low average depth of target and yards-after-catch ability should keep him plenty involved. I'd bet this up to Over 27.5 yards.Colston Loveland Over 3.5 receptions\nLoveland has cleared this line in six of his last eight games, despite a string of brutal matchups and weather. He'll have neither of those on Sunday Night Football in San Francisco.The 49ers really have struggled to defend tight ends since losing star linebacker Fred Warner for the season. Higher volume pass-catching tight ends have thrashed this defense – Trey McBride had 10 receptions while Kyle Pitts hauled in seven passes.Overall, the 49ers allow the most catches per game out of the slot (7.8, per Fantasy Points), and the seventh-most to in-line tight ends (3.4). Loveland should thrive in a better passing environment than what he's experienced over the last few weeks. I'd bet this up to -145.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colston Loveland among expert's best Week 17 NFL player prop bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/13f549f0-f02c-4b9b-ab27-6f1b85cbad6f/thumbnail/1200x675/71d9455c4a944cf6734806d758b9c0ad/colston-loveland-chicago-bears-imagn-images.jpg"
      ],
      "datePublished": "2025-12-28T15:41:14.000Z",
      "dateModified": "2025-12-28T15:41:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff picture: Ravens at Steelers to decide AFC North in Week 18 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-playoff-picture-standings-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/29afc77b-d509-4b16-a13e-1e4f981f79fd/thumbnail/1200x675/51b5340fc734f048ff141f4492af53fa/aaron-rodgers.jpg",
    "tag": "Sports",
    "date": "2025-12-29T00:53:46.000Z",
    "description": "\n        Assists were the theme of Week 17 in the NFL. Various outcomes throughout the slate had ramifications that stretched beyond the two teams goi",
    "body": "\n        Assists were the theme of Week 17 in the NFL. Various outcomes throughout the slate had ramifications that stretched beyond the two teams going toe to toe and have begun reshaping the playoff picture in both conferences.On Christmas Day, the Vikings punched the Packers' ticket to the playoffs after defeating the Lions. On Saturday, the Texans not only clinched a playoff berth, but handed the AFC West title to the Broncos after defeating the Chargers. As we continued through Sunday's action, even more assists were dished out, most notably with the Seahawks and Browns pulling off wins against the Panthers and Steelers, respectively.Because of those outcomes (along with Miami defeating Tampa Bay), we could have two win-or-go-home division title matchups in Week 18: Ravens at Steelers for the AFC North and Panthers at Buccaneers for the NFC South. However, this NFC South matchup could have a wrench thrown into it depending on how the Falcons end their season. While out of the playoff race, if Atlanta wins out (vs. the Rams on Monday night and Saints), Carolina will win the division, regardless of the outcome of that matchup with the Bucs. That's due to the Panthers winning a tiebreaker because of a better head-to-head record among the three teams. In the late window on Sunday, the Eagles lent a helping hand to the Patriots, securing the AFC East crown for New England after Philly took down the Bills in Buffalo. \nOn top of those matchups, the No. 1 seeds in both conferences are still up for grabs, so we're in for quite the finish. As we wrap up the bulk of Sunday's action leading into \"Sunday Night Football,\" here's a look at the current playoff picture. AFC standingsz-Denver Broncos (13-3)z-New England Patriots (13-3)x-Jacksonville Jaguars (12-4)Pittsburgh Steelers (9-7)x-Houston Texans (11-5)x-Los Angeles Chargers (11-5)x-Buffalo Bills (11-5)x-clinched playoff berth; z-clinched division\n                            \n    \n                                                \n                    \n    1. Denver Broncos (13-3)Remaining schedule: vs. ChargersDenver got back to its winning ways with a key victory over the Kansas City Chiefs on Christmas night. With the win, the Broncos remain the No. 1 seed in the conference and are now the AFC West division winners after the Texans beat the Chargers.\n                            \n    \n                                                \n                    \n    2. New England Patriots (13-3)Remaining schedule: vs. DolphinsThe Patriots had already clinched a playoff berth in Week 16, and are now AFC East champions thanks to the events of Week 17. They did their part earlier on Sunday by blowing out the Jets, and then the Eagles fended off the Bills to lock up the division. New England is also still alive for the No. 1 seed. \n\n                            \n    \n                                                \n                    \n    3. Jacksonville Jaguars (12-4)Remaining schedule: vs. TitansThe Jaguars fended off the Colts in Week 17 and can clinch the AFC South next week with a win over the Titans.  \n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (9-7)Remaining schedule: vs. RavensAfter falling to the Browns in Week 17, the Steelers face a do-or-die matchup with the Ravens in Week 18. \n                            \n    \n                                                \n                    \n    5. Houston Texans (11-5)Remaining schedule: vs. ColtsAfter starting the year 0-3, the Texans have won eight straight games to punch their ticket to the playoffs. Houston extended that winning streak with a victory over the Chargers on the road and remains alive in the AFC South race. \n\n                            \n    \n                                                \n                    \n    6. Los Angeles Chargers (11-5)Remaining schedule: at BroncosThe Chargers had their four-game winning streak snapped with a Saturday afternoon loss against the Texans. They are likely to rest players in Week 18 and prepare for a road opener. \n                            \n    \n                                                \n                    \n    7. Buffalo Bills (11-5)Remaining schedule: vs. JetsThe Bills' defeat at the hands of the Eagles in Week 17 officially eliminated them from winning the AFC East and has dropped them to the No. 7 seed. The Bills have already clinched a playoff berth, so it'll be interesting to see if they opt for rest over seed positioning in Week 18. In the huntThe Ravens (8-8), with Lamar Jackson sidelined, kept their playoff hopes alive with an impressive road win against the Packers in Green Bay. Then, on Sunday, they had their prayers answered with the Browns upsetting Pittsburgh. That sets up a winner-take-all matchup in the AFC North against the Steelers in Week 18. The loser will be eliminated from playoff contention. \nNFC standingsx-Seattle Seahawks (13-3)z-Chicago Bears (11-4)z-Philadelphia Eagles (11-5)Carolina Panthers (8-8)x-San Francisco 49ers (11-4)x-Los Angeles Rams (11-4)x-Green Bay Packers (9-6-1)x-clinched playoff berth; z-clinched division  \n                            \n    \n                                                \n                    \n    1. Seattle Seahawks (13-3)Remaining schedule: at 49ersSeattle pulled off an incredible, come-from-behind win over the Rams on \"Thursday Night Football,\" elevating itself to the No. 1 seed in the conference in the process. They continued to hold that top spot in the conference after taking down the Panthers in Week 17. So long as they take down the 49ers in Week 18, they'll win the NFC West and be the No. 1 seed. \n                            \n    \n                                                \n                    \n    2. Chicago Bears (11-4)Remaining schedule: at 49ers, vs. LionsThe Bears are coming off a stunning comeback win over the Packers in Week 16, and they remain in the hunt for the NFC's No. 1 seed. Thanks to the Packers' loss to the Ravens, Chicago has officially clinched the NFC North title.   \n                            \n    \n                                                \n                    \n    3. Philadelphia Eagles (11-5)Remaining schedule: vs. CommandersPhiladelphia punched its playoff ticket in Week 16 with a commanding victory over the Commanders. The defending Super Bowl champions became the first team to win back-to-back NFC East crowns since 2004. After outlasting the Bills in Week 17, the Eagles are merely fighting for seeding in the regular-season finale\n\n                            \n    \n                                                \n                    \n    4. Carolina Panthers (8-8)Remaining schedule: at BuccaneersAfter losing to the Seahawks, Carolina is potentially faced with a winner-take-all matchup in Tampa in Week 18 against the Buccaneers. However, if the Falcons (who play the Rams on Monday night) win their final two games, that would trigger a tiebreaking scenario that falls in favor of the Panthers, who'd have the better head-to-head record in this three-way tie. That situation would render the results of Carolina's Week 18 matchup moot. If Atlanta falls to L.A. on Monday night, however, then the contest would be for the division crown. \n\n                            \n    \n                                                \n                    \n    5. San Francisco 49ers (11-4)Remaining schedule: vs. Bears, vs. SeahawksThe 49ers are quietly lurking in the NFC playoff race and clinched a postseason berth after the Lions fell to the Steelers. San Francisco jumped the Rams into the No. 5 spot after walloping the Colts on \"Monday Night Football,\" and it's positioned to climb even higher over the final two weeks.If the 49ers beat the Bears and Seahawks to close out the season, they'll secure the No. 1 seed and the conference's lone first-round bye.\n                            \n    \n                                                \n                    \n    6. Los Angeles Rams (11-4)Remaining schedule: at Falcons, vs. CardinalsThe Rams are still a playoff lock thanks to their win in Week 15, but their chances of winning the NFC West and claiming the No. 1 seed in the conference were dramatically reduced by their loss to the Seahawks in Week 16. They need Seattle to lose to the 49ers in Week 18, but also need the 49ers to lose to the Bears. Otherwise, San Francisco would be the top seed in the conference by virtue of having the best division record among the three teams. \n\n                            \n    \n                                                \n                    \n    7. Green Bay Packers (9-6-1)Remaining schedule: at VikingsGreen Bay, minus Jordan Love, fell to Derrick Henry and the Ravens on Saturday night. The loss ended any hopes of winning the NFC North title and locked Green Bay into the NFC's No. 7 seed.In the huntThe Buccaneers (7-9) have experienced a dramatic fall from grace in this second half of the season. Even after losing to the Dolphins in Week 17, however, they still have an opportunity to jump up to the No. 4 seed as the NFC South champion. To do that, the Bucs need to win their Week 18 contest against the Panthers and have the Falcons lose one of their final two games. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff picture: Ravens at Steelers to decide AFC North in Week 18 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/29afc77b-d509-4b16-a13e-1e4f981f79fd/thumbnail/1200x675/51b5340fc734f048ff141f4492af53fa/aaron-rodgers.jpg"
      ],
      "datePublished": "2025-12-29T00:53:46.000Z",
      "dateModified": "2025-12-29T00:53:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TreVeyon Henderson among Week 17 NFL injuries bettors need to know - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-week-17-injury-report-injuries-for-bettors-to-know-include-treveyon-henderson/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/af98ef3e-bf37-4fb4-b709-ff1245354c74/thumbnail/1200x675/0f2b540740d60034c95d45a86cefd9cc/treveyon-henderson-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-28T22:01:25.000Z",
    "description": "\nWe've reached the penultimate week of the 2025 NFL season, and as some teams are trying to improve their playoff positioning, others are trying to ju",
    "body": "\nWe've reached the penultimate week of the 2025 NFL season, and as some teams are trying to improve their playoff positioning, others are trying to just get across the finish line after disappointing campaigns. Injuries are playing a major part of the Week 17 schedule, and bettors looking to place NFL bets for Week 17 need to know the most important NFL injuries of the week, as well as what NFL betting lines look like per the latest DraftKings Sportsbook odds. We will update this post with inactives lists for every team prior to kickoff.Seahawks at Panthers (1 p.m. ET)No major injuries of note\nBoth teams are in good shape in the health department for this pivotal Week 17 clash. The Seahawks are in the driver's seat for both the NFC West crown as well as the No. 1 seed in the conference. Carolina knocked off Tampa Bay last week and, with a win and Bucs loss this week, could clinch the NFC South. Otherwise, Week 18 could be a massive matchup for the division title. Seattle is favored by 7. The total is 42.5.Buccaneers at Dolphins (1 p.m. ET)No major injuries of note\nBoth teams have a few players banged up here, but none that move the needle when it comes to betting lines. The Bucs are a game behind the Panthers in the NFC South and, with a win, would ensure that Week 18's rematch with Carolina has high stakes. The Buccaneers are 5.5-point favorites, and the total is 44.5Patriots at Jets (1 p.m. ET)NE RB TreVeyon Henderson (concussion, available)NE WR Kayshon Boutte (concussion, out) NYJ TE Mason Taylor (neck, out)\nNew England standout running back TreVeyon Henderson has cleared concussion protocol for Sunday while New York is again without tight end Mason Taylor, who was a rare bright spot in a trying year for the Jets. Explosive Patriots receiver Kayshon Boutte is out with a concussion. The Pats are massive 13.5-point favorites, and the total is 42.5.Steelers at Browns (1 p.m. ET)CLE RB Quinshon Judkins (ankle, out for year)CLE RB Dylan Sampson (hand, available)CLE TE Harold Fannin Jr. (groin, available)CLE TE David Njoku (knee, out)PITT LB T.J. Watt (lung, out)\nThe Browns are looking to play spoiler here, and their offense is hurting. Star rookie back Quinshon Judkins is out for the year after ankle surgery, so fellow rookie Dylan Sampson is the team's RB1 this week. He's active after missing the last two games. David Njoku is out again with a knee injury and fellow tight end, standout rookie Harold Fannin Jr., is good to play. The Steelers will still be without T.J. Watt this week after the star edge rusher underwent surgery to repair a collapsed lung. He returned to practice this week but will not suit up until Week 18 at the earliest. Pittsburgh is a 3-point favorite on the road, and the total is 34.5 -- the lowest of Week 17.  Jaguars at Colts (1 p.m. ET)IND CB Sauce Gardner (calf, available)\nThe Jags are relatively healthy here, while the Colts, who started the year 8-2, are trying to win out and get some help to sneak into the postseason as a wild card team. Indianapolis traded two first-round picks at the deadline for cornerback Sauce Gardner, who will return to the lineup after a lengthy absence. The Jaguars can clinch the AFC South with a win here if the Texans also lose to or tie with the Chargers on Saturday. Jacksonville is a 5.5-point favorite. The total is 48.5.Saints at Titans (1 p.m. ET)NO RB Alvin Kamara (knee and ankle, out)NO WR Chris Olave (back, available)\nThe Saints will again be without standout running back Alvin Kamara, though they found an interesting replacement last week in tight end/quarterback/running back hybrid Taysom Hill, who had 78 yards from scrimmage and also a passing score to Chris Olave, who is good to go after being listed as questionable.The Saints are favored by 2.5, and the total is 39.5.Cardinals at Bengals (1 p.m. ET)ARI S Budda Baker (concussion and thumb, out)ARI WR Marvin Harrison Jr. (heel, available)\nBoth teams have crowded injury reports, but the Cardinals continue to have some awful luck in that department for Week 17. Star safety Budda Baker is out, putting a dent in an already poor Arizona defense. The offense got Marvin Harrison Jr. back last week and he's active again this week despite battling a heel injury. The Bengals are 7.5-point favorites. The total is 53.5 -- the highest of the week.Giants at Raiders (4:05 p.m. ET)LV DE Maxx Crosby (knee, out)LV TE Brock Bowers (knee, out for year)\nStar Raiders edge rusher Maxx Crosby is out this week against the Giants, and there's reportedly drama between him and the team. Per Ian Rapoport of NFL Network, the Raiders told Crosby they wanted to shut him down for the remaining two games, and he disagreed and left the facility. Additionally, the team placed second-year tight end Brock Bowers on season-ending injured reserve this week.New York is a slim 1.5-point favorite. The total is 41.5.Eagles at Bills (4:25 p.m. ET)BUF TE Dalton Kincaid (knee, out)BUF TE Dawson Knox (knee, available)PHI OT Lane Johnson (knee, foot, out)\nBuffalo will roll with Dawson Knox as the starting tight end while Dalton Kincaid remains out for this potential Super Bowl preview against last year's champs, the Eagles. Philadelphia will get star defensive tackle Jalen Carter back after a brief absence, but it won't have right tackle Lane Johnson once again. Buffalo is a 1.5-point favorite, and the total is 43.5.Bears at 49ers (8:20 p.m. ET)CHI WR Rome Odunze (foot, out)SF TE George Kittle (ankle, questionable)SF WR Ricky Pearsall (knee, questionable)\nThis potential NFL playoff preview has a few big-name pass catchers out or questionable. The Bears will again be down second-year receiver Rome Odunze as he battles a foot injury, and Chicago will certainly be aiming to get him back for the postseason. As for the 49ers, star tight end George Kittle is questionable after not practicing all week while receiver Ricky Pearsall is in danger of missing his ninth game of the year. San Francisco is favored by 3, and the total is 52.5.Rams at Falcons (8:15 p.m. ET, Monday)LAR WR Davante Adams (hamstring, doubtful)ATL WR Drake London (knee, questionable)\nAll eyes are on the status of two star receivers as Davante Adams, who leads the NFL in touchdown receptions, is doubtful for the Rams after missing last week's loss to Seattle while Drake London is questionable for Atlanta as he continues to battle a nagging knee injury. The Rams can help themselves in two ways on Sunday as a win helps their playoff standing and also pushes the Falcons further up the NFL Draft order, which is good for L.A. as the team owns Atlanta's first-round pick in April.Los Angeles is a 7.5-point road favorite. The total is 49.5.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TreVeyon Henderson among Week 17 NFL injuries bettors need to know - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/af98ef3e-bf37-4fb4-b709-ff1245354c74/thumbnail/1200x675/0f2b540740d60034c95d45a86cefd9cc/treveyon-henderson-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2025-12-28T22:01:25.000Z",
      "dateModified": "2025-12-28T22:01:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 17 overreactions: Steelers will miss playoffs? Giants should've tanked? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-17-overreactions-packers-defense-their-playoff-demise-steelers-let-afc-north-slip-away/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/91b14bd0-4612-46b9-986c-a9061f3b5b8a/thumbnail/1200x675/f42bc0b76a846b256679fb7e5c7b651c/steelers-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-12-29T00:15:54.000Z",
    "description": "\n        It's fitting that over the Christmas slate, it was the season of giving in the NFL in Week 17. Various teams were able to help one another ou",
    "body": "\n        It's fitting that over the Christmas slate, it was the season of giving in the NFL in Week 17. Various teams were able to help one another out en route to securing playoff spots. For instance, the Vikings taking down the Lions clinched a playoff berth for the Packers, while Houston's victory over the Chargers clinched the AFC West for the Broncos, along with punching their own ticket to the postseason. On top of those games, Cleveland's upset of the Steelers on Sunday has now set up winner-take-all divisional matchups in Week 18 between Baltimore and Pittsburgh. There's been plenty of movement in the playoff picture in the NFL due to the results of Week 17, and a ton of storylines that have spilled out because of it. As we do every week, we're going to dive into some of the more noteworthy items from Week 17 and determine which storylines we should take seriously and which others are mere overreactions.  Giants should've tanked vs. Raiders for No. 1 pickOverreaction or reality: OverreactionEntering Week 17, the Giants were in possession of the No. 1 overall pick at the 2026 NFL Draft, with the Raiders right behind them holding the No. 2 pick. Those positions have since flipped after New York defeated Las Vegas on Sunday, putting the Raiders in pole position to secure the top pick, so long as they lose in Week 18 to Kansas City. From the Las Vegas side of things, it doesn't seem like they put their best foot forward leading up to this matchup, putting the likes of Brock Bowers and Maxx Crosby on injured reserve before Sunday. \nSome argue that New York should've followed suit and essentially tanked this game in order to secure the No. 1 pick. While I get the logic, I don't believe the Giants should've gone that route. While holding the top pick at the draft his extremely valuable, especially when you already have your franchise quarterback, the messaging behind such an effort doesn't set a great foundation for this rebuild. New York will have a high pick this spring regardless, and not laying down in this type of game will help them in the long run even if it stings in the moment. Steelers effectively lost AFC North after upset to BrownsOverreaction or reality: RealityOf course, Pittsburgh technically still has an opportunity to claim the division title with a win at home next week against the Ravens. That said, it feels like the Steelers effectively let it slip through their fingers in Week 17 with this loss to Cleveland. \nEven if Baltimore turns to Tyler Huntley with Lamar Jackson still injured, the veteran showed us this week that he's more than capable of entering a hostile road environment and putting together a winning performance. And if Derrick Henry keeps his current pace going, it'll be an uphill climb for Pittsburgh. Already, the early lines have Baltimore as a three-point road favorite. \nDrake Maye locked up MVP award after thrashing JetsOverreaction or reality: OverreactionDrake Maye was on another level in Week 17. He became the first quarterback in NFL history to complete at least 90% of his passes, while throwing for at least 250 yards and five touchdowns in a game. Video game-like numbers for the Patriots QB. While it was awe-inspiring to behold, it may not have vaulted him up to securing the MVP award just yet. \nAt DraftKings Sportsbook, Maye is still second in the MVP odds at +180 and looking up to Matthew Stafford, who is a -225 favorite at the moment. Stafford and the Rams play on Monday night, and if he struggles in that contest, it could open the door for Maye to leapfrog him. But this performance alone doesn't move the needle entirely in favor of Maye to win MVP, as incredible as it was.  \n        \n            \n                NFL playoff picture: Ravens-Steelers to decide AFC North in Week 18; Panthers have two paths to postseason\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nMike McDaniel has taken himself off the hot seatOverreaction or reality: RealityThere was a point this season when it felt like an absolute certainty that Mike McDaniel was going to be let go by the Miami Dolphins at some point, whether it be midseason or at the end of the year. However, the coach has rather remarkably cooled his seat to the point where it feels like he's saved his job entirely. \nAfter a 1-6 start to the year, the Dolphins have won six of their last nine games to improve to 7-9 on the season, and while the playoffs are not in the cards in 2025, they have shown fight, including in a Week 17 win over the Buccaneers. There, Quinn Ewers even popped under McDaniel's guidance as the rookie quarterback completed 14 of his 22 throws for 172 yards and two touchdowns. \nMaking the move off of Tua Tagovailoa and showing that he can help mold a young quarterback like Ewers should only embolden the Miami decision-makers to keep McDaniel around for 2026.  Lions have a Jared Goff problemOverreaction or reality: OverreactionThe Detroit Lions are officially eliminated from playoff contention after falling to the Max Brosmer-led Minnesota Vikings, 23-10, on Christmas. It was a horrendous day for Jared Goff, who finished the contest with five total turnovers. \nGiven how bad Goff was in this game, it has led to some questions about whether or not the 31-year-old's better days are behind him. While Goff certainly contributed to this final nail being put into the Lions' coffin, I don't see him as the main culprit for their demise in 2025. That's largely been due to injuries across the roster and their inability to adequately replace Ben Johnson at offensive coordinator. Dan Campbell had to take over offensive play-calling duties midseason, and it feels like the unit never really found its footing. If they can figure out a path where they get better play-calling on offense to allow Campbell to resume his CEO-like role of the organization, Detroit should be back competing in 2026 and Goff back as one of the more prolific quarterbacks in the league. Green Bay's decline on defense will be its undoingOverreaction or reality: RealityThe Packers had no answer defensively during Saturday's 41-24 loss to the Ravens. With Lamar Jackson sidelined for this game and Tyler Huntley starting, Baltimore was pretty one-dimensional offensively as simply leaned on Derrick Henry, who exploded for 216 yards and four touchdowns. \nWhile Henry is a generational talent, one has to imagine he was the main focal point throughout the week of prep for this defense, and the fact that they had no answer for him continues to raise concerns about this defense as we look toward the postseason. That's particularly true after this loss gave the NFC North crown to the Chicago Bears, meaning Green Bay will be on the road in the playoffs. This season, Green Bay is allowing 25.3 points per game on the road compared to 17.9 points per game at Lambeau Field.    \nBroncos barely defeating depleted Chiefs shows they're fraudulent Overreaction or reality: OverreactionDenver moved to 13-3 on the season with a win over the Chiefs, but it wasn't the most impressive feat. Kansas City was dramatically banged up for this game and needed to start third-stringer Chris Oladokun at quarterback. Despite that, the Broncos needed to orchestrate a 14-play drive that concluded with Bo Nix finding RJ Harvey for a go-ahead touchdown after the two-minute warning to fend off the upset. \nThe fact that it came to that for a team that has the inside track on the No. 1 seed raises some concerns about whether the Broncos are truly the team to beat in the AFC. However, I think the Broncos are still a force to be reckoned with. These one-score wins are just what they do, as this marked the 11th time Denver has registered a one-score victory this season (tied for the most in NFL history). Nix is good enough to make timely throws when his team needs it, and the defense is still among the very best in the league, which is a dangerous combination.  C.J. Stroud's slow finish vs. Chargers cause for concernOverreaction or reality: RealityLost in the shuffle of Saturday's playoff-clinching win for the Texans was a bit of regression from C.J. Stroud. If you periodically checked in, you probably saw the Houston QB uncork two long touchdowns to build a 14-0 lead. Over those first two drives, Stroud completed all four of his passes for 142 yards and two touchdowns for a perfect passer rating. While that's sensational, Stroud then nosedived after that, throwing for just 83 more yards and two interceptions. \nC.J. Stroud vs. ChargersFirst two drivesLast 11 drivesTeam points146Completions/Attempts4/411/23Passing yards14283TD-INT2-00-2Passer rating158.320.7The turnovers are the most alarming development, as Stroud and the Texans offense had been superb at protecting the football during their resurgence. In the past 12 games after starting 0-3, the Texans offense had a league-low five giveaways entering Week 17. If this is an early sign of regression in that department, it could be ill-timed as the Texans look to crash the playoff party in the AFC. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 17 overreactions: Steelers will miss playoffs? Giants should've tanked? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/91b14bd0-4612-46b9-986c-a9061f3b5b8a/thumbnail/1200x675/f42bc0b76a846b256679fb7e5c7b651c/steelers-jpeg.jpg"
      ],
      "datePublished": "2025-12-29T00:15:54.000Z",
      "dateModified": "2025-12-29T00:15:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Steelers vs. Browns picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-browns-where-to-watch-nfl-week-17-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cfb96964-edbb-4b6f-8d23-47acd73bd88e/thumbnail/1200x675/0637b5196e530e2f6256d025ea676eb9/aaron-rodgers-steelers.jpg",
    "tag": "Sports",
    "date": "2025-12-28T17:08:37.000Z",
    "description": "\nThe Cleveland Browns are looking at another high draft pick but they won't pass up a chance to be a thorn in the side of the Pittsburgh Steelers in t",
    "body": "\nThe Cleveland Browns are looking at another high draft pick but they won't pass up a chance to be a thorn in the side of the Pittsburgh Steelers in their Week 17 matchup. The Browns (3-12) have lost seven of their past eight, but quarterback Shedeur Sanders and defender Myles Garrett, who is one sack from setting the NFL season record, are reason enough to watch. The Steelers held on to beat the Detroit Lions in Week 16 and have all but sealed the AFC North title, with the Ravens two games back with two to play. Pittsburgh hosts Baltimore in Week 18 but can clinch the division with a victory Sunday.Kickoff from Huntington Bank Field is set for 1 p.m. ET on CBS and Paramount+. The Steelers are 3.5-point road favorites in the latest Steelers vs. Browns odds from DraftKings, while the over/under for total points scored is 35.5. Pittsburgh's over/under for total team points is 19.5, while Cleveland's is 15.5. Before making any Browns vs. Steelers picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Steelers vs. Browns on SundayWhen: Sunday, Dec. 28Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppSteelers vs. Browns betting previewOdds: Steelers -3.5, Over/Under 33.5The Steelers are 8-7 against the spread this season, while Cleveland is 6-9 ATS after failing to cover in five straight to end last season. Pittsburgh has won six of the past nine meetings between the division rivals and is 15-4 ATS in its past 19 games against AFC North teams. The total has gone Over in five of Cleveland's last six games at home and in four of the Steelers' past five on the road.Steelers vs. Browns SGPSteelers -3.5Over 35.5Shedeur Sanders Over 17.5 pass completionsBet it at DraftKings:\nModel's Steelers vs. Browns score prediction, picksThe model projects that the Steelers will get a relatively comfortable victory and has them covering the spread in 53% of its simulations. The Over hits 54% of the time, as the model expects the Browns to take to the air with star rookie running back Quinshon Judkins out for the rest of the season. Sanders has gone Over his completions projection four times in his five starts, and the props model is projecting him for 19.5 completions on Sunday.Steelers vs. Browns score prediction: Steelers 22, Browns 16Want more Week 17 NFL picks?You've seen the model's best bets for Pittsburgh Steelers vs. Cleveland Browns. Now, get against the spread, total and money-line picks for every Week 17 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Steelers vs. Browns picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cfb96964-edbb-4b6f-8d23-47acd73bd88e/thumbnail/1200x675/0637b5196e530e2f6256d025ea676eb9/aaron-rodgers-steelers.jpg"
      ],
      "datePublished": "2025-12-28T17:08:37.000Z",
      "dateModified": "2025-12-28T17:08:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]