[
  {
    "title": "Western Kentucky vs. Southern Miss prediction, odds: 2025 New Orleans Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/western-kentucky-southern-miss-prediction-odds-time-2025-new-orleans-bowl-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/6bc8d58a-7157-481c-a8c1-034997ccb966/thumbnail/1200x675/e030aed25afdc3802de6edc942ea0922/braylon-braxton-southern-miss-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-23T19:12:16.000Z",
    "description": "\n        A Tuesday college football bowl tripleheader has the Western Kentucky Hilltoppers taking on Southern Miss Golden Eagles in the middle matchup",
    "body": "\n        A Tuesday college football bowl tripleheader has the Western Kentucky Hilltoppers taking on Southern Miss Golden Eagles in the middle matchup. It's the 2025 New Orleans Bowl as the former Conference USA rivals will renew acquaintances. WKU (8-4) has dropped back-to-back games, both coming by three points, while Southern Miss (7-5) is on a three-game losing streak. The Hilltoppers are 4-0 all-time versus the Golden Eagles. Blake Anderson, who was promoted from offensive coordinator to head coach, will lead Southern Miss both in this game and going forward after Charles Huff left for Memphis. Kickoff is at 5:30 p.m. ET from the Caesars Superdome in New Orleans. After opening as slight underdogs, the Golden Eagles are now 1.5-point favorites in the latest Southern Miss vs. Western Kentucky odds, while the over/under is 58.5. Before making any Western Kentucky vs. Southern Miss picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Southern Miss vs. WKU. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for WKU vs. Southern Miss:Southern Miss vs. Western Kentucky spreadSouthern Miss -1.5 at DraftKings SportsbookSouthern Miss vs. Western Kentucky over/under58.5 pointsSouthern Miss vs. Western Kentucky money line Southern Miss -125, WKU +106Southern Miss vs. Western Kentucky picksSee picks at SportsLineSouthern Miss vs. Western Kentucky streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Western Kentucky vs. Southern Miss picksAfter simulating Southern Miss vs. Western Kentucky 10,000 times, SportsLine's model is going Under on the total (57.5 points).The Under is 6-3 over the last nine Western Kentucky games, while the Under has also hit in three out of the last four Southern Miss contests. Additionally, facing unfamiliar opponents have trended towards the total not being reached for both programs. The Under is 6-3 over WKU's last nine non-conference games, while it's 5-3 for the Golden Eagles when playing out-of-conference opponents.While both teams are projected to pile up heavy yardage, that doesn't necessarily mean lots of points due to the turnover factor. The teams are projected to combine for 3.5 turnovers, on average, which stunts many drives. With that, the game is forecasted to hit the Under more than 60% of the time.The model also says one side of the spread hits well over 60% of the time. You can see the model's pick at SportsLine.  So who wins Western Kentucky vs. Southern Miss, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Southern Miss vs. Western Kentucky spread to jump on, all from the advanced model that's up on its top-ranked money-line picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Western Kentucky vs. Southern Miss prediction, odds: 2025 New Orleans Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/6bc8d58a-7157-481c-a8c1-034997ccb966/thumbnail/1200x675/e030aed25afdc3802de6edc942ea0922/braylon-braxton-southern-miss-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-23T19:12:16.000Z",
      "dateModified": "2025-12-23T19:12:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louisville vs. Toledo prediction, odds, time, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/louisville-toledo-prediction-odds-spread-time-2025-boca-raton-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/4c9d84ef-781e-4bae-b1e5-7f8b04a7a6f2/thumbnail/1200x675/d51733920cdebae6dd7f8fe8153b3dcd/jeff-brohm-louisville-cardinals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T17:10:15.000Z",
    "description": "\n        The Toledo Rockets will take on coach Jeff Brohm and the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed",
    "body": "\n        The Toledo Rockets will take on coach Jeff Brohm and the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed out the regular season with a 21-3 win at Central Michigan on Nov. 29, while Louisville downed Kentucky 41-0 that same day. The Rockets (8-4), who tied for second in the MAC at 6-2, have won four in a row. They'll be led by interim head coach Robert Weiner after Jason Candle left for UConn. The Cardinals (8-4), who tied for seventh in the ACC, have lost three of four. Toledo quarterback Tucker Gleason is not expected to play after being injured in the regular-season finale. Louisville defensive linemen Rene Konga and Wesley Bailey have both opted out of this game, while leading receiver Chris Bell is out with an injury. Kickoff from Flagler Credit Union Stadium in Boca Raton, Fla., is at 2 p.m. ET. After opening at -9.5, the Cardinals are now 11.5-point favorites in the latest Louisville vs. Toledo odds, while the over/under for total points scored is 43.5 via SportsLine consensus. Before making any Toledo vs. Louisville picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Toledo vs. Louisville. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Louisville vs. Toledo:Toledo vs. Louisville                                                                                                                                         spreadLouisville -11.5 at DraftKings SportsbookToledo vs. Louisville                                                                                                                                     over/under43.5 pointsToledo vs. Louisville                                                                                                                                                                                                                                                     money line Louisville -431, Toledo +334Toledo vs. Louisville                                                                                                                                                                                                                                             picksSee picks at SportsLineToledo vs. Louisville                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Toledo vs. Louisville picksAfter 10,000 simulations of this matchup, SportsLine's model is going Over on the total (43.5). The Over has hit in four of Toledo's last seven games, and in four of Louisville's last 10.The model has Toledo running backs Chip Trayanum and Connor Walendzak combining to rush for more than 110 yards and one touchdown, while Louisville quarterback Miller Moss will throw for more than 250 yards and two touchdowns. The teams are projected to combine for 51 points as the Over clears in well over 60% of simulations.The model also also says one side of the spread is the better value. You can see the model's pick at SportsLine.  So who wins Louisville vs. Toledo, and which side of the spread is the better value? Visit SportsLine now to see which side of the Toledo vs. Louisville spread to jump on, all from the advanced model that's simulated this matchup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisville vs. Toledo prediction, odds, time, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/4c9d84ef-781e-4bae-b1e5-7f8b04a7a6f2/thumbnail/1200x675/d51733920cdebae6dd7f8fe8153b3dcd/jeff-brohm-louisville-cardinals-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T17:10:15.000Z",
      "dateModified": "2025-12-23T17:10:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 17 Fantasy football rankings, playoff lineup picks, start-sit projections from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-rankings-championshipprojections-lineups-sleepers-streamers-nfl-week-17/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/7df5f509-2669-485e-8bb8-ddcdcf01055d/thumbnail/1200x675/7755fc062c6ab95213e551b44b8f0e78/imagn-colby-parkinson-rams.jpg",
    "tag": "Sports",
    "date": "2025-12-23T15:57:46.000Z",
    "description": "\n        Week 17 is the championship in a vast majority of Fantasy football leagues, so it's the biggest week for Fantasy lineup decisions of the year",
    "body": "\n        Week 17 is the championship in a vast majority of Fantasy football leagues, so it's the biggest week for Fantasy lineup decisions of the year for those who have made it thus far. In 2024, the players who had starred all year also showed up in the penultimate week as Joe Burrow, Saquon Barkley, Derrick Henry and Trey McBride were among the stats leaders. This year, it's the likes of Josh Allen, Jonathan Taylor and Puka Nacua who have excelled and remain must-starts as Week 17 Fantasy football picks.As for your Fantasy football start/sit decisions, targeting players on teams with something to play for that are facing teams out of playoff contention could be the way to go. So, the likes of Jaylen Warren, Baker Mayfield, Bucky Irving and Stefon Diggs may find themselves a bit higher in the Week 17 Fantasy football projections than expected. Before making your Week 17 Fantasy football picks, be sure to check out the Week 17 Fantasy football rankings from the proven computer model at SportsLine. Bet on every NFL Week 17 game at DraftKings Sportsbook, where new users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 initial wager wins:When it comes to ranking players, SportsLine's model beat human experts in Fantasy football for the past several seasons, especially when there were big differences in ranking. Over the course of a season, that could literally be the difference between winning your league or going home empty-handed.The same model has a proven track record providing Fantasy football tips, including being ahead of the curve on players like A.J. Brown, Jonathan Taylor, Derrick Henry, Christian McCaffrey, Alvin Kamara and Jahmyr Gibbs. Anybody who banked on players like those could have made a run at their league title.Now, the model, which simulates every NFL game 10,000 times, has revealed its Fantasy football rankings for Week 17 of the 2025 NFL season. Head to SportsLine now to see them. New users can also check out the latest FanDuel promo code and get $250 in bonus bets instantly at FanDuel if your $5 bet wins. Top Week 17 Fantasy football picks One surprise in Week 17: The model is fading Jags wideout Brian Thomas Jr., a Pro Bowler last year who finished third in receiving yards. Thomas has been a top-25 Fantasy receiver over the last three weeks, but this has been his best stretch all season as inconsistency has defined his sophomore year. He had a season-low of 18 yards last week, as both Parker Washington and Jakobi Meyers have passed Thomas in the eyes of Trevor Lawrence, as those two are averaging more receptions and yards over the last month. Thomas may not warrant a spot in Week 17 Fantasy football lineups as he sits outside the top 30 in wide receiver rankings.Another curveball: The model is high on Rams tight end Colby Parkinson, despite him being the TE22 on the season and being started in just 38% of leagues this week. Parkinson has quietly performed as the TE6 since Week 10 as he's made the most of Tyler Higbee going on injured reserve. The former has six touchdowns over his last seven games while averaging 35.9 receiving yards over this stretch. He should continue that success on Monday night versus a Falcons defense which just allowed 11 catches and 118 yards to the tight end position on Sunday, which came a week after giving up a tight end touchdown. For more start/sit Fantasy football advice, be sure to check out the rest of the Week 17 Fantasy football rankings.New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2  in select states.How to set Week 17 Fantasy football rankingsThe model is also calling for a surprising quarterback you aren't even thinking about to finish in the top eight of its Week 17 Fantasy football rankings, even slotted ahead the likes of Josh Allen and Matthew Stafford. This pick could be the difference between winning big and going home with nothing. See the model's entire Week 17 Fantasy football rankings for PPR and standard leagues here.So who should you start and sit this week, and which surprising quarterback could lead you to victory? Visit SportsLine now to get Week 17 Fantasy football rankings for every position, plus see which quarterback is going to come out of nowhere to crack the top eight all from the model that has outperformed experts big-time.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 17 Fantasy football rankings, playoff lineup picks, start-sit projections from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/7df5f509-2669-485e-8bb8-ddcdcf01055d/thumbnail/1200x675/7755fc062c6ab95213e551b44b8f0e78/imagn-colby-parkinson-rams.jpg"
      ],
      "datePublished": "2025-12-23T15:57:46.000Z",
      "dateModified": "2025-12-23T15:57:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Christmas Day: Top daily Fantasy lineups for FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-fanduel-draftkings-lineup-advice-projections-christmas-day-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/cc6985f7-8389-4a26-8f91-c0fa612d60b0/thumbnail/1200x675/381413dea5e5e55f08fdea48f01ba89b/george-pickens-cowboys-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-23T16:18:38.000Z",
    "description": "\nThe 2025 NFL Christmas Day tripleheader kicks off with Cowboys vs. Commanders at 1 p.m. ET, followed by Lions vs. Vikings at 4:30 p.m. ET, with Chief",
    "body": "\nThe 2025 NFL Christmas Day tripleheader kicks off with Cowboys vs. Commanders at 1 p.m. ET, followed by Lions vs. Vikings at 4:30 p.m. ET, with Chiefs vs. Broncos wrapping things up at 8:15 p.m. ET. Even with some notable quarterback injuries removing big names from the NFL DFS player pool, the slate is still loaded with high-quality options to target for NFL DFS lineups. Dak Prescott, CeeDee Lamb, Jahmyr Gibbs, Justin Jefferson and Travis Kelce are just some of the stars you could consider for your daily Fantasy football lineups.Big names, however, come equipped with big price tags, so you'll have to find balance with more affordable players as well. Those aforementioned QB injuries could make the likes of Chris Oladokun or Max Brosmer value-based Christmas NFL DFS picks. Before making any NFL DFS picks for Christmas, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure.You can also bet props like Prescott going over 1.5 passing touchdowns using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the Christmas NFL DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Christmas DayPart of McClure's NFL DFS strategy for Christmas is rostering Lions running back Jahmyr Gibbs at $8,300 on DraftKings and $9,400 on FanDuel. Gibbs ranks third amongst all running backs in Fantasy points for the second straight season. He ranks eighth in scrimmage yards (1,662) and second in total touchdowns (17) ahead of a matchup with a team he has historically dominated. Gibbs has nine touchdowns in five career games versus Minnesota while averaging 97.6 scrimmage yards. The Vikings have also been unable to stop any RBs from hitting paydirt recently as each of the last six offensive TDs that Minnesota has allowed have been to running backs. See who else to roster at SportsLine.You can also bet on Gibbs to go Over 113.5 rushing + receiving yards at DraftKings:\nAnother one of McClure's NFL DFS picks is Cowboys wideout George Pickens ($8,800 on FanDuel, $7,300 on DraftKings), who is coming off a 7-130-1 stat line and ranks third in the NFL with 1,342 receiving yards on the season. He's been as consistent as any receiver and has at least 78 yards or a touchdown in 12 of 15 games. He also has a salivating matchup against Washington, which has the No. 26 passing defense, and just two teams have allowed more passing touchdowns. Pickens had 82 yards against the Commanders earlier this year after having 91 yards and a score versus them last season. See more NFL DFS picks at SportsLine.Bet Pickens to go Over 79.5 receiving yards at DraftKings:\nHow to set Christmas Day NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on Christmas. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Christmas Day, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Christmas Day: Top daily Fantasy lineups for FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/cc6985f7-8389-4a26-8f91-c0fa612d60b0/thumbnail/1200x675/381413dea5e5e55f08fdea48f01ba89b/george-pickens-cowboys-cbs-imagn.jpg"
      ],
      "datePublished": "2025-12-23T16:18:38.000Z",
      "dateModified": "2025-12-23T16:18:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025-26 college football bowl confidence picks, predictions, optimal rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-confidence-pool-picks-rankings-playoff-quarterfinal-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/2776979e-d8b2-432b-b1c6-f30895e046ef/thumbnail/1200x675/619b7c499626522e9344dfda175bc102/jayden-maiava-usc-trojans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T17:33:43.000Z",
    "description": "\n        Eight 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries o",
    "body": "\n        Eight 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries or modifications as there are more than 30 matchups remaining to make college football bowl picks on before the curtain closes on this season. The biggest remaining college football spread has Utah as a 15.5-point favorite over Nebraska in the Las Vegas Bowl on Wednesday, Dec. 31. While putting faith in big favorites is a part of just about everyone's college football bowl confidence strategy, correctly predicting a couple upsets can give you a big edge in any football pools. Anticipated matchups outside of the CFP include Penn State vs. Clemson (-3), Vanderbilt (-5.5) vs. Iowa, Georgia Tech vs. BYU (-4.5), Tennessee vs. Illinois (+2.5) and Michigan vs. Texas (-7.5). Before making any college football predictions for bowl season, be sure to see the latest college football bowl confidence picks from SportsLine's proven model.New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting for confidence pools. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top 2025-26 college football bowl confidence picks  One of the model's most confident picks is that No. 16 USC (-6.5), who will have quarterback Jayden Maiava, gets a comfortable win over TCU in the Alamo Bowl on Dec. 30. USC went 9-3 in the regular season, with all three defeats coming versus ranked teams. TCU found itself in the Top 25 once -- back in September -- before having a pedestrian run through the Big 12 schedule, finishing 5-4. Even with the Horned Frogs playing in the easier conference than the Trojans, USC both averaged more points and allowed fewer points per game. USC sports a 32-9 (78%) straight-up record when favored since Lincoln Riley came aboard in 2022, as it is projected to easily take care of business in San Antonio. SportsLine's model has the Trojans prevailing 70% of the time. See all of the model's college football bowl confidence picks here.Another one of the bowl confidence predictions the model is high on: Northwestern (-10.5) handles Central Michigan in the GameAbove Sports Bowl on Dec. 26. Central Michigan struggled mightily against Power 4 opponents this year, losing 63-3 to Michigan and 45-17 to Pittsburgh. Northwestern went just 6-6 this year, but that was largely thanks to a very tough Big Ten schedule that included Oregon, Michigan, USC and Illinois. For comparison, Northwestern lost to Michigan by two points on a last-second field goal. The model has Northwestern winning nearly 80% of the time, making the Wildcats the clear side to back. See the rest of the college football bowl confidence predictions here. How to make college football bowl confidence picksThe model has also made the call on who wins every other bowl game. There are 11 teams that win at least 70% of the time, so you need to go big on those matchups, as well as 15 underdogs that win outright. You can get all the model's picks at SportsLine.So who wins every college football bowl game, and which matchups should you assign the most confidence points to? Check out the college football bowl schedule below, then visit SportsLine to see which teams to pick, all from a proven computer model that has simulated each bowl game 10,000 times, and find out.College football bowl schedule See every college football bowl game pick hereTuesday, Dec. 23 Boca Raton Bowl: Toledo vs. Louisville, 2 p.m. ET New Orleans Bowl: Western Kentucky vs. Southern Miss, 5:30 p.m. ET Frisco Bowl: UNLV vs. Ohio, 9 p.m. ET  Wednesday, Dec. 24 Hawaii Bowl: Cal vs. Hawaii, 8 p.m. ET  Friday, Dec. 26 GameAbove Sports Bowl: Central Michigan vs. Northwestern, 1 p.m. ET Rate Bowl: New Mexico vs. Minnesota, 4:30 p.m. ET First Responder Bowl: FIU vs. UTSA, 8 p.m. ET  Saturday, Dec. 27 Military Bowl: Pitt vs. East Carolina, 11 a.m. ET Pinstripe Bowl: Penn State vs. Clemson, noon ET Fenway Bowl: UConn vs. Army, 2:15 p.m. ET Pop-Tarts Bowl: Georgia Tech vs. BYU, 3:30 p.m. ET Arizona Bowl: Miami (OH) vs. Fresno State, 4:30 p.m. ET New Mexico Bowl: North Texas vs. San Diego State, 5:45 p.m. ET Gator Bowl: Virginia vs. Missouri, 7:30 p.m. ET Texas Bowl: LSU vs. Houston, 9:15 p.m. ET  Monday, Dec. 29 Birmingham Bowl: Georgia Southern vs. App. State, 2 p.m. ET  Tuesday, Dec. 30 Independence Bowl: Coastal Carolina vs. Louisiana Tech, 2 p.m. ET Music City Bowl: Tennessee vs. Illinois, 5:30 p.m. ET Alamo Bowl: USC vs. TCU, 9 p.m. ET  Wednesday, Dec. 31 ReliaQuest Bowl: Iowa vs. Vanderbilt, noon ET Sun Bowl: Arizona State vs. Duke, 2 p.m. ET Citrus Bowl: Michigan vs. Texas, 3 p.m. ET Las Vegas Bowl: Nebraska vs. Utah, 3:30 p.m. ET CFP quarterfinals/Cotton Bowl: Miami vs. Ohio State, 7:30 p.m. ETThursday, Jan. 1 CFP quarterfinals/Orange Bowl: Texas Tech vs. Oregon, noon ETCFP quarterfinals/Rose Bowl: Alabama vs. Indiana, 4 p.m. ETCFP quarterfinals/Sugar bowl: Ole Miss vs. Georgia, 8 p.m. ET Friday, Jan. 2 Armed Forces Bowl: Rice vs. Texas State, 1 p.m. ET Liberty Bowl: Navy vs. Cincinnati, 4:30 p.m. ET Holiday Bowl: Arizona vs. SMU, 8 p.m. ET Duke's Mayo Bowl: Wake Forest vs. Mississippi State, 8 p.m. ET\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025-26 college football bowl confidence picks, predictions, optimal rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/2776979e-d8b2-432b-b1c6-f30895e046ef/thumbnail/1200x675/619b7c499626522e9344dfda175bc102/jayden-maiava-usc-trojans-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T17:33:43.000Z",
      "dateModified": "2025-12-23T17:33:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football bowl game odds, 2025-26 CFP picks, best bets, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-playoff-quarterfinals-2025-odds-lines-spread-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/ea2a0c78-371b-4c66-999e-575142431072/thumbnail/1200x675/480c32aa41f872bbe017bc3f422ce027/ethan-grunkemeyer-penn-state-nittany-lions-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T16:29:07.000Z",
    "description": "\n        The 2025-26 college football bowl schedule has seen the CFP first round completed, and now the action continues Tuesday with three matchups. ",
    "body": "\n        The 2025-26 college football bowl schedule has seen the CFP first round completed, and now the action continues Tuesday with three matchups. Louisville is -11.5 in the Boca Raton Bowl against Toledo, Southern Miss is -1.5 in the New Orleans Bowl against WKU and UNLV is -6.5 in the Frisco Bowl against Ohio. Other college football bowl lines include Cal vs. Hawaii (-1.5) on Wednesday, New Mexico vs. Minnesota (-2.5) on Friday, and Penn State vs. Clemson (-3) on Saturday. The CFP quarterfinals then begin on New Year's Eve, with the No. 2 Ohio State Buckeyes favored by 9.5 points over the No. 10 Miami Hurricanes in the Cotton Bowl. Before locking in any college football bowl picks for those games or others, be sure to see the latest bowl and playoff college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for bowl seasonOne of the college football picks the model is high on during the 2025-26 college football bowl schedule: Penn State (+3, 48.5) covers against Clemson in the Pinstripe Bowl on Saturday, Dec. 27 at noon ET. Both schools vastly underperformed this year but had strong finishes, with each finishing the season 3-1 ATS. However, Dabo Swinney has lost four of his last six bowl games, with each defeat coming by at least 14 points. This year, his Tigers are averaging 28.7 points, which ranks 61st in the nation, while Penn State, despite playing in the much tougher Big Ten, ranks 37th nationally in scoring. Also, the location of this game in New York City favors a northeastern university like Penn State over Clemson from South Carolina. The Nittany Lions cover well over 60% of the time, while the model also says the Under hits in almost 60% of simulations. See which other picks the model likes here.\nAnother prediction: Missouri (-4, 44.5) covers versus No. 20 Virginia in the Gator Bowl on Dec. 27 in almost 60% of simulations. UVA is coming off an ACC Title Game loss to Duke, in which the Cavaliers would have made the CFP if they had won. Thus, you have to wonder about motivation now that they have to settle for a lesser bowl game, and Virginia has struggled in bowls to begin with, going 1-4 over the last 19 years. Mizzou has won back-to-back bowls under Eli Drinkwitz, and the Tigers' only losses this season came versus teams ranked in the top 10 of the AP Poll at the time. Missouri is 4-1 ATS at neutral sites since Drinkwitz took over in 2020, and the Tigers are 12-4 ATS as favorites since the start of last season. See the rest of the model's picks here.How to make college football picks for bowl seasonThe model has also made the call on who wins and covers in every 2025-26 college football bowl game, and it's calling for five underdogs to outright win in bowl matchups of power conference teams. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which five underdogs are projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.2025-26 college football bowl odds (through 12/27)See full college football bowl picks, odds, predictions here(odds subject to change)Tuesday, Dec. 23Boca Raton Bowl: Toledo vs. Louisville (-11.5, 43.5)New Orleans Bowl: Western Kentucky vs. Southern Miss (-1.5, 58.5)Frisco Bowl: UNLV vs. Ohio (+6.5, 66.5)Wednesday, Dec. 24Hawaii Bowl: Cal vs. Hawaii (-1.5, 51.5)Friday, Dec. 26GameAbove Sports Bowl: Central Michigan vs. Northwestern (-10.5, 43.5)Rate Bowl: New Mexico vs. Minnesota (-2.5, 43.5)First Responder Bowl: FIU vs. UTSA (-5.5, 59.5)Saturday, Dec. 27Military Bowl: Pittsburgh vs. East Carolina (+10, 55.5)Pinstripe Bowl: Clemson vs. Penn State (+3, 48.5)Fenway Bowl: Army vs. UConn (+9.5, 43.5)Pop-Tarts Bowl: Georgia Tech vs. BYU (-4.5, 56.5)Arizona Bowl: Miami (OH) vs. Fresno State (-5.5, 42.5)New Mexico Bowl: North Texas vs. San Diego State (+3.5, 52.5)Gator Bowl: Virginia vs. Missouri (-4, 44.5)Texas Bowl: LSU vs. Houston (-3, 41.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football bowl game odds, 2025-26 CFP picks, best bets, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/ea2a0c78-371b-4c66-999e-575142431072/thumbnail/1200x675/480c32aa41f872bbe017bc3f422ce027/ethan-grunkemeyer-penn-state-nittany-lions-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T16:29:07.000Z",
      "dateModified": "2025-12-23T16:29:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Masters invites: 13 players earn Augusta National nod via OWGR status - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/masters-2026-invites-field-augusta-national-owgr-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/389b24e8-1400-4a19-9d33-9cef77abdac3/thumbnail/1200x675/9d797b696ae267828d5632f89761dfea/alex-noren.png",
    "tag": "Sports",
    "date": "2025-12-23T16:43:41.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The field for the 2026 Masters has reached 86 play",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The field for the 2026 Masters has reached 86 players with those finishing the 2025 calendar year inside the top 50 of the Official World Golf Rankings earning invitations into the first major championship of the 2026 season. A total of 13 players used this pathway to secure their tee times at Augusta National Golf Club in early April with Ryan Gerard eking in at the 11th hour by finishing runner-up at the AfrAsia Bank Mauritius Open on the DP World Tour.Gerard started the week No. 57 in the OWGR and propelled himself to No. 46 with his playoff loss to join the following players to earn their place at Augusta National. He needed at least a fourth-place finish to accumulate the necessary amount of points. According to projections for week 52 of the world rankings, Sam Stevens will be the last man in at No. 50, just ahead of Canadian Taylor Pendrith, who will be the last man out.Players to earn Masters invitations (week 51 rankings)Official World Golf RankingPlayerMasters appearances11Alex Noren423Aaron Rai131Kristoffer Reitan032Max Greyserman134Michael Brennan036Michael Kim238Sami Valimaki040Rasmus Hojgaard143Min Woo Lee446Ryan Gerard047Si Woo Kim848Johnny Keefer050Sam Stevens0Augusta National altered the invitation criteria for the 2026 Masters to no longer include winners of FedEx Cup Fall events. This ultimately did not matter in the cases of Michael Brennan and Sami Valimaki, but the rest of the winners from the PGA Tour's fall series -- who had not already earned their spots in the field -- faced no such luck.In lieu of these winners, champions from national opens around the world were granted invitations. Rasmus Neergaard-Petersen won the Australian Open, Tom McKibbin won the Hong Kong Open and Marco Penge proved victorious at the Spanish Open to qualify for the field.\n\n        \n            \n                Golf superlatives for 2025: Rory McIlroy's drama, Scottie Scheffler's cooking honored amid whirlwind season\n                \n                    Patrick McDonald                \n            \n                            \n    \n                \n                    \n    \nBrennan has shot up the OWGR boards thanks to his play on PGA Tour Americas and his win at the Bank of Utah Championship, where he earned full-time playing privileges on the PGA Tour. He was set to play on the Korn Ferry Tour in 2026 before his victory — the circuit which Keefer cleaned up on in 2025, so much so that he climbed inside the top 50 of the OWGR.Both of these players will be making their Masters debuts, while Si Woo Kim is the most experienced player to earn his invitation through world rankings thanks to his top-five finish at the Australian Open. When Kim sticks a peg in the ground at Augusta National in April, it will mark his ninth start in the tournament.\nThe field of 86 players is still inclusive of Tiger Woods, who is set to turn 50 before the calendar flips to 2026. The 15-time major champion did not play in a single tournament in 2025 due to a ruptured achilles and a seventh back surgery. He noted at the Hero World Challenge that his recovery has taken longer than he has wished, and that he was recently cleared to chip and putt.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Masters invites: 13 players earn Augusta National nod via OWGR status - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/389b24e8-1400-4a19-9d33-9cef77abdac3/thumbnail/1200x675/9d797b696ae267828d5632f89761dfea/alex-noren.png"
      ],
      "datePublished": "2025-12-23T16:43:41.000Z",
      "dateModified": "2025-12-23T16:43:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saints' Taysom Hill emotional following potential final game in New Orleans - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/taysom-hill-new-orleans-saints-final-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/374c8444-cd25-4b5a-8ab6-c9529eca8028/thumbnail/1200x675/c161ea10c18823f0d280c1b7a8eafd64/taysom-hill.jpg",
    "tag": "Sports",
    "date": "2025-12-23T18:30:06.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        New Orleans Saints multi-position athlete Taysom H",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        New Orleans Saints multi-position athlete Taysom Hill made history Sunday, becoming the only player with more than 1,000 yards passing, rushing and receiving in the Super Bowl era. He finished the Week 16 win against the New York Jets with one pass for 38 yards and a touchdown, 12 carries for 42 yards on the ground and four receptions for 36 yards. The victory wasn't just significant because it put him in the record books, it could also be the last game he plays in New Orleans.Hill's contract is set to void this offseason and he faces an uncertain future following road games against the Tennessee Titans and Atlanta Falcons to conclude 2025. \"My wife asked me that this morning,\" he said, before excusing himself as he began to get choked up, \"And I didn't really feel any type of way this morning, but as I was driving to the stadium today, you start to think about the last nine years, and what it's meant to me and my family and this city. I think for me personally you just try to take it all in. I've had a great experience here tonight. I don't know what the future holds for me but it was a special day for me and my family.\"\nThe undrafted player will hold a unique place in Saints history regardless of the future and while he wasn't focused on the record he broke, he admitted he was aware of it.\"Moments like these cause me to be reflective,\" Hill said. \"My overall feeling is one of gratitude. This organization, this city, has been so good to me.\"\nDespite a wide range of emotions and questions on his next move, Hill said the main focus is on the rest of the season, saying he will \"tackle the rest of that as we get down the road.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saints' Taysom Hill emotional following potential final game in New Orleans - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/374c8444-cd25-4b5a-8ab6-c9529eca8028/thumbnail/1200x675/c161ea10c18823f0d280c1b7a8eafd64/taysom-hill.jpg"
      ],
      "datePublished": "2025-12-23T18:30:06.000Z",
      "dateModified": "2025-12-23T18:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Darryn Peterson injury: Bill Self updates health of Kansas basketball star - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/darryn-peterson-injury-kansas-basketball-bill-self-update/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/05199e7f-956c-4414-9152-1e2504500432/thumbnail/1200x675/70d44af162b3761fb6634e80f0a08432/gettyimages-2245585358-1.jpg",
    "tag": "Sports",
    "date": "2025-12-23T17:37:01.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kansas spent the majority of its season without pr",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kansas spent the majority of its season without premier NBA Draft prospect Darryn Peterson on the floor due to a hamstring injury and quad discomfort. While coach Bill Self expressed optimism that the former No. 1 overall recruit would return to the floor soon, he noted that Peterson's family is involved in the decision, too.It is a mutual agreement, Self said, between Kansas and the Peterson family to hold the prized freshman out until he is at full strength.\"I think he's doing well,\" Self said after Monday's 90-61 win over Davidson. \"They made a decision, which I don't disagree with it at all, that they want him to be as close to 100% as possible when he comes back. He's just not quite there yet. It's a day-to-day deal. He will be. I wish he could have played tonight, but the fact of the matter is guys got some run and they did well, so hopefully giving some other guys some opportunities will hopefully make us deeper as we get into conference play.\"Peterson last played Dec. 13 and has missed the Jayhawks' past two games. Kansas is set to take a near two-week break before it embarks on Big 12 play, so he will have an extended period of time to complete his recovery without missing more action.\nGetting Peterson back in advance of the conference season is critical for Kansas if it is to compete at the top of the league. Two of its three losses this year came with Peterson on the bench.\"We are in agreement with the family that he should not play until he feels good,\" Self said. \"We're in agreement. I'm not inside his head or his body that I can determine if he feels good enough or not. That's up to him. He wants to be out there. He's just not quite ready.\"Peterson's freshman season has been a stop-and-start affair. He played the first two games of the campaign, missed the following seven, returned for two contests earlier this month and has been back on the shelf since. When he is on the floor, though, he appears as advertised with his 16 points per game and impact throughout the box score.\nSelf said in November that Peterson's hamstring issue was one that bothered him dating back to the start of the year and that he played through it in the early going. His most recent absence is tied to what Kansas described as cramping in one of his quads. Peterson also missed part of a preseason exhibition game due to cramps.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Darryn Peterson injury: Bill Self updates health of Kansas basketball star - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/05199e7f-956c-4414-9152-1e2504500432/thumbnail/1200x675/70d44af162b3761fb6634e80f0a08432/gettyimages-2245585358-1.jpg"
      ],
      "datePublished": "2025-12-23T17:37:01.000Z",
      "dateModified": "2025-12-23T17:37:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Notre Dame vs. USC breakup, while regretful, understandable through CFP lens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/notre-dame-usc-breakup-college-football-playoff/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/d528a25a-ddbd-4115-a9e3-65d0ab6d828d/thumbnail/1200x675/411242a3cac6fd020bba1fa8a4cc3cc7/notre-dame-usc-1.jpg",
    "tag": "Sports",
    "date": "2025-12-23T17:32:40.000Z",
    "description": "\n        Notre Dame and USC are breaking up, and like most public uncouplings, this one is getting messy. Notre Dame wants everyone to know it did eve",
    "body": "\n        Notre Dame and USC are breaking up, and like most public uncouplings, this one is getting messy. Notre Dame wants everyone to know it did everything in its power to keep the relationship intact, but USC refused to change. USC says the same thing. Neither side believes it is at fault -- the other one is to blame.The result is yet another cherished rivalry falling victim to the structural chaos engulfing college football. As I wrote after the first round of the College Football Playoff, when college football media went through an existential crisis over the inclusion of not one but two Group of Five teams, most of the sport's current \"problems\" are simply the aftershocks of conference realignment in pursuit of CFP dollars.Everyone is at fault here.USC has no one to blame but itself. It chased money by leaving the Pac-12 for the Big Ten, where television revenue was abundant and waiting to be claimed. The Trojans joined a league that plays the same number of conference games as the Pac-12 did, but now those games include Ohio State, Michigan, Penn State and, oh yeah, it still has to deal with Oregon. Those dollars came with a cost: a higher likelihood of losses. Suddenly, that annual nonconference game against Notre Dame didn't look nearly as appealing.There are plenty of opportunities to enhance a résumé within Big Ten play. An additional game against Notre Dame feels far more like a chance to damage it. USC understands this, which is why it has motivation to step away from the rivalry.\nNotre Dame can feel slighted if it wants, but that reaction often comes when privilege collides with inconvenience. Notre Dame put itself in this position by remaining independent -- a choice it has every right to make. Its brand is strong enough to survive turbulent waters without conference protection. And if the primary goal across the sport is access to playoff revenue, there is little incentive for Notre Dame to join a league. The CFP has bent over backward to accommodate the Irish, most recently through a memorandum of understanding that effectively guarantees Notre Dame a playoff berth as long as it finishes in the top 12 of the CFP Rankings.Of course, Notre Dame also recognizes the benefits of conference affiliation, which is why it maintains its relationship with the ACC. But independence comes with consequences. When you decide you want to fend for yourself, nobody is required to help you.Which is why that while I lament the loss of another rivalry and continue to cast an angry, skeptical eye at the people running the sport, I can't help but understand USC's side of this dispute.\nFrankly, I don't understand why any program that considers itself a playoff contender would willingly schedule Notre Dame from this point on. It's a situation that carries more risk than reward. Right now, the Power Four conferences are all moving to nine-game conference schedules -- well, OK, the ACC is only requiring it for some of its schools, but nonsensical decisions are just part of their overall brand -- while three of the four (ACC, Big 12 and SEC) are requiring their teams to schedule at least one P4 nonconference game. We can argue about the depth of conferences and who has the tougher schedules all we want, but the truth is nobody in the Power Four will have an \"easy\" schedule with those requirements. Adding Notre Dame at this point only makes things more difficult.The only requirement facing Notre Dame is that it plays 12 games and finishes in the top 12. It doesn't matter if it plays four Power Four opponents or 12. Which, to Notre Dame's credit, it has never been shy about playing Power Four teams. It needs to. Those television contracts wouldn't be as fruitful if they only played the service academies.But for USC, Texas, Alabama or Ohio State, the calculus is different. Beating Notre Dame would significantly enhance a résumé, but only if everything else goes right. A loss to the Irish could be fatal. Meanwhile, if Notre Dame loses to one of those programs, it often remains firmly in the at-large conversation. This season was a clear example: Notre Dame stayed in the mix largely because its two losses were close defeats against Texas A&M and Miami. For much of the year, it even appeared that the CFP might include Notre Dame over the Miami team that had beaten it.\nIf you're the athletic director or coach at a Power Four school who watched that dog-and-pony show from the selection committee all year, why the hell would you want to schedule the Irish knowing what you know now?So, yes, the end of the rivalry between USC and Notre Dame sucks. It also makes all the sense in the world when you look at it from the cracked perspective of where college football currently resides.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Notre Dame vs. USC breakup, while regretful, understandable through CFP lens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/d528a25a-ddbd-4115-a9e3-65d0ab6d828d/thumbnail/1200x675/411242a3cac6fd020bba1fa8a4cc3cc7/notre-dame-usc-1.jpg"
      ],
      "datePublished": "2025-12-23T17:32:40.000Z",
      "dateModified": "2025-12-23T17:32:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Thunder's chance at the NBA wins record appears to be slipping away - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/thunder-chance-nba-wins-record-slipping-away/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/b32571fb-4638-44a8-b9db-3f17527dc58a/thumbnail/1200x675/7e15dc929c95812ea6cf54024d1e9657/thunder-look-getty.png",
    "tag": "Sports",
    "date": "2025-12-23T19:00:25.000Z",
    "description": "\n        After suffering just their second loss of the season last week courtesy of the Spurs, the Thunder have back-to-back games against that very t",
    "body": "\n        After suffering just their second loss of the season last week courtesy of the Spurs, the Thunder have back-to-back games against that very team this week. First away at San Antonio on Tuesday, then home on Christmas Day. For an OKC team that got off to a 24-1 start, tying the best record in NBA history over the first 25 games, the schedule has suddenly stiffened up on them. Over the weekend, the Wolves handed them their third defeat of the season and their second loss in three games. Consequently, the early chatter about whether the Thunder will eclipse the Warriors' single-season win record has hushed a little. Before the loss in Minnesota, OKC's odds to reach 70+ wins were -188 while the Thunder were installed at +360 to win 74 games and break the record. After falling to Wolves, those numbers dropped to -118 and +580, respectively, per FanDuel. When chasing greatness, the margin for error is slim and unforgiving. Despite the recent setbacks, the 26-3 Thunder remain an imposing team and the heavy favorites to win consecutive championships for the first time since the Warriors pulled it off in 2017-18. Their +16.1 point differential would break the NBA record they set last season. They're fifth in offensive rating and first in defensive rating by a comical margin. The gap between their top-ranked defense and No. 2 Detroit is roughly the same as the distance between the Pistons and the Lakers, who are 23rd in defensive rating. OKC is also simultaneously careful and opportunistic. They are first in turnover percentage, opponent's turnover percentage, and points off turnovers. They are second in assist-to-turnover ratio and opponent's points off turnovers. That's a good formula for trying to win another title. So is having a team led by the reigning MVP and Finals MVP (Shai Gilgeous-Alexander) and a roster that's pretty indisputably the deepest in the league. Jalen Williams made All-Star, All-NBA and All-Defense last season and missed the first 19 games of the year. It did not slow them down.\nBut being the favorites to win it all is a different proposition than reaching 74 wins. Clearing that bar means only eight losses all season -- which leaves just five more for OKC the rest of the way. There are roughly two thirds of the season remaining. That does not leave the Thunder with much wiggle room.For comparison purposes, the 2015-16 Golden State team that set the 73-win record were first in offensive rating that season and sixth in defense. They had a +10.8 point differential. The Warriors didn't pick up their third loss until Jan. 13 -- but then lost again two games later. It was one of just two times that they lost two out of three games. They did not lose back-to-back games all season. In addition to winning their first 24 games, they had an 11-game winning streak, three seven-game streaks, a six- and five-game streak, and then closed out the season with four straight victories. For their part, the Thunder started the season with four straight wins, then rattled off 16 in a row before the Spurs knocked them off. Golden State played six overtimes and one double overtime. The Warriors lost just one of those. They also excelled when things got tight, going a league-best 30-4 in Clutch games. All three of OKC's losses this season have come in Clutch games. The Thunder aren't easy to beat, and even when they lose they make you work for it. That they are unlikely to get blown out is a notch in their favor if they have any shot to reach 74 wins, as is their depth should they suffer any significant injuries. \nLess helpful is the road ahead. With 53 games left, the Thunder have the hardest remaining strength of schedule. Of those, 27 are in OKC where the Thunder enjoy one of the best home-court advantages in the league. They lost on their floor just eight times all last season, including the playoffs. Going through the schedule and doing the win-loss thing generally lends itself better to NFL schedule releases, but for the purposes of this exercise we'll squint at OKC's remaining games and give it a try. Keep in mind fortune telling isn't a science. To have any shot of beating the Thunder, you'd hope for various things to happen. Maybe they're collectively cold on offense, as they were in the loss to Minnesota when they shot 37% from the floor and 28% from deep on 39 attempts. Maybe they're uncharacteristically sloppy with the ball, as they were in the loss to the Spurs when they had 15 turnovers leading to 26 San Antonio points. (In fairness, the Spurs weren't any better in that department. They had 19 turnovers in that game resulting in 25 OKC points. Normally that sort of thing would doom you against the Thunder.) Or maybe, as was the case in their first defeat of the season -- a two-point loss to the Blazers in Portland -- stuff just happens and things don't always go your way because, oh yeah, this is the NBA and the guys on the other team are some of the best professionals in the world, too. \nGames that stick out as potential pitfalls for OKC going forward: Tuesday at San Antonio, a team that has already beaten them -- though that would make three losses in five games for the Thunder, which is hard to imagine (and would render this whole endeavor retroactively silly). They start a four-game road trip on Jan. 15 at Houston. You have to figure the Rockets will be up for that one with it being the first time the two teams will play since OKC got past Houston in double overtime in the season opener. After that, there's a daunting stretch in late January through mid-February: at Minnesota and Denver, home vs. the Magic and then at San Antonio on a back-to-back, home against the Rockets, then at the Lakers and Phoenix. Another road trip in early March has them at Dallas (who are playing better of late and should have Kyrie Irving back by then), followed by a tough back-to-back turnaround at the Bulls and Knicks. There's a separate five-game road trip in March that begins in Orlando and ends in Boston. Then OKC closes out the season with three of four on the road: in Los Angeles against the Lakers and Clippers, then at Denver, before wrapping things up against the Suns at home. Most of the potential danger outlined here comes on the road and/or in back-to-backs. And at some point, OKC will also lose at home. (Bold statement.) Bake all that in and, if I were a betting man, I'd wager that the Thunder lose more than five times over the rest of the season. Of course, I should probably note that I am not a betting man. But good luck to those of you who are so inclined. Betting against the Thunder seems dicey, too. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Thunder's chance at the NBA wins record appears to be slipping away - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/b32571fb-4638-44a8-b9db-3f17527dc58a/thumbnail/1200x675/7e15dc929c95812ea6cf54024d1e9657/thunder-look-getty.png"
      ],
      "datePublished": "2025-12-23T19:00:25.000Z",
      "dateModified": "2025-12-23T19:00:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Naughty or nice? Sorting projected 2025 NFL playoff teams as Super Bowl pretenders or contenders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/naughty-or-nice-sorting-projected-2025-nfl-playoff-teams-as-super-bowl-pretenders-or-contenders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/88229459-0d6d-43bf-8282-4970e89863aa/thumbnail/1200x675/55410a19674d596e93080bf8331b02a0/matthew-stafford.jpg",
    "tag": "Sports",
    "date": "2025-12-23T17:25:28.000Z",
    "description": "\n        Entering Week 16, only two NFL teams had clinched a playoff berth. After Week 16, that number is up to 10. From statement wins to devastating",
    "body": "\n        Entering Week 16, only two NFL teams had clinched a playoff berth. After Week 16, that number is up to 10. From statement wins to devastating losses, it was a massive week across the league. The Detroit Lions' loss to the Pittsburgh Steelers on Sunday officially sent the Chicago Bears and San Francisco 49ers to the postseason. Then, the Indianapolis Colts' loss to the 49ers on Monday clinched playoff berths for the Buffalo Bills, Jacksonville Jaguars and Los Angeles Chargers.Add in the Seattle Seahawks, Philadelphia Eagles and New England Patriots also clinching and there are only four spots left in the playoff bracket.In total, 14 teams will have a chance for a Super Bowl, but really we can probably dismiss several of them already. With Christmas just two days away, we're determining which of the playoff teams and projected playoff teams are naughty (not legitimate Super Bowl contenders) and which ones are nice (capable of getting the greatest gift of all -- the Lombardi Trophy).AFC1. Denver Broncos (12-3, clinched playoff berth)Though the Bo Nix experience can be a bit of a roller-coaster ride, teams don't win 11 straight games by accident. The Broncos own wins over the Eagles, Houston Texans, Green Bay Packers and Kansas City Chiefs (with Patrick Mahomes). Nix showed just how good he can be in the win over the Packers, and the defense can be as dangerous as any in the league with the NFL's most sacks and a talented defense led by Patrick Surtain II.\nVerdict: Nice2. New England Patriots (12-3, clinched playoff berth)When a young quarterback arrives as a superstar, it generally means good news for a team's playoff chances. Drake Maye showed that he can put the team on his back in the playoff-clinching win over the Baltimore Ravens. So, even though the Patriots have significant issues running the ball and stopping the run, New England gets the benefit of the doubt here.Verdict: Nice\n        \n            \n                Drake Maye leads first career fourth-quarter comeback, shows how far he can carry playoff-bound Patriots\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \n3. Jacksonville Jaguars (11-4, clinched playoff berth)It might have been easy to dismiss the Jaguars as \"naughty\" just a few weeks ago. That's not the case now. The Jaguars have won seven straight games, and Trevor Lawrence is playing his best football, accounting for 10 total touchdowns and zero interceptions over his past two games. Jacksonville cemented its contender status with a road win over the Broncos.Verdict: Nice4. Pittsburgh Steelers (9-6; 91% chance to make playoffs, per SportsLine)Pittsburgh has reeled off three straight wins to take control of the AFC North; it only needs one more win, or one more Baltimore loss, to clinch the division. Aaron Rodgers has settled in and, just as importantly, the defense has made big strides. Here's where the good news ends, though: Pittsburgh is 1-5 against teams that are currently slated to make the playoffs. Though this team could perhaps get the franchise's first playoff win since 2017, it's hard to see the ceiling being much higher than that.\nVerdict: Naughty5. Los Angeles Chargers (11-4, clinched playoff berth)Seemingly lost amid the rising AFC teams, Los Angeles has won four straight and 7 of 8. Justin Herbert has played at a high level in many of the Chargers' biggest wins and continues to be among the NFL's most talented and toughest quarterbacks. The defense is one of the best against the pass. There are plenty of holes on this roster -- offensive line especially -- but there's little reason to doubt that the Chargers have a shot.Verdict: Nice6. Buffalo Bills (11-4, clinched playoff berth)The Bills are a mess defensively, and their receiver play leaves a lot to be desired. Josh Allen has shown over and over again that he can overcome it all, though, and Buffalo also has James Cook leading a tremendous rushing attack. When you have a quarterback, you have a chance. It's as simple as that.Verdict: Nice7. Houston Texans (11-4; 98% chance to make playoffs, per SportsLine)The Texans' defense is very, very nice. Houston is allowing the fewest points and yards this season. The offense is another story: Houston is 19th in points and yards. We won't go quite as far as to call it \"naughty,\" but it's certainly not up to par with what we would normally consider a contender. The Texans are averaging 23.1 points per game. Since 2009, only two Super Bowl winners have averaged fewer: the 2023 Chiefs and 2015 Broncos. We could see the Texans, who own the NFL's longest active winning streak at seven games, playing the role of the latter.\nVerdict: NiceThough that may seem like a lot of \"nice\" designations, it's simply reflective of the general consensus around the AFC. It's a wide-open race. Six teams have odds between +300 and +750 to make the Super Bowl, per DraftKings Sportsbook. The Steelers (+1400) are the only team of the seven above outside that range.NFC1. Seattle Seahawks (12-3, clinched playoff berth)Seattle is in the driver's seat for the NFC West title and conference's No. 1 seed, though a Week 18 matchup with the 49ers looms large. Still, the Seahawks got a stunning and impressive comeback win over the Rams to take the lead in the conference. Sam Darnold's play can be shaky at times, but he came up big in Week 18, and this defense is among the league's best.Verdict: Nice2. Chicago Bears (11-4, clinched playoff berth)The Bears are the NFL's feel-good story, one with a team-of-destiny feel. Chicago has six wins this season when it trailed in the final two minutes -- most in a single season in NFL history. The running game is a machine, Caleb Williams has been incredible in winning moments and the defense forces a ton of turnovers. Optimists will call it clutch; pessimists will call it lucky. Is it enough? Not quite. The Bears have the feel of last year's Washington Commanders: breakout quarterback, strong running game, opportunistic defense and lots of last-minute wins. Those Commanders won two games before getting throttled in the NFC Championship.\nVerdict: Naughty3. Philadelphia Eagles (10-5, clinched playoff berth)The Eagles seem to have rebounded from a midseason dip with consecutive decisive wins over the Las Vegas Raiders and Washington -- hardly the two toughest teams, but important wins for Philadelphia nonetheless. These Eagles have been here before. The reigning Super Bowl champs will put up an honorable defense. But the offense -- especially the running game -- has been underwhelming, and the rushing defense has major issues.Verdict: Naughty4. Carolina Panthers (8-7; 54% chance to make playoffs, per SportsLine)Carolina pulled into the NFC South lead with two weeks to go, but it will likely need a win at the Tampa Bay Buccaneers in Week 18 to clinch a playoff berth. The Panthers have followed a similar script to the Bears this year, just to a less impressive extent: Carolina has been outscored by 50 points but has a winning record thanks to seven wins in one-possession games. Bryce Young has been clutch, and the running game is hard to stop when it gets going. Still, Young is too inconsistent, as is the defense.Verdict: Naughty5. San Francisco 49ers (11-4, clinched playoff berth)If the 49ers can get past the Bears in Week 17, they will have a chance to play for the No. 1 seed in Week 18 against the Seahawks. The offense has been on fire of late, helping cover for a defense that has slipped to bottom 10 due to injuries. This is truly a team that could fall into either category, especially considering how one Brock Purdy stinker would spell doom -- and he has had more than a few of those. Still, Kyle Shanahan plus Purdy, Christian McCaffrey and potential home-field advantage is a good recipe.\nVerdict: Nice6. Los Angeles Rams (11-4, clinched playoff berth)The Rams have the NFL's top offense and fifth-best defense when using expected points added. They also have the league's worst special teams, and they've blown a lot of late leads thanks to miscues with that unit and short-yardage struggles. That's a long way of saying this team is still the deserved Super Bowl favorite if it just finds ways to execute in two seemingly minor (but actually significant) areas. Matthew Stafford is the likely MVP. Even as the No. 6 seed, this is an easy one.Verdict: Nice7. Green Bay Packers (9-5-1; 95% chance to make playoffs, per SportsLine)We're going to find out a lot about the Packers in the next two weeks. Green Bay looked to be a top-tier contender just two weeks ago. Then it blew a second-half lead at the Broncos and saw Micah Parsons suffer a torn ACL in Week 15. In Week 16, the Packers blew an even later lead in a loss to the Bears, and Jordan Love got concussed. The Packers finish with the Ravens and the Minnesota Vikings. There is still time to get back on track, but this is no longer the overwhelmingly talented bunch that we saw at its peak. There's still a chance because Love can catch fire, but things aren't as sparkly as they once were.Verdict: Nice\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Naughty or nice? Sorting projected 2025 NFL playoff teams as Super Bowl pretenders or contenders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/88229459-0d6d-43bf-8282-4970e89863aa/thumbnail/1200x675/55410a19674d596e93080bf8331b02a0/matthew-stafford.jpg"
      ],
      "datePublished": "2025-12-23T17:25:28.000Z",
      "dateModified": "2025-12-23T17:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1: AJ Dybantsa makes history in BYU's win vs. Eastern Washington - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-byu-aj-dybantsa-top-25-and-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/528455d3-b6d2-4cb9-b557-f65ab18814aa/thumbnail/1200x675/2228712e6695941349fa1e3033621075/ajdybantsat25.jpg",
    "tag": "Sports",
    "date": "2025-12-23T18:34:10.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Duke's Cameron Boozer should still be consid",
    "body": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Duke's Cameron Boozer should still be considered the clear favorite, through the first seven weeks of this season, to win the CBS Sports National Player of the Year award. He's been college basketball's best player so far, by far.But here comes AJ Dybantsa.The BYU freshman was the star of the first night of Week 8, finishing with 33 points, 10 rebounds and 10 assists in Monday's 109-81 win over Eastern Washington. Yes, that's a 30-point triple-double -- making Dybantsa, who won't turn 19 years old until Jan. 29, the youngest player to record a 30-point triple-double in NCAA history.If you watched, you likely know that the last thing Dybantsa needed to secure the triple-double was a 10th assist. He got it with 120 seconds left after Mihailo Boskovic received a pass from Dybantsa and sank a 23-foot jumper.\n\"Thank God for Mihai,\" Dybantsa said afterward with a smile.BYU will not play again until the Cougars visit Kansas State a week from Saturday. That means Dybantsa's second full month of college basketball is in the books, and it was literally unlike anything we've seen in at least three decades.Dybantsa played six games in December, all wins, and averaged 27.8 points, 8.0 rebounds and 5.7 assists while shooting 79.5% from the field. According to OptaSTATS, that makes Dybantsa the only Division I player in the last 30 seasons to play at least five games in a calendar month and finish them with averages of 25-plus points, five-plus rebounds and five-plus assists while shooting better than 65% from the field and going undefeated.\nBYU remains No. 5 in Tuesday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings, where Michigan is No. 1 for the 14th consecutive day. The Cougars are one of three Big 12 schools in the top five of the Top 25 And 1 -- joining No. 2 Arizona and No. 3 Iowa State. Top 25 And 1 rankings \n        Biggest Movers\n    RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Michigan\n                                \n                            Aday Mara finished with 14 points and 10 rebounds in Sunday's 102-50 win over La Salle. The Wolverines' next game is Dec. 29 against McNeese.\n                        \n                            --\n                        \n                            11-0\n                        \n                                2\n                            \n                                    Arizona\n                                \n                            Brayden Burries finished with 20 points and four assists in Monday's 107-71 win over Bethune Cookman. The Wildcats' next game is Monday against South Dakota State.\n                        \n                            --\n                        \n                            12-0\n                        \n                                3\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic finished with 27 points and three rebounds in Sunday's 91-60 win over Long Beach State. The Cyclones' next game is Dec. 29 against Houston Christian.\n                        \n                            --\n                        \n                            12-0\n                        \n                                4\n                            \n                                    UConn\n                                \n                            Alex Karaban finished with 21 points and six rebounds in Sunday's 72-54 win at DePaul. The Huskies' next game is Dec. 31 at Xavier.\n                        \n                            --\n                        \n                            12-1\n                        \n                                5\n                            \n                                    BYU\n                                \n                            AJ Dybantsa finished with 33 points and 10 assists in Monday's 109-81 win over Eastern Washington. The Cougars' next game is Jan. 3 at Kansas State.\n                        \n                            --\n                        \n                            12-1\n                        \n                                6\n                            \n                                    Purdue\n                                \n                            Trey Kaufman-Renn finished with 18 points and six rebounds in Saturday's 88-60 win over Auburn. The Boilermakers' next game is Dec. 29 against Kent State.\n                        \n                            --\n                        \n                            11-1\n                        \n                                7\n                            \n                                    Gonzaga\n                                \n                            Braeden Smith finished with 21 points and seven assists in Sunday's 91-82 win at Oregon. the Zags' next game is Sunday against Pepperdine.\n                        \n                            --\n                        \n                            12-1\n                        \n                                8\n                            \n                                    Duke\n                                \n                            Nikolas Khamenia missed five of the eight shots he attempted in Saturday's 82-81 loss to Texas Tech. The Blue Devils' next game is Dec. 31 against Georgia Tech.\n                        \n                            --\n                        \n                            11-1\n                        \n                                9\n                            \n                                    Michigan St.\n                                \n                            Coen Carr finished with 22 points and seven rebounds in Saturday's 79-70 win over Oakland. The Spartans' next game is Dec. 29 against Cornell.\n                        \n                            --\n                        \n                            11-1\n                        \n                                10\n                            \n                                    N. Carolina\n                                \n                            Caleb Wilson finished with 21 points and 12 rebounds in Monday's 99-51 win over East Carolina. The Tar Heels' next game is Dec. 30 against Florida State.\n                        \n                            --\n                        \n                            12-1\n                        \n                                11\n                            \n                                    Kansas\n                                \n                            Flory Bidunga finished with 18 points and eight rebounds in Monday's 90-61 win over Davidson. The Jayhawks' next game is Jan. 3 at UCF.\n                        \n                            --\n                        \n                            10-3\n                        \n                                12\n                            \n                                    Houston\n                                \n                            Kingston Flemings finished with 21 points and five assists in Saturday's 94-85 win over Arkansas. The Cougars' next game is Dec. 29 against Middle Tennessee.\n                        \n                            --\n                        \n                            11-1\n                        \n                                13\n                            \n                                    Nebraska\n                                \n                            Braden Frager finished with 17 points and four rebounds in Sunday's 78-55 win over North Dakota. The Cornhuskers' next game is Dec. 30 against New Hampshire.\n                        \n                            --\n                        \n                            12-0\n                        \n                                14\n                            \n                                    Vanderbilt\n                                \n                            Duke Miles fTyler Nickel finished with 26 points and three blocks in Sunday's 98-67 win at Wake Forest. The Commodores' next game is Dec. 29 against New Haven.\nhed with 22 points and five assists in Wednesday's 77-70 overtime win at Memphis. The Commodores next game is Sunday at Wake Forest.\n                        \n                            --\n                        \n                            12-0\n                        \n                                15\n                            \n                                    Alabama\n                                \n                            Aiden Sherrell finished with 21 points and seven rebounds in Sunday's 92-81 win over Kennesaw State. The Crimson Tide's next game is Dec. 29 against Yale.\n                        \n                            --\n                        \n                            9-3\n                        \n                                16\n                            \n                                    Arkansas\n                                \n                            Karter Knox missed five of the six shots he attempted in Saturday's 94-85 win over Arkansas. The Razorbacks' next game is Dec. 29 against James Madison.\n                        \n                            --\n                        \n                            9-3\n                        \n                                17\n                            \n                                    Illinois\n                                \n                            Keaton Wagler finished with 22 points and eight rebounds in Monday's 91-48 win over Missouri. The Illini's next game is Monday against Southern.\n                        \n                            --\n                        \n                            9-3\n                        \n                                18\n                            \n                                    Texas Tech\n                                \n                            Christian Anderson finished with 27 points and five assists in Saturday's 82-81 win over Duke. The Red Raiders' next game is Dec. 28 against Winthrop.\n                        \n                            --\n                        \n                            9-3\n                        \n                                19\n                            \n                                    Tennessee\n                                \n                            Ja'Kobi Gillespie finished with 15 points and nine assists in Sunday's 94-52 win over Gardner-Webb. The Vols' next game is Tuesday against South Carolina State.\n                        \n                            --\n                        \n                            9-3\n                        \n                                20\n                            \n                                    Louisville\n                                \n                            Sananda Fru finished with 18 points and eight rebounds in Saturday's 94-54 win over Montana. The Cardinals' next game is Dec. 30 against Cal.\n                        \n                            --\n                        \n                            10-2\n                        \n                                21\n                            \n                                    Kentucky\n                                \n                            Otega Oweh finished with 20 points and three steals in Saturday's 78-66 win over St. John's. The Wildcats' next game is Tuesday against Bellarmine.\n                        \n                            --\n                        \n                            8-4\n                        \n                                22\n                            \n                                    Iowa\n                                \n                            Alvaro Folgueiras finished with 17 points and three rebounds in Saturday's 94-39 win over Bucknell. The Hawkeyes' next game is Dec. 29 against UMass Lowell.\n                        \n                            --\n                        \n                            10-2\n                        \n                                23\n                            \n                                    Virginia\n                                \n                            Thijs De Ridder finished with 27 points and eight rebounds in Monday's 95-51 win over American. The Cavaliers' next game is Dec. 31 at Virginia Tech.\n                        \n                            --\n                        \n                            11-1\n                        \n                                24\n                            \n                                    LSU\n                                \n                            Marquel Sutton finished with 19 points and nine rebounds in Friday's 78-65 win over Southeastern Louisiana. The Tigers' next game is Monday against Prairie View A&M.\n                        \n                            --\n                        \n                            11-1\n                        \n                                25\n                            \n                                    Auburn\n                                \n                            Kevin Overton missed 10 of the 18 shots he attempted in Saturday's 88-60 loss to Purdue. The Tigers' next game is Dec. 29 against Queens.\n                        \n                            --\n                        \n                            8-4\n                        \n                                26\n                            \n                                    St. John's\n                                \n                            Bryce Hopkins missed seven of the 11 shots he attempted in Saturday's 78-66 loss to Kentucky. The Red Storm's next game is Tuesday against Harvard.\n                        \n                            --\n                        \n                            7-4\n                        \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1: AJ Dybantsa makes history in BYU's win vs. Eastern Washington - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/528455d3-b6d2-4cb9-b557-f65ab18814aa/thumbnail/1200x675/2228712e6695941349fa1e3033621075/ajdybantsat25.jpg"
      ],
      "datePublished": "2025-12-23T18:34:10.000Z",
      "dateModified": "2025-12-23T18:34:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WNBA Draft prospect stock watch: The top 3-point shooters, led by Azzi Fudd - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/2026-wnba-draft-prospect-stock-watch-best-3-point-shooters-azzi-fudd/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/3b576b14-0d52-4b12-9f31-00a44d70ec0d/thumbnail/1200x675/4001bf73d8cc7a130aa363d1600e31a1/azzi-fudd-uconn-3-point-shooting.png",
    "tag": "Sports",
    "date": "2025-12-23T16:59:45.000Z",
    "description": "\n        In 2016, the Dallas Wings led the WNBA in 3-point attempts per game with 21.6. In 2025, the Wings took an almost identical amount of 3s per g",
    "body": "\n        In 2016, the Dallas Wings led the WNBA in 3-point attempts per game with 21.6. In 2025, the Wings took an almost identical amount of 3s per game (21.6) and finished 10th in the league. The 3-point revolution that swept across the NBA over the last decade has arrived in the W. The 23 instances in which a team has averaged 25 or more 3-point attempts for a season have all come since 2019, and the record for 3-point attempts per game has been broken four times since then -- most recently last season, when the expansion Golden State Valkyries put up 29.9 per game. Since 2019, only one champion has finished in the bottom half of the league in 3-point attempts per game (2020 Seattle Storm) and only one champion has finished in the bottom half of the league in 3-point percentage (2021 Chicago Sky). No champion in that time has taken fewer than 21 3s per game and no champion has shot worse than 34%. SeasonChampion3P/G (Rank)3P% (Rank)2025Las Vegas Aces25.9 (5th)35.1% (3rd)2024New York Liberty29 (1st)34.9% (5th)2023Las Vegas Aces24.9 (2nd)37.2% (2nd)2022Las Vegas Aces26.4 (3rd)36.1% (2nd)2021Chicago Sky21.2 (6th)34.3% (7th)2020Seattle Storm21.4 (7th)39.4% (2nd)2019Washington Mystics25.4 (1st)36.6% (2nd)There's still a place for post-ups and interior scoring, but the league is only trending in one direction. If you can't shoot, you can't win. Which brings us to the latest edition of WNBA Draft Prospect Stock Watch. Let's take a closer look at some of the best 3-point shooters in this year's class, led by potential No. 1 overall pick Azzi Fudd.   Azzi Fudd -- G, UConn: Up  Fudd would have been a first-round pick last year, but decided to return to UConn for a fifth season to work on her game and prove that she could stay healthy. That's turned out to be a wise decision, as she's now in contention to be the No. 1 overall pick.   Through 12 games, Fudd is putting 18.5 points, three assists and 2.3 steals per game -- all career-highs -- on absurd 49.4/50.6/100 shooting splits, and has the reigning national champions off to an undefeated start.   Fudd has always been a high-level outside shooter, but what she's doing this season is historic. Since 1981-82 (the first year the Women's NCAA Tournament was held), there have only been two previous seasons in which a player shot at least 50% on six or more 3-point attempts per game. Fudd is on pace to join the list (as is Oklahoma State's Haleigh Timmer).   PlayerSeasonSchool3P/G3P%Mary Just \t\t\t\t \t\t\t\t1987-88 \t\t\t\t \t\t\t\tLoyola Chicago \t\t\t\t \t\t\t\t6.4 \t\t\t\t \t\t\t\t50% \t\t\t\t \t\t\t\tKatie Benzan \t\t\t\t \t\t\t\t2020-21 \t\t\t\t \t\t\t\tMaryland \t\t\t\t \t\t\t\t6.4 \t\t\t\t \t\t\t\t50% \t\t\t\t \t\t\t\tAzzi Fudd \t\t\t\t \t\t\t\t2025-26 \t\t\t\t \t\t\t\tUConn \t\t\t\t \t\t\t\t6.8 \t\t\t\t \t\t\t\t50.6% \t\t\t\t \t\t\t\tHaleigh Timmer \t\t\t\t \t\t\t\t2025-26 \t\t\t\t \t\t\t\tOklahoma State \t\t\t\t \t\t\t\t6.1 \t\t\t\t \t\t\t\t50% \t\t\t\t \t\t\t\tFudd remains primarily a catch-and-shoot threat -- she's only taken four off-the-dribble 3s this season and is 16 of 43 (37.2%) on pull-up 2s -- but she's not a standstill shooter. She has a lightning-quick release, can shoot off the move and is capable of knocking down contested shots, all of which makes it difficult for opponents to run her off the line.   Let's take a look at this play from UConn's win over USC. She takes a hand-off from KK Arnold, swings the ball to Ashlynn Shade, then cuts toward the basket off a screen from Serah Williams. As soon as she hits the restricted area, she turns and runs back to the 3-point line off another screen from Williams. The pass from Blanca Quiñonez is off target, so she's forced to catch it at her shin, while facing away from the basket. Even so, she squares herself and has the ball out of her hands in 0.7 seconds. USC freshman Jazzy Davidson throws her hands up in dismay as the ball sinks through the net.   \nHere's another one against USC where she throws the ball ahead to Arnold, sprints into a hand-off, then stops on a dime and has the ball out in 0.5 seconds to beat Davidson's flying contest. Again, nothing but net.   \nFor the season, Fudd is 10 of 17 (58.8) on \"off screen\" 3-point attempts per Synergy Sports and 20 of 35 (42.9%) on contested 3-point attempts.   There may still be some questions about other aspects of Fudd's offensive game, especially when looking at her through the lens of a potential No. 1 pick, but there are no questions about her shooting ability. It is elite and will easily translate to the professional level.     Gianna Kneepkens -- G, UCLA: Steady  After four years at Utah, Kneepkens decided to forego the 2025 WNBA Draft and transfer to UCLA for her fifth year of eligibility. Her numbers have taken a hit now that she's on a much deeper and more talented team, but she's still putting together an impressive campaign.   Through 12 games, Kneepkens is averaging 14.3 points, 3.9 rebounds, 3.3 assists and 1.3 steals on 52.4/45.6/90.9 shooting splits for the No. 4-ranked Bruins. She has been projected to go in the middle of the first round in the 2026 draft since the beginning of the season, and nothing has changed on that front.   Kneepkens' usage rate dropping significantly (20.4% this season, compared to 27.3% last season with the Utes) has not only affected her numbers, but the type of shots she takes. With so many other scorers and playmakers in Los Angeles, Kneepkens has largely been a catch-and-shoot threat this season, compared to her time in Salt Lake City, when she had more opportunities to create for herself.   Here's a look at Kneepkens' shooting breakdown so far this season, compared to her last two full seasons at Utah (she only played eight games in 2023-24 due to a foot injury).   SeasonSchoolC&S 3P/GC&S 3%OTD 3P/GOTD 3%3P/G3P%2025-26UCLA4.748.2%133.3%5.745.6%2024-25Utah4.447.1%2.437.8%6.844.8%2022-23Utah344.8%2.339.4%5.342.3%Kneepkens' high-arcing shot is a bit unorthodox, and she doesn't have the quickest release -- though it isn't painstakingly slow either. She's better when she has her feet set, but has proven throughout her collegiate career that she can be an effective shooter off the bounce. Even in a small sample size this season, we've seen glimpses of her ability to create her own shot from behind the arc.Here she is completely shaking Ashlon Jackson... \n... then getting Jordan Lee with a step-back\nYarden Garzon -- F, Maryland: DownGarzon spent the first three seasons of her career at Indiana, where she became the program's all-time leader in 3-pointers (220) and 3-point percentage (42.6%). Over the summer, she made the surprise decision to enter the transfer portal and eventually decided to join Maryland for her senior campaign. While Garzon has played a bit better lately (against very poor competition), her draft stock has taken a hit due to her disappointing start to life in College Park. Her numbers are down across the board, and she's averaging 12.6 points, four rebounds, 3.2 assists and 1.3 steals on 42/37.9/100 shooting splits for the undefeated Terrapins. Some of Garzon's poor shooting is unexplainable. She's getting over three open catch-and-shoot looks per game, per Synergy Sports, but is making just 35% of them -- by far the worst mark of her career. Much of Garzon's value stemmed from being a big wing (6-foot-3) that was automatic when left open behind the arc. That hasn't been the case this season. \nHere's a look at her open catch-and-shoot numbers over the years:SeasonSchool3PM3PA3P%2025-26Maryland144035%2024-25Indiana396956.5%2023-24Indiana336650%2022-23Indiana326152.5%Garzon almost never shoots off the dribble -- in 110 career games, she's 21 of 71 (29.6%) on pull-up 3s -- and has done very little around the basket this season. Just 16.8% of her field goal attempts have come in the paint (for comparison, Fudd takes 29.2% of her attempts in the paint and Kneepkens takes 32.3%) and she has shot eight free throws in 13 games. Garzon didn't suddenly forget how to shoot, and she'll have a chance to improve her draft stock in Big Ten play. However, the first few months of the season have given front offices a clear look at the downside of selecting her. If Garzon isn't hitting 3s at a high clip, it's hard for her to make a big impact in the scoring department. If she doesn't turn things around, it's possible she slips out of the first round. Also keep an eye on...Gabriela Jaquez -- G, UCLA: UpJaquez wasn't known as a shooter in her first three seasons at UCLA, but she improved significantly over the summer. Through the first 12 games, she's making a stunning 54.2% of her four 3-point attempts per game, which has helped her shoot up draft boards. She is now a likely first-round pick. Marta Suarez -- F, TCU: UpThe 6-foot-3 Suarez barely took 3s during her first two seasons at Tennessee, then shot a combined 82 of 269 (30.5%) in two seasons at California. Now, in her final collegiate campaign with TCU, she's making 44.2% of 5.9 attempts per game, which has helped her generate some draft buzz. Maggie Doogan -- F, Richmond: UpAfter helping the Spiders win their first NCAA Tournament game in program history last season, Doogan has leveled up again. The do-it-all forward is putting up career-highs across the board, including shooting 42.4% on 7.1 3s per game. Of the 64 D-I players taking at least seven 3s, only three are making a higher percentage than Doogan. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WNBA Draft prospect stock watch: The top 3-point shooters, led by Azzi Fudd - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/3b576b14-0d52-4b12-9f31-00a44d70ec0d/thumbnail/1200x675/4001bf73d8cc7a130aa363d1600e31a1/azzi-fudd-uconn-3-point-shooting.png"
      ],
      "datePublished": "2025-12-23T16:59:45.000Z",
      "dateModified": "2025-12-23T16:59:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Pro Bowl rosters announced: Chiefs' Travis Kelce leads fan vote - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-pro-bowl-rosters-players-2025-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/3230c2c5-5b1f-4a19-bf17-2971fc8876d0/thumbnail/1200x675/110f987447be1520f908f9dd6d94a084/kelce16.png",
    "tag": "Sports",
    "date": "2025-12-23T19:00:37.000Z",
    "description": "\n        The NFL released its complete rosters for the 2026 Pro Bowl Games which will take place on the Tuesday leading up to Super Bowl LX. The Denve",
    "body": "\n        The NFL released its complete rosters for the 2026 Pro Bowl Games which will take place on the Tuesday leading up to Super Bowl LX. The Denver Broncos, Baltimore Ravens, San Francisco 49ers and Seattle Seahawks tied for a league-high six selections. The Los Angeles Chargers, Dallas Cowboys, Detroit Lions, Philadelphia Eagles also produced five selections each. For a second straight year, Kansas City Chiefs tight end Travis Kelce led all players in fan balloting. Kelce earned his 11th consecutive Pro Bowl nod in what might be the final year of his Hall of Fame career. Another notable selection is Jalen Ramsey, who made the Pro Bowl for the first time as a free safety after switching positions during his first season with the Pittsburgh Steelers. Notable omissions were Eagles running back Saquon Barkley and Ravens running back Derrick Henry. In lieu of a traditional football game, the NFL instead moved to having \"a celebration of player skills that is highlighted by a flag football game between the AFC and NFC.\" For the first time, the Pro Bowl Games will take place at the site of the Super Bowl, which will be held in the San Francisco Bay Area. AFC Quarterback (3)Josh Allen (Bills)Justin Herbert (Chargers)Drake Maye (Patriots)Running back (3)De'Von Achane (Dolphins)James Cook (Bills)Jonathan Taylor (Colts)Fullback (1)Patrick Ricard (Ravens) Receiver (4)Ja'Marr Chase (Bengals)Nico Collins (Texans)Zay Flowers (Ravens)Courtland Sutton (Broncos)Tight end (2)Brock Bowers (Raiders)Travis Kelce (Chiefs)Offensive tackle (3)Joe Alt (Chargers)Garett Bolles (Broncos)Dion Dawkins (Bills)Guard (3)Quinn Meinerz (Broncos)Quenton Nelson (Colts)Trey Smith (Chiefs)Center (2)Creed Humphrey (Chiefs)Tyler Linderbaum (Ravens)Defensive end (3)Will Anderson Jr. (Texans)Maxx Crosby (Raiders)Myles Garrett (Browns)Interior linemen (3)Zach Allen (Broncos)Chris Jones (Chiefs)Jeffery Simmons (Titans)Outside linebacker (3)Nik Bonitto (Broncos)Tuli Tuipulotu (Chargers)T.J. Watt (Steelers)Inside/Middle linebacker (2)Azeez Al-Shaair (Texans)Roquan Smith (Ravens)Cornerback (4)Christian Gonzalez (Patriots)Derek Stingley Jr. (Texans)Patrick Surtain II (Broncos)Denzel Ward (Browns)Free safety (1) Jalen Ramsey (Steelers)Strong Safety (2)Kyle Hamilton (Ravens)Derwin James (Chargers)Long snapper (1)Jordan Stout (Ravens)Placekicker (1)Cameron Dicker (Chargers)Return specialist (1)Chimere Dike (Titans)\nSpecial teamer (1)Ben Skowronek (Steelers) NFCQuarterback (3)Sam Darnold (Seahwks)Dak Prescott (Cowboys)Matthew Stafford (Rams) Running back (3)Jahmyr Gibbs (Lions)Christian McCaffrey (49ers)Bijan Robinson (Falcons)Fullback (1)Kyle Juszczyk (49ers)Receiver (4)Puka Nacua (Rams)George Pickens (Cowboys)Jaxon Smith-Njigba (Seahawks)Amon-Ra St. Brown (Lions)Tight end (2)George Kittle (49ers)Trey McBride (Cardinals)Offensive tackle (3)Penei Sewell (Lions)Trent Williams (49ers)Tristan Wirfs (Buccaneers)Guard (3)Chris Lindstrom (Falcons)Tyler Smith (Cowboys)Joe Thuney (Bears)Center (2)Drew Dalman (Bears)Cam Jurgens (Eagles) Defensive end (3)Aidan Hutchinson (Lions)DeMarcus Lawrence (Seahawks)Micah Parsons (Packers)Interior defensive linemen (3)Jalen Carter (Eagles)Leonard Williams (Giants)Quinnen Williams (Cowboys)Outside linebacker (3)Brian Burns (Giants)Jared Verse (Rams)Byron Young (Rams) Inside/Middle linebacker (2)Zack Baun (Eagles)Jack Campbell (Lions)Cornerback (4)Cooper DeJean (Eagles)Jaycee Horn (Panthers)Quinyon Mitchell (Eagles)Devon Witherspoon (Seahawks)Free safety (2)Kevin Byard (Bears)Antoine Winfield Jr. (Buccaneers)Strong safety (1)Budda Baker (Cardinals) Punter (1)Tress Way (Commanders)Placekicker (1)Brandon Aubrey (Cowboys)Kick returner (1)Rashid Shaheed (Seahawks)Special Teamer (1) Luke Gifford (49ers)Long snapper (1) \nJon Weeks (49ers) \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Pro Bowl rosters announced: Chiefs' Travis Kelce leads fan vote - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/3230c2c5-5b1f-4a19-bf17-2971fc8876d0/thumbnail/1200x675/110f987447be1520f908f9dd6d94a084/kelce16.png"
      ],
      "datePublished": "2025-12-23T19:00:37.000Z",
      "dateModified": "2025-12-23T19:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]