[
  {
    "title": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-championship-games-2025-picks-odds-lines-spreads-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:40:40.000Z",
    "description": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC champ",
    "body": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC championship, coming on Saturday. The Power Four title games take place on Saturday, and all of them will impact either who makes the College Football Playoff field and/or where they are seeded. The latest conference championship college football odds list Texas Tech at -12.5 vs. BYU in the Big 12 as BYU head coach Kalani Sitake is remaining with the Cougars instead of going to Penn State. Georgia is at -2.5 vs. Alabama in the SEC as the Dawgs look to avenge their lone defeat, Ohio State is at -4 vs. Indiana in the Big Ten in a No. 1 versus No. 2 matchup, and Virginia is at -4.5 against Duke in the ACC after UVA both beat and covered versus the Blue Devils on Nov. 15. Before locking in any college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 43-36 run on his official SportsLine college football picks as well. Anyone following could have seen huge returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for conference championship week and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for championship weekOne of the top college football picks Marshall is recommending for the conference title games: He's backing Virginia (-3.5) against Duke in the ACC Championship Game. He's also likes the Under (57.5) to hit in the 8 p.m. ET nightcap on Saturday. These teams met in Durham on Nov. 15 and Virginia won 34-17 despite being a 5-point road underdog. That game also hit the Under (60.5) with some room to spare. Marshall sees more of the same at a neutral site in Charlotte.\"UVA is 7-3 vs. the spread in last 10 this season and the Cavaliers also enter Charlotte on 7-0 Under run,\" Marshall told SportsLine. \"The Blue Devils are only 3-3 straight-up and vs. spread down stretch this season.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football conference championship picksMarshall has evaluated every other matchup, and he's backing a team on a huge 14-2 spread run dating back to last year. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 43-36 run on college football picks this season, and find out.College football odds for championship weekSee full conference championship game college football picks, odds, predictions here(odds subject to change)Friday, Dec. 5Conference USA Championship Game: Kennesaw State vs. Jacksonville State (-2.5, 60.5)Sun Belt Championship Game: James Madison vs. Troy (+23.5, 47.5)AAC Championship Game: North Texas vs. Tulane (+2.5, 67.5)Mountain West Championship Game: Boise State vs. UNLV (+4.5, 58.5)Saturday, Dec. 6Big 12 Championship Game: BYU vs. Texas Tech (-12.5, 49.5)MAC Championship Game: Miami (OH) vs. Western Michigan (-2.5, 43.5)SEC Championship Game: Georgia vs. Alabama (+2.5, 47.5)Big Ten Championship Game: Indiana vs. Ohio State (-4, 47.5)ACC Championship Game: Duke vs. Virginia (-4.5, 57.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg"
      ],
      "datePublished": "2025-12-04T23:40:40.000Z",
      "dateModified": "2025-12-04T23:40:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-line-start-time-lions-cowboys-nfl-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-12-05T00:09:04.000Z",
    "description": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lio",
    "body": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lions. Dallas (6-5-1) defeated Kansas City on Thanksgiving, 31-28, for its third straight victory. Detroit (7-5) fell to Green Bay on the holiday, 31-24, as the Lions have alternated wins and losses over their last eight games. However, the Lions won the last meeting between the teams, 47-9 in 2024, which is Dallas' largest margin of defeat since 1988. CB Trevon Diggs (knee), OL Tyler Guyton (ankle) and Jadeveon Clowney (hamstring) have been ruled for for Dallas, while Amon-Ra St. Brown (ankle) is active for Detroit.Kickoff is at 8:15 p.m. ET from Ford Field in Detroit. The Lions' victory in their 2024 matchup ended a six-game win streak by Dallas in the head-to-head series. Detroit is a 3.5-point favorite in the latest Lions vs. Cowboys odds. Meanwhile, the over/under for total points is 55.5. Detroit is at -181 on the money line (risk $181 to win $100). Before making any Cowboys vs. Lions picks, make sure to check out the 'Thursday Night Football' predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks. He's SportsLine's No. 1 NFL expert this year with a 133-110 (+1724) run on all NFL picks and is an outstanding 34-22-2 (+1064) run over his last 58 NFL picks in Lions games. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Lions vs. Cowboys and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Cowboys vs. Lions:Lions vs. Cowboys                 spreadDetroit -3.5 at DraftKings SportsbookLions vs. Cowboys                       over/under55.5 pointsLions vs. Cowboys                       money line Detroit -181, Dallas +151Lions vs. Cowboys                   picksSee picks at SportsLineLions vs. Cowboys                       streaming Amazon PrimeWhy the Cowboys can coverDallas is 5-1 ATS as an underdog and has both won and covered in three straight games overall, including the last two coming versus last year's Super Bowl participants in the Chiefs and Eagles. Meanwhile, Detroit has lost three straight versus the spread, and it lost one of its best playmakers in Sam LaPorta (back). While Detroit still has its backfield of Jahmyr Gibbs and David Montgomery to lean on, the run defense has been the biggest improvement for Dallas recently. Since acquiring Quinnen Williams from the Jets, Dallas has allowed just 69.7 rushing yards, which is less than half of the 143 yards per game it allowed in nine games prior to his arrival. See which team to back at SportsLine. Why the Lions can coverThese teams met in October 2024 -- in Dallas -- in which the Lions' 38-point victory was their third-largest road win, ever, while the game also marked Dallas' fourth-largest home loss in franchise history. So, Detroit should feel very confident it can take care of business at home, as the Cowboys average 6.9 fewer points on the road than in Dallas. Dan Campbell also knows how to get the best out of his team after a defeat, as the Lions have remarkable resiliency in terms of spread success. Since the start of the 2023 season, the Lions are 10-1 ATS (90.9%) following a straight-up defeat, while Dallas is just 11-13 ATS (45.8%) after a win over that same time frame. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Cowboys vs. Lions  picksWhite has analyzed Lions vs. Cowboys from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Cowboys vs. Lions, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Lions vs. Cowboys spread you need to jump on, all from the expert that is 34-22-2 on his last 58 Detroit picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg"
      ],
      "datePublished": "2025-12-05T00:09:04.000Z",
      "dateModified": "2025-12-05T00:09:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-lions-prediction-odds-line-spread-time-week-14-thursday-night-football-nfl-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png",
    "tag": "Sports",
    "date": "2025-12-05T00:03:30.000Z",
    "description": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dall",
    "body": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dallas is coming off a 31-28 win over the Kansas City Chiefs, while Detroit dropped a 31-24 decision to the Green Bay Packers on Thanksgiving Day. The Cowboys (6-5-1), who have won three in a row, are just 1.5 games behind Philadelphia for the NFC East lead. The Lions (7-5), who have lost three of five, have fallen two games behind Chicago in the NFC North. Lions receiver Amon-Ra St. Brown (ankle) is active, while safety Kerby Joseph (knee) is inactive.Kickoff from Ford Field in Detroit is set for 8:15 p.m. ET. The Cowboys lead the all-time series 19-13, but the Lions won last year's meeting 47-9. The Lions are 3.5-point favorites in the latest Cowboys vs. Lions odds, while the over/under for total points scored is 55.5 via SportsLine consensus. Detroit is at -181 on the money line (risk $181 to win $100), while Dallas is at +151 (risk $100 to win $151). Before making any Cowboys vs. Lions picks, check out the NFL predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Cowboys vs. Lions. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Lions vs. Cowboys:Cowboys vs. Lions                                                             spreadDetroit -3.5 at DraftKings SportsbookCowboys vs. Lions         over/under55.5 pointsCowboys vs. Lions                                                                                                                                                                         money line Detroit -181, Dallas +151Cowboys vs. Lions                                                                                                                                                                 picksSee picks at SportsLineCowboys vs. Lions                                                                                                                                                                   streaming Prime VideoWhy the Lions can coverVeteran quarterback Jared Goff helps power the Detroit offense. In 12 games this season, he has completed 69.8% of his passes for 3,025 yards and 25 touchdowns with five interceptions and a 110.2 rating. In last week's loss to the Packers, he completed 20 of 26 passes for 256 yards and two touchdowns. He also carried once for 24 yards. In a 34-27 overtime win over the New York Giants on Nov. 23, he completed 28 of 42 passes for 279 yards and two touchdowns with one interception.Another weapon on offense is running back Jahmyr Gibbs. In 12 games, he has carried 175 times for 1,019 yards (5.8 average) and 10 touchdowns. He has had 10 explosive plays of 20 yards or more, including a long of 78, with 46 first-down conversions. In the win over the Giants, he carried 15 times for 219 yards (14.6 average) and two touchdowns. He also caught 11 passes for 45 yards and a score. See which team to back at SportsLine. Why the Cowboys can coverTen-year veteran quarterback Dak Prescott leads the Dallas offense. In 12 starts, he has completed 69.3% of his passes for 3,261 yards and 25 touchdowns with eight interceptions and a 102.4 rating. He has also rushed 41 times for 124 yards and two touchdowns. In the win over Kansas   City, he completed 27 of 39 passes (69.2%) for 320 yards and two touchdowns with one interception. His top target is fourth-year veteran wide receiver George Pickens. In 12 games, he has 73 receptions for 1,142 yards and eight touchdowns. In the win over the Chiefs, he caught six passes for 88 yards. He caught nine passes for 146 yards and one touchdown in a 24-21 win over the Philadelphia Eagles on Nov. 23. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Cowboys vs. Lions picksSportsLine's model is going Over on the total, projecting 56 combined points. It also says one side of the spread hits in well over 50% of simulations.         You can only get the pick at SportsLine. So who wins Cowboys vs. Lions, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Cowboys vs. Lions spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png"
      ],
      "datePublished": "2025-12-05T00:03:30.000Z",
      "dateModified": "2025-12-05T00:03:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-cowboys-lions-daily-fantasy-picks-lineups-advice-stacks-thursday-night-football-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:25:39.000Z",
    "description": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys ",
    "body": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys vs. Detroit Lions matchup at 8:15 p.m. ET. Detroit is a 3-point home favorite, while the over/under is 54.5, the highest on the board in Week 14. Dak Prescott, Jared Goff, Jahmyr Gibbs and CeeDee Lamb are names known to casual football fans and names very familiar with being included in NFL DFS lineups. However, Detroit could be shorthanded with Sam LaPorta on the IR and Amon-Ra St. Brown (ankle) a game-time decision after not practicing this week. George Pickens (calf/knee) doesn't carry an injury designation for TNF.Wideout Isaac TeSlaa played 92% of snaps in Detroit's last game and scored his third touchdown of the year. Daily Fantasy football lineups need economical options like TeSlaa to balance out the highly-priced stars. The Cowboys also have NFL daily Fantasy sleepers who could provide a great return on investment on TNF. Before making any Lions vs. Cowboys NFL DFS picks for 'Thursday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Thursday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Cowboys vs. LionsOne of McClure's top NFL DFS picks for 'Thursday Night Football' is Cowboys receiver CeeDee Lamb. The wideout is coming off a 7-112-1 stat line on Thanksgiving versus Kansas City, with the 112 yards matching a season high. Lamb is averaging 82.7 receiving yards per game in 2025, which ranks sixth-best in the NFL, and his career high of 227 yards came versus Detroit in 2023. This year's Lions team has allowed the third-most touchdowns to opposing wideouts, and now it will be without starting cornerback, Terrion Arnold (shoulder), who was placed on injured reserve on Monday. Detroit also allowed four touchdowns to wideouts in last week's loss to Green Bay. See who else to roster at SportsLine.McClure is also rostering Lions running back Jahmyr Gibbs, who has been a one-man show over the last half-dozen games. Gibbs is averaging 152.3 scrimmage yards with eight total touchdowns over his last six contests, compared to 83.7 yards and five scores over his first six games. The two-time Pro Bowler is on pace for career highs in rushing yards, rushing average, receptions and receiving yards, with his 2025 production coming versus defenses much more stout than what Dallas possesses. The Cowboys have allowed the second-most points and the fourth-most yards this season, in addition to giving up the third-most receiving yards to running backs, which increases the value of a pass-catching RB like Gibbs. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set Lions vs. Cowboys NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Thursday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Thursday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg"
      ],
      "datePublished": "2025-12-04T23:25:39.000Z",
      "dateModified": "2025-12-04T23:25:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys kicker Brandon Aubrey sets multiple NFL records on 'TNF' vs. Lions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-kicker-brandon-aubrey-nfl-records-field-goal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/9198c620-caad-4eaa-ad50-6c6d28c7ca2e/thumbnail/1200x675/7bd8d4582ddaee30a41b77b703a6f7d1/untitled-design-2025-12-04t205411-383.png",
    "tag": "Sports",
    "date": "2025-12-05T05:13:31.000Z",
    "description": "\n        Brandon Aubrey has had some impressive games in his career, but he might have outdone himself on Thursday night in Detroit. The kicker broke ",
    "body": "\n        Brandon Aubrey has had some impressive games in his career, but he might have outdone himself on Thursday night in Detroit. The kicker broke two NFL records against the Lions and he was one of the few bright spots for the Dallas Cowboys in a 44-30 loss at Ford Field. Aubrey re-wrote the NFL record book with his first four field goals of the night, which came from 42, 55, 57 and 63 yards. He then tacked on a fifth one in the fourth quarter when he hit from 29 yards out, marking just the second time in his career that he's hit five field goals in a game. With that in mind, let's take a closer look at the three NFL records that Aubrey either established or extended. No. 1: Most field goals of 55 yards or more in a single gameAfter hitting a 57-yard field goal in the first quarter, Aubrey followed that up by nailing a 55-yard kick in the second quarter. He then added 63-yard field goal in the third quarter, which made him the first player in NFL history to hit three field goals of 55 yards or more in the same game. Several kickers had hit two field goals from 55 yards or longer, but no one had ever hit three until Aubrey came along on Thursday night. No. 2: Most field goals of 60 yards or more in a single seasonBack in 2019, Cowboys kicker Brett Maher became the first player in NFL history to hit two field goals of 60 yards or more in a single season. Aubrey tied that record in 2024, and now, he's topped it. Aubrey's 63-yard kick in the third quarter was his third field goal from 60 yards or more this year, giving him the record to himself. \nAubrey hit a 64-yarder back in Week 2 during a 40-37 win over the Giants. (The clutch kick actually sent the game to overtime.) The Cowboys kicker also hit a 61-yarder in Week 7 against the Commanders. The kick against the Lions was his third career make from 63 yards or longer, which is absolutely absurd, when you consider that there have only been 15 total field goals from 63 yards or longer in NFL history. Unfortunately for the Lions, three of the 15 kicks have come against Detroit with Aubrey, Tom Dempsey and Justin Tucker all hitting from 63 or longer.No. 3: Most career field goals of 60 yards or moreGoing into the 2025 season, Brett Maher held the record for most career field goals of 60 yards or more with four. Aubrey broke that record back in Week 7 when he hit the fifth 60-yarder of his career. He extended that record to six with his 63-yarder against the Lions. \nAubrey has turned into the ultimate kicking weapon. The Cowboys are literally in field goal range as soon as they get to midfield. Although kickers are getting stronger and stronger, no one is hitting 60-yard kicks with regularity like Aubrey. There have only been nine field goals of 60 yards or more in the NFL this year and Aubrey has three of them. No other kicker in the NFL has more than one.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys kicker Brandon Aubrey sets multiple NFL records on 'TNF' vs. Lions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/9198c620-caad-4eaa-ad50-6c6d28c7ca2e/thumbnail/1200x675/7bd8d4582ddaee30a41b77b703a6f7d1/untitled-design-2025-12-04t205411-383.png"
      ],
      "datePublished": "2025-12-05T05:13:31.000Z",
      "dateModified": "2025-12-05T05:13:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prisco's Week 14 NFL picks: Steelers vs. Ravens prediction and more expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-14-nfl-picks-bets-gambling-packers-bears-cowboys/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/a72cb474-27cd-40ab-b886-bfc14bc94910/thumbnail/1200x675/1880c917bec7447395d7a6b6ae991727/lamar-jackson.jpg",
    "tag": "Sports",
    "date": "2025-12-05T10:00:52.000Z",
    "description": "\n        Yes. Yes. Yes. It was a winning week both ways for me with my NFL picks last week.As the NFL season winds down, I am starting to get hotter t",
    "body": "\n        Yes. Yes. Yes. It was a winning week both ways for me with my NFL picks last week.As the NFL season winds down, I am starting to get hotter than Cleveland Browns fans when you say their quarterback of the future isn't on their current roster.I went 11-5 straight up and 9-6-1 against the spread last week with my NFL picks. That takes my straight-up record to 133-60-1 and my ATS record to 100-93-1.The ship has been righted.With 14 games this week -- a lot of them key ones in the playoff races -- let's see if I can stay hot.Bet NFL Week 14 games and NFL odds at DraftKings, where new users who win a $5 wager get $200 in bonus bets:Dallas Cowboys (+3) at Detroit LionsThursday, 8:15 p.m. ET on Prime Video\nThis is a playoff game. Both teams need it in the worst way. Dallas has come alive the past two weeks, while the Lions have been leaking oil. The Cowboys offense should be able to move the football here, while the improved Dallas defense will be able to limit the Lions late to win it. It's close, but the Cowboys take it.Pick: Cowboys 34, Lions 33 | Odds via DraftKings Sportsbook\n        \n            \n                Cowboys vs. Lions prediction: Can Jared Goff and Co. keep up with Dak Prescott and the potent Dallas offense?\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nCincinnati Bengals at Buffalo Bills (-5.5)Sunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nJoe Burrow being back has brought life to the Bengals. They can't afford another loss, but beating the Bills on the road will be tough to do. The Bills ran it right at the Steelers for over 240 yards and will do the same here. The Bengals will have trouble stopping the run as the Bills control the ball and Josh Allen hits some timely throws.Pick: Bills 27, Bengals 20 | Odds via Caesars SportsbookIndianapolis Colts at Jacksonville Jaguars (+1.5)Sunday, 1 p.m. ET CBS (Stream on Paramount+)\nThe Colts have lost three of four and they now trail the Jaguars in the AFC South race. The Colts haven't won in Jacksonville since 2014, which is hard to believe. The Colts love to run the ball, but the Jaguars are No. 1 in run defense. That will put it on Daniel Jones, who is limited with a broken fibula. I don't think he can win it , while Trevor Lawrence will make plays against the Sauce Gardner-less defense. Jaguars win it.  Pick: Jaguars 21, Colts 17 | Odds via BetMGMMiami Dolphins at New York Jets (+2.5)Sunday, 1 p.m. ET CBS (Stream on Paramount+)\nThe Dolphins are somehow still alive in the playoff chase, while the Jets have won three of their last five games. The Dolphins haven't played well in the cold and this could be one of those games. The Jets have played better on defense lately and the offense has shown some signs of life. The defense will keep it close as they win it.  Pick: Jets 24, Dolphins 20 | Odds via FanDuel SportsbookNew Orleans Saints (+8.5) at Tampa Bay BuccaneersSunday, 1 p.m. ET CBS (Stream on Paramount+)\nThe Saints are playing consecutive road games in Florida after losing to the Dolphins last week. They showed fight in that game and they seem to always show it against the Bucs. But this Tampa Bay team is pushing for a playoff spot. That matters. The Bucs win it behind a big game by their running attack.  Pick: Buccaneers 24, Saints 17 | Odds via BetMGM\n        \n            \n                NFL Week 14 picks and score predictions: Cowboys shock Lions, Bengals stun Bills, Packers edge Bears\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nPittsburgh Steelers at Baltimore Ravens (-6)Sunday, 1 p.m. ET CBS (Stream on Paramount+)\nThis is for first place in the AFC North. Both teams are coming off bad losses, both at home. Neither team is playing well, but the Ravens are playing a little better. The Steelers have major defensive issues. Look for a big game by Derrick Henry as the Ravens win it behind a big rushing performance.  Pick: Ravens 27, Steelers 14 | Odds via DraftKings SportsbookSeattle Seahawks (-7.5) at Atlanta FalconsSunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nThis is a long trip for Seattle, but the Seahawks are playing a team that is playing for nothing. That matters. The Seattle defense is really good and will travel well here and cause problems for Kirk Cousins. Sam Darnold hits a few deep shots too. Seattle wins it.Pick: Seahawks 27, Falcons 16 | Odds via FanDuel SportsbookTennessee Titans at Cleveland Browns (-4.5)Sunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nThis is the dog game of the day, but it does feature two quarterbacks from the 2025 draft class in Cam Ward and Shedeur Sanders. Both have done some good and bad things. The Browns defense is much better than what Sanders will face. Look for the Browns to win it behind that defense.  Pick: Browns 20, Titans 10 | Odds via Caesars SportsbookWashington Commanders at Minnesota Vikings (+1.5)Sunday, 1 p.m. ET on Fox (Stream: Fubo -- try for free)\nThese two are among the biggest disappointments this season. The Vikings will have J.J. McCarthy back at quarterback, but it will be Marcus Mariota again for the Commanders. The Vikings have the better defense, which will be the difference here.  Pick: Vikings 24, Commanders 17 | Odds via BetMGMDenver Broncos (-7.5) at Las Vegas RaidersSunday, 4:05 p.m. ET on CBS (Stream on Paramount+)\nThe Broncos are playing consecutive road gams, but it doesn't matter here. The Raiders offense is awful and the line is even worse. The Broncos' defensive front will dominate this game and get turnovers that lead to short fields. The Broncos will keep rolling.  Pick: Broncos 31, Raiders 14 | Odds via FanDuel SportsbookChicago Bears at Green Bay Packers (-6.5)Sunday, 4:25 p.m. ET on Fox (Stream: Fubo -- try for free)\nThis is an enormous game in the NFC North. The Bears lead the division and are coming off an impressive road victory over the Eagles, while the Packers beat up the Lions on the road. This is Ben Johnson vs. the Packers defense in terms of the key matchup. But I think it will be a Jordan Love game. He stays hot and the Packers win it.  Pick: Packers 28, Bears 20 | Odds via FanDuel SportsbookLos Angeles Rams (-8) at Arizona CardinalsSunday, 4:25 p.m. ET on Fox (Stream: Fubo -- try for free)\nThe Rams are playing consecutive road games, although this is a short trip. They will be focused here after losing to the Panthers in a big upset last week. Look for Matthew Stafford to bounce back in a big way. The Cardinals have lost a lot of close games. This won't be one of them.  Pick: Rams 34, Cardinals 20 | Odds via BetMGMHouston Texans at Kansas City Chiefs (-3.5)Sunday, 8:20 p.m. ET on NBC \nThis is a playoff game for these two. Loser has major problems and likely won't make it. The Texans are also playing consecutive road games. But that defense is impressive. Even so, give me the Chiefs and Patrick Mahomes to stay alive in a game they have to have.  Pick: Chiefs 23, Texans 17 | Odds via DraftKings SportsbookPhiladelphia Eagles (-3) at Los Angeles ChargersMonday, 8:15 p.m. ET on ESPN/ABC (Stream: Fubo -- try for free)\nThe Eagles are coming off a horrible home loss to the Bears where they were mauled in the run game. The Chargers won last week, but quarterback Justin Herbert injured his non-throwing hand. That has to impact him some this week. I think the Eagles will get back on track here against a bad Chargers offensive line and the Philly run game will get going. Pick: Eagles 26, Chargers 20 | Odds via BetMGM\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prisco's Week 14 NFL picks: Steelers vs. Ravens prediction and more expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/a72cb474-27cd-40ab-b886-bfc14bc94910/thumbnail/1200x675/1880c917bec7447395d7a6b6ae991727/lamar-jackson.jpg"
      ],
      "datePublished": "2025-12-05T10:00:52.000Z",
      "dateModified": "2025-12-05T10:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas State hires Collin Klein as coach to succeed retiring Chris Klieman - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/kansas-state-hires-colin-klein-as-coach-program-legend-succeeds-retiring-chris-klieman/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/9b3cd37e-e451-4f1f-a28a-3a2b643054bc/thumbnail/1200x675/230aee29ae3d904281e08718705573a0/collin-klein-texas-a-m.jpg",
    "tag": "Sports",
    "date": "2025-12-05T04:11:47.000Z",
    "description": "\n        Kansas State officially hired legendary former quarterback Collin Klein as coach, the program announced Thursday. Klein, 36, had most recentl",
    "body": "\n        Kansas State officially hired legendary former quarterback Collin Klein as coach, the program announced Thursday. Klein, 36, had most recently served as Texas A&M's offensive coordinator. He succeeds Chris Klieman, who retired Wednesday, and 247Sports had reported Klein was in line to be the next head man in charge for the Wildcats.Klein will continue to coach the Aggies through the College Football Playoff.After redshirting at Kansas State in 2008, Klein played wide receiver in 2009 before converting to quarterback in 2010. He took over full-time behind center the next year, and across 2011 and 2012, he accumulated a 21-5 record, threw for 29 touchdowns, ran for 50 touchdowns and finished third in 2012 Heisman Trophy voting. The Wildcats reached as high as No. 2 in his senior season, tied for their highest ranking ever.Klein returned to Kansas State as a coach in 2014 and slowly worked his way up from low-level assistant to quarterbacks coach to co-offensive coordinator to, finally, offensive coordinator from 2022-23. Texas A&M hired him away after the 2023 season. Now, however, he returns to the place that made him a star.Klein's contract is for five years, with an average base salary of $4.3 million.Klieman, who took over for the iconic Bill Snyder in 2019 and was under contract through 2032, produced several strong seasons upon his arrival in Manhattan, including a 10-win campaign in 2022 and bowl wins in 2021, 2023 and 2024.But the Wildcats are just 6-6 this season after being ranked 17th in the AP preseason poll. They'll hope Klein -- the first Kansas State alum to be head coach since Ellis Rainsberger from 1975-77 -- can get things back on track.\nHere's more analysis from CBS Sports' Cody Nagel:He spent five seasons on Klieman's staff, including two as offensive coordinator, before departing for College Station ahead of the 2024 season. Klein's familiarity with Kansas State's roster, donors and recruiting base -- combined with his status as one of the program's most accomplished former players -- has made him the university's leading target as succession planning accelerates.As a coach, Klein quickly made his mark when he joined the staff in 2017. He served as Kansas State's offensive coordinator for two seasons in 2022-23, taking a unit that ranked outside the top 75 nationally in 2021 to top-25 rankings in multiple offensive categories before his departure. His offenses became known for efficiency and balance: total offense jumped from 362.3 yards per game in 2021 to 446.1 in 2023, scoring jumped from 27.5 to 37.8 points per game, and his final unit led the nation in red-zone touchdown conversion rate at 78.7%. The Wildcats' rushing attack also flourished, producing top-15 units nationally in yards per game, while quarterbacks posted school-record low interception percentages.After joining Texas A&M in 2024, Klein helped guide the Aggies to a 5-0 start in SEC play, marking the program's best conference start since 1998. The offense ranked second in the SEC in rushing behind a strong offensive line. Texas A&M ranks 16th nationally in scoring offense with 36.3 points per game this season. Klein is a semifinalist for the Broyles Award, given annually to the top assistant coach in college football.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas State hires Collin Klein as coach to succeed retiring Chris Klieman - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/9b3cd37e-e451-4f1f-a28a-3a2b643054bc/thumbnail/1200x675/230aee29ae3d904281e08718705573a0/collin-klein-texas-a-m.jpg"
      ],
      "datePublished": "2025-12-05T04:11:47.000Z",
      "dateModified": "2025-12-05T04:11:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 Hero World Challenge leaderboard: Scottie Scheffler shares lead in Bahamas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/hero-world-challenge-leaderboard-2025-scheffler-first-round-lead/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/b4178228-15ea-43a8-99ee-e0b37fe98c52/thumbnail/1200x675/fa7d3d06911cf0fe6e5d51d59ef9cf72/scottie-scheffler-hero-r1-g.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:08:05.000Z",
    "description": "\n        It may not be an official event on the PGA Tour, but Scottie Scheffler's name is officially atop a star-studded leaderboard after the first r",
    "body": "\n        It may not be an official event on the PGA Tour, but Scottie Scheffler's name is officially atop a star-studded leaderboard after the first round of play at the 2025 Hero World Challenge. The world No. 1 looked the part Thursday at Albany Golf Course in the Bahamas as he posted an opening 6-under 66 to share the lead with Wyndham Clark, J.J. Spaun, Sepp Straka and Akshay Bhatia.Scheffler pushed his total all the way out to 7 under before making a bogey on the par-4 18th -- his first dropped shot at Albany GC in 41 holes dating back to last year's tournament. \"I felt pretty good. I think there's always going to be some rust in there,\" Scheffler said. \"But I don't really think about that when I'm out there playing; I'm just trying to shoot a score.\"With a new driver in play, Scheffler was up to his old antics. He delivered a large diet of fairways and greens -- hitting 11 out of 13 and 15 out of 18, respectively -- taking on risk when he felt it was warranted. For someone as methodical as the two-time defending champion, those spots were few and far between.\n\"I didn't see anything off the face that I didn't feel in my hands, so that's typically a pretty good thing for me with the driver,\" Scheffler said. \"When I feel something, when I look up, I want … it to match, so today, I didn't see anything out of the ordinary, so that's a pretty good spot to be in.\"Scheffler rolled in just about a 30-foot birdie bomb on his second hole, took care of a couple of par 5s and placed his tee shot just short of the putting surface on the short par-4 7th. Even when he failed to make a birdie on the par-5 9th, he walked off the green and made the turn in 4 under, barely breaking a sweat, it seemed.Cruise control continued to be put in place despite some left misses creeping into his swing -- the same miss which held him back at times in the early portion of this calendar year -- and some uncharacteristic chip shots squandering scoring opportunities. \n\"I think the grain has a lot to do with it,\" Scheffler said. \"The ball has a tendency to sit down in the turf. And a lot of it's rough here, so you're below the green, ball's sitting down. It can be pretty challenging.\"Scheffler sauntered on and pencilled a turkey of birdies onto his scorecard on Nos. 13-15: the first from 11 feet, the second courtesy of a two-putt after driving the putting surface, and the third on the final par 5 on the golf course after reaching the green in two. His lone dropped shot on the last may have dropped Scheffler out of the solo lead, but it has not dropped him out of the minds of the other 19 players in this tournament who all know they will have to go through him if they are to prove victorious.\nNew bagman, manIt's that time of the year when guys are debuting new clubs and testing out new swing feels, but for Bhatia, it is a time to work with his new caddie. Joe Greiner, of course, was alongside Max Homa for multiple years and experienced a short stint with Collin Morikawa this past season.With both of his previous players hailing from California, Greiner added another California kid in Bhatia to his list of bosses. Unlike Homa and Morikawa, however, Bhatia stands on the other side of the golf ball -- the same spot where Greiner does when he plays -- which he believes will prove beneficial when visualising and discussing golf shots with his new caddie.\"It's been really cool. We grew up in the same town in California,\" Bhatia said. \"Obviously, it's really cool to have a lefty on my bag …I've really been eager to work with him. Finally, it just worked out timing-wise. So, it's been really cool this week just to kind of understand each other, and yeah, it's been fun.\n\"I think certain golf courses, certain shots, certain cues that we have, he really understands that. And again, I think from the majority of lefties that I've met, Phil, Bubba, myself, very creative, and I think lefty has something to do with that I believe. … It's an exciting thing for me for someone to see a shot the way I do.\"Clark calls upon a coachAfter two straight stellar seasons, Clark came back down to Earth in 2025. With only seven top 20s and two top-five finishes to his name across 25 starts, the former U.S. Open champion now looks to get back to where he was during that major-winning campaign a couple of years ago.And that starts with the swing and his usual left-to-right shot shape. Clark admitted he saw the left misses creep into his game this past season, and with the help of a new swing coach, he is working to eliminate that side of the golf course by wheeling and dealing a hefty doses of fades. \n\"[I'm] coming off a really poor year, and I've worked really hard,\" Clark said. \"The nice thing is kind of like the last two, three weeks I've started to see some improvement, so I'm excited about that.\"I'd kind of gone three years without really seeing anyone. I saw Butch [Harmon] a couple times last year. Right now, I just hired and started working with this guy, Pat Coyner. I was spending some time in the offseason in Colorado at Cherry Hills, and he just became the new teaching pro there. We started bouncing ideas off each other, kind of liked what he had to say. I started hitting it better, and I said, 'Alright, why don't you come help me.'\"Jordan Spieth reemergesThe three-time major champion said he weighed playing in the FedEx Cup Fall but decided otherwise, opting instead to work on his game with his last official start coming in the St. Jude Championship in August. Spieth's game was working for him early in his round as he was 3 under through seven holes before he slowly but surely started to go in the wrong direction.\nSpieth played his final 11 holes in 3 over to offset his early gains and settle into a share of 17th place. Statistically, he ranked second-to-last putting and outside the top half in both ball striking categories. Rust is to be expected this time of year, and while the swing continues to be worked on, the putter is the club to watch over these next 54 holes. It typically serves as a lightning rod to his game -- a momentum saver or momentum killer -- and unfortunately, it killed just about all his mojo in Round 1.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 Hero World Challenge leaderboard: Scottie Scheffler shares lead in Bahamas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/b4178228-15ea-43a8-99ee-e0b37fe98c52/thumbnail/1200x675/fa7d3d06911cf0fe6e5d51d59ef9cf72/scottie-scheffler-hero-r1-g.jpg"
      ],
      "datePublished": "2025-12-04T22:08:05.000Z",
      "dateModified": "2025-12-04T22:08:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Lions vs. Cowboys on Thursday Night Football - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-lions-vs-cowboys-thursday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:54:11.000Z",
    "description": "\n        The Week 14 NFL schedule opens on Thursday Night Football with one of the most exciting matchups of the slate, making this an ideal time to u",
    "body": "\n        The Week 14 NFL schedule opens on Thursday Night Football with one of the most exciting matchups of the slate, making this an ideal time to utilize the current DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The Detroit Lions (7-5) will host the Dallas Cowboys (6-5-1) in a crucial NFC matchup. The SportsLine Projection Model finds the best value in this contest from backing the Cowboys as 3-point underdogs in its Thursday best bets at DraftKings Sportsbook for online sports betting. The over/under for Cowboys vs. Lions is 55.5 points, the highest on the entire NFL Week 14 odds board.The model is also backing the Nets to cover as 4.5-point underdogs against the Jazz in NBA action, while one of SportsLine's top experts has locked in a play from the Thursday college basketball slate. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Thursday best bets at DraftKings SportsbookNets (+4.5) vs. JazzCowboys (+3) vs. Lions UC Davis (+9.5) vs. HawaiiCombining the model's three picks into a Thursday parlay at DraftKings would result in a payout of +587 (risk $100 to win $587). Bet it at DraftKings here:\nNets (+4.5) vs. Jazz (-110)Don't look now, but the Brooklyn Nets are on a winning streak. The Nets have won back-to-back games for the first time all season, defeating the Hornets, 116-103, on Monday before knocking off the Bulls, 113-103, last night. Brooklyn is 5-16 on the year, but the Nets have received steady contributions from players such as Michael Porter Jr. and Nic Claxton. Porter is averaging 25.3 points per game in his first season in Brooklyn, including 34 points over his last two games. Claxton had 14 points, eight rebounds and nine assists against the Bulls. The Jazz are 7-13 and have lost their last four road games. The model projects the Nets to cover in 68% of simulations. Back the Nets at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Cowboys (+3) vs. Lions (-108)The Cowboys have won three straight games, knocking off the Eagles and Chiefs over the last two weeks, and any time you defeat both Super Bowl teams from the previous season over a short stretch, your team is clearly doing something right. For Dallas, they are doing things right on both sides of the ball, which has been a rarity this season. Dallas had one of the worst defenses in the NFL before the trade deadline, but adding defensive lineman Quinnen Williams from the Jets and linebacker Logan Wilson from the Bengals has changed that. The Cowboys are allowing 21.7 ppg over their last three games, compared to 30.8 ppg over their first nine contests. Offense has never been the issue, with Dallas ranking second in the league at 29.3 ppg, and with the Lions' offense battling some key injuries, the model projects Dallas to cover the spread in 50% of simulations. Given the possibility of a push with a 3-point Lions victory, the model sees Dallas +3 as the strongest option for Thursday Night Football. Back the Cowboys at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:UC Davis (+9.5) vs. Hawaii (-115)\"I have these teams rated closer than the large spread indicates,\" SportsLine expert Thomas Casale said. \"Both teams have played well the two times they stepped up in class. Hawaii has close losses to Arizona State and Oregon, while UC Davis upset Nevada and played tough at Colorado. I think the Rainbow Warriors' metrics are a bit overrated right now, thanks to a soft schedule. Another factor could be turnovers. Hawaii's biggest weakness is turnovers, and UC Davis pressures the ball at an above-average rate. Ten of the last 13 games between these two have been decided by eight points or less.\" Back UC Davis at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more Thursday Night Football, NBA, college basketball picks?You've seen some of the model's Thursday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Lions vs. Cowboys on Thursday Night Football - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-04T23:54:11.000Z",
      "dateModified": "2025-12-04T23:54:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Madison hires Billy Napier as ex-Florida coach returns to Sun Belt - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/james-madison-billy-napier-head-coach-florida/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/5df8cc93-c381-45a0-bef0-e2323e06ec05/thumbnail/1200x675/50a3ce712c5ad03a9b06f6b1598dfda3/billy-napier.png",
    "tag": "Sports",
    "date": "2025-12-04T22:25:17.000Z",
    "description": "\n        Billy Napier is set to make his return to the Sun Belt Conference. James Madison is hiring Napier to fill the coaching vacancy left by Bob Ch",
    "body": "\n        Billy Napier is set to make his return to the Sun Belt Conference. James Madison is hiring Napier to fill the coaching vacancy left by Bob Chesney, sources confirmed to CBS Sports' Matt Zenitz. Chesney will depart James Madison for UCLA whenever the Dukes' postseason run ends. James Madison is set to face off against Troy in the Sun Belt Championship Game on Friday, and the Dukes are also in College Football Playoff contention after they landed at No. 25 in that latest set of rankings. It didn't take long for Napier to land another job after he was fired by Florida in October amid a 3-4 start to the 2025 season. Napier's Gators entered the year at No. 15 in the AP Top 25 poll, and the expectation was that they would compete for a spot in the College Football Playoff after a solid close to the 2024 campaign and the return of several key contributors, including quarterback DJ Lagway and top offensive lineman Jake Slaughter. But an early upset loss to South Florida knocked Florida out of the rankings entirely and precipitated an early three-game losing skid for the Gators. A stunning win against No. 9 Texas wasn't enough to save Napier, who left Gainesville after four seasons and a 22-23 overall record. \nHe won just one bowl game with the Gators and never finished above .500 in conference play. Prior to his hiring at Florida, Napier spent four seasons as the coach at Louisiana from 2018-21. He's also served as an assistant at Clemson (2006-10), Colorado State (2012), Alabama (2013-16) and Arizona State (2017). Napier is proven in Sun Belt After taking huge swings on upside in each of its last two hiring cycles, James Madison is turning to a proven name to take it into its next era. No coach on the market comes with more high-level Sun Belt experience than Napier. \nHe was one of the Sun Belt's top coaches during his tenure at Louisiana. He led the Ragin' Cajuns to four-straight Sun Belt West division titles and won the conference two years in a row from 2020-21. Louisiana also finished ranked inside the top-20 of the AP poll in each of those seasons. He won at least 10 games from 2019-21 and boasted a 22-2 Sun Belt record in that same span. The Ragin' Cajuns also made a bowl in each of his four years with the program. He was the first coach since 2011-14 to lead Louisiana to four consecutive bowl games. Can Napier maintain James Madison's success?James Madison has emerged as one of the Group of Five's premier programs since its move from the FCS to the FBS level in 2022. Though he was never able to compete for a Sun Belt title due to the NCAA's regulations for schools in a transitional period, former coach Curt Cignetti was crucial for establishing James Madison's run of dominance. \nHe guided the Dukes to an 8-3 record in their first year as an FBS institution and followed that up with an 11-1 showing in 2023. James Madison finished atop the Sun Belt East division and earned a bid to the Armed Forces Bowl since there weren't enough eligible teams that qualified for a bowl. Cignetti parlayed that success into an opportunity at Indiana, where he has a 23-2 record over two seasons. The Hoosiers currently sit at No. 2 in the College Football Playoff Rankings and they're gearing up for a program-first appearance in the Big Ten Championship Game. James Madison hired Chesney, a former coach at FCS Holy Cross, to replace Cignetti. Chesney followed a solid 9-4 effort from 2024 with his 11-1 record this season, including a sterling 8-0 showing in Sun Belt play. Like Cignetti, Chesney used his success at JMU to earn a shot at UCLA. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Madison hires Billy Napier as ex-Florida coach returns to Sun Belt - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/5df8cc93-c381-45a0-bef0-e2323e06ec05/thumbnail/1200x675/50a3ce712c5ad03a9b06f6b1598dfda3/billy-napier.png"
      ],
      "datePublished": "2025-12-04T22:25:17.000Z",
      "dateModified": "2025-12-04T22:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James' double-digit scoring streak ends in the most LeBron way possible - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lakers-lebron-james-double-digit-scoring-streak-ends/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/74a2a0e7-ab6b-43bf-8f0c-00ed068c5651/thumbnail/1200x675/36de6f57f7587c24da9eb281b84080d9/untitled-design-2025-12-04t193025-564.png",
    "tag": "Sports",
    "date": "2025-12-05T03:50:48.000Z",
    "description": "\n        A baby born on the last day that LeBron James scored single-digit points in a regular season NBA game would be an adult today. It has been ne",
    "body": "\n        A baby born on the last day that LeBron James scored single-digit points in a regular season NBA game would be an adult today. It has been nearly 19 years since James was last held below 10 points in the regular season, the last such occasion coming on Jan. 5, 2007. That's a stretch of 1,297 total games. But when the final buzzer sounded between the Los Angeles Lakers and Toronto Raptors on Thursday, James had only eight points. The mythical streak had finally, amazingly, come to an end.And it ended in the most LeBron James-possible fashion. With the score tied at 120 and the final seconds ticking down, Austin Reaves, who finished the game with 44 points, tried to create an opening for a game-winner. When Scottie Barnes crept over to double Reaves, he passed it to a wide open James, who bolted into the lane. A frantic Immanuel Quickley rotated over from the corner to pick him up, which left Rui Hachimura wide open. James did what he's been doing for even longer than he's been scoring double-digit points in regular-season games: he made the right basketball play. He passed the ball to Hachimura, who drilled the game-winning 3-pointer, leaving James, who could have attempted his own game-winner to reach 10 points, stranded at eight as time expired.\nThroughout his career, James has drawn criticism for making passes just like this. In Game 1 of the 2007 Eastern Conference finals, he made a similar pass to Donyell Marshall in the final seconds, but he missed the possible game-winning 3-pointer and the Cavaliers lost by two. In Game 5 of the 2020 NBA Finals, James could have won the championship with his own final shot. He passed the ball to Danny Green instead, who also missed. His critics, many of whom love to point out how eager players like Michael Jordan and Kobe Bryant are to take game-ending shots, yelled that as the star, he should have been responsible for scoring those final, critical points.But James has never been wired like Jordan or Bryant. He always makes the right basketball play, even if that play means giving the ball to someone else. It can come in the first quarter of a random game. It can come with the title on the line. It can even cost him one of his most legendary streaks. But James is always going to make the play he believes gives his team the best chance to win. He did that on Thursday, and it paid off for the Lakers. James never doubted the process. \n\"You always make the right play,\" James explained after the game. \"That's just been my M.O. That's how I was taught the game. I've done that my whole career. There's not even one second guessing that. Once they doubled AR and the ball got swung to me, I know it's a numbers game. We've got a 4-on-3 advantage. I was just trying to put the ball on time, on target in Rui's socket, in his shot pocket, and he knocked it down.\"That attitude is going to serve the Lakers well this season. James is now 41 years old. Through his first five games this season, he was already averaging a career-low 15.2 points per game. James has tended to start seasons slowly as a Laker, but there's a pretty noticeable difference this season as he's worked his way back from sciatica. The player who is used to controlling every aspect of his team's offense is clearly struggling to get up to speed. James already had one streak scare on Monday against the Phoenix Suns. He finished the loss with exactly 10 points, and he needed 31 minutes to get them.But the Lakers don't need James scoring at the volume that he typically has. Reaves and Luka Dončić entered Thursday's game averaging a combined 63.4 points per game, the most ever by a post-merger pair of teammates. The Lakers have more than enough scoring.\nWhat they need is for James to fit in. To play hard on defense, get rebounds and make the smart pass. He did all of that on Thursday. Case in point: he may not have reached double digit points, but he got to 11 assists in a victory. That has always been his preference, and it's what's going to make him a valuable player even as age leads to inevitable decline. James isn't as fast as he used to be. He may not be able to jump as high or play quite as hard on a possession-by-possession basis. But he's a pathologically unselfish basketball genius, and that's the sort of player that every team could benefit from. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James' double-digit scoring streak ends in the most LeBron way possible - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/74a2a0e7-ab6b-43bf-8f0c-00ed068c5651/thumbnail/1200x675/36de6f57f7587c24da9eb281b84080d9/untitled-design-2025-12-04t193025-564.png"
      ],
      "datePublished": "2025-12-05T03:50:48.000Z",
      "dateModified": "2025-12-05T03:50:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UAB expected to hire Alex Mortensen: Interim coach in line for full-time job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/uab-alex-mortensen-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/3e30b53f-9b76-4556-9571-ca9b8b39ea12/thumbnail/1200x675/8f31ef2ebe916af93077eba84cfd98c2/alex-mortensen-uab.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:56:23.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UAB is working to finalize a deal to make former o",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UAB is working to finalize a deal to make former offensive coordinator and interim coach Alex Mortensen the team's next full-time head coach, CBS Sports' John Talty reports.Mortensen, 40, took over as the Blazers' interim coach halfway through the 2025 season following the firing of Trent Dilfer. In his debut, Mortensen and UAB upset then-No. 22 Memphis; overall, the Blazers went 2-4 under Mortensen and finished the season 4-8.Mortensen is the son of longtime ESPN NFL reporter and analyst Chris Mortensen, who died in 2023.Alex Mortensen started his collegiate playing career at Arkansas in 2004 and 2005, transferred to FCS-level Samford and then returned to the Razorbacks for the 2008 season. He began his coaching career in 2012 and quickly ascended the ranks, becoming an Alabama graduate assistant and then analyst. Dilfer hired Mortensen as his offensive coordinator at the end of the 2022 season. Since 2023, the Blazers rank third in the American Conference in passing yards per game (272) and sixth in total yards per game (415.6).\nMortensen faces an uphill battle. The Blazers are just 11-25 (7-17 in conference play) since joining the American Conference from the Conference USA, and they have not made a bowl in any of those three seasons.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UAB expected to hire Alex Mortensen: Interim coach in line for full-time job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/3e30b53f-9b76-4556-9571-ca9b8b39ea12/thumbnail/1200x675/8f31ef2ebe916af93077eba84cfd98c2/alex-mortensen-uab.jpg"
      ],
      "datePublished": "2025-12-04T22:56:23.000Z",
      "dateModified": "2025-12-04T22:56:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn State coaching search: Micah Parsons backs Terry Smith for full-time job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-coaching-search-micah-parsons-terry-smith/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/221ab564-a8d8-4d8e-82b6-570e5fe14266/thumbnail/1200x675/64761f340ccc4b84019245c4b3fc81d8/micah-parsons-packers.jpg",
    "tag": "Sports",
    "date": "2025-12-04T21:02:59.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Penn State's coaching search continues, one of ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Penn State's coaching search continues, one of the Nittany Lions' best former players made his voice heard. Packers star edge defender Micah Parsons said Penn State should elevate Terry Smith, who served as the team's interim coach after the program fired James Franklin.Parsons, 26, said his relationship with Smith goes back to when he was 14 years old. Parsons starred at Penn State from 2018-19, recording five sacks and 14 tackles for loss as a sophomore in 2019. He opted out of the 2020 COVID-impacted season before going 12th overall to the Cowboys in 2021 NFL Draft.\nSmith played wide receiver at Penn State from 1987-91 and has been on Penn State coaching staff since 2014, working his way up from cornerbacks coach to associate head coach to, after six games this season, interim head coach. The Nittany Lions went 3-3 under Smith, winning each of their final three games to finish the regular season 6-6. The team awaits its bowl fate, though Smith has not been informed of his future.The on-field product took a back seat to a coaching search gone awry. Louisville's Jeff Brohm and BYU's Kalani Sitake are the latest coaches who signed extensions after being linked to the Nittany Lions' opening. Sitake, in particular, seemed close to heading to Happy Valley before a full-scale effort from the Cougars and their donors kept him at his alma mater.\nOverall, eight coaches who had been potentially tied to Penn State's opening received new contracts from their current team.CoachSchoolContract extensionCurt CignettiIndiana8 years, $93 millionMatt RhuleNebraska2 years, $25 millionMike ElkoTexas A&M6 years, $66+ millionEli DrinkwitzMissouri6 years, $64.5 millionClark LeaVanderbilt6 years, UnknownKalani SitakeBYUUnknownBrent KeyGeorgia Tech5 years, $32.5 millionJeff BrohmLouisvilleUnknown\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State coaching search: Micah Parsons backs Terry Smith for full-time job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/221ab564-a8d8-4d8e-82b6-570e5fe14266/thumbnail/1200x675/64761f340ccc4b84019245c4b3fc81d8/micah-parsons-packers.jpg"
      ],
      "datePublished": "2025-12-04T21:02:59.000Z",
      "dateModified": "2025-12-04T21:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Playoff odds implications for Eagles vs. Chargers on Monday Night Football - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-playoff-implications-for-eagles-vs-chargers-on-monday-night-football-from-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/39ea8ea9-8476-499f-a563-62bf82cf5fab/thumbnail/1200x675/a8762a3b9d2132d10d62522b87634eed/jalen-hurts-philadelphia-eagles-imagn-images-4.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:18:05.000Z",
    "description": "\nThe reigning Super Bowl champion Philadelphia Eagles once again are facing adversity as they have lost back-to-back games for the second time this se",
    "body": "\nThe reigning Super Bowl champion Philadelphia Eagles once again are facing adversity as they have lost back-to-back games for the second time this season. The Los Angeles Chargers have won four of their last five contests but are dealing with a problem of their own as quarterback Justin Herbert is dealing with a hand injury.Philadelphia and Los Angeles attempt to overcome their issues when they square off in Week 14 of the 2025 NFL season at SoFi Stadium on Monday Night Football.Philadelphia (8-4) bounced back from consecutive losses to the Denver Broncos and New York Giants in early October with four straight victories, but the Eagles squandered a 21-point lead against the Dallas Cowboys in Week 12 and dropped a 24-21 decision before being embarrassed at home by the Chicago Bears 24-15 last week.Despite its current struggles, Philadelphia owns a 1 1/2-game lead over Dallas in the NFC East. But the club will need to get untracked offensively if it hopes to avoid another defeat as it has recorded only two touchdowns since early in the second quarter against the Cowboys.\nBoth of those TDs came on passes from Jalen Hurts to A.J. Brown, who have accounted for all six of the Eagles' touchdowns over their last three games. Hurts has run for three scores, giving him a team-high eight rushing TDs, and connected with Brown for the other three.Saquon Barkley, who led the NFL in rushing last season with 2,005 yards, is just 16th in the league this year with 740. The 28-year-old has run for only four touchdowns and has gone four straight games without making his way into the end zone.The Chargers (8-4) had their three-game winning streak halted in Week 11 with a dismal 35-6 setback against the Jacksonville Jaguars but returned from their bye to cruise past the Las Vegas Raiders 31-14 last week. However, Herbert fractured his non-throwing hand in that victory and underwent surgery, leaving his status for Monday night in question.Considering that Trey Lance is its backup, Los Angeles will need Herbert on the field if it hopes to hand Philadelphia its third consecutive loss. The 27-year-old has been one of the league's top signal-callers this campaign, ranking eighth with 2,842 passing yards and sixth with 21 touchdown tosses -- two fewer than his 2024 total.Whomever starts at quarterback for the Chargers won't have to contend with Jalen Carter, as the Eagles' defensive tackle will miss the contest after undergoing procedures on both of his shoulders this past Monday. The 24-year-old has been dealing with shoulder issues all season and registered just his second sack in last week's defeat.Even with Carter on the field, Philadelphia is just 25th in the NFL in total defense this year with an average of 347.2 yards allowed. Conversely, Los Angeles ranks third in total defense (275.3 yards allowed), second against the pass (168.3) and sixth in sacks (34).The Chargers enter Week 14 second in the AFC West, two games behind division-leading Denver (10-2). They occupy the first wild card spot in the conference but are just one game better than the Houston Texans (7-5), who are eighth in the playoff standings.Therefore, SportsLine's Inside the Lines team believes a loss to the Eagles would be a major blow to Los Angeles' postseason hopes. But according to the ITL team's model, which simulates every NFL game 10,000 times, a setback by the Eagles would not be very harmful to either their playoff or division title chances. CHANCES OF MAKING PLAYOFFSTEAMCURRENTWITH WEEK 14 WINWITH WEEK 14 LOSSDIFFERENCELos Angeles Chargers63.6%76.7%50.3%26.4%Philadelphia Eagles90.1%96.4%84.0%12.4%CHANCES OF WINNING NFC EASTCURRENTWITH WEEK 14 WINWITH WEEK 14 LOSSDIFFERENCEPhiladelphia Eagles86.5%94.0%79.3%14.7%Even though the Chargers defeated the Broncos in their first meeting this season, the model doesn't give them much of a chance to overtake Denver -- which visits 2-10 Las Vegas on Sunday -- and win their first AFC West title since 2009. It says Los Angeles' prospects for the division crown currently are less than 10% and would drop below 5% with a loss to Philadelphia.CHANCES OF WINNING AFC WESTTEAMCURRENTWITH WEEK 14 WINWITH WEEK 14 LOSSDIFFERENCELos Angeles Chargers9.5%14.4%4.5%9.9%Denver Broncos89.3%92.8%78.5%14.3%The Eagles are 8-5 against the Chargers in the all-time series but have lost three of the last four meetings, including a 27-24 setback in Week 9 of the 2021 season. Herbert was the offensive star for Los Angeles in that triumph, throwing for two touchdowns and running for another, while Hurts connected with DeVonta Smith for one of Philadelphia's scores.Philadelphia is a 2.5-point favorite against Los Angeles in the latest consensus odds, but the ITL team's model is projecting a 22-21 victory for the Chargers, which would move them one step closer to their third postseason appearance in four years.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Playoff odds implications for Eagles vs. Chargers on Monday Night Football - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/39ea8ea9-8476-499f-a563-62bf82cf5fab/thumbnail/1200x675/a8762a3b9d2132d10d62522b87634eed/jalen-hurts-philadelphia-eagles-imagn-images-4.jpg"
      ],
      "datePublished": "2025-12-04T23:18:05.000Z",
      "dateModified": "2025-12-04T23:18:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions vs. Cowboys updates: Dak Prescott says he's ready to light up Detroit defense - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-vs-cowboys-updates-dak-prescott-detroit-defense/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/cad10235-03db-45ce-8a22-b221bac2b8aa/thumbnail/1200x675/82b728888eff5c9e21c7904e57b35a04/dak.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:29:09.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Dallas Cowboys look to make it four straight w",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Dallas Cowboys look to make it four straight wins on Thursday night, as \"America's Team\" kicks off Week 14 against the Detroit Lions. Quarterback Dak Prescott ranks top two in the NFL in passing yards (3,261) and passing touchdowns (25) this season, and he expects another massive performance. When Prescott arrived at Ford Field Thursday afternoon, NFL Media's Jane Slater asked him what he remembers from his last game in Detroit. \"That we lit them up,\" Prescott said. \"Lot of passing yards. About to do it again.\"When Slater asked Prescott if she could quote him on that, he replied with a confident, \"sure.\"\nThe last time the Cowboys played in Detroit was in November 2019. In a 35-27 Cowboys victory, in which the Dallas offense racked up 509 yards of total offense, Prescott completed 29 of 46 passes for a whopping 444 yards and three touchdowns. Michael Gallup caught nine passes for 148 yards, while Randall Cobb caught four passes for 115 yards and a touchdown. The Lions were in an entirely different era, as Jeff Driskel started at quarterback, while Bo Scarbrough was Detroit's leading rusher.However, the last time the Lions and Cowboys met, it was not very pretty. Detroit eviscerated Dallas at AT&T Stadium last year, 47-9. It marked the largest home loss under Jerry Jones. \nPrescott cleared 300 yards passing in each of the last two games, and threw multiple touchdowns in both matchups as well. According to FanDuel Sportsbook, Prescott's passing yards Over/Under is set at 275.5. He averages 271.8 passing yards through 12 games this season. The Cowboys are 3.5-point underdogs. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions vs. Cowboys updates: Dak Prescott says he's ready to light up Detroit defense - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/cad10235-03db-45ce-8a22-b221bac2b8aa/thumbnail/1200x675/82b728888eff5c9e21c7904e57b35a04/dak.jpg"
      ],
      "datePublished": "2025-12-04T22:29:09.000Z",
      "dateModified": "2025-12-04T22:29:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]