[
  {
    "title": "The Celtics' case for keeping (or dealing) Anfernee Simons at the NBA trade deadline - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-anfernee-simons-most-intriguing-players-nba-trade-deadline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/57135204-60f6-42c7-b36f-a99c2b7d5dee/thumbnail/1200x675/40f42cf401fc95a1413bd53d27ac1486/untitled-design-2026-01-15t221722-336.png",
    "tag": "Sports",
    "date": "2026-01-16T06:22:06.000Z",
    "description": "\n        With seconds remaining in the Boston Celtics' 119-114 win over the Miami Heat on Thursday, Anfernee Simons stepped to the line and calmly kno",
    "body": "\n        With seconds remaining in the Boston Celtics' 119-114 win over the Miami Heat on Thursday, Anfernee Simons stepped to the line and calmly knocked down two free throws to seal the victory and run his point total to 39 -- a Celtics record for scoring off the bench in a road game, and his highest scoring game with the franchise. Simons, who was traded to the Celtics over the summer in the Jrue Holiday deal, has been the subject of trade rumors for as long as he's been with Boston. And his scoring outburst to power the Celtics' 19-point comeback win showed why he's one of the most intriguing players heading into the Feb. 5 trade deadline. The Celtics entered Thursday's contest in Miami on a two-game losing streak and quickly fell behind by double digits. They were still down by 15 late in the third quarter, and seemed on their way to a third consecutive defeat. Simons had other ideas. Simons had a five-point burst late in the third to cut the deficit to 10 entering the fourth, then took over the final frame. During a five-minute stretch, he either scored or assisted on 17 consecutive points for the Celtics, including a step-back 3-pointer that put them back in front for good. \nThe Heat tried an array of defenders, but none had an answer for Simons, who was creating offense so easily that Jaylen Brown spent much of the fourth quarter standing in the corner. Just look at some of these moves. \nSimons got off to an inconsistent start with the Celtics, but he's been much better lately as he's gotten more comfortable in their system. In January, he's averaging 18.3 points and 3.6 assists on 49% shooting from the field and 51.6% from 3-point range. Though Simons spent the last four seasons as a starter with the Trail Blazers, the last few weeks have shown that he may be best suited to a bench role. When he gets going, there are few better microwave scorers in the league. \nWhy would the Celtics want to trade Simons?Simons has an expiring contract worth $27.6 million, which makes him a perfect trade candidate, especially for a Celtics team that needs a big man after losing Kristaps Porzingis, Al Horford and Luke Kornet last summer. Per Jake Fischer, the Celtics \"have indeed been monitoring the big man market for potential trade options for some time.\"In addition, moving Simons could help the Celtics shed even more money from their books. While their offseason moves got them under the dreaded second apron of the luxury tax, sending out Simons could get them under the first apron or even the luxury tax line altogether. (They're about $4 million over the first apron and $12 million over the tax line.) If the Celtics are uninterested in re-signing Simons this summer, or expect to be priced out, moving him at the deadline could net them a contributor for the future and/or significant savings. Here's Fischer again:\n\"One well-placed observer whispered this week that the Celtics' deadline business -- whether they trade for a big man or not and how significant the trade is -- should serve as a useful hint about their plans for an in-season comeback from Jayson Tatum.\"There is still no timeline for Tatum's return from a torn Achilles tendon, but the six-time All-Star told Chris Haynes last month that he plans to play this season. If Tatum does return, even in a limited role, the Celtics wouldn't have as much use for Simons. Simons' big contract will limit the Celtics' options for dealing him away, but there are plenty of teams that would be interested in him, whether it's as a bench scorer or as a potential lead guard for the future. While he's been in the league for a while now, he's still only 26 years old. \nThe case for keeping SimonsNo one will be all that surprised if the Celtics trade Simons, and if the team was having the season everyone expected, he would almost certainly be gone. But after beating the Heat they are 25-15 as the mid-point approaches and tied for second place in the Eastern Conference with the New York Knicks. Trading Simons to upgrade the frontcourt would be one thing, but with the team looking like a real contender in the East it would be hard to justify dumping his salary, especially with how important he's become lately. The Celtics are now 4-0 when Simons scores at least 25 points and 6-1 when he gets to 20 points. If you zoom out even further, they're 13-5 when he hits 15 points and 8-10 when he does not. As awesome as Jaylen Brown has been, the team still needs a secondary scorer. When Simons provides that boost, they usually win. \n\"I'm a big fan, I like him a lot,\" Celtics president Brad Stevens said of Simons last month. \"He's a quiet guy, but just a super person, and so he's really come in with a great mindset: 'I'm going to help the team any way I can.' And offensively, he knows he's capable of going nuts in any given game.\"Throughout the Celtics' run as contenders, they've largely lacked a player like Simons -- an ultra-quick guard who can easily beat his man on the perimeter, get into the lane and break down a defense. Derrick White and Payton Pritchard offer some of that, but neither is as quick or athletic as Simons. Having him come playoff time would give their offense another dimension. The Celtics would have less need for Simons if Tatum comes back, but having Simons' firepower alongside two All-NBA talents rather than just one would be an incredible luxury. Small lineups with Simons, White, Tatum and Brown would be a nightmare for opposing defenses. It would be worth keeping Simons just to see what he looks like with that group. \nIt's also worth noting that keeping Simons through the end of the season doesn't guarantee that he'll walk for nothing in free agency. They could re-sign him to a more team-friendly deal or possibly sign-and-trade him in the summer. Furthermore, if he leaves in free agency that could open up the Non-Taxpayer Mid-Level Exception, per Keith Smith, which would help them add someone else. Celtics in a great spot either wayThe great news for Stevens, Joe Mazzulla and everyone else in Boston is that they're in a win-win situation thanks to how well they've played this season and Simons' recent hot streak. If they trade Simons for a big man they'll bolster their frontcourt -- which, with respect to Neemias Queta and Luka Garza, remains their biggest weakness -- and possibly save money in the process. If they keep Simons, they'll have one of the league's best bench scorers for at least the rest of the season. \nWhatever happens, Simons and the Celtics are going to be one of the most fascinating teams to watch ahead of the deadline and beyond. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Celtics' case for keeping (or dealing) Anfernee Simons at the NBA trade deadline - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/57135204-60f6-42c7-b36f-a99c2b7d5dee/thumbnail/1200x675/40f42cf401fc95a1413bd53d27ac1486/untitled-design-2026-01-15t221722-336.png"
      ],
      "datePublished": "2026-01-16T06:22:06.000Z",
      "dateModified": "2026-01-16T06:22:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Tucker signing with Dodgers: Top free agent headed to World Series champions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-kyle-tucker-free-agency-contract/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/58956a14-f6b6-4a16-b0dd-5a918dcab724/thumbnail/1200x675/39c12715c6ac83e551e7be00d3092f8e/tucker-getty-3.png",
    "tag": "Sports",
    "date": "2026-01-16T04:42:23.000Z",
    "description": "\n\n\n    \n                                    \n                                    Tucker has reportedly agreed to a four-year, $240 million contract\n  ",
    "body": "\n\n\n    \n                                    \n                                    Tucker has reportedly agreed to a four-year, $240 million contract\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 15, 2026\n                            \n                    at\n    11:37 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Dodgers have reached an agreement with outfielder Kyle Tucker, CBS Sports' No. 1 ranked free agent, that will pay him $240 million over four seasons. The contract has opt outs after the second and third years, a $64 million signing bonus and $30 million in deferrals, which lowers the present-day value of the contract to $57.1 million per year, according to ESPN. The Dodgers have not yet officially announced the signing.In other words, Tucker has signed the richest contract on an average annual value basis in Major League Baseball history:Kyle Tucker, Dodgers, $57.1 million AAV (2026-29)Juan Soto, Mets, $51 million AAV (2025-39)Shohei Ohtani, Dodgers, estimated $46,081,476 AAV (2024-33)Max Scherzer, Mets, $43,333,333 (2022-24)Justin Verlander, Mets, $43,333,333 (2023-24)\n        \n            \n                Winners and losers of the Kyle Tucker signing: Dodgers, Mets, Blue Jays, Cody Bellinger and more\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nTucker, who turns 29 on Saturday, will now re-enter free agency ahead of his age-33 season if he serves the full terms with the Dodgers (or earlier if he opts out). Our Mike Axisa recently broke down why a shorter-term deal would make sense for the All-Star outfielder.The Toronto Blue Jays and New York Mets were believed to be the other top contenders to land Tucker's services, with the Blue Jays offering a long-term deal and the Mets offering a similar contract to the one he signed with the Dodgers, albeit reportedly for less money.\nTucker, 28, hit .266/.377/.464 (143 OPS+) with 22 home runs and 25 stolen bases in 2025 as a member of the Chicago Cubs. For his career, he's amassed a 140 OPS+ with five consecutive seasons exceeding 4.5 Wins Above Replacement, according to Baseball Reference's calculations.\nHere's what we wrote when we ranked Tucker as the best free agent available this winter, ahead of veteran infielders Alex Bregman and Bo Bichette:Bill James once theorized that it's better for a player's perception for them to start hot and finish cold than the inverse -- that way their numbers are more impressive for a longer period of time. Tucker tested that idea. He entered July sporting a .931 OPS, but from there on he posted an ice-cold .690 mark. His downturn seems connected to injuries, specifically the fractured hand he suffered in June. Tucker still produced his fifth consecutive four-win season, so the shape of his year may prove irrelevant to teams seeking a star-level performer who is good at everything (albeit seldom ranked among the league leaders at anything). Tucker joins a star-studded Dodgers roster that last October became the first repeat World Series champions in more than two decades. He figures to slot into an outfield that also features Teoscar Hernández, Andy Pages, and Alex Call. The Dodgers were already projected to have a luxury tax payroll nearing $350 million, according to Cot's Contracts' estimates. They also added top closer Edwin Díaz on a three-year, $69 million contract earlier this winter.\n\n        \n            \n                Predicting the Dodgers lineup with Kyle Tucker: Where does the new outfielder fit for the champions?\n                \n                    Dayn Perry                \n            \n                            \n    \n                \n                    \n    \nMeanwhile, the Cubs will receive draft-pick compensation, having acquired Tucker in a blockbuster trade last winter with the Houston Astros and having extended the $22.025 million qualifying offer. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Tucker signing with Dodgers: Top free agent headed to World Series champions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/58956a14-f6b6-4a16-b0dd-5a918dcab724/thumbnail/1200x675/39c12715c6ac83e551e7be00d3092f8e/tucker-getty-3.png"
      ],
      "datePublished": "2026-01-16T04:42:23.000Z",
      "dateModified": "2026-01-16T04:42:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Baseball: Kyle Tucker with the Dodgers is a slam-dunk first-rounder again - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-kyle-tucker-with-the-dodgers-is-a-slam-dunk-first-rounder-again/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/394475c3-fc87-4179-aaab-4f4a68eea219/thumbnail/1200x675/234ac2d63c9d1421e095305514431b89/kyle-tucker.jpg",
    "tag": "Sports",
    "date": "2026-01-16T04:44:25.000Z",
    "description": "\n        We're beyond parody now. It's no longer hyperbole to say it. There's no point in trying to justify the fit or rationalize the dollar amount. ",
    "body": "\n        We're beyond parody now. It's no longer hyperbole to say it. There's no point in trying to justify the fit or rationalize the dollar amount. Quite simply, the Dodgers will get whomever they want.The best player on the market? Just assume he's theirs. Because if he's really the best player, they'll want him.The market for Kyle Tucker had begun to percolate in recent days, with the decision seemingly coming down to whether he'd take a shorter deal with a higher average annual value from the Mets or a longer deal with a lower average annual value from the Blue Jays. But in swooped the Dodgers with a four-year, $240 million deal that was probably the best of both worlds.Like it was ever going any other way.\n    \n                    \n    \n                                        \n        \n                 \n                        CHC\n                    \n                         \n                        Chi. Cubs\n                    \n                                            • #30\n                                            •\n                                            Age: 28\n                                                \n        \n    \n    \n                \n                                            \n                            \n                                \n                                    2026 Stats\n                                \n                            \n                        \n                                            \n                                                            \n                                    \n                                        AVG\n                                    \n                                    .266\n                                \n                                                            \n                                    \n                                        HR\n                                    \n                                    22\n                                \n                                                            \n                                    \n                                        SB\n                                    \n                                    25\n                                \n                                                            \n                                    \n                                        AB\n                                    \n                                    500\n                                \n                                                            \n                                    \n                                        BB\n                                    \n                                    87\n                                \n                                                            \n                                    \n                                        K\n                                    \n                                    88\n                                \n                                                    \n                                    \n                    \nIf anyone is going to make $60 million a year (with large amounts deferred, most likely), it probably shouldn't be Kyle Tucker, great as he is. But as Dodgers President Andrew Friedman once said and has now fully embodied, \"If you're always rational about every free agent, you'll finish third on every free agent.\" Tucker was the best hitter available this offseason, and they paid what it took to get him. Now, imagine the prospect package they could offer for Tarik Skubal.\nIf you're sensing that I'm frustrated, good. It means I'm writing well. Conveying feelings through tone and style is what it's all about. But what does it say that I have those feelings, as a (mostly) impartial observer who (mostly) observes baseball through a Fantasy Baseball lens? Shouldn't I be thrilled? Hey everybody, a first-round pick for Tucker just got easier to justify! Lineup placement! Runs and RBI! Fat stacks of cash!But no, I'm just deflated. It's the kind of news that makes you no longer want to get out of bed in the morning, in a metaphorical baseball sense. Like, what's even the point of playing out this season? Better for the other teams to play sarcastically so that they can deny Dodgers the satisfaction of winning this way.I'm not normally like this, preemptively crowning a champion in a sport that revels in the randomness of small-sample outcomes. I'm the one annoyingly reminding all the knee-jerk doomsayers that the playoffs are a crapshoot and that no acquisition can protect a team from that reality. But the two-time defending World Series champions, who have already developed a reputation for cornering the market on every big-ticket talent, just signed the top free agent for a price no other team could even approach. There comes a point where anything else that happens in the world of baseball seems futile.\nAnd with that, I've said my piece. Now, deep breath ... analyst hat on ... and ... go ...You couldn't ask for a better spot for Kyle Tucker's Fantasy value. Gee golly, he's likely to hit cleanup for the league's most star-studded lineup, with three future hall of famers consistently on base ahead of him. Dodger Stadium has turned into a great hitter's park, too, with its low fences in the corners and gradual curve to a shallow center field. It's not the venue where Statcast says Tucker would have hit the most home runs last year, but he would have hit 29 there vs. the 23 he actually hit, if the math is to be believed. It's certainly a better fit for his swing than Wrigley Field, where he hit just seven of his 22 home runs last year.Why, he may even be worth drafting in the first round again, which some of us were saying from the beginning even if the consensus disputed it. He'll need to avoid the fractured shin and fractured hand that have limited his availability and effectiveness over the past two years, but keeping one's bones intact generally isn't a big ask, regardless of his propensity for injury.\nSo yes, the outlook for Tucker in Fantasy is rosier today than it was yesterday, but rather than dreaming about what a career season might look like and whether you can justify taking him ahead of Corbin Carroll, even, ask yourself this ...What does it say about Alex Bregman that the Dodgers didn't sign him?\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Baseball: Kyle Tucker with the Dodgers is a slam-dunk first-rounder again - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/394475c3-fc87-4179-aaab-4f4a68eea219/thumbnail/1200x675/234ac2d63c9d1421e095305514431b89/kyle-tucker.jpg"
      ],
      "datePublished": "2026-01-16T04:44:25.000Z",
      "dateModified": "2026-01-16T04:44:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wizards' Cam Whitmore out for remainder of season with deep-vein thrombosis - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/wizards-cam-whitmore-out-for-season-with-deep-vein-thrombosis/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/6e3f7cd9-e2cb-477e-ac69-2a42abd38bef/thumbnail/1200x675/2fe84034a8046c7c2a4a4bdecf0ed151/cam-whitmore.jpg",
    "tag": "Sports",
    "date": "2026-01-16T00:01:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Washington Wizards announced that forward Cam ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Washington Wizards announced that forward Cam Whitmore will miss the remainder of the season as he recovers from an earlier diagnosis of deep-vein thrombosis. Whitmore has been out since early December after further evaluation discovered that his right shoulder soreness was DVT.Whitmore joins a growing list of NBA players who have been diagnosed with DVT in the past few seasons. Damian Lillard missed time with DVT after a blood clot was found in his calf. Similarly, Victor Wembanyama's season was cut short last February due to a blood clot found in his right shoulder from DVT. He missed the last 29 games of the season.DVT can cause blood clots in the veins of the arms or legs, and can be tricky to detect as the symptoms aren't too dissimilar from general muscle soreness. But detecting and treating them is crucial, as the blood clot can potentially travel to the lungs and cause pulmonary embolism, which can be life threatening.Whitmore finishes the season having played in 21 games, while averaging 9.2 points and 2.8 rebounds on 45.6% from the field. Missing the remainder of the season is a tough blow for the third-year forward, but recent history has shown that players who have been diagnosed with DVT have managed to make a full recovery. Wembanyama has been putting up MVP-level numbers this season after missing a significant portion of last season with DVT. Ausar Thompson was sidelined for the last month of his rookie season, and remained out for the first month of last season, and has been putting up career numbers for a Pistons team that sits first in the East standings.\nWhile it's certainly not how Whitmore wanted his season to go, prioritizing his long-term health is important in this situation. For the Wizards, given they're just 10-29 on the season, while they'll miss Whitmore's production, they're likely already looking ahead to the draft lottery this summer as they plan for their future beyond just this season.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wizards' Cam Whitmore out for remainder of season with deep-vein thrombosis - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/6e3f7cd9-e2cb-477e-ac69-2a42abd38bef/thumbnail/1200x675/2fe84034a8046c7c2a4a4bdecf0ed151/cam-whitmore.jpg"
      ],
      "datePublished": "2026-01-16T00:01:17.000Z",
      "dateModified": "2026-01-16T00:01:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Tucker joins the Dodgers: Predicting the lineup with Ohtani, Betts and Freeman - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/kyle-tucker-dodgers-lineup-shohei-ohtani-mookie-betts-freddie-freeman/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/e2be0b31-4fe6-44e4-93f0-4c387237cec9/thumbnail/1200x675/09e1269ef50af71671f50651beea520d/tucker-getty-9.png",
    "tag": "Sports",
    "date": "2026-01-16T04:28:29.000Z",
    "description": "\n\n\n    \n                                    Tucker joins an impressive roster that already includes Shohei Ohtani, Mookie Betts and Freddie Freeman\n  ",
    "body": "\n\n\n    \n                                    Tucker joins an impressive roster that already includes Shohei Ohtani, Mookie Betts and Freddie Freeman\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 15, 2026\n                            \n                    at\n    11:28 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As \"problems\" go, Dave Roberts has an enviable one when it comes to filling out his Dodgers lineup card in 2026. It was a lineup already stuffed with superstars at the top, and now Kyle Tucker, the top free agent available this offseason, has been added to the mix. Tucker and the Dodgers on Thursday night agreed to a four-year, $240 million pact with a pair of opt outs, and now Roberts' lineup will include Tucker, Shohei Ohtani, Freddie Freeman, Mookie Betts, and Will Smith, for starters. Now let's get back to that enviable problem that will confront Roberts this season as he and the Dodgers attempt to pull off the elusive three-peat. Here's a reasonably educated guess: Shohei Ohtani, DH, Bats: LMookie Betts, SS, Bats: RFreddie Freeman, 1B, Bats: LKyle Tucker, RF, Bats: LWill Smith, C, Bats: RMax Muncy, 3B, Bats: LTeoscar Hernández, LF, Bats: RAndy Pages, CF, Bats: RTommy Edman, 2B, Bats: B \n        \n            \n                Winners and losers of the Kyle Tucker signing: Dodgers, Mets, Blue Jays, Cody Bellinger and more\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nWhen it comes to filling out a Dodger lineup that now includes the likes of Tucker, it makes sense to lean on the certainties to begin. Ohtani is going to bat leadoff and Betts is almost certainly going to bat second. After those first two slots, things are less obvious. Do you keep Freeman in the No. 3 spot even though Tucker figures to out-produce him? After all, Freeman, while still an excellent hitter, is going into his age-36 season, and Tucker was putting up MVP numbers before nagging injuries sapped his numbers down the stretch with the Cubs last season. On the other hand, Tucker has remarkably balanced platoon splits for his career and he could punish a lefty reliever who's summoned to face Freeman and his less balanced splits. For now, Tucker gets cleanup duty. \nSmith, one of the best-hitting catchers in baseball, comes next. If Freeman shows signs of decline in 2026, then perhaps you elevate Tucker to the third spot and put Smith at cleanup, but for now the future Hall of Famer Freeman has more than earned the benefit of the doubt. For that matter, let's address Betts and the fact that he's coming off the worst offensive season of his career. If he further declines at the plate in 2026, then it'll be hard to justify keeping him that high in the lineup. If that's the case, then maybe Roberts will be nudged into a top four that goes Ohtani-Tucker-Smith-Freeman. That, much like the theoretical dropping of Freeman in the order, is for months down the road.Moving on, Muncy and his corrective eyewear make a strong six hitter, and then comes Hernández, who has good pop by back-half-of-the-lineup standards. Pages brings youth and upside to the eight hole and the switch-hitting Edman winds things up at No. 9. Last season, two concerns for the Dodgers were the lack of lineup depth and the age of their core hitters. Tucker addresses both issues, and his presence gives Roberts an abundance of options at the front end of the lineup and also paths to take if one of his older stalwart hitters begins showing his years in 2026.\nSure, where to deploy Tucker is a difficult decision in a certain sense, but any plausible answer is a correct answer. Framed another way, the team that last season ranked second in MLB in runs scored, second in home runs, second in wOBA, and third in xwOBA just added a player who in 2026 might be their second-best hitter. It's a fearsome top five in L.A. no matter how you shuffle the pieces. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Tucker joins the Dodgers: Predicting the lineup with Ohtani, Betts and Freeman - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/e2be0b31-4fe6-44e4-93f0-4c387237cec9/thumbnail/1200x675/09e1269ef50af71671f50651beea520d/tucker-getty-9.png"
      ],
      "datePublished": "2026-01-16T04:28:29.000Z",
      "dateModified": "2026-01-16T04:28:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Texas vs. South Carolina: TV channel, live stream for SEC clash - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/texas-south-carolina-preview-where-to-watch-tv-channel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/31df1472-ea74-4b1f-a448-e365cc58223f/thumbnail/1200x675/62493fac687f74e29e438f27264008cf/rori-harmon-taniya-latson-texas-south-carolina-preview.png",
    "tag": "Sports",
    "date": "2026-01-15T23:45:30.000Z",
    "description": "\n        The SEC is the toughest conference in women's college basketball and two of the heavyweights will face each other on Thursday night in one of",
    "body": "\n        The SEC is the toughest conference in women's college basketball and two of the heavyweights will face each other on Thursday night in one of the biggest regular-season games of the season. No. 2 South Carolina is hosting No. 4 Texas in a rematch of the Players Era championship in November, and this game could be a huge resume booster when March comes around.These opponents know each other well, as this will be their sixth meeting in 369 days. In all of these games, both teams have been ranked in the AP top five.South Carolina is 17-1 this season, with the Gamecocks' lone loss coming at the hands of the Longhorns in November. That game did not count toward their SEC record, which means Dawn Staley's team is still undefeated in conference play. Meanwhile, Texas is 18-1 overall and 3-1 in SEC play after a loss to LSU last weekend. Here is everything you need to know ahead of this top five matchup.Where to watch No. 4 Texas at No. 2 South CarolinaDate: Thursday, Jan. 15 | Time: 7 p.m. ETLocation: Colonial Life Arena, Columbia, South CarolinaTV: ESPN2 | Live stream: fubo (Try for free)Odds (via FanDuel): South Carolina -3.5, O/U: 137.5\nHow Texas won in NovemberSouth Carolina leads this series 5-4 dating back to 1988, including a win at the Final Four last April. However, Texas took the most recent victory with a last-second shot by Rori Harmon at the Players Era championship game in Las Vegas.At that point, South Carolina was ranked No. 2 and Texas was No. 4. The Longhorns had defeated then-No. 3 UCLA the previous day, which meant they became the first team in at least 25 years to defeat two top-three ranked opponents in back-to-back games.Texas only used a seven-player rotation against South Carolina due to injuries, but that was all the Longhorns needed. Harmon finished the game with only six points, but she was invaluable to her team's offense with nine assists. Madison Booker had 16 points and 9 rebounds, while Jordan Lee led all scorers with 19 points.\nFour South Carolina players scored in double figures, led by 16 points from Ta'Niya Latson. Madina Okot also stood out with a double-double of 12 points and 11 rebounds.\nCan Texas 'get ready' and bounce back after LSU loss on Sunday and Vic Schaefer's post-game rant?Texas is no longer undefeated after suffering a 70-65 loss to LSU last weekend. Although the Longhorns' offense has seen a significant boost from last season, they struggled mightily in Baton Rouge. Vic Shaefer's team has one of the top assists/turnover ratios in the country, but on Sunday, his team registered a season-high 17 turnovers and just 9 assists.Mikaylah Williams severely limited Booker in the first half. Meanwhile, Lee only made three field goals and Harmon sat out the fourth quarter. \nDuring the postgame press conference, Booker said her team needed to figure out how to get ready for South Carolina because they didn't show they were prepared on Sunday. Schaefer was also vocal about disliking a schedule in which they had to play LSU and South Carolina back-to-back on the road. \nDefense and rebounding will be keyOne of the things that helped LSU beat Texas was winning the rebounding battle 44-35. Staley highlighted this as one of the key areas that helped the Tigers and also something she wants her team to focus on.Defense will also be key as these are two teams in the top 15 nationally in scoring defense. Their offenses have been productive against other opponents, but this won't necessarily be a high-scoring affair. Texas' lowest scoring games this season have been against top SEC opponents South Carolina (66-64 win) and LSU (70-65 loss). As for the Gamecocks, they only reached 65 points in wins against Clemson and Georgia, but their 66-64 loss to Texas was a season low.\n\"They make it hard,\" Staley said. \"They make it hard for you to make entry passes. Anywhere on the floor. Anywhere. For us, we just have to be disciplined. Disciplined as to the way that we want to play defense and not give them multiple ways of coming off screens. You gotta give them one direction, and that's hard enough to guard, but when you give them options you are going to be running all over the place expending energy that we need on the defensive side of the ball, as well as the offensive side of the ball.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Texas vs. South Carolina: TV channel, live stream for SEC clash - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/31df1472-ea74-4b1f-a448-e365cc58223f/thumbnail/1200x675/62493fac687f74e29e438f27264008cf/rori-harmon-taniya-latson-texas-south-carolina-preview.png"
      ],
      "datePublished": "2026-01-15T23:45:30.000Z",
      "dateModified": "2026-01-15T23:45:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How South Carolina gutted out a win over Texas in tight, turnover-heavy SEC clash - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/ncaa-womens-basketball-south-carolina-gutted-out-win-texas-turnover-filled-sec-battle/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/a2053bc8-217b-4ff4-8bfe-1c2eb6a189f6/thumbnail/1200x675/0d28d152de46830a2bbc002745738d84/south-carolina-texas-win-tessa-johnson-taniya-latson.png",
    "tag": "Sports",
    "date": "2026-01-16T04:27:49.000Z",
    "description": "\n        On Thursday night, No. 2 South Carolina got revenge over No. 4 Texas with a 68-65 win in Columbia. This rematch from the Players Era champion",
    "body": "\n        On Thursday night, No. 2 South Carolina got revenge over No. 4 Texas with a 68-65 win in Columbia. This rematch from the Players Era championship in November was a messy affair, but it was just another example of how tough the SEC conference is.This was their sixth straight meeting as top-five opponents. South Carolina has won four of their last six encounters, but Gamecocks' guard Raven Johnson pointed out how hard it is to compete against the Longhorns.\"Texas is a really good team, they bring it every night,\" Johnson said during her broadcast postgame interview. \"I'm pretty sure we are going to see them again in the SEC Tournament and I'm pretty sure they are going to bring it again. This is just our conference. Our conference is one of the best, so this tells you a lot about women's basketball and what the SEC brings.\"\nJoyce Edwards led South Carolina with 14 points and 8 rebounds, but it was a balanced effort on offense, with all five starters scoring double figures. However, defense was the star of the show for both teams. The pressure was on and taking care of the ball became a very difficult task. As Dawn Staley put it during the postgame press conference, her team \"gutted it out.\"\nHere are some things that stood out from this matchup:The teams combined for 42 turnoversThe Longhorns have been one of the top teams in assist/turnover ratio all season, but lately they have struggled taking care of the ball. They registered a season-high 17 turnovers in the loss to LSU, and their struggles were amplified against South Carolina. A particularly frustrating period for the Longhorns was committing five turnovers in the last two minutes of the second quarter. They had led by as many as nine points in the first half, but the way Texas entered halftime left a lot to be desired.Texas gave up 23 points off 22 turnovers by the end of the night. South Carolina didn't do much better in this area. In fact, the Gamecocks committed 20 turnovers, which is just one less than their season high against Florida on Jan. 4. Multiple of these were inbound turnovers.Madina Okot's 3-pointer was a game-changerOne of the loudest moments of the game was when South Carolina senior center Madina Okot hit a 3-pointer in the fourth quarter. She has only made two shots from beyond the arc all season, but this one came at a time when South Carolina needed every bucket they could get with the game being so tight. \nSince she doesn't usually shoot 3-pointers, Texas simply left Okot wide open. The bucket helped put the Gamecocks up 61-57 with about 3:30 remaining. When the ball went in, the entire crowd at Colonial Life Arena jumped out of their seats and Texas coach Vic Schaefer immediately called a timeout.\nJordan Lee's foul trouble really hurt TexasAfter neither team led by more than three points in the third quarter, South Carolina found momentum in the fourth. Shortly after Okot's 3-pointer, Jordan Lee tried to spark Texas' offense again with a driving layup, but she wasn't around to help her team much longer. By halftime, Lee already had three fouls. She got her fourth with 3:40 left in the third quarter, and her final one with just under two minutes remaining in the game. On a related note...\nTexas's offensive struggles continueThe Longhorns showed a lot of growth on offense earlier this season, but they have struggled against top SEC opponents. Lee in particular embraced a bigger role and has been one of the most consistent offensive players on the team, as well as one of their most efficient 3-point shooters. However, she only made a combined six field goals in the losses to LSU and South Carolina and hit two shots from beyond the arc, both of them against the Tigers. Notably, she had zero 3-point attempts against the Gamecocks. Although she hasn't been as productive recently, when she fouled out there was still time for Texas to make another push and she could have been a part of it. After all, Texas beat South Carolina in November with a clutch shot from Rori Harmon.Harmon didn't get the game-winner this time but she did bounce back from a rough outing against LSU in which she sat on the bench the entire fourth quarter. The Texas point guard ended Thursday night with 16 points on 50% shooting, along with five rounds, five assists and three steals. Madison Booker led the Longhorns' efforts with 24 points while shooting 11 of 25.\nRaven Johnson came in clutchSouth Carolina had all five starters reach double figures, but Raven Johnson played like a veteran when her team needed her the most. She scored 10 points while registering six of her team's 10 total assists, which stood out in a game in which everyone struggled taking care of the ball. More importantly, she scored or assisted on 12 of South Carolina's 20 points in the fourth quarter.Although the game wasn't officially over yet, it seemed Johnson sealed the deal when she was able to get past Harmon and score the bucket that put South Carolina up by two possessions with 23 seconds remaining.Johnson even got the respect of Texas coach Vic Schaefer, who said postgame that she has been playing hard and inspiring her team's toughness.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How South Carolina gutted out a win over Texas in tight, turnover-heavy SEC clash - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/a2053bc8-217b-4ff4-8bfe-1c2eb6a189f6/thumbnail/1200x675/0d28d152de46830a2bbc002745738d84/south-carolina-texas-win-tessa-johnson-taniya-latson.png"
      ],
      "datePublished": "2026-01-16T04:27:49.000Z",
      "dateModified": "2026-01-16T04:27:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL divisional round odds, betting lines, spreads: Playoff picks from 10,000 computer sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-divisional-round-odds-lines-spreads-picks-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/2a4bdae6-572d-4494-ac73-7261fdbdccbe/thumbnail/1200x675/5cc1112535b9849dca994142e0722056/bears-celebrate-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-15T23:14:22.000Z",
    "description": "\nThe 2026 NFL playoffs roll into their second week with the divisional round NFL schedule on Saturday and Sunday. Underdogs went 4-2 against the sprea",
    "body": "\nThe 2026 NFL playoffs roll into their second week with the divisional round NFL schedule on Saturday and Sunday. Underdogs went 4-2 against the spread on Wild Card Weekend, which could certainly affect where you lean with your divisional round NFL picks. The No. 1 seeds take the field on Saturday with Broncos vs. Bills (+1) at 4:30 p.m. ET, followed by Seahawks vs. 49ers (+7) at 8 p.m. ET. Buffalo defeated Denver in the postseason last year, while San Fran and Seattle split their two matchups this season.Your Sunday divisional round NFL bets would then center on Patriots vs. Texans at 3 p.m. ET and Rams vs. Bears at 6:30 p.m. ET. The Pats are on a 1-6 run versus the line when they have a rest advantage, which could make them ones to fade with Houston coming off a Monday victory. Meanwhile, L.A. is the only Wild Card team that lost against the spread but won its game outright, as the Rams are 3.5-point road favorites in the latest divisional round NFL odds. All of the updated divisional round NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best divisional round NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest divisional round NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top divisional round NFL predictionsOne of the model's strongest divisional round NFL picks is the Bears (+3.5, 48.5) covering at home versus the Rams on Sunday at 6:30 p.m. ET. The model has Chicago prevailing versus the spread well over 50% of the time. The Rams are the lone team still in the playoffs that lost versus the spread last week, as L.A. has dropped two straight ATS on the road. Chicago, meanwhile, has just two ATS losses over its last nine games overall. Los Angeles' defense is falling apart as its 31 points allowed in the Wild Card win versus Carolina tied for the Panthers' most scored all season, as the former has allowed 28.3 points over its last seven games. On the other hand, Chicago is much more stout on that side of the ball at home, giving up just 16.3 points over its last four home contests. In addition to the Bears covers, the Over hits in well over 50% of simulations. See which other teams to pick here, and bet the Bears using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make divisional round NFL picksThe model has also made the call on who wins and covers in every other game on the divisional round NFL schedule and just revealed a team projected to win in nearly 70% of simulations, potentially giving you a huge payday. You can only get every pick for every game at SportsLine, and for a limited time, get your first month at SportsLine for just $1 using promo code CHAMPIONSHIP.So what NFL divisional round picks can you make with confidence, and which money line pick should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Divisional round NFL betting odds, lines, live spreads, scoresGet divisional round NFL picks at SportsLineGame SpreadTotalPicksBills at Broncos (Saturday)DEN -146SEE  PICKS HERE49ers at Seahawks (Saturday)SEA -744.5SEE  PICKS HERETexans at PatriotsNE -340.5SEE  PICKS HERERams at BearsLAR -3.548.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL divisional round odds, betting lines, spreads: Playoff picks from 10,000 computer sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/2a4bdae6-572d-4494-ac73-7261fdbdccbe/thumbnail/1200x675/5cc1112535b9849dca994142e0722056/bears-celebrate-imagn.jpg"
      ],
      "datePublished": "2026-01-15T23:14:22.000Z",
      "dateModified": "2026-01-15T23:14:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dana White shoots down idea of Conor McGregor vs. Michael Chandler at White House - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/dana-white-conor-mcgregor-michael-chandler-ufc-white-house/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/f3e6b1a2-1bd8-4a55-8a62-0616e47af5cd/thumbnail/1200x675/bfc151d194613fd478fe94e7032db9cd/conor-mcgregor-michael-chandler-dana-white-ufc-white-house-mma-cbs-sports-jan-15-2026.jpg",
    "tag": "Sports",
    "date": "2026-01-15T18:49:33.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UFC president and CEO Dana White is not interested",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UFC president and CEO Dana White is not interested in rebooking Conor McGregor vs. Michael Chandler. The fight, originally scrapped from UFC 303 in June 2024, has been floated by fans as a potential addition to the UFC's planned event at the White House this summer. UFC matchmakers will soon begin working on the White House card, tentatively planned to coincide with President Trump's birthday on June 14. On Thursday, White told Complex he wouldn't book McGregor vs. Chandler for the White House.\"No,\" White said. \"I mean, that was a couple of years ago.\" White's statement shouldn't alarm fans hoping to see McGregor at the White House. Previously, White placed \"a billion to one odds\" that former two-division champion Jon Jones would be booked for the card. By contrast, White is keeping an open mind about a McGregor comeback.\n\"We'll see if Conor's going to come back or not,\" White said. \"We've  been talking about it for a while. We'll see. We'll see how it plays  out. I don't know, though.\" McGregor has campaigned hard to compete at the White House. He officially rejoined the UFC's drug testing pool in August, a prerequisite for competition. McGregor, a former two-division champion and the sport's biggest star, has not competed in professional mixed martial arts since July 2021. His previously scheduled fight with Chandler, which was meant to headline UFC International Fight Week in 2024, was canceled after McGregor pulled out with an injured toe. \nWith Chandler out of the way, the prevailing fan theory is a trilogy fight with Nate Diaz. McGregor and Diaz are split in their series, which took place 10 years ago. Diaz is not currently signed to the UFC.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dana White shoots down idea of Conor McGregor vs. Michael Chandler at White House - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/f3e6b1a2-1bd8-4a55-8a62-0616e47af5cd/thumbnail/1200x675/bfc151d194613fd478fe94e7032db9cd/conor-mcgregor-michael-chandler-dana-white-ufc-white-house-mma-cbs-sports-jan-15-2026.jpg"
      ],
      "datePublished": "2026-01-15T18:49:33.000Z",
      "dateModified": "2026-01-15T18:49:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gonzaga star big man Braden Huff out 4-8 weeks with left knee injury, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/gonzaga-star-big-man-braden-huff-out-4-8-weeks-with-left-knee-injury-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/3a1c25da-8b03-472c-b724-7017daa3f154/thumbnail/1200x675/85b174d76007a046ee974dc42a9d40e3/braden-huff-gonzaga.jpg",
    "tag": "Sports",
    "date": "2026-01-16T03:06:32.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Gonzaga star big man Braden Huff will miss 4-8 wee",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Gonzaga star big man Braden Huff will miss 4-8 weeks with a left knee injury, a school spokesperson said. Huff suffered the injury in practice earlier this week.Huff, a junior, has been terrific for the No. 9 Bulldogs this season. His 17.8 points per game leads the team and represents a 6.8-points-per-game jump from last season. He's also shooting a team-best 66.2% from the field while averaging 5.6 rebounds per game, second to fellow big man Graham Ike.Huff had several impressive games to fuel the Bulldogs' strong non-conference display, including 20 points on 9-for-11 shooting in a win over then-No. 18 Kentucky in early December. A few weeks later, he posted a career-high 37 points in a win over Campbell, and more recently, he had 28 points to lift Gonzaga to an overtime win over Seattle.Gonzaga currently sits at 17-1 (5-0 WCC) on the season with its only loss to Michigan, currently the No. 4 team in the AP Poll. The Bulldogs are a projected No. 4 seed in CBS Sports' Bracketology.\nIf Huff returns on the earlier end of the projected recovery timeline, he'd be back in plenty of time to ramp up ahead of the conference tournament and NCAA Tournament. However, if it's closer to the eight-week mark, things would get tight. Eight weeks from Thursday's news is March 12; the first round of the NCAA Tournament begins March 19.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gonzaga star big man Braden Huff out 4-8 weeks with left knee injury, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/3a1c25da-8b03-472c-b724-7017daa3f154/thumbnail/1200x675/85b174d76007a046ee974dc42a9d40e3/braden-huff-gonzaga.jpg"
      ],
      "datePublished": "2026-01-16T03:06:32.000Z",
      "dateModified": "2026-01-16T03:06:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Tucker contract: Breaking down Dodgers deal details, including opt outs and deferrals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/kyle-tucker-contract-details-dodgers-opt-outs-deferrals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/3a34ac4c-e776-4f9a-9d82-5a639924f9ae/thumbnail/1200x675/d4e88419d0fd44447167e541677855f5/kyle-tucker-getty-9.png",
    "tag": "Sports",
    "date": "2026-01-16T04:39:48.000Z",
    "description": "\n\n\n    \n                                    \n                                    Kyle Tucker is signing a deal with the Dodgers that has the highest p",
    "body": "\n\n\n    \n                                    \n                                    Kyle Tucker is signing a deal with the Dodgers that has the highest present-day average annual value in MLB history\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 15, 2026\n                            \n                    at\n    11:18 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The rich have once again gotten richer. On Thursday night, the Los Angeles Dodgers and top-ranked free agent Kyle Tucker agreed to a massive four-year contract worth $240 million. There are a modest $30 million in deferrals, per The Athletic, broken down into $10 million per year from 2027-29, as well as a $64 million signing bonus, according to ESPN. The deferrals lower the present-day value down to $57.1 million per year, otherwise it would have been a record $60 million annually. Tucker can opt out after the 2027 and 2028 seasons.Tucker reportedly had a 10-year offer at unknown money on the table from the Toronto Blue Jays, but he instead took a short-term, high-dollar contract with the two-time defending World Series champions. Here are the highest average annual salaries in baseball history:Kyle Tucker, Dodgers: $57.1 million (after deferrals)Juan Soto, Mets: $51 millionShohei Ohtani, Dodgers: $46.1 million (after deferrals)Max Scherzer, Mets: $43.3 millionJustin Verlander, Mets: $43.3 million\n        \n            \n                Winners and losers of the Kyle Tucker signing: Dodgers, Mets, Blue Jays, Cody Bellinger and more\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nThe Mets offered Tucker four years, $220 million, according to the New York Post. In the end, Tucker took more dollars on a similar short-term deal from the team that has won the last two World Series and doesn't have questions about clubhouse chemistry hanging over its head. Not hard to understand why the Dodgers won this bidding war, though I'm sure passing up Toronto's reported 10-year offer was a difficult decision.\nLast week, we examined what a short-term contract for Tucker could look like. Alex Bregman's three-year deal worth $40 million a year with the Boston Red Sox, which included opt outs after each year, felt like the floor for Tucker, and he beat that handily. He's two years younger now than Bregman was when he signed with Boston, and he's coming off a better year (4.5 WAR vs. 4.2 WAR). Here's what we wrote about the Dodgers being a potential landing spot for Tucker last week:It's definitely not great for the rest of baseball that Tucker aligns  almost perfectly with what the two-time defending World Series champions  need. Specifically, they must improve their outfield defense and they  need another middle-of-the-order bat. A short-term arrangement with  Tucker would also keep a path clear for top prospects Josue De Paula and Zyhir Hope down the line. The Dodgers offered Bryce Harper a four-year, $180 million contract back in the day. Why not try something similar with Tucker?Tucker is the eighth nine-figure contract on the Dodgers roster, joining Ohtani, Mookie Betts, Freddie Freeman, Tyler Glasnow, Will Smith, Blake Snell, and Yoshinobu Yamamoto. Add in the Edwin Díaz signing earlier this winter, and Los Angeles is up to a $398.6 million competitive balance tax payroll for 2026, per FanGraphs. That is actually a bit below last year's $417.3 million mark, which led to a record-smashing $169.4 million CBT bill. Point is, this is once again a $500 million roster between payroll and tax.\nIncluding deferred payments owed in the future, the Dodgers have over $2.1 billion in contracts on their books at the moment. They can thank Ohtani and his unmatched revenue-generating ability for that, plus winning pays for itself. The Dodgers have been very good for very long, and they have two straight years of World Series revenue coming in. It is true that not every team (no other team?) could spend this way. It also true few other teams would spend this way if they had the chance. No team invests in its roster like Los Angeles.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Tucker contract: Breaking down Dodgers deal details, including opt outs and deferrals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/3a34ac4c-e776-4f9a-9d82-5a639924f9ae/thumbnail/1200x675/d4e88419d0fd44447167e541677855f5/kyle-tucker-getty-9.png"
      ],
      "datePublished": "2026-01-16T04:39:48.000Z",
      "dateModified": "2026-01-16T04:39:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oklahoma quarterback John Mateer to return for Sooners in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oklahoma-quarterback-john-mateer-to-return-for-sooners-in-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/c1cccb6e-14c2-4901-b80b-a6c532ff3d26/thumbnail/1200x675/3dbc5707e7480194ef1640a129143e1d/mateer.jpg",
    "tag": "Sports",
    "date": "2026-01-16T01:14:07.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Oklahoma Sooners won't be searching for a new ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Oklahoma Sooners won't be searching for a new quarterback for 2026, as the program announced Thursday evening that John Mateer is returning for another season. The Washington State transfer led Oklahoma to a 10-3 record in 2025. Mateer completed 62.2% of his passes for 2,885 yards, 14 touchdowns and 11 interceptions in 12 games played this past season, and added 431 yards and eight more touchdowns on the ground. The Sooners made the College Football Playoff as the No. 8 seed, but were defeated by Alabama, 34-24. Mateer threw for 307 yards, two touchdowns, one interception and rushed for a touchdown in the playoff loss. It marked his 15th game with a passing touchdown and a rushing touchdown. No other FBS player has more than 12 such games over the last two years. Mateer's first season in Norman started off promising, as the Sooners registered victories against Illinois State, No. 15 Michigan and Temple. However, in the 24-17 victory over No. 22 Auburn, Mateer suffered an injury to his throwing hand that required surgery. He missed the following game against Kent State, but returned for the Red River Rivalry less than three weeks later. It ended up being Oklahoma's first loss of the season, as Mateer threw for 202 yards and three interceptions in a 23-6 defeat to Texas.Oklahoma finished out the regular season 5-1 following the loss to Texas, but Mateer did not look like the same dynamic offensive threat. He crossed 200 yards passing just twice in the Sooners' final six games of the regular season, and threw six touchdowns compared to four interceptions. However, Mateer did register 300 yards passing in the final two games of the season, including the playoff loss to Alabama. \nOne has to wonder what Oklahoma would have looked like had Mateer not sustained that hand injury. Now, he gets another shot to lead the Sooners to glory. Mateer was 247Sports' No. 1 transfer portal prospect last year. In his final season at Washington State, Mateer completed 64.6% of his passes for 3,139 yards, 29 touchdowns and seven interceptions. As a runner, Mateer put together a historic campaign, rushing 178 times for 826 yards and 15 more scores. His 44 total touchdowns were tied for the most in the FBS with No. 1 overall pick Cam Ward, and he was one of just two FBS quarterbacks to throw for 20 touchdowns and rush for 10 touchdowns.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oklahoma quarterback John Mateer to return for Sooners in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/c1cccb6e-14c2-4901-b80b-a6c532ff3d26/thumbnail/1200x675/3dbc5707e7480194ef1640a129143e1d/mateer.jpg"
      ],
      "datePublished": "2026-01-16T01:14:07.000Z",
      "dateModified": "2026-01-16T01:14:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patrick Mahomes injury update: Chiefs quarterback eyes Week 1 return from torn ACL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patrick-mahomes-injury-update-chiefs-qb-torn-acl-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/0aa81f5c-5f56-426a-bed2-e9d38dff4a24/thumbnail/1200x675/fdd899cdb6d502de1dfef0b752f87566/patrick-mahomes-chiefs-4.jpg",
    "tag": "Sports",
    "date": "2026-01-15T22:10:27.000Z",
    "description": "\n        Speaking to reporters for the first time since tearing his ACL in Week 15, Kansas City Chiefs quarterback Patrick Mahomes provided a positive",
    "body": "\n        Speaking to reporters for the first time since tearing his ACL in Week 15, Kansas City Chiefs quarterback Patrick Mahomes provided a positive update on his rehabilitation and expressed a desire to be back for Week 1 of the 2026 season.\"Rehab's going great so far, just hitting all the checkpoints that the doctor wants you to do and getting the strength and the range of mobility back,\" Mahomes said Thursday on a video press conference. \"So that's been going great, been doing all of it here in Kansas City so far, and [Chiefs athletic trainer] Julie [Frymyer]'s been crushing it, pushing me. The doctor kind of gives you goals to get to, and I try to maximize those, and they hold me back, because I always want to go a little bit further.\"It's been going great. Obviously, I think the long term, I want to be ready for Week 1. Doctor said I could be but can't predict what's going to happen throughout the process, but that's my goal, and so I'll try to prepare myself to be ready to play in that Week 1 and have no restrictions.\"\n        \n            \n                2026 NFL playoffs power rankings: Seahawks top eight remaining teams still vying for a Super Bowl title\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nMahomes said he hopes to be able to do \"some stuff\" in OTAs and \"a lot\" come training camp. The star quarterback suffered the ACL late in an eventual loss to the Los Angeles Chargers the same day the Chiefs were eliminated from playoff contention and Green Bay Packers star Micah Parsons also tore his ACL. Speaking to the media Monday, Parsons also said he hoped to be back by Week 1 but \"realistically, probably like Week 3, Week 4.\"\nMahomes said after suffering the injury he initially asked the Chiefs' medical staff if he could put a brace on the knee and finish the game, a request the staff denied.Mahomes also looked back on the season as a whole as Kansas City missed the playoffs for the first time since 2014 (Mahomes was a freshman at Texas Tech that year) and finished the season with a 6-11 record.\"I think just compounding mistakes,\" Mahomes said. \"You make mistakes throughout a game. For myself, I look at some of the red-zone interceptions I threw in kinda bigger moments in the third and fourth quarter of games. That's stuff that I hadn't done in the past. Speaking for myself, just trying to be better in those moments. I think offensively, we weren't consistent enough throughout games. We had stretches in games we played good, we had stretches in the season we played really good, but we gotta be better, and that starts with me and it has to feed throughout the entire offense.\"\nMahomes' 7.1 yards per attempt this season was the third-lowest mark of his career, and his 256 passing yards per game was his second-lowest. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patrick Mahomes injury update: Chiefs quarterback eyes Week 1 return from torn ACL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/0aa81f5c-5f56-426a-bed2-e9d38dff4a24/thumbnail/1200x675/fdd899cdb6d502de1dfef0b752f87566/patrick-mahomes-chiefs-4.jpg"
      ],
      "datePublished": "2026-01-15T22:10:27.000Z",
      "dateModified": "2026-01-15T22:10:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks: Rams vs. Bears odds, best bets for Divisional Round playoff game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-vs-bears-odds-how-to-bet-nfc-divisional-round-matchup-what-to-know-about-each-team/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/41060046-c9be-45a9-8960-4efb18f63118/thumbnail/1200x675/e55c64406e006763b223a5dd9265f03b/imagn-matthew-stafford-rams.jpg",
    "tag": "Sports",
    "date": "2026-01-16T00:56:15.000Z",
    "description": "\nThe Los Angeles Rams haven't had a lot of success against the Chicago Bears on the road, winning only 14 of their 37 regular-season games in the Wind",
    "body": "\nThe Los Angeles Rams haven't had a lot of success against the Chicago Bears on the road, winning only 14 of their 37 regular-season games in the Windy City (14-31-2). Their only playoff contest in Chicago was a complete disaster as they racked up a mere 130 yards of total offense while getting trounced 24-0 in the 1985 NFC Championship Game.The fifth-seeded Rams hope for much better results when they visit Chicago to take on the No. 2 Bears in the NFC Divisional Round at 6:30 p.m. ET on Sunday at Soldier Field.Los Angeles (12-5) has lost its last four contests in Chicago, including a 24-18 setback last season in what was one of only six games in which Matthew Stafford did not throw a touchdown pass. The Rams dropped three of their final four road outings this campaign but went into Charlotte, N.C. last weekend and edged the Carolina Panthers 34-31 in the Wild Card Round as Stafford connected with Colby Parkinson for a 19-yard TD with 38 seconds remaining in the fourth quarter to erase a four-point deficit.The Bears (11-6) won their first NFC North title since 2018 but entered their wild card matchup against the division-rival Green Bay Packers as 1.5-point underdogs. They trailed by 18 points at halftime but stormed back to score 25 in the fourth quarter and defeat the Packers 31-27 for their first postseason victory since 2010.Even though they made the playoffs as a wild card, the Rams are the second favorites at DraftKings to win Super Bowl LX at +320. They are behind only the NFC West champion Seattle Seahawks, who have +270 odds to capture the Lombardi Trophy.The Rams are 3.5-point favorites and the over/under for total points scored is 48.5 in the latest DraftKings NFL odds for Los Angeles vs. Chicago in the Divisional Round.Here is a look at the Rams vs. Bears matchup from a betting perspective.Rams vs. Bears odds\nOpening spread: Rams -3.5Opening money line: Rams -192, Bears +160Opening total: 51.5The line has not budged as the Rams have been 3.5-point favorites since it opened. Assuming nothing bizarre happens, they will join the 1976 Pittsburgh Steelers, 1977 Oakland Raiders and 2008 Philadelphia Eagles as the only teams since 1970 to play as road favorites multiple times in one postseason.Meanwhile, the Bears will be the fourth team in NFL history to be a home underdog twice in the same postseason. The 1979 Tampa Bay Buccaneers upset Philadelphia their first playoff game but lost to the Rams in the NFC Championship Game, the 2008 Arizona Cardinals made it all the way to Super Bowl XLIII but lost to the Steelers and the 2017 Eagles beat the New England Patriots in Super Bowl LII. Chicago also will become one of only five teams to be a home underdog in the Divisional Round over the last 40 years.Rams betting profile\nOpening win total: 10.5 wins  W/L record: 13-5 (including playoffs)ATS record: 12-6 (including playoffs)O/U record: 11-7 (including playoffs)The Rams were double-digit favorites against the Panthers in the Wild Card Round but didn't come close to covering, although they owned 14- and 10-point leads in the second quarter. However, all but one of their regular-season victories were by five or more points, including each of their five triumphs away from home.Los Angeles has covered the spread in two-thirds of its Divisional Round games since 1970, going 12-6. Last year, the Rams were seven-point underdogs against the Eagles and managed to cover as Stafford and Parkinson hooked up for a touchdown with less than three minutes to play in the fourth quarter of Philadelphia's 28-22 victory.Stafford, who is expected by many to win the 2025 MVP Award as he led the NFL in passing yards (4,707) and touchdown tosses (46), can match Aaron Rodgers' league record by throwing at least two TD passes in his ninth consecutive playoff game. The 37-year-old, who enters with a postseason-record four straight 300-yard passing performances on the road, also is one scoring pass away from joining Tom Brady and Peyton Manning as the only quarterbacks with two seasons in which they had a total of at least 50 regular-season and playoff touchdown tosses.Bears betting profile\nOpening win total: 8.5 wins  W/L record: 12-6 (including playoffs)ATS record: 10-7-1 (including playoffs)O/U record: 9-9 (including playoffs)A cover by the Bears wasn't looking good last weekend as they trailed Green Bay 21-3 at halftime and were down 27-16 with just over 6 1/2 minutes left in the fourth quarter. But Caleb Williams connected with Olamide Zaccheaus for a touchdown and Colston Loveland on the ensuing two-point attempt with 4:18 remaining before throwing a 25-yard scoring pass to DJ Moore with 1:43 to play.Chicago hasn't done well against the spread in the Divisional Round since winning Super Bowl XX, going just 2-7. However, the club has had success against Los Angeles at home of late, covering in eight of their last 10 meetings at Soldier Field.Williams got off to a rough start in his postseason debut as he threw a pair of interceptions without guiding the Bears to a touchdown over the first three quarters against the Packers. But he finished with 361 passing yards and two TD tosses and can match the franchise record of seven consecutive games -- including playoffs -- with multiple scoring passes set in 1995 by Erik Kramer. Williams also can join Sid Luckman (two in 1941), Jim McMahon (three in 1985) and Rex Grossman (two in 2006) as the only QBs in Bears history to win multiple games in one postseason.Rams-Bears prop pick: Puka Nacua anytime TD scorer (-125)\nNacua found the end zone in nine of his 16 games during the regular season, including four of the final five. The 24-year-old wideout, who was the NFC Offensive Player of the Week twice in 2025, proved to be a double threat last week against the Panthers as he had a 14-yard touchdown reception in the first quarter and a 5-yard TD run in the second. It was the second rushing score of the campaign for Nacua, who has amassed eight touchdowns over his last six outings. The Bears allowed four different Green Bay receivers to score in their wild card win, so it doesn't seem likely that they'll be able to keep Nacua from doing so.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks: Rams vs. Bears odds, best bets for Divisional Round playoff game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/41060046-c9be-45a9-8960-4efb18f63118/thumbnail/1200x675/e55c64406e006763b223a5dd9265f03b/imagn-matthew-stafford-rams.jpg"
      ],
      "datePublished": "2026-01-16T00:56:15.000Z",
      "dateModified": "2026-01-16T00:56:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fred Warner injury: 49ers star LB returns to practice, but ruled out for divisional round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/fred-warner-injury-49ers-practice-divisional-round-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/c798649c-072b-4cc6-af16-cd8dbae03793/thumbnail/1200x675/9cb1bc0c99c0f7014af672a2a6783509/gettyimages-2240299559-1.jpg",
    "tag": "Sports",
    "date": "2026-01-15T22:13:29.000Z",
    "description": "\n        Just over three months after he suffered a devastating ankle injury, San Francisco 49ers linebacker Fred Warner returned to practice on Tuesd",
    "body": "\n        Just over three months after he suffered a devastating ankle injury, San Francisco 49ers linebacker Fred Warner returned to practice on Tuesday. Wednesday, he even said he wouldn't rule himself out for Saturday's divisional round game against the Seattle Seahawks.Thursday, though, coach Kyle Shanahan that Warner will not play -- not because of any setback, but simply because he isn't ready to return to game action. Shanahan said he's confident that Warner has put himself in position to play in the NFC Championship Game should the 49ers beat Seattle but added, \"We'll see if it works out.\"Such a speedy recovery is a remarkable feat for Warner, who was initially deemed out for the season when he broke and dislocated his ankle in Week 6 against the Bucs. Warner underwent surgery after teammate Ji'Ayir Brown rolled up on his leg and twisted his ankle at an awkward angle.\"We're taking it day by day,\" Warner said Wednesday when asked if he anticipated playing this weekend. \"I think they said last week they weren't going to open my [practice] window, and then my window is now open. So we're just taking it day by day.\"\nWarner was part of the wave of injuries that devastated the 49ers early in the year. Defensive end Nick Bosa was lost for the season due to a torn ACL he suffered in Week 3, and key contributors including quarterback Brock Purdy and Ricky Pearsall also missed time. Star tight end George Kittle saw his campaign come to a close in the Wild Card round when he tore an Achilles tendon.Despite the poor injury luck, San Francisco stands just two wins away from the Super Bowl.The 49ers surrendered a modest 19 points to the Philadelphia Eagles in the Wild Card round and gave up just 13 points to the Seahawks in the season finale, impressive feats after struggling for much of the season following the Warner injury.\n\"I feel amazing,\" Warner said. \"Just so grateful, blessed to be back. I think, obviously, when all this happened, I didn't really think about the possibility of returning in-season. But the way things progressed and being able to have this opportunity to be back with my teammates, have a chance at helping them win this week and so on and so forth, that's my only goal moving forward.\"While the injury dashed his chances of securing first-team All-Pro honors for the fourth consecutive year and fifth time in six seasons, Warner has a chance to rewrite an otherwise lost season if the 49ers can win one more game. He is one of the best linebackers in the NFL and would contribute immense amounts of leadership and playmaking ability to the middle of the defense if.\"Fred's the ultimate energy-giver, so just having him out there is awesome,\" defensive coordinator Robert Saleh said Wednesday. \"Yesterday was a little bit more tempo down, but today obviously with higher tempo it'll be fun to get him out there, see him running around.\"\nWarner had not missed a game in his career prior to the injury. If he does not play again this year, he will finish with a career-low 51 tackles, two tackles for loss and three passes defended.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fred Warner injury: 49ers star LB returns to practice, but ruled out for divisional round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/c798649c-072b-4cc6-af16-cd8dbae03793/thumbnail/1200x675/9cb1bc0c99c0f7014af672a2a6783509/gettyimages-2240299559-1.jpg"
      ],
      "datePublished": "2026-01-15T22:13:29.000Z",
      "dateModified": "2026-01-15T22:13:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]