[
  {
    "title": "WWE Saturday Night's Main Event: Where to watch, start time, matches, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-saturday-nights-main-event-start-time-date-where-to-watch-cm-punk-cody-rhodes-jey-uso/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/1b7c6a9e-27e0-44ed-bbcc-de481ffe0cab/thumbnail/1200x675/74a1f83599c7874994ae870c5c59c8fb/cm-punk-jey-uso-wwe-saturday-nights-main-event-clash-in-paris-smackdown-raw-cbs-sports-pro-wrestling-news-today-oct-31-2025.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:18:41.000Z",
    "description": "\n    \n    \n                    \n                WWE\n            \n            \n    \n        A new world heavyweight champion will be crowned at WWE Sat",
    "body": "\n    \n    \n                    \n                WWE\n            \n            \n    \n        A new world heavyweight champion will be crowned at WWE Saturday Night's Main Event. CM Punk and Jey Uso will battle for the vacant title after Seth Rollins was stripped due to injury.Rollins was forced to vacate the title after The Vision's Bron Breakker and Bronson Reed betrayed him on the episode of Raw immediately following Crown Jewel. Punk was granted a vacant title match, with his opponent determined in a battle royal. Jey Uso outlasted the field to set up Saturday's clash to crown a new king.Speaking of champions, Saturday Night's Main Event is loaded with title matches. Undisputed WWE champion Cody Rhodes and Drew McIntyre run it back. McIntyre was scheduled to face Jacob Fatu on the ensuing episode of SmackDown after Crown Jewel, but Fatu was found backstage laid out. With McIntyre in the ring ready to be declared No.1 contender again, Rhodes stormed in and took the fight to him. The pair have been at each other's throats since and look to settle the score on Saturday.Jade Cargill hopes her new mean streak is enough to dethrone Tiffany Stratton when the two battle for Stratton's WWE women's title. And Dominik Mysterio defends the intercontinental title against two tough superstars in Penta and Rusev.Below is how you can catch all the action on Saturday night.\nWatch 2025 WWE Saturday Night's Main EventDate: Nov. 1, 2025Location: Delta Center -- Salt Lake CityStart time: 7 p.m. ETWatch live: Peacock2025 WWE Saturday Night's Main Event match cardWorld Heavyweight Championship (vacant) -- CM Punk vs. Jey UsoUndisputed WWE Championship -- Cody Rhodes (c) vs. Drew McIntyreWWE Women's Championship -- Tiffany Stratton (c) vs. Jade CargillIntercontinental Championship -- Dominik Mysterio (c) vs. Penta vs. Rusev\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WWE Saturday Night's Main Event: Where to watch, start time, matches, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/1b7c6a9e-27e0-44ed-bbcc-de481ffe0cab/thumbnail/1200x675/74a1f83599c7874994ae870c5c59c8fb/cm-punk-jey-uso-wwe-saturday-nights-main-event-clash-in-paris-smackdown-raw-cbs-sports-pro-wrestling-news-today-oct-31-2025.jpg"
      ],
      "datePublished": "2025-10-31T19:18:41.000Z",
      "dateModified": "2025-10-31T19:18:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sepp Straka keeps DP World Tour membership despite withdrawal from playoffs to be with son - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/sepp-straka-dp-world-tour-membership-withdrawal-personal-reasons/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/e8c27a9d-d0f6-41d5-994e-5a310bfd015a/thumbnail/1200x675/72680170d2ea8c4c51e6009f8bb575bd/sepp-straka-golf.png",
    "tag": "Sports",
    "date": "2025-10-31T19:26:35.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the top European players in the game will n",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the top European players in the game will not be in the fields for the final two events of the 2025 DP World Tour campaign as Sepp Straka has withdrawn from the two-tournament postseason that makes up the Race to Dubai. The world No. 15 has instead chosen to remain at home with his 2-month-old son, who has been in the hospital since his birth in August.Without playing in these tournaments, Straka falls short of the minimum four-tournament obligation required for DP World Tour membership. Due the serious circumstances, the circuit has made the decision to amend Straka's required total from four events to two, making him eligible for membership in 2026.\"Paige and I are pleased to share that we are preparing for our son, Thomas, to return home in the coming weeks after spending his initial two months of life in intensive care,\" Straka said. \"We are immensely grateful to the dedicated medical teams who have cared for him and helped him grow stronger following his early arrival in August.\n\"Consequently, I will be withdrawing from both the Abu Dhabi HSBC Championship and the DP World Tour Championship to focus on my family during this important time. I need to be in Alabama to support Paige, ensuring we give Thomas the best start possible as he transitions from NICU to home.\"\n        \n            \n                The Power 18 golf rankings: Xander Schauffele returns to top five, Cameron Young among most notable movers\n                \n                    Patrick McDonald                \n            \n                            \n    \n                \n                    \n    \nStraka was exempt for next week's Abu Dhbai HSBC Championship thanks to playing on the European Ryder Cup team at Bethpage Black. The Austrian was the lone player from the European team to not play in the DP World Tour's flagship event -- the BMW PGA Championship -- two weeks prior to the Ryder Cup, but he was able to tee it up against the United States when his son's condition improved.\nThe 32-year-old experienced the best season of his career in 2025. Straka won two times on the PGA Tour, including the Truist Championship at the Philadelphia Cricket Club, which doubles as a signature event and was once again a member of a winning Ryder Cup team at Bethpage Black. He reached as high as No. 7 in the Official World Golf Rankings as well.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sepp Straka keeps DP World Tour membership despite withdrawal from playoffs to be with son - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/e8c27a9d-d0f6-41d5-994e-5a310bfd015a/thumbnail/1200x675/72680170d2ea8c4c51e6009f8bb575bd/sepp-straka-golf.png"
      ],
      "datePublished": "2025-10-31T19:26:35.000Z",
      "dateModified": "2025-10-31T19:26:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-lineup-advice-optimizer-week-9-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg",
    "tag": "Sports",
    "date": "2025-10-31T18:42:37.000Z",
    "description": "\n        Eleven more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET window, and those matchups comprise the main ",
    "body": "\n        Eleven more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET window, and those matchups comprise the main slate for NFL DFS sites like FanDuel and DraftKings. The final kickoff on the slate, Chiefs vs. Bills, also has the highest over/under of the day at 52.5 points. Big names like Josh Allen, Patrick Mahomes, James Cook and Travis Kelce will certainly be a factor in NFL DFS lineups.How should they factor into your NFL DFS picks this week, and who are the sleepers in the NFL DFS player pool that can help differentiate your lineups? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, where they can pick at Underdog and get $100 in site credits after making a $5 wager:The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool for sports betting apps.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 9 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 9 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is Bears quarterback Caleb Williams at $5,700 on DraftKings and $7,300 on FanDuel. Williams has been trending down the past couple weeks, with two games in a row with no touchdowns and an interception in both. He's also totaled just 20 rushing yards over the past three weeks.That's lowered his DFS price, but this is an ideal spot to use him as a value pick as the Bears take on the Bengals. Cincinnati has been one of the worst passing defenses in the league recently as opposed defenses have feasted against the Bengals. See who else to pick here.The optimizer's NFL DFS strategy also includes building around 49ers running back Christian McCaffrey, who is $9,500 on FanDuel and $8,800 on DraftKings. McCaffrey missed some practice earlier this week, but that turned out to be for rest and precautionary reasons, as he's full go for Sunday against the Giants.New York is tied for 25th in terms of most Fantasy points given up to opposing backs this season, so McCaffrey is in a great bounce-back spot after a slow week against the Texans in Week 8. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to build Sunday Week 9 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg"
      ],
      "datePublished": "2025-10-31T18:42:37.000Z",
      "dateModified": "2025-10-31T18:42:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Commanders vs. Seahawks: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-vs-seahawks-how-to-watch-preview-prediction-nfl-week-9-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/0c1db78e-473c-45a4-ba9d-33e59310f6f2/thumbnail/1200x675/97836e2f35367421042818fc4029947e/jayden-danies.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:01:35.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Seattle goes cross-country after its bye week\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:00 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Seahawks hope their momentum carries over both through their bye week and across the country when they visit the Commanders for a Week 9 \"Sunday Night Football\" showdown.Seattle (5-2) has won five of its last six and has won different games in different ways, relying on both an explosive offense and a shutdown defense. The Seahawks are allowing the lowest yards per carry (3.3) and rushing yards per game (75.7) in the NFL, and they also rank in the top five in red zone and goal-to-go defense. Offensively, Jaxon Smith-Njigba has blossomed into one of the game's best wide receivers, and Sam Darnold has largely been very solid in his first year with the team.Washington (3-5) is headed in the opposite direction, having lost three straight, but they will get Jayden Daniels back after the reigning Offensive Rookie of the Year missed Week 8 with a hamstring injury. The defense has been an even bigger concern, though, and one year after breaking through to the NFC Championship Game, Washington is simply trying to stay afloat.\nHere's how to watch this prime-time contest as well as betting information, keys to the game and a prediction.Where to watch Commanders vs. Seahawks liveDate: Sunday, Nov. 2 | Time: 8:20 p.m. ETWhere: Northwest Stadium (Landover, Maryland)TV: NBC | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Seahawks -3; O/U 48.5 (via FanDuel)Bet Commanders vs. Seahawks and other NFL Week 9 games at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager.\nCommanders vs. Seahawks: Need to knowJaxon Smith-Njigba faces poor Commanders' secondary. If you thought last year was Smith-Njigba's breakout, this year is making that look like just a stepping stone on the way to stardom. Smith-Njigba leads the NFL with 819 receiving yards, and his 16.4 yards per reception is the second-highest average among players with at least 30 catches, only behind Emeka Egbuka. Smith-Njigba now faces a Commanders defense that has surrendered 18 completions of 25 or more yards, second-most in the NFL only \"behind\" the Cowboys.Can Jayden Daniels lift Washington? The Commanders have been hit hard by injuries on both sides of the ball, and that includes at quarterback, where Daniels has missed three games. He will once again be without top wideout Terry McLaurin, who re-injured his quad in Week 8, but he will have Deebo Samuel. The two showed good chemistry earlier in the year. Daniels' presence might also help a rushing attack that has fallen off in recent weeks and managed just 60 yards last week.Can the Seahawks' running game get on track? The Seahawks are third in the NFL in yards per play despite being 31st in yards per carry (3.7). Darnold's league-best 9.1 yards per attempt certainly helps, but Seattle would love to get Kenneth Walker III and Zach Charbonnet going on the ground. Perhaps this is the week it happens. Washington is allowing is allowing the sixth-most yards per carry (5.1) in the NFL over the past three weeks.Commanders vs. Seahawks prediction, pick\nGetting Daniels back is a big deal for Washington, but the defense is simply too leaky to get the Commanders back in the win column. Expect a big game from Smith-Njigba and the Seattle running game to find some lanes. Pick: Seahawks, Under\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Commanders vs. Seahawks: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/0c1db78e-473c-45a4-ba9d-33e59310f6f2/thumbnail/1200x675/97836e2f35367421042818fc4029947e/jayden-danies.jpg"
      ],
      "datePublished": "2025-10-31T19:01:35.000Z",
      "dateModified": "2025-10-31T19:01:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Memphis vs. Rice odds, line, picks, predictions, Friday college football best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/memphis-rice-prediction-odds-line-time-2025-college-football-week-10-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/7dd460bd-0203-44db-a574-e8555a6848b7/thumbnail/1200x675/d1c516e7a6f0103242ecc9baa7418e33/brendon-lewis-memphis-tigers-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-31T18:14:24.000Z",
    "description": "\n        The 25th-ranked Memphis Tigers will look to stay in the mix for an AAC when they take on the Rice Owls in a key conference matchup on Friday ",
    "body": "\n        The 25th-ranked Memphis Tigers will look to stay in the mix for an AAC when they take on the Rice Owls in a key conference matchup on Friday night. Memphis is coming off a 34-31 win over South Florida, while Rice downed Connecticut 37-34 in double overtime this past Saturday. The Tigers (7-1, 3-1 American), who are tied for third in the league, are 3-1 on the road this season. The Owls (4-4, 1-3 American), who are tied for 11th, are 2-2 on their home field in 2025.Kickoff from Rice Stadium in Houston is at 7 p.m. ET. Memphis leads the all-time series 3-2, after beating Rice 27-20 last season. The Tigers are 14-point favorites in the latest Rice vs. Memphis odds, while the over/under for total points scored is 48.5 via SportsLine consensus. Before making any Memphis vs. Rice picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Memphis vs. Rice. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Rice vs. Memphis:Memphis vs. Rice             spreadMemphis -14 at DraftKings SportsbookMemphis vs. Rice         over/under48.5 pointsMemphis vs. Rice                                                                                                                         money line Memphis -625, Rice +447Memphis vs. Rice                                                                                                                 picksSee picks at SportsLineMemphis vs. Rice                                                                                                                   streaming Fubo (Try for free)  Why Memphis can coverSenior quarterback Brendon Lewis powers the Tigers' offense. In eight games, he has completed 141 of 208 passes (67.8%) for 1,644 yards and 10 touchdowns with four interceptions. He also has rushed 97 times for 475 yards (4.9 average) and seven touchdowns. In the win over No. 18 South Florida, he completed 27 of 44 passes for 307 yards and two touchdowns. He also rushed 11 times for 35 yards.His top target has been senior wide receiver Cortez Braham Jr. In eight games, he has 36 receptions for 566 yards (15.7 average) and seven touchdowns. In the win over South  Florida, he has seven receptions for 75 yards (10.7 average) and two touchdowns. In a 55-26 win over Florida Atlantic on Sept. 27, he had six receptions for 127 yards (21.2 average) and two touchdowns. See which team to back at SportsLine. Why Rice can coverThe Owls are led by sophomore quarterback Chase Jenkins. In eight games, he has completed 77 of 111 passes (69.4%) for 744 yards and five touchdowns with one interception. He has also rushed 97 times for 332 yards (3.4 average) and four touchdowns. In last week's win over UConn, he completed 17 of 22 passes (77.3%) for 191 yards and one touchdown. He also rushed 17 times for 57 yards (3.4 average), including a long of 21.Junior running back Quinton Jackson leads the Rice ground attack. In eight games, he has carried 117 times for 655 yards (5.6 average) and six touchdowns. He also has four receptions for 74 yards and a score. In last week's win over UConn, he carried 21 times for 168 yards and three touchdowns. He also caught three passes for 80 yards and one touchdown. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Memphis vs. Rice picksSportsLine's model is going Over on the total, projecting 60 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Memphis vs. Rice, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Memphis vs. Rice spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Memphis vs. Rice odds, line, picks, predictions, Friday college football best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/7dd460bd-0203-44db-a574-e8555a6848b7/thumbnail/1200x675/d1c516e7a6f0103242ecc9baa7418e33/brendon-lewis-memphis-tigers-cbs.jpg"
      ],
      "datePublished": "2025-10-31T18:14:24.000Z",
      "dateModified": "2025-10-31T18:14:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Jaguars vs. Raiders: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-jaguars-vs-raiders-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/7049f47a-c1f0-4556-ba24-ad3dafad5335/thumbnail/1200x675/7d7a887b27a2063c6f471ffb38d4aefd/trevor-lawrence-jga.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:01:33.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Everything you need to know to tune into the game\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:01 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Jacksonville Jaguars are headed to Las Vegas to face the Raiders this week. The Raiders are coming off a bye following their Week 7 shutout loss to the Chiefs, putting them at 2-5 and last in the AFC West. The Jaguars, who are also coming off a bye, sit at 4-3 and second in the AFC South after their most recent defeat, a 35-7 loss to the Los Angeles Rams in London.Both teams are slumping. The Raiders have lost five of the last six games, while the Jaguars have lost two in a row.The Raiders offense may get back some key pieces this week. Tight end Brock Bowers (knee) and wide receiver Jakobi Meyers (knee/toe) have missed time, which has not helped Geno Smith's struggling offense. Coach Pete Carroll said earlier this week that he expects both pass catchers to return for Week 9.Here's everything you need to know for the game this weekend: \nWhere to watch Jaguars vs. Raiders liveDate: Sunday, Nov. 2 | Time: 4:05 p.m. p.m. ETLocation: Allegiant Stadium -- Las VegasTV Channel: Fox | Streaming: NFL+Follow along: CBS Sports AppOdds: Jaguars -2.5, OU 44.5 (via DraftKings)    Jaguars vs. Raiders: Need to knowJaguars defense: The Raiders defense has been the highlight of their team. They are top five in the league in takeaways and have at least one takeaway in each of their wins. Forcing turnovers could be a major difference-maker in this game. They are also holding their opponents to 22 points a game, so if the offense can get some momentum, the defense is doing enough to help them win.Raiders offense: The Raiders are giving the ball up a lot, tied with the Dolphins for most interceptions in the league with 10. Their seven passing touchdowns are tied for second fewest in the league and their three rushing touchdowns are tied for least in the league. Against a solid defense, Geno Smith and Co. may struggle.Travis Hunter: The two-way player was one of the more talked about this offseason. His impact on the offense has increased week to week. Last week he made his biggest impact, with eight catches on 14 targets and recorded his first touchdown in the NFL. But now he'll miss at least the next four games after being placed on injured reserve with a knee injury sustained in practice this week.Jaguars vs. Raiders prediction, pick\nI think the Raiders offense will see improvement this week, but not enough to get the win over the Jaguars. Neither team is consistent, but the Jags have been the better team thus far. Pick: Jaguars -2.5, Under 44.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Jaguars vs. Raiders: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/7049f47a-c1f0-4556-ba24-ad3dafad5335/thumbnail/1200x675/7d7a887b27a2063c6f471ffb38d4aefd/trevor-lawrence-jga.jpg"
      ],
      "datePublished": "2025-10-31T19:01:33.000Z",
      "dateModified": "2025-10-31T19:01:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Chargers vs. Titans: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-chargers-vs-titans-tv-channel-kickoff-time-odds-prediction-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/67e438a6-77f4-48ee-bd19-fa45b8d75c7b/thumbnail/1200x675/88a75c628811c8ae754a071ee8138978/untitled-design-2025-10-31t022031-926.png",
    "tag": "Sports",
    "date": "2025-10-31T19:01:11.000Z",
    "description": "\n        The Los Angeles Chargers are rolling into Nashville after a big win over the Minnesota Vikings, and they have a chance to keep pace with the ",
    "body": "\n        The Los Angeles Chargers are rolling into Nashville after a big win over the Minnesota Vikings, and they have a chance to keep pace with the Denver Broncos and Kansas City Chiefs atop the AFC West. The Tennessee Titans are looking to put a wrench in those plans and get some badly needed positive momentum.Last week, the Chargers crushed the Vikings 37-10, and everything was working on offense. Justin Herbert turned in another big game, and Kimani Vidal topped 100 rushing yards for the second time in the last three games. Just as encouraging was the fact that the defense got to Carson Wentz for five sacks, and that side of the ball might get to feast again this week with a suspect offensive line and rookie quarterback in Tennessee.On the other sideline, the Titans are looking for any sign of positivity they can get. Tennessee has lost three straight, and six of its seven losses have come by multiple scores. It certainly doesn't help that star defensive lineman Jeffery Simmons has been banged up, and the Titans just traded cornerback Roger McCreary to the Los Angeles Rams. If there is something worth monitoring, it's the progress of rookie receiver Chimere Dike, who has totaled 163 yards and a touchdown in the last two games.Where to watch Chargers vs. Titans liveDate: Sunday, Nov. 2 | Time: 1 p.m. ETLocation: Nissan Stadium -- Nashville, TennesseeTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Chargers -9.5; O/U 43.5 (via DraftKings)Chargers vs. Titans: Need to knowChargers offense hitting its stride: Despite injuries along the offensive line and to first-round rookie running back Omarion Hampton, the Chargers' offense has been heating up of late. From Weeks 6-8, Los Angeles ranks first in total yards per game (422.3), pass yards per game (288.7) and third in points per game (30.0). Now, this unit gets a reeling defense that just allowed 38 points to the Indianapolis Colts. That could mean more electricity from the Chargers.\nHistoric start in Nashville: The Titans have made some history with their 1-7 start, but as you might imagine, it's not the good kind. This is the worst start from the team since the franchise relocated to Nashville in 1997. The franchise's last 1-7 start came all the way back in 1994 as the Houston Oilers. If Titans fans are looking for good news, it's that their team has won three straight at home against the Chargers.Herbert can join elite company: If Justin Herbert can throw two touchdown passes on Sunday -- and that seems likely given the state of the Titans defense -- he will join some rarified air. Only four quarterbacks in NFL history (Patrick Mahomes, Dan Marino, Josh Allen and Peyton Manning) threw for two-plus touchdowns 50 times before turning 28 years old. Herbert is sitting on 49 games with at least two passing touchdowns right now.\nChargers vs. Titans prediction, pick\nI'm almost inclined to call this a trap game for the Chargers because it's a road game sandwiched between two key games at home (the Pittsburgh Steelers go to Los Angeles next week). That said, I'm not sure the Titans are capable of trapping a team no matter how good the setup is. The Chargers are a good football team, and I imagine Jim Harbaugh will have them ready to go. Besides, Tennessee has to prove it can put up a good fight before I trust that side. Pick: Chargers -9.5; Over 43.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Chargers vs. Titans: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/67e438a6-77f4-48ee-bd19-fa45b8d75c7b/thumbnail/1200x675/88a75c628811c8ae754a071ee8138978/untitled-design-2025-10-31t022031-926.png"
      ],
      "datePublished": "2025-10-31T19:01:11.000Z",
      "dateModified": "2025-10-31T19:01:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Bills vs. Chiefs: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-bills-vs-chiefs-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/67c814ee-1cde-4bab-8469-3268dfc9897c/thumbnail/1200x675/e27f6b1266e7a64f67f8b1e3d8c2aaaf/untitled-design-2025-10-31t014101-231.png",
    "tag": "Sports",
    "date": "2025-10-31T19:00:56.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    It's a heavyweight showdown in the AFC on CBS\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:00 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        You already know the cast of characters. Josh Allen. Patrick Mahomes. Andy Reid. Sean McDermott. For the 10th time since the 2020 season, the Bills and the Chiefs face off in a battle of two AFC titans.The Bills have actually won four out of the five regular-season meetings over that span, but Mahomes, Reid and the Chiefs have dominated when it matters most, winning all four playoff matchups, the last three of which have been decided by a single posession.Though both teams appear to be playoff-bound, per usual, this matchup has a bit of a different look from the norm. The Chiefs (5-3) sit not only third in the AFC West behind the Broncos and the Chargers but seventh in the AFC as a whole. In order to keep pace not only in the division race but for the final playoff berth in the conference, they'll need a win Sunday in Buffalo. Speaking of Buffalo, the 5-2 Bills are a surprising second in the AFC East, behind the 6-2 Patriots.Keep in mind that Kansas City has won nine straight AFC West crowns while Buffalo has won the AFC East five years running.\n\n        \n            \n                Bills vs. Chiefs matchups: Which team has edge at each position in Patrick Mahomes vs. Josh Allen showdown?\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nWhere to watch Bills vs. Chiefs liveDate: Sunday, Nov. 2 | Time: 4:25 p.m. ETWhere: Highmark Stadium -- Orchard Park, New YorkTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Chiefs -1.5; O/U 52.5 (via FanDuel)Bills vs. Chiefs: Need to knowMahomes vs. Allen, Chapter 10: Allen's four regular-season wins over Mahomes are more than anyone else in the NFL. In fact, no one else even has three. Allen has, in fact, been the better player in the five regular-season meetings, too: He has a 10-3 touchdown to interception ratio (compared to 10-7 for Mahomes), has taken only four sacks to Mahomes' nine. He has also run for 220 yards and three touchdowns in those games, compared to Mahomes' 126 and zero, respectively. These two always produce memorable battles, and Sunday should be no different in that regard.Rashee Rice has been a huge difference maker: In the two weeks since returning from a six-game suspension, Rice has 16 catches for 135 yards and three touchdowns. Kansas City's success rate both through the air and on the ground has ticked up with Rice on the field, and his yards-after-catch ability adds a key element to the Mahomes-led attack.Bills must tighten up run defense: Buffalo is allowing 5.5 yards per carry, second-worst in the NFL only ahead of the Giants, and to make matters worse, standout defensive tackle Ed Oliver (biceps) just landed on injured reserve. The Chiefs may be without leading rusher Isiah Pacheco, but Kareem Hunt is tough to stop near the goal line, rookie Brashard Smith is a good pass catcher, and Mahomes himself is on track for his best year as a runner.Bills vs. Chiefs pick, prediction\nThe Chiefs are absolutely rolling of late, and though Buffalo has dominated the regular-season meetings between Mahomes and Allen, this feels like another spot in which Kansas City shows it's truly \"back\" after an uncharacteristically slow start. Pick: Chiefs -1.5; Over 52.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Bills vs. Chiefs: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/67c814ee-1cde-4bab-8469-3268dfc9897c/thumbnail/1200x675/e27f6b1266e7a64f67f8b1e3d8c2aaaf/untitled-design-2025-10-31t014101-231.png"
      ],
      "datePublished": "2025-10-31T19:00:56.000Z",
      "dateModified": "2025-10-31T19:00:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Falcons vs. Patriots: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-falcons-vs-patriots-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/be8607e9-cd56-4db1-a0bd-0ee2a546260a/thumbnail/1200x675/2b3ff22d5f36dc00832e195071e72666/drake-maye-vs-browns.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:01:27.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Everything you need to know to catch the game live\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:01 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Yes, the New England Patriots are hosting the Atlanta Falcons in a rematch of Super Bowl LI, but we probably won't be seeing a New England comeback following an Atlanta quarterback jumping out to a 28-3 lead this time around.The Patriots sit atop the AFC East at 6-2 and are on a five-game win streak. They are coming off a 32-13 win against the Cleveland Browns and proved they can win against a good defense, even if it takes some halftime adjustments.The Falcons are 3-4 and third in the NFC South. They're looking to snap a two-game losing streak, with their most recent loss coming against the Miami Dolphins in a lopsided 34-10 battle against a team they could've beat.\nWhere to watch Falcons vs. Patriots liveDate: Sunday, Nov. 2 | Time: 1 p.m. ETLocation: Gillette Stadium -- Foxboro, Massachusetts TV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Patriots -5.5; O/U 44.5 (via DraftKings)    Falcons vs. Patriots: Need to knowDrake Maye the MVP: The Patriots sophomore QB is putting up a legitimate MVP-caliber season. The Foxboro crowd certainly wants him to get the award, as they were chanting \"MVP\" during his three-touchdown performance last week. His deep ball is among the best in the league and the ball placement is on point. He has the best completion percentage in the league (75.2%) and is fifth in passing yards (2,026).Michael Penix Jr., Drake London injuries: Quarterback Michael Penix Jr. (hip) and wide receiver Drake London (hip) both missed last week's game due to injuries. Kirk Cousins played in place of Penix against the Dolphins. Coach Raheem Morris gave an update on his QB on Wednesday, saying he \"feels really good\" about him. London is considered day-to-day, like Penix, was also in the building on Wednesday.Patriots slow start: The Patriots are winning games as of late, but they haven't started games off strong. Their first-half play, and specifically their first-quarter play, has lacked in comparison to their second-half performances. The Patriots are set to be a playoff team this year and playing teams like the Buffalo Bills or Kansas City Chiefs in the postseason is a challenge that will require their best effort in all 60 minutes. As they continue through the second half of the regular season, those are adjustments I expect them to focus on. Falcons vs. Patriots prediction, pick\nThe Patriots are the favorites here and for good reason. Each week they've improved on their weak spots and I think that will continue this week against an easier defense than they faced last week. Pick: Patriots -5.5; Over 44.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Falcons vs. Patriots: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/be8607e9-cd56-4db1-a0bd-0ee2a546260a/thumbnail/1200x675/2b3ff22d5f36dc00832e195071e72666/drake-maye-vs-browns.jpg"
      ],
      "datePublished": "2025-10-31T19:01:27.000Z",
      "dateModified": "2025-10-31T19:01:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Bears vs. Bengals: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-bears-vs-bengals-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/7b08f0c4-faa6-47bb-b905-64a0ce181391/thumbnail/1200x675/53040db99c911a04405701ec6534a38a/untitled-design-2025-10-31t010931-196.png",
    "tag": "Sports",
    "date": "2025-10-31T19:00:42.000Z",
    "description": "\n        The Chicago Bears and Cincinnati Bengals both ended up in the loss column in disappointing fashion in Week 8. Both squads will look to bounce",
    "body": "\n        The Chicago Bears and Cincinnati Bengals both ended up in the loss column in disappointing fashion in Week 8. Both squads will look to bounce back in a big way in Week 9. The Bears saw their four-game winning streak come to a screeching halt as they fell 30-16 against the Baltimore Ravens. Chicago wasn't able to push the ball downfield with just 7.5 yards per completion and also threw a costly interception in their own end of the field. Meanwhile, the Bengals suffered one of the more shocking losses in Week 8 -- or perhaps any week -- as the New York Jets recorded a 39-38 comeback win. The Jets were able to rack up 502 yards of total offense and shredded the Bengals defense, especially in the second half. Quarterback Joe Flacco did toss two touchdown passes against his former team, but ultimately came up short.Click here to bet Bears vs. Bengals at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:\nWhere to watch Bears vs. Bengals liveDate: Sunday, Nov. 2 | Time: 1 p.m. ETWhere: Paycor Stadium -- Cincinnati, OhioTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Bears -2.5; O/U 51.5 (via FanDuel)Bears vs. Bengals: Need to knowSwift's workload: Bears running back D'Andre Swift got off to a strong start last week, but was on a snap count against the Ravens. Prior to Swift's 45-yard rushing performance, the veteran back had tallied back-to-back performances in which he topped the 100-yard mark. Swift is also an extremely dangerous asset catching the ball out of the backfield. If Swift gets more touches this week, that'll go a long way towards helping Chicago move the ball down the field.Bears must limit Bengals' passing attack: It's no secret that the Bengals offense has been a much-improved unit since Joe Flacco was traded to the team. The Bears defense has been one of the stronger groups during the first half of the season. Chicago has only allowed 30 or more points in two games this season. They'll look to do the same against a group that is led by Ja'Marr Chase and Tee Higgins.Williams has potential for massive game: The Bengals defense has struggled mightily this season. To make matters worse, star pass rusher Trey Hendrickson reaggravated a hip injury that had previously sidelined him for a game. As a result, Williams could be due for a monster game against a struggling unit. On the year, Williams is completing 61.9% of his passes and has taken decent care of the football. Williams has yet to top the 300-yard mark this season, but this could be the game where it happens. After all, Cincinnati has given up at least 31 points in three of its last four contests.\nBears vs. Bengals pick, prediction\nBoth teams will be very hungry to bounce back after brutal losses in Week 8. It was a series of missed opportunities for Caleb Williams and the Bears offense last week against the Ravens. Considering both teams have impressive offenses, this one comes down to the defensive units and it's hard to trust the Bengals after coughing up a double-digit lead against the lowly Jets. The Bears pull out what could be one of the more exciting games of the week. Pick: Bears -2.5, Over 51.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Bears vs. Bengals: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/7b08f0c4-faa6-47bb-b905-64a0ce181391/thumbnail/1200x675/53040db99c911a04405701ec6534a38a/untitled-design-2025-10-31t010931-196.png"
      ],
      "datePublished": "2025-10-31T19:00:42.000Z",
      "dateModified": "2025-10-31T19:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Texans vs. Broncos: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-texans-vs-broncos-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/c97d19bb-e125-4449-a442-fcf9f2b9986b/thumbnail/1200x675/0989cad4878387cf8d85b4d8829f1f01/untitled-design-2025-10-31t084732-801.png",
    "tag": "Sports",
    "date": "2025-10-31T19:01:18.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Bo Nix and C.J. Stroud have tough tasks ahead\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:01 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Two of the NFL's best defenses take center stage Sunday when the Texans host the Broncos in Week 9 action.The Texans have won three of four after an 0-3 start and are looking to improve their standing among the AFC teams on the outside looking in on the playoff picture while the 6-2 Broncos have won five straight -- tied with the Patriots for the longest active winning streak in the NFL -- and are hoping to maintain their spot atop the highly competitive AFC West.Both C.J. Stroud and Bo Nix are coming off excellent performances, too, and how each performs against a difficult opponent will go a long way in determining the outcome of this one.\nWhere to watch Texans vs. Broncos liveDate: Sunday, Nov. 2 | Time: 1 p.m. ETWhere: NRG Stadium -- Houston, TexasTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Broncos -1.5; O/U 39.5 (via FanDuel)Texans vs. Broncos: Need to knowC.J. Stroud and Bo Nix both played well in Week 9: Both Stroud and Nix have had up-and-down seasons. Nix got off to a bit of a slow start and, after a better stretch, seemed to regress in a loss to the Jets and a brutal first three quarters against the Giants. Then he led a 33-point fourth quarter in a 33-32 win over the Giants and carried that form over to Week 8 against the Cowboys, when he tossed four touchdown passes in a 44-24 rout. Nix's 15 touchdown passes this seas rank in the top 10 league-wide. Stroud is also coming off a strong performance, absolutely shredding the 49ers with short passes in a 26-15 win even though top wide receiver Nico Collins was out.Broncos' pass rush is in line for a big day: This game features the NFL's top three players in terms of quarterback pressure percentage: Houston's Will Anderson Jr. followed by Denver's Nik Bonitto and Jonathon Cooper. And don't forget about Danielle Hunter, the five-time Pro Bowl edge defender bookending Anderson Jr. on Houston's defensive front. While all four players should have big impacts Sunday, the Broncos' duo is especially set up for success. Stroud has taken 2.14 sacks per game this season, the 11th-highest rate in the NFL, and Houston tackles Aireontae Ersery and Tytus Howard have been up and down (especially Ersery, a rookie).Don't expect a lot of points: The 39.5 point total is one of the lowest this season. In fact, it's just the seventh game with an over/under total of fewer than 40 points. Of those previous six game, five have finished with fewer than 40 total points.Texans vs. Broncos prediction, pick\nThe Broncos will be without reigning Defensive Player of the Year Patrick Surtain II (pectoral), and that is a huge loss, even if Denver has plenty of other capable cornerbacks. Ultimately, the Broncos' advantages in the trenches -- their pass rush vs. the Texans' pass protection as well as the Broncos' superior run game -- turns the tide in their favor as they win their sixth straight. Pick: Broncos -1.5; Over 39.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Texans vs. Broncos: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/c97d19bb-e125-4449-a442-fcf9f2b9986b/thumbnail/1200x675/0989cad4878387cf8d85b4d8829f1f01/untitled-design-2025-10-31t084732-801.png"
      ],
      "datePublished": "2025-10-31T19:01:18.000Z",
      "dateModified": "2025-10-31T19:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Saints vs. Rams: TV channel, kickoff time, odds, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-saints-vs-rams-tv-channel-kickoff-time-odds-prediction-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/83699209-9cda-438c-93c1-f374e7223716/thumbnail/1200x675/6c5b228dcc5818b82dec2433107bb379/gettyimages-2243660850-2.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:01:30.000Z",
    "description": "\n        The Tyler Shough era begins for the New Orleans Saints this weekend as the Saints head west to take on the Los Angeles Rams. With a logjam at",
    "body": "\n        The Tyler Shough era begins for the New Orleans Saints this weekend as the Saints head west to take on the Los Angeles Rams. With a logjam at the top of the NFC West, this is a good opportunity for the Rams to stay in the thick of the division title race.In last week's loss to the Tampa Bay Buccaneers, the Saints benched Spencer Rattler in favor of the rookie Shough. Now, coach Kellen Moore has declared that Shough will be the starter in Week 9 and moving forward. The question is whether Shough can elevate an offense that has failed to hit 20 points in six of its nine games. With Puka Nacua expected to return for the Rams this week, the Saints defense will also face a tall task as it goes up against veteran quarterback Matthew Stafford.The Rams are coming off a bye week, and they are getting healthier. Nacua missed the team's London blowout of the Jacksonville Jaguars with an ankle injury, but coach Sean McVay said he anticipates having his star receiver back this weekend. Right before the bye, the Los Angeles defense was really heating up. It allowed a combined 10 points to the Lamar Jackson-less Baltimore Ravens and the Jaguars. That may not bode well for Shough.Everything you need to know about this NFC matchup can be found below.\nWhere to watch Saints vs. Rams liveDate: Sunday, Nov. 2 | Time: 4:05 p.m. ETLocation: SoFi Stadium -- Los AngelesTV: Fox | Stream: Fubo (Try for free)Follow along: CBS Sports AppOdds: Rams -14; O/U 43.5 (via DraftKings)Saints vs. Rams: Need to knowShough gets his first start: A second-round pick out of Louisville in the 2025 NFL Draft, Shough will get his first pro start this weekend. After relieving Rattler against the Bucs last weekend, Shough completed 17 of his 30 passes for 128 yards and an interception. Things won't get any easier for the rookie this week as he faces one of the best defenses in the league. Can Moore help Shough get some easy completions and find a rhythm early to ease his nerves?Keeping up with the NFC West: The NFC West joins the AFC West as the only divisions in the league with three five-win teams at this point in the season. The Rams (5-2) are trying to keep up with the Seattle Seahawks (5-2) and the San Francisco 49ers (5-3) every week. That means the Rams can't afford to drop games they should win, and this matchup with the Saints certainly falls into that category.Rams defense is eating: The Rams offense gets a lot off attention, and that's warranted, but their defense has been dominant to this point. That unit ranks first in sacks per game (3.7) and red zone touchdown rate (40%), second in points allowed per game (16.7) and third-down conversion rate (30.4%). Given that the Rams are facing a rookie quarterback who struggled in his first real action last week, those numbers could be even better when Week 9 is in the books.\nSaints vs. Rams prediction, pick\nThe spread on this game is massive with the Rams being 14-point favorites over the Saints. That's a big number, and I worry about the Saints kicking in the back door at the buzzer. That being the case, I will look at the Over/Under of 43.5. It's hard to see New Orleans lighting up the scoreboard, and with a critical game against the 49ers on deck, the Rams may be content to get a multiple score game and sit on it the rest of the way. Pick: Under 43.5 points\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Saints vs. Rams: TV channel, kickoff time, odds, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/83699209-9cda-438c-93c1-f374e7223716/thumbnail/1200x675/6c5b228dcc5818b82dec2433107bb379/gettyimages-2243660850-2.jpg"
      ],
      "datePublished": "2025-10-31T19:01:30.000Z",
      "dateModified": "2025-10-31T19:01:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The NBA Cup is back, but it needs one major change to get fans to care - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-cup-2025-format-expansion-tournament-fans/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/a0f5efe7-6c21-48d5-a119-94876365db34/thumbnail/1200x675/95ecb04a22b8b3b1553ef7cebfa21ade/nba-cup-getty-1.png",
    "tag": "Sports",
    "date": "2025-10-31T18:48:04.000Z",
    "description": "\n        The 2025 NBA Cup begins on Friday. Don't feel ashamed if you didn't know. It's Halloween, after all. You're probably busy, and the tournament",
    "body": "\n        The 2025 NBA Cup begins on Friday. Don't feel ashamed if you didn't know. It's Halloween, after all. You're probably busy, and the tournament has never started this early. The group stage was a November exclusive in 2023. It extended into December last year, and used a Tuesdays and Fridays format in both seasons. This year though? It's all over the map. We begin with four Fridays: Oct. 31, Nov. 7, Nov. 14 and Nov. 21. Then the NBA will attempt to own the week of Thanksgiving with more group stage games on Nov. 25, 26 and 28.If all of that feels arbitrary to you, well, that's sort of how it's felt for the past two years. It's hard to take a tournament seriously when it's broken up in this manner. Sometimes you'll just tune into a game and see a colorful court. It's hard to get fans in tournament mode when that tournament keeps getting flicked on and off like a light switch for more than a month. This thing drags into December once we reached the knockout stage. It's more than twice as long as the NCAA Tournament despite containing none of the inherent stakes. Fans love March Madness. October through December madness? Thus far, the response has been mostly ambivalent.We are entering Year 3 of the event. Building sustained interest was always going to take time. But compare the reception here to the Play-In Tournament. It was introduced in 2020 in the Orlando bubble. In 2021, we got a classic LeBron James vs. Stephen Curry showdown followed by the ascent of the Memphis Grizzlies as they knocked Curry's Golden State Warriors out of the postseason. By the summer of 2022, the NBA moved to make the Play-In Tournament permanent. It had already reached widespread approval among fans.The NBA Cup hasn't reached a similar consensus, and it's not hard to see why. The in-season tournament lacks the one thing that makes the Play-In round so fun: stakes. Fans and critics alike have argued for years about how the NBA could introduce stakes to the tournament. Compensatory picks, guaranteed playoff berths, maybe even seeding advantages, but the league justifiably wants the event to stand on its own. The idea should be to create an event that fans care about winning separate from the NBA Finals in June. That's not going to happen if teams are really just playing for a prize that will make things easier in the spring.\nWhat the NBA can potentially remedy is the format. Every March (in college) and April (In the NBA), we're reminded of how fun single-elimination basketball is. Every November, we watch group play and point-differentials sap these Cup games of any underlying tension. As we've acknowledged, fans love March Madness. That's what makes this format so strange. Why not just copy the existing tournament that is already beloved? Who really prefers the current month-long slog that's a nightmare to actually track over a simple, \"lose and you're out\" format? The NBA Cup is not going to gain meaningful traction among casual sports fans until it switches to a single-elimination format.And that's where this event hits its first significant road block. The NBA only has 30 teams. You can't make an even bracket for 30 teams without byes. You'd need 32 for a five-round, single-elimination event. Sure, you could introduce byes to try to balance the bracket on the fly, but the NBA wants these games to count in the regular-season standings, so they need everyone to play the same number of games. This takes us back to the obvious solution: adding two teams.\nWhen the NBA conceived this event, it may have assumed two new teams were coming. That was the widespread assumption from fans, anyway. But last offseason brought the first reported opposition to expansion since the idea began gaining traction several years ago. The Athletic reported in July that a number of owners, including James Dolan of the New York Knicks, would prefer not to introduce new partners right now that would cut into the massive media rights payout each team currently receives. The NBA is expanding into Europe with an international league, but at the moment, adding a 31st and 32nd team doesn't exactly seem imminent.The tournament format makes sense with 32 teams. Obviously, a clean five-round, single-elimination bracket would work. In order to maintain a stable number of games for each team, the league could subsequently create new loser's brackets with each passing round. Everybody would play five total games, and everybody would place somewhere between No. 1 and No. 32. A compromise to the stakes argument could be to use NBA Cup placement as the universal playoff seeding tiebreaker. Games could continue to count in the regular season standings.Could the NBA try something like this by including two teams from its new European league to get up to 32 tournament slots? Perhaps. It could be effective marketing for that league, after all, though if the NBA teams blow them out, the approach could backfire. The real trouble would be in assigning regular-season stakes to a game that involves teams that aren't playing in the regular season. Should an NBA team really get credit for a victory over what is effectively a minor-league team? Is that fair when the time comes to determine playoff seeding? Probably not.\nAll of this leaves the NBA Cup in a sort of limbo. It's not giving the league the marquee event it hoped for in its current format, yet the format it needs to thrive may or may not ever arrive. So the flawed version continues to exist, and will likely come with tweaks every year until any sort of consensus is achieved. Maybe the clustering of games in late November hits, but it also makes the earlier games seem less significant. Maybe there's a way to rearrange the groups in a more exciting way. But without the established drama of a single-elimination format, we're probably going to keep arriving in late October or early November and having to remind ourselves that a tournament we'd mostly forgotten about over the last 10 months is coming back to try and likely fail to grab the attention of the casual viewer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The NBA Cup is back, but it needs one major change to get fans to care - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/a0f5efe7-6c21-48d5-a119-94876365db34/thumbnail/1200x675/95ecb04a22b8b3b1553ef7cebfa21ade/nba-cup-getty-1.png"
      ],
      "datePublished": "2025-10-31T18:48:04.000Z",
      "dateModified": "2025-10-31T18:48:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 3 Fantasy Basketball Waiver Wire: Nickeil Alexander-Walker, leads top injury replacements - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/week-3-fantasy-basketball-waiver-wire-nickeil-alexander-walker-leads-top-injury-replacements/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/1307db5c-f093-4a10-91de-3a29ab68a75f/thumbnail/1200x675/5c335286e10d731bc96d30d6c5eca0b3/nickeil-alexander-walker-atlanta-hawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:35:04.000Z",
    "description": "\n        There have been a staggering number of injuries already this season. That has left many fantasy managers already scrambling to just fill out ",
    "body": "\n        There have been a staggering number of injuries already this season. That has left many fantasy managers already scrambling to just fill out a healthy roster. For those who need reinforcements off the waiver wire, consider adding the following players who are currently available in the majority of CBS leagues.Nickeil Alexander-Walker, Atlanta Hawks (48% rostered)In Wednesday's matchup against the Nets, Trae Young suffered a right knee sprain when one of his teammates fell into his leg. He has been ruled out for Friday's matchup with the Pacers, and the team has yet to announce a timetable for his return. He was reportedly going for an MRI on Thursday to get a better handle on his injury.Alexander-Walker has already been fantasy-relevant in his role off the bench this season, averaging 16.2 points, 3.2 assists, 1.4 steals, and 2.2 3-pointers per game. He has averaged seven 3-point attempts per game, which is up from 4.5 attempts per game last season with the Timberwolves. The Hawks have also played him at least 28 minutes in all five of their games. If Young misses extended time, Alexander-Walker could rack up even more points and assists. Even if Young returns quickly, Alexander-Walker has value in his current bench role.Jeremiah Fears, New Orleans Pelicans (36% rostered)The Pelicans appear to want to give Fears more opportunities to contribute. After scoring at least 13 points and coming off the bench in each of his first two games, the Pelicans inserted him into the starting five for last Friday's battle with the Celtics. It was a disaster, though, with Fears scoring two points on 1-for-11 shooting from the field.\nDespite his struggles against the Celtics, Fears remained in the starting lineup for Wednesday's battle with the Nuggets. He played much better, shooting 10-for-15 from the field on his way to recording 21 points, six assists, and two steals. He also played a season-high 30 minutes. Jordan Poole was benched on Wednesday and likely isn't a part of the Pelicans' long-term plans. We could see Fears stick in the starting five moving forward, making him a viable fantasy option for those who need scoring.Josh Minott, Boston Celtics (31% rostered)Despite the offseason dismantling of their roster, the Celtics entered the regular season with plenty of depth at guard. Their biggest issues are at forward and center, where they don't have a ton of size. At 6-foot-8, Minott was in the mix for one of their forward spots. After beginning the season as a member of the second unit, Minott has started each of the last two games.Minott posted a double-double against the Cavaliers on Wednesday and has averaged 13 points, 11.5 rebounds, two steals, one block, and 1.5 3-pointers over his two starts. Chris Boucher seems to be falling out of favor already, playing a total of 12 minutes over the last three games. Minott could stick in the starting lineup, so it might be time to add him already.\nKevin Huerter, Chicago Bulls (24% rostered)The Bulls have been a pleasant surprise with their 4-0 record out of the gate. They have remained undefeated despite playing without Coby White (calf). Tre Jones has been performing well while replacing White in the starting lineup, but he's not eligible for this column because he is rostered in 66% of CBS leagues.Huerter isn't starting, but he has averaged 26 minutes per game off the bench. He has parlayed that into averages of 14.8 points, four rebounds, three assists, and 1.5 3-pointers. It helps that the Bulls have played at the sixth-fastest pace in the league, leaving Huerter with more opportunities to contribute. The Bulls said they will re-evaluate White within a week, but even then, it's no guarantee that he will be ready to return. Huerter has averaged at least 1.8 3-pointers in every season of his career, so at worst, he's worth streaming for those who need help from behind the arc. When White does eventually return, then it will be time to drop Huerter.Jarace Walker, Indiana Pacers (21% rostered)The Pacers' season is already spiraling because of injuries. The most recent players to go down are Bennedict Mathurin (toe) and Obi Toppin (hamstring). Mathurin has been deemed week-to-week, while Toppin is expected to miss at least one month. Toppin being out is a big loss for their already thin frontcourt that didn't make any significant additions after losing Myles Turner in free agency.\nIn the first game without Toppin, Walker started and played 36 minutes. He recorded 20 points, six rebounds, five assists, three steals, one block, and four 3-pointers. His stat line could have been even better had he not shot just 5-for-19 from the field. The Pacers don't have a lot of options right now, so Walker should continue to see significant playing time.Jake LaRavia, Los Angeles Lakers (9% rostered)The Lakers have their own injury concerns with LeBron James (sciatica) and Luka Doncic (finger) out. The hits kept coming with the announcement that Gabe Vincent (ankle) has been ruled out for two to four weeks. The combination of their absences resulted in LaRavia playing 37 minutes against the Timberwolves on Wednesday. He stepped up by posting 27 points, eight rebounds, one steal, one block, and five 3-pointers. He shot 10-for-11 from the field, which is obviously a rate that isn't sustainable. However, he shot 47.5% last season, which was the best mark of his career.Doncic could be back as early as Friday, but James and Vincent both figure to be out for at least the next couple of weeks. Across the four games that LaRavia has played at least 28 minutes, he has averaged 11.8 points, five rebounds, 3.3 assists, and two 3-pointers. That makes him a viable waiver wire target in deeper formats.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 3 Fantasy Basketball Waiver Wire: Nickeil Alexander-Walker, leads top injury replacements - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/1307db5c-f093-4a10-91de-3a29ab68a75f/thumbnail/1200x675/5c335286e10d731bc96d30d6c5eca0b3/nickeil-alexander-walker-atlanta-hawks-imagn-images.jpg"
      ],
      "datePublished": "2025-10-31T19:35:04.000Z",
      "dateModified": "2025-10-31T19:35:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch 49ers vs. Giants: TV channel, kickoff time, odds, prediction, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-49ers-vs-giants-tv-channel-kickoff-time-odds-prediction-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/6afdbc8a-3eae-4b60-bddd-322e0ac09bc1/thumbnail/1200x675/03e3a704614bfc5bbb481f2590801a72/untitled-design-2025-10-31t090224-911.png",
    "tag": "Sports",
    "date": "2025-10-31T19:01:24.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Can the 49ers bounce back against the depleted Giants?\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 31, 2025\n                            \n                    at\n    3:01 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The San Francisco 49ers are coming off a disappointing loss to the Houston Texans, and now they have to go across the country for a game against the New York Giants. Following a season-ending injury to Cam Skattebo, the Giants are searching for answers on the offensive side of the ball.Last weekend, San Francisco ran into a stout Houston defense in a 26-15 loss. Christian McCaffrey was limited to just 25 rushing yards, and no pass-catcher had more than 45 receiving yards. Despite that rough outing, McCaffrey is still second in the NFL with 1,049 yards from scrimmage, and now he gets a Giants defense that got gashed by Saquon Barkley in Week 8. The question will be which quarterback starts for the 49ers. Brock Purdy has been dealing with a toe injury, and Mac Jones has a nagging knee injury.For the second time in the first half of the season, the Giants lost one of their best offensive weapons for the year when running back Cam Skattebo suffered a dislocated ankle against the Philadelphia Eagles. Between Skattebo and Malik Nabers, New York has to navigate the rest of the season without two dynamic weapons. That will put a lot on the shoulders of rookie quarterback Jaxson Dart, who has been impressive, but he came back to Earth last week. Who will the Giants turn to for offense against a solid 49ers defense?\nWhere to watch 49ers vs. Giants liveDate: Sunday, Nov. 2 | Time: 1 p.m. ETLocation: MetLife Stadium -- East Rutherford, New JerseyTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: 49ers -2.5; O/U 48.5 (via DraftKings)49ers vs. Giants: Need to knowInjuries abound: These might be two of the most injured teams in the NFL, and it seems like neither side has been anywhere near full health all season. Outside of Christian McCaffrey, just about every skill player on the 49ers offense has been in and out of the training room. Plus, the defense has lost Nick Bosa and Fred Warner for the season. In New York, Skattebo and Nabers are done for the year, and the secondary has suddenly gotten banged up. Paulson Adebo, Jevon Holland and Cor'Dale Flott are all nursing injuries this week.Highly suspect Giants defense: Now in his second season as the Giants' defensive coordinator, Shane Bowen is starting to feel the heat. That's because, despite an infusion of talent, his unit has been a liability. New York ranks 28th in takeaways (5), 29th in yards allowed per game (29th) and 30th in rush yards allowed per game (148.9). Given how much the Giants have to work with on the defensive line -- as well as some upgrades in the secondary -- they have been very disappointing on that side of the ball.McCaffrey has been busy: Because the rest of the 49ers' offense has been injured all season, McCaffrey has been forced to be the entire offense. Not only does he lead the team with 490 rushing yards, but he's the leading receiver as well. Coming into Week 9, McCaffrey has recorded 56 receptions for 559 yards and three touchdowns. It's been working for the 49ers, but they need to get more healthy bodies back to avoid wearing down the tread on McCaffrey's tires.49ers vs. Giants prediction, pick\nIt's always worrisome when a West Coast team goes to the East Coast for an early kickoff on Sunday, and that's where the 49ers find themselves this weekend. Having said that, it's hard to believe the Giants will be able to scrape together enough offense with the loss of Skattebo, who was doing good work on the ground and through the air. San Francisco has injury troubles of its own, but there is little question about which team is better from top to bottom. Pick: 49ers -2.5; Over 48.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch 49ers vs. Giants: TV channel, kickoff time, odds, prediction, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/6afdbc8a-3eae-4b60-bddd-322e0ac09bc1/thumbnail/1200x675/03e3a704614bfc5bbb481f2590801a72/untitled-design-2025-10-31t090224-911.png"
      ],
      "datePublished": "2025-10-31T19:01:24.000Z",
      "dateModified": "2025-10-31T19:01:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]