[
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Knicks-Nets, Thunder-Bucks, Kentucky-Texas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-knicks-nets-thunder-bucks-kentucky-texas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-21T20:01:34.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be unlocked by",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be unlocked by betting on college basketball or NBA action on Wednesday night. Oklahoma City and Milwaukee meet at 9:30 p.m. ET, with the Thunder favored by 9.5 points. SportsLine's proven computer model prefers taking the Over (227) as one of its Wednesday best bets.  The model has also revealed picks for Kentucky vs. Texas at 7 p.m. ET, along with Knicks vs. Nets at 7:30 p.m. ET. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. It also enters Week 12 of college basketball on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season. Anybody following its college basketball betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Wednesday's top picks, best betsKnicks -11.5 vs. Nets (-110)Over 227 in Bucks vs. Thunder (-110)Over 154.5 in Kentucky vs. Texas (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:\nKnicks -11.5 vs. NetsThe Knicks are in one of their worst stretches in recent years, losing nine of their last 11 games, with six of those setbacks coming by double digits. They never led and trailed by as many as 30 points in the first half of a 114-97 setback against Dallas on Monday. This is the perfect opportunity for New York to get back on track, as Brooklyn is 12 games back in the standings and is well into draft prep mode. The Nets have only won two games all month, and they have dropped seven of their last eight games. SportsLine's model has the Knicks winning by 14 points, covering the spread 56% of the time in the latest simulations. Back the Knicks at bet365 here:Over 227 in Thunder vs. BucksOklahoma City is coming off another impressive offensive display, putting up 136 points in a win over Cleveland on Monday. Star guard Shai Gilgeous-Alexander scored 30 points on 12-of-20 shooting, while Chet Holmgren added 28 points. Milwaukee is coming off a win of its own, beating Atlanta behind a 21-point performance from Giannis Antetokounmpo. Five of his teammates finished in double figures as well. The Thunder have gone Over the total in five of their last seven games, and the model has the Over cashing in 66% of simulations. Back the Over at bet365 here:Over 154.5 in Kentucky vs. TexasKentucky has turned its season around over the last two weeks, racking up a three-game winning streak. The Wildcats scored at least 75 points in all three of those outings, going over 90 points against Mississippi State while scoring 80 points at Tennessee last weekend. Texas has scored at least 70 points in seven straight games, recording at least 80 points in five of those games. The Longhorns have gone Over in 15 of their last 18 outings, and the Over hits 67% of the time in Kentucky vs. Texas on Wednesday. Back the Over at bet365 here:\nLooking for NBA and college basketball picks?You've seen the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Knicks-Nets, Thunder-Bucks, Kentucky-Texas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-21T20:01:34.000Z",
      "dateModified": "2026-01-21T20:01:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers coaching search: Ben Roethlisberger eyes Mike McCarthy, Aaron Rodgers pairing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-coaching-search-ben-roethlisberger-mike-mccarthy-aaron-rodgers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png",
    "tag": "Sports",
    "date": "2026-01-21T19:46:19.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After Mike Tomlin stepped down, the Pittsburgh Ste",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After Mike Tomlin stepped down, the Pittsburgh Steelers are in the middle of an offseason coaching search for the first time in nearly two decades. Former Steelers franchise quarterback Ben Roethlisberger recently \"put on his GM cap\" and shared thoughts on the best options.After being defensive-minded under Tomlin since 2007, Roethlisberger wants to see change.\"I would strongly consider a couple things ... my first thought is, I want an offensive-minded head coach,\" Roethlisberger said this week on the Channel Seven YouTube channel. \"That's what I would do if I was the general manager. We've had defensive-minded coaches in here, that's what they've all been, I'm ready for an offensive guy, I want to score more than six points in a postseason game. I would love a younger, offensive-minded head coach, a (Sean) McVay-ish, a Ben Johnson-ish who would focus on the offense and hopefully would be successful enough that you could keep here ... the next long-term coach.\"Roethlisberger said it's imperative to add a veteran defensive coordinator with \"full reins\" on that side of the football. He mentioned Jim Schwartz and Vic Fangio as options who would not need babysitting.\n\"My next choice would literally be Mike McCarthy,\" Roethlisberger said. \"Mike McCarthy is an offensive veteran coach with Pittsburgh ties, he understands the Steeler way, what it means to be a Steeler and the Rooney family and how it works. Lot of respect for him. He could bring a younger coordinator or whatever to help. The potential downside for that is how long would he keep coaching for? I don't know.\"The potential positive side of coming in here would be the potential of Aaron Rodgers coming back. They have a relationship together. I assume it's good enough. They won a Super Bowl together. You could bring his offense in. Aaron would know the offense and feel super comfortable in an offense he knows.\"McCarthy and Pittsburgh scheduled an interview for Wednesday. An accomplished play-caller, McCarthy went 125-77 with the Green Bay Packers during Rodgers' tenure before a five-year stint with the Dallas Cowboys that ended in 2024.\nRodgers, reportedly, is open to a return. Rodgers went 10-7 as Pittsburgh's starter while helping the Steelers capture their first AFC North division title since 2020.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers coaching search: Ben Roethlisberger eyes Mike McCarthy, Aaron Rodgers pairing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png"
      ],
      "datePublished": "2026-01-21T19:46:19.000Z",
      "dateModified": "2026-01-21T19:46:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL coaching carousel winners and losers: Giants ace Harbaugh hire, Bills falter - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-coaching-carousel-winners-and-losers-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/85b15e16-3cf6-4581-ab97-b98cf8071626/thumbnail/1200x675/5e9a4882d52717b110898d6ab56a6eaf/john-harbaugh.jpg",
    "tag": "Sports",
    "date": "2026-01-21T19:43:30.000Z",
    "description": "\n        This offseason's coaching carousel is one of the wildest in recent memory.Not only did two head-coaching jobs open during the season, but EIG",
    "body": "\n        This offseason's coaching carousel is one of the wildest in recent memory.Not only did two head-coaching jobs open during the season, but EIGHT more have become available since the end of the regular season, including two from teams that made the playoffs. The 10 total available head-coaching jobs -- Giants, Falcons, Cardinals, Bills, Dolphins, Browns, Ravens, Steelers, Titans and Raiders -- tie the record for most in a given offseason. Two of the jobs that remain open belong to teams with the past two regular-season MVPs, and one belongs to a franchise with arguably the most job stability in league history. There were -- and still are -- plenty of coordinator openings on both sides of the ball, and more could open depending on what happens with the remaining head-coaching slots.With that in mind, it's important to take stock of what has happened to date during the hiring cycle. We compiled a quick list of early winners and losers and will keep it updated as more openings get filled.Winner: New York GiantsThe Giants acted quickly and aggressively to land the top available coach of this hiring cycle, finalizing a five-year deal with former Baltimore Ravens head coach John Harbaugh before he could take planned meetings with the Tennessee Titans and Atlanta Falcons. \nAs we wrote last week, Harbaugh should bring immediate stability and competence to a Giants organization that has desperately needed both for at least the past decade, cycling through coach after coach and disappointment after disappointment. Harbaugh should also bring over a strong staff of assistant coaches, and the Giants will be better for having hired him.\n        \n            \n                John Harbaugh's first 100 days: The blueprint to rebuild the Giants\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nLoser: Buffalo BillsThe Bills' decision to fire Sean McDermott in the wake of their divisional-round loss to the Denver Broncos is somewhat understandable. It has been nine years of the McDermott era and seven of McDermott and Josh Allen, and they have yet to achieve their Super Bowl goals. McDermott might not have been the issue standing in Buffalo's way, but teams can only make changes in so many ways, and swapping out the coach is one of them.The Bills land here less because of the firing itself and more because they elevated Brandon Beane to an even more powerful role despite his presiding over a roster that has backslid over the past several years, then followed it with a disastrous press conference from Beane and owner Terry Pegula explaining both the firing and the promotion. \nAdd in the fact that this is not an ideal hiring cycle in which to search for McDermott's replacement, and the Bills land here with relative ease.\n        \n            \n                Bills owner Terry Pegula throws Keon Coleman under the bus, claims coaching staff pushed to pick wide receiver\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nWinner: Los Angeles ChargersWhatever one thinks of Mike McDaniel's head-coaching bona fides, there is no arguing that he can dial up an offense. He is one of the best in the NFL at putting players in position to succeed, specifically by getting playmakers the ball in space so they can make things happen after the catch. He also excels at designing a run game. The Chargers have struggled to run the ball for a while, and McDaniel should be able to alleviate that. McDaniel has done all of this over the past few years with a quarterback -- Tua Tagovailoa -- who has clear limitations, yet McDaniel schemed around them. Expected to be hired as the Chargers' offensive coordinator, McDaniel can build an offense around a quarterback with significantly more physical talent. The marriage between McDaniel and head coach Jim Harbaugh may be an odd one personality-wise, but from a football-fit standpoint, it's hard to believe the Chargers could have done a better job finding their next OC.\nLoser: Cleveland Browns (so far)Cleveland is still in its second round of interviews, with coaches such as Todd Monken and Jim Schwartz already getting their turns and others like Jesse Minter, Grant Udinski and Nate Scheelhaase reportedly in the mix. There is still a chance the Browns can land the plane here, and this designation could change if they make a home-run hire. (We'll switch them from loser to winner if and when they do.) For now, though, they belong here. Cleveland fired Kevin Stefanski, and he immediately landed another -- and probably more desirable -- job as the head coach of the Atlanta Falcons. The aforementioned McDaniel pulled his name out of consideration for the Browns' top job before deciding to become an offensive coordinator instead. Meanwhile, more jobs keep opening and pushing this one further down the pecking order.Winner: Tennessee Titans (kind of)The Titans hired former San Francisco 49ers defensive coordinator and New York Jets head coach Robert Saleh as their next coach. Perhaps just as importantly, they did not hire now two-time former Kansas City Chiefs offensive coordinator Matt Nagy, which had been heavily rumored before the Saleh news broke, given the connection between Nagy and Titans general manager Mike Borgonzi from their time in Kansas City. \nNagy showed little propensity for putting players in position to succeed during his tenure as head coach of the Chicago Bears, and the Chiefs' offense backslid significantly upon his return to his previous role, so it never made much sense that he was considered the favorite to land this job.Saleh's time in New York did not go particularly well, but that stemmed almost entirely from the revolving-door situation at quarterback. His defense ranked as the best in the league during that stretch. If the Titans are right about Cam Ward, things could be different this time around.\n        \n            \n                Robert Saleh rightfully gets a second chance with the Titans, but his OC hire will determine success\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nLoser: Miami DolphinsThe Dolphins fired McDaniel, and he immediately became the top candidate for nearly every offensive coordinator opening while also interviewing for multiple head-coaching jobs. In the wake of his firing, the rumor mill kicked into high gear that Miami wanted to pursue Harbaugh, but he showed more interest in other opportunities.\nThe Dolphins ultimately hired the Green Bay Packers tandem of Jon-Eric Sullivan and Jeff Hafley as their general manager and head coach, respectively. Hafley went 22-26 in four seasons as the head coach at Boston College before becoming Green Bay's defensive coordinator, where his defenses played very well early in the season before slipping down the stretch. He is a well-respected defensive mind, but it's fair to question whether this was the most inspiring hire in the grand scheme of things.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL coaching carousel winners and losers: Giants ace Harbaugh hire, Bills falter - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/85b15e16-3cf6-4581-ab97-b98cf8071626/thumbnail/1200x675/5e9a4882d52717b110898d6ab56a6eaf/john-harbaugh.jpg"
      ],
      "datePublished": "2026-01-21T19:43:30.000Z",
      "dateModified": "2026-01-21T19:43:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The American Express 2026 prop picks, odds: Golf longshot parlay from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-american-express-picks-predictions-odds-bets-pga-longshot-props-golf-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/0ff9678f-97d1-41bb-a58c-a7e1f4bacd1d/thumbnail/1200x675/642a83f72903956929ce589a3663f4a3/kurt-kitayama-pga-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-21T18:24:28.000Z",
    "description": "\n        The American Express 2026 is the second event of the PGA Tour season, but the first to feature the reigning four-time Player of the Year in S",
    "body": "\n        The American Express 2026 is the second event of the PGA Tour season, but the first to feature the reigning four-time Player of the Year in Scottie Scheffler. He and the rest of the field will tee off on Thursday, with the first tee times coming at 11:30 a.m. ET, from La Quinta Country Club, and Scheffler could figure into several PGA props or a golf parlay. He's the +300 favorite, per the latest 2026 American Express odds, despite never previously winning across five starts at this event. Thus, seeking out others to either top the leaderboard or have high finishes could be part of an American Express longshot parlay, especially since no other golfer is at +2000 or lower in the latest PGA odds.Andrew Landry has both a victory and a runner-up at this tournament, and he's at +30000 to simply record a top-10 finish, per the latest golf props. That could be a standalone bet or one leg in what could be a lucrative PGA Tour parlay. From outright winners to top 10 finishes to even wagering on there being an ace, there are lots of options to consider. Before making any 2026 American Express picks or golf parlays, you need to see this PGA Tour parlay from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its best bets since the restart, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 American Express field is locked in, SportsLine simulated the tournament 10,000 times. It has locked in betting picks to form a 5-leg golf parlay that pays out nearly $70,000 for a $10 bettor. See the picks and full parlay by heading to SportsLine.Top 2026 American Express   parlay, PGA Tour picksFor the American Express 2026, one of the picks featured in the model's 5-leg PGA Tour parlay is Kurt Kitayama to have a top 10 finish at +360. Kitayama is coming off his best season on tour as he picked up his second victory and finished a career-best of 35th in the final standings. For the third straight year, Kitayama notched four top-10 finishes, including at a pair of courses that check in at under 7,300 yards at TPC Deere Run and TPC Southwind. That's relevant for the American Express, as La Quinta Country Club is just 7,060 yards, making it the fourth-shortest course in use for the 2026 season.\nHis length off the tee works in his favor on short courses as Kitayama ranked fifth in driving distance last season. However, he also has a nice touch with irons, as he was also in the top 10 on tour in strokes gained: tee-to-green. Kitayama played this event last year, and while he didn't have the best showing, he did shoot par or better in all four rounds. That experience should be invaluable this week as the model has him notching a top-10 finish (+360) despite his +4500 longshot odds to outright win. See the rest of the PGA Tour parlay legs here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins:How to make PGA Tour parlay picks The model has also picked an outright winner, plus a prop that returns +700 among its five PGA Tour picks for the 2026 American Express   parlay that pays almost $70,000 on just a $10 bet. You can only see the picks and the full parlay at SportsLine.\nSo, who will win the 2026 American Express, and what combination of PGA Tour props could unlock nearly a $70,000 payday on just a $10 bet? Visit SportsLine now to get the PGA Tour parlay and picks for the American Express, all from the golf model that's nailed a whopping 16 majors entering the weekend, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The American Express 2026 prop picks, odds: Golf longshot parlay from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/0ff9678f-97d1-41bb-a58c-a7e1f4bacd1d/thumbnail/1200x675/642a83f72903956929ce589a3663f4a3/kurt-kitayama-pga-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-01-21T18:24:28.000Z",
      "dateModified": "2026-01-21T18:24:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks this week, Vegas odds: 2026 Championship Round expert predictions against the spread, parlay, props - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-this-week-vegas-odds-2026-conference-championship-games-expert-predictions-spread-parlay-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/67d67a4c-b62b-4034-83c4-c9fd4aa59ae3/thumbnail/1200x675/e985a8fedc08c7c949738daa8d7872ed/kenneth-walker.jpg",
    "tag": "Sports",
    "date": "2026-01-21T18:47:36.000Z",
    "description": "\nThe 2026 NFL playoffs continue on Sunday with the AFC Championship Game and the NFC Championship Game. Patriots vs. Broncos (+5.5) kicks off at 3 p.m",
    "body": "\nThe 2026 NFL playoffs continue on Sunday with the AFC Championship Game and the NFC Championship Game. Patriots vs. Broncos (+5.5) kicks off at 3 p.m. ET, followed by Rams vs. Seahawks (-2.5) at 6:30 p.m. ET. Those who've made NFL picks against the spread all year are probably aware that New England and Seattle each have a league-high of 13 spread wins this season. The Rams (12) are just behind them, but with Denver having just 8 ATS victories, the Broncos could be ones to fade with Championship Round NFL predictions.While that may have you leaning towards one side in the AFC Title Game, what should you make of the NFC Championship Game with your NFL bets? Just one ATS win separates the two, and they split their two regular season matchups both versus the line and outright. Having insight beyond ATS records may make one side more appealing for conference championship NFL predictions, and that's where utilizing betting trends from NFL experts comes in handy. Before locking in any Championship Round NFL picks or NFL prop bets, be sure to check out the Championship Round NFL best bets and predictions from SportsLine's red-hot Vegas experts. SportsLine has more than 40 hand-picked Vegas experts who excel in multiple spots. The NFL, however, is a strength for the site as SportsLine currently has five total experts who are on NFL runs that have returned $1,000 or more for $100 players and one who has returned more than $1,500. Anybody following their NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, with the Championship Round NFL schedule quickly approaching, SportsLine's top NFL experts are already locking in their picks. Go to SportsLine to see them all now.Top Championship Round NFL expert picks from R.J. WhiteWhite, CBS Sports' managing editor of Fantasy and gambling, is 21-15-1 (+445) over his last 37 over/under picks. For Patriots vs. Broncos, he is backing Under 41.5.\"The Patriots defense has run roughshod over a pair of offenses with major injury concerns the last two weeks, and they'll get another with Jarrett Stidham at QB. Playcaller Zak Kuhr is in his bag, completely outmaneuvering the Chargers and Texans, and Stidham faces an uphill battle to score points. Drake Maye's offense has struggled with turnovers against two top-tier defenses and gets another here, and the margin between the Broncos and second place in sacks was more than the gap between No. 2 and 9. Maybe another defensive score ruins this Under like it did last week in Texans-Pats, but I have to back it above the key number of 41.\" See all of White's picks here, and new users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:\nTop NFL picks from Alex SelesnickA prop-bet specialist, Selesnick, who is better known as PropStarz, has returned nearly 45 units since joining SportsLine. He enters this weekend on a 61-44 roll on NFL player props that has returned nearly $1,000 for $100 players. This week, PropStarz is going Over 17.5 receiving yards for Seahawks running back Kenneth Walker III.\"Kenneth Walker has cleared this line in seven of eleven games since the Seahawks Week 9 bye. This, of course, is despite an almost 50/50 route share split with Zach Charbonnet. With the latter back out for the season, I expect Walker to take on a bigger role, which should include more pass plays. It's a great matchup for him, as the Rams allowed the fifth most receiving yards to running backs in the regular season (38 yards per game), with an opposing back clearing this line in nine of their last eleven games. This includes Walker's 64-yard and 44-yard performances (Charbonnet with six total targets and 32 yards as well). I'd bet this up to over 20.5.\" See the rest of PropStarz's picks here, and bet the Under here:\nHow to make Championship Round NFL picksSportsLine's team of experts also includes Brady Kannon, a former SuperContest winner who enters the Championship Round on a sizzling 28-14 run (67%) on NFL spread picks, returning over $1,200 for $100 players. You can find out who his NFL picks are this weekend here. If you are looking for NFL picks, NFL props, or NFL best bets for the Championship Round, SportsLine has you covered with its proven team of experts. Visit SportsLine now to see who which teams you should back in the Championship Round, all from a staff that includes five experts who are on NFL runs that have returned $1,000 or more for $100 players.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks this week, Vegas odds: 2026 Championship Round expert predictions against the spread, parlay, props - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/67d67a4c-b62b-4034-83c4-c9fd4aa59ae3/thumbnail/1200x675/e985a8fedc08c7c949738daa8d7872ed/kenneth-walker.jpg"
      ],
      "datePublished": "2026-01-21T18:47:36.000Z",
      "dateModified": "2026-01-21T18:47:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Agent's Take: For Texans, full steam ahead on Anderson deal; slow down on Stroud - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/agents-take-texans-will-anderson-jr-c-j-stroud-contracts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/a7b9d582-ee38-496e-b9f3-dc3b20046760/thumbnail/1200x675/b81eb860cb23ae9e44d1b87199675257/texans-jpeg.jpg",
    "tag": "Sports",
    "date": "2026-01-21T18:41:56.000Z",
    "description": "\n        The contract situations of edge rusher Will Anderson Jr. and quarterback C.J. Stroud move to the forefront with the Houston Texans after a 28",
    "body": "\n        The contract situations of edge rusher Will Anderson Jr. and quarterback C.J. Stroud move to the forefront with the Houston Texans after a 28-16 loss to the New England Patriots in the AFC divisional playoffs. As 2023 draft picks, Anderson and Stroud became eligible for contract extensions when the 2025 regular season ended on Jan. 4.The Texans giving Anderson a new deal is a no-brainer. Anderson was named a first-team All-Pro after posting a career- high 12 sacks this season. The 2023 NFL Defensive Rookie of the Year had double-digit sacks for the second straight season.Anderson's 85 quarterback pressures (combined sacks, quarterback hits and quarterback hurries) were the league's second-most, according to the NFL's Next Gen Stats. He also had Pro Football Focus' best pass-rush win rate for the 2025 season at 26.2%.Anderson elevated his game during the playoffs. He was dominant against the Patriots with three sacks and two forced fumbles.\nFortunately for Anderson, the Texans prefer shorter-term deals. Nick Caserio hasn't done an extension longer than three years since becoming general manager in January 2021. The Texans created a blueprint for All-Pro first-round picks with cornerback Derek Stingley Jr.'s player-friendly contract extension after his third NFL season last March. Nicole Lynn, Anderson's agent, should insist that the Texans follow this blueprint with her client. Stingley became the NFL's first $30 million-per-year defensive back when he signed a three-year, $90 million extension with $89,026,026 in guarantees, of which $48,026,026 was fully guaranteed at signing. The $89,026,026 is a defensive back record for overall guarantees. Stingley's deal happened so quickly that the Texans didn't have to pick up his $17.595 million fifth-year option for 2026, which was still factored into the equation.\nPicking up Anderson's fifth year in 2027 is a foregone conclusion if a deal isn't done prior to the May 2 deadline for such options. Anderson's fifth-year salary will be the 2026 transition tag for defensive ends since he was named to one Pro Bowl on the original ballot during his first three NFL seasons.The 2026 transition tag for defensive ends projects to 6.739% of the 2026 salary cap (it's 7.118% for 2025). If the 2026 salary cap is set at $300 million, a 7.45% increase over 2025's $279.2 million salary cap, the defensive end figure should be $20.216 million.Stingley's deal is extremely front-loaded. He has 23.33%, 28.33%, 51.11% and 75% of his new money, respectively, through the fourth year of his rookie contract (2025), the option year (2026), his first new contract year (2027) and his second new contract year (2028). In a neutral deal which isn't front-loaded or back-loaded, there would be 8.33%, 16.67%, 33.33% and 66.67% of the new money, respectively, after these junctures.\nThe latest data point in an edge rusher market that dramatically escalated in 2025 is the four-year, $180 million extension Aidan Hutchinson received from the Detroit Lions in October, averaging $45 million per year with a non-quarterback-record $141 million in guarantees. Hutchinson's deal came in right behind Micah Parsons' market-setting, four-year, $186 million extension, averaging $46.5 million per year, that was a part of his trade from the Dallas Cowboys to the Green Bay Packers as the start of the 2025 regular season was approaching.Lynn isn't a stranger to market-setting edge rusher deals. She made Myles Garrett the NFL's first $40 million-per-year non-quarterback with two years left on his contract like Anderson now has. Garrett's four-year, $160 million extension with the Cleveland Browns last March raised the bar for edge rushers by 12.77%. Overall, the top of the edge rusher market increased by 36.76% in 2025. Despite 2025's dramatic market reset, Anderson should try to have his cake and eat it too by becoming the league's highest-paid non-quarterback (and edge rusher) eclipsing Parsons while also setting a new standard for overall guarantees on the shorter-term deal.\n\n        \n            \n                Texans' C.J. Stroud may have cost himself millions with 4 INTs; Head-scratching game for Sean McVay\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nPumping the brakes on StroudIt could be a different story with Stroud. He has regressed since having one of the greatest debut seasons for a quarterback when he was named 2023's NFL Offensive Rookie of the Year. The Texans had 2023's biggest turnaround winning the AFC South with a 10-7 record after going 3-13-1 in 2022 as Stroud completed 63.9% of his passes for 4,108 yards with 23 touchdowns and five interceptions to post a 100.8 passer rating.There were some mitigating factors in Stroud's inability to rebound this season from a sophomore slump in 2024. Wholesale changes were made in revamping the offensive line, which included trading five-time Pro Bowl left tackle Laremy Tunsil to the Washington Commanders. The running game took a hit with Joe Mixon, who rushed for over 1,000 yards in 2024, missing the season because of a foot injury. There were also growing pains with new offensive coordinator Nick Caley.None of that excuses Stroud ending the season with the worst two-game stretch of his NFL career during the playoffs. Stroud's four interceptions, all in the first half, against the Patriots followed five fumbles (two were lost) in a wild card game win over the Pittsburgh Steelers. He connected on 51.9% of his passes for 462 yards with two touchdowns and five interceptions to post a 51.8 passer rating in the two playoff games.\nStroud's fifth-year option for 2027 projects to 8.395% of the 2026 salary cap, which is down from 9.09% in 2025. His option-year salary should be $25.186 million with a $300 million salary cap in 2026. This option will surely be exercised since $25.186 million is a reasonable number for a starting quarterback. Kyler Murray should serve as a cautionary tale for doing a lucrative extension with a first-round quarterback at the earliest possible instance. He signed a five-year, $230.5 million extension (worth up to $238 million through salary escalators) with the Arizona Cardinals in July 2022 that made him the NFL's second-highest-paid player at $46.1 million per year. The 2019 NFL Offensive Rookie of the Year was coming off a terrible performance in the one playoff game of his professional career, a lopsided loss to the eventual Super Bowl LVI champion Los Angeles Rams, when he got his new deal.Murray was effectively benched for Jacoby Brissett, a journeyman backup quarterback, prior to going on injured reserve in Week 10 with a right foot sprain suffered five games into the 2025 season. Arizona's offense operated more efficiently with Brissett at the helm.\nThe Cardinals are expected to part ways with Murray this offseason. Unless a trade materializes, the Cardinals will have $52,429,354 in 2026 dead money, a salary cap for a player no longer on a team's roster, largely thanks to $36.8 million of Murray's 2026 salary being fully guaranteed by releasing him conventionally.Stroud is represented by David Mulugheta, who negotiated the Texans' last big quarterback deal. Deshaun Watson signed a four-year, $156 million extension in 2020 making him the NFL's second-highest-paid player at $39 million per year. He was coming off a 2019 season as a third-year player in which he ranked in the NFL's top 10 for touchdown passes and completion percentage while the Texans won the AFC South. Unlike Stroud, Watson elevated his play in the postseason when the Texans were eliminated in the divisional playoff round by the Kansas City Chiefs, who won Super Bowl LIV.The Texans appear to have a good working relationship with Mulugheta. He represents Stingley. \nMulugheta has negotiated another high-end quarterback deal since Watson's fully guaranteed, five-year, $230 million contract in 2022 when the Texans traded him to the Cleveland Browns. The four-year, $220 million extension Jordan Love received from the Packers at the start of training camp in July 2024 put him in a tie with Joe Burrow and Trevor Lawrence as the league's highest-paid player at $55 million per year. Love was coming off a stellar second half of the 2023 season as a first-time starter and raised his game in the playoffs. He was the best quarterback on the field in Green Bay's wild card round upset of the Cowboys and season-ending loss to the San Francisco 49ers in the divisional playoffs. Cowboys quarterback Dak Prescott was the NFL MVP runner-up and 49ers quarterback Brock Prudy was an MVP finalist in 2023.Mulugheta could contend that Lawrence wasn't as accomplished as Stroud through the first three years of their respective careers when the Jacksonville Jaguars rewarded him with a five-year, $275 million extension in June 2024. Stroud hasn't missed the playoffs, like Lawrence, and the Texans have won a playoff game each year with him under center.\nLawrence regressed in 2023 after seemingly turning a corner during the latter part of the 2022 season while leading the Jaguars to the playoffs and the AFC South crown. The Jaguars imploded down the stretch of the 2023 season losing five of the last six games to miss the playoffs after being in control of the AFC South with an 8-3 record. Ball security was Lawrence's Achilles' heel. His 60 career turnovers (39 interceptions and 21 fumbles lost) in his first three NFL seasons were the most during this span.Sometimes the best deals are the ones you don't make. That should be applicable to the Texans if Mulugheta drives a hard bargain in any contract extension talks for Stroud that take place before the 2026 regular season begins. Waiting would be more costly if Stroud has a 2026 season comparable to his rookie campaign. Baltimore Ravens quarterback Lamar Jackson is likely to top Prescott's $60 million per year to become the new standard bearer for quarterback salaries sooner rather than later. That could be a risk worth the Texans taking to get a better indication whether Stroud can provide quarterback stability for years to come.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Agent's Take: For Texans, full steam ahead on Anderson deal; slow down on Stroud - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/a7b9d582-ee38-496e-b9f3-dc3b20046760/thumbnail/1200x675/b81eb860cb23ae9e44d1b87199675257/texans-jpeg.jpg"
      ],
      "datePublished": "2026-01-21T18:41:56.000Z",
      "dateModified": "2026-01-21T18:41:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFC Championship Game: Rams' Jimmy Garoppolo set for seventh title appearance - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfc-championship-game-rams-jimmy-garoppolo/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/5d63ac4d-162d-4363-8503-ff7711b84da9/thumbnail/1200x675/11751b2ed16fa73e000691a69902c4f2/jimmy-g.jpg",
    "tag": "Sports",
    "date": "2026-01-21T19:05:32.000Z",
    "description": "\n        When you think of players who frequent AFC and NFC championship games, names like Tom Brady, Joe Montana, Peyton Manning and Patrick Mahomes ",
    "body": "\n        When you think of players who frequent AFC and NFC championship games, names like Tom Brady, Joe Montana, Peyton Manning and Patrick Mahomes probably come to mind. Perhaps surprisingly, quarterback Jimmy Garoppolo does as well, set to be in his seventh conference championship. That sits tied with Mahomes for third-most in NFL history. Only Brady (14) and Montana (8) are ahead of him.Garoppolo accomplished this feat on three different teams, the New England Patriots, San Francisco 49ers and now the Los Angeles Rams over his 12-year career. While he didn't start in all seven, he still has the bragging rights.In total his teams are 3-3 in conference championship games, so Sunday's game against the Seattle Seahawks will be the tie breaker. The Seahawks are 2.5-point favorites, per DraftKingsGaroppolo was the backup for Brady when they defeated the Indianapolis Colts 45-7 in 2014, when they lost to the Denver Broncos 20-18 in 2015 and when they defeated the Pittsburgh Steelers 36-17 in 2016.The 2014 season ended with a Super Bowl win and a ring for Garoppolo, with the Patriots defeating the Seattle Seahawks 28-24. He got his second ring in 2016, when New England delivered its historic comeback win over the Atlanta Falcons.\nGaroppolo has more rings than Aaron Rodgers, Brett Favre, Russell Wilson, Steve Young and Joe Namath and has the same number of rings as Manning.In 2019, Garoppolo got his chance as a starter and went to three NFC Championships with the San Francisco 49ers, who he joined in 2017. His first was a 37-20 victory over the Green Bay Packers and was his only conference championship win as a starter. He went on to his first and only Super Bowl as QB1, losing to the Kansas City Chiefs. Two years later he found himself back in the NFC Championship and lost 20-17 to his future team, the Rams. In 2022 he lost to the Philadelphia Eagles 31-7.\nThe 34-year-old joined the Rams as a backup to Matthew Stafford in 2024 and won't see playing time on Sunday unless something significant happens. As a starter, Garoppolo is 43-21 and played in 85 games total, with 13,599 passing yards, 82 touchdowns and 42 interceptions. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFC Championship Game: Rams' Jimmy Garoppolo set for seventh title appearance - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/5d63ac4d-162d-4363-8503-ff7711b84da9/thumbnail/1200x675/11751b2ed16fa73e000691a69902c4f2/jimmy-g.jpg"
      ],
      "datePublished": "2026-01-21T19:05:32.000Z",
      "dateModified": "2026-01-21T19:05:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB free agency tracker: Latest deals as Cody Bellinger goes back to the Yankees - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-free-agent-tracker-2025-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/67db75f8-22c2-4b97-913b-db140a718bb6/thumbnail/1200x675/c71f71bc3e4c9013597e81dc92fc4319/bellinger-getty.png",
    "tag": "Sports",
    "date": "2026-01-21T18:30:03.000Z",
    "description": "\n\n\n    \n                                    Here are the latest signings from baseball's hot stove\n        \n                                          ",
    "body": "\n\n\n    \n                                    Here are the latest signings from baseball's hot stove\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 21, 2026\n                            \n                    at\n    1:30 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The offseason is winding down and almost all of the top free agents are off the table. Cody Bellinger is headed back to the Yankees on a five-year deal in what many viewed as an inevitable reunion, albeit one that took longer than expected.The best free agent in the class, Kyle Tucker, agreed to a deal with the Los Dodgers. Bo Bichette is headed to the Mets and their NL East counterpart Phillies re-signed J.T. Realmuto. The Red Sox recently signed Ranger Suárez on a five-year deal and Alex Bregman landed with the Chicago Cubs.Still, some big-name free agents remain unsigned, including Framber Valdez. Kyle Schwarber (who returned to the Phillies), Pete Alonso and Edwin Dìaz (who left the Mets for the Orioles and Dodgers, respectively) all signed during the Winter Meetings in December. The Astros, meanwhile, made a splash on New Year's Day, agreeing to a contract with Japanese rigty Tatsuya Imai, who is coming to MLB after a stellar career in Japan's Nippon Professional Baseball.\nEarlier this winter, right-hander Dylan Cease agreed to a seven-year, $210 million deal with the Blue Jays on Thanksgiving Eve. It's tied for the fourth-largest deal in terms of total money among active pitchers, and is a big boost for the reigning AL champs. While there's no Aaron Judge or Juan Soto on the market this winter, there's plenty of top talent still available. Tucker, a four-time All-Star who will turn 29 in January, leads the list, and though his second half left much to be desired, he could be a huge asset for any team. Bregman was left on the market until late last winter but he showed no ill effects, putting up a 128 OPS+. On the pitching side, Valdez and Suárez would slot in toward the front of any rotation.\n\n        \n            \n                Ranking top 50 MLB free agents for 2026: Kyle Tucker, Alex Bregman at top, plus landing spots for every player\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nOur top 50 free agent rankings include write-ups on every player. CBS Sports will be keeping track of where they land below.2025-26 MLB free agent trackerRankPlayerPOSLast TeamNew TeamStatus1\n    \n                    \n                Kyle Tucker\n                    \n                    (29)\n            \n    \nOF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to a four-year, $240 million deal2\n    \n                    \n                Alex Bregman\n                    \n                    (31)\n            \n    \n3B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to five-year, $175 million deal3\n    \n                    \n                Bo Bichette\n                    \n                    (27)\n            \n    \nSS\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to three-year, $126 million deal4\n    \n                    \n                Framber Valdez\n                    \n                    (32)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    5\n    \n                    \n                Kyle Schwarber\n                    \n                    (32)\n            \n    \nDH\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to five-year, $150 million deal6\n    \n                    \n                Cody Bellinger\n                    \n                    (30)\n            \n    \nLF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to five-year, $162.5 million deal7\n    \n                    \n                Munetaka Murakami\n                    \n                    (25)\n            \n    \n3B/1BTokyo Yakult Swallows (NPB)\n                            \n    \n                                                \n                    \n    Agreed to two-year, $34 million deal8\n    \n                    \n                Shota Imanaga\n                    \n                    (32)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Accepted the QO9\n    \n                    \n                Pete Alonso\n                    \n                    (31)\n            \n    \n1B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to five-year, $155 million deal10\n    \n                    \n                Ranger Suarez\n                    \n                    (30)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to five-year, $130 million deal11\n    \n                    \n                Dylan Cease\n                    \n                    (30)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to seven-year, $210 million deal12\n    \n                    \n                Tatsuya Imai\n                    \n                    (27)\n            \n    \nSPSaitama Seibu Lions (NPB)\n                            \n    \n                                                \n                    \n    Agreed to three-year deal worth up to $63 million13\n    \n                    \n                J.T. Realmuto\n                    \n                    (34)\n            \n    \nC\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Re-signed on a three-year, $45 million deal14\n    \n                    \n                Eugenio Suarez\n                    \n                    (34)\n            \n    \n3B\n                            \n    \n                                                \n                    \n    15\n    \n                    \n                Edwin Diaz\n                    \n                    (31)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to three-year, $69 million deal16\n    \n                    \n                Trent Grisham\n                    \n                    (29)\n            \n    \nCF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Accepted the QO17\n    \n                    \n                Michael King\n                    \n                    (30)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to three-year, $75 million deal18\n    \n                    \n                Zac Gallen\n                    \n                    (30)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    19\n    \n                    \n                Devin Williams\n                    \n                    (31)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to a three-year, $51 million deal20\n    \n                    \n                Luke Weaver\n                    \n                    (32)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $22 million deal21\n    \n                    \n                Robert Suarez\n                    \n                    (34)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to three-year, $45 million contract22\n    \n                    \n                Kazuma Okamoto\n                    \n                    (29)\n            \n    \n3B/1B/OFYomiuri Giants (NPB)\n                            \n    \n                                                \n                    \n    Agreed to four-year, $60 million contract23\n    \n                    \n                Josh Naylor\n                    \n                    (28)\n            \n    \n1B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Re-signed on five-year, $92.5 million deal24\n    \n                    \n                Ryan Helsley\n                    \n                    (31)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $28 million deal25\n    \n                    \n                Brandon Woodruff\n                    \n                    (32)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Accepted the QO26\n    \n                    \n                Justin Verlander\n                    \n                    (42)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    27\n    \n                    \n                Merrill Kelly\n                    \n                    (37)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $40 million deal28\n    \n                    \n                Gleyber Torres\n                    \n                    (29)\n            \n    \n2B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Accepted the QO29\n    \n                    \n                Jorge Polanco\n                    \n                    (32)\n            \n    \n2B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $40 million deal30\n    \n                    \n                Harrison Bader\n                    \n                    (31)\n            \n    \nCF\n                            \n    \n                                                \n                    \n    31\n    \n                    \n                Ryan O'Hearn\n                    \n                    (32)\n            \n    \n1B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $29 million deal32\n    \n                    \n                Mike Yastrzemski\n                    \n                    (35)\n            \n    \nRF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $23 million deal33\n    \n                    \n                Lucas Giolito\n                    \n                    (31)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    34\n    \n                    \n                Chris Bassitt\n                    \n                    (36)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    35\n    \n                    \n                Brad Keller\n                    \n                    (30)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $22 million deal36\n    \n                    \n                Dustin May\n                    \n                    (28)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to one-year, $12.5 million deal37\n    \n                    \n                Emilio Pagan\n                    \n                    (34)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $20 million deal38\n    \n                    \n                Phil Maton\n                    \n                    (32)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Accepted two-year, $14.5 million deal39\n    \n                    \n                Tyler Rogers\n                    \n                    (35)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to three-year, $37 million contract40\n    \n                    \n                Pete Fairbanks\n                    \n                    (32)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to one-year, $13 million deal41\n    \n                    \n                Cedric Mullins\n                    \n                    (31)\n            \n    \nCF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to one-year, $7 million deal42\n    \n                    \n                Miguel Rojas\n                    \n                    (36)\n            \n    \n2B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to one-year, $5.5 million deal43\n    \n                    \n                Rob Refsnyder\n                    \n                    (34)\n            \n    \nRF\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Signed one-year, $6.25 million deal44\n    \n                    \n                Luis Arraez\n                    \n                    (28)\n            \n    \n1B\n                            \n    \n                                                \n                    \n    45\n    \n                    \n                Cody Ponce\n                    \n                    (31)\n            \n    \nSPHanwha Eagles (KBO)\n                            \n    \n                                                \n                    \n    Signed three-year, $30 million deal46\n    \n                    \n                Zack Littell\n                    \n                    (30)\n            \n    \nSP\n                            \n    \n                                                \n                    \n    47\n    \n                    \n                Michael Conforto\n                    \n                    (32)\n            \n    \nLF\n                            \n    \n                                                \n                    \n    48\n    \n                    \n                Josh Bell\n                    \n                    (33)\n            \n    \n1B\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to one-year, $7 million deal49\n    \n                    \n                Isiah Kiner-Falefa\n                    \n                    (30)\n            \n    \nUTL\n                            \n    \n                                                \n                    \n    50\n    \n                    \n                Steven Matz\n                    \n                    (34)\n            \n    \nRP\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Agreed to two-year, $15 million deal\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB free agency tracker: Latest deals as Cody Bellinger goes back to the Yankees - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/67db75f8-22c2-4b97-913b-db140a718bb6/thumbnail/1200x675/c71f71bc3e4c9013597e81dc92fc4319/bellinger-getty.png"
      ],
      "datePublished": "2026-01-21T18:30:03.000Z",
      "dateModified": "2026-01-21T18:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The American Express 2026 odds, predictions, field: PGA picks from proven golf model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/american-express-2026-odds-picks-field-projected-leaderboard-golf-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/cca796be-d831-45d3-bc41-9c8b96474e79/thumbnail/1200x675/72a43fc0b959a17d1da8063bfbf954f2/matthew-fitzpatrick-pga-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-21T18:09:51.000Z",
    "description": "\n        After an abbreviated stop in Hawaii, the 2026 PGA Tour schedule tees off the West Coast Swing with The American Express 2026 beginning on Thu",
    "body": "\n        After an abbreviated stop in Hawaii, the 2026 PGA Tour schedule tees off the West Coast Swing with The American Express 2026 beginning on Thursday at the Pete Dye Stadium Course in La Quinta, Calif. After skipping the one-week Hawaii Swing, World No. 1 Scottie Scheffler is set to make his debut as part of The American Express 2026 field. The four-time major winner hasn't played particularly well in this event, however, recording just one top-10 finish in five tries. The first tee times come at 11:30 a.m. ET, with Scheffler beginning at 12:14 p.m. ETThe 2026 American Express odds list Scheffler as the +300 favorite (risk $100 to win $300). Ben Griffin, ranked No. 8 in the world, is next on the PGA odds board at +2000, with Robert MacIntyre and Russell Henley at +2200 and Ludvig Aberg at +2500. Patrick Cantlay and Sam Burns, both at +2700, are the only other golfers getting lower than +3000.Before locking in any 2026 American Express picks, or making any PGA DFS picks on sites like FanDuel or DraftKings, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its golf betting picks since that point, nailing tournament after tournament.\nThis same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 American Express field is locked in, SportsLine simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. \n2026 American Express predictions One major surprise the model is calling for at The American Express 2026: Sam Burns, one of the favorites, stumbles and barely cracks the top 10. He's a golfer to avoid at La Quinta this week. Burns had some highlights in 2025, including finishing T7 at the Tour Championship after a strong playoff run. There were also some low points as well like going nine straight tournaments without a top-20 finish, including three straight missed cuts in that run. He has a pair of top-10 finishes at The American Express, but no top-5s, and he finished T29 last year, so the model doesn't like him as a top contender this week. See who else to fade here. Another surprise: The model calls Matt Fitzpatrick a top-four contender this week despite being a +3500 longshot. He's a golfer to target if you're looking for a big return. This will be his debut at The American Express, but he finished 2025 strong with four top-10 finishes in his last six events. He finished the season 34th in Strokes Gained: Total and 30th in Strokes Gained: Putting, making him a golfer to target with slightly longer odds this week. See who else to pick here. New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins:\nHow to make 2026 American Express picksThe model is targeting six total longshots with odds of +4000 or higher in its outright bets. You can only see the model's picks here. Who will win the 2026 American Express, and which longshots will stun the golfing world? Check out the 2026 American Express odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 American Express odds, favorites Get full 2026 American Express picks, best bets and predictions here. (odds via FanDuel and subject to change)\nScottie Scheffler +300Ben Griffin +2200Robert MacIntyre +2200Russell Henley +2200Sam Burns +2500Ludvig Åberg +2500Patrick Cantlay +2700Si Woo Kim +3000Sepp Straka +3500Harry Hall +3500Matt Fitzpatrick +3500Taylor Pendrith +4000Michael Thorbjornsen +4000Kurt Kitayama +4000Daniel Berger +4500Ryan Gerard +5000Alex Noren +5000Akshay Bhatia +5500Harris English +6000Denny McCarthy +6000Min Woo Lee +6000Adam Scott +6000Richard Hoey +6000Rasmus Højgaard +7000Davis Thompson +7000J.T. Poston +7000Pierceson Coody +7000Alex Smalley +7000Rickie Fowler +7000Samuel Stevens +7500Nick Taylor +7500Jacob Bridgeman +7500Patrick Rodgers +7500Matt McCarty +7500Justin Rose +7500Michael Kim +7500Will Zalatoris +7500Max Greyserman +7500Wyndham Clark +8000Brian Harman +8000Jason Day +8000Christiaan Bezuidenhout +8000Sahith Theegala +8000Keith Mitchell +8000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The American Express 2026 odds, predictions, field: PGA picks from proven golf model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/cca796be-d831-45d3-bc41-9c8b96474e79/thumbnail/1200x675/72a43fc0b959a17d1da8063bfbf954f2/matthew-fitzpatrick-pga-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-01-21T18:09:51.000Z",
      "dateModified": "2026-01-21T18:09:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA player props, picks, odds: Back Gilgeous-Alexander with Wednesday best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-player-props-picks-odds-back-shai-gilgeous-alexander-donovan-mitchell-nba-best-bets-wednesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/04edf34e-f99a-43fb-b16b-7d7989d39898/thumbnail/1200x675/d47f0e6097648544b1401e9b1869868c/shai-gilgeous-alexander-oklahoma-city-thunder-4.jpg",
    "tag": "Sports",
    "date": "2026-01-21T17:58:52.000Z",
    "description": "\n        Oklahoma City is the favorite to win another NBA championship this season, leading the league with a 36-8 record. The Thunder are powered by ",
    "body": "\n        Oklahoma City is the favorite to win another NBA championship this season, leading the league with a 36-8 record. The Thunder are powered by reigning MVP Shai Gilgeous-Alexander, who is averaging 31.8 points per game. He has an over/under of 31.5 points for Wednesday night's game against Milwaukee, which is currently outside the playoff picture. SportsLine's proven computer model is backing Gilgeous-Alexander to go Over his point total in this matchup, and it has also locked in several other NBA player props. Targeting NBA player props will be a popular way to approach Wednesday's NBA betting at online sports betting sites. With NBA odds available for almost every player in every game at sportsbooks, the model can help you find value to add to your Wednesday NBA picks at various sportsbooks. They can also help new users take advantage of sportsbook promos like the DraftKings promo code, where new users can bet $5, and get $300 in bonus bets if your first bet of at least $5 wins: The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Best NBA player prop picks on Wednesday:Donovan Mitchell, Cavaliers, Over 29.5 points Andrew Nembhard, Pacers, Under 7.5 assists  Shai Gilgeous-Alexander, Thunder, Over 31.5 points Click here to play these NBA props with the latest FanDuel promo code, which gives new users $300 in bonus bets if your first $5 wager wins:Donovan Mitchell, Cavaliers, Over 29.5 points (-120)Mitchell continues to shoot at a high volume with teammate Darius Garland sidelined due to a toe injury. Garland is the team's second-leading scorer at 18 points per game, leaving Mitchell as the obvious scoring option at 29 points per game. He scored 35 points against the 76ers last Wednesday before shooting 4-of-13 on Friday and 5-of-18 on Monday. Mitchell is primed to bounce back against Charlotte in a high-scoring game on Wednesday night, with the model projecting 32.5 points for Cleveland's superstar. Bet on Mitchell with the latest DraftKings promo code, which gives new users $300 in bonus bets if their first $5 wager wins:Andrew Nembhard, Pacers, Under 7.5 assists (-120) The Pacers are struggling mightily on offense, ranking last among NBA teams in field-goal percentage (44.3%). They had their worst offensive output of the season on Saturday in a 121-78 loss to Detroit before turning the ball over 24 times in a loss to Philadelphia on Monday. Nembhard is having to take more shots than last season, which has led to him averaging 7.1 assists. He had just five assists against the 76ers, and the model has him finishing with 6.5 assists against Boston on Wednesday. Bet on Nembhard with the latest bet365 bonus code, where new users can get $200 in bonus bets after placing a first wager of $5 or more:Shai Gilgeous-Alexander, Thunder, Over 31.5 points (-115)Gilgeous-Alexander is in line for the NBA MVP award this season, averaging 31.8 points, 6.2 assists and 4.3 rebounds per game. He scored 39 points against Miami on Saturday before scoring 30 points in the blowout win over Cleveland on Monday. The 27-year-old could need a high-volume outing on Wednesday, as both Alex Caruso (groin) and Jaylin Williams (glute) left Monday's game. Caruso has been ruled out, while Williams is questionable. Jalen Williams (hamstring) and Isaiah Hartenstein (calf) are both out as well. This is projected to be a single-digit game, which is one reason why the model has Gilgeous-Alexander scoring 35.5 points.Bet on Gilgeous-Alexander with the latest BetMGM bonus code, which gives new users up to $1,500 back in bonus bets if your first bet loses: Want more Wednesday NBA picks?You've seen the model's NBA picks for some popular NBA player props for Wednesday. Now, see NBA projections for every player prop at SportsLine.Also at SportsLine:NBA expert Prop Bet Guy is 51-36 (+950) in his last 87 NBA player prop picks this season. See his latest NBA predictions here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA player props, picks, odds: Back Gilgeous-Alexander with Wednesday best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/04edf34e-f99a-43fb-b16b-7d7989d39898/thumbnail/1200x675/d47f0e6097648544b1401e9b1869868c/shai-gilgeous-alexander-oklahoma-city-thunder-4.jpg"
      ],
      "datePublished": "2026-01-21T17:58:52.000Z",
      "dateModified": "2026-01-21T17:58:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yankees re-signing Cody Bellinger: Outfielder returns on five-year, $162.5M contract - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/cody-bellinger-yankees-free-agency-contract/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/fffaa5be-c3b9-4894-b140-736e95d97de5/thumbnail/1200x675/568876ba8c4957ba890ba3dc7d724b2c/bellinger-getty.png",
    "tag": "Sports",
    "date": "2026-01-21T18:49:43.000Z",
    "description": "\n        The New York Yankees and outfielder Cody Bellinger have agreed to terms on a five-year, $162.5 million contract that will keep the former MVP",
    "body": "\n        The New York Yankees and outfielder Cody Bellinger have agreed to terms on a five-year, $162.5 million contract that will keep the former MVP award winner in place. The deal includes opt-out opportunities after the second and third seasons, plus a full no-trade clause, CBS Sports HQ's Jim Bowden has confirmed. The team has not yet announced the move.The two sides had engaged in reunion talks throughout the winter, with the hold-up being over the contract's term. Bellinger reportedly wanted a seven-year agreement. In the end, he settles for fewer years, but gains the ability to control his own destiny -- and perhaps to return to the free-agent market for another, bigger contract in a few years. Bellinger, 30, joined the Yankees in a salary dump trade with the Chicago Cubs last offseason, essentially replacing Juan Soto after he left for the New York Mets. He had a terrific season, slashing .272/.334/.480 with 29 home runs while starting at least 38 games in all three outfield spots. Those 29 homers and his 5.1 WAR were Bellinger's best since his NL MVP season in 2019.\nThe Yankees needed Bellinger and Bellinger certainly benefits from returning to the Yankees as well. Over the last two years, Bellinger has hit .302/.365/.544 in Yankee Stadium and .256/.313/.416 everywhere else. His tendency to pull the ball in the air fits very well with Yankee Stadium's short right field porch. The player and team match up nicely here.We ranked Bellinger as the sixth-best free agent available this offseason. Here's the write-up:\nThere aren't many better fits than Yankee Stadium for a left-handed  batter who excels at lifting and pulling the ball. Even so, Bellinger's  continued resurgence can be credited to his reinvention as a bat-control  merchant. He struck out just 29 times more across the last two seasons  than he did in 2022 alone. His in-zone contact rate this past season,  meanwhile, ranked alongside names like Yandy Díaz, the aforementioned  Bichette, and Jose Altuve.  Bellinger, who remains a plus defender in a corner, needs the right  surroundings to excel. If he finds it, he ought to continue providing  average and power alike.Reigning two-time AL MVP Aaron Judge is entrenched in right field and Trent Grisham will roam center after accepting the qualifying offer. The Yankees figure to deploy Bellinger in left field, pushing erstwhile top prospect Jasson Domínguez to the bench -- or, perhaps, to another team through a trade. Alternatively, the Yankees could continue to rotate Bellinger, Domínguez, and Grisham like they did in 2025.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yankees re-signing Cody Bellinger: Outfielder returns on five-year, $162.5M contract - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/fffaa5be-c3b9-4894-b140-736e95d97de5/thumbnail/1200x675/568876ba8c4957ba890ba3dc7d724b2c/bellinger-getty.png"
      ],
      "datePublished": "2026-01-21T18:49:43.000Z",
      "dateModified": "2026-01-21T18:49:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How 20-0 Miami RedHawks are beating odds as college basketball midmajor darlings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/how-the-20-0-miami-redhawks-are-beating-the-odds-and-becoming-an-irresistible-sports-story/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/030c7d61-009d-4cd6-a13d-652ed515d988/thumbnail/1200x675/045f3e03067c74c0fe83d08d501850fa/miamiohiounbeatencbs.jpg",
    "tag": "Sports",
    "date": "2026-01-21T20:05:49.000Z",
    "description": "\n        Flying to the top of the list of stories that are turning this 2025-26 season into one of the best college basketball has seen in 15-plus yea",
    "body": "\n        Flying to the top of the list of stories that are turning this 2025-26 season into one of the best college basketball has seen in 15-plus years: The 20-0 Miami University RedHawks.  The sport doesn't get a 20-0 team every year, but when it does, it's typically a high-major program. Reinforcing the specialness of this year: Arizona (18-0) and/or Nebraska (18-0) could get there in the next week.  But a mid-major reaching 20 games without a scratch is rare. How rare? Since 1990, only six teams that could reasonably be classified as \"true\" mid-majors have opened 20-0, and even within this list there are a couple of squads (UMass in the '90s, San Diego State just six years ago) that flex the definition of what constitutes a mid-major outfit.  Season \t\t\t\tSchool \t\t\t\tWins \t\t\t\tDate of first loss \t\t\t\tNCAA Tournament result \t\t\t\t2025-26 \t\t\t\tMiami (Ohio) \t\t\t\t20 \t\t\t\tTBD \t\t\t\tTBD \t\t\t\t2019-20 \t\t\t\tSan Diego State \t\t\t\t26 \t\t\t\tFeb. 22, 2020 \t\t\t\tNone (NCAAT canceled) \t\t\t\t2013-14 \t\t\t\tWichita State \t\t\t\t35 \t\t\t\tMarch 23, 2014 \t\t\t\tLost in Round of 32 \t\t\t\t2011-12 \t\t\t\tMurray State \t\t\t\t23 \t\t\t\tFeb. 9, 2012 \t\t\t\tLost in Round of 32 \t\t\t\t2010-11 \t\t\t\tSan Diego State \t\t\t\t20 \t\t\t\tJan. 26, 2011 \t\t\t\tLost in Sweet 16 \t\t\t\t2003-04 \t\t\t\tSaint Joseph's \t\t\t\t27 \t\t\t\tMarch 11, 2004 \t\t\t\tLost in Elite Eight \t\t\t\t1995-96 \t\t\t\tUMass \t\t\t\t26 \t\t\t\tFeb. 24, 1996 \t\t\t\tLost in National Championship \t\t\t\tNow Miami (Ohio) is on the list and just became the first MAC team to start a season 20-0, too. It's a pair of wins away from breaking 2001-02 Kent State's record for the longest win streak in league history as well.   Travis Steele's group has not only hit this point without a defeat, but they've also started to lean into the drama of it all. The No. 25 RedHawks could easily be a two-loss team, but instead they remained perfect in their two most recent games by taking matters into overtime twice — upping their national profile in the process. On Saturday, a pair of near-buzzer-beating 3-pointers against Buffalo led to a 105-102 win, including the clincher from star wing Peter Suder, who dropped 37 points. This is how you get a nation to start paying attention.   \nTuesday night's road escape against Kent State was arguably even more incredible, given the locale and how the game progressed in the second half. The din of Kent State's home gym provided the best atmosphere anywhere in college hoops Tuesday night. Miami blew a 14-point lead, and in the closing minutes, it looked like its first loss was imminent. Instead, a Kent State turnover with less than 15 seconds in regulation led to Miami sophomore guard Luke Skaljac pulling out a wicked Eurostep to create space and tie the game at 92. The RedHawks handled their business in a harsh environment in overtime, winning 107-101.  \"Our guys are unflappable,\" Steele told CBS Sports after the win Tuesday night on the team's four-hour bus ride back to Oxford, Ohio. \"If you could be inside our huddle in those moments, there's complete and utter belief we're winning the game. I don't care what the situation is, we're down four, down six, up six: do your job. Our guys stay really, really focused and actually get tighter as a unit in big moments.\"   \n Men of Steele overcoming the odds Though Miami's overall strength of schedule is woeful (339th out of 365 teams), the slope of difficulty in getting to 20-0 is reflected in its Strength of Record ranking (21) and its Wins Above Bubble mark (29th). Those are objective indicators of how well Miami has done against its schedule vs. what the average bubble team would've done to this point.  In SOR, the RedHawks rank better than the likes of 16-4 Clemson, 14-4 Villanova, 14-5 St. John's, 13-5 Louisville, 12-6 Tennessee and many more. And this isn't the richest program in the MAC, either. Not by a long shot. Miami is somewhere in the middle of the pack of the league from an NIL perspective, well behind the likes of UMass, in addition to in-state peers Akron, Kent State and Ohio. Which makes the most surprising thing about this run all the more special: We have a 20-0 mid-major team in 2026.  That was a near-unbelievable proposition as recently as two months ago. The RedHawks are doing this at a time when it's never been more difficult for coaches and programs outside the power-conference structure to thrive. The gap is widening to concerning levels. Yet here's Miami University, reminding us that it CAN be done. That's an important development amid a time of ever-present anxiety about the power structure of college basketball as it hurtles toward the back end of this decade.   \"Incredibly fun, just the day-to-day is unbelievable,\" Steele said. \"In the hotels, on the bus trips, practices, shootarounds, lifts. Man, our guys have a TON of fun together. Our whole group does. Staff, players, we're a very, very connected group. And it was that way last year, too. People see the results, but the day-to-day is even better than the results.\"  Keep in mind, they're doing this without their starting point guard, which makes it even more outlandish. Miami lost its maestro, Evan Ipsaro, to a torn ACL in a Dec. 20 win against Ball State.   \n        \n            \n                Trotter's Trends: How Duke's adjustments have it playing with confidence; building the All-Bench All-Stars\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \n\"He was as good as any mid-major point guard in the entire country,\" Steele said. \"An absolute monster.\"  Skaljac was subsequently forced into playing point, something he'd never done in college. He's making it work and the team hasn't slowed — not at all. Miami ranks second nationally in points per game (94.6) and is No. 1 in effective field goal shooting (60.4%). It ranks top-15 in 3-point accuracy and top-five in 2-point percentage.  Tuesday night's win wasn't just the 20th straight win, it was 20 in a row with at least 75 points scored. In the past 40 years, the only teams to win 20 in a row and put up 75-plus in every game are: the famed 1987-88 Loyola Marymount team that had one of the best offenses ever; the 1990-91 UNLV team that made it to the Final Four undefeated; the 1998-99 Duke team that made the national title game; and the 2001-02 Duke team that made the Final Four.  And now: these men of Steele.  The RedHawks popped into the AP rankings this week at No. 25, landing in the rankings for the first time since the days of Wally Szczerbiak. With no more games until next Tuesday's home tilt vs. UMass, Miami is assured of a ranking for the second week in a row. The RedHawks are the first MAC team to be ranked since the Nate Oats-coached Buffalo Bulls were ranked — ready for this? — every week of the regular season in 2018-19. That Bulls team went 32-4 and got as high as 14th in the rankings. It earned a No. 6 seed, too. The idea of a MAC school in 2026 taking up an AP ranking every week of the season seems nearly impossible, and that's an indictment of the power shift over the past few years with the portal.  Aside from this, this is still highly uncommon. Prior to Buffalo in 2019, the most recent MAC team to earn an AP ranking came in 2007-08 when Kent State popped in for one week in February at No. 23.  The RedHawks are the rare mid-major team to start 20-0. Can it run the regular season table? \n                                                                    Imagn Images\n                                                            None of this has stopped Miami from defying the odds. One of the key ways to do it: retention. Seven significant rotation players from last season's 25-9 team that was three points away from beating Akron in the MAC title game and reaching the NCAA Tournament. Miami hasn't danced since 2006-07.   It's more than the roster, though. Steele said 25 people who were in the program last year carried over into this year. That is a huge part of this story. Mid-major coaching staffs regularly lose people each year for a variety of reasons. The core in Oxford stuck together, and as a result, is authoring one of the feel-good stories in all of sports in 2026.  \"There's a reason why we brought them here,\" Steele said, adding that many players on this roster were on title-winning teams in high school. \"They are so easy to coach in those big moments. I think retention is everything in today's landscape. You've got NIL, the portal. What's the term some coaches use, mercenaries? We don't have that.\"   In fact, Miami only added one player in the portal last season.   \"We recruit a lot of high school guys and I'm still holding on a little bit to that old model: development, get our guys better, we have fun together, we win and I hope that means something,\" he said. \"I think it does to our guys.\"   How the Xavier failure made Steele the right coach for Miami On March 9, 2022, Xavier was a bubble team, coached by Steele, that entered the Big East Tournament needing to win at least one game, if not two, to ensure its credentials to make the NCAAs. But it lost 89-82 in the opening round to Butler. It was Steele's fourth season with the program and, as expected, Xavier was left out.  It went to the NIT and, after winning its first game by four points against Cleveland State, Steele was hastily fired the next day by Xavier AD Greg Christopher, who was eying Sean Miller and trying to get ahead of South Carolina (who would also offer Miller a job in the ensuing days). As a result of his firing, Steele was the first Xavier coach since the 1970s to not take the team to the NCAA Tournament during his tenure.  That's a major résumé stain, but it didn't stop Miami from wanting Steele and it didn't affect Steele's confidence in his coaching acumen. In fact, it ultimately did the opposite. \"I know I would not be the coach I am today if I didn't have my experience I went through at Xavier,\" Steele said. \"It was a hard moment when I got let go, but I was appreciative of the opportunity I was given there. I don't know how many people are ready to become a head coach until you get your feet wet, let alone how many people can do it at the P5/P6 level unless there is so much support around you.\"   He could have taken a year off or easily landed on a high-major staff elsewhere.  But he still wanted to be a head coach.   The Miami job opened that same cycle in 2022 and he chased it. Crucially, athletic director David Sayler gave Steele full control of the program and trusted him to bring the RedHawks out of the muck. Steele interviewed like he had nothing to lose (because maybe he didn't) and said it had to be his vision entirely, otherwise go hire somebody else.  \"It was carte blanche, full control of everything over the program and being patient in this landscape,\" Steele said. \"Everybody wants instant success every year because of the portal and NIL. We had to build it the slow-and-steady way.\"   Travis Steele was fired after four years at Xavier and turned in an even better career arc at Miami. \n                                                                    Getty Images\n                                                            There was no deviation from the plan. Steele told Sayler the first year would not be good and it wasn't: 12-20. Year 2 had some improvement at 15-17, including 9-9 in the league. The RedHawks made their jump last year to the upper echelon of the MAC, and now they're a national story.     Steele doesn't hesitate to talk about what didn't work at Xavier, why he was ready in some respects but also not ready in others to be a head coach at a power-conference program.  \"You look back at those moments, and I did, and it hurt when it happened, and you ask what could I have done different?\" Steele told me. \"What could I have changed? I've been able to implement that here at Miami. You live and you learn on how to build culture. I've got my non-negotiables on the staff, bringing in the right young men, style of play. I never even got to coach offensively the way I wanted to coach at Xavier. Here, I've been able to do it my way since Day 1.\"  Steele's more clear-eyed, levelheaded now about what the job actually is. What's this season-by-season journey about for everyone? That's trickled down to his players. Watch his team: It's fun, but composed. It's a lively group but never out of sorts. The trust in the huddle is easy to see through a TV screen. As the wins keep piling up, the players are enjoying it all the more. They're a big deal on campus right about now, but Steele said there isn't any outside pressure on this group.  \"They don't feel any pressure at all. Live life, enjoy it, have fun, play for one another,\" he said. \"It's amazing when you think about others how you don't feel any pressure. When you play for the guy next to you and not for yourself.\"  Statistically, the road game against Kent State was the toughest one remaining on Miami's schedule. When's the first loss going to come? Nobody in Oxford's worried about that right now. KenPom gives the team a 4.5% chance of running the regular season table, but after the past two games it's hard to discount the magical element to this team. If 20-0 is possible, why not 24-0? Why not 27-0? Why not 31-0? This is the glory life of a 20-0 team in the bus league that is the MAC. After the four-hour ride across Ohio, Steele walked in his door at 2:54 a.m. ET on Wednesday morning. He stole a few hours of sleep, then was back in the car shortly after breakfast and readying for the next win. It's a story that feels as fun now as it is unfinished. With love and honor, the Miami RedHawks are starting to flirt with history. Let's see how high they soar. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How 20-0 Miami RedHawks are beating odds as college basketball midmajor darlings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/030c7d61-009d-4cd6-a13d-652ed515d988/thumbnail/1200x675/045f3e03067c74c0fe83d08d501850fa/miamiohiounbeatencbs.jpg"
      ],
      "datePublished": "2026-01-21T20:05:49.000Z",
      "dateModified": "2026-01-21T20:05:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: What's next for Mets; Cardinals eye veteran outfielder - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-cardinals-austin-hays-twins-red-sox-tristan-gray/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/5758884c-5270-4dfd-adb1-38462f4accb8/thumbnail/1200x675/32e533dbb6775d0455cc6360857a1aeb/hays-getty.png",
    "tag": "Sports",
    "date": "2026-01-21T17:31:37.000Z",
    "description": "\n        Major League Baseball's offseason continues to wind down, with just three weeks remaining until pitchers and catchers report for camp across ",
    "body": "\n        Major League Baseball's offseason continues to wind down, with just three weeks remaining until pitchers and catchers report for camp across sites in Arizona and Florida. That doesn't mean teams can just take it easy until then, however, since several top free agents remain unsigned, including left-hander Framber Valdez and outfielder Cody Bellinger. Below, CBS Sports has compiled all of Wednesday's most notable murmurs and moves in one spot for your convenience.Mets land Robert; could Peralta be next?The Mets and White Sox agreed to a three-player swap late Tuesday night that was headlined by outfielder Luis Robert Jr. In return, the White Sox acquired utility player Luisangel Acuña and right-handed pitching prospect Truman Pauley.What's next on New York's to-do-list? Per The Athletic, the Mets may look to yet another outfielder to their collection. That addition is likely to be modest in price, suggesting that someone of Austin Hays' ilk (more on him soon) may be more likely than Cody Bellinger. They also could trade for a starting pitcher, with Brewers right-hander Freddy Peralta making sense on paper. The Mets have had a busy winter overall, adding Robert, Bo Bichette, Marcus Semien, Jorge Polanco, and others while bidding adieu to mainstays like Pete Alonso, Jeff McNeil, Brandon Nimmo, and Edwin Díaz.\nCardinals interested in outfielderCount the Cardinals among the clubs to show interest in veteran outfielder Austin Hays, per the New York Post. Hays, 30, spent last season with the Reds. In 103 games, he batted .266/.315/.453 (105 OPS+) with 15 home runs and seven stolen bases. Throughout his career, he's been more effective against left-handed pitchers, posting an .819 OPS with the platoon advantage (as opposed to a .717 mark without). \nThat platoon split makes Hays a sensible target for a Cardinals roster that, as of the moment, features several left-handed outfielders and corner players, including Alec Burleson and Lars Nootbaar. \nIn addition to the Cardinals, Hays has been linked to the Yankees, Mets, and other clubs throughout the offseason.Twins, Red Sox make tradeThe Twins have acquired infielder Tristan Gray from the Red Sox in exchange for minor-league catcher Nate Baez, the teams announced Wednesday morning.\nGray, 29, has appeared in 47 big-league games to date in his career, most recently appearing in 30 contests with the Rays in 2025. Although he's only posted a 77 OPS+, he has shown a feel for making authoritative contact, as demonstrated by his 46.8% hard-hit percentage. (The league-average is around 40%.) He figures to compete for playing time on the Minnesota infield.\nBaez, 24, hit .278/.371/.423 in 96 games last year across High- and Double-A. He's a former 12th-round pick by way of Arizona State University. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: What's next for Mets; Cardinals eye veteran outfielder - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/5758884c-5270-4dfd-adb1-38462f4accb8/thumbnail/1200x675/32e533dbb6775d0455cc6360857a1aeb/hays-getty.png"
      ],
      "datePublished": "2026-01-21T17:31:37.000Z",
      "dateModified": "2026-01-21T17:31:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arch Manning's father, Cooper, has full trust in Texas process, Steve Sarkisian - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arch-manning-father-cooper-texas-steve-sarkisian/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/6f3228ec-1440-465f-aec6-7df35f0287bb/thumbnail/1200x675/d58d1cb38dc0be0902a00948f04f29c7/cooper-manning-arch-1.jpg",
    "tag": "Sports",
    "date": "2026-01-21T17:35:09.000Z",
    "description": "\n        Texas' 2025 season didn't go as planned. The Longhorns hoped to be hoisting something a bit more prestigious than the Cheez-It Citrus Bowl tr",
    "body": "\n        Texas' 2025 season didn't go as planned. The Longhorns hoped to be hoisting something a bit more prestigious than the Cheez-It Citrus Bowl trophy, but they believe what took place in that game is a sign of things to come.Quarterback Arch Manning took home Citrus Bowl MVP honors after throwing for 221 yards and two touchdowns, while also leading Texas in rushing with 155 yards and two more scores in a 41-27 victory over Michigan. The face of the third generation of the Manning dynasty started to resemble a budding superstar, but it wasn't an easy year by any means. Arch's father, Cooper manning, kept faith in the process through the ups and downs.\"I was really glad to see him get better every week,\" Cooper told CBS Sports. \"I think your confidence grows as you play more games. You learn how to win some games in the fourth quarter, and maybe when you didn't have your best stuff. \n\"I think it's fun to watch your kids mature, but it's also fun to watch an athlete mature and start playing their best football as the season ends.\"Cooper spoke to CBS Sports while promoting Capital One Venture X Business.\"I'm really flattered to be partnered with Capital One, especially this Venture X business card. It's been a godsend for us to be able to move around a lot. We traveled to a lot of football games this fall and I leaned on the Capital One Business travel guys to book flights, hotels, rental cars, fun dinners, and it's busy, but it was good not to worry about things and let them worry about the small things.\"For Arch, the 2025 season ended just how it began, with Manning projected as the No. 1 overall pick in a future NFL draft. However, it's everything that took place along the way that was so interesting. The college football world was shocked to see Manning complete 56.7% of his passes for 170 yards, one touchdown and one interception in a 14-7 loss to Ohio State in the season opener. He threw for just 38 yards in the first three quarters, and did not look like a player that could live up to the lofty expectations set before him.\n\"I'm not sure you handle it. You just kind of deal with it,\" Cooper said of the preseason excitement centered around his son. \"I think Arch said it best. It was a lot of undeserved hype. I mean, he had played two football games. I don't think anybody was going to live up to those expectations, and they were there to shoot him down, and he hung in there.\"Texas dropped its SEC opener to Florida, won the Red River Rivalry in a matchup where Manning threw for just 166 yards, then needed overtime to defeat Kentucky and Mississippi State in back-to-back weeks. However, it was in that 45-38 come-from-behind victory against the Bulldogs when things started to click for Manning, even though he didn't finish the game.Manning threw for 346 yards and scored four total touchdowns. His 46 passing attempts in that matchup marked a season-high, and his 346 passing yards were a season-high at the time as well. Over the final six games of the season, Manning averaged nearly 300 yards passing per game, and threw 14 touchdowns compared to two interceptions while Texas went 5-1.\nFirst seven gamesLast six gamesCompletion percentage60.3% 62.3%Passing yards per game207.0285.7Passing TDs vs. INTs12/514/2Rushing TDs55In all, Manning completed 61.4% of his passes for 3,163 yards, 26 touchdowns and seven interceptions while adding 399 yards and 10 more touchdowns on the ground. What was the biggest lesson learned from the 2025 season? Manning's father says the more experience his son got, the more the game started to slow down.\"I think just to trust his coaches and trust his ability,\" Cooper said. \"I think there were times early when he was going, 'Why did I screw that up?' Just hang tight. You're maybe putting a little too much pressure on yourself. Just try to sit back, enjoy and just take what's there, and it'll slow down for you.\"Manning is famously walking a path many other college stars are not. He isn't in a rush to reach the NFL, his goal isn't to rack up NIL dollars and it was never about starting right away. Cooper is very aware of this brave new world, and understands programs have to adapt or get lapped. But he likes what they've found with Texas.\"We are probably a little old school,\" Cooper said. \"I like going to college where you wanted to go to college. Where you want to make friends and develop relationships and grow up. It's not all easy. I'm not sure when Arch set out to go to school he wanted to sit as a backup for two years. Was it the best thing for him? Probably so. Sometimes the best thing for you is not the most fun. \"These are young men that are dedicating a lot of time and I think they love the sport, but hopping around is not something I'm a fan of. But at the same time, if you don't adapt, you lose. And that's the way it works in business and in sports. The coaches probably don't love having free agency every year, but they adapt and I think they did very well trying to get people to come join the team. People recognize, 'Hey, a lot of these guys are sticking around here. They like where they are in Austin, they like the coaching staff.' You don't have a lot of turnover. You don't have a lot of people leaving that you didn't want to leave. It's a crazy time in college sports, but you have to either deal with it or you get left behind.\"A home away from homeWhat's made things easier for the Manning family has been the support system at Texas. Steve Sarkisian is set to enter his sixth season in Austin, while Manning has a longstanding relationship with his position coach as well. \"I think coach Sarkisian and Arch have a great relationship,\" Cooper said. \"I think he's one of the great play callers. I think Arch has benefited a ton from having pretty much that offensive staff still be there. A.J. Milwee is the quarterbacks coach, he recruited him in high school and he's still on staff. Sark is still calling the plays, it's the same language, it's the same verbiage. It's the same.\"The other day we were watching a game and a quarterback ran into the end zone and kind of had the ball out, and Arch goes, 'Sark would yell at me so bad if I had scored without having that ball secure!' So you kind of know what they like and what they expect of you and that's all part of being in a program for a long time.\"When it comes to expectations for Texas in 2026, Cooper didn't talk about a national championship or any individual accolades. Instead, he alluded to the young talent Texas possesses and how different this team could be. \"I'm really looking forward to some guys that didn't get to play a lot last year who we saw play in the bowl game and really come on,\" Cooper said. \"You know, that time between the end of the season and the bowl game is precious for the young guys. Some guys are going pro, some guys are in the portal. So some young guys come in and really get a lot of attention and play well in the bowl game. I'm excited for some young guys and obviously they brought in some portal people that are good players. So I think that's going to be a little bit of a wrinkle. People are going to have a little harder time scouting -- who is Texas early on?\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arch Manning's father, Cooper, has full trust in Texas process, Steve Sarkisian - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/6f3228ec-1440-465f-aec6-7df35f0287bb/thumbnail/1200x675/d58d1cb38dc0be0902a00948f04f29c7/cooper-manning-arch-1.jpg"
      ],
      "datePublished": "2026-01-21T17:35:09.000Z",
      "dateModified": "2026-01-21T17:35:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where Drake Maye ranks among greatest sophomore QB seasons in NFL history - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/drake-maye-patriots-sophomore-qb-seasons-nfl-history-rank/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/5b5b3665-207e-43e5-97d7-3d88ad315b0f/thumbnail/1200x675/094d52c190ddefa50b6e740d0b639576/drake-maye.jpg",
    "tag": "Sports",
    "date": "2026-01-21T17:57:03.000Z",
    "description": "\n        Raise your hand if you had MVP and Super Bowl winner Drake Maye on your NFL bingo card for this season entering the year.That would have soun",
    "body": "\n        Raise your hand if you had MVP and Super Bowl winner Drake Maye on your NFL bingo card for this season entering the year.That would have sounded crazy about five months ago, but now it's closer to becoming reality thanks to one of the greatest breakout seasons by a young quarterback in NFL history.Of all the stats on Maye, this might be my favorite: He's the first qualified quarterback to post the NFL's best record (14-3), completion percentage (72.0%) and yards per attempt (8.9) in the same season since Tom Brady in 2007. Patriots fans, I hope you realize how lucky you are.\nThe fact that Maye posted the highest completion rate in the league while also airing it out more than anyone else is obscene. He led the NFL in completion rate on throws 15-plus yards downfield this year after ranking last in 2024. He emerged as one of the league's best off-schedule passers -- skills that helped him continue a rich tradition of quarterback leaps fans adore and struggling franchises dream of.\nIf we were truly prisoners of the moment, we might call this one of the greatest quarterback seasons ever. You can find plenty of stats -- even ones like the above -- to back that up. But the more realistic conversation centers on the greatest sophomore seasons by a quarterback of all time. That's when the next superstar, like Maye, typically emerges and begins carving a path to football immortality.Before I list my top 10 sophomore quarterback seasons ever, check out the list of candidates. They involve some combination of great individual and team success. A few of these seasons won't make the cut, but they show just how many impressive seasons were in consideration.Candidates for greatest second-year QB seasonPlayerYearAccomplishmentsDrake Maye2025Made AFC Championship Game, led NFL in completion percentage and yards per attemptBrock Purdy2023Made Super Bowl and set NFL record for yards per attempt in a season (9.6)Joe Burrow2021 Made Super Bowl and led NFL in completion percentage and yards per attemptJustin Herbert2021 5,014 passing yards and 38 passing TDsLamar Jackson2019 Unanimous MVP (36 passing TDs and QB-record 1,206 rushing yards)Patrick Mahomes2018 MVP and third QB with 50-plus TD passes in a seasonDeshaun Watson2018 4,165 passing yards, 551 rushing yards, 26 passing TDs, five rushing TDsCarson Wentz2017MVP favorite until tearing ACL in Week 14Jared Goff2017 11-4 record, 28 passing TDs, NFL-best 12.9 yards per completionNick Foles2013 27 TDs, two INTs (NFL record for TD-to-INT ratio at the time)Russell Wilson2013 Won Super Bowl and led NFL in explosive pass rateBen Roethlisberger2005 Won Super Bowl and led NFL in yards per attempt (missed four games)Tom Brady2001 Pulled off second-largest upset win in Super Bowl historyDaunte Culpepper2000 11-5 record, 3,937 passing yards, NFL-best 33 passing TDsKurt Warner1999 Won MVP and Super Bowl MVPPeyton Manning1999 13-3 record, 4,135 passing yards, 26 passing TDsDan Marino1984 Set NFL records for passing TDs and passing yards (won MVP and made Super Bowl)Johnny Unitas 1957 Third in MVP voting (led NFL in passing yards and passing TDs)The question is where Maye falls here -- and how much higher he can go. How do we even compare passing numbers in 2025 to those of the early 2000s or even the 1980s, when it was a completely different game?One way to compare seasons across eras is to use Pro Football Reference's ANY/A+ stat. It's an efficiency rating (where 100 is average) similar to passer rating but era-adjusted, leveling the playing field between quarterbacks from the 1970s -- when compiling gaudy passing numbers was far more difficult -- and the 2020s, when the passing environment has never been more favorable.Maye posted the sixth-highest ANY/A+ (131) by any qualified quarterback in his second season in NFL history, trailing only 1999 Kurt Warner (134), 2018 Patrick Mahomes (136), 2013 Nick Foles (143), 2023 Brock Purdy (146) and 1984 Dan Marino (195).We know this season stacks up with the most efficient campaigns by a young quarterback ever. He's also on the doorstep of the Super Bowl. Let's dive in and see where I ranked him:10. Johnny Unitas (1957)I wasn't alive to see Johnny Unitas play, but I can tell you he led the NFL in passing yards, touchdown passes, yards per attempt and passer rating in 1957, ultimately finishing third in MVP voting behind runner-up Y.A. Tittle and Jim Brown, the only rookie to ever win the award. His Year 2 leap set the stage for the Colts' first championship in 1958 and Unitas' heroics in the \"Greatest Game Ever Played.\"9. Peyton Manning (1999)Sticking with the Colts here. Peyton Manning must have had a few people worried in 1998 when he threw an NFL rookie-record 28 interceptions and the Colts went 3-13. What a difference a year makes. Manning finished as the MVP runner-up in 1999, and the Colts became the first team ever to go from a 13-loss season to a 13-win season. His superstar supporting cast got into the act. Edgerrin James led the league in rushing as a rookie (1,553 yards), and Marvin Harrison led the NFL in receiving (1,663). Too bad Manning went one-and-done in the playoffs for the first of several times.8. Russell Wilson (2013)It would be easy to assume the Seahawks only won a Super Bowl in 2013 because of the \"Legion of Boom\" or Marshawn Lynch. After all, they hardly needed Wilson to beat the Broncos' record-breaking offense 43-8 in the Super Bowl. Don't be mistaken, though -- Wilson did his part. He ranked seventh in EPA per dropback (0.17) in 2013 and fourth in yards per attempt (8.2). He led the NFL in explosive pass rate (19.1%) among quarterbacks with 12-plus starts, and he ran for more than 500 yards.7. Joe Burrow (2021)Joe Burrow was OK as a rookie in 2020 after his record-setting national title year at LSU in 2019, but it ended with a devastating knee injury after 10 starts. Burrow came back healthy and thrived after the Bengals drafted his college teammate Ja'Marr Chase in the first round. He was an efficiency king, much like Maye, becoming the youngest quarterback ever (25) to lead the NFL in both completion rate (70.4%) and yards per attempt (8.9) before Maye broke that mark in 2025.His \"arrival\" came in Weeks 16 and 17, when he combined for nearly 1,000 passing yards and eight touchdown passes in wins over the Ravens and Chiefs. He followed up a 14-point comeback win and game-winning drive vs. Patrick Mahomes and company in Week 17 with an 18-point comeback vs. the Chiefs in the AFC title game. He was a play away from winning the Super Bowl that year, too, but Matthew Stafford and Cooper Kupp had other ideas. Stafford hit the triple crown winner with a game-winning touchdown in the final two minutes, while Aaron Donald and Von Miller sealed the deal on defense. Still, it was a historic year and the birth of Burrow's NFL superstardom, plenty good enough to make this list.6. Drake Maye (2025)Maye is following in Burrow's footsteps with an ultra-efficient second season while leading a team on a Cinderella run with the Super Bowl in his sights. Maye already ranks ahead of Burrow on this list because he's done it with a worse supporting cast. Burrow threw to Ja'Marr Chase and Tee Higgins. Maye is throwing to Stefon Diggs and Kayshon Boutte. This is the floor, and with a Super Bowl win, he could jump as high as second or third on the list.5. Patrick Mahomes (2018)You know this list is full of impressive breakouts when Patrick Mahomes ranks fifth. He started just one game as a rookie in 2017, backing up Alex Smith, before producing a record-setting year in 2018. He became the third quarterback ever to throw 50 touchdown passes in a season (2007 Tom Brady, 2013 Peyton Manning). He probably would have won a Super Bowl, too, if it weren't for that Tom Brady guy. A coin flip and an offside (Dee Ford) in the 2018 AFC title game changed the course of NFL history and are also reasons Mahomes isn't higher here.4. Lamar Jackson (2019)Lamar Jackson took over for Joe Flacco and started the final seven games of his rookie year in 2018. The electric audition proved good enough to win Jackson the job going forward, but he was still a bit of a question mark after an ugly playoff performance vs. the Chargers, when he went 3-of-9 passing for 25 yards in the first three quarters of that loss. He completely turned the page in 2019 by leading the league in touchdown passes (36) while rushing for a QB-record 1,206 yards in just 15 starts. He won unanimous MVP in one of the best seasons in NFL history. He would rank higher on this list, but he went one-and-done in the playoffs.3. Tom Brady (2001)We're really splitting hairs between the top three names on this list. Tom Brady, the 199th overall pick of the 2000 NFL Draft, completed one pass his entire rookie season but then rose to the occasion after Mo Lewis' hit on Drew Bledsoe, and the rest is history. Brady won 14 of 17 starts in 2001, had five game-winning drives, and led the Patriots to their first Super Bowl title and one of the biggest championship upsets ever vs. Kurt Warner and the Rams' \"Greatest Show on Turf\" offense. Brady remains the last quarterback to win a Super Bowl in the season of his playoff debut. I think we can all safely say we're jealous of Patriots fans for having two quarterbacks on this list.2. Dan Marino (1984)Dan Marino may not have won a Super Bowl in his second season, but his stats were so astronomical he tops Brady on this list. He produced the first 5,000-yard passing season in 1984. The NFL's next one wouldn't come for another 24 years (Drew Brees in 2008). He threw 48 touchdown passes in '84, a record that stood for two decades until Peyton Manning threw 49 in 2004. The best part, though, was that the previous record was 36 touchdown passes by George Blanda (1961) and Y.A. Tittle (1963).Marino shattered the best quarterback season of all time and put up numbers nobody else would sniff for decades. He became the youngest quarterback (23) to win MVP and also the youngest to start a Super Bowl, a record he still holds today. The Dolphins lost that Super Bowl to the 49ers, but it doesn't diminish Marino's 1984 season as an all-time great.1. Kurt Warner (1999)Kurt Warner's second season was so amazing a movie was made about it: \"American Underdog.\" He stocked grocery shelves after going undrafted in 1994, played for the Iowa Barnstormers of the Arena Football League in 1995 and the Amsterdam Admirals of NFL Europe in 1997, then made the 1998 Rams as a third-stringer.His big break came in 1999 when Trent Green's preseason injury opened the door for one of the best stories in NFL history. The \"Greatest Show on Turf\" was born, with Warner, Marshall Faulk, Torry Holt and Isaac Bruce putting up video game numbers. The 1999 Rams became the first team to win a Super Bowl after going worst-to-first in their division after a 4-12 season in 1998. Even the Super Bowl ending -- short by one yard -- felt straight out of a Hollywood script. Warner won NFL MVP and Super Bowl MVP that year, a feat that wouldn't be repeated until Patrick Mahomes did it 23 years later.Warner tops an incredible list of breakout seasons by young quarterbacks. Maye isn't far off the type of turnaround Warner and the Rams pulled off, either. The Patriots can join the Rams as the only team to win a Super Bowl coming off a season with four or fewer wins. What a story that would be, and it would be par for the course in one of the craziest seasons in NFL history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where Drake Maye ranks among greatest sophomore QB seasons in NFL history - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/5b5b3665-207e-43e5-97d7-3d88ad315b0f/thumbnail/1200x675/094d52c190ddefa50b6e740d0b639576/drake-maye.jpg"
      ],
      "datePublished": "2026-01-21T17:57:03.000Z",
      "dateModified": "2026-01-21T17:57:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]