[
  {
    "title": "Aaron Rodgers retirement: Steelers QB noncommittal on future after Texans loss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/aaron-rodgers-retirement-steelers-texans-wild-card-playoff-loss-future/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/840679f2-320c-4fcd-93b9-3b2bb0a93a66/thumbnail/1200x675/8e8ec1e9e00031a029ef1db7583776f8/rodgerstexans.png",
    "tag": "Sports",
    "date": "2026-01-13T05:49:20.000Z",
    "description": "\n        PITTSBURGH -- Aaron Rodgers will once again head into an offseason where he will have to make a decision about his future in the NFL.Rodgers'",
    "body": "\n        PITTSBURGH -- Aaron Rodgers will once again head into an offseason where he will have to make a decision about his future in the NFL.Rodgers' 21st season came to a crashing halt on Monday night after the Texans scored 23 points in the fourth quarter en route to a 30–6 win over the Steelers in the AFC wild card round. The 42-year-old watched the game's final drive from the sideline after throwing a pick-six on what could possibly be the final throw of his Hall of Fame career.\"I'm not going to make any emotional decisions at this point,\" Rodgers said when asked if this game will impact his decision. \"It was such a fun year. ... Been a great year overall in my life, and this has been a really good part of that, coming here and being a part of this team. It's disappointing to be sitting here with the season over.\"\nRodgers alluded to this likely being his final season shortly after he signed a one-year deal with the Steelers. There have been rumblings, however, that Rodgers might be open to playing another season for Pittsburgh given his and the team's success during the regular season, which included an AFC North title.\n\"Just get away and have the right conversations,\" he said when asked what his process will be in terms of making a decision.\nWhile he didn't open up about his future, Rodgers did express appreciation and gratitude for what could have been his lone season with the Steelers. After two turbulent seasons in New York, Rodgers had a largely successful year in Pittsburgh that culminated with his first trip to the postseason since 2021, his second-to-last season with the Packers.\"I was fortunate to play in an incredible football city for 18 years and never took it for granted and enjoyed that time there,\" he said. \"This has been a really beautiful backend to the first 18, to be able to be here for a year. This is a special place. It's got tradition, it's got excellence, it's got all-time greats. You just look around the stadium tonight, just to see the fans. There wasn't a big splattering of Texans fans, and there's a lot to be said for that.\n\"There are only a few really special places in the league that have the tradition and the town and the organization, and I'm thankful to have played for two of them.\"\nPrior to Rodgers' press conference, Steelers running back Jaylen Warren was asked if he wants Rodgers to come back next season. Warren didn't hesitate before giving his answer.\"Yeah, I do,\" he said. \"It was definitely an honor to play with a guy like that, a future Hall of Famer. I enjoyed it.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aaron Rodgers retirement: Steelers QB noncommittal on future after Texans loss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/840679f2-320c-4fcd-93b9-3b2bb0a93a66/thumbnail/1200x675/8e8ec1e9e00031a029ef1db7583776f8/rodgerstexans.png"
      ],
      "datePublished": "2026-01-13T05:49:20.000Z",
      "dateModified": "2026-01-13T05:49:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cavaliers vs. Jazz prediction, odds, time, spread: 2026 NBA picks for Monday, Jan. 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jazz-cavaliers-odds-prediction-line-time-2026-nba-picks-monday-january-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-12T21:30:40.000Z",
    "description": "\n        The Utah Jazz face the Cleveland Cavaliers in NBA action on Monday night. Utah is coming off a 150-95 loss to the Charlotte Hornets on Saturd",
    "body": "\n        The Utah Jazz face the Cleveland Cavaliers in NBA action on Monday night. Utah is coming off a 150-95 loss to the Charlotte Hornets on Saturday, while Cleveland downed the Minnesota Timberwolves 146-134 that same day. The Jazz (13-25), who are fifth in the Northwest Division, are 5-7 against Eastern Conference foes this season. The Cavaliers (22-18), who are second in the Central Division, are 8-5 against Western Conference opponents. Utah will be without Georges Niang (foot) and Walker Kessler (shoulder, out for season), while Ace Bailey (hip) is questionable. Cleveland won't have Dean Wade (knee) or Max Strus (foot).Tioff from Rocket Arena in Cleveland is set for 7 p.m. ET. Cleveland is a 12.5-point favorite in the latest Jazz vs. Cavaliers odds from DraftKings Sportsbook, while the over/under for total points scored is 249.5. Before making any Jazz vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    Now, the model has simulated Jazz vs. Cavaliers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Cavaliers vs. Jazz:\nJazz vs. Cavaliers                                                         spread:    Cleveland -12.5 at DraftKings    Jazz vs. Cavaliers                                                                       over/under:    249.5 pointsJazz vs. Cavaliers                                                                       money line:    Utah +430, Cleveland -585Jazz vs. Cavaliers                                                                       picks:    See picks at SportsLineJazz vs. Cavaliers                                                                       streaming:Fubo (Try for free) New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Jazz vs. Cavaliers picksSportsLine's model is going Under on the total (249.5 points). The total has gone Under in five of the last 10 head-to-head meetings. The Under has also hit in five of the last eight Jazz games, and in three of the last five Cavaliers games. Utah is 6-4 against the spread in its last 10 games, while Cleveland is 4-6 ATS in its last 10. The SportsLine model is projecting Utah's Lauri Markkanen to score 23.6 points on average and be one of four Jazz players to score 10.3 or more points. Cleveland's Donovan Mitchell, meanwhile, is projected to have 29.5 points as seven Cavaliers players score 13.1 points or more.It has also generated an against-the-spread pick that hits in nearly 70% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Cavaliers vs. Jazz, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Jazz vs. Cavaliers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. Jazz prediction, odds, time, spread: 2026 NBA picks for Monday, Jan. 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-12T21:30:40.000Z",
      "dateModified": "2026-01-12T21:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL divisional round schedule: Matchups, bracket, odds, TV channel and previews - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-divisional-round-schedule-results-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/f4d36a0b-edf0-4dde-abed-504511498adf/thumbnail/1200x675/258003bc70a5a1fff6ba47c7e701383a/graphic-nflbracket-divisionalhou.jpg",
    "tag": "Sports",
    "date": "2026-01-13T04:42:52.000Z",
    "description": "\n        We are one step closer to Super Bowl LX. The NFL playoffs kicked off with a bang during a frantic Wild Card Weekend that featured several pho",
    "body": "\n        We are one step closer to Super Bowl LX. The NFL playoffs kicked off with a bang during a frantic Wild Card Weekend that featured several photo finishes. No matter where you looked, playoff games were coming down to the wire across the opening slate. In all, there were four comeback wins in the final three minutes of the fourth quarter -- the most ever in a single postseason.Now, there are just eight teams left standing, hoping to punch their ticket to Santa Clara for Super Bowl LX. As we embark on the divisional round this weekend, the No. 1 seeds in both conferences, the Denver Broncos and Seattle Seahawks, emerge from their first-round bye weeks and enter the fray, adding even more firepower to the playoff bracket. As we gear up for more action, let's take our first look at the divisional round matchups, along with the odds and a quick preview of each contest. AFC Buffalo Bills at Denver BroncosSaturday, 4:30 p.m. ET on CBS (Stream on Paramount+)\nWe don't have to look far back to find the last time these teams met in the postseason, squaring off just last year in the wild card round. Buffalo throttled the Broncos at Highmark Stadium, 31-7. Denver scored on the opening drive, then was shut out the rest of the way.\nThis matchup, however, should be different. For starters, it will be played at Mile High after Denver secured the No. 1 seed. The Broncos also boast one of the NFL's top defenses, allowing just 18.3 points per game during the regular season. They'll need that elite level of play again to keep Josh Allen -- who scored three touchdowns last week -- in check.The Bills quarterback is coming off his first career road playoff win after beating the Jaguars in Jacksonville and is looking to add to his postseason résumé, entering this matchup as a road favorite.\n        \n            \n                NFL wild card overreactions: Josh Allen is the biggest X factor of playoffs; A.J. Brown done in Philly?\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nHouston Texans at New England PatriotsSunday, 3 p.m. ET on ESPN (Stream: Fubo -- try for free) \nThis will be the first meeting between these two teams since the 2016 divisional round, which New England won on its way to a Super Bowl title. They last met in Week 6 of last season, when Houston rolled to a 41-21 victory, but both teams look very different now.\nBoth quarterbacks are also looking to bounce back from uneven wild-card performances. Drake Maye threw two interceptions in a win over the Chargers, while C.J. Stroud is coming off a three-turnover outing against Pittsburgh. Houston still boasts one of the NFL's top defenses and showed it again Monday night against the Steelers. New England isn't usually grouped among the league's elite units, but it looked the part after sacking Justin Herbert six times on Sunday night, setting the stage for what could be a defensive showdown.NFCSan Francisco 49ers at Seattle SeahawksSaturday, 8 p.m. ET on Fox (Stream: Fubo -- try for free)\nWe have ourselves a rubber match between two NFC West rivals. The Seahawks and 49ers split the regular-season series, with San Francisco winning in Week 1 before Seattle returned the favor with a 13–3 victory in Week 18 to clinch the No. 1 seed and the division title. Oddly enough, both games were won by the road team, but the 49ers will have to overcome some significant injury issues to keep that trend alive here.\nSan Francisco has been hit hard by injuries all season and is coming off a playoff win over Philadelphia in which star tight end George Kittle suffered a season-ending Achilles tear. That leaves Brock Purdy without one of his primary weapons as he faces an elite Seattle defense. The Seahawks ranked No. 1 in scoring defense this season, allowing just 17.2 points per game, and also led the league on third down and in yards per rush allowed.That defensive dominance, along with Sam Darnold's strong play at quarterback, helped Seattle win 11 of its final 12 games to close the regular season. This is the fourth time the Seahawks have earned the No. 1 seed, and each of the previous three resulted in a trip to the Super Bowl.Los Angeles Rams (-3.5) at Chicago BearsSunday, 6:30 p.m. ET on NBC\nBoth teams pulled off late wins on Wild Card Weekend. Los Angeles avoided a road upset against the Carolina Panthers after Matthew Stafford led a seven-play, 71-yard, game-winning touchdown drive in the final two minutes of regulation.\nChicago, meanwhile, staged a miraculous second-half comeback against the Green Bay Packers, erasing an 18-point deficit. Caleb Williams and the offense erupted late, outscoring Green Bay 25–6 in the fourth quarter.The last time these teams met came during the 2024 regular season, when Chicago earned a 24–18 win. In that game, D'Andre Swift piled up 165 yards from scrimmage, while Stafford threw no touchdowns and committed two turnovers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL divisional round schedule: Matchups, bracket, odds, TV channel and previews - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/f4d36a0b-edf0-4dde-abed-504511498adf/thumbnail/1200x675/258003bc70a5a1fff6ba47c7e701383a/graphic-nflbracket-divisionalhou.jpg"
      ],
      "datePublished": "2026-01-13T04:42:52.000Z",
      "dateModified": "2026-01-13T04:42:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL wild card winners, losers: Mike Tomlin's Steelers at breaking point - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-wild-card-mike-tomlin-steelers-playoff-losing-streak-justin-herbert-struggles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/b295e5be-7dfc-4484-9f74-e4fc134174ca/thumbnail/1200x675/3d936742e5f4c8df8e34aafd82a5b9d2/mike-tomlin.jpg",
    "tag": "Sports",
    "date": "2026-01-13T05:01:49.000Z",
    "description": "\n        The first round of the NFL playoffs is in the books, and now just eight teams remain in contention to reach Super Bowl LX and play for the ri",
    "body": "\n        The first round of the NFL playoffs is in the books, and now just eight teams remain in contention to reach Super Bowl LX and play for the right to hoist the Lombardi Trophy. This opening round of the playoffs had a flair for the dramatic, as each game seemingly came down to the wire.In all, there were 12 fourth-quarter lead changes and four game-winning drives in the final three minutes, each of which is the most in a single postseason all time, let alone just a single round. After a hectic few days of playoff action, we'll get a reprieve until we start it all up again next weekend for the divisional round.As the dust settles on Wild Card Weekend, let's take in what we just watched unfold. Of course, there are actual winners and losers that we saw play out on the field, but let's dig a little deeper. Below, we're going to highlight specific players and coaches who came out of the weekend with their stocks either higher or lower.Winner: Bryce Young\nYes, Bryce Young's season came to a close on Saturday, but the Panthers quarterback played well, albeit in defeat. He had Carolina firmly in range of pulling off the upset over Los Angeles and traded blows with NFL MVP favorite Matthew Stafford during the fourth quarter. \nYoung was particularly sharp during the Panthers' fourth-quarter touchdown drive that gave them a 31-27 lead with a little over two minutes to play in regulation. After a blocked punt, Young zipped a 16-yard pass to Tetairoa McMillan to get the Panthers into the red zone and then dropped in a perfect touchdown pass to Jalen Coker.\nThere was a version of this game where Carolina looked like a JV team after limping into the playoffs at 8-9, and Young being the prime catalyst for the losing effort. That would have then triggered plenty of questions about his long-term future with the organization. After this performance, however, the Panthers should feel good about Young's trajectory heading into 2026.Loser: Matt LaFleurThe Green Bay Packers endured one of the more demoralizing playoff defeats in recent memory, blowing an 18-point lead to the Chicago Bears. Matt LaFleur's team had no answer for Chicago down the stretch and was outscored 26-6 in the fourth quarter.\nWhile the Packers are reportedly still expected to work out a deal to keep LaFleur as head coach as he enters a lame-duck season in 2026, his reputation has taken a serious dent. The head coach is now 3-6 in the playoffs and on a three-game losing streak, which coincides with being the No. 7 seed in each of the last three postseasons. Beyond just the playoffs, LaFleur is 37-30-1 over the past four seasons after starting 39-10 in his first three seasons, so he's come back down to earth a bit as well.Given this trend, it's fair to wonder if LaFleur hurt himself at the negotiating table as he looks to secure more years and dollars from the Packers.Winner: Colston Loveland\nThe Bears had some folks scratching their heads when they took Loveland with the No. 10 overall pick in the 2025 NFL Draft, ahead of fellow tight end Tyler Warren. While both rookies enjoyed strong seasons, Loveland has flashed his All-Pro ceiling down the stretch, including during Chicago's come-from-behind win over the Packers. \nThe Michigan product finished with eight catches for 137 yards. Of those, 122 came in the second half, and he had one of the most prolific games a tight end has had in playoff history.\nLoveland also became the first player with at least 125 receiving yards and a two-point conversion in a playoff game since Terrell Owens in 2022. He is an emerging superstar at the position.Loser: A.J. Brown\nThe Eagles' season has come to an end, but before it did, there was more drama surrounding A.J. Brown. During the team's loss to San Francisco, Brown was seen having an altercation with head coach Nick Sirianni on the sideline after a dropped pass in the first half, and the two sides needed to be separated.\nThen, as Philly tried to claw back out in front during what would prove to be its final possession, Brown had a brutal drop on third-and-5.\nThe Eagles converted on the ensuing fourth down, but that drop was a glaring example of how Brown did not rise to the occasion. He finished the game with just three catches for 25 yards, despite seeing seven targets, which were tied for the second-most on the team. Brown also declined to speak to reporters after the playoff loss.Given all the turmoil surrounding Brown and the Eagles this season, it's fair to wonder if he's played his last down for the organization.\n\n        \n            \n                A.J. Brown landing spots: Patriots and Broncos headline list of potential new teams if Eagles trade star WR\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nWinner: Robert SalehRobert Saleh has only improved his stock this hiring cycle with the job he's done leading the 49ers defense. Despite an array of injuries plaguing the organization, particularly on that side of the ball, Saleh had the unit humming against the Eagles, holding the offense to just 19 points, 4.3 yards per play and a 31.2% conversion rate on third down. Saleh was already a hot head coaching candidate, but given how well the Niners have persevered, it's likely only endeared him further to prospective organizations looking for a new leader.Loser: Justin Herbert\nJustin Herbert is now 0-3 in his playoff career, and the Chargers quarterback isn't just winless -- the losses he's been part of have been jarring. Previously, he blew a 27-point lead to the Jaguars and threw four interceptions in a loss to the Texans. Now, we can add a dud in New England to the ledger.\nHerbert led Los Angeles to just three points during its wild-card loss to the Patriots. He missed some wide-open pass catchers, and while the lack of depth at offensive tackle has been a story all season, the protection up front held up admirably. Herbert still took six sacks because he often held the ball too long.Justin Herbert's playoff careerStatsW-L0-3Team PPG15.0Total TD/TO2/5Passer rating64.7He's not escaping the \"can't win the big game\" allegations anytime soon. Winner: K'Lavon Chaisson\nChaisson has made himself quite a bit of money. The former first-round pick has enjoyed a late-career breakout with the Patriots after inking a one-year, $3 million deal with the team this past offseason. Chaisson's 7.5 sacks during the regular season were a career high, and he added two more during New England's wild-card win over the Chargers. Chaisson finished with two sacks, three quarterback hits, and a forced fumble.\nGiven how important pass rushers are in today's NFL, teams will certainly be calling up Chaisson once he hits the open market this spring. Loser: Mike TomlinThe Pittsburgh Steelers found themselves in familiar territory on Monday night. They were just good enough to sneak into the playoffs but outclassed once they got there, bludgeoned in a 30–6 loss to the Houston Texans.The defeat marked the Steelers' fourth straight home playoff loss, the first time that has ever happened in franchise history, and extended Mike Tomlin's postseason losing streak to seven games -- tying Marvin Lewis for the longest by a head coach in NFL history. Pittsburgh has now gone one-and-done in the playoffs three straight seasons and five times over the past six years. It hasn't won a postseason game since the 2017 season, when Ben Roethlisberger was still under center.That prolonged lack of playoff success has pushed the Steelers to a crossroads, and it wouldn't be surprising if this loss proves to be the one that finally breaks the camel's back for the NFL's longest-tenured head coach.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL wild card winners, losers: Mike Tomlin's Steelers at breaking point - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/b295e5be-7dfc-4484-9f74-e4fc134174ca/thumbnail/1200x675/3d936742e5f4c8df8e34aafd82a5b9d2/mike-tomlin.jpg"
      ],
      "datePublished": "2026-01-13T05:01:49.000Z",
      "dateModified": "2026-01-13T05:01:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texans vs. Steelers prediction, odds, spread: 2026 Wild Card Weekend picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/texans-steelers-prediction-odds-time-nfl-2026-wild-card-monday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/008158d2-b3e7-4eeb-9b6d-d36d1dce1f46/thumbnail/1200x675/d4aa733bd99ce1776b2cdb4eaf1271fe/imagn-cj-stroud-dalton-schultz-texans.jpg",
    "tag": "Sports",
    "date": "2026-01-12T23:45:34.000Z",
    "description": "\nThe fifth-seeded Houston Texans face the fourth-seeded Pittsburgh Steelers in the final matchup of 2026 Wild Card Weekend on 'Monday Night Football.'",
    "body": "\nThe fifth-seeded Houston Texans face the fourth-seeded Pittsburgh Steelers in the final matchup of 2026 Wild Card Weekend on 'Monday Night Football.' Houston is coming off a 38-30 Week 18 win over the Indianapolis Colts, while Pittsburgh held off Baltimore 26-24. The Texans (12-5), who finished second in the AFC South, are 5-3 on the road this season. The Steelers (10-7), the champions of the AFC North, are 6-3 on their home field. Both teams enter at virtually full strength, and the Steelers got some recent reinforcements as DK Metcalf is returning from a suspension and TJ Watt (lung) returned in Week 18. Kickoff from Acrisure Stadium in Pittsburgh is set for 8:15 p.m. ET. Houston is a 3-point favorite in the latest Steelers vs. Texans odds, while the over/under for total points scored is 38.5 via DraftKings Sportsbook. Before making any Texans vs. Steelers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.    Now, the model has set its sights on Texans vs. Steelers. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Steelers vs. Texans:\nTexans vs. Steelers                                                                                             spreadHouston -3 at DraftKings SportsbookTexans vs. Steelers                                         over/under38.5 pointsTexans vs. Steelers                                                                                                                                                                                                         money line Houston -155, Pittsburgh +130Texans vs. Steelers                                                                                                                                                                                                 picksSee picks at SportsLineTexans vs. Steelers                                                                                                                                                                                                   streaming Fubo (Try for free)  Why the Texans can coverThird-year quarterback C.J. Stroud powers the Houston offense. In 14 games this season, he has completed 64.5% of his passes for 3,041 yards and 19 touchdowns with eight interceptions and a 92.9 rating. He has also rushed 48 times for 209 yards (4.4 average) and one touchdowns. In a 40-20 win over Arizona on Dec. 14, he completed 22 of 29 passes for 260 yards and three touchdowns.One of his top targets is fifth-year wide receiver Nico Collins. In 15 games, he has 71 receptions for 1,117 yards and six touchdowns. He has 18 explosive plays of 20 or more yards, including a long of 57, with 324 yards after the catch and 48 first-down conversions. In a 20-10 win over Kansas City on Dec. 7, he caught four passes for 121 yards, including a long of 53. See which team to back at SportsLine. Why the Steelers can coverVeteran quarterback and future Hall of Famer Aaron Rodgers leads the Pittsburgh attack. In 16 games this season, he has completed 65.7% of his passes for 3,322 yards and 24 touchdowns with seven interceptions and a 94.8 rating. He has also rushed for one score. In the Week 18 win over Baltimore, Rodgers completed 31 of 47 passes for 294 yards and one touchdown. He also rushed once for 20 yards. Metcalf's return should give Rodgers more options. In 15 games this season, Metcalf has 59 receptions for 850 yards (14.4 average) and six touchdowns. He has had 15 explosive plays of 20 yards or more, including a long of 80, with 414 yards after the catch and 37 first-down conversions. In a 27-22 win at Baltimore on Dec. 7, he had seven receptions for 148 yards, including a long of 52. See which team to back at SportsLine.How to make Texans vs. Steelers picksSportsLine's model is going Over on the total, projecting 42 combined points. It also says one side of the spread hits in well over 50% of simulations. You can only get the pick at SportsLine. So who wins Steelers vs. Texans, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Texans vs. Steelers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans vs. Steelers prediction, odds, spread: 2026 Wild Card Weekend picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/008158d2-b3e7-4eeb-9b6d-d36d1dce1f46/thumbnail/1200x675/d4aa733bd99ce1776b2cdb4eaf1271fe/imagn-cj-stroud-dalton-schultz-texans.jpg"
      ],
      "datePublished": "2026-01-12T23:45:34.000Z",
      "dateModified": "2026-01-12T23:45:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' prediction, odds, spread: Steelers vs. Texans picks from expert on 37-20 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-steelers-texans-picks-nfl-wild-card-playoff-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/4d620c2e-f9a9-4fb1-9f7f-fca6b7657e06/thumbnail/1200x675/43540fcda746542b59f7711956d018e4/aaron-rodgers-pittsburgh-steelers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-12T23:27:41.000Z",
    "description": "\n        Wild Card Weekend of the 2026 NFL playoffs will conclude with a 'Monday Night Football' contest between the Houston Texans and Pittsburgh Ste",
    "body": "\n        Wild Card Weekend of the 2026 NFL playoffs will conclude with a 'Monday Night Football' contest between the Houston Texans and Pittsburgh Steelers. Houston (12-5) is riding a league-high nine-game win streak and is the No. 5 seed in the AFC after finishing second in its division. Pittsburgh (10-7) has won four of its last five, including a winner-take-all game on Sunday night to claim the AFC North and the conference's No. 4 seed. Both teams are 9-8 against the spread this season.Kickoff is at 8:15 p.m. ET from Acrisure Stadium in Pittsburgh. Houston is a 3-point favorite in the latest Texans vs. Steelers odds from DraftKings Sportsbook, while the over/under for total points scored is 38.5. Before locking in any Steelers vs. Texans picks, make sure to check out the 'Monday Night Football' predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins to bet on props like Aaron Rodgers over 1.5 passing touchdowns:\nWhite, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the Pittsburgh Steelers. He is an outstanding 37-20-1 (+1455) on his last 58 against-the-spread picks in Pittsburgh games. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Texans vs. Steelers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Steelers vs. Texans:\nTexans vs. Steelers                               spreadTexans -3 (-105) at DraftKings SportsbookTexans vs. Steelers                                     over/under38.5 pointsTexans vs. Steelers                                    money line Texans -155, Steelers +130Texans vs. Steelers                                 picksSee picks at SportsLineTexans vs. Steelers                                     streaming Fubo (Try for free)  Why the Texans can winWinners of nine straight, the Texans are facing a Steelers team with its own streak. However, it's a losing one for Pittsburgh, which has lost six straight postseason games. Houston owns the No. 1 total defense and No. 2 scoring defense, while it also ranks second-best in the league in turnover differential (+17). The Texans truly have no weak links on defense, as they are the only squad that ranks among the top six in both stopping the run and defending the pass. Meanwhile, the offense is playing its best entering the 2026 NFL playoffs as C.J. Stroud and company are averaging 30.3 points over their last four, compared to 21.8 points over their first 13 games. See which team to back at SportsLine. \nBet on Stroud going over 234.5 passing yards at DraftKings:\nWhy the Steelers can winThe Steelers are facing a Texans franchise which is 0-6 in road playoff games all-time, making Houston the only NFL team to never win a postseason road game. Pittsburgh also has a streak which makes Houston's nine-game win streak pale in comparison, as the Steelers have won an astounding 23 straight home games on Monday nights. This Steelers team ranks in the top five in both turnover differential and in sack differential, making it one of two NFL teams that can make that claim. Pittsburgh will welcome back DK Metcalf from suspension, and he has four touchdowns over his last two playoff games. On the other hand, offense is clearly Houston's weakness as only three teams average fewer yards per carry, and just two teams have a worst red-zone conversion percentage. See which team to back at SportsLine.Bet Jaylen Warren to go over 69.5 rushing + receiving yards at DraftKings:\nHow to make Steelers vs. Texans  picksWhite has analyzed Texans vs. Steelers   from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.\nWho wins Steelers vs. Texans, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Texans vs. Steelers spread you need to jump on, all from the expert that is 37-20-1 on his last 58 Pittsburgh spread picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' prediction, odds, spread: Steelers vs. Texans picks from expert on 37-20 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/4d620c2e-f9a9-4fb1-9f7f-fca6b7657e06/thumbnail/1200x675/43540fcda746542b59f7711956d018e4/aaron-rodgers-pittsburgh-steelers-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-12T23:27:41.000Z",
      "dateModified": "2026-01-12T23:27:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Sony Open odds, field: PGA Tour picks, predictions, best bets from proven golf model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-sony-open-picks-predictions-odds-field-projected-leaderboard-golf-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/7b69797f-7733-4a29-a9f9-7e9294e602d4/thumbnail/1200x675/cdf894158fe0c0ac71966ad396fe9908/russell-henley-sony-open-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-13T00:51:48.000Z",
    "description": "\n        The 2026 PGA Tour schedule gets underway at the 2026 Sony Open in Hawaii on Thursday, Jan. 15. The season opener at Waialae Country Club in H",
    "body": "\n        The 2026 PGA Tour schedule gets underway at the 2026 Sony Open in Hawaii on Thursday, Jan. 15. The season opener at Waialae Country Club in Honolulu comes a week later than normal after The Sentry was cancelled this year due to course concerns. That means there will be just one event on the Hawaii Swing this year, and some top players decided not to make the trip. Big names like Collin Morikawa, Hideki Matsuyama, J.J. Spaun and Jordan Spieth, however, are among the golfers who are teeing it up this week.The latest 2026 Sony Open odds from DraftKings Sportsbook list Russell Henley as the +1100 favorite. Matsuyama and Ben Griffin are at +1700, followed by Spaun at +1800. Before locking in any 2026 Sony Open picks, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its best bets since the restart, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 Sony Open field is locked in, SportsLine simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. 2026 Sony Open predictions One major surprise the model is calling for at the 2026 Sony Open: Russell Henley, the betting favorite, stumbles and barely finishes inside the top 5. He's a golfer to avoid this week. The 2013 Sony Open champion hasn't been able to follow up on that success at this event with regularity. Since that time, he's missed the cut twice and has three other finishes outside the top 30. Last year, he finished T10. He's played just once since last year's playoffs and finished 19th at the Procore Championship, so the model doesn't love his value as a favorite this year. See who else to fade here. \nAnother surprise: J.J. Spaun, a +2000 longshot, makes a strong run at the title. He's a target for anyone looking for a huge payday. The 2025 U.S. Open winner finished T3 in this event last year. He also brings some momentum into the new year after playing three times in the fall and finishing no worse than T11 in those tournaments. The model has identified him as a top-three contender this week, making him a golfer to back in your Sony Open best bets. See who else to pick here. New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins:How to make 2026 Sony Open picksThe model also has identified three golfers with odds of +2500 or higher as top-10 contenders. Anyone who backs these longshots could hit it big. You can only see the model's picks here. \nWho will win the 2026 Sony Open, and which longshots will stun the golfing world? Check out the 2026 Sony Open odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 Sony Open odds, favorites Get full 2026 Sony Open picks, best bets and predictions here. (odds subject to change)Russell Henley +1100Ben Griffin +1700Hideki Matsuyama +1700J.J. Spaun +1800Collin Morikawa +2000Robert MacIntyre +2000Keegan Bradley +2200Si Woo Kim +2200Maverick McNealy +2500Harry Hall +2500Nick Taylor +3000Chris Kirk +3500Kurt Kitayama +3500Jordan Spieth +3500Keith Mitchell +4000Corey Conners +4000Adam Scott +4000Rico Hoey +4500Chris Gotterup +4500Aaron Rai +4500Kevin Yu +5000Nicolas Echavarria +5000John Keefer +5000Denny McCarthy +5000Brian Harman +5000Kristoffer Reitan +5500Taylor Pendrith +5500Jake Knapp +5500Eric Cole +5500Mac Meissner +6000Matt McCarty +6500Daniel Berger +6500Michael Brennan +6500Gary Woodland +7000Neal Shipley +7000Emiliano Grillo +7500Billy Horschel +7500Sam Stevens +7500Pierceson Coody +7500Michael Kim +7500Webb Simpson +8000Ryan Gerard +8000Alex Smalley +8000Vince Whaley +9000Sahith Theegala +9000Jordan Smith +9000Haotong Li +9000Tom Kim +10000Tony Finau +10000Seamus Power +10000Matti Schmid +10000John Parry +10000Chandler Blanchet +10000Lee Hodges +10000Patrick Rodgers +11000Bud Cauley +11000Max McGreevy +11000Luke Clanton +11000Doug Ghim +12000William Mouw +12000Jacob Bridgeman +12000Mark Hubbard +13000Austin Eckroat +13000Ricky Castillo +14000Adrien Dumont De Chassart +14000Zac Blair +16000Daniel Brown +16000Steven Fisk +16000David Ford +17000Beau Hossler +17000Adam Svensson +17000Keita Nakajima +18000Takumi Kanaya +18000S.H. Kim +18000Christo Lamprecht +18000Chad Ramey +19000Kevin Roy +20000Dylan Wu +20000Erik Van Rooyen +20000Ryo Hisatsune +20000Nick Dunlap +20000Adrien Saddier +20000Cam Davis +25000Alejandro Tosti +25000Davis Riley +25000Austin Smotherman +25000Patton Kizzire +25000Matthieu Pavon +25000Brian Campbell +25000Zecheng Dou +25000Zach Johnson +25000Chandler Phillips +25000Adam Schenk +25000Tom Hoge +30000Kensei Hirata +30000Gordon Sargent +30000Seung Taek Lee +35000Emilio Gonzalez +35000Sudarshan Yellamaraju +40000Kota Kaneko +40000Hank Lebioda +40000Brice Garnett +40000Davis Chatfield +45000Ren Yonezawa +50000Pontus Nyholm +50000John Vanderlaan +50000Jeffrey Kang +50000Yuta Sugiura +60000Joe Highsmith +60000Zach Bauchou +70000Kazuki Higa +70000Marcelo Rozo +70000Danny Walker +70000Vijay Singh +80000Peter Malnati +80000Rafael Campos +100000A.J. Ewart +100000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Sony Open odds, field: PGA Tour picks, predictions, best bets from proven golf model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/7b69797f-7733-4a29-a9f9-7e9294e602d4/thumbnail/1200x675/cdf894158fe0c0ac71966ad396fe9908/russell-henley-sony-open-imagn-images.jpg"
      ],
      "datePublished": "2026-01-13T00:51:48.000Z",
      "dateModified": "2026-01-13T00:51:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, results and streaming for every round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/dfefaa6d-020f-444c-9ef5-83709703b598/thumbnail/1200x675/9c2bbfbe5666ea375719c03344d515de/graphic-nflbracket-divisionalhou.jpg",
    "tag": "Sports",
    "date": "2026-01-13T04:28:00.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                      ",
    "body": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 12, 2026\n                            \n                    at\n    11:27 pm ET\n                        \n                •\n            \n            4 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        The first round of the NFL postseason is in the books, and the wild card round certainly lived up to its name by delivering one of the wildest slates of games in playoff history.Four games were decided by four points or fewer, the most in any playoff round ever. There was no drama in the final game of the wild-card round, however, with the Texans routing the Steelers, 30–6, on Monday night to earn the first road playoff win in franchise history. Houston became the eighth and final team to punch its ticket to the divisional round.In the AFC, the Texans will be joined by New England, Buffalo and Denver. The top-seeded Broncos, coming off a bye, will be in action for the first time this postseason when they host the Bills on Saturday. Houston, meanwhile, will head to New England on Sunday with a spot in the AFC Championship Game on the line.In the NFC, Seattle and San Francisco will meet for the third time this season after splitting their first two matchups. The Seahawks are well-rested after a wild-card bye, while the 49ers will be playing on just five days' rest. In the other divisional matchup, the Bears will host the Rams, marking Chicago's first home divisional-round game in 15 years.With that in mind, here's the full playoff schedule, including the dates and kickoff times for the divisional round.Wild Card WeekendSaturday, Jan. 10(5) Rams 34-31 over (4) PanthersRams vs. Panthers recap: The Panthers almost pulled off the upset, but they couldn't stop Matthew Stafford with the game on the line. With the Rams trailing 31-27, Stafford engineered a 71-yard game-winning scoring drive that ended when he hit Colby Parkinson with a 19-yard touchdown with just 38 seconds left to play. Stafford threw for 304 yards and three touchdowns in the win. (2) Bears 31-27 over (7) PackersPackers vs. Bears recap: The Bears pulled off the third-largest fourth-quarter comeback in NFL history. Going into the final quarter, the Bears were trailing by 15 points, but they were able to erase that deficit during a miracle quarter where they outscored the Packers, 25-6. Caleb Williams threw for more yardage (184) in the fourth quarter than he did in the first three quarters combined (177). Williams capped things off with a 25-yard score to DJ Moore with just 1:43 left to win the game. Sunday, Jan. 11(6) Bills 27-24 over (3) Jaguars\nBills vs. Jaguars recap: For the first time in his career, Josh Allen led a game-winning drive in the fourth quarter of a playoff game. The Bills' franchise quarterback scored the game-winning touchdown on a 1-yard run with just one minute left to play. Allen also threw a 15-yard TD pass in the fourth quarter to help propel Buffalo to the win. Allen totaled 306 yards and three touchdowns in the win. For the Bills, it was their first road playoff win in 33 years. (6) 49ers 23-19 over (3) Eagles49ers vs. Eagles recap: The 49ers pulled off a shocker by going on the road and knocking off the Eagles. After losing George Kittle, the 49ers had some unlikely heroes, including Demarcus Robinson, who caught six passes for 111 yards and a touchdown. Christian McCaffrey also came up big with two touchdowns, including the game-winning score, which came on a 4-yard pass from Brock Purdy with just 2:54 left to play. (2) Patriots 16-3 over (7) ChargersChargers vs. Patriots recap: The Patriots defense took over and carried New England to the win. Justin Herbert was sacked six times as the Patriots kept the Chargers out of the end zone and held them to fewer than 210 total yards.The offense didn't light up the scoreboard, but Drake Maye was impressive in his first career postseason start, throwing for 268 yards and rushing for 66 more. The Patriots are headed to the divisional round for the first time since 2018.Monday, Jan. 12(5) Texans 30-6 over (4) SteelersTexans vs. Steelers recap. The Texans had the best defense in the NFL during the regular season, and that unit carried them to a win against Pittsburgh. The Texans defense sacked Aaron Rodgers four times, held the Steelers to just 175 yards and scored two touchdowns, which both came in the fourth quarter. The first one came on a 33-yard fumble return by Sheldon Rankins, and then Calen Bullock followed that up with a 50-yard pick-six with just 2:39 left in the game. It was a defensive masterpiece by a Texans team that picked up its first road win in franchise history. Divisional RoundSaturday, Jan. 17(6) Bills at (1) Broncos, 4:30 p.m. ET (CBS)(6) 49ers at (1) Seahawks, 8 p.m. ET (Fox)Sunday, Jan. 18(5) Texans at (2) Patriots, 3 p.m. ET (ESPN/ABC)(5) Rams at (2) Bears, 6:30 p.m. ET (NBC)Championship SundaySunday, Jan. 25\nAFC Championship, 3 p.m. ET (CBS)NFC Championship, 6:30 p.m. ET (Fox)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, results and streaming for every round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/dfefaa6d-020f-444c-9ef5-83709703b598/thumbnail/1200x675/9c2bbfbe5666ea375719c03344d515de/graphic-nflbracket-divisionalhou.jpg"
      ],
      "datePublished": "2026-01-13T04:28:00.000Z",
      "dateModified": "2026-01-13T04:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WNBA free agency: How the ongoing CBA stalemate is impacting the offseason schedule - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/wnba-free-agency-how-are-continued-cba-negotiations-affecting-offseason-schedule/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/e3311d5f-24f1-4664-ba39-d8c9ac089ed0/thumbnail/1200x675/8324e290ad3df7200e33e6d4e82d0b15/wnba-union-brittney-sykes-pay-the-players.png",
    "tag": "Sports",
    "date": "2026-01-13T00:47:54.000Z",
    "description": "\n        The WNBA and the Women's National Basketball Players Association have entered a period of \"status quo\" after the 2020 collective bargaining a",
    "body": "\n        The WNBA and the Women's National Basketball Players Association have entered a period of \"status quo\" after the 2020 collective bargaining agreement expired on Friday without a new deal or another extension. Though a work stoppage is now a possibility, both sides have signaled a desire to continue negotiations. \"The current Collective Bargaining Agreement has expired, and negotiations with the Women's National Basketball Players Association remain ongoing,\" the league said in a statement on Friday. \"As the league experiences a pivotal time of unprecedented popularity and growth, we recognize the importance of building upon that momentum. Our priority is a deal that significantly increases player salaries, enhances the overall player experience, and supports the long-term growth of the league for current and future generations of players and fans.\"   \n        \n            \n                Breanna Stewart says WNBA, WNBPA won't reach a CBA deal by Friday deadline, will enter 'status quo' period\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nWhile there is still plenty of time for the two sides to get a new deal done without delaying the 2026 season, the offseason has already been interrupted. The Toronto Tempo and Portland Fire, the two expansion teams set to join the league in 2026, have not been able to hold their expansion draft yet, and will be unable to do so until a new CBA is in place. Additionally, what will be the busiest and most important free agency period in league history should be getting underway right now. But with no CBA in place, there is plenty of uncertainty on all sides. As CBA negotiations continue, here's a look at what's happening with free agency. \nWhen would free agency typically take place?Free agency typically begins in mid-January, and most of the big moves are usually wrapped up by mid-February. Here's a look at last year's key dates:Jan. 11-20: Teams are allowed to make qualifying offers and \"Core player\" designationsJan. 21-31: Teams are allowed to negotiate with free agentsFeb. 1: Players are allowed to sign contracts and offer sheetsTeams that are caught skirting those rules will be punished under the league's tampering policies. Most recently, the Seattle Storm were fined in 2022 for announcing they had re-signed Sue Bird prior to the official start of free agency. Why is this year's free agency period so important?When the 2020 CBA was ratified, it included an opt-out clause for both sides after the 2024 season. Players and their agents have known that an opt-out was a real possibility for a number of years, and have moved strategically in free agency to ensure they were prepared if it happened. \nNow, every single veteran (a player not on a rookie-scale contract) aside from Kalani Brown and Lexie Brown is a free agent this winter. All of these players will be able to sign new deals under the new CBA, which will bring with it significant pay raises. We won't know the 2026 numbers until a new CBA is in place, but the league's latest proposal shows exactly why so many players wanted to be free agents this winter. The minimum salary would more than triple, the average salary would more than quadruple and the max would more than quintuple, a source close to the situation told CBS Sports. Here's a look at the differences between 2025 and 2026 under the league's prosposal:\nSeasonSalary capMinimum salaryAverage salaryMax salary2025$1.5 million$66,079$120,000$249,244 2026$5 million~$230,000~$530,000$1.3 millionNever have so many stars hit unrestricted free agency at the same time. For reference, eight of the 10 players who received All-WNBA honors last season are free agents, including the entire First Team. If you look at the All-Star rosters, 19 of the 25 players in Indianapolis last summer are free agents. Add in dozens of role players, the arrival of two new teams, and the fact that so many players are currently in Miami with Unrivaled, and rosters could look significantly different from last season. \"It's really not recruiting,\" Kahleah Copper said, via Front Office Sports, when asked if players have been talking with each other about free agency. \"Yesterday after practice we just sat in the locker room and talked general free agency, where we thought people would go, what teams we thought would break up, what people are chasing, what are you looking for. … We all kind of play GM with each other.\" What happens without a CBA in place?If a work stoppage occurs, all league business would cease, including free agency. Again, though, neither side appears eager to take that step -- at least right now. It is worth noting, however, that the WNBPA voted in December to authorize a strike \"if necessary.\" During a status quo period, the working conditions of the previous CBA remain in place. Thus, as long as status quo continues, free agency can technically proceed. However, on Monday, sources confirm to CBS Sport that the WNBA and WNBPA officially agreed to a moratorium on league business. Prior to that announcement, there was a bit of confusion about the state of free agency.According to ESPN, the league informed teams last week that they should prepare to continue business as usual and send out qualifying offers and core designations under the conditions of the expired CBA. Of course, it makes no sense for players to sign any offers when they're on the verge of a major pay raise. WNBPA vice president Breanna Stewart told reporters in Miami during Unrivaled last week that there is an \"understanding\" among the players not to sign anything right now. \nThere's no point in going through the motions of free agency if no player is going to sign anything, which is why both sides agreed to the moratorium.What is a moratorium?A moratorium pauses all league business, including free agency, and save everyone the hassle of dealing with pointless paperwork and negotiations during the height of the most important CBA negotiations in league history. Per ESPN, the league put a moratorium proposal in writing on Friday. Free agency should resume whenever a new CBA is ratified, with a timeline to be determined. When could a new CBA be in place?While there's still time to get a new deal done to ensure the 2026 season starts in mid-May as usual, there is not unlimited time. It's still unclear exactly when a new CBA will be in place, but Stewart told Sarah Spain on her podcast last week that both sides want to have things wrapped up by the end of the month. \n\"Hopefully, everything can be done by February 1,\" Stewart said. \"Even if we agree, we still have to wait for the contracts to be written. So there's a lot to be thinking about. It's not just like, oh, you're done now, it'll work. If we can get by February 1, we'll all be in a good place.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WNBA free agency: How the ongoing CBA stalemate is impacting the offseason schedule - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/e3311d5f-24f1-4664-ba39-d8c9ac089ed0/thumbnail/1200x675/8324e290ad3df7200e33e6d4e82d0b15/wnba-union-brittney-sykes-pay-the-players.png"
      ],
      "datePublished": "2026-01-13T00:47:54.000Z",
      "dateModified": "2026-01-13T00:47:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Texans-Steelers and more on Monday, Jan. 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/todays-top-games-to-watch-best-bets-odds-texans-at-steelers-celtics-at-pacers-college-basketball-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/1f193e48-3219-4d86-b9e4-6f671492981b/thumbnail/1200x675/b0fe2643ef082c6a916e76a7db024ee3/imagn-cj-stroud-texans.jpg",
    "tag": "Sports",
    "date": "2026-01-12T20:30:47.000Z",
    "description": "\nThe NFL's Wild Card Weekend has been historically bonkers. So far, there have been 12 fourth-quarter lead changes, the most in a single postseason al",
    "body": "\nThe NFL's Wild Card Weekend has been historically bonkers. So far, there have been 12 fourth-quarter lead changes, the most in a single postseason all-time. There have been four game-winning touchdowns in the final three minutes, also the most in a single postseason all-time. And there have been four comeback wins in the final three minutes of the fourth quarter, which — you guessed it — is the most in a single postseason all-time.And there are still eight more playoff games to play.The wild Wild Card Weekend concludes on Monday night when the NFC North champion Pittsburgh Steelers and the streaking Houston Texans collide at Acrisure Stadium in Pittsburgh.  The Steelers (10-7) slipped into the playoffs when Ravens kicker Tyler Loop missed a potential game-winning 44-yard field goal last week, handing the division title to the Black and Gold. Meanwhile, the Texans (12-5) have ridden the best defense in the NFL to a league-best nine straight wins. Monday's winner will advance to the Divisional Round and a matchup against the New England Patriots (15-3). Houston is a 3-point favorite over Pittsburgh on Monday.While Texans vs. Steelers is the marquee attraction on Monday, there are other options on a sporting landscape that includes six NBA games, a full college basketball schedule and a nine-game NHL slate. Below is a snapshot of what to watch and bet for Monday, Jan. 12. All times Eastern.NFL best bets, where to watchTexans at SteelersTime: 8:15 p.m. | Location: Pittsburgh | TV: ABC/ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Steelers +133 | Expert: Steelers +3 (Larry Hartstein)\nThe Texans' pass-rushing duo of Danielle Hunter (15 sacks) and Will Anderson Jr. (12) are the first teammates to each have 10-plus sacks in back-to-back seasons since Jerry Hughes and Mario Williams did so for the 2013-14 Bills. Behind Hunter and Anderson, Houston led the NFL in total defense (277.2) and ranked second in scoring defense (17.4) during the regular season. However, Texans quarterback C.J. Stroud has struggled on the road this season, completing just 60.9% of his passes, with nine touchdowns, seven interceptions and an 81.3 passer rating (versus 69.1%, 10 touchdowns, one interception and a 107.4 rating at home). \"I'm expecting a game that goes down to the wire and love grabbing a full field goal with the home dog,\" Hartstein says. The SportsLine Projection Model, which simulates every NFL game 10,000 times, says there's a 49.0% chance the Steelers win and assigns a B grade to the Pittsburgh money line (+133).NBA best bets, where to watchCeltics at PacersTime: 7:30 p.m. | Location: Indianapolis | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 225.5 | Expert: Payton Pritchard Over 22.5 total points -109 (Mike Barner)\nThe Celtics' Jaylen Brown made headlines after Saturday's 100-95 loss to the Spurs when he went on an expletive-laden rant against the officials, who awarded Boston just four free throw attempts in the game. Brown is making news today for another reason: He's listed as doubtful against the Pacers because of lower back spasms. He has missed just two games this season. Barner notes that, in the two games that Brown missed, Pritchard scored 20 points on 21 shot attempts and 33 points on 24 shot attempts. \"The potential for Pritchard to attempt around 20 shots against a Pacers team that ranks 20th in the league in defensive rating makes this Over appealing,\" Barner says. Meanwhile, the SportsLine Projection Model says there's a 65.9% the teams combine for 226 points or more and gives a B grade to Over 225.5.College basketball best bets, where to watchNavy at AmericanTime: 7 p.m. | Location: Washington D.C. | TV: CBSSN | Stream: Fubo (Try for free)SportsLine picks -- Model: American +2.5 | Expert: Navy -115 (Bruce Marshall)\nThe Navy Midshipmen can earn just their third 5-0 start in Patriot League play when they take on the high-scoring American Eagles at Bender Arena. The Midshipmen (12-5, 4-0 in Patriot) can also secure their best 18-game start to a season since 2020-21. Navy leads the league in scoring defense (63.5 points per game), while the Eagles (9-8, 2-2) lead the Patriot in scoring offense (77.4). Marshall notes that the Midshipmen will be motivated to avenge their loss to American in last season's Patriot League title game, which kept them out of the NCAA Tournament. Meanwhile, the SportsLine Projection Model says there's a 60.0% chance the Eagles cover and assigns a B grade to American +2.5.NHL best bets, where to watchKraken at RangersTime: 7 p.m. | Location: New York City | TV: NHL Net | Stream: Fubo (Try for free)SportsLine picks -- Model: Under 6\nThe struggling New York Rangers will try to stop their three-game losing streak when fhey square off against the Seattle Kraken at Madison Square Garden. The Rangers (20-20-6) have just 46 points; just two teams in the Eastern Conference have fewer. New York has scored just 120 goals this season, the second-fewest in the East. Meanwhile, the Kraken (20-15-8), with 48 points, currently own the top Wild Card spot in the Western Conference. They have been playing well recently, having lost only once in regulation in their last 11 games (8-1-2). The SportsLine Projection Model says there's a 64.4% chance the teams combine for five goals or fewer and gives a strong A grade to Under 6 total goals.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Texans-Steelers and more on Monday, Jan. 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/1f193e48-3219-4d86-b9e4-6f671492981b/thumbnail/1200x675/b0fe2643ef082c6a916e76a7db024ee3/imagn-cj-stroud-texans.jpg"
      ],
      "datePublished": "2026-01-12T20:30:47.000Z",
      "dateModified": "2026-01-12T20:30:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ryan Garcia vs. Mario Barrios title fight set for February in Las Vegas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/ryan-garcia-next-fight-mario-barrios-wbc-welterweight-title-date/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/d6e24102-35cf-4e17-82ee-30819fbf1c3e/thumbnail/1200x675/d1fa865ff653d58d1ea87daf52038795/ryan-garcia-weighins.jpg",
    "tag": "Sports",
    "date": "2026-01-12T21:42:04.000Z",
    "description": "\n        A long-rumored welterweight title bout between WBC titleholder Mario Barrios and superstar Ryan Garcia became official on Monday for Feb. 21 ",
    "body": "\n        A long-rumored welterweight title bout between WBC titleholder Mario Barrios and superstar Ryan Garcia became official on Monday for Feb. 21 in Las Vegas. The fight card, titled \"The Ring: High Stakes,\" will take place inside T-Mobile Arena and be streamed live exclusively on DAZN, chairman of the general entertainment authority for Saudi Arabia, Turki Alalshikh, announced in a press release.  Garcia (27-1, 19 KOs), the flamboyant and often controversial social media star, is a former WBC interim lightweight titleholder. A native of Victorville, California, the 27-year-old Garcia enters the title shot despite being fresh off a lifeless decision loss to WBA welterweight titleholder Rolando Romero last May in Times Square in New York. In his previous bout, in April 2024, Garcia missed weight ahead of a decision win over then junior welterweight titleholder Devin Haney before failing a drug test for the banned substance ostarine that turned the bout into a no contest. Garcia, who was sued by Haney, served a one-year drug suspension.\"I will be world champion on Feb. 21,\" Garcia said. \nBarrios (29-2-2, 18 KOs), who first captured the interim WBC welterweight title in his biggest win to date in 2023 against Yordenis Ugas, dropped the former champion twice in a decision win. But after being elevated to full champion when Terence Crawford vacated his undisputed crown, Barrios fought to back-to-back draws against journeyman Abel Ramos in 2024 and 46-year-old Manny Pacquiao last July. A native of San Antonio, the 30-year-old Barrios recently parted ways for a second time with trainer Bob Santos in favor of Hall of Famer Joe Goossen, who previously trained Garcia for four fights, including his 2013 knockout loss to Gervonta \"Tank\" Davis.  \"Becoming WBC welterweight world champion was more than a moment -- it was a promise to my family, my city, and everyone who believed in the grind when no one was watching,\" Barrios said. \"San Antonio built me, and every sacrifice I've made comes with me into that ring. This is my division, my time, and I'm ready to show the world why the WBC title stays right here.\"\nBarrios is a former junior WBA welterweight titleholder who lost his title in a 2021 stoppage loss to Davis.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ryan Garcia vs. Mario Barrios title fight set for February in Las Vegas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/d6e24102-35cf-4e17-82ee-30819fbf1c3e/thumbnail/1200x675/d1fa865ff653d58d1ea87daf52038795/ryan-garcia-weighins.jpg"
      ],
      "datePublished": "2026-01-12T21:42:04.000Z",
      "dateModified": "2026-01-12T21:42:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Brooks Koepka's PGA Tour defection can help end golf's fractured state - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/pga-tour-returning-members-end-liv-golf-jon-rahm-bryson-dechambeau/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/45a2ea23-c8bd-4736-a654-3da993d00190/thumbnail/1200x675/dcaa12cb0a090c42ff6710eafa101e60/jon-rahm-bryson-dechambeau-liv-golf-g.jpg",
    "tag": "Sports",
    "date": "2026-01-12T22:29:37.000Z",
    "description": "\n        In a strange twist of fate, those whose headline-making departures from the PGA Tour legitimized LIV Golf four years ago find themselves in a",
    "body": "\n        In a strange twist of fate, those whose headline-making departures from the PGA Tour legitimized LIV Golf four years ago find themselves in a unique position to end it for good. When the PGA Tour announced on Monday that it had created a new pathway for Brooks Koepka to return to the PGA Tour, it accomplished more than welcoming back one of the game's brightest stars.Koepka left LIV Golf a few days before Christmas, citing that he wanted to spend more time with his family in 2026. The split was mutual, according to a league statement that primarily boasted Talor Gooch's impending captaincy of Smash GC, the LIV Golf team Koepka previously led.The PGA Tour responded to Koepka's decision by releasing a statement within minutes of his departure, calling the player a \"highly accomplished professional\" while stating the tour \"continues to offer the best professional golfers the most competitive, challenging and lucrative environment in which to pursue greatness.\"Internal conversations were held. PGA Tour CEO Brian Rolapp met with Koepka on multiple occasions. Meetings took place. A new pathway was concocted out of thin air. Majority approval was achieved, and on Monday, membership was made aware of the reinstatement decision. All of this transpired in a three-week window during the holidays leading into the start of the 2026 season.\nIn doing so, the PGA Tour not only opened an expedited pathway for Koepka to return without serving a year-long suspension, it created an opportunity to deal a massive blow to its rival, one from which it may not be able to recover.Koepka's journey back to the PGA Tour may well serve as a returned knife in the back of LIV Golf -- considering the league previously poached the big-swinging Floridian -- but it's not a death blow. That opportunity belongs to three other players who are now suddenly eligible to come back through the PGA Tour's Returning Membership Program: Bryson DeChambeau, Jon Rahm and Cameron Smith.Whether any or all choose to take the PGA Tour up on its offer is anyone's best guess, of course.\nRahm's lucrative contract started towards the end of 2023, and it could be a bear to extricate himself from it, even if he wished, which some have suggested he does.DeChambeau is up for negotiations and could become the richest golfer to ever walk on this planet if he plays his cards right. Phil Mickelson once described working with LIV Golf as a once-in-a-lifetime leverage opportunity. That word, \"leverage?\" DeChambeau has in spades.Smith seems intent on remaining where he plays alongside his fellow Australians with a laidback schedule, but a PGA Tour return cannot be ruled out, either, particularly if some other top-level players depart ahead of him.\nWithout those three, what would be left of LIV Golf?A bunch of (mostly) has-beens traveling the world, participating in a rowdy tournament in Australia that is considered the event of year yet comes across as more of a concert than golf event? Players like Joaquin Niemann, Patrick Reed and Tyrell Hatton stranded in what can only be described as no man's land? Oh, the teams. How could we forget about The Crushers? They may be EBITDA positive, but would they be without DeChambeau?These were not questions being asked three weeks ago as LIV Golf and its backers, Saudi Arabia's Public Investment Fund, long ago decided they would spend whatever money was necessary to keep the league afloat. But with DeChambeau, Rahm and Smith now having a deadline of Feb. 2 -- two days before LIV Golf kicks off its season -- to decide on their future, sport-defining change could come swiftly.After four years of an intersport battle that has split golf -- involving defections, pointless meetings, grand proclamations, flash mobs, weird messages to set up even weirder announcements and a lot of grandstanding with little to show for it -- it could all come down to these next three weeks.\nThe ball is officially in the court of DeChambeau, Rahm and Smith, and it's the PGA Tour who handed it to them.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Brooks Koepka's PGA Tour defection can help end golf's fractured state - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/45a2ea23-c8bd-4736-a654-3da993d00190/thumbnail/1200x675/dcaa12cb0a090c42ff6710eafa101e60/jon-rahm-bryson-dechambeau-liv-golf-g.jpg"
      ],
      "datePublished": "2026-01-12T22:29:37.000Z",
      "dateModified": "2026-01-12T22:29:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft order: How Steelers, Eagles playoff losses shake up first round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-draft-order-updated-top-picks-team-needs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/7e4458af-b819-4652-ad61-59ca0aea3485/thumbnail/1200x675/2125b764f6e4bc36199cf8ea2c3e5e57/aaron-rodgers.jpg",
    "tag": "Sports",
    "date": "2026-01-13T04:01:36.000Z",
    "description": "\n        The wild card round of the NFL playoffs is complete, meaning three-quarters of the first-round draft order is locked in. It was the first of ",
    "body": "\n        The wild card round of the NFL playoffs is complete, meaning three-quarters of the first-round draft order is locked in. It was the first of two anticipated draft-related developments this week. Wednesday is the deadline for underclassmen not participating in the College Football Playoffs to declare for the 2026 NFL Draft. One of the biggest remaining questions is whether or not Oregon quarterback Dante Moore will declare.  The pieces are starting to come together and the 2026 NFL Draft is only a little more than three months away. Collegiate All-Star games will also begin late later this month. Invitations are going out to NFL Scouting Combine participants, but an official list will not be revealed until mid-February.     As a reminder, there are four teams -- Atlanta, Green Bay, Indianapolis and Jacksonville -- without a first-round pick in 2026 as a result of draft-day trades and the Micah Parsons and Sauce Gardner deals. \nHere is the current 2026 NFL Draft order (via Tankathon):1. Las Vegas Raiders (3-14)Las Vegas over-extended last offseason by drafting a running back in the top-10 and trading for a 35-year-old quarterback despite having one of the league's worst rosters. As a result, they fired head coach Pete Carroll after one season and are now picking even earlier in the draft. 2. New York Jets (3-14)The Jets finished with one of the worst records in the league, but at least they have a plan and put themselves in a position to change the course of their franchise. Over the next two years, New York has five first-round picks. 3. Arizona Cardinals (3-14)Arizona made the decision to part with head coach Jonathan Gannon. It would not be a surprise if they moved on from Kyler Murray as well. The problem is that there are not a wealth of options to replace Murray.\n4. Tennessee Titans (3-14)The positive momentum Tennessee had built over the past month came to a frustrating end in the season finale. Still, Cam Ward's strong finish to the 2025 campaign should give Titans fans hope.5. New York Giants (4-13)There are reasons to be optimistic about Jaxson Dart's future with the franchise. He brought life to an offense that could have easily wallowed in self-pity following the Malik Nabers and Andrew Thomas injuries. If they get the head coach hire right, then maybe the a bounce back will happen sooner than most would expect.   6. Cleveland Browns (5-12)The Browns made the decision to part with head coach Kevin Stefanski after six seasons. He did lead the franchise to its first playoff win post-expansion, but may not be any closer to identifying the quarterback of the future. \n7. Washington Commanders (5-12)Next season is an easy sell for Washington. If Jayden Daniels returns healthy, then they will be competitive once again, but there are a lot of needs on that roster. An attempt to microwave those weaknesses last offseason did not work out. 8. New Orleans Saints (6-11)The Saints' season ended just as fans were clamoring for more of Tyler Shough. He looks like the clear favorite to open next season as the starting quarterback, bringing a level of optimism that simply didn't exist earlier in the year.9. Kansas City Chiefs (6-11)Kansas City will enter next season in unfamiliar territory: the hungry underdog. Assuming Patrick Mahomes' full health, there is no reason to believe the Chiefs will not be in the mix again next season. They do have a deteriorating roster that desperately needs a youthful infusion. \n10. Cincinnati Bengals (6-11)Joe Burrow made a notable attempt to get the Bengals into the playoffs after succumbing to an injury early in the season, but ultimately fell short. The offense will be in a spot to compete next season, but can the defense improve enough this offseason to get them enough stops?\n        \n            \n                Renner's 2026 NFL mock draft 6.0: Steelers beef up the offensive line with Aaron Rodgers' future in doubt\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \n11. Miami Dolphins (7-10)Fans can say what they want about the Mike McDaniel era in Miami, but few had such a recognizable aesthetic as the Dolphins' former coach. It is a fresh start for the organization with a new general manager, new head coach and presumably a new quarterback.12. Dallas Cowboys (7-9-1)Dallas is once again searching for answers this offseason. Dak Prescott was healthy and the team still failed to reach the playoffs with a new head coach. \n13. Los Angeles Rams via Atlanta Falcons (8-9)Atlanta fired Raheem Morris as head coach for a second time. They sent their first round pick to Los Angeles as part of the trade up for James Pearce Jr. 14. Baltimore Ravens (8-9)For the first time since 2007, the Ravens will have a new head coach after firing John Harbaugh. It sounds as though the franchise chose Lamar Jackson -- who turned 29-years-old one day after Harbaugh's firing -- over the veteran coach. 15. Tampa Bay Buccaneers (8-9)Other organizations have been quick to make a head coaching change, but the Buccaneers are going down the path of firing coordinators rather than a change at the top. \n16. New York Jets via Indianapolis Colts (8-9)Cornerback Sauce Gardner struggled to stay healthy and the Colts' pick being sent to New York rose precipitously by the week. 17. Detroit Lions (9-8)The coaching drain that took place after last season's run was likely understated in the moment given the presence Dan Campbell has over that organization, but that, along with a few veteran offensive line departures, led to a much more tumultuous season.18. Minnesota Vikings (9-8)J.J. McCarthy's season was volatile, which was once the expectation for a young quarterback. Recent rookie performances from Jayden Daniels and C.J. Stroud set unrealistic expectations for the majority. Caleb Williams is proof that situation matters. \n19. Carolina Panthers (8-9)The team with the worst record in the NFL Playoffs, but also a home game, was the first punted from the postseason. Although not a desirable conclusion, the Panthers have to be pleased with how the season played out. 20. Dallas Cowboys via Green Bay Packers (9-7-1)The team with the second worst record in the NFL Playoffs was also dispatched after building a 21-3 lead over the division rival Bears. It is going to be an interesting offseason for the Packers. 21. Pittsburgh Steelers (10-7)The Steelers couldn't do anything against an elite Texans defense as the team suffered its seventh straight playoff loss.\n22. Los Angeles Chargers (11-6)The Chargers are headed home for the season after falling to the Patriots in the wild card round.23. Philadelphia Eagles (11-6)A frustrating season, for fans and receivers alike, came to an end Sunday against the 49ers. The Eagles will be doing some soul searching this offseason. 24. Cleveland Browns via Jacksonville Jaguars (13-4)The Jaguars have every reason to celebrate their accomplishments this season. Yes, they lost in the wild card round as the home team, but a year ago, they were making preparations for the No. 5 overall pick. The future is bright for a team who played most of this season without No. 2 overall selection Travis Hunter.\n25. Chicago Bears (11-6)Chicago came back from an 18-point deficit to beat the rival Packers for the second time this season. Ben Johnson advances to the divisional round in his first season as head coach. 26. Buffalo Bills (12-5)Buffalo was the road team everyone in the AFC wanted to avoid, because Josh Allen has been battle tested in the playoffs. The Bills demonstrated why many felt that way Sunday.27. San Francisco 49ers (12-5)San Francisco overcame an injury to tight end George Kittle and enacted revenge over the Eagles for the NFC Championship game two years ago. 28. Houston Texans (12-5)Houston was one of the hottest teams in the NFL entering the postseason, and its defense continued to dominate in a win over the Steelers in the wild card round.29. Los Angeles Rams (12-5)The Rams took care of business on the road against the Panthers in the wild card round. 30. New England Patriots (14-3)The Patriots and Chargers have the \"Sunday Night Football\" game in the wild card round.31. Denver Broncos (14-3)The Broncos earned the No. 1 seed in the AFC West and a first-round bye with a victory over the Trey Lance-led Chargers in Week 18.32. Seattle Seahawks (14-3)Seattle clinched the NFC West crown and the top seed last week.The 2026 NFL Draft will take place April 23–25 in Pittsburgh. More draft coverage can be found at CBSSports.com, including weekly mock drafts and regular updates on eligible prospects.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft order: How Steelers, Eagles playoff losses shake up first round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/7e4458af-b819-4652-ad61-59ca0aea3485/thumbnail/1200x675/2125b764f6e4bc36199cf8ea2c3e5e57/aaron-rodgers.jpg"
      ],
      "datePublished": "2026-01-13T04:01:36.000Z",
      "dateModified": "2026-01-13T04:01:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gabe Davis injury: Bills receiver has torn ACL, adding uncertainty to thin position group - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/gabe-davis-injury-bills-receiver-broncos-nfl-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/962b88ef-bea9-4c9e-95e8-c52b61860060/thumbnail/1200x675/a7e1471f67c4b4af10412fd7eeb06473/gabe-davis-bills.jpg",
    "tag": "Sports",
    "date": "2026-01-12T22:44:51.000Z",
    "description": "\n        Buffalo Bills wide receiver Gabe Davis tore his ACL in the Bills' 27-24 wild card round win over the Jacksonville Jaguars on Sunday, coach Se",
    "body": "\n        Buffalo Bills wide receiver Gabe Davis tore his ACL in the Bills' 27-24 wild card round win over the Jacksonville Jaguars on Sunday, coach Sean McDermott said Monday. Davis' season is over.Davis, 26, returned to Buffalo this season after spending last season with the Jaguars. He didn't make his season debut until Week 11 but quickly took a prominent role in the receiver rotation. He started five of the Bills' final eight games and finished the regular season with 12 catches for 129 yards.Davis caught two of three targets for 14 yards against Jacksonville on Sunday before taking a nasty hit to his knee early in the fourth quarter. He was helped to the sideline and then eventually carted off the field. He had played roughly half of Buffalo's snaps to that point.\n        \n            \n                2026 NFL playoff schedule and bracket: Dates, times, TV for every round from divisional to Super Bowl\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nNicknamed \"Big Game Gabe\" for his previous playoff performances -- including a four-touchdown game against the Kansas City Chiefs four years ago -- Davis was one of several Bills who got banged up ahead of a divisional round matchup against the Denver Broncos, and his injury puts an already struggling receiver unit in more trouble.\nBills receiver situation vs. BroncosBuffalo has been rolling with a by committee receiver approach all season, though the members of that committee often rotate.Khalil Shakir has been the one constant. The slot man played on 71% of Buffalo's offensive snaps against Jacksonville, the highest of any receiver. He finished with 12 catches for 82 yards; no other player had more than three catches.Tyrell Shavers (54% snap share) and Brandin Cooks (48%) were next in line. Cooks had three catches for 58 yards, including a crucial 36-yarder on the game-winning drive. Cooks, a midseason addition, has been up and down in his short time in Buffalo, seemingly alternating big plays and drops. Shavers had one catch for 14 yards, and he also suffered a knee injury the Bills are still evaluating, McDermott said.\nThe only other receiver with a catch was Keon Coleman, who brought in his lone target for a 36-yard gain. Coleman, the 2024 second-round pick who was a healthy scratch at times this season, played 43% of Buffalo's offensive snaps. He was only active Sunday because Josh Palmer (ankle) was unable to play; Palmer was ultimately placed on injured reserve.With Davis and Palmer out and Shavers dealing with an injury, Coleman's role could increase. He's a big body (6-foot-4, 215 pounds) who has flashed the ability to win 50-50 balls but struggled with consistency throughout his brief career.The Bills also opened the practice window for Curtis Samuel, who has not played since mid-November due to neck and elbow injuries. It remains to be determined whether he will be able to play. \nCurrently, Buffalo has just four healthy wide receivers on its active roster: Shakir, Cooks, Coleman and Shavers. Mecole Hardman and Stephen Gosnell are on the practice squad. Hardman has appeared in just two games this season while battling injuries, and Gosnell has never appeared in an NFL game.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gabe Davis injury: Bills receiver has torn ACL, adding uncertainty to thin position group - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/962b88ef-bea9-4c9e-95e8-c52b61860060/thumbnail/1200x675/a7e1471f67c4b4af10412fd7eeb06473/gabe-davis-bills.jpg"
      ],
      "datePublished": "2026-01-12T22:44:51.000Z",
      "dateModified": "2026-01-12T22:44:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A.J. Brown landing spots: Five teams that make sense for Eagles receiver - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/a-j-brown-landing-spots-eagles-wr-broncos-patriots/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/daa35ebe-9783-431f-bdfb-7ae15059825e/thumbnail/1200x675/9ef391e75da7c669b5f3e779b410e6b4/brown.jpg",
    "tag": "Sports",
    "date": "2026-01-12T21:54:58.000Z",
    "description": "\n        The Philadelphia Eagles' 2025 season ended on Sunday, as they fell to the San Francisco 49ers in the wild card round, 23-19. Philly carried a",
    "body": "\n        The Philadelphia Eagles' 2025 season ended on Sunday, as they fell to the San Francisco 49ers in the wild card round, 23-19. Philly carried a six-point lead into the fourth quarter, but two Christian McCaffrey touchdowns in the final 15 minutes gave San Francisco the win. Jalen Hurts and Co. had a chance to lead a game-winning drive, but turned the ball over on downs at the 49ers' 21-yard line with 40 seconds remaining.A major storyline in this matchup was Eagles star wide receiver A.J. Brown. He caught just three of seven targets for 25 yards -- all of which came in the first quarter. Brown also registered a couple of notable drops. One was followed by a heated exchange with coach Nick Sirianni late in the first half, and another came on a third down during what the Eagles hoped would be a game-winning drive. Brown declined to speak with reporters after the loss. Sunday was more than just a star player having a bad game on a big stage, as Brown famously criticized the Eagles offense multiple times this year. When it came time for him to be a difference-maker, he dropped the ball. Sirianni defended his receiver after the game, saying that they have a \"special relationship,\" and have gone through \"every emotion you can possibly have together.\" Still, it's fair to wonder if Brown has played his final season with the Eagles.DeVonta Smith was Philly's leading receiver this season with 1,008 yards and four touchdowns on 77 catches. It was the first time he recorded more yards than Brown during the dynamic duo's four seasons together. In 15 regular-season games played this year, Brown caught 78 passes for 1,003 yards and seven touchdowns. He has crossed 1,000 receiving yards in all four of his seasons with the Eagles since coming over from the Tennessee Titans in 2022 via trade, but this year's 1,003 receiving yards marked his lowest total as an Eagle.\nCould Brown be traded again? Let's examine five potential landing spots for Brown, beginning in the AFC East.\n        \n            \n                After a surprisingly quick exit from the playoffs, the Eagles find themselves with more questions than answers\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    A.J. Brown began his NFL career with Mike Vrabel in Tennessee, and the two had a close relationship. In fact, when the Titans made the decision to trade Brown during the 2022 NFL Draft, Vrabel had to get up out of his seat in the war room and walk around while shaking his head in disbelief. He was right. It ended up being a terrible decision for Tennessee. As for Brown's potential fit in New England, it's clear that the Patriots' Super Bowl window is wide open with Drake Maye at quarterback and Vrabel's aggressive defense. New England did have a couple of surprising names step up this season to carry the load offensively with Stefon Diggs, such as Kayshon Boutte, Mack Hollins and DeMario Douglas. Rookie Kyle Williams is also an intriguing talent who could play a role down the line, but gifting Maye a legitimate No. 1 wide receiver with the physical talents Brown possesses would take the Patriots to another level.\n                            \n    \n                                                \n                    \n    If the Patriots don't make a move for Brown, perhaps their rival in the Buffalo Bills can. Don't ever question Josh Allen's wide receivers in front of general manager Brandon Beane, but there's no doubt that this group can be upgraded. Former No. 33 overall pick Keon Coleman caught just 38 passes for 404 yards and four touchdowns in his second NFL season and was made a healthy scratch multiple times, then free agency signee Josh Palmer caught just 22 passes for 303 yards and zero touchdowns in 12 games. Imagine pairing Allen and a wide receiver like Brown together. \n\n                            \n    \n                                                \n                    \n    The Denver Broncos have a 1,000-yard receiver under contract through 2029 in Courtland Sutton, but imagine giving Bo Nix another 1,000-yard receiver like Brown. Troy Franklin stepped up this season with 709 yards and six receiving touchdowns, but he and Sutton were the only players to cross 465 yards receiving for Denver this season. The Broncos offense finished the regular season ranked in the top 10, but this unit was inconsistent all year. Brown would certainly help with that. \n                            \n    \n                                                \n                    \n    With John Harbaugh out, could the Baltimore Ravens move differently this offseason? The franchise is looking for ways to \"invigorate\" star quarterback Lamar Jackson and find postseason success. Adding Brown can do both. Zay Flowers is a legitimate weapon, as he had a career year with 86 catches for 1,211 yards and five touchdowns, but DeAndre Hopkins and Isaiah Likely are free agents looking for new deals. Brown also has a relationship with star running back Derrick Henry from their Tennessee days. They were a part of an epic AFC Championship run in 2019, where the Titans upset the No. 1-seeded Ravens in Baltimore in the divisional round. Perhaps Henry could play a role in recruiting Brown to Baltimore.\n                            \n    \n                                                \n                    \n    The Los Angeles Chargers are coming off another deflating postseason loss, and Jim Harbaugh should be looking to upgrade Justin Herbert's weaponry (as well as the offensive line). Ladd McConkey was the Chargers' leading receiver with 789 yards and six touchdowns, and Quentin Johnston finally had his breakout season with 735 yards and a team-high eight touchdowns. Keenan Allen, who recorded 777 yards receiving and four touchdowns this season and turns 34 in April, is now a free agent. Could the Chargers get aggressive and trade for a star like Brown? Keep in mind that Los Angeles is scheduled to have the most cap space in the NFL this season. Right now that number is $103,578,588, according to Over The Cap.\nWhy an A.J. Brown trade remains unlikelyIt's fun to speculate, but a Brown trade likely won't happen. In April 2024, Brown signed a three-year, $96 million extension that runs through the 2029 season. He is currently the No. 6 highest-paid wide receiver in terms of AAV, as his deal averages $32 million per year. Trading Brown does not make much financial sense for the Eagles, since they are on the hook for multiple more years. As Spotrac points out, a pre-June 1 trade means the Eagles would take on the fourth-largest single-season dead cap hit in NFL history, PLUS another $20 million loss in savings.A.J. Brown contract detailsvia SpotracPre-June 1 tradePost June 1 trade2026 dead cap$43,515,106$16,353,4972026 savings$-20,121,609$7,040,0002027 dead capN/A$27,161,609\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A.J. Brown landing spots: Five teams that make sense for Eagles receiver - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/daa35ebe-9783-431f-bdfb-7ae15059825e/thumbnail/1200x675/9ef391e75da7c669b5f3e779b410e6b4/brown.jpg"
      ],
      "datePublished": "2026-01-12T21:54:58.000Z",
      "dateModified": "2026-01-12T21:54:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]