[
  {
    "title": "Texans QB C.J. Stroud evaluated for concussion, Davis Mills steps in against Broncos - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cj-stroud-injury-updates-concussion-texans-qb-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/afee54bb-3466-4f81-9cb5-4068ef18b906/thumbnail/1200x675/9191697caa0dea16a116eddbde2f549d/stroud.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:04:52.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Houston Texans quarterback C.J. Stroud exited the ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Houston Texans quarterback C.J. Stroud exited the Week 9 matchup against the Denver Broncos in the second quarter after taking a hard hit following a 6-yard scramble. The team later ruled him out with a concussion, and Davis Mills replaced him under center.On the play in which he was injured, Stroud attempted to get down as defenders neared, but took a hit from Broncos safety Kris Abrams-Draine to his midsection. Stroud's head then violently bounced off the turf, and he remained on his back while trainers attended to him. Houston's third-year quarterback eventually walked off the field under his own power, and gave a thumbs up to the crowd. \nStroud completed 6 of 10 passes for 79 yards and rushed twice for 12 yards before exiting the game. He is coming off one of his best performances of the year, as Stroud completed 30 of 39 passes for 318 yards, two touchdowns and one interception in the 26-15 victory last Sunday over the San Francisco 49ers.\nAs for Mills, he is a former third-round pick of the Texans back in 2021. He has played in 39 games for Houston with 26 starts, and thrown 35 touchdowns compared to 25 interceptions. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans QB C.J. Stroud evaluated for concussion, Davis Mills steps in against Broncos - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/afee54bb-3466-4f81-9cb5-4068ef18b906/thumbnail/1200x675/9191697caa0dea16a116eddbde2f549d/stroud.jpg"
      ],
      "datePublished": "2025-11-02T20:04:52.000Z",
      "dateModified": "2025-11-02T20:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-betting-apps-nfl-sportsbooks-promos-sunday-night-football-bet-commanders-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/a386b0f2-b8ce-4f1a-a52e-d138c770e47a/thumbnail/1200x675/c1590c40270ae4eb43b5737be7a68c8e/seattle-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:27:06.000Z",
    "description": "\n        To cap off another busy NFL Sunday, the Washington Commanders will host the Seattle Seahawks on Sunday Night Football in Week 9. Washington i",
    "body": "\n        To cap off another busy NFL Sunday, the Washington Commanders will host the Seattle Seahawks on Sunday Night Football in Week 9. Washington is off to a disappointing 3-5 start after making the NFC Championship Game last season, but will have starting quarterback Jayden Daniels back from a hamstring injury after he missed last week's loss to the Chiefs. Meanwhile, Seattle is 5-2 and has had an extra week to prepare coming off a bye week, and will look to counter the Commanders' third-ranked rushing attack with the NFL's best run defense. The latest Week 9 NFL odds list the Seahawks as 3-point favorites on the road, and the over/under is 48.5 points.There are dozens of betting options if you're wondering how to bet on the NFL, or more specifically, Commanders vs. Seahawks. Here's a closer look at available sportsbook promos on some of the top NFL betting sites, as well as the best betting apps that are available for Seahawks vs. Commanders on Sunday Night Football, with instructions on how to claim each offer and where to bet NFL.Where to bet on Commanders vs. Seahawks on Sunday Night FootballBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets and 3 months of NBA League Pass free if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash Just click hereThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users either $200 in bonus bets with the placement of a $5+ bet, or up to a $1,000 first bet safety net. Users receive the $200 bonus whether the bet wins or loses.At DraftKings and FanDuel, you need to win your first bet to receive the bonus, but the reward is even greater. FanDuel offers new users $300 in bonus bets if their first bet of at least $5 wins. DraftKings also offers $300 in bonus bets with a winning wager of at least $5, but with the latest DraftKings promo code with the 2025-26 NBA season beginning, new users also receive three months of NBA League Pass free, on top of the $300 in bonus bets.The latest Fanatics Sportsbook promo code provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code is different than the aforementioned offers, providing profit boosts instead of bonus bets. At Caesars, new users can get 20 100% sportsbook profit boosts with a $1 bet. Bettors can use any of these promotions for Commanders vs. Seahawks for Sunday Night Football on Sunday, November 2.Seahawks vs. Commanders betting preview, picksSeahawks -3 vs. Commanders \"No hints of 2024 yet for the Commanders, yet to flash some of the magic and spark that we saw constantly a season ago. The status of Jayden Daniels (who missed Monday vs. the Chiefs with hamstring issues) is likely to be a go for Sunday night, but he'll be minus key target Terry McLaurin, back on the shelf,\" SportsLine handicapper Bruce Marshall said. \"Commanders have lost back-to-back games by 20+ points. Meanwhile, Seattle is well-rested off a bye, and has continued to excel on the road, where it has won all three of its starts this season, as well as five of six overall as Sam Darnold continues to prove a very worthwhile QB signing in the offseason, and at least a slight upgrade from Geno Smith.\"Under 48.5 pointsWashington's offensive numbers are undoubtedly skewed by the fact that Daniels has only finished four games this season, and having last year's NFL Offensive Rookie of the Year back should help. However, the Commanders only averaged 22.4 points in the five games that Daniels did start, and he'll also be without top receiver Terry McLaurin (quad). Washington has been incredibly dependent on its running game all season, and Seattle has the NFL's best run defense, as the Seahawks only allow 75.7 rushing yards per game and 3.3 yards per carry. With Cooper Kupp (heel) not expected to play on Sunday, Seattle will also be down a playmaker, and that is part of the reason why the model predicts that the Under hits in 53% of simulations.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/a386b0f2-b8ce-4f1a-a52e-d138c770e47a/thumbnail/1200x675/c1590c40270ae4eb43b5737be7a68c8e/seattle-seahawks.jpg"
      ],
      "datePublished": "2025-11-02T18:27:06.000Z",
      "dateModified": "2025-11-02T18:27:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model locks in Chiefs vs. Bills picks, score prediction, SGP for NFL Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-bills-watch-nfl-week-9-score-prediction-betting-odds-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/70a3b525-9288-4347-9cc0-01cb1626f3ba/thumbnail/1200x675/665cb1acc6204ff0de58b7d9fa941045/patrick-mahomes-chiefs.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:20:36.000Z",
    "description": "\n        AFC titans face off in a can't miss NFL Week 9 showdown as the Buffalo Bills (5-2) host the Kansas City Chiefs (5-3) on Paramount+. Josh Alle",
    "body": "\n        AFC titans face off in a can't miss NFL Week 9 showdown as the Buffalo Bills (5-2) host the Kansas City Chiefs (5-3) on Paramount+. Josh Allen and the Bills got back into the win column in Week 8 as they cruised to a 40-9 victory against the Carolina Panthers. Meanwhile, Patrick Mahomes and the Chiefs are coming off their third straight win, topping the Jayden Daniels-less Washington Commanders, 28-7, on Monday Night Football.Kickoff from Highmark Stadium is set for 4:25 p.m. ET on CBS and Paramount+. Kansas City is a two-point favorite in the latest Chiefs vs. Bills odds from SportsLine consensus, while the over/under for total points scored is 52.5. Mahomes' over/under for total passing yards is 273.5, while Allen's over/under for total completions is 21.5. Before making any Bills vs. Chiefs picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Chiefs vs. Bills at DraftKings Sportsbook, where new users get $300 in bonus bets if your initial $5 bet wins and three months of NBA League Pass free:Where to bet on Bills vs. ChiefsBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  Just click hereWhere to watch Bills vs. Chiefs on SundayWhen: Sunday, Nov. 2Time: 4:25 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppBills vs. Chiefs betting previewOdds: Chiefs -2, over/under 52.5The early-season woes appear to be behind the Chiefs, as they have averaged 411.8 total yards per game and 31.5 points since Week 4. Mahomes is tied with Matthew Stafford for most TDs so far this season (17) while also averaging 262.4 passing yards per game. The Chiefs passing defense will have a taller task containing Allen than they did in Week 8 against Marcus Mariota, but has shown in the past it can force even top-tier QBs into making mistakes.  Allen has thrown for 1,261 yards with 10 touchdowns and just three interceptions in five regular-season matchups against the Chiefs. Meanwhile, James Cook is averaging a league-high 107.6 rushing yards per game with seven touchdowns in 2025, and he should be fired up to go up against Kansas City's sturdy run defense after scoring two TDs against the Panthers in Week 8. Kansas City is only allowing 16.4 points per game, but Buffalo has only scored fewer than 20 points once this season.Click here to bet Chiefs vs. Bills at FanDuel Sportsbook, where new users get $300 in bonus bets if their first bet of at least $5 wins:Model's Chiefs vs. Bills score prediction, picksThe Chiefs are 5-3-0 ATS and have covered the spread in each of their last three games. The Bills are 3-4-0 ATS, but have won each of the last four regular-season head-to-heads. The SportsLine model is expecting another nail-biter between these AFC foes, and it projects Buffalo will cover the spread in 55% of simulations. Chiefs vs. Bills score prediction: Bills 28, Chiefs 26Chiefs vs. Bills same game parlayBills +2Over 52.5 James Cook anytime TD scorer (-140)Want more Week 9 NFL picks?You've seen the model's best bets for Buffalo Bills vs. Kansas City Chiefs. Now, get against the spread, total and money-line picks for every Week 9 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model locks in Chiefs vs. Bills picks, score prediction, SGP for NFL Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/70a3b525-9288-4347-9cc0-01cb1626f3ba/thumbnail/1200x675/665cb1acc6204ff0de58b7d9fa941045/patrick-mahomes-chiefs.jpg"
      ],
      "datePublished": "2025-11-02T18:20:36.000Z",
      "dateModified": "2025-11-02T18:20:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by betting Bears-Bengals, Bills-Chiefs, Seahawks-Commanders NFL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-fanduel-promo-code-get-300-bonus-bets-bears-bengals-bills-chiefs-seahawks-commanders-nfl-games/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-02T17:33:25.000Z",
    "description": "\n        With the latest FanDuel promo code, new users can get $300 in bonus bets if their first $5 bet wins. With a 12-game NFL slate on Sunday, ther",
    "body": "\n        With the latest FanDuel promo code, new users can get $300 in bonus bets if their first $5 bet wins. With a 12-game NFL slate on Sunday, there are plenty of opportunities for NFL betting. The Kansas City Chiefs will visit the Buffalo Bills at 4:25 p.m. ET on Sunday. The Chiefs ended Buffalo's season in a 32-29 final in last year's AFC Championship Game, but before then, the Bills defeated the Chiefs, 30-21, in Buffalo in a regular-season contest. The SportsLine model expects the Bills to protect their home field for a victory, despite being +113 underdogs, as one of its Sunday NFL best bets at FanDuel Sportsbook.The model also expects the Bears to rebound from their 30-16 loss to the Ravens last week to cover as three-point favorites against the Bengals at 1 p.m. ET. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The SportsLine Projection Model simulates every college football game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best Sunday NFL picksBears (-2.5) vs. BengalsBills money line vs. Chiefs (+112)Seahawks vs. Commanders: Under 48.5 pointsCombining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +632 (risk $100 to win $632). Bet it at FanDuel here:\nBears (-2.5) vs. BengalsAfter back-to-back losses to open the season and begin the Ben Johnson era in Chicago, all seemed to be going in the right direction for the Bears entering last week on a four-game winning streak. But Chicago lost to a Tyler Huntley-led Ravens team, 30-16. Still, the Bears are off to a 4-3 start and rank 15th in scoring at 24 ppg. However, playing the Bengals' defense has a way of bringing the best out of an opposing offense, with Cincinnati allowing 31.6 ppg this season, the most in the NFL. The Jets recorded their first win of the season last week against the Bengals in a 39-38 final, and the model projects the Bears to cover in 54% of simulations. Bet on the NFL at FanDuel Sportsbook:Bills (+113) to defeat the ChiefsThe Bills are 11-1 at home since the beginning of last season, including a 30-21 victory over the Chiefs. Josh Allen is 4-1 in regular-season games against Patrick Mahomes in his career and is coming off winning his first NFL MVP last season. The Bills (5-2) scored 40 points last week against Carolina to combat any negative talk of entering the bye week off back-to-back losses. The Chiefs are 5-3 this season, but they've won only one game away from Arrowhead Stadium this season, which has the model leaning Buffalo's direction. Despite being the underdog, the model projects the Bills to win in 55% of simulations. Bet on the NFL at FanDuel Sportsbook:Seahawks vs. Commanders: Under 48.5 pointsThe Seahawks are one of the most run-heavy teams in the NFL, which can lead to Unders cashing with the clock running more often and from extended drives. Seattle runs on 49.63% of plays, which is the second-highest rate in the NFL. The Seahawks run that often despite having the second-fewest yards per rush (3.7), which again contributes to longer drives and less time of possession for the opposing team. The Under has hit in three of Washington's last four games, and three of the last four Seattle games had a total points Under 47.5. The Commanders will be without WR1 Terry McLaurin, who re-aggravated his quad injury. Jayden Daniels could be rusty with his arm and limited on the ground after missing last week with a hamstring injury, leading the model to project the Under to hit in 53% of simulations on Sunday Night Football. Bet on the NFL at FanDuel Sportsbook:\nWant more NFL Week 9 picks?You've seen some of the model's best bets for Sunday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by betting Bears-Bengals, Bills-Chiefs, Seahawks-Commanders NFL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-11-02T17:33:25.000Z",
      "dateModified": "2025-11-02T17:33:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals free NFL picks, best bets for Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-week-9-nfl-best-bets-betting-odds-free-picks-lions-chargers-sunday-november-2/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/c4b72be6-f7e8-46eb-99f6-8a8e293431a2/thumbnail/1200x675/f6265aa9948759a16b04815f8823bfa5/jared-goff-detroit-lions.jpg",
    "tag": "Sports",
    "date": "2025-11-02T16:32:08.000Z",
    "description": "\n        Eight games are set to unfold in the 1 p.m. ET window on the Week 9 NFL schedule, including an NFC North rivalry between the Minnesota Viking",
    "body": "\n        Eight games are set to unfold in the 1 p.m. ET window on the Week 9 NFL schedule, including an NFC North rivalry between the Minnesota Vikings and Detroit Lions. Detroit has won five straight against Minnesota, and the Lions are favored by 8.5 points on Sunday, according to the latest Week 9 NFL odds. The Lions are 14-6 against the spread in their last 20 meetings against an opponent from the NFC North, and SportsLine's model is backing Detroit to record a convincing victory and cover the spread in 55% of simulations. Vikings quarterback J.J. McCarthy, who's set to return to the starting lineup after missing the past five games with a high ankle sprain, is -155 (risk $155 to win $100) to throw an interception. The model is also backing the Chargers (-10) to cover the spread on the road against the Titans, and Over 44.5 points to be scored in Packers vs. Panthers. Before locking in your Week 9 NFL picks, be sure to check out the top NFL betting picks from SportsLine's advanced computer model. New users can also target the all-new DraftKings promo code, which offers $300 in bonus bets and three free months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:Week 9 NFL best bets for Sunday, Nov. 2 (odds subject to change): Lions (-8.5) vs. VikingsChargers (-10) vs. TitansPanthers vs. Packers: Over 44.5 points Combining the model's three picks into a Week 9 NFL parlay would result in a payout of +584 (risk $100 to win $584). Bet it now at Caesars Sportsbook: Lions (-8.5) vs. VikingsThe Lions are 5-1 in their last six games, and have given up 10 or fewer points in each of their past two games at home. In addition, Detroit is 5-0 against the spread in its last five home games against Minnesota. The Lions enter Sunday's bout ranked third in the NFL in scoring offense, averaging 30.7 points per game. The model is projecting the Lions to record a double-digit victory on Sunday, helping Detroit cover the spread in 55% of simulations.Chargers (-10) vs. TitansThe Titans are arguably the worst team in the NFL, and Tennessee is 0-11 against the spread in its last 11 games at home. The Chargers are also 13-3 in the last 16 meetings against the Titans. Los Angeles' offense is averaging 378.5 yards per game this season, fourth-most in the NFL, while Tennessee is averaging a league-worst 248.8 yards per game. SportsLine's model is backing Los Angeles to cover the spread in 57% of simulations, targeting the Chargers as one of its top Week 9 NFL picks. Packers vs. Panthers: Over 44.5 pointsThe Packers rank inside the top five in the NFL in scoring offense, averaging 27.6 points per game. The total has gone Over in four of the last five games for both of these teams, and the Over has hit in five of Carolina's past seven games against an opponent from the NFC North. SportsLine's model is projecting these teams will combine for 51 points on Sunday, helping the Over hit in 66% of simulations.Want more Week 9 NFL picks?You've seen the model's Week 9 NFL best bets for Sunday. Now, get against the spread, total and money line picks for every Week 9 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals free NFL picks, best bets for Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/c4b72be6-f7e8-46eb-99f6-8a8e293431a2/thumbnail/1200x675/f6265aa9948759a16b04815f8823bfa5/jared-goff-detroit-lions.jpg"
      ],
      "datePublished": "2025-11-02T16:32:08.000Z",
      "dateModified": "2025-11-02T16:32:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Commanders anytime touchdown scorer props, back Zach Charbonnet on SNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-commanders-anytime-touchdown-scorer-picks-odds-predictions-charbonnet-to-score-td-snf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/1a76a455-dbf6-4ea4-b034-069654b7243a/thumbnail/1200x675/44add1c221c2e67a624297562ed78f04/zach-charbonnet-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-02T19:55:42.000Z",
    "description": "\n        The Washington Commanders will host the Seattle Seahawks on Sunday Night Football, and the Commanders have a chance to go from one of the big",
    "body": "\n        The Washington Commanders will host the Seattle Seahawks on Sunday Night Football, and the Commanders have a chance to go from one of the biggest surprises in the NFL to one of the biggest disappointments in one season. The Commanders are 3-5 this season after their surprising run to the NFC Championship Game last year, and they'll have Jayden Daniels back to possibly provide a spark to Washington's offense. Daniels' presence helps both the pass and the run game, as defensive coordinators need to account for his rushing ability, which then creates lanes for running backs, and Jacory Croskey-Merritt was taking advantage of those opportunities earlier this season. Despite that Washington rookie running back being held out of the end zone in each of the last three weeks, the SportsLine model sees value in that changing, backing Croskey-Merritt at +135 odds in its Sunday Night Football anytime touchdown scorer bets when online sports betting.The model is also backing a pair of Seattle playmakers in its Sunday Night Football anytime TD scorer bets, projecting value in running back Zach Charbonnet and tight end AJ Barner to score in primetime. Barner has three touchdowns over his last four games, and with odds at 2-1 or longer at various sportsbooks, the model sees the 6-foot-6 tight end as a valuable option for Week 9 Sunday Night Football anytime TD scorer bets. Before making any Commanders vs. Seahawks picks or anytime touchdown scorer props at sportsbooks, be sure to see the Week 9 NFL predictions from SportsLine's proven model and see the latest NFL odds. They can also help new users take advantage of sportsbook promos like the latest Fanatics Sportsbook promo code, which allows new users to bet and get up to $2,000 in No Sweat Bets in FanCash.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has revealed its top Commanders vs. Seahawks anytime TD scorer prop picks for Sunday Night Football: Best Week 9 Seahawks vs. Commanders anytime TD prop picks:Zach Charbonnet, Seahawks (+110)Jacory Croskey-Merritt, Commanders (+135) MGMAJ Barner, Seahawks (+205) CaesarsParlay these picks for +1300 odds with a DraftKings promo code (odds subject to change). New users receive $300 in bonus bets if your first $5 bet wins, plus three months of NBA League Pass free:Zach Charbonnet, Seahawks (+110)Charbonnet had two touchdowns in Seattle's 27-19 win over the Texans in Week 7 before its bye, as he has four touchdowns over his last four games. He's scored in three of those four contests as the 6-foot-1 back is often the runner the Seahawks turn to near the goal line. The Commanders allowed two rushing touchdowns inside the 2-yard line last week, which would likely be Charbonnet territory on Sunday Night Football. Click here to play Carbonnet in Week 9 Sunday Night Football anytime TD scorer bets at FanDuel, where new users receive $300 in bonus bets if their first $5 bet wins. Jacory Croskey-Merritt, Commanders (+135)Washington had enough confidence in the seventh-round rookie that it traded veteran and reliable running back Brian Robinson Jr. before the season. Croskey-Merritt showcased why, especially early. He scored in two of his first three games, and he had four touchdowns over his first five games. The rookie has gone three straight games without a score, but the Seahawks have allowed a touchdown to a running back in three of their last four games. Click here to bet on Croskey-Merritt as a Sunday Night Football anytime TD scorer with the latest BetMGM promo code, which gives new users up to $1,500 back in bonus bets if your first $5 bet loses:AJ Barner, Seahawks (+205)The 6-6 tight end is tied for the team lead with four receiving touchdowns, with his size making him a top red-zone target for Sam Darnold. Despite only 18 receptions, which is 32 fewer than Jaxon Smith-Njigba, Barner is utilized where you want an anytime TD scorer to be. He has three touchdowns over his last four games and the Commanders have allowed five touchdowns to opposing tight ends, which is tied for the fifth-most in the league.Click here to bet on Barner as a Sunday Night Football anytime TD scorer with the latest Caesars Sportsbook promo code CBS20X, which gives new users 20 100% profit boost tokens with their first $1 bet.Want more Week 9 NFL picks?You've seen the model's NFL anytime touchdown scorer prop picks for Seahawks vs. Commanders in Week 9 Sunday Night Football. Now, get NFL Week 9 projections for every NFL spread, total and player prop at SportsLine.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Commanders anytime touchdown scorer props, back Zach Charbonnet on SNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/1a76a455-dbf6-4ea4-b034-069654b7243a/thumbnail/1200x675/44add1c221c2e67a624297562ed78f04/zach-charbonnet-seahawks.jpg"
      ],
      "datePublished": "2025-11-02T19:55:42.000Z",
      "dateModified": "2025-11-02T19:55:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25 poll: Texas leaps toward top 10,Tennessee sinks in Week 11 college football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ap-top-25-rankings-texas-vanderbilt-tennessee-sec-play/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/a9f846db-bdff-4bf6-ad4a-3b5803e2db9a/thumbnail/1200x675/39e524ca350f4138de2f833e867d4974/gettyimages-2244487743-2.jpg",
    "tag": "Sports",
    "date": "2025-11-02T19:18:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Chaos is inevitable in the college football, and t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Chaos is inevitable in the college football, and that was the case again in Week 10. With a number of College Football Playoff hopefuls going down this week, that has shaken up the Week 11 AP Top 25 poll.Texas started Saturday afternoon in need of a big win, and it got one by taking down No. 9 Vanderbilt in Austin. Arch Manning had a massive day with 328 passing yards and three touchdowns, and he led the Longhorns to a 34-10 lead to start the fourth quarter. Things did get little hairy with the Commodores scoring 21 consecutive points down the stretch, but the Texas managed to hold on. That resulted helped the Horns fly all the way up to No. 13 in this week's poll.Other playoff contenders were not as fortunate as Texas. Miami suffered an inexplicable overtime loss to an SMU team that just lost to Wake Forest the week before. That knocked the Hurricanes down to No. 18, and their playoff chances are now on life support. The same can be said for Tennessee, which hosted Oklahoma for its \"Dark Mode\" game, but it was lights out for the Vols. Oklahoma pulled out a 33-27 win, and those two teams flip-flopped in the rankings. The Sooners are back up to No. 11 while the Vols are barely hanging around at No. 23.Elsewhere, previously undefeated Georgia Tech tumbled from No. 8 to No. 16 after losing to NC State, and previously No. 22 Houston got rolled by a West Virginia team that entered the weekend winless in Big 12 play.Below is the full AP Top 25 for Week 11. First-place votes are in parentheses.\nOhio State (54)Indiana (11)Texas A&M (1)AlabamaGeorgiaOregonOle MissBYUTexas TechNotre DameOklahomaVirginiaTexasLouisvilleVanderbiltGeorgia TechUtahMiamiMissouriUSCMichiganMemphisTennesseeWashingtonCincinnatiOthers receiving votes: Iowa 71, JMU 53, Pittsburgh 35, SDSU 30, North Texas 27, USF 23, SMU 7, Houston 6, Illinois 4, LSU 4, Arizona State 4\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25 poll: Texas leaps toward top 10,Tennessee sinks in Week 11 college football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/a9f846db-bdff-4bf6-ad4a-3b5803e2db9a/thumbnail/1200x675/39e524ca350f4138de2f833e867d4974/gettyimages-2244487743-2.jpg"
      ],
      "datePublished": "2025-11-02T19:18:40.000Z",
      "dateModified": "2025-11-02T19:18:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's next for Hugh Freeze? Don't expect ex-Auburn coach to lead a Power Four program any time soon - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/whats-next-for-hugh-freeze-after-auburn-firing-dont-expect-him-to-lead-a-power-four-program-anytime-soon/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/bc67e7eb-cc39-434c-9b09-6404c766d0f2/thumbnail/1200x675/f9480c1960f573016c9a4e922b6d20f6/freeze.png",
    "tag": "Sports",
    "date": "2025-11-02T19:43:54.000Z",
    "description": "\n        A few weeks after Auburn athletics director John Cohen compared Hugh Freeze's job to an unreliable car that he wasn't sure would start, the i",
    "body": "\n        A few weeks after Auburn athletics director John Cohen compared Hugh Freeze's job to an unreliable car that he wasn't sure would start, the inevitable happened -- the Tigers fired Freeze. Ironically, Freeze's Auburn tenure actually ended as a slow-moving accident. Punt after punt after punt defined the Tigers' 10-3 home loss to Kentucky, the first time in 28 years the Tigers allowed 10 or fewer points and lost a game. The defeat dropped Freeze to 15-19 overall on The Plains. He ended his tenure 1-11 against ranked teams despite a top-13 roster in the sport, per the 247Sports Team Talent Composite. Unlike big-name coaches James Franklin and Brian Kelly who were fired earlier in the 2025 coaching carousel, there was no real argument to be made in favor of keeping Freeze. His reputation as an offensive wiz is in the tank; the Tigers rank No. 118 in yards per play despite a talented offensive line, elite wide receivers and a hand-picked transfer portal QB, Jackson Arnold, who had a seven-figure price tag (Freeze seemed to always pick the wrong portal QB, ignoring Cam Ward when he entered the transfer portal from Washington State). Auburn's coaching search promises to be a blockbuster with a heavy-handed booster class that loves to meddle. The Tigers need to nail the hire in an SEC that's getting more competitive by the week, it seems. \nAs for Freeze?The 56-year-old is a controversial college football figure whose long track record of success feels more distant with each blunder he makes (coaches across the country still cannot figure out why Freeze refused to reevaluate a collaborative play-calling approach). Be skeptical there's much of a market for Freeze as a head coach moving forward -- and it's also unclear if Freeze will want to coach again any time soon. Freeze was diagnosed with prostate cancer in February and is currently undergoing treatment. Doctors caught it early and he opted against immediate surgery to have the mass removed. That's because the cancer was deemed low aggressive, per Freeze. He said back in the summer he planned to reevaluate his health in January. \nThere was likely going to be industry speculation this season Freeze might step down from Auburn because of his health. So, it's reasonable to think Freeze may take some time off and focus on his recovery. He certainly doesn't mind having the time to play golf. As for a potential future in coaching, maybe Freeze could emerge as a candidate at a Group of Five program. He found outsized success in past stints at Arkansas State and Liberty. But checking with industry sources, it's hard to see Freeze making an immediate return as a Power Four head coach. He won't have the cachet of Franklin or a Kelly, and his baggage is immense. If Freeze desired it, he could likely grab a play-caller job somewhere or stash himself away on a staff as an analyst. \nFreeze benefits from the flexibility of an around $15 million buyout without a 'duty to mitigate' clause, which compels those like Franklin to find work right away to offset their buyout. It seems unlikely Freeze wants to fade away forever into the background -- he only took a year-long sabbatical after his Ole Miss tenure ended in a blaze of destruction -- but his chance at reaching the peaks of his Ole Miss tenure are shot. People tend to notice when a luxury car won't start. \n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's next for Hugh Freeze? Don't expect ex-Auburn coach to lead a Power Four program any time soon - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/bc67e7eb-cc39-434c-9b09-6404c766d0f2/thumbnail/1200x675/f9480c1960f573016c9a4e922b6d20f6/freeze.png"
      ],
      "datePublished": "2025-11-02T19:43:54.000Z",
      "dateModified": "2025-11-02T19:43:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Commanders vs. Seahawks odds, picks, bets, predictions for 'Sunday Night Football' from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-seahawks-prediction-odds-2025-week-9-sunday-night-football-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/12238e9b-072a-43bc-b99e-4f0082202975/thumbnail/1200x675/57061a793351d1b45ae14dac1b706d14/zach-ertz-washington-commanders-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:35:55.000Z",
    "description": "\n        It will be a quick turnaround for the Washington Commanders (3-5) as they host the Seattle Seahawks (5-2) on 'Sunday Night Football' in NFL W",
    "body": "\n        It will be a quick turnaround for the Washington Commanders (3-5) as they host the Seattle Seahawks (5-2) on 'Sunday Night Football' in NFL Week 9. The Commanders are coming off a brutal 28-7 loss to the Kansas City Chiefs on Monday, but will get quarterback Jayden Daniels back on the field for Week 9 as he's been removed from the injury report. Meanwhile, the Seahawks will be fresh coming out of a Week 8 bye, last facing the Houston Texans in a 27-19 victory. Terry McLaurin (quad) has been ruled out for Washington.Kickoff from Northwest Stadium in Landover, Md., is set for 8:20 p.m. ET. Seattle is a 3-point favorite in the latest Seahawks vs. Commanders odds, and the over/under for total points scored is 48.5. Before making any Commanders vs. Seahawks picks, be sure to see what the SportsLine projection model has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Commanders vs. Seahawks. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Seahawks vs. Commanders on 'Sunday Night Football':Commanders vs. Seahawks spreadSeahawks -3 at DraftKings SportsbookCommanders vs. Seahawks over/under48.5 pointsCommanders vs. Seahawks money line Seattle +161, Washington +135Commanders vs. Seahawks picksSee picks at SportsLineCommanders vs. Seahawks streaming Fubo (Try for free)Why the Seahawks can coverTraveling to the East Coast should be no problem for the Seahawks since they will be fresh off of their bye week. Sam Darnold is averaging an impressive 9.4 yards per pass with a 75.2 completion percentage and 7-1 TD-INT ratio against NFC teams this season. Kenneth Walker III and Jaxon Smith-Njigba shouldn't have much trouble marching the ball downfield against a Commanders defense that is allowing 372.8 total yards per game. Seattle's own defense is only allowing 75.7 rushing yards per game, which will make for an intriguing matchup against Jacory Croskey-Merritt. See which team to back at SportsLine. Why the Commanders can coverThe Commanders are 2-1-0 ATS and straight up at home this season, which can take away some of the sting of playing on a short week. Having Daniels back in the mix can help since the Seahawks passing defense is allowing 230.1 yards per game despite holding five opponents this season to under 20 points. Deebo Samuel will face a familiar foe in Seattle from his days playing the San Francisco 49ers, and he has 47 catches for 766 yards and seven touchdowns in eight career games against them. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Commanders vs. Seahawks picksFor 'Sunday Night Football' in NFL Week 9, the model is leaning Under the total, projecting 47 total points, and also says one side of the spread is the better value. See what it is at SportsLine.Who wins Seahawks vs. Commanders, and which side of the spread is the better value? Visit SportsLine now to see which side of the Commanders vs. Seahawks spread you need to jump, all from the model that is 45-28 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Commanders vs. Seahawks odds, picks, bets, predictions for 'Sunday Night Football' from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/12238e9b-072a-43bc-b99e-4f0082202975/thumbnail/1200x675/57061a793351d1b45ae14dac1b706d14/zach-ertz-washington-commanders-imagn-images.jpg"
      ],
      "datePublished": "2025-11-02T18:35:55.000Z",
      "dateModified": "2025-11-02T18:35:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How a 41-year-old tight end could pass Tom Brady in the NFL record book in Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/marcedes-lewis-pass-tom-brady-nfl-record-books-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/2fe6ddfb-d7a8-4c6e-8517-3835a556703a/thumbnail/1200x675/966110bce6e4a98a2257a6500bde53ef/mercedes-lewis.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:11:41.000Z",
    "description": "\n        After spending the first two months of the season as a free agent, Marcedes Lewis finally found a team to sign with this week when he made a ",
    "body": "\n        After spending the first two months of the season as a free agent, Marcedes Lewis finally found a team to sign with this week when he made a deal to join the Denver Broncos. Although Lewis was signed to the practice squad, the tight end was promoted to the active roster on Saturday, which means there's a good chance the 41-year-old could end up passing Tom Brady in the NFL record book on Sunday. And yes, you read that right: a tight end could end up passing Brady in the record book. During his 23-year career, Brady re-wrote the NFL record book at the quarterback position, but what you may not know is that he also has a spot in the record book as a pass-catcher. During the 2018 season, Brady caught one pass for 6 yards, which is notable, because it means he has the SECOND-MOST receiving yards in NFL history for a player over 40 years old. Let's take a look at the all-time list for receiving yards over the age of 40:1. Jerry Rice: 2,169 yards 2. Tom Brady: 6 yards 3. Marcedes Lewis: 2 yardsAs you can see, there are only three players in NFL history who have recorded any positive receiving yards after turning 40. If Lewis can total just five receiving yards on Sunday against the Houston Texans, he'll pass Brady. \n\"It's surreal, still trying to take it all in, but I'm really proud today,\" Lewis told Fox Sports on Sunday. Lewis recorded a total of 29 receiving yards as recently as 2023 while playing for the Chicago Bears, and if he can get near that total again, he'll blow past Brady in the record book. Lewis actually had a chance to pass during the 2024 season, but he only caught one pass for two yards during his 17 games with the Bears. The 41-year-old tight end has put himself in a position to pass Brady because of his longevity. Lewis has been in the NFL since 2006 when the Jaguars made him the 28th overall pick in the NFL Draft. That was so long ago that Lewis was in the same draft class as the head coach the Broncos will be facing on Sunday (DeMeco Ryans). Back in 2006, Lewis was actually selected five spots ahead of Ryans, who went 33rd overall to the Texans. The game against Houston will mark the start of Lewis' 20th season, which is the NFL record for most seasons played by a tight end. Lewis also holds the record for most games played by a tight end at 285. Jason Witten held the previous record at 271, but Lewis broke that during the 2024 season.   Lewis has actually played in the 19th most games of any player in NFL history. If he ends up playing in Denver's final nine games, that would put him at 294 games played for his career, which would be the 17th most in NFL history. \nLewis turned 41 on May 19, and by taking the field for Sunday's game, he became the second-oldest active player in the NFL behind only Aaron Rodgers. (Lewis is younger than the Steelers quarterback by five months.)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How a 41-year-old tight end could pass Tom Brady in the NFL record book in Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/2fe6ddfb-d7a8-4c6e-8517-3835a556703a/thumbnail/1200x675/966110bce6e4a98a2257a6500bde53ef/mercedes-lewis.jpg"
      ],
      "datePublished": "2025-11-02T18:11:41.000Z",
      "dateModified": "2025-11-02T18:11:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Carolina fires offensive coordinator Mike Shula after unit's woeful start - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/south-carolina-fires-offensive-coordinator-mike-shula-amid-losses-lanorris-sellers-struggles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/2acb1505-05ba-410f-b48b-86c914d0fcaa/thumbnail/1200x675/2c0fe6da5c30d86db7380a7808d395bc/shula.png",
    "tag": "Sports",
    "date": "2025-11-02T17:29:43.000Z",
    "description": "\n        South Carolina is firing first-year offensive coordinator Mike Shula amid one of the worst offensive stretches in program history, CBS Sports",
    "body": "\n        South Carolina is firing first-year offensive coordinator Mike Shula amid one of the worst offensive stretches in program history, CBS Sports' Matt Zenitz reports.This marks the first time Shane Beamer has fired a coordinator during his five-year tenure at South Carolina. It also comes just weeks after he dismissed offensive line coach Lonnie Teasley following a loss to LSU.The Gamecocks (3-6, 1-6 SEC) are the only Power Four team that has not surpassed 350 total yards in a game this season. They sit at or near the bottom of the league in most major offensive categories. Their 19.7 points per game is the program's lowest average since 2002 -- even with an SEC-leading six non-offensive touchdowns boosting that total.Beamer promoted Shula from an offensive analyst role to offensive coordinator last December on a three-year contract, following Dowell Loggains' departure to Appalachian State.\nWhat was supposed to be a fresh take on Loggains' pro-style scheme built around quarterback LaNorris Sellers' dual-threat ability has instead unraveled. After a promising 2-0 start, the Gamecocks' brief stint in the top 10 has vanished amid one of the SEC's most stagnant offenses.South Carolina's stunning production numbersScoring offense: 19.7 PPG (16th in SEC, 119th nationally)Total offense: 294.1 YPG (16th in SEC, 131st nationally)Rushing offense: 100.8 YPG (16th in SEC, 128th nationally)Passing offense: 193.3 YPG (15th in SEC, 104th nationally)Third down conversions: 32.5% (15th in SEC, 127th nationally)Sacks allowed: 34 (15th in SEC, 134th nationally)Turnovers: 13 (13th in SEC, 97th nationally)Sellers has regressed in his second year as a starter and often looks uncertain in Shula's system, leading to frequent red-zone breakdowns, third-down misfires, excessive sacks and a lack of explosive plays -- all in stark contrast to the dynamic closing stretch that vaulted him into the Heisman conversation last season.South Carolina's prized offseason addition, former Utah State running back Rahsul Faison, has also failed to provide the expected spark. Though he leads the team in rushing, he's averaging a career-low 4.3 yards per carry and has struggled to find running room behind an underperforming offensive line.\nOnly Michigan State has allowed more tackles for loss among Power Four teams than South Carolina's 65, and the Gamecocks' rushing attack ranks as their second-worst in the past decade.Saturday night's loss at Ole Miss appeared to test Beamer's patience, as he was visibly frustrated on the sideline during a series of offensive miscues.\"Pretty disappointing three plays right there,\" Beamer said after a stalled two-minute drive before halftime. \"We get the ball. We get a turnover. We are in two-minute mode and went nowhere. That was a great opportunity right there that we squandered.\"\nSellers has thrown six touchdown passes with three interceptions and just 175 rushing yards this season — a steep drop from his 18 touchdown passes and 674 rushing yards as a redshirt freshman in 2024.Beamer's upcoming offensive coordinator hire ahead of the 2026 season will mark his fourth in five years. Marcus Satterfield led the offense from 2021-22 before joining Matt Rhule's staff at Nebraska, followed by Dowell Loggains (2023-24) and Shula this season. Despite a couple of top-25 finishes and a near-playoff berth during Beamer's tenure, South Carolina's offense has consistently hovered around the middle of the SEC, even with quarterbacks like Sellers and Spencer Rattler under center.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Carolina fires offensive coordinator Mike Shula after unit's woeful start - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/2acb1505-05ba-410f-b48b-86c914d0fcaa/thumbnail/1200x675/2c0fe6da5c30d86db7380a7808d395bc/shula.png"
      ],
      "datePublished": "2025-11-02T17:29:43.000Z",
      "dateModified": "2025-11-02T17:29:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's top games to watch, best bets, odds: Chiefs vs. Bills, NBA and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-chiefs-vs-bills-nba-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/ae8784d6-3b27-4bd4-8532-f15661aef311/thumbnail/1200x675/dc9d4911fe4c91786fd70eb09562fc59/josh-allen-buffalo-bills.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:00:50.000Z",
    "description": "\nWeek 9 of the 2025 NFL season is highlighted by a marquee matchup between the Kansas City Chiefs and Buffalo Bills at Highmark Stadium in Orchard Par",
    "body": "\nWeek 9 of the 2025 NFL season is highlighted by a marquee matchup between the Kansas City Chiefs and Buffalo Bills at Highmark Stadium in Orchard Park, N.Y. at 4:25 p.m. ET on CBS. The three-time reigning AFC champion, Kansas City (5-3) is coming off its third consecutive victory and fifth in six games, a 28-7 triumph over the Washington Commanders.Buffalo (5-2) returned from its bye to rout the Carolina Panthers 40-9 last week and avoid a third straight loss. The Bills have lost four consecutive postseason meetings with the Chiefs but have won the last four regular season meetings between the AFC powers, including a 30-21 victory last year.Eight games are on the NBA schedule, including a showdown between the Philadelphia 76ers (4-1) and Brooklyn Nets (0-5) at 6 p.m. ET at Barclays Center. Philadelphia is looking to bounce back from its first loss of the season, a 109-108 setback against the Boston Celtics on Friday, while Brooklyn is seeking its first win of 2025-26.Meanwhile, the NHL has five contests on its slate, one of which has the Calgary Flames (2-9-2) concluding its four-game road trip with a matchup at 7 p.m. ET against the Philadelphia Flyers (6-4-1) at Xfinity Mobile Arena. Calgary fell to 0-2-1 on its trek with Saturday's 4-2 loss to the Nashville Predators, while Philadelphia lost 5-2 to the Toronto Maple Leafs to drop to 3-1-0 on its five-game homestand.The Chiefs are 2.5-point favorites against the Bills in the latest consensus NFL odds. The 76ers are 5.5-point favorites against the Nets, while the Flyers are -136 favorites on the money line against the Flames.Below is a snapshot of what to watch and bet for Sunday, Nov. 2. All times EasternNFL best bets, where to watchChiefs at BillsTime: 4:25 p.m. | Location: Orchard Park, N.Y. | TV: CBS | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Bills +2 (-108) | Expert: Bills +115The latest installment of this rivalry features two of the top offenses in the NFL. Buffalo ranks third with an average of 382.9 yards, while Kansas City is fifth at 378.3 per game. The Bills lead the league in rushing (164.4 yards) and are fourth in scoring (29.6 points), while the Chiefs rank fifth in passing (251.8). Buffalo's James Cook is the NFL's second-leading rusher with 753 yards following his 216-yard performance against Carolina last week, and Kansas City's Patrick Mahomes shares the league lead with 17 touchdown passes while ranking second with 2,099 passing yards. The SportsLine Projection Model sees the Bills keeping this battle close as they cover the spread in 58% of its simulations. SportsLine expert Will Brinson, who is 23-12 on his last 35 NFL picks, likes Buffalo to extend its regular-season winning streak against the Chiefs to five games as he expects a superhuman effort from reigning league MVP Josh Allen.Seahawks at CommandersTime: 8:20 p.m. | Location: Landover, Md. | TV: NBC | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Under 48.5 (-114) | Expert: Jacory Croskey-Merritt Under 44.5 rushing yards (-114)These teams are trending in opposite directions, as Seattle has won five of its last six games while Washington has lost three straight. The Commanders are 26th in the NFL against the pass, allowing 244 yards through the air per game, and now face the unenviable task of defending Jaxon Smith-Njigba, who leads the league with 819 receiving yards. The 23-year-old wideout, who is 312 yards away from eclipsing the career high he set last season, has posted three straight 100-yard performances and hauled in a touchdown pass in each of those contests. The SportsLine Projection Model doesn't expect a high-scoring affair, as its simulations have the Under hitting 53% of the time. SportsLine expert Larry Hartstein (+1205 on his last 40 NFL player prop picks) feels Washington running back Jacory Croskey-Merritt's recent struggles gaining yards on the ground will continue.More NFL best betsPanthers-Packers Over 43.5 (-107, SportsLine model A-rated play)Kareem Hunt anytime touchdown scorer +115 (R.J. White)Model's best player prop picks for Week 9Model's best anytime TD scorer picks for Week 9NBA best bets, where to watch76ers at NetsTime: 6 p.m. | Location: Brooklyn, N.Y. | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Under 232.5 (-106) | Expert: Adem Bona Over 14.5 points + rebounds (-120)After posting a one-point victory at Boston in their season opener, the 76ers were on the wrong side of a one-point decision against the Celtics at home on Friday, suffering their first loss of the campaign as Joel Embiid missed a 3-pointer at the buzzer. The Nets have been idle since Wednesday, when they outscored the Atlanta Hawks in the fourth quarter but missed their final five shots and dropped a 117-112 decision to remain winless. Philadelphia and Brooklyn split their four meetings last season, with each team winning once at home and once on the road. The 76ers are third in the NBA in scoring with an average of 125 points, but these teams failed to combine for more than 217 points in any of their matchups in 2024-25, and the SportsLine Projection Model doesn't think they'll do so in this contest as the Under hits in 54% of its simulations. SportsLine expert Mike Barner (13-9 on his last 22 NBA player prop picks) feels Philadelphia's Adem Bona will be productive in place of Embiid, who will be rested for this game.NHL best bets, where to watchFlames at FlyersTime: 7 p.m. | Location: Philadelphia | TV: NHL Network | Stream: Fubo (Try for free)\nSportsLine pick -- Model: Flames +1.5 ( -216)The Flames are last in the NHL with six points and have lost 11 of 12 since edging the Edmonton Oilers in a shootout in their season opener. But four of their last six setbacks have been by just one goal, with one coming in overtime and another in a shootout. The Flyers are an impressive 6-2-0 at home thus far this campaign, but three of the victories came after regulation (two in shootout, one in OT). Calgary swept the season series in 2024-25 with a pair of 6-3 wins, and the SportsLine Projection Model believes the Flames will at least keep it close on Sunday as they cover the puck line in 67% of its simulations.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's top games to watch, best bets, odds: Chiefs vs. Bills, NBA and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/ae8784d6-3b27-4bd4-8532-f15661aef311/thumbnail/1200x675/dc9d4911fe4c91786fd70eb09562fc59/josh-allen-buffalo-bills.jpg"
      ],
      "datePublished": "2025-11-02T18:00:50.000Z",
      "dateModified": "2025-11-02T18:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Auburn coaching candidates: Jimbo Fisher, James Franklin among options to replace Hugh Freeze - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/auburn-coaching-candidates-jimbo-fisher-james-franklin-hugh-freeze-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/56e87bfb-da9e-47ee-8511-c99e38b97a0f/thumbnail/1200x675/3748879e3acffe5e687039673c45e0b4/jimbo-fisher.jpg",
    "tag": "Sports",
    "date": "2025-11-02T19:45:38.000Z",
    "description": "\n        Auburn is heading back to the coaching carousel after Hugh Freeze was fired during his third year with the program. The Tigers went 15-19 und",
    "body": "\n        Auburn is heading back to the coaching carousel after Hugh Freeze was fired during his third year with the program. The Tigers went 15-19 under Freeze, including a paltry 6-15 in SEC play. Now, they're set to hire their fourth coach in five years. Freeze was an unexpected hire when he returned to the SEC more than six years after he was fired from Ole Miss in the midst of both personal and professional scandals. At Auburn, he was unable to recapture the magic of his Rebels run, never beating Alabama and not even posting a winning record in three years. In fact, his success almost exactly mirrored Bryan Harsin, who was run out in Year 2. The next coach at Auburn faces an intriguing moment. They will have to rebuild the identity of the program in a highly competitive SEC. Like Freeze and Harsin before, they will have to do it in the shadow of national title contenders at Alabama and Georgia. \n        \n            \n                As college football coaching carousel spins, discussion of representation takes a new twist\n                \n                    Richard Johnson                \n            \n                            \n    \n                \n                    \n    \nAuburn won a national championship in 2010 and returned to the title game in 2013. There is championship upside in the program, but a new coach will have to rebuild it from the ground up. Below is a compilation of coaches from CBS Sports Insiders who could quickly find themselves on Auburn's radar. \nFormer Texas A&M coach Jimbo FisherFisher's tenure at Texas A&M ended in disastrous fashion after he was paid the biggest buyout in college football history to go away. In his final two seasons after signing the No. 1 recruiting class in history, Fisher went 11-15, including 6-9 in SEC play. But while his recent work has been underwhelming, Fisher remains one of the most successful coaches of the 21st century. At Florida State, Fisher went 83-23 and won the 2013 national championship. He also led the Aggies to a No. 4 finish and Orange Bowl victory in 2020, ranking among their best Aggies seasons of the past 30 years. His 2013 team is one of the most talented rosters ever. If Fisher went to Auburn, he'd quickly be one of the top recruiters in the SEC again. Coming back to college football wouldn't be about money for Fisher -- it would be about reclaiming his name. Auburn could use a coach with a big chip on his shoulder. \nFormer Penn State coach James FranklinWhen Penn State unceremoniously fired Franklin, he said his new goal was simply to go win a national championship somewhere else. Auburn is a program with championship upside, and Franklin checks many of the most important boxes for the program -- namely building a robust football organization. Franklin is one of the highest-floor coaches in college football, posting six 10-win seasons and five AP top 10 finishes at Penn State. He also previously led Vanderbilt to 18 wins in two years and reached the national semifinals in 2025. Auburn would more than take Franklin leading the Tigers back to 10-win contention consistently after arguably the most embarrassing stretch in program history. Missouri coach Eli DrinkwitzA Gus Malzahn disciple, Drinkwitz has created some of the most dynamic teams in the SEC since arriving at Missouri in 2020. The Tigers are 27-6 over the past three seasons, including a Cotton Bowl victory and AP Top 10 finish in 2023. The program is also on the edge of College Football Playoff contention during another hot start to 2025. \nAt Auburn, he would be able to expand his recruiting chops and compete for the best players in the country. Furthermore, Drinkwitz has a trash-talking personality that would immediately become beloved at Auburn, especially in contrast to the cool Kalen DeBoer at Alabama. Auburn is at its best when the program is swinging for the fences. Tulane coach Jon SumrallSumrall is one of the fastest-rising coaches in college football after sensational coaching jobs at Troy and Tulane. He is high on the team's early hot board, according to CBS Sports' Brandon Marcello. The Huntsville, Alabama, native took over a Troy program coming off three straight losing seasons and quickly flipped them into a winner, posting a 23-4 record with two Sun Belt titles in two seasons. The next year, he went to Tulane and led the program to the American title game with a 8-5 record, including 7-1 in American play. The former Kentucky linebacker has deep experience in the SEC, working as defensive coordinator under Mark Stoops and linebackers coach at Ole Miss. He has built physical defensive teams that control games but has consistently found great offensive coordinators and players as a head coach, including quarterback Darian Mensah, running back Makhi Hughes and running back Kimani Vidal. \nAlso, Sumrall's wife went to Auburn. Understanding The Plains never hurts. Arizona State coach Kenny DillinghamThe former Auburn offensive coordinator has quickly become one of the fastest-rising coaches in college football. Dillingham led his alma mater to a Big 12 championship and College Football Playoff appearance in Year 2, culminating with a double-overtime loss to Texas in the quarterfinals. Injuries have derailed Arizona State's 2025, but the Sun Devils still managed to outlast Iowa State with a backup quarterback. Dillingham would be the exact kind of young, exciting offensive mind that attracts elite quarterbacks to The Plains. However, his greatest strengths are as an administrator and communicator, which would allow him to build an elite SEC staff. He has coached under Mike Norvell, Dan Lanning and Gus Malzahn. Georgia Tech coach Brent KeyThe Yellow Jackets' CFP hopes took a major shot after a loss to NC State in Week 10, but Key has still done a sensational job in Atlanta. Georgia Tech reached No. 7 in the AP Top 25 for the first time since 2009 and have built a big, physical identity behind the former offensive line coach. \nKey has plenty of experience recruiting the Deep South, including the all-important Atlanta metro. He also served as offensive line coach at Alabama -- it never hurts to have some Nick Saban bonafides in that state. More than anything, Key would quickly develop a strong identity in the program. South Florida coach Alex GoleshGolesh has sped back up coaching boards after leading one of the best Group of Six teams in the country. The Bulls went from 7-6 in each of the past two seasons to a 6-2 start, including major upset victory against Florida in nonconference play. South Florida was coming off a 4-29 record in three seasons before Golesh; he has posted a 20-14 record. The former Tennessee offensive coordinator boasts one of the most interesting backgrounds in the sport. Golesh was born in Russia and grew up in Ohio. He primarily coached in the Midwest before joining Josh Heupel at UCF in 2020. Now, he brings a diversified offense that embraces aspects of Tennessee's veer-and-shoot, but plenty of physical running from the Toledo tree. Golesh has also established himself as a dynamite recruiter in The American. \n\n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Auburn coaching candidates: Jimbo Fisher, James Franklin among options to replace Hugh Freeze - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/56e87bfb-da9e-47ee-8511-c99e38b97a0f/thumbnail/1200x675/3748879e3acffe5e687039673c45e0b4/jimbo-fisher.jpg"
      ],
      "datePublished": "2025-11-02T19:45:38.000Z",
      "dateModified": "2025-11-02T19:45:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 9 NFL anytime touchdown scorer picks, back Ashton Jeanty to score - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-9-nfl-anytime-touchdown-scorer-odds-picks-ashton-jeanty-among-best-bets-for-anytime-td-scorer-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/a0612552-68f8-40d8-8770-ce51fc09fb6e/thumbnail/1200x675/fca3249e130d26fe051fb7de45a60aaa/ashton-jeanty.jpg",
    "tag": "Sports",
    "date": "2025-11-02T17:04:30.000Z",
    "description": "\n        This has not been the rookie season many expected from Ashton Jeanty after he was the No. 6 overall pick by the Las Vegas Raiders in the 2025",
    "body": "\n        This has not been the rookie season many expected from Ashton Jeanty after he was the No. 6 overall pick by the Las Vegas Raiders in the 2025 NFL Draft. The Raiders are coming off their bye, though, after being shut out by the Chiefs, and that additional time to prepare for a matchup against the Jacksonville Jaguars could lead to better offensive success. The rookie has five of the Raiders' 10 touchdowns this season, and the SportsLine Machine Learning Model has Jeanty among its top picks for Week 9 anytime TD scorer bets at +105 odds at online sports betting sites. The model also has a few other top picks for Week 9 anytime touchdown scorer bets, including Josh Jacobs to remain on a roll for the Green Bay Packers, and Bears wide receiver Rome Odunze to cash for Week 9 anytime TD scorer bets. Odunze and the Bears are favored by 2.5 points against the Bengals, and his over/under for total receptions is 4.5.Targeting anytime touchdown bets is one way to approach Week 9 NFL betting at online sports betting sites. With NFL props available for almost every player in every game at sportsbooks, the SportsLine Machine Learning Model can help you find value to add to your Week 9 NFL picks. It can also help new users take advantage of sportsbook promos like the latest bet365 bonus code, where new users receive $200 in bonus bets with a $5 wager, whether it wins or loses.Best Week 9 NFL anytime touchdown picks:Josh Jacobs, Packers (-145)Ashton Jeanty, Raiders (+105)Rome Odunze, Bears (+125)Parlay these picks for +625 odds with a DraftKings promo code, which gives new users $300 in bonus bets if your first bet of $5 or more wins, plus three months of NBA League Pass free: (odds subject to change)Josh Jacobs, Packers (-145) Jacobs has scored a touchdown in six of seven games this season, including in each of the last four contests. The Packers RB1 has seven touchdowns over his last four games, with three different two-touchdown performances. He's second in the NFL with nine rushing touchdowns entering a contest against the Panthers, who allowed 216 yards and two touchdowns to Buffalo running back James Cook last week. The Panthers are allowing 4.6 yards per rush, which ranks 24th in the NFL, and even at -145 odds, the model sees strong value in Jacobs scoring a touchdown, which he does in 80% of simulations.Click here to bet on Jacobs as a Week 9 anytime touchdown scorer at DraftKings, where new users receive $300 in bonus bets if their first $5 bet wins, plus three months of NBA League Pass free:Ashton Jeanty, Raiders (+105)The Raiders' rookie has scored half of Las Vegas' touchdowns this season (five), with three rushing and two receiving scores. Las Vegas was shut out by the Chiefs in its last game, but the Raiders are coming off a bye, and that additional time between games could lead to a more successful game plan. Jeanty has four touchdowns over his last four games, and he's played more than 60% of snaps in four of his last fives games as he grasps a better concept of being an NFL running back and the Raiders' offense. The Raiders play the Jaguars, who are coming off a 35-7 loss to the Rams in Week 7, and the model projects Jeanty to score in 70% of simulations, compared to his implied odds of 48.78%. Click here to bet on Jeanty as a Week 9 anytime touchdown scorer at FanDuel, where new users receive $300 in bonus bets if their first $5 bet wins. Rome Odunze, Bears (+125)Odunze was a touchdown-scoring machine to begin the season, scoring at least once in each of the first four games of the year. He's gone scoreless over his last three weeks, though, but he remains a featured part of the offense, averaging seven targets per game over that span. The No. 9 overall pick in the 2024 NFL Draft had seven receptions for 114 yards on 10 targets last week against the Ravens, and he's been Chicago's leading receiver in three of seven games this season. Starting running back D'Andre Swift (groin) is out, which could lead to more passing against the Bengals, who have the worst scoring defense in the NFL. The Bengals are allowing 31.6 ppg, including 39 points to the previously winless Jets last week. The model projects Odunze to score in 64% of simulations, returning strong value at +125 odds. Click here to bet on Odunze as a Week 9 anytime touchdown scorer at FanDuel, where new users receive $300 in bonus bets if their first $5 bet wins. Want more Week 9 NFL picks?You've seen the model's NFL picks for some top anytime touchdown scorer NFL player props for Week 9. Now, get NFL Week 9 projections for every player prop at SportsLine.Also at SportsLine:You can also see the model's best bets for every Week 9 NFL game, including Falcons vs. Patriots, 49ers vs. Giants, Chiefs vs. Bills Finally, SportsLine expert RJ White, who is 84-72 (+1067) over his last 156 NFL picks, has locked in multiple Week 9 NFL picks. Visit SportsLine to see his best bets.Want more huge paydays? The model has also built a five-leg Week 9 NFL parlay that would pay almost 25-1. Check out the model's Week 9 NFL parlay only at SportsLine. Visit SportsLine to see the parlay.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 9 NFL anytime touchdown scorer picks, back Ashton Jeanty to score - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/10/a0612552-68f8-40d8-8770-ce51fc09fb6e/thumbnail/1200x675/fca3249e130d26fe051fb7de45a60aaa/ashton-jeanty.jpg"
      ],
      "datePublished": "2025-11-02T17:04:30.000Z",
      "dateModified": "2025-11-02T17:04:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 9 NFL player props, picks odds: Target Christian McCaffrey with Week 9 NFL bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-9-nfl-player-props-odds-picks-christian-mccaffrey-sunday-nfl-prop-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg",
    "tag": "Sports",
    "date": "2025-11-02T16:57:25.000Z",
    "description": "\n        Arguably, the biggest surprise of the San Francisco 49ers' rash of injuries is Christian McCaffrey's ability to stay out of it. The elite San",
    "body": "\n        Arguably, the biggest surprise of the San Francisco 49ers' rash of injuries is Christian McCaffrey's ability to stay out of it. The elite San Francisco running back entered this season playing fewer than half his team's games in three of the last five years, but, despite nearly every pivotal 49ers player dealing with some form of injury this season, McCaffrey has stayed on the field. He hasn't been as elite on the ground as in recent seasons, though, breaking 70 rushing yards only once this season, but the SportsLine Machine Learning Model expects that to change against the Giants on Sunday for Week 9 NFL prop betting. The model has McCaffrey Over 75.5 rushing yards as one of its best bets for Week 9 NFL player props for NFL betting heading into a 1 p.m. ET game in New York. The Giants are allowing 148.9 rushing yards per game this season, which ranks 30th in the NFL, leading to the Over projection for McCaffrey for Week 9 NFL player prop bets. The 49ers are favored by 2.5 points against the Giants, and the over/under is 48.5.Targeting NFL player props is one way to approach Week 9 NFL betting at online sports betting sites. With NFL props available for almost every player in every game at sportsbooks, SportsLine's Machine Learning Model can help you find value to add to your Week 9 NFL picks at various sportsbooks. They can also help new users take advantage of sportsbook promos like the latest Fanatics Sportsbook promo code, which allows new users to bet and get up to $2,000 back in No Sweat Bets in FanCash. Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. Best Week 9 NFL player prop picks:Justin Herbert, Chargers, Over 242.5 passing yards (-114) Christian McCaffrey, 49ers, Over 75.5 rushing yards (-118) Ja'Marr Chase, Bengals, Under 92.5 receiving yards (-115) Parlay these picks for +561 odds with a FanDuel promo code, which gives new users $300 in bonus bets if your first $5 bet wins: (odds subject to change)Justin Herbert, Chargers, Over 242.5 passing yards (-114)Herbert leads the NFL with 2,140 passing yards this season, and he also tops the sport in passing yards per game (267.5). He's gone Over this number in two of his last three games, and after playing on Thursday Night Football last week, Herbert and the Chargers had more time to prepare for a matchup against the struggling Titans. Tennessee is 1-7 this season and allowed 272 passing yards to Daniel Jones last week. The Titans allow 358.4 total yards per game, which ranks 26th in the NFL, and the Chargers average the second-most pass attempts per game in the NFL this season. The model projects 270 passing yards for Herbert on Sunday. Click here to bet Herbert Over 242.5 passing yards at FanDuel, which gives new users $300 in bonus bets if your first $5 bet wins.Christian McCaffrey, 49ers, Over 75.5 rushing yards (-118)McCaffrey is one of the best running backs in the NFL, and he's used as such. The 49ers' star running back played 96% of snaps last week, which was the third time in eight games this season he's played more than 90% of snaps. He's played at least 75% of snaps in every game this season, and although that hasn't led to him going Over this rushing total often, Sunday provides a strong matchup to change that. The 49ers play the Giants, who are 30th in the NFL in rushing defense, allowing 148.9 rushing yards per game this year. They've allowed a running back to reach 76 rushing yards in back-to-back weeks, and McCaffrey is two weeks removed from 129 rushing yards and two touchdowns against the Falcons. The model projects McCaffrey to rush for 90 yards on Sunday.Click here to bet McCaffrey Over 75.5 rushing yards at BetMGM, where new users receive up to $1,500 in bonus bets if your first bet loses. Ja'Marr Chase, Bengals, Under 92.5 receiving yards (-115)Chase is on an unsustainable target rate with Joe Flacco as the Bengals' quarterback, averaging 18 targets per game over a three-game span. That would translate to 306 targets over a season. In comparison, he led the NFL with 175 targets last season, so expecting the 18-target-per-game trend to continue seems impossible. Even with that historic target share, Chase went Under this total last week with 91 yards on 12 receptions with 19 targets. He had 94 yards in another start with Flacco, so the heavy targets haven't always meant a massive yardage total. Flacco (shoulder) is questionable for Sunday, and if he can't play, that would take a heavy hit on Chase's production as well. The Bengals play the Bears, who have held the opposing team's top pass-catcher to fewer than 93 yards in five of their last six games. The model projects 83 receiving yards for Chase on Sunday.Click here to bet Chase Under 92.5 receiving yards at BetMGM, where new users receive up to $1,500 in bonus bets if your first bet loses. Want more Week 9 NFL picks?You've seen the model's NFL picks for some popular NFL player props for Week 9. Now, get NFL Week 9 projections for every player prop at SportsLine.Also at SportsLine:You can also see the model's best bets for every Week 9 NFL game, including Vikings vs. Lions, Broncos vs. Texans and Chiefs vs. Bills. Finally, SportsLine expert RJ White, who is 84-72 (+1067) over his last 134 NFL picks, has locked in multiple Week 9 NFL picks. Visit SportsLine to see his best bets.Want more huge paydays? The model has also built a five-leg Week 9 NFL parlay that would pay almost 25-1. Check out the model's Week 9 NFL parlay only at SportsLine. Visit SportsLine to see the parlay.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 9 NFL player props, picks odds: Target Christian McCaffrey with Week 9 NFL bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg"
      ],
      "datePublished": "2025-11-02T16:57:25.000Z",
      "dateModified": "2025-11-02T16:57:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]