[
  {
    "title": "Super Bowl squares strategy, picks: Tips for winning Seahawks vs. Patriots squares from NFL expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/super-bowl-squares-strategy-picks-tips-for-winning-seahawks-vs-patriots-squares-from-nfl-expert/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:07:45.000Z",
    "description": "\nWhether you're playing at home with friends or trying to cash in at some of the top online sportsbooks, Super Bowl Squares contests have become commo",
    "body": "\nWhether you're playing at home with friends or trying to cash in at some of the top online sportsbooks, Super Bowl Squares contests have become commonplace over the last 60 years and they're an easy way to give yourself some skin in the game as the Seattle Seahawks take on the New England Patriots on Sunday at Levi's Stadium. The premise is simple, you build a 10x10 grid and participants buy spots to match the final digit of each team's score at the end of each quarter. Popular variations include boosted payouts for halftime and the final score, and depending on the price of entry and the total prize pool, it can be incredibly lucrative and there is a Big Game squares strategy that you might find useful. Most at-home Seahawks vs. Patriots squares games will be randomized, but how you cluster your squares can have an impact. Meanwhile, several of the best sports betting apps are offering their own versions of Big Game squares pools that allow you to pick your numbers, with payouts determined by assigned odds. SportsLine NFL expert Mike Tierney is detailing his Patriots vs. Seahawks squares strategy here for CBS Sports and we're also breaking down some of the best sportsbook promos, which you can use to boost your bankroll while playing in Big Game squares contests.Seahawks vs. Patriots odds, betting lines\nSeahawks vs. Patriots spreadSeattle -4.5 at DraftKings SportsbookSeahawks vs. Patriots over/under45.5 pointsSeahawks vs. Patriots money line Seahawks -230, Patriots +190Seahawks vs. Patriots picksSee picks at SportsLineSeahawks vs. Patriots streaming Fubo (try for free)Patriots vs. Seahawks squares strategy from NFL expertA veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. Mike is 235-189-13 on his NFL picks the past three seasons, returning $2,505 to $100 players. Anyone who has followed him could be way up. Here's his analysis:For most years since the advent of the Super Bowl Squares contest, the most desirable numbers on a board for the final score were 0, 3 and 7. That's because touchdowns nearly always produced seven points, field goals happened frequently, and the sum of a TD and a FG is a digit ending in zero.Scoring in the sport has evolved. Nowadays, teams more frequently miss the longer point-after kicks and try two-point conversions, which increasingly leads to a net of six or eight points on a touchdown. Analytics persuade coaches to eschew shorter field goals on fourth down, resulting in an uptick of TDs by nearly one per game since the turn of the century.As a result, certain Squares numbers are not as coveted as in past eras. Let's look at final scores. In the last 10 Super Bowls, while four teams wound up with points totals that ended in zero, three landed on 4, three others on 8 and three more on 1. There was also a pair of 2s and a couple of 5s — and not a single 7.So, if you engage in Squares, do not sweat out which number that the fates deliver. Any digit can generate a winner.Now, if your contest also does quarter-by-quarter scores, that's a different matter. Because teams rarely score more than twice in a period, 0, 3 and 7 are good gets. Still, they do not come up as often as in old-school times.As a reminder, here is a primer on Super Bowl Squares, which is done on a grid that contains 100 spaces (or squares) formed by 10 vertical and 10 horizontal rows.Players acquire one or more squares for a designated cost, typically one or a few dollars each. They select which squares they want, usually by writing their initials in them.After all squares are purchased, every number from zero to nine is selected at random. The numbers are written in order of the drawing next to the vertical rows. Repeat for the horizontal rows. That means each square will result in two corresponding single-digit numbers.Then assign either the Patriots or the Seahawks to the vertical rows and the other squad to the horizontal rows.Let's say Seattle beats New England 26-19. (As we indicated, any digit is possible.) The winner of the contest is the person whose initials are in a square with a 6 in the Seahawks' row and a 9 in the Pats' row.As indicated, additional contests can be done for each quarter or half.It's a fun way for folks to enjoy the game even if they have no expertise. Skills are not required.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl squares strategy, picks: Tips for winning Seahawks vs. Patriots squares from NFL expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T16:07:45.000Z",
      "dateModified": "2026-02-03T16:07:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Erin Jackson, Frank Del Duca to serve as Team USA flag bearers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/winter-olympics-2026-team-usa-flag-bearers-erin-jackson-frank-del-duca/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/aa86d4ea-3129-45a8-ba2e-331e6b631aa8/thumbnail/1200x675/1ecba0158991da3aa7b2bc15960fe30f/gettyimages-1370380636-1.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:08:16.000Z",
    "description": "\n        Olympic champion speed skater Erin Jackson and bobsledder Frank Del Duca will represent Team USA as flag bearers at the Opening Ceremony of t",
    "body": "\n        Olympic champion speed skater Erin Jackson and bobsledder Frank Del Duca will represent Team USA as flag bearers at the Opening Ceremony of the Milano Cortina Winter Games. The United States Olympic and Paralympic Committee announced Tuesday the co-flag bearers, who were chosen by fellow Team USA athletes through a voting process. They will become the second American duo to share the honor at the Winter Olympics.Jackson is the ninth speed skater in U.S. history to bear the flag and follows Brittany Bowe, who replaced bobsledder Elana Meyers Taylor to open the 2022 Beijing Winter Games after the latter tested positive for COVID-19. Del Duca is the sixth bobsledder selected for the role and, because of Meyers Taylor's absence four years ago, will be the first in 70 years to carry the flag at an opening ceremony.\"We are honored to announce Erin Jackson and Frank Del Duca as the flag bearers for Team USA at the Opening Ceremony,\" USOPC CEO Sarah Hirshland said in a release. \"Being chosen by their fellow athletes is a powerful reflection of the respect they've earned through their leadership, commitment, and the way they represent Team USA every day. Erin and Frank embody the values of excellence and unity that define our Olympic Team, and we're proud to have them lead Team USA onto the world stage.\"This is the second consecutive Winter Olympics in which Team USA selected two flag bearers.\nThe Opening Ceremony will air live in the United States at 2 p.m. ET on Friday.Who is Erin Jackson?Jackson, 33, made her Winter Olympic debut in 2018 at the Pyeongchang Winter Games. Her breakthrough came four years later when she became the first Black American woman to medal in speed skating and the first Black woman to win gold in an individual sport. Her 500m speed skating victory at the Beijing Winter Games snapped a two-decade drought for American women atop the speed skating podium.\"Being chosen to represent the United States on the world stage is a tremendous honor,\" Jackson said. \"It's a moment that reflects far more than one individual -- it represents my family, my teammates, my hometown, and everyone across the country who believes in the power of sport. The Olympics remind us of the power of sport to connect and inspire, and I'm proud to carry that forward on the Olympic stage.\"Jackson hails from Ocala, Florida, and graduated from the University of Florida. The longtime roller skater had just four months of experience in speed skating on ice when she qualified for the 2018 Winter Olympics. Since then, she has accumulated six medals on the world stage.\nWho is Frank Del Duca?Del Duca, 34, will make his second Winter Olympic appearance this month after debuting at the Beijing Games. The bobsled pilot finished 13th in the two-man and four-man competitions in 2022.\"Being flag bearer for Team USA is an incredible honor,\" Del Duca said. \"It was also quite the surprise. I'm grateful for the support from my teammates, coaches and staff, Team USA, U.S. Army WCAP, family and friends, and everyone who has helped me on this journey. With the Olympic Games being held in Italy, it means even more. Nearly everyone in my family is of Italian descent.\"There is no greater honor than leading Team USA into the Opening Ceremony in Italy. It feels like a bridge between my family's heritage, and the country I'm so proud to serve. I know my grandfather is watching over me saying, \"Hey, Frangesch, way to go kid,\" and would be so proud.\"\nAfter winning the high school state championship in alpine skiing, the Bethel, Maine, native walked on to the University of Maine track and field team. He attended a bobsled combine after college and joined the U.S. Bobsled team as a push athlete, and after missing out on a selection for the 2018 U.S. Olympic Team, he moved to the pilot position.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Erin Jackson, Frank Del Duca to serve as Team USA flag bearers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/aa86d4ea-3129-45a8-ba2e-331e6b631aa8/thumbnail/1200x675/1ecba0158991da3aa7b2bc15960fe30f/gettyimages-1370380636-1.jpg"
      ],
      "datePublished": "2026-02-03T16:08:16.000Z",
      "dateModified": "2026-02-03T16:08:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Patriots odds, picks: Experts reveals exact score predictions for the Big Game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-patriots-picks-nfl-expert-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:08:34.000Z",
    "description": "\n        All eyes will be on Levi's Stadium in Santa Clara, Calif., when the New England Patriots take on the Seattle Seahawks in the Big Game. It's a",
    "body": "\n        All eyes will be on Levi's Stadium in Santa Clara, Calif., when the New England Patriots take on the Seattle Seahawks in the Big Game. It's an unlikely matchup after the Patriots came into the season off back-to-back 4-13 seasons and hadn't been to the NFL playoffs since the 2021 season. Seattle hadn't been to the playoffs since the 2022 season, but made huge strides in the second season under head coach Mike Macdonald and quarterback Sam Darnold, a free-agent acquisition.Kickoff is at 6:30 p.m. ET on Sunday, Feb. 8. The latest Seahawks vs. Patriots odds from DraftKings Sportsbook list Seattle as the 4.5-point favorite, with the over/under at 45.5 points. The Seahawks are -238 money line favorites (risk $238 to win $100), while the Patriots are +195 underdogs. SportsLine's NFL experts teamed up to give exact score projections for the Big Game, and while they're unanimously backing the Seahawks to win, their score predictions lead to some different spread and total picks. \nThe team of NFL betting experts includes R.J. White, who is SportsLine's all-time No. 1 NFL spread expert and Larry Hartstein, who enters the game on a 43-33 run on NFL ATS picks (+596). Other NFL betting experts featured include Alex 'PropStarz' Selesnick, who is on a 62-44 (+916) roll on NFL player props and Jeff Hochman, who is 83-66-3 (plus +1217) over the past four NFL seasons.Now, SportsLine's NFL experts have analyzed the NFL odds and locked in their final score predictions for Seahawks vs. Patriots. Patriots vs. Seahawks score predictionsR.J. White Big Game score prediction: Seahawks 19, Patriots 16\"The last four Big Games have seen both teams get to 20 points, but I think there's a chance touchdowns will be hard to come by in this game. The Seahawks defense is elite, allowing just two touchdowns in the six games since Week 12 where they haven't faced the Rams. The Patriots defense has risen to that level in the postseason thanks to getting key players back in the front seven as well as playcaller Zak Kuhr putting on a masterclass each week. There's no denying the talent on these offenses, but I see two defensive units that will be tough to crack in the red zone and a lot of kicking points in this game.\" New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins, and target the Patriots +4.5: \nLarry Hartstein Big Game score prediction: Seahawks 23, Patriots 16\"It's been four months since a team not named the Rams excelled offensively versus Seattle's No. 1 defense. Unless Drake Maye runs wild, I have a hard time seeing the Patriots getting to 20 points. New England's defense is stout too, with a front that shuts down the run and Christian Gonzalez patrolling the back end. But Seattle has better weapons, led by the unstoppable Jaxon-Smith Njigba. He, Rashid Shaheed and Cooper Kupp will make enough plays to complete the Sam Darnold redemption story.\" You can bet Seahawks (-4.5) at DraftKings:\nJeff HochmanBig Game score prediction: Seahawks 27, Patriots 20\"Seattle's edge in Net Yards Per Play (+1.4 vs. +1.0) is even more impressive considering they played the fourth-toughest schedule, while New England had the league's easiest. Since 2000, just four teams have captured the title with a negative sack differential, while teams with a +20 or higher sack differential -- such as Seattle -- have won six times. The Patriots' sack differential of -13 is the lowest ever for a championship team in this span. After monitoring both teams all season, Seattle appears superior in every phase: offense, defense and special teams.\" You can go Over on the total (45.5) at DraftKings:\nAlex 'PropStarz' Selesnick Big Game score prediction: Seahawks 23, Patriots 19\"This looks like a game where both offenses could find it difficult to score touchdowns. New Englands defense has been dominant through the playoffs and features the type of scheme and personnel that could potentially give Sam Darnold fits coupled with limiting Seattle's run game. I also expect Mike McDonald's defense to make life really difficult on Drake Maye who has not been same player that was a bonafide MVP candidate through the entirety of the regular season. I think this is ultimately a low scoring game decided by 4 points or less. The Seahawks have been very fortunate in high leverage situations and I do expect some major regression in the turnover department, however that may not come to fruition until next season. Seattle feels like a team of destiny.\" You can pick Under (45.5) the total at DraftKings:\nHow to get more Patriots vs. Seahawks picksSportsLine's model has simulated Seahawks vs. Patriots 10,000 times and revealed its picks. See who wins and covers the spread here, all from the model that's on a 53-37 roll on top-rated NFL picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Patriots odds, picks: Experts reveals exact score predictions for the Big Game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T16:08:34.000Z",
      "dateModified": "2026-02-03T16:08:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to watch Seahawks vs. Patriots in Super Bowl 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/how-to-watch-super-bowl-2026-patriots-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/27fe33c3-4ee0-4049-8790-7b185825301f/thumbnail/1200x675/1e72152ae6c4496f294e23cf43383fcb/patriots-seahawks-super-bowl.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:15:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After 272 regular-season games and 12 postseason g",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After 272 regular-season games and 12 postseason games, Super Bowl 2026 is finally here. On Sunday, Feb. 8, the AFC champion New England Patriots will do battle with the NFC champion Seattle Seahawks for the right to raise the Lombardi Trophy.New England advanced to the Super Bowl for the first time since the 2018 season thanks to consecutive victories over the Los Angeles Chargers, Houston Texans and Denver Broncos. The Patriots won a sloppy, snowy AFC title game over a Broncos team starting its backup quarterback, emerging with a 10-7 win thanks to several Denver miscues, some well-timed runs from Drake Maye and an electric performance from a defense that has stepped up in a big way during this playoff run.Seattle is headed back to the Super Bowl for the first time since making it in back-to-back years in 2013 and 2014. The Seahawks earned a first-round bye and then defeated the division rival San Francisco 49ers and Los Angeles Rams in consecutive weeks. They won a thrilling, back-and-forth NFC title game on the strength of a fantastic performance from Sam Darnold, who slayed some demons by throwing for 346 yards and three touchdowns in the 31-27 victory.Which of these two teams will emerge victorious and hoist the Lombardi Trophy? We'll find out soon enough. But in the meantime, here's a look at how you can actually watch the game.\nWhere to watch Super Bowl 2026Date: Sunday, Feb. 8 | Time: 6:30 p.m. ETLocation: Levi's Stadium (Santa Clara, California)TV: NBC, streaming on PeacockHalftime performer: Bad BunnyFollow: CBS Sports App\nFind all of our Super Bowl LX coverage at CBSSports.com right here.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to watch Seahawks vs. Patriots in Super Bowl 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/27fe33c3-4ee0-4049-8790-7b185825301f/thumbnail/1200x675/1e72152ae6c4496f294e23cf43383fcb/patriots-seahawks-super-bowl.jpg"
      ],
      "datePublished": "2026-02-03T16:15:26.000Z",
      "dateModified": "2026-02-03T16:15:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Patriots prediction, odds: 2026 Super Bowl picks by expert on 28-16 Seattle run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-patriots-prediction-odds-spread-time-2026-super-bowl-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:09:53.000Z",
    "description": "\nSam Darnold and the Seattle Seahawks battle Drake Maye and the New England Patriots in a 2026 Super Bowl matchup on Sunday. Darnold threw for 346 yar",
    "body": "\nSam Darnold and the Seattle Seahawks battle Drake Maye and the New England Patriots in a 2026 Super Bowl matchup on Sunday. Darnold threw for 346 yards and two touchdowns with three touchdowns in a 31-27 win over the Los Angeles Rams in the NFC Championship Game. Maye, meanwhile, guided New England to a 10-7 win over the Denver Broncos to win the AFC title. The Seahawks won the NFC West at 14-3 and were the top seed in the conference, while the Patriots won the AFC East at 14-3 and were the second seed in the AFC. Kickoff from Levi's Stadium in Santa Clara, Calif., is set for 6:30 p.m. ET. The Seahawks lead the all-time series 11-9, including wins in four of the past five games. The Seahawks are 4.5-point favorites in the latest Seahawks vs. Patriots odds from DraftKings Sportsbook, while the over/under for total points scored is 45.5. Before making any Seahawks vs. Patriots picks, make sure to check out the 2026 Super Bowl LX predictions from SportsLine NFL expert Emory Hunt.\nHunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007, and a former running back at Louisiana-Lafayette. He knows the game from a player's perspective.Hunt's dedication to analysis of all levels of college and professional football helped go 88-67-2 (+1474) on all NFL picks over the past two years. He is also 28-16 (+1047) on his last 44 against-the-spread picks in Seattle Seahawks games. Anyone who has followed him could be way up.     Now, Hunt has set his sights on Seahawks vs. Patriots and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Patriots vs. Seahawks: Seahawks vs. Patriots                                             spreadSeattle -4.5 at DraftKings SportsbookSeahawks vs. Patriots                                                     over/under45.5 pointsSeahawks vs. Patriots                                                     money line Seattle -238, New England +195Seahawks vs. Patriots                                                 picksSee picks at SportsLineSeahawks vs. Patriots                                                     streaming Fubo (Try for free)  Why the Seahawks can coverOffensively, Seattle was top-three in scoring, averaging 28.4 points. The Seahawks have consistently covered the spread, doing so in 14 of their last 18 games. Seattle has also hit the money line in 14 of their last 16 games. Darnold threw for the fifth-most passing yards this season at 4,048 yards. Seattle allowed the fewest regular-season points at 17.2 per game. The Seahawks were sixth-best in the league and second-best in the NFC, allowing 285.6 total yards. Seattle was especially stifling in the ground game, allowing an NFC-least 91.9 rushing yards per game. The Seahawks were 10th overall in passing yards given up at 193.9. See which team to back at SportsLine. Why the Patriots can coverOn offense, New England averaged 28.8 point per game, tops in the AFC and second-best in the league. The Patriots also have done a good job of covering the spread. New England has covered in 13 of their last 17 games. The Patriots have also hit the money line in 17 of their last 19 games.When it comes to defense, New England had the eighth-best league-wide and sixth-best in the AFC. The Patriots allowed 295.2 yards per game, including 193.5 passing yards. New  England has been stubborn in the running game, allowing 101.7 rushing yards per game, sixth-best in the NFL and fourth-best in the AFC. The Patriots allow just 18.8 points per game, third-best in the AFC and fourth-best in the NFL. See which team to back at SportsLine.How to make Seahawks vs. Patriots  picksHunt has analyzed Seahawks vs. Patriots from every possible angle. He's leaning Over on the point total and has also discovered an X-factor that has him jumping all over one side of the spread.     He's only sharing what it is, and which side to back, at SportsLine.Who wins Patriots vs. Seahawks, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Seahawks vs. Patriots spread you need to jump on, all from the expert that is 28-16 on his last 44 Seattle Seahawks picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Patriots prediction, odds: 2026 Super Bowl picks by expert on 28-16 Seattle run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg"
      ],
      "datePublished": "2026-02-03T16:09:53.000Z",
      "dateModified": "2026-02-03T16:09:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. Mavericks prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-mavericks-odds-prediction-time-2026-nba-picks-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/7cadecb3-dc6b-4a22-9e7a-2f8ee562a090/thumbnail/1200x675/5fa9a9713d09b031dd6d73412e5bf39e/cooper-flagg-dallas-mavericks-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:31:35.000Z",
    "description": "\n        Two teams going in opposite directions will meet as part of Tuesday's NBA schedule as the Boston Celtics visit the Dallas Mavericks. The Celt",
    "body": "\n        Two teams going in opposite directions will meet as part of Tuesday's NBA schedule as the Boston Celtics visit the Dallas Mavericks. The Celtics (31-18) have won three of their last four, including a Sunday victory over Milwaukee, 107-79. Meanwhile, the Mavs (19-30) have lost four straight, most recently a 111-107 defeat to Houston on Saturday. Anthony Davis (finger) and PJ Washington (concussion) are among those out for the Mavericks.Tipoff is at 8 p.m. ET from American Airlines Center in Dallas. The teams split their two matchups last season as they'll meet for the first time this year. The latest Mavericks vs. Celtics odds list Boston as the 6.5-point favorite, with the over/under at 222.5. Before making any Celtics vs. Mavericks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Mavericks vs. Celtics 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. Mavericks: Mavericks vs. Celtics   spread                                                                     Celtics -6.5 at DraftKingsMavericks vs. Celtics   over/under:    222.5 pointsMavericks vs. Celtics   money line:    Celtics -254, Mavericks +206Mavericks vs. Celtics   picks: See picks at SportsLineMavericks vs. Celtics   streaming:PeacockNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Celtics vs. Mavericks   picksSportsLine's model has simulated Mavericks vs. Celtics   10,000 times and is going Over on the total (222.5 points). These teams have engaged in nothing but high-scoring affairs over their last four regular-season matchups, with each of them clearing having at least 229 combined points. Those four meetings have averaged 238.3 points, with each of the last three going Over the total.The Mavs have trended over recently at home, as they've eclipsed the total in five of their last seven contests in Dallas. Meanwhile, few teams are as efficient as Boston on the offensive end, as it ranks second in offensive rating, second in 3-pointers per game, and it commits the fewest turnovers per night. SportsLine's model has the total being surpassed by more than 10 points as the Over hits in 64.6% of simulations in an A-rated pick.It also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. Mavs, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Mavs vs. Celtics spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. Mavericks prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/7cadecb3-dc6b-4a22-9e7a-2f8ee562a090/thumbnail/1200x675/5fa9a9713d09b031dd6d73412e5bf39e/cooper-flagg-dallas-mavericks-imagn-images-1.jpg"
      ],
      "datePublished": "2026-02-03T15:31:35.000Z",
      "dateModified": "2026-02-03T15:31:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suns vs. Trail Blazers prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-trail-blazers-odds-prediction-time-2026-nba-picks-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/bbeb9b18-e930-4beb-aec3-43ba347d6d8f/thumbnail/1200x675/35e62c75eac870bdbda26538e783b398/shaedon-sharpe-portland-trail-blazers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:55:20.000Z",
    "description": "\n        A pair of Western Conference playoff hopefuls will clash on Tuesday's NBA schedule as the Phoenix Suns visit the Portland Trail Blazers. The ",
    "body": "\n        A pair of Western Conference playoff hopefuls will clash on Tuesday's NBA schedule as the Phoenix Suns visit the Portland Trail Blazers. The Suns (30-20) are seventh in the West and have won three of their last four, though they're coming off a 117-93 loss to the Clippers. The Blazers (23-27) are the 10-seed out West and have dropped five in a row, most recently a 130-111 defeat to Cleveland. Devin Booker (ankle) is out for Phoenix while Jalen Green (hamstring) is questionable. Deni Avdija (back) and Scoot Henderson (hamstring) are doubtful for Portland, with Jrue Holiday (personal) questionable.Tipoff is at 11 p.m. ET from Moda Center at the Rose Quarter in Portland, Ore. Phoenix won the lone matchup, on the road, earlier this season. The latest Suns vs. Trail Blazers odds list Phoenix as the 2.5-point favorite, with the over/under at 218.5. Before making any Trail Blazers vs. Suns picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Trail Blazers vs. Suns 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Suns vs. Blazers: Trail Blazers vs. Suns   spread                                                                     Suns -2.5 at DraftKingsTrail Blazers vs. Suns   over/under:    218.5 pointsTrail Blazers vs. Suns   money line:    Suns -137, Blazers +115Trail Blazers vs. Suns   picks: See picks at SportsLineTrail Blazers vs. Suns   streaming:PeacockNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Suns vs. Trail Blazers   picksSportsLine's model has simulated Blazers vs. Suns 10,000 times and is going Over on the total (218.5 points). Each of the last three meetings have gone over, with them averaging 237.3 combined points. The last four overall to take place in Portland have gone over, while the Suns have eclipsed the total in each of their last two games this season.The Blazers went over in their last contest, and the Over has hit in three of their last four home games. The model projects both teams to showcase their depth, as each is projected to have six players reach double-figures. With that, the model is calling for 230 points to go on the scoreboard as the Over hits in 66.9% of simulations.It also says one side of the spread hits almost 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Suns vs. Blazers, and which side of the spread hits almost 70% of the time? Visit SportsLine now to see which side of the Trail Blazers vs. Suns spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns vs. Trail Blazers prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/bbeb9b18-e930-4beb-aec3-43ba347d6d8f/thumbnail/1200x675/35e62c75eac870bdbda26538e783b398/shaedon-sharpe-portland-trail-blazers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T15:55:20.000Z",
      "dateModified": "2026-02-03T15:55:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Wizards prediction, odds, line, start time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-wizards-odds-prediction-spread-time-2026-nba-picks-tuesday-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/86fe3e8a-bc1c-4400-a84e-24c8ed4fdf6f/thumbnail/1200x675/ea596a16f51ceb6f331e80f5446398d8/jalen-brunson-knicks.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:30:07.000Z",
    "description": "\n        The New York Knicks look to extend their winning streak to seven games when they clash with the Washington Wizards in an Eastern Conference m",
    "body": "\n        The New York Knicks look to extend their winning streak to seven games when they clash with the Washington Wizards in an Eastern Conference matchup on Tuesday night. New York is coming off a 112-100 win over the Los Angeles Lakers on Sunday, while Washington defeated the Sacramento Kings 116-112 that same day. The Knicks (31-18), who lead the Atlantic Division, are 10-12 on the road this season. The Wizards (13-35), who are fifth in the Southeast Division, are 9-16 on their home court. New York is expected to be without Miles McBride (ankle) and Mitchell Robinson (ankle). Tre Johnson (ankle) and Trae Young (quad) are out for Washington.Tipoff from Capital One Arena in Washington, D.C., is set for 7 p.m. ET. The Knicks lead the all-time series 187-136, including wins in each of the last 10 meetings. New York is a 13.5-point favorite in the latest Knicks vs. Wizards odds from DraftKings Sportsbook, while the over/under for total points scored is 228.5. Before making any Wizards vs. Knicks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Knicks vs. Wizards 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Knicks vs. Wizards:Knicks vs. Wizards                                                                                                                                     spread:    New York -13.5 at DraftKings    Knicks vs. Wizards                                                                                                                                                     over/under:    228.5 pointsKnicks vs. Wizards                                                                                                                                                     money line:    New York -704, Washington +500    Knicks vs. Wizards                                                                                                                                                     picks:    See picks at SportsLineKnicks vs. Wizards                     streaming:Fubo (Try for free)   New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Knicks vs. Wizards picksAfter 10,000 simulations of Knicks vs. Wizards, SportsLine's model is going Under on the total (228.5). The Under has hit in five of the last 10 head-to-head meetings, including one push. The Under has also hit in nine of the last 10 New York games, while it has hit in four of the last seven Washington games. The SportsLine model is projecting New York's Jalen Brunson to score 25.9 points on average and be one of five Knicks players to score 11.7 or more points. Washington's Alex Sarr, meanwhile, is projected to have 18.6 points as six Wizards players score 10.5 points or more.It has also generated an against-the-spread pick that hits well over 60% in simulations. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Wizards, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Knicks vs. Wizards spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Wizards prediction, odds, line, start time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/86fe3e8a-bc1c-4400-a84e-24c8ed4fdf6f/thumbnail/1200x675/ea596a16f51ceb6f331e80f5446398d8/jalen-brunson-knicks.jpg"
      ],
      "datePublished": "2026-02-03T15:30:07.000Z",
      "dateModified": "2026-02-03T15:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl National Anthem betting: How to bet on Charlie Puth over-under before Patriots vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/super-bowl-national-anthem-betting-how-to-bet-on-charlie-puth-over-under-before-patriots-vs-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/02/a5264809-77b4-463a-83af-3f0da36c003f/thumbnail/1200x675/bb40e64841fc8b5d446aa25ec0b94ebb/puth.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:26:39.000Z",
    "description": "\nThe Super Bowl is the biggest betting event of the year, and the wagers available for the NFL's championship game aren't restricted to what happens w",
    "body": "\nThe Super Bowl is the biggest betting event of the year, and the wagers available for the NFL's championship game aren't restricted to what happens when the ball is in motion. Far from it. The wagering options on Super Bowl 60 at DraftKings include everything from the coin toss (-103 on both Heads and Tails) to whether the final score qualifies as Scorigami (+2200) to an Over/Under on the jersey number of the first touchdown scorer (Over 10.5, -160; Under 10.5, +120). One of the more popular Super Bowl 60 props is sure to be the run time of the national anthem, although the market may not be available to you depending on your location.Charlie Puth will be singing the anthem before Sunday's game between the New England Patriots and Seattle Seahawks, set for a 6:30 p.m. ET kickoff at Levi's Stadium in Santa Clara, Calif. Before you sweat your coin-toss bet, you might be on the edge of your seat, and watching the stopwatch, as Puth belts out the national anthem so you can stack up some winnings before the action starts.CBS Sports gambling and Fantasy sports managing editor R.J. White has been analyzing Super Bowl for years and is one of SportsLine's top NFL experts -- he is on a 29-15 roll (+1323) on his NFL picks this season. White also has also had past success betting Super Bowl entertainment props and has hit the National Anthem prop in the past five Super Bowls. Last year, White expected Jon Batiste to add some musical flourishes or a solo to the anthem, and the multiple Grammy winner just eclipsed the projected 120.5-second run time. Puth has said he hopes to bring a jazzy feel to the song Sunday, but what does that mean for the run time? White has taken a close look at it, and now he's sharing his Super Bowl 60 national anthem pick.   Here are the latest odds for Super Bowl 60 at DraftKings:\nSuper Bowl national anthem pickR.J. White's national anthem length pick: Under 120.5 seconds (-125)White's analysis: I started making picks on the length of the Super Bowl national anthem for SportsLine six years ago, and it's been quite the ride. Before making each pick, I dug into old performances of the anthem for each artist and any quotes I could find about their upcoming rendition, then applied what I know about their musical style to get a feel for the projected length. Sometimes it's easy; back in 2021, the NFL gave us a duet that was certain to fly Over the posted total. The last few years have been tougher and featured some very close calls, but I've managed to get it right every single time. That's right, we're entering this year's rendition with an active 5-0 streak on picking the length of the national anthem.This is likely going to be another close call where it's tough to have a strong play either way. Charlie Puth is delivering the national anthem, an opportunity for which he took the initiative of sending an audition tape to Roc Nation before landing the gig of a lifetime. He talked about that process and why he so badly wanted the opportunity in a Rolling Stone interview, saying that he feels pressure to live up to the precedent set by Whitney Houston (a New Jersey native like Puth), and he also noted a desire to stand out like Chris Stapleton did in 2023.Puth shared a video of him playing the national anthem on keyboard on YouTube five years ago, but I don't know that there's much to take away from it. He's said recently that he plans to have a bit of a jazzy feel to his rendition, which he claimed all came together in his head clearly (whether he can translate it to the big stage is another thing).While he feels pressure to prove himself as a vocalist with this performance, I'm going to lean to the Under here, particularly if you can lock in a number higher than two minutes. My expectation is that Puth will have some type of instrumental intro cooked up before he sings the first line of the song, which is what starts the stopwatch for this prop market, and as such he'll keep the vocal portion a little tighter than some performers from the recent past. I expect our final anthem time to clock in somewhere between 115 and 120 seconds.Head to SportsLine for more Super Bowl picks, both from proven experts and the SportsLine Projection Model, which simulates every game 10,000 times and enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting apps could have seen strong returns.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl National Anthem betting: How to bet on Charlie Puth over-under before Patriots vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/02/a5264809-77b4-463a-83af-3f0da36c003f/thumbnail/1200x675/bb40e64841fc8b5d446aa25ec0b94ebb/puth.jpg"
      ],
      "datePublished": "2026-02-03T15:26:39.000Z",
      "dateModified": "2026-02-03T15:26:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Celtics-Mavericks, Pistons-Nuggets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-celtics-mavericks-pistons-nuggets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:38:05.000Z",
    "description": "\n        The Detroit Pistons will face the Denver Nuggets in an NBA showdown on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $2",
    "body": "\n        The Detroit Pistons will face the Denver Nuggets in an NBA showdown on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more. Both teams rank in the top 10 in the NBA in scoring, and SportsLine's proven computer model has the Over (224.5) hitting in that matchup. It has also revealed one of its Tuesday NBA best bets for Celtics vs. Mavericks, along with an NHL bet for Devils vs. Blue Jackets. Claim the latest bet365 bonus code here:Check out our bet365 bonus code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Tuesday's top picks, best betsOver 224.5 in Pistons vs. NuggetsOver 223.5 in Celtics vs. Mavericks Under 6.5 in Devils vs. Blue JacketsCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:Over 224.5 in Pistons vs. Nuggets\nTwo of the league's top offenses are meeting on Tuesday night, as Denver ranks third in points per game (119.9) and Detroit ranks eighth (117.3). The Nuggets have not been nearly as impressive defensively, ranked 16th in the NBA in points allowed per game (115.7). They have star Nikola Jokic back from an injury, providing their offense with a massive boost. SportsLine's model has Jokic scoring 25 points on Tuesday, helping the Over cash in 60% of simulations. Back the Over at bet365 here:Over 223.5 in Celtics vs. Mavericks Boston has gone Under the total in five straight games, which has led to a low total for this matchup. The Mavericks rank No. 20 in the NBA in points allowed per game (116.6) and play at the third-fastest tempo of any team in the league, so this is the perfect opportunity for Boston to put up big numbers. Dallas has allowed at least 115 points in seven straight home games, and the model expects that trend to continue Tuesday. Ultimately, these teams combine for 231 points as the Over hits 60% of the time. Back the Over at bet365 here:Under 6.5 in Devils vs. Blue JacketsThe Blue Jackets are aiming for their sixth straight win, and they have allowed three goals or fewer in four of their last five wins. They are facing a New Jersey team that has lost three of its last four games and has been held to three goals or fewer in eight of its last nine games. The Devils have gone Under in six of those games, and they have cashed the Under in five of their last six home games. Additionally, these teams have gone Under in five of their last seven head-to-head meetings, so the model has the Under hitting in 69% of simulations. Back the Under at bet365 here:\nLooking for more betting picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Celtics-Mavericks, Pistons-Nuggets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-02-03T15:38:05.000Z",
      "dateModified": "2026-02-03T15:38:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WM Phoenix Open 2026 parlay, props: PGA longshot picks from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-wm-phoenix-open-longshot-picks-odds-bets-pga-props-golf-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/d0163528-75af-4ab3-8823-3c76d908773c/thumbnail/1200x675/a80d1f2c8dc1e203a81a5ecfb4d3bab9/usatsi-28012979.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:10:23.000Z",
    "description": "\n        The 2026 WM Phoenix Open field is highlighted by Scottie Scheffler, Hideki Matsuyama and Brooks Koepka, who are all two-time winners of his t",
    "body": "\n        The 2026 WM Phoenix Open field is highlighted by Scottie Scheffler, Hideki Matsuyama and Brooks Koepka, who are all two-time winners of his tournament. Thus, several golf props and PGA picks will include that trio, who could also make their way into a WM Phoenix Open longshot parlay. Koepka placed just 56th in his return to the PGA Tour last week and carries +410 golf prop odds to notch a top-10 finish at TPC Scottdale this week. He's at +4000 to win the tournament, while Scheffler is the +220 favorite.Meanwhile, despite Matsuyama's past success at this event, he has zero top 5s over his last eight starts at this course. He's at +500 to end that drought with a top 5, which could be a part of your 2026 WM Phoenix Open parlay. If interested in other contenders to triumph outside of Scheffler, there's Xander Schauffele at +1700 and Cameron Young at +2500. Before making any 2026 WM Phoenix Open   picks or golf parlays, you need to see this PGA Tour parlay from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its best bets since the restart, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 WM Phoenix Open   field is locked in, SportsLine simulated the tournament 10,000 times. It has locked in betting picks to form a 5-leg golf parlay that pays out $45,000 for a $10 bettor. See the picks and full parlay by heading to SportsLine.Top 2026 WM Phoenix Open     parlay, PGA Tour picksFor the WM Phoenix Open   2026, one of the picks featured in the model's 5-leg PGA Tour parlay is Collin Morikawa to have a top 10 finish at +315. The two-time major winner is coming off his third straight top 20 finish in FedEx Cup Standings last year. He notched four top 10s and usually plays his best at the start of the year. Morikawa had a pair of runners-up across his first four starts in 2025 as he plays his second tournament of 2026.\nMorikawa notched a top 25 in his TPC Scottsdale debut, shooting par or better in all four rounds, and that experience will be invaluable this week. He is coming off a year with elite ball-striking metrics, ranking in the top 10 on tour in driving accuracy, strokes gained: tee-to-green and SG: approach the green. As one of the shorter courses but with oversized greens averaging about 7,000 square feet, Morikawa's weaknesses of driving distance and putting should be mitigated, while his precision with his irons benefits him regardless of the course. See the rest of the PGA Tour parlay legs here.New users can also check out the latest FanDuel promo code and get $200 in bonus bets at FanDuel if your $5 bet wins:How to make PGA Tour parlay picks The model has also picked an outright winner, plus a prop that returns nearly +1000 among its five PGA Tour picks for the 2026 WM Phoenix Open     parlay that pays over $45,000 on just a $10 bet. You can only see the picks and the full parlay at SportsLine.\nSo, who will win the 2026 WM Phoenix Open, and what combination of PGA Tour props could unlock a $45,000 payday on just a $10 bet? Visit SportsLine now to get the PGA Tour parlay and picks for the WM Phoenix Open, all from the golf model that's nailed a whopping 16 majors entering the weekend, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WM Phoenix Open 2026 parlay, props: PGA longshot picks from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/d0163528-75af-4ab3-8823-3c76d908773c/thumbnail/1200x675/a80d1f2c8dc1e203a81a5ecfb4d3bab9/usatsi-28012979.jpg"
      ],
      "datePublished": "2026-02-03T15:10:23.000Z",
      "dateModified": "2026-02-03T15:10:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football transfer portal: Lincoln Riley digs SEC as USC class strengthens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-transfer-portal-lincoln-riley-sec-usc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/72da224b-0026-4f15-a3d9-2d316f607df0/thumbnail/1200x675/c627e4ea84d15affa3002e8828310343/lincolnriley.png",
    "tag": "Sports",
    "date": "2026-02-03T15:51:50.000Z",
    "description": "\n        USC coach Lincoln Riley likes where college football is heading during the infancy of the historic revenue-sharing era. He also sees a shift ",
    "body": "\n        USC coach Lincoln Riley likes where college football is heading during the infancy of the historic revenue-sharing era. He also sees a shift in the balance of power. Armed with the nation's No. 1 2026 signing class, per the 247Sports Composite, Riley gave a not-so-subtle jab at the SEC, saying \"one part of the country\" is no longer hoarding all of the nation's top talent.\"I think the parity, stories that wouldn't have happened before that are happening now,\" Riley said on The Colin Cowherd Show. \"Now there's not just one part of the country paying players. Everybody's able to do it and it's a great thing because I do think it has created a much more level playing field and it has given schools the opportunity to really compete if they want to invest.\"It's been great for players. We all know there's still parts of it to be worked out. It's obviously not a finished product by any stretch of the imagination, but it has gotten better. There has been a lot of positives and I think you're going to continue to see a lot of great stories, a lot of new opportunities for different types of programs, which I think is really good for the sport as a whole.\"There is much to unpack here. Riley first touched on parity before glossing over \"paying players,\" which he insinuates was an unfair advantage for programs from the south.\nRevenue sharing commenced July 1, 2025, which allowed schools, for the first time, to directly pay players for performance — a historic shift in the landscape of college sports. Schools can now opt into revenue sharing with athletes and athletic departments have clearance to use their own funds to pay players.Indiana capped the first season of college football's new era with its first unbeaten finish and national championship, punctuating one of the greatest runs in the sport's history. Curt Cignetti largely built the Hoosiers were through the transfer portal, highlighted by Heisman winner Fernando Mendoza at quarterback.Prior to the Big Ten's three-year reign at the top of college football, the SEC captured 13 of 17 national titles dating back 2006, including six of the first nine after playoff expansion. Clemson, Florida State and Ohio State were the other champions during a stretch dominated by Nick Saban's Alabama and two titles each from Georgia, LSU and Florida.\nTo Riley's point, those aforementioned behemoths fueled the SEC's vice grip. Following the 2018 launch of college football's version of offseason free agency, there is a considerably wider dispersion of talent.USC's 2026 roster significanceRiley said during a roundtable discussion that he doesn't sense heightened pressure in 2026, but acknowledged his belief that the USC roster is championship-capable.Jayden Maiava returns as USC's starting quarterback after throwing for 3,711 yards and 24 touchdowns last year, joining running backs Waymond Jordan, King Miller and others.\nTasked with replacing Makai Lemon and Ja'Kobi Lane, the biggest change offensively will be USC's wideout room. Tanook Hines should push for top billing, along with NC State transfer Terrell Anderson. Early enrollee Boobie Feaster is one of three four-star wideout signings in a class packed with future talent.USC's offensive line is veteran-led and welcomes five-star tackle Keenyi Pepe, the No. 1 player at his position and fifth-best overall in the 2026 recruiting cycle. Riley chose to go freshmen-heavy in this roster reload, only signing eight transfer additions. Those supplemental portal signings should all find spots in USC's two-deep, including Penn State edge Zuriah Fisher and Washington linebacker Deven Bryant.\"We're going to have some young talent that is certainly going to contribute and I think our talent there is pretty unique,\" Riley said, \"but also, the experienced part of this roster is really experienced and really old too. I mean, you start looking at kind of what we return and then you look at historically, what do championship teams and really good teams typically return, we return a lot in those key areas.\"\nRiley replaced outgoing defensive coordinator D'Anton Lynn with former TCU coach Gary Patterson, whose defense will be front-to-back driven. Patterson's arrival further propelled USC's offseason momentum that started in December during the early signings period and Riley hopes lasts through the College Football Playoff.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football transfer portal: Lincoln Riley digs SEC as USC class strengthens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/72da224b-0026-4f15-a3d9-2d316f607df0/thumbnail/1200x675/c627e4ea84d15affa3002e8828310343/lincolnriley.png"
      ],
      "datePublished": "2026-02-03T15:51:50.000Z",
      "dateModified": "2026-02-03T15:51:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking the 10 best Super Bowl halftime shows of all time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-super-bowl-halftime-shows/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2022/02/14/94aa5ac8-45a4-4d58-afaf-62a5602641ed/thumbnail/1200x675/5698e99d7fd1d534f6e6f87976a2590b/gettyimages-1370397404.jpg",
    "tag": "Sports",
    "date": "2026-02-03T15:59:29.000Z",
    "description": "\n        The Super Bowl is the most-watched television program every year, and people are not just turning into the game. The halftime show is also a ",
    "body": "\n        The Super Bowl is the most-watched television program every year, and people are not just turning into the game. The halftime show is also a major draw to the event. This year, in between the New England Patriots and Seattle Seahawks battling for the Lombardi Trophy in Super Bowl LX, Bad Bunny will take the stage to entertain football fans, and casual fans, around the world.The game and halftime show, will take place in Santa Clara, California at Levi's Stadium, home of the San Francisco 49ers. Kickoff is set for 6:30 p.m. ET on Sunday, February 8.These days, we can expect the halftime show to be a massive event, with props, dancers, musicians, lights, sometimes pyrotechnics and often special guests. But it wasn't always like that. Over the history of the Super Bowl, the halftime show has evolved and grown into a spectacle that is one of the most highly anticipated musical performances each year.Throughout the 59 Super Bowls, there have been bands, pop singers, rappers and surprise guests take the stage in front of a stadium full of fans. Wild stunts, visual effects and props are often used to make the performances stand out. \nThere are many options to choose from when it comes to the most wild, exciting and iconic moments, but we did our best to put together some of the best of the best ahead of Super Bowl LX.10. Destiny's Child reunion (2013)Beyonce is one of the most-talked about and beloved artists of all time and is often put on a pedestal above most others. She has performed at the Super Bowl twice, the first time coming in 2013. That year, she made many '90s and early '00s pop fans dreams come true with a Destiny's Child reunion, bringing out Kelly Rowland and Michelle Williams.\n9. Dr. Dre, Snoop Dogg, Eminem, Mary J. Blige, Kendrick Lamar, 50 Cent share a stage, win an Emmy (2022)Getting this many hip-hop and R&B legends on one stage, and not just any stage the biggest stage, was iconic in and of itself. This was one of the most exciting Super Bowl halftime shows, with energy that could be felt from the television. The 2022 SoFi Stadium performance was received so well that it went on to win an Emmy for Outstanding Variety Special (Live), marking the first-ever halftime show to win in the category.\n\n        \n            \n                Full list of every Super Bowl halftime performer in history: Bad Bunny to headline 2026 show at Super Bowl LX\n                \n                    Shanna McCarriston                \n            \n                            \n    \n                \n                    \n    \n8. Michael Jackson stands still (1993)Jackson is known as one of the greatest performers of his generation and his presence was so powerful that he would often stand motionless on the stage and still receive the loudest of cheers. The \"King of Pop\" put his star power to the ultimate test during the 1993 Super Bowl, beginning his set by standing absolutely still for well over a minute. Performers do not get much time on the halftime stage, so most use every minute to its maximum capacity, but M.J. knew he would make an impact even without singing a word.\n7. Left Shark (2015)Even if you do not remember many details about Katy Perry's halftime show performance, you probably remember Left Shark becoming an instant viral meme. The person in the shark costume decided now was their chance to make their mark on the halftime show and earn their fame, and they did just that. The seemingly off-the-cuff dance moves will go down in halftime history.6. Rihanna's pregnancy revealed (2023)Performing the Super Bowl halftime show is a lot of pressure and takes dedication, time, lots of planning and the stamina to keep up with the fast pace while singing. This year, Rihanna performed the halftime show while pregnant, adding an extra layer of difficulty to an already impressive career highlight. This was the first-ever halftime show pregnancy announcement, and will go down as a memorable moment. Rihanna performed on floating stages with her special guest, though it was not the guest people were predicting. She also did the entire halftime performance alone, something that is becoming more rare, and fit 12 songs into the setlist. \n5. Lady Gaga jumping from the roof (2017)Lady Gaga certainly knows how to make an entrance. The jump at NRG Stadium in Houston, Texas was prerecorded, but the live impact was still there. It was far from the most graceful dive, but that almost made it even better and so Lady Gaga.\n\n        \n            \n                Full list of every Super Bowl halftime performer in history: Bad Bunny to headline 2026 show at Super Bowl LX\n                \n                    Shanna McCarriston                \n            \n                            \n    \n                \n                    \n    \n4. U2 honoring 9/11 victims (2002)This was by far the most emotional halftime performance to date. The game was a few months after Sept. 11 and U2 took the opportunity and the stage to honor those lost in the tragedy. The 2002 show included a screen that showed the names of the victims. While the halftime show is often an upbeat celebration, the band recognized the moment and appropriately delivered a powerful performance.3. 'Indiana Jones' performance (1995)Patti LaBelle, Tony Bennett and actors portraying an \"Indiana Jones\" scene brought a performance that was slightly confusing, but epically entertaining. The 1995 performance had the typically \"Indiana Jones\" imagery and props, while mixing in some football aspects, including setting someone on fire and the actors holding up a replica Lombardi Trophy. It was perfectly chaotic.\n2. Diana Ross leaves in a helicopter (1996)There have been some incredible entrances to the halftime show stage, but Diana Ross owns the title for best exit. When her set was over, she took off in a helicopter. She sat with open arms in the open cabin and it not only was a wild moment, but also looked pretty dangerous. 1. Janet Jackson wardrobe mishap (2004)The most well known and infamous halftime moment is the one featuring Janet Jackson and Justin Timberlake. During the performance -- which also featured Kid Rock, P. Diddy and Nelly  Jackson -- Timberlake removed a piece of Janet's clothing, exposing her breast in a moment that will debated and discussed for years to come. Eighteen years later, Timberlake even penned an apology to Jackson for the scandalous moment.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking the 10 best Super Bowl halftime shows of all time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2022/02/14/94aa5ac8-45a4-4d58-afaf-62a5602641ed/thumbnail/1200x675/5698e99d7fd1d534f6e6f87976a2590b/gettyimages-1370397404.jpg"
      ],
      "datePublished": "2026-02-03T15:59:29.000Z",
      "dateModified": "2026-02-03T15:59:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who's performing at Super Bowl 2026? Full list of artists taking the stage - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-performers-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/27b10000-4c0c-4b9b-adf2-035ec54205f2/thumbnail/1200x675/87b565682f39dbf028a0c2b657293c6c/untitled-design-2025-12-09t201649-744.png",
    "tag": "Sports",
    "date": "2026-02-03T16:02:52.000Z",
    "description": "\n        The New England Patriots and Seattle Seahawks are the main attraction, but one thing is for sure -- the roster of singers on Super Bowl Sunda",
    "body": "\n        The New England Patriots and Seattle Seahawks are the main attraction, but one thing is for sure -- the roster of singers on Super Bowl Sunday are all stars in their own right. In addition to the announcement of Bad Bunny being named the featured halftime performer earlier this season, we know that Charlie Puth, Brandi Carlile and Coco Jones have been added to the list of singers for the big game on Sunday, February 8.The pregame entertainment will come ahead of the 6:30 p.m. ET kickoff on NBC and Peacock at Levi's Stadium and the halftime show will be after 30 minutes of play.The Bad Bunny announcement followed months of rumors and predictions, and was made in a subtle way back at the end of September. Headlining the Super Bowl halftime show is one of the top singing gigs of the year, and this was how the 31-year-old singer made the announcement on social media. \nThe Puerto Rican singer is the most-streamed artist in the world. Bad Bunny has 10 Grammy nominations, with three wins. His three Grammy wins are for Best Latin Pop or Urban Album for YHLQMDLG, Best Musica Urbana Album for El Último Tour Del Mundo and Un Verano Sin Ti.\nSome of his other awards include the American Music Award for Favorite Latin Artist, the BET Award for Single of the Year for his hit song \"I Like It\" with Cardi B and J Balvin and Billboard Top Latin.Bad Bunny's top songs are \"Vete,\" \"Titi Me Pregunto,\" \"Que Pasaria\" and \"BAILE INoLIDABLE.\" Usually the special guests are announced closer to the championship game. One early guess for a special guest is Cardi B, who is also connected to the NFL because she recently gave birth to boy, the son of Patriots receiver Stefon Diggs. \nRapper Kendrick Lamar, who brought out multiple special guests including SZA and Serena Williams, was last year's headliner. Some other iconic halftime performers include Prince, Beyoncé, Rihanna, Paul McCartney, U2 and Bruce Springsteen, just to name a few. The halftime show become a cultural moment for the masses as it is typically the most-watched performance of the year. But the day's festivities begin long before halftime. Multiple artists will perform ahead of the game, including Grammy-nominated singer Charlie Puth, 11x Grammy-winning artist Brandi Carlile and Grammy-winning R&B artist Coco Jones.\"Charlie, Brandi, and Coco are generational talents, and we are honored to have them -- alongside our extraordinary deaf performers -- on Super Bowl LX's world stage,\" said Desiree Perez, CEO of Roc Nation. \"This moment embodies the very best of culture, live performance, and our country, perfectly kicking off game day.\" \nHere's a look at who will perform each pregame song:\"The Star-Spangled Banner\"Charlie Puth and renowned Deaf music artist Fred Beam will perform the national anthem ahead of the big game. Puth is a multi-award winning and multi-platinum singer, songwriter and producer. His hits include \"See You Again,\" \"Attention\" and \"We Don't Talk Anymore.\" Beam is a actor, dancer, poet, educator, choreographer, director and visual artist.\"America the Beautiful\"Brandi Carlile and Deaf music performer Julian Ortiz will perform \"America the Beautiful.\" Carlile has an impressive resume that includes an Oscar nomination, two Emmy wins and a book that reached No. 1 on The New York Times' bestsellers list. \"Lift Every Voice and Sing\"\"Lift Every Voice and Sing\" will be performed by Coco Jones and renowned Deaf music artist Fred Beam. Jones has quickly made a name for herself in R&B music, with eight Grammy nominations. Her hit \"ICU\" is platinum certified. She is an actress as well as a musician.\nThe 60th edition of the Super Bowl will be played on Sunday, Feb. 8, 2026, on NBC. The backdrop of the game and performances will be Levi's Stadium in Santa Clara, California, home of the San Francisco 49ers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who's performing at Super Bowl 2026? Full list of artists taking the stage - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/27b10000-4c0c-4b9b-adf2-035ec54205f2/thumbnail/1200x675/87b565682f39dbf028a0c2b657293c6c/untitled-design-2025-12-09t201649-744.png"
      ],
      "datePublished": "2026-02-03T16:02:52.000Z",
      "dateModified": "2026-02-03T16:02:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gus Malzahn leaves lasting legacy as college football's innovative mad scientist - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/gus-malzahn-retirement-legacy-offensive-innovator/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/3cfc930f-ab3d-4377-b414-f7944c6a9031/thumbnail/1200x675/6eea34ca88440e0394a12d8c8edee027/gus-malzahn.png",
    "tag": "Sports",
    "date": "2026-02-03T16:00:10.000Z",
    "description": "\n        Gus Malzahn, who retired on Monday capping a 35-year career, told every player he ever coached how they'd change the sport together. It's on ",
    "body": "\n        Gus Malzahn, who retired on Monday capping a 35-year career, told every player he ever coached how they'd change the sport together. It's on Page 1 of any playbook of his you can find. The \"Who we are\" philosophy was tailored to a two-back run/play-action team that would keep constant pressure on the defense and opposing defensive coaches by executing the following ... Running the offense at a 2-minute pace the entire game (Physically and mentally wearing them down)Balanced attack (Take what the defense gives us)Having misdirection in the run and pass gameStretching the field vertically and horizontallyThrowing the book at them (Specials/unusual formations, fire alarms and wildcats)Presenting the option three different ways -- zone read, speed option, power read optionIn its essence, he ran a high school offense with more smoke and mirrors than military, pro-style precision. Like any coach that innovates, Malzahn was trying to solve a problem. His high school teams at Shiloh Christian Academy in the 1990s were effective on scripted, three-play spurts running at a no-huddle pace, but eventually they were forced to go back to conventional huddling and lost their edge when the game slowed down. Up-tempo offensive schemes prevent defenses from substituting and keep them relatively simple schematically. It can even the scales for an otherwise outtalented offense. He went to it in 1997 full time, and his Saints lost one game over the next three seasons. In 2003, Malzahn literally wrote the book on up-tempo offense entitled \"The Hurry Up, No Huddle: An Offensive Philosophy.\" He moved on to Springdale High School and built them into a state power before Houston Nutt called in 2006. Malzahn breaks through at ArkansasThe best offensive innovators make the seemingly simple look supremely complex, and nothing is ever new in football tactics. He dressed plays up with shifts, motions, and myriad alignments. The first bar to clear to stop a Malzahn offense was simply getting lined up correctly. Malzahn's offense leaned on concepts that had been run for a better part of a century and married them with what was en vogue in the aughts and 2010s: spread formations, zone read popularized by Rich Rodriguez's West Virginia teams, and hyper tempo where wordy West Coast offense play calls were replaced by emojis on placards. He played with tempo throughout his tenure, including the sugar huddle, a happy medium between breakneck pace and full on business meetings offenses would have between plays. \nMalzahn was brought to Arkansas by Nutt in 2006 in order to land, among others, five-star quarterback Mitch Mustain and help his own job security. We didn't get the full Malzahn offense then because Nutt wanted to huddle, but with Darren McFadden at running back (and sometimes Wildcat quarterback), the Hogs earned a trip to the SEC Championship Game in Malzahn's lone year as offensive coordinator. They haven't been back to Atlanta since, and whenever Arkansas changed coaches, his name was immediately at the top of any candidates list. By 2008, the \"Wild Hog\" offense had already begun to influence the NFL in a day that will live in infamy for the New England Patriots after the Miami Dolphins bamboozled them with the formation. Malzahn would move on to offensive coordinator stints at Tulsa and Auburn before a year as head coach on the conveyer belt of Arkansas State Sun Belt championships in the early 2010s. Then it was back to Auburn where his legend was cemented. Malzahn cements legacy at Auburn, gives Nick Saban fitsAs Auburn coach, Malzahn became the most intriguing foil for Nick Saban's Alabama dynasty. From 2013 to 2019, the only other team to beat Alabama in the regular season was Ole MIss. And if you include the postseason, only Clemson and Oklahoma are added to the list. It's not just that Auburn beat Alabama under Malzahn, it's how. Back when it took effectively an act of God to fell Saban's Crimson Tide, Malzahn was at the play-calling controls for two of the most iconic Iron Bowls ever. First, the \"Camback\" in 2010, where as an offensive coordinator he provided the canvas on which Cam Newton would paint a masterpiece battling back from 24 points down in Tuscaloosa for a Black Friday stunner to continue an improbable run to a national championship. Then, the Kick Six as head coach the week after a Hail Mary that beat Georgia. That 2013 Tigers team came one possession away from winning the national championship.\nEventually, however, defenses caught up to Malzahn and the magic ran out. In his first year ceding play calling to Chip Lindsey in 2017, Auburn was 60 minutes away from being the only two-loss team to make the field in the four-team College Football Playoff era. In a rematch against a Georgia team it had blown out earlier in the year, the Dawgs had their day and it proved to be the last high-water mark for Malzahn on The Plains. The buyout that seemed too expensive to pay was in fact funded by Auburn boosters, who by 2020 had seen enough. It made him an unfortunate trailblazer -- this time off the field. Since Malzahn faced off with Jimbo Fisher and Florida State in the 2013 BCS National Championship Game, the only coach to make the title game as a play-calling head man is Ryan Day in 2020. In the era of revenue sharing and the professionalization of the sport, CEO coaches will be more of the norm than mad football scientists, but Malzahn's impact will remain. Every time you see a team play six offensive linemen, or rip off a play every 15 seconds, or get tricky with a wildcat formation, think of the visor-wearing, never-swearing Arkansas man. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gus Malzahn leaves lasting legacy as college football's innovative mad scientist - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/3cfc930f-ab3d-4377-b414-f7944c6a9031/thumbnail/1200x675/6eea34ca88440e0394a12d8c8edee027/gus-malzahn.png"
      ],
      "datePublished": "2026-02-03T16:00:10.000Z",
      "dateModified": "2026-02-03T16:00:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]