[
  {
    "title": "NFL DFS, 49ers-Panthers: Top daily Fantasy picks for 'Monday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-49ers-panthers-draftkings-fanduel-daily-fantasy-picks-monday-night-football-lineup-advice/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/1dc240e9-9ef6-4a62-82af-d960abbcd68b/thumbnail/1200x675/24fb2a7bf5a2226f5b7a974faacf5562/george-kittle-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-24T18:25:10.000Z",
    "description": "\n        Teams on the fringe of the NFC playoffs will wrap up Week 12 as the San Francisco 49ers host the Carolina Panthers on 'Monday Night Football'",
    "body": "\n        Teams on the fringe of the NFC playoffs will wrap up Week 12 as the San Francisco 49ers host the Carolina Panthers on 'Monday Night Football' at 8:15 p.m. ET. The over/under in this matchup is 49.5. San Fran's offense runs through former Panthers standout Christian McCaffrey as daily Fantasy managers always have him top-of-mind when making NFL DFS picks. But the Niners also have the No. 2 passing offense, which makes Brock Purdy, Ricky Pearsall and George Kittle, all back in the lineup after recent injuries, desirable for NFL DFS lineups, despite their injury-plagued seasons. As for Carolina, its top-10 rushing attack makes the backfield tandem of Rico Dowdle and Chuba Hubbard an intriguing MNF DFS stack.Any NFL daily strategy must include affordable options to balance out the big names with big price tags. Can Bryce Young, coming off a 448-yard, 3-TD game, be one of those options amongst the NFL DFS player pool? Before making any NFL DFS picks for Buccaneers vs. Rams, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Monday Night Football'   and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Top NFL DFS picks for Panthers vs. 49ersPart of McClure's NFL DFS strategy is rostering Niners tight end George Kittle. Since coming off IR in October, Kittle has looked every bit like the six-time Pro Bowler he is. He has four touchdowns over his last four games, also averaging 5.8 receptions and 56.5 yards over this span. He's been the TE2 in Fantasy during this stretch and has at least five catches in all three career games versus Carolina. This year's Panthers have struggled defending tight ends, as just six teams have allowed more receiving yards to tight ends than Carolina, while only seven teams have allowed more touchdowns to the position. See who else to roster at SportsLine.Another of McClure's NFL DFS picks is Panthers RB Rico Dowdle, who is averaging over 100 scrimmage yards with three total touchdowns over his last three games. He's clearly unseated Chuba Hubbard as Carolina's No. 1 RB, as the latter hasn't had more than five carries over this three-game stretch. Dowdle entered Week 12 ranking fourth in rushing yards (833) and eighth in scrimmage yards (1,030), and one shouldn't overlook the impact he could have out of the backfield. He tied a career high with five catches last week, going for 55 yards, and only one team has allowed more receptions to running backs this year than San Fran. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set NFL DFS lineups for 'Monday Night Football'McClure is targeting another undervalued player who could explode for huge numbers on 'Monday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Monday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS, 49ers-Panthers: Top daily Fantasy picks for 'Monday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/1dc240e9-9ef6-4a62-82af-d960abbcd68b/thumbnail/1200x675/24fb2a7bf5a2226f5b7a974faacf5562/george-kittle-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2025-11-24T18:25:10.000Z",
      "dateModified": "2025-11-24T18:25:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Panthers prediction, odds, line: 'Monday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-panthers-prediction-odds-line-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/76866127-4bd0-4dc8-ac1f-b013d83eb93c/thumbnail/1200x675/f71c7906faf9f98b5e7c5e194cfe4da2/rico-dowdle-carolina-panthers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-24T16:54:31.000Z",
    "description": "\n        Teams hoping to finally put together a winning streak will meet on 'Monday Night Football' as the San Francisco 49ers host the Carolina Panth",
    "body": "\n        Teams hoping to finally put together a winning streak will meet on 'Monday Night Football' as the San Francisco 49ers host the Carolina Panthers. San Fran (7-4) has alternated wins and losses over its last nine games and is coming off a 41-22 victory over Arizona in Week 11. Carolina (6-5) has alternated wins and losses over its last five contests, most recently knocking off Atlanta, 30-27 in overtime, on Sunday. The Niners entered NFL Week 12 ranked seventh in the NFC standings, with the Panthers ninth. The Niners have gotten several key pieces back in the lineup in recent weeks with quarterback Brock Purdy, receivers Ricky Pearsall, Jauan Jennings and offensive tackle Trent Williams all available despite dealing with injuries earlier this season. Kickoff is at 8:15 p.m. ET from Levi's Stadium in Santa Clara, Calif. The Niners have won the last two matchups, with the most recent meeting coming in 2022. San Francisco is the 7.5-point favorite in the latest Panthers vs. 49ers odds, while the over/under for total points scored is 49.5 up two points from the opening 'MNF' line. Before making any 49ers vs. Panthers picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Carolina vs. San Francisco. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for 49ers vs. Panthers:Panthers vs. 49ers        spread49ers -7.5 at DraftKings SportsbookPanthers vs. 49ers             over/under49.5 pointsPanthers vs. 49ers             money line 49ers -403, Panthers +313Panthers vs. 49ers             picksSee picks at SportsLinePanthers vs. 49ers     streaming Fubo (Try for free)Why the Panthers can coverBryce Young has been one of the best quarterbacks versus the spread this season, going 7-2 ATS over his last nine starts. Carolina has covered in five of six games versus NFC opponents in 2025, and its MNF opponent has major defensive holes. The Niners can neither get to the quarterback nor take the ball away as they rank dead last in defensive sacks and also have the second-fewest picks. That should bring comfort to Young in the pocket, while he also has the league's No. 4 rusher in Rico Dowdle to lean on. Finally, there doesn't appear to be much of a home-field advantage for the 49ers who have eight giveaways versus just one takeaway at Levi's Stadium this year. See which team to back at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states:Why the 49ers can coverA finally healthy Brock Purdy showed what San Francisco is capable of last week as the Niners scored a season-high of 41 points after averaging just 22 on the season. The offense, however, runs through Christian McCaffrey, who leads the NFL in scrimmage yards and is on pace for 1,000-yard seasons both on the ground and through the air. George Kittle has also made an impact since coming off IR, with four scores over his last four games, and San won't see the most threatening of offenses come Monday. Carolina ranks 28th in scoring, with additional bottom-10 marks in passing offense, third down offense and yards per play. See which team to back at SportsLine. Check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make 49ers vs. Panthers   picksFor Panthers vs. 49ers   on 'Monday Night Football,' the model is leaning Over the total, projecting 52 combined points. It also says one side of the spread hits well over 50% of the time in an A-rated pick. See what it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.Who wins 49ers vs. Panthers, and which side of the spread hits in well over 50% of simulations in an A-rated pick? Visit SportsLine now to see which side of the Panthers vs. 49ers spread you need to jump, all from the model that is 48-33 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Panthers prediction, odds, line: 'Monday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/76866127-4bd0-4dc8-ac1f-b013d83eb93c/thumbnail/1200x675/f71c7906faf9f98b5e7c5e194cfe4da2/rico-dowdle-carolina-panthers-imagn-images.jpg"
      ],
      "datePublished": "2025-11-24T16:54:31.000Z",
      "dateModified": "2025-11-24T16:54:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for 49ers-Panthers on MNF, Rockets-Suns - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-free-nba-league-pass-49ers-panthers-mnf-rockets-suns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/51258e6a-6b4b-4b62-bac2-70c818ce3655/thumbnail/1200x675/a42d2aaff14a25143dffc16d2440b1f7/brock-purdy-san-francisco-49ers-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-11-24T17:43:47.000Z",
    "description": "\n        Brock Purdy takes the field for consecutive weeks for the first time this season for the San Francisco 49ers as they play the Carolina Panthe",
    "body": "\n        Brock Purdy takes the field for consecutive weeks for the first time this season for the San Francisco 49ers as they play the Carolina Panthers on Monday Night Football, and with the latest DraftKings promo code, new users receive $200 in bonus bets and three free months of NBA League Pass to bet on 49ers vs. Panthers or anything else on the Monday sports calendar. The 49ers are 7.5-point favorites after a 19-point win over the Cardinals last week, and with that, the SportsLine Projection Model has San Francisco covering the 7.5-point spread as one of its Monday best bets at DraftKings. The 49ers are 3-2 over their last five games, and each of the three wins came by at least 10 points. The model is also backing the Phoenix Suns as 6.5-point underdogs to cover against the Houston Rockets in NBA action, and one of SportsLine's top experts has a pick on No. 13 Gonzaga vs. No. 11 Alabama at the Players Era Festival in college basketball action to include in Monday best bets at DraftKings Sportsbook. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Monday best bets at DraftKings Sportsbook49ers (-7.5) vs. PanthersSuns (+6.5) vs. RocketsAlabama (+4.5) vs. GonzagaCombining the model's three picks into a Monday parlay at DraftKings would result in a payout of +593 (risk $100 to win $593). Bet it at DraftKings here:\n49ers (-7.5) vs. Panthers (-108)The 49ers haven't had many opportunities to showcase their full offense this season, and although it's still not at 100% healthy, it's as close as it may be this season. Last week, with Brock Purdy, Christian McCaffrey, George Kittle, Ricky Pearsall and Jauan Jennings all on the field together, San Francisco put up 41 points against the Cardinals. Purdy had three touchdown passes, and McCaffrey scored three times (twice rushing). Although the Panthers are 6-5 this season, they rank 28th in scoring at 18.8 points per game. Their limited offensive upside may struggle to keep pace with the 49ers, as the model projects San Francisco to cover the spread in 56% of simulations. Back the 49ers at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Suns (+6.5) vs. Rockets (-108)The Rockets travel to Phoenix on Monday, and they'll be without Kevin Durant, who is out for personal reasons, for what was supposed to be the future Hall of Famer's return to Phoenix. While the Rockets won't have the star they received in that trade, the Suns will have one of the key returns with Dillon Brooks getting the chance at some revenge against his former team. Brooks is averaging 21.4 ppg, forming a strong duo with Devin Booker, who is averaging 26.9 ppg this season. The Suns enter on a three-game winning streak and are 8-1 over their last nine games. Given their recent play and Durant being out, the model views 6.5 as too many points to give Phoenix, projecting the Suns to cover the spread in 68% of simulations. Back the Suns at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Alabama (+4.5) vs. Gonzaga (-115)Alabama takes on Gonzaga at the Players Era Festival in Las Vegas, with the Crimson Tide coming off a 90-86 win over No. 8 Illinois on Wednesday at a neutral site. \"I actually make Alabama the small favorite here,\" SportsLine expert Thomas Casale said. \"I'll take the 4.5 in a run-and-gun game that the Tide love to play. Bama has already beaten St. John's and Illinois and was tied with Purdue late. Give me the 4.5 points.\" Back Alabama at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:\nWant more Monday Night Football, NBA, college basketball picks?You've seen some of the model's Monday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for 49ers-Panthers on MNF, Rockets-Suns - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/51258e6a-6b4b-4b62-bac2-70c818ce3655/thumbnail/1200x675/a42d2aaff14a25143dffc16d2440b1f7/brock-purdy-san-francisco-49ers-imagn-images-2.jpg"
      ],
      "datePublished": "2025-11-24T17:43:47.000Z",
      "dateModified": "2025-11-24T17:43:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "J.J. McCarthy injury updates: Minnesota QB in concussion protocol after Week 12 loss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jj-mccarthy-concussion-minnesota-vikings-qb-week-13-status/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/861802c7-2e7a-4df8-b744-327f6c30bac6/thumbnail/1200x675/8373e406a0b30372cf3deb385a036461/adobe-express-file-99.jpg",
    "tag": "Sports",
    "date": "2025-11-24T19:16:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Minnesota Vikings quarterback J.J. McCarthy is in ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Minnesota Vikings quarterback J.J. McCarthy is in concussion protocol and his availability for Sunday's game against the Seattle Seahawks is in question, coach Kevin O'Connell announced Monday. If McCarthy is unable to go, rookie Max Brosmer would be in line to make his first career start. McCarthy apparently suffered the setback in Minnesota's 23-6 Week 12 loss to the Green Bay Packers. He was on the field for Minnesota's final drive late in the fourth quarter and threw an interception to Packers defensive back Evan Williams that allowed Green Bay to run the clock out. That was McCarthy's second interception of the game and 10th of the season. The former first-round pick also threw for a season-low 87 yards and posted a passer rating of 34.2, the worst of his career. McCarthy has thrown more interceptions than touchdowns in four of his six starts this season. He entered the 2025 season as Minnesota's starter after the Vikings let former quarterback Sam Darnold, who will suit up for the Seahawks on Sunday, walk in free agency. \nMcCarthy had three interceptions to two touchdowns in Minnesota's first two games before suffering a high ankle sprain that kept him sidelined for over a month. McCarthy returned on Nov. 2 and led the Vikings to a win against the Detroit Lions. The Vikings are 0-3 in their last three games with McCarthy leading the offense. McCarthy, who joined Minnesota as the 10th overall pick in the 2024 NFL Draft, also missed all of his rookie season after tearing his meniscus in his first preseason game with the Vikings. \nBrosmer signed with Minnesota in April 2025 as an undrafted free agent. The Minnesota product made his first appearance on Sept. 21 against the Cincinnati Bengals and has completed five of his eight passes for 42 yards this season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "J.J. McCarthy injury updates: Minnesota QB in concussion protocol after Week 12 loss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/861802c7-2e7a-4df8-b744-327f6c30bac6/thumbnail/1200x675/8373e406a0b30372cf3deb385a036461/adobe-express-file-99.jpg"
      ],
      "datePublished": "2025-11-24T19:16:26.000Z",
      "dateModified": "2025-11-24T19:16:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saints work out former Ravens kicker Justin Tucker after 10-game suspension, per reports - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/justin-tucker-saints-ravens-kicker-allegations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/a40a4ed4-191d-4caa-b5e0-5070bf38aa18/thumbnail/1200x675/68b21ce725d86c34ea95715a779eb057/justin-tucker.jpg",
    "tag": "Sports",
    "date": "2025-11-24T17:39:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Saints are holding kicker tryouts this week af",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Saints are holding kicker tryouts this week after their latest loss to the Falcons dropped them to 2-9 on the season, according to multiple reports. Among the names they are bringing in to New Orleans for a look is Justin Tucker, the former Ravens kicker who served a 10-game suspension to start this season for violating the NFL's personal conduct policy. Tucker is accused of inappropriate behavior by 16 massage therapists and was released by the Ravens this offseason after spending the entirety of his 13-year career in Baltimore. Tucker was once the best kicker in the league, but had serious struggles in 2024, hitting just 73.3% of his 30 field goal attempts for the Ravens. At 36 years old, there's reason to wonder if he has much left in his right leg that was at one point the most reliable in the NFL. On top of that, while Tucker is not facing any lawsuits or legal filings related to the accusations, any team signing him will have to be willing to take on the questions that will inevitably follow him about what led the league to suspend him after an investigation into the alleged inappropriate conduct. \nThe Saints, a team well outside playoff contention, seem like a strange choice to welcome that kind of scrutiny, but New Orleans will at least see what Tucker can bring on the field -- along with former Browns, Bengals and Commanders kicker Cade York -- before deciding if they want to sign him and take on the questions that would follow. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saints work out former Ravens kicker Justin Tucker after 10-game suspension, per reports - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/a40a4ed4-191d-4caa-b5e0-5070bf38aa18/thumbnail/1200x675/68b21ce725d86c34ea95715a779eb057/justin-tucker.jpg"
      ],
      "datePublished": "2025-11-24T17:39:55.000Z",
      "dateModified": "2025-11-24T17:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women's college basketball AP Top 25: UConn still No. 1 after eking by Michigan - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-college-basketball-ap-top-25-uconn-still-no-1-michigan-iowa-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/f0605403-335f-4e06-9be1-ecb792cba195/thumbnail/1200x675/5c4cd8bd64e8bedde18cc7f6a9c1e3e6/azzi-fudd-teyala-defosse-uconn-michigan.png",
    "tag": "Sports",
    "date": "2025-11-24T17:57:51.000Z",
    "description": "\n        UConn almost suffered its first loss of the season at the hands of Michigan, but a 31-performance by Azzi Fudd helped the Huskies remain unde",
    "body": "\n        UConn almost suffered its first loss of the season at the hands of Michigan, but a 31-performance by Azzi Fudd helped the Huskies remain undefeated and keep their No. 1 ranking in the AP Top 25.South Carolina, UCLA and Texas round up the top four, but they will all be tested this week at the Players Era championship in Las Vegas. Joining them will be Duke, a team that fell off the rankings last week and dug itself deeper into a hole after a loss to South Florida on Thursday. The Blue Devils are no longer receiving votes. No. 5 LSU has now scored 100+ points in six consecutive games, which set a new record for an SEC team. The previous one was five consecutive games, also held by Kim Mulkey's Tigers during the 2022-23 season, when they won the national championship. Coincidentally, the new record also matches the NCAA record set by the 1981-1982 Louisiana Tech team when Mulkey was a player.Although Michigan fell short against UConn, the Wolverines gave the Huskies a tough battle in the 72-69 loss and therefore stayed at No. 6.\nA week after Notre Dame suffered a 39-point loss to Michigan, the Fighting Irish bounced back with a 61-59 win over USC thanks to a clutch game-winner by Hannah Hidalgo. This result helped Notre Dame move up to No. 19 while the Trojans fell to No. 18. Another big winner this week was Iowa, who moved up to No. 11 thanks to a 57-52 win over then-No. 7 Baylor.NC State is a young team and the Wolfpack's inexperience has led them to a 3-3 record They took a big hit after getting upset 68-63 by Rhode Island on Sunday and are now down to No. 25.\nAP Women's Basketball Top 25RankTeamRecordPointsPrev.1UConn6-0797 (30)12South Carolina6-0758 (1)23UCLA6-0746 (1)34Texas5-070145LSU6-065956Michigan5-162767Maryland7-056598TCU6-0563109Oklahoma5-1561810Iowa State7-04751211Iowa6-04231912North Carolina5-14201413Ole Miss4-03791314Tennessee5-13741515Baylor5-1354716Kentucky7-03222017Vanderbilt6-02981718USC3-22841119Notre Dame4-12562420Michigan State6-02102221West Virginia6-01752322Washington5-01372523Louisville4-2892124Oklahoma State5-1711825NC State3-34316Others receiving votes: Stanford 36, South Dakota St. 24, Ohio St. 15, Richmond 10, Nebraska 10, Texas Tech 5, Princeton 4, South Dakota 3, Oregon 2, Kansas 2, Fairfield 2.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women's college basketball AP Top 25: UConn still No. 1 after eking by Michigan - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/f0605403-335f-4e06-9be1-ecb792cba195/thumbnail/1200x675/5c4cd8bd64e8bedde18cc7f6a9c1e3e6/azzi-fudd-teyala-defosse-uconn-michigan.png"
      ],
      "datePublished": "2025-11-24T17:57:51.000Z",
      "dateModified": "2025-11-24T17:57:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Caitlin Clark to make USA Basketball senior national team camp debut in December - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/caitlin-clark-usa-basketball-team-camp-paige-bueckers-angel-reese/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/e376bf05-9da2-4ff8-9c3e-8cc2e816d5b5/thumbnail/1200x675/293b891a4eedcb3c32cf0455be70b0b6/gettyimages-2225172185-1.jpg",
    "tag": "Sports",
    "date": "2025-11-24T18:16:19.000Z",
    "description": "\n        USA Basketball is set to hold its senior national team camp from Dec. 12-14, and Caitlin Clark is among the prominent stars who will make the",
    "body": "\n        USA Basketball is set to hold its senior national team camp from Dec. 12-14, and Caitlin Clark is among the prominent stars who will make their debuts on the training camp roster. The Indiana Fever superstar is one of 10 players set to participate in the senior camp for the first time. Paige Bueckers and Angel Reese will also debut at the three-day event, which will take place on campus at Duke.Cameron Brink, Sonia Citron, Veronica Burton, Kiki Iriafen and Rickea Jackson round out the WNBA players poised to play at the senior camp for the first time. From the college ranks, USC's JuJu Watkins and UCLA's Lauren Betts also picked up invitations. Watkins, who tore an ACL in last season's NCAA Tournament, will not partake in on-court activities but figures to benefit from the opportunity to work with and learn from the players and coaches in attendance.Among those rounding out the camp roster are former Olympic team members Kelsey Plum, Brittney Griner, Chelsea Gray, Jackie Young and Kahleah Copper. 3x3 Olympian Dearica Hamby earned an invitation, as well. Brionna Jones and Aliyah Boston will also return to the camp.The training camp invitations give the 18 players an opportunity to shine in front of the USA Basketball administrators and coaches, who will construct a roster next year for the 2026 FIBA World Cup. First-time national team coach, and coach of Duke's women's basketball team, Kara Lawson will lead the camp while WNBA coaches Natalie Nakase (Valkyries), Nate Tibbetts (Mercury) and Stephanie White (Fever) assist.\nTeam USA already qualified for the World Cup by way of its 2025 Women's AmeriCup title, but the squad will still participate in a qualifying tournament in Puerto Rico next March. The 11-time champions will seek their fifth consecutive World Cup crown when competition begins next September in Germany.Caitlin Clark injury statusClark missed the second half of the 2025 WNBA season with a groin injury and played in just 13 games as she battled multiple ailments during the campaign. It was a down year by her superstar standards even when she was on the court, as she shot just 27.9% from 3-point range. Her scoring was also down from 19.2 points per game as a rookie to 16.5 in her second professional season.With the Fever slowplaying Clark's return to action, she had still not progressed to playing 5-on-5 as recently as late October. Coach Stephanie White said the team will work Clark back up to full speed over the course of the offseason to prevent setbacks or regression in her recovery.\nWhat that means for Clark's availability at USA Basketball camp remains to be seen. Her goal remains to suit up for Team USA in the World Cup qualifiers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Caitlin Clark to make USA Basketball senior national team camp debut in December - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/e376bf05-9da2-4ff8-9c3e-8cc2e816d5b5/thumbnail/1200x675/293b891a4eedcb3c32cf0455be70b0b6/gettyimages-2225172185-1.jpg"
      ],
      "datePublished": "2025-11-24T18:16:19.000Z",
      "dateModified": "2025-11-24T18:16:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Burrow injury update: Bengals coach believes star QB will play vs. Ravens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/joe-burrow-injury-update-bengals-qb-thanksgiving-ravens/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/2d91baab-f18e-4d92-879c-98c4a328b9e0/thumbnail/1200x675/8e64918f3d2ad5b27042295a31c6d7ed/burrow25.jpg",
    "tag": "Sports",
    "date": "2025-11-24T19:38:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL's Thanksgiving slate got even more interes",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NFL's Thanksgiving slate got even more interesting with Bengals quarterback Joe Burrow now slated play Thursday night when Cincinnati visits Baltimore to face the Ravens. It will be Burrow's first game in nearly three months. Bengals coach Zac Taylor said on Monday that he anticipates Burrow playing for the first time since he underwent surgery following a Grade 3 turf toe injury that was sustained back in Week 2. Burrow returned to practice two weeks ago in a limited capacity and was a full practice participant during the Bengals' first two practices last week. Burrow also spoke on his status for Thursday night by posting an old image of himself wearing a LeBron James jersey on social media with the caption, \"He's back.\" Burrow himself said two weeks ago that playing in Baltimore would be \"very\" significant for him. Baltimore is where Burrow's season ended prematurely two years ago after he suffered a wrist injury that ultimately required surgery. \nThe top overall pick in the 2020 NFL Draft, Burrow led the Bengals to the Super Bowl in 2021, his first full season as the team's starting quarterback. He led Cincinnati to within a game of the Super Bowl the following season while garnering serious MVP consideration. Last year, Burrow won NFL Comeback Player of the Year for a second time after leading the NFL with 4,918 yards and 43 touchdowns. \nCincinnati (3-8) has won just one game since Burrow injured his toe during the team's win over the Jaguars. But despite his team's bleak playoff prospects, Burrow clearly feels compelled to play this season as long as he is physically able to do so, starting with Thursday night's game against the Ravens. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Burrow injury update: Bengals coach believes star QB will play vs. Ravens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/2d91baab-f18e-4d92-879c-98c4a328b9e0/thumbnail/1200x675/8e64918f3d2ad5b27042295a31c6d7ed/burrow25.jpg"
      ],
      "datePublished": "2025-11-24T19:38:04.000Z",
      "dateModified": "2025-11-24T19:38:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL on Thanksgiving schedule: Cowboys host Chiefs as part of triple-header - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-thanksgiving-schedule-packers-lions-cowboys-chiefs-triple-header/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/41768394-0b0f-4659-a1fa-83409d6d25d6/thumbnail/1200x675/e64ac7630392eb7cb3333e6ad9772b38/aidan-hutchinson-lions-packers-g.jpg",
    "tag": "Sports",
    "date": "2025-11-24T18:20:12.000Z",
    "description": "\n        We're now 13 weeks deep into the NFL season, and each and every game is taking on added importance as we get later and later into the year. A",
    "body": "\n        We're now 13 weeks deep into the NFL season, and each and every game is taking on added importance as we get later and later into the year. And while it's true that every single game technically matters just as much as any other when it comes to determining who will make the playoffs (or win tiebreakers or have a better draft selection) and have a chance to vie for the right to take the Lombardi Trophy away from the Eagles, there are some matchups that stand out above the others. And this year's Thanksgiving day slate has a few of them. As an annual tradition, the Detroit Lions and Dallas Cowboys will host games on Thanksgiving afternoon. But we've also got a potential barn-burner of a prime-time game on tap -- at least if we get some good news on the injury front for Joe Burrow. Read on below for details on the 2025 Thanksgiving slate.Green Bay Packers at Detroit LionsDate: Nov. 27 | Time: 1 p.m. ETLocation: Ford Field (Detroit, MI)TV: Fox | Streaming: fubo\nThis is a much-anticipated rematch of the Week 1 game wherein the Packers absolutely laid the smack down on the Lions. Detroit will surely have revenge on its mind for this one, while Green Bay will be looking to pull off another win and stake a claim to the division title.The Lions have played more Thanksgiving games than any other team, playing 85 times since 1934. They're 38-45-2 all time, but they finally got a win last year after losing each season from 2017 through 2023. Last year's game, of course, was notable for the clock-management abomination that resulted in then-Bears coach Matt Eberflus (now the defensive coordinator for the Cowboys) being fired. For the Lions, this game is part of a tough post-bye week schedule, wherein they play the Vikings (loss), Commanders (win), Eagles, Giants, Packers, Cowboys and Rams all in a row. That game against Dallas the week after Thanksgiving is also on \"Thursday Night Football.\"\nThe Packers, as many know, were once the Lions' annual opponent on Thanksgiving, playing them every year from 1951 through 1963. In their 38 total Thanksgiving games, the Packers are 16-20-2. They last played on Thanksgiving, well, last year. They beat the Dolphins 30-13 in the prime-time game. This will actually mark their third straight Thanksgiving game, as they played and beat the Lions 29-22 back in 2023. The game comes in the middle of a tough divisional stretch for the Packers, who play the Vikings in Week 12, Detroit in Week 13 and the Bears in Week 14. Kansas City Chiefs at Dallas CowboysDate: Nov. 27 | Time: 4:30 p.m. ETLocation: AT&T Stadium (Arlington, TX)TV: CBS | Streaming: Paramount+\nEven though the Cowboys are already only on the absolute fringes of playoff contention, this game is going to do monster viewership numbers. Dallas is always a ratings factory and the Chiefs are, right now, probably the second-biggest draw in the NFL -- and that's only if they haven't actually surpassed the Cowboys.Oh, and it should be a fascinating football matchup absolutely loaded with stars on both sides of the ball. Patrick Mahomes, Travis Kelce, Chris Jones, Rashee Rice, Dak Prescott, CeeDee Lamb, George Pickens, Quinnen Williams and more all on the same field at the same time? Yes, please. Sign me up.Dallas has played 57 Thanksgiving games in its history and has compiled a 34-22-1 all-time record. The Cowboys have won three Thanksgiving games in a row, with each of those victories coming against a divisional opponent: the Giants twice and Washington once. The last time they lost on Thanksgiving was in 2021, when they lost an overtime game to the Las Vegas Raiders while playing without both Lamb and Amari Cooper. \nThis game is part of a hellacious end-of-season sprint for the Cowboys, who face the Eagles, Chiefs, Lions, Vikings and Chargers all in a row before closing out the season against the Commanders and Giants.\n        \n            \n                Cover 32: Is Mike Tomlin's seat starting to heat up? Plus games balls, biggest gaffes from NFL Week 12\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nKansas City is 5-5 in its 10 Thanksgiving contests, but has not played on the holiday since 2006, when Larry Johnson rushed for 157 yards to lead the Chiefs to a win over the division-rival Broncos. That was also the first year that the league played a Thursday night game on Thanksgiving in addition to the games hosted by the Lions and Cowboys. The last time the Cowboys and Chiefs played on Thanksgiving was in 1995, with the Cowboys prevailing 24-12 behind an 11-catch, 121-yard game from Michael Irvin.\nCincinnati Bengals at Baltimore RavensDate: Nov. 27 | Time: 8:20 p.m. ETLocation: M&T Bank StadiumTV: NBC\nHere we have another big divisional matchup to match the one that gets the day started. The Bengals and Ravens played two of the most entertaining games of the 2024 season, and here's hoping we get treated to a rematch on Thanksgiving night. At the very least, here's hoping we get to see Joe Burrow back in action for this game, as Week 13 has been targeted as a potential return date for the injured quarterback. (Even if we don't, the Joe Flacco-led Bengals offense is pretty exciting, and could provide some fireworks here.)The Bengals have played just one Thanksgiving game in their history, losing 26-10 to the Jets in 2010 in what was a rematch of the playoff game the two teams played the year before. The Bengals have an interesting stretch of schedule beginning with this game, as they travel to Baltimore before heading to Buffalo to take on the Bills and then return home to host the Ravens again in Week 15.The Ravens have played just twice on Thanksgiving, winning each of their games in 2011 and 2013. The last time they played was when they took on the Steelers back in 2013, with the Ravens entering as the defending Super Bowl champions. Baltimore hosts the Steelers in between these two games against Cincinnati. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL on Thanksgiving schedule: Cowboys host Chiefs as part of triple-header - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/41768394-0b0f-4659-a1fa-83409d6d25d6/thumbnail/1200x675/e64ac7630392eb7cb3333e6ad9772b38/aidan-hutchinson-lions-packers-g.jpg"
      ],
      "datePublished": "2025-11-24T18:20:12.000Z",
      "dateModified": "2025-11-24T18:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chelsea vs. Barcelona UCL prediction, odds, best bets from proven expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/chelsea-vs-barcelona-prediction-start-time-best-bets-for-tuesdays-ucl-match-from-proven-expert/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/46c4d028-e126-48c5-826a-b4806fbdf05b/thumbnail/1200x675/8401f41c5a01e153ffdf10b15d003eec/pedroneto.jpg",
    "tag": "Sports",
    "date": "2025-11-24T19:13:45.000Z",
    "description": "\nChelsea and Barcelona meet Tuesday, Nov. 25 in Champions League play with both sides looking to recover from draws in their last UCL matches. Chelsea",
    "body": "\nChelsea and Barcelona meet Tuesday, Nov. 25 in Champions League play with both sides looking to recover from draws in their last UCL matches. Chelsea rested many of its top players against Azerbaijani side Qarabag and came away with a 2-2 draw, while Barcelona battled to a 3-3 result against Club Brugge. Both teams have accumulated seven points in Champions League play and Barcelona are only ahead of Chelsea on goal differential.Kickoff from Stamford Bridge in London is set for 3 p.m. ET on Tuesday, Nov. 25. The match will stream on Paramount+. Click here to sign up and watch Chelsea vs. Barcelona on Paramount+, along with every other Champions League match.Chelsea are slight +135 favorites (wager $100 to win $135) in the latest Chelsea vs. Barcelona odds at DraftKings Sportsbook, while the visitors are +170 (wager $100 to win $170). A draw comes in at +300. For the latest Chelsea vs. Barcelona odds and model picks, head to SportsLine. After working in the sports betting industry for several years, Green became a professional sports writer and handicapper and has covered the game worldwide. Last year, Green was profitable in multiple areas on his soccer betting picks, including Euro qualifying (+6.30 units), EFL Cup (+4.47), FA Cup (+3.07) and Champions League (+3.05), among others. Anyone who follows him could be way up.    Here are Green's best bets and analysis   for Chelsea vs. Barcelona on Tuesday.Chelsea vs. Barcelona picksChelsea draw no bet (-130): 1uOver 3.5 goals (+100): 0.5uPedro Neto Over 1.5 shots on target (-107): 0.5uChelsea will aim to get their Champions League campaign back on track when they host Barcelona at Stamford Bridge on Tuesday. The Blues slipped down to 12th in the group stage table after drawing 2-2 with Qarabag last time out. Manager Enzo Maresca rested several key players for that game, and Chelsea ultimately paid the price. He certainly won't make the same mistake against Barcelona. They're one of the best teams in Europe, so Maresca should field his strongest starting XI. It promises to be an entertaining game as both teams struggle defensively, but they're stacked with attacking talent.Neto and Fernandez keep Chelsea tickingChelsea moved up to second in the Premier League table after securing a routine 2-0 away win against Burnley at the weekend. The Blues are on a three-game winning streak in the league, and they're unbeaten in their last five matches. Star player Cole Palmer has  been out injured for most of the season and he'll miss this game after breaking his toe. Fortunately, his teammates have stepped up. Winger Pedro Neto and midfielder Enzo Fernández both scored in the win against Burnley. They're the club's joint top scorers this season with four goals apiece. João Pedro also has four goals, while Moisés Caicedo has found the back of the net three times. Defenders Trevoh Chalobah, Reece James, Malo Gusto, and Josh Acheampong have all chipped in with vital goals, along with forwards Estêvão and Alejandro Garnacho. Liam Delap has now recovered from an injury, and former Barcelona striker Marc Guiu offers another solid option in attack. Chelsea boast a great deal of firepower, so they should be able to exploit Barcelona's defensive weaknesses. Barça have conceded 15 goals in 13 La Liga games this season and they've also conceded seven times in four Champions League matches.However, Chelsea are also vulnerable in defense. Levi Colwill is injured, so Maresca normally pairs Chalobah with Toisin Adarabioyo at center back. They never look entirely convincing. The Blues have conceded four goals in six Champions League matches, and they concede about a goal per game in the Premier League on average. It's hard to see them keeping the likes of Lamine Yamal and Robert Lewandowski at bay for 90 minutes, so this should be a high-scoring match.Barcelona might be Europe's most entertaining teamBarcelona also dropped points in their last Champions League game. They comprehensively outplayed Club Brugge in Belgium but defensive lapses cost them, and the game finished 3-3. They bounced back by beating Celta Vigo 4-2 in a league match, and they then thrashed Athletic Club 4-0 on Saturday. They've fired in 36 goals in 13 La Liga games this season, which is a remarkable record.However, the defense has been their Achilles' heel. They've only kept one clean sheet in their last 11 games, which is concerning. They play a high defensive line, and pacy wingers like Neto and Jamie Gittens could exploit it. Barcelona are arguably the most entertaining team in Europe. Their last six games have seen 30 goals - an average of five per game - and we've seen 4.8 goals per game in their last 20 Champions League matches. Key midfielder Pedri is likely to miss this game, so Marc Casado could partner Frenkie de Jong in the middle of the park. They'll have their work cut out against Caicedo and Fernández, two of the best midfielders in the world. The team that wins the midfield battle should go on and win this game. It could be tight as these teams look evenly matched. They're level on points in the Champions League group, they're both flying in their domestic leagues and both have extremely talented players in most positions.Ultimately, home field advantage could swing things in Chelsea's favor. The Blues have won both Champions League matches at Stamford Bridge this season. They'll face a much sterner test of their mettle against Barcelona but they could ultimately prevail if Caicedo and Fernández grab this game by the scruff of the neck.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chelsea vs. Barcelona UCL prediction, odds, best bets from proven expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/46c4d028-e126-48c5-826a-b4806fbdf05b/thumbnail/1200x675/8401f41c5a01e153ffdf10b15d003eec/pedroneto.jpg"
      ],
      "datePublished": "2025-11-24T19:13:45.000Z",
      "dateModified": "2025-11-24T19:13:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arkansas assistant Chris Wilson struck player in locker room; school claims 'joking around' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arkansas-coach-chris-wilson-strikes-player-locker-room-joking-around/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/7121252b-f7d9-4b6a-8588-d9aa73a9b6f6/thumbnail/1200x675/0f92329b4933b50d2f7942c19add7dd7/chriswilsonarkansas.jpg",
    "tag": "Sports",
    "date": "2025-11-24T17:16:35.000Z",
    "description": "\n        Arkansas interim defensive coordinator Chris Wilson struck a player in the face during an incident in the football locker room in mid-October",
    "body": "\n        Arkansas interim defensive coordinator Chris Wilson struck a player in the face during an incident in the football locker room in mid-October, seven sources tell CBS Sports. The strike left the player with a bloodied lip. Arkansas carried out an investigation of the incident after an anonymous tip. CBS Sports has since spoken with more than a dozen people close to the program and the affected player to better understand what happened in the locker room of a team that fired its coach and racked up a 2-9 record to stand last place in the SEC.CBS Sports is protecting the player's anonymity due to the sensitivity of the story.The incident allegedly began when the 56-year-old Wilson called the player an expletive in the locker room. After the player asked to whom Wilson was speaking, Wilson allegedly doubled down.  \nThe two sides then squared up, seemingly as a joke. Multiple sources say Wilson swung at least once -- one source says Wilson swung twice, another source said the player may have swung first -- connecting with the player's face with enough force to cause bleeding. Wilson left in a huff. The player sought Wilson out elsewhere in the football facility, a source said, to gain an understanding of what happened. Wilson told the player that he had just been messing around. CBS Sports sent multiple requests for comment to Arkansas athletics director Hunter Yurachek, all of which were denied over a 10-day period. On Nov. 23, the school provided the following statement to CBS Sports when presented with eight questions about the incident:\n\"Our athletic department quickly looked into the matter, conducting independent interviews with the interim head coach, as well as the coach and player allegedly involved. Those conversations revealed the same recounting of the situation, in which both the coach and player said they were joking around. With everyone on the same page concerning the situation, the athletic department considers the matter closed with no further action necessary.\" Arkansas leadership met with the player roughly one week after the incident, a source told CBS Sports. Leadership asked whether the skirmish between the player and Wilson was the two men messing around.The player concurred. However, multiple sources with knowledge of the incident indicated Wilson was heated when leaving the locker room, making another derogatory comment as he departed. Wilson, who had most recently coached in the UFL with the Houston Roughnecks, joined the Arkansas staff over the summer as assistant defensive line coach. He was promoted by interim coch Bobby Petrino to interim defensive coordinator on Sept. 29 after Petrino fired defensive coordinator Travis Williams.Petrino assumed his position on Sept. 28 after Arkansas fired coach Sam Pittman.  \nThe Razorbacks (2-9, 0-7 SEC) conclude their season Friday against Missouri (7-4, 3-4 SEC). Arkansas' widespread coaching search includes Petrino, who also was the team's coach from 2008-12. CBS Sports' Richard Johnson contributed to this story \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arkansas assistant Chris Wilson struck player in locker room; school claims 'joking around' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/7121252b-f7d9-4b6a-8588-d9aa73a9b6f6/thumbnail/1200x675/0f92329b4933b50d2f7942c19add7dd7/chriswilsonarkansas.jpg"
      ],
      "datePublished": "2025-11-24T17:16:35.000Z",
      "dateModified": "2025-11-24T17:16:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rockies retain interim manager Warren Schaeffer under new executive Paul DePodesta - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/rockies-retain-interim-manager-warren-schaeffer/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/4c1cd7e2-afb8-4bfe-b6df-05de48b927e4/thumbnail/1200x675/dc5f781480b0dd3991a92b727c3d3e5e/schaeffer-getty.png",
    "tag": "Sports",
    "date": "2025-11-24T18:09:05.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Colorado Rockies will bring back Warren Schaef",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Colorado Rockies will bring back Warren Schaeffer as their manager for 2026 and beyond, the club announced on Monday. Schaeffer, 40, had served on an interim basis after longtime manager Bud Black was dismissed 40 games into what turned out to be one of the worst team seasons in Major League Baseball history. The Rockies wound up going 43-119. Those 119 losses are tied with the 2003 Tigers for the third most since 1900. Under Schaeffer the Rockies went 36-86 over the remainder of the season. While that's a winning percentage of just .295, it's quite an improvement over the team's .175 mark at the time Schaeffer was hired. The move comes as a bit of a surprise, as the Rockies waited for some time to remove Schaeffer's interim tag, and because of that time interval the expectation was that they would hire from outside the organization. However, the Rockies in early November brought former Dodgers general manager Paul DePodesta on as their president of baseball operations. The manager hire was thus DePodesta's decision and, after a period of evaluation, he presumably decided Schaeffer was the best option. \nSchaeffer in 2026 will lead a roster in flux and also one that again projects as the worst in baseball. Now, though, he'll be working under a front office that's committed to modernizing the Rockies, at least relative to the organization's prior standards. Overall, the Rockies have endured seven straight losing seasons and three straight 100-loss seasons. \nWith the appointment of Schaeffer to the permanent job in Colorado, all MLB managerial vacancies have now been filled. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rockies retain interim manager Warren Schaeffer under new executive Paul DePodesta - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/4c1cd7e2-afb8-4bfe-b6df-05de48b927e4/thumbnail/1200x675/dc5f781480b0dd3991a92b727c3d3e5e/schaeffer-getty.png"
      ],
      "datePublished": "2025-11-24T18:09:05.000Z",
      "dateModified": "2025-11-24T18:09:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chauncey Billups pleads not guilty: Where Terry Rozier, Damon Jones cases stand - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/chauncey-billups-conspiracy-charges-terry-rozier-damon-jones-arrests/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/f35721a4-00ab-444b-ba66-ad5d5039fe4d/thumbnail/1200x675/67c4279f7ae576ab90465bfb7d65c943/gettyimages-2248205484-1.jpg",
    "tag": "Sports",
    "date": "2025-11-24T17:34:49.000Z",
    "description": "\n        Suspended Portland Trail Blazers coach Chauncey Billups appeared at a federal courthouse in New York on Monday for his arraignment in the cri",
    "body": "\n        Suspended Portland Trail Blazers coach Chauncey Billups appeared at a federal courthouse in New York on Monday for his arraignment in the criminal case that accuses him of illegal gambling. The Hall of Famer pleaded not guilty to charges of wire fraud conspiracy and money laundering conspiracy that stem from his alleged involvement in rigged poker games tied to the mafia. The charges carry maximum punishments of 20 years in prison if convicted.The judge at the Brooklyn courthouse set Billups' bail at $5 million. He used his Colorado house as collateral, and his wife and daughter co-signed the bond.Billups is one of 31 defendants in the case and among the multiple NBA figures arrested as a result of the FBI's investigation into illegal gambling. Authorities also took Miami Heat guard Terry Rozier and former NBA player Damon Jones into custody last month for their alleged crimes. Other defendants were expected to appear in court on Monday as the court discusses next steps in the case.The accusations against Billups state that the Trail Blazers coach lured high-net worth individuals into rigged poker games. The games included rigged shuffle machines, X-ray tables that could read face-down cards and contact lenses and eyeglasses used to read premarked cards.\nIn a separate case, Billups may also be tied to sharing inside information with bettors as a coach. While he was not named in the indictment for illegal sports betting, a person referred to as \"Co-Conspirator 8\" matches his description.Billups' attorney previously described the former NBA star as a \"man of integrity\" and denied the charges.\"To believe that Chauncey Billups did what the federal government is accusing him of is to believe that he would risk his hall-of-fame legacy, his reputation, and his freedom,\" attorney Chris Heywood said. \"He would not jeopardize those things for anything, let alone a card game.\n\"Furthermore, Chauncey Billups has never and would never gamble on basketball games, provide insider information, or sacrifice the trust of his team and the League, as it would tarnish the game he has devoted his entire life to.\"The NBA suspended Billups, and Tiago Splitter continues to serve as interim coach in his absence.Damon Jones pleads not guiltyJones pleaded not guilty on Nov. 6 to two charges stemming from his involvement in the gambling scandal. The former player was released on $200,000 and prohibited from gambling or making contact with organized crime.\nJones faces charges in both cases. He is alleged to have provided insider information to a co-conspirator, who then placed wagers on NBA games, and is also accused of luring other athletes into the mafia's rigged poker games. Jones allegedly took a cut of the money from those poker games as compensation for his role.In the sports betting case, Jones allegedly sent a text to a co-conspirator on Feb. 9, 2023, in which he says, \"Get a big bet on Milwaukee before the information is out! [Player 3] is out tonight.\" Notably, LeBron James missed the Los Angeles Lakers' game against the Bucks that night.Terry Rozier awaits arraignmentRozier is due in court on Dec. 8 for his arraignment. The Heat guard was arrested in connection with the sports betting case -- specifically for his involvement in the March 23, 2023 game between the Charlotte Hornets and New Orleans Pelicans.\nThe former Hornets guard allegedly pulled himself from the game as part of a preplanned move with the gambling ring. He played just 10 minutes before leaving the game with a foot injury. Sportsbooks received $200,000 in wagers on prop bets for Rozier's points, rebounds and assists. He was charged with conspiracy to commit wire fraud and conspiracy to commit money laundering.Rozier met with the FBI and NBA on multiple occasions in 2023 when the investigation began. He maintained his innocence throughout the probe, and the league conducted its own investigation in January 2025 but did not find sufficient evidence to fire or suspend him.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chauncey Billups pleads not guilty: Where Terry Rozier, Damon Jones cases stand - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/f35721a4-00ab-444b-ba66-ad5d5039fe4d/thumbnail/1200x675/67c4279f7ae576ab90465bfb7d65c943/gettyimages-2248205484-1.jpg"
      ],
      "datePublished": "2025-11-24T17:34:49.000Z",
      "dateModified": "2025-11-24T17:34:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "President Trump praises Shedeur Sanders after Browns QB gets first win - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/president-donald-trump-shedeur-sanders-browns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/35bab442-f8b4-4d60-b749-fd02f41b5430/thumbnail/1200x675/59e7aed20a4bedbf12bedb54f76ca664/sandersweek12.jpg",
    "tag": "Sports",
    "date": "2025-11-24T18:52:35.000Z",
    "description": "\n        Shedeur Sanders' performance in his first NFL start is giving many of his supporters a chance to take a long-awaited victory lap. That includ",
    "body": "\n        Shedeur Sanders' performance in his first NFL start is giving many of his supporters a chance to take a long-awaited victory lap. That includes President Donald Trump, who praised the Browns' rookie quarterback following Sunday's 24-10 win over the Raiders. Sanders, who made his regular season debut a week earlier, went 11 of 20 for 209 yards with a touchdown and an interception against the Raiders. His memorable day included a 66-yard touchdown pass to Dylan Sampson that made it a 24-3 game midway through the fourth quarter. \"Shedeur Sanders was GREAT,\" Trump wrote on Truth Social. \"Wins first game, career start, as a pro (for Cleveland). Great Genes. I TOLD YOU SO!\"This isn't the first time that Trump has publicly backed Sanders. During the 2025 NFL Draft, Trump criticized NFL owners after Sanders wasn't selected in the first round. Sanders ultimately fell to the fifth round before the Browns took him with the 144th pick. \n\"He should be 'picked' IMMEDIATELY by a team that wants to WIN,\" Trump wrote at the time. While he's clearly made the President happy, Sanders also provided Browns fans with a glimmer of hope amid another trying season. \nOn Sunday, Sanders became the first Browns quarterback this century to win his first career start, an achievement that he is clearly hoping to parlay into a long and successful tenure in Cleveland. \"I'm just thankful,\" Sanders told CBS Sports' Tiffany Blackmon afterward. \"I think I showed a couple of great pieces. Some things I wish I could get back, but, man, a win is crazy. It's amazing, you know, off of one week of practice! So imagine what a full offseason would look like. It could get dangerous. ... But I'm just truly thankful that everything happened.\" \nTrump and the rest of Sanders' fans received some good news on Monday, as Sanders will reportedly start in Cleveland's upcoming game against the 49ers in what will be Sanders' first career home start. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "President Trump praises Shedeur Sanders after Browns QB gets first win - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/35bab442-f8b4-4d60-b749-fd02f41b5430/thumbnail/1200x675/59e7aed20a4bedbf12bedb54f76ca664/sandersweek12.jpg"
      ],
      "datePublished": "2025-11-24T18:52:35.000Z",
      "dateModified": "2025-11-24T18:52:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' prediction, odds: 49ers vs. Panthers picks from expert on 18-4 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-line-spread-49ers-panthers-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/1afa5512-e10f-4190-a743-eff4c99fd0ee/thumbnail/1200x675/18ae175392c6814e5be0324057196131/purdy-imagn.jpg",
    "tag": "Sports",
    "date": "2025-11-24T17:09:50.000Z",
    "description": "\n        Teams looking to stay in the mix in their respective divisions clash when the Carolina Panthers battle the San   Francisco 49ers on 'Monday N",
    "body": "\n        Teams looking to stay in the mix in their respective divisions clash when the Carolina Panthers battle the San   Francisco 49ers on 'Monday Night Football.' Carolina is coming off a 30-27 overtime win over the Atlanta Falcons, while San Francisco rolled to a 41-22 win over the Arizona Cardinals in Week 11. The Panthers (6-5), who are second in the NFC South, are 3-3 on the road this season. The 49ers (7-4), who are third in the NFC West, are 2-2 on their home field in 2025.Kickoff from Levi's Stadium in Santa Clara, Calif., is set for 8:15 p.m. ET. San   Francisco is a 7.5-point favorite in the latest Panthers vs. 49ers odds, while the over/under for total points scored is 49.5. Before you make any 49ers vs. Panthers picks, make sure you check out what SportsLine NFL expert Micah Roberts has to say, given his mastery of picks in games involving the 49ers. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:Micah Roberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. Most importantly, Roberts has a read on the pulse of the 49ers. He is 18-4 (+1360) on his last 22 against-the-spread picks in games involving San Francisco. Anyone who has followed him could be way up.Now, Roberts has zoned in on Panthers vs. 49ers. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Niners vs. Panthers:Panthers vs. 49ers         spreadSan Francisco -7.5 at DraftKings SportsbookPanthers vs. 49ers         over/under49.5 pointsPanthers vs. 49ers         money line San   Francisco -403, Carolina +313Panthers vs. 49ers         picksSee picks at SportsLinePanthers vs. 49ers         streaming Fubo (Try for free)New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make 49ers vs. Panthers  picksFor Monday night's matchup, Roberts is going Over on the total. The Panthers have gone Over in six of their past 10 games, while the 49ers have seen the over go 7-2-1 in their past 10 games. The teams have combined for 49 or more points in three of their last four matchups. Bryce Young is coming off a monster performance in the win over Atlanta, throwing for 448 yards and three touchdowns. Brock Purdy had three touchdown passes in the win over Arizona. Roberts has also found a critical x-factor that has him jumping on one side of the spread. You can see what it is at SportsLine, and get your first month at SportsLine for just $1 when you use promo code CHAMPIONSHIP.Who covers in Panthers vs. 49ers and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the 49ers vs. Panthers spread you need to jump, all from the expert who returned $1,360 to $100 players over his last 22 San Francisco picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' prediction, odds: 49ers vs. Panthers picks from expert on 18-4 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/1afa5512-e10f-4190-a743-eff4c99fd0ee/thumbnail/1200x675/18ae175392c6814e5be0324057196131/purdy-imagn.jpg"
      ],
      "datePublished": "2025-11-24T17:09:50.000Z",
      "dateModified": "2025-11-24T17:09:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]