[
  {
    "title": "NFL DFS picks, daily Fantasy lineup advice for Eagles vs. Chargers on 'Monday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-eagles-chargers-daily-fantasy-picks-lineups-advice-monday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/c92046c2-145d-4f1c-b47a-85ec144955a6/thumbnail/1200x675/8f5b3ad92c44b2d0ad8c63a3690bbf8e/jalen-hurts-philadelphia-eagles-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-08T17:18:46.000Z",
    "description": "\n        NFL Week 14 concludes with a 'Monday Night Football' matchup between a couple of 8-4 teams with the Philadelphia Eagles visiting the Los Ange",
    "body": "\n        NFL Week 14 concludes with a 'Monday Night Football' matchup between a couple of 8-4 teams with the Philadelphia Eagles visiting the Los Angeles Chargers at 8:15 p.m. ET. The over/under is 41.5, so point could be tough to come by. Top NFL DFS picks for this contest include Jalen Hurts, Saquon Barkley, A.J. Brown, Kimani Vidal and Keenan Allen. Anyone experienced with fielding NFL DFS lineups, however, knows that finding the right balance between highly priced stars and economical options is a must. Thus, perhaps your daily Fantasy football strategy may consider Chargers rookie tight end Oronde Gadsden for MNF DFS lineups?The fifth-round pick has the sixth-most Fantasy points amongst tight ends since Week 6. It may be helpful NFL DFS advice to also know that Philly has allowed touchdowns to tight ends in successive weeks. Before making any Eagles vs. Chargers NFL DFS picks on sites like FanDuel or DraftKings for 'Monday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Monday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Chargers vs. EaglesOne of McClure's top NFL DFS picks for 'Monday Night Football' is Eagles quarterback Jalen Hurts. He's coming off a productive defeat on Black Friday in which he had his first game of the year with at least 230 yards and two touchdowns through the air, plus at least 30 yards on the ground. Hurts is running more as of late, with 30+ yards rushing in three straight, and his eight scores on the ground rank seventh in the NFL. Hurts' running could be a weapon versus L.A. as just two teams have allowed more rushing TDs to opposing quarterbacks. See who else to roster at SportsLine.McClure is also rostering Chargers receiver Ladd McConkey, who has been one of the most productive wideouts after a slow start. Since Week 5, McConkey ranks 11th amongst wide receivers in Fantasy points. Over this stretch of eight games, McConkey has either 56 yards or a touchdown in seven of them, so he supplies a high Fantasy floor. Meanwhile, Philly has allowed three wideouts to have 75+ yards over the last three weeks, with two of them also scoring touchdowns. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set 'Monday Night Football' NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Monday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Monday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, daily Fantasy lineup advice for Eagles vs. Chargers on 'Monday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/c92046c2-145d-4f1c-b47a-85ec144955a6/thumbnail/1200x675/8f5b3ad92c44b2d0ad8c63a3690bbf8e/jalen-hurts-philadelphia-eagles-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-08T17:18:46.000Z",
      "dateModified": "2025-12-08T17:18:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' odds, prediction, spread: Eagles vs. Chargers picks from expert on 29-15 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-spread-time-eagles-chargers-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/89d1c03c-61af-43cc-9f25-cf98c94ad707/thumbnail/1200x675/a383cb3f45e53278dd09371519e9a63f/jalen-hurts.png",
    "tag": "Sports",
    "date": "2025-12-08T17:15:32.000Z",
    "description": "\n        The defending Super Bowl champion Philadelphia Eagles look to snap a two-game losing streak when they take on the Los Angeles Chargers on 'Mo",
    "body": "\n        The defending Super Bowl champion Philadelphia Eagles look to snap a two-game losing streak when they take on the Los Angeles Chargers on 'Monday Night Football.' Philadelphia is coming off a 24-15 loss to the Chicago Bears on Nov. 28, while Los Angeles downed the Las Vegas Raiders 31-14 on Nov. 30. The Eagles (8-4), who lead the NFC East, are 4-2 on the road this season. The Chargers (8-4), who are second in the AFC West, are 5-2 on their home field. Quarterback Justin Herbert (hand) and running back Omarion Hampton (ankle) are both listed as questionable for the Chargers.Kickoff from SoFi Stadium in Inglewood, Calif., is set for 8:15 p.m. ET. The Eagles are 2.5-point favorites in the latest Eagles vs. Chargers odds from SportsLine consensus, while the over-under for total points scored is 41.5. Before making any Chargers vs. Eagles picks, make sure you check out what SportsLine expert, Emory Hunt, has to say. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins:Hunt is the founder and CEO of Football Gameplan, which has been supplying analysis of all levels of football since 2007, and a former running back at Louisiana-Lafayette. He knows the game from a player's perspective. He went 88-67-2 (+1474) on all NFL picks in his past two full season. He is also 29-15-2 (+1215) on his last 46 against-the-spread picks in Philadelphia Eagles games. Anyone who has followed him could be way up.Now, Hunt has zoned in on Eagles vs. Chargers. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Eagles vs. Chargers:Eagles vs. Chargers                     spreadPhiladelphia -2.5 at DraftKings SportsbookEagles vs. Chargers                     over/under41.5 pointsEagles vs. Chargers                     money line Philadelphia -134, Los   Angeles +114Eagles vs. Chargers                     picksSee picks at SportsLineEagles vs. Chargers                     streaming Fubo (Try for free)   Why the Eagles can coverVeteran quarterback Jalen Hurts helps lead the Philadelphia offense. In 12 games, he has completed 66.1% of his passes for 2,514 yards and 19 touchdowns with just two interceptions and a rating of 103.9. He has also carried 84 times for 329 yards (3.9 average) and eight touchdowns. In a 24-21 loss at Dallas on Nov. 23, he completed 27 of 39 passes for 289 yards and one touchdown, while rushing seven times for 33 yards (4.7 average) and two touchdowns.Among his top targets is fifth-year veteran wide receiver DeVonta Smith. In 12 games, he has 60 receptions for 802 yards (13.4 average) and three touchdowns. He has 11 explosive plays of 20 yards or more, including a long of 79, with 230 yards after the catch and 34 first-down conversions. In a 10-7 win over the Green   Bay Packers on Nov. 10, he caught four passes for 69 yards and a score. See which team to back at SportsLine. Why the Chargers can coverVeteran quarterback Justin Herbert (hand, questionable) is hoping to play in this primetime spot. In 12 games, he has completed 66.9% of his passes for 2,842 yards and 21 touchdowns with 10 interceptions and a 94.9 rating. He has also rushed 57 times for 353 yards (6.2 average) and one touchdown.Second-year receiver Ladd McConkey is among Herbert's top pass catchers. In 12 games, he has 58 receptions for 683 yards (11.8 average) and five touchdowns. He has six explosive plays of 20 yards or more, including a long of 58, with 274 yards after the catch and 31 first-down conversions. He had four receptions for 39 yards and a score in last week's win over the Raiders. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code to get $150 in bonus bets after placing a $5 bet:How to make Eagles vs. Chargers picksHunt is leaning Over the total, and has found a critical x-factor that has him jumping on one side of the spread. See what it is at SportsLine.Who covers in Eagles vs. Chargers and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the Eagles vs. Chargers spread you need to jump, all from the expert who returned $1,215 to $100 players over his last 46 Philadelphia Eagles picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' odds, prediction, spread: Eagles vs. Chargers picks from expert on 29-15 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/89d1c03c-61af-43cc-9f25-cf98c94ad707/thumbnail/1200x675/a383cb3f45e53278dd09371519e9a63f/jalen-hurts.png"
      ],
      "datePublished": "2025-12-08T17:15:32.000Z",
      "dateModified": "2025-12-08T17:15:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football odds, picks, betting lines, spreads: 2025-26 Bowl season predictions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-playoff-odds-picks-predictions-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/7830b5d1-ce0f-4abe-a77c-e4366678f89d/thumbnail/1200x675/dd71476ebaa603da86f843a930d46ae8/beau-pribula-missouri-tigers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-08T18:59:59.000Z",
    "description": "\n        A season which began in late August is reaching its conclusion, with that being the 2025-26 college football bowl schedule. There are 46 FBS ",
    "body": "\n        A season which began in late August is reaching its conclusion, with that being the 2025-26 college football bowl schedule. There are 46 FBS bowl games, so there are no shortage of opportunities to make college football bowl bets. The LA Bowl kicks things off on Saturday with Washington vs. Boise State (+8.5), with the CFP First Round starting on Dec. 19. The opener is a matchup of Blue Bloods as Alabama is a 1.5-point road favorite over Oklahoma per the latest college football bowl odds.  That's one of a handful of games with a college football spread of 2 points or fewer. Others include Louisiana vs. Delaware (+2),  Arizona State vs. Duke (-1.5) and Navy vs. Cincinnati (-1.5). The largest of the college football bowl spreads comes in the CFP, with Oregon favored by 20.5 points versus James Madison. Other games of interest include powerhouse programs facing off, such as Penn State vs. Clemson (-1.5) in the Pinstripe Bowl and Michigan vs. Texas (-4.5) in the Citrus Bowl. Before locking in any college football bowl picks, be sure to see the latest Championship Week college football predictions from SportsLine's proven model.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for bowl seasonOne of the college football picks the model is high on during the 2025-26 college football bowl schedule: Penn State (-1.5, 48.5) covers against Clemson in the Pinstripe Bowl on Saturday, Dec. 27 at noon ET. Both schools vastly underperformed this year but had strong finishes, with each finishing the season 3-1 ATS. However, Dabo Swinney has lost four of his last six bowl games, with each defeat coming by at least 14 points. This year, his Tigers are averaging 28.7 points, which ranks 61st in the nation, while Penn State, despite playing in the much tougher Big Ten, ranks 37th nationally in scoring. Also, the location of this game in New York City favors a northeastern university like Penn State over Clemson from South Carolina. The Nittany Lions cover almost 60% of the time, while the model also says the Under hits in almost 60% of simulations. See which other picks the model likes here.\nAnother prediction: Missouri (-7, 50.5) covers versus No. 20 Virginia in the Gator Bowl on Dec. 27 in well over 50% of simulations. UVA is coming off an ACC Title Game loss to Duke, in which the Cavaliers would have made the CFP if they had won. Thus, you have to wonder about motivation now that they have to settle for a lesser bowl game, and Virginia has struggled in bowls to begin with, going 1-4 over the last 19 years. Mizzou has won back-to-back bowls under Eli Drinkwitz, and the Tigers' only losses this season came versus teams ranked in the top 10 of the AP Poll at the time. Missouri is 4-1 ATS at neutral sites since Drinkwitz took over in 2020, and the Tigers are 12-4 ATS as favorites since the start of last season. See the rest of the model's picks here.\nHow to make college football picks for bowl seasonThe model has also made the call on who wins and covers in every 2025-26 college football bowl game, and it's calling for five underdogs to outright win in bowl matchups of power conference teams. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which five underdogs are projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.2025-26 college football bowl odds (through 12/24)See full college football bowl picks, odds, predictions here(odds subject to change)Saturday, Dec. 13LA Bowl: Boise State vs. Washington (-8.5, 51.5)Tuesday, Dec. 16Veterans Bowl: Troy vs. Jacksonville State (+4, 51.5)Wednesday, Dec. 17Cure Bowl: Old Dominion vs. South Florida (-6.5, 56.5)68 Ventures Bowl: Louisiana vs. Delaware (+2, 58.5)Thursday, Dec. 18Xbox Bowl: Missouri State vs. Arkansas State (-2.5, 56.5)Friday, Dec. 19Myrtle Beach Bowl: Kennesaw State vs. Western Michigan (-4.5, 49.5)Gasparilla Bowl: Memphis vs. NC State (-5.5, 58.5)CFP First Round: Alabama at Oklahoma (+1.5, 40.5)Saturday, Dec. 20CFP First Round: Miami at Texas A&M (-3.5, 51.5)CFP First Round: Tulane at Ole Miss (-16.5, 56.5)CFP First Round: James Madison at Oregon (-20.5, 50.5)Monday, Dec. 22Potato Bowl: Washington State vs. Utah State (-3.5, 56.5)Tuesday, Dec. 23Boca Raton Bowl: Toledo vs. Louisville (-9.5, 46.5)New Orleans Bowl: Western Kentucky vs. Southern Miss (+4, 55.5)Frisco Bowl: UNLV vs. Ohio (+3.5, 62.5)Wednesday, Dec. 24Hawaii Bowl: Cal vs. Hawaii (+2.5, 55.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football odds, picks, betting lines, spreads: 2025-26 Bowl season predictions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/7830b5d1-ce0f-4abe-a77c-e4366678f89d/thumbnail/1200x675/dd71476ebaa603da86f843a930d46ae8/beau-pribula-missouri-tigers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-08T18:59:59.000Z",
      "dateModified": "2025-12-08T18:59:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball rankings: Michigan comes in as new No. 1 in Coaches Poll top 25 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-coaches-poll-top-25-michigan-kentucky/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/f5f5b011-8219-4015-b3d9-c1eb60d659d2/thumbnail/1200x675/ba175dd9eeff8aa609898e49a6d9bb48/adobe-express-file-2025-12-08t105310-828.jpg",
    "tag": "Sports",
    "date": "2025-12-08T17:47:10.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        There is a new No. 1 in the Coaches Poll. Michigan",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        There is a new No. 1 in the Coaches Poll. Michigan, which continues to stack quality wins amid its 8-0 start to the season, ascended to the top spot in the latest set of rankings. The Wolverines made the move due in large part to previous No. 1 Purdue's loss to Iowa State. The Boilermakers didn't drop too far to No. 6, while the still undefeated Cyclones made their debut in the top five at No. 4 following their momentous victory. Michigan's latest triumph was a 41-point victory against Rutgers to open Big Ten Conference play. That marked the Wolverines' fifth straight win of at least 25 points. Michigan is outscoring its opponents by an average of 35.2 points since Nov. 19. Two ranked wins against No. 24 Auburn and No. 7 Gonzaga are included in that streak. While it looks like a strong year for the Big Ten, which placed three teams in the top 10, the SEC appears headed in the opposite direction. Kentucky, one of the league's preseason favorites, dropped out of the rankings entirely as it continues to struggle against high-level competition. \nThe Wildcats dropped to 5-4 with their 94-59 loss Dec. 5 to Gonzaga. All five of their wins came against non-power conference foes. Tennessee also plummeted from No. 13 to No. 20 as it contends with a three-game losing streak. Here is the full Dec. 8 Coaches Poll after the fifth week of the 2025-26 college basketball season. First-place votes in parenthesis\nCoaches Poll Michigan (17)Arizona (11)Duke (2)Iowa State (1) UConnPurdueGonzagaHoustonMichigan StateBYULouixvilleAlabamaIllinoisVanderbiltNorth CarolinaTexas TechArkansasFloridaKansasTennesseeSt. John'sNebraskaIowaAuburnVirginiaOthers receiving votes: Saint Mary's 52; UCLA 35; Oklahoma State 33; Wisconsin 32; USC 20; Seton Hall 16; Indiana 16; Kentucky 14; SMU 11; Missouri 7; Clemson 7; Ohio State 6; Georgia 5; Miami (FL) 4; LSU 4; Utah State 3; Yale 2; California 1; Baylor 1\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball rankings: Michigan comes in as new No. 1 in Coaches Poll top 25 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/f5f5b011-8219-4015-b3d9-c1eb60d659d2/thumbnail/1200x675/ba175dd9eeff8aa609898e49a6d9bb48/adobe-express-file-2025-12-08t105310-828.jpg"
      ],
      "datePublished": "2025-12-08T17:47:10.000Z",
      "dateModified": "2025-12-08T17:47:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baseball Hall of Fame: Will Astros cheating scandal keep Carlos Beltrán out of Cooperstown? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/carlos-beltran-baseball-hall-of-fame-astros-cheating-scandal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/c3242bb1-a16c-4e49-bff1-73cbd2c8def5/thumbnail/1200x675/59d3cfb01b73b8cc110e0c8a2f453de4/carlos-beltran-getty.png",
    "tag": "Sports",
    "date": "2025-12-08T16:45:40.000Z",
    "description": "\n        Carlos Beltrán, Hall of Famer?  Multiple signs point to this being the year that Beltrán is able to reach 75% of the vote on the BBWAA ballot",
    "body": "\n        Carlos Beltrán, Hall of Famer?  Multiple signs point to this being the year that Beltrán is able to reach 75% of the vote on the BBWAA ballot, which would mean he'll get into the Hall of Fame and inducted in the summer of 2026. He could join Jeff Kent in the 2026 class.Things were already trending this way for Beltrán. Here are his vote percentages from the past three voting cycles, his first three on the ballot: 2023: 46.5%2024: 57.1%2025: 70.3%Usually this kind of trajectory signals a player is about to be voted in. Some of the stragglers in the voting body decide to join the crowd and tip the player over the edge, not to mention that older voters losing their vote (via death or lapsing BBWAA voting requirements) while newer members (via 10 years in the BBWAA) earn voting privileges. Here at CBS Sports, there were two such examples last season. Both Mike Axisa and myself were first-time voters and we both voted for Beltrán in 2024. Also in Beltrán's favor? This is a relatively weak ballot. He's the top returnee on the ballot; Andruw Jones is the only other player who even got 40% or more last time around. The best newcomer is Cole Hamels.\nBeltrán doesn't need to add many votes. He fell just 19 shy out of 394 ballots last year. The only thing standing in Beltrán's way is the sign-stealing scandal from the 2017 Astros. It's an apples vs. oranges comparison as to why, but we saw Barry Bonds and Roger Clemens both plateau shy of the 75% threshold. It happens, especially when something other than on-field performance hangs in the balance.   The on-field performance was on point. Beltrán in parts of 20 seasons hit .279/.350/.486 (119 OPS+) with 2,725 hits, 565 doubles, 78 triples, 435 home runs, 1,587 RBI, 1,582 runs, 312 stolen bases and 70.0 WAR. Advanced defensive metrics love him due to excellent range and he was in the top five of outfield assists five times. The five-tool superstar is one of just five players in history with at least 400 home runs and 300 stolen bases. He's one of 39 to reach 1,500 in both runs and RBI. \nAmong center fielders in MLB history, Beltrán is eighth in WAR, trailing, in order, Willie Mays, Ty Cobb, Tris Speaker, Mickey Mantle, Mike Trout, Ken Griffey Jr. and Joe DiMaggio. There are 19 Hall of Fame center fielders. Beltrán sits ahead of current inductees like Duke Snider, Andre Dawson, Richie Ashburn and more. In terms of postseason performance, Beltrán elevated his game to another level there -- save for one single at-bat that a certain fan base won't forget -- hitting .307/.412/.609 with 15 doubles, a triple, 16 home runs, 42 RBI, 45 runs and 11 steals in 65 playoff games. He won a ring in his final season, though he didn't contribute much to it on the field.And that is the sticking point, right? Those pesky little words \"on the field.\" Beltrán won his World Series ring with the 2017 Astros. He went 0 for 3 in that World Series, but some would argue he contributed significantly for his role in a stain on baseball.\nThose Astros were found to have an illegal sign-stealing operation that season and Beltrán was not only said to be integral, but a ringleader -- if not the ringleader. From a report in The Athletic in 2020: During the season, small groups of Astros discussed their misgivings. [Brian] McCann at one point approached Beltrán and asked him to stop, two members of the 2017 team said.\"He disregarded it and steamrolled everybody,\" one of the team members said. \"Where do you go if you're a young, impressionable player with the Astros and this guy says, 'We're doing this'? What do you do?\"-----------Members of the 2017 Astros use various terms to describe Beltrán — El Jefe, the Godfather, the king, the alpha male in the building.  Among the guidelines for Hall of Fame voters is this, commonly referred to as the \"character clause.\" 5. Voting: Voting shall be based upon the player's record, playing ability, integrity, sportsmanship, character, and contributions to the team(s) on which the player played.Even if he's not an inner-circle all-time great like Willie Mays, Beltrán's statistical dossier says he should be in the Hall of Fame. Without the sign-stealing cloud hanging over him, he would've gotten in on either his first or second try and surely wouldn't still be on the ballot here in his fourth year.I don't want to say it's now or never for Beltrán, because that isn't the case. I just think this is his best chance. This is the easiest path for Beltrán to get votes on a weak ballot and he's already so close. Next voting cycle, Buster Posey joins the fray in addition to Jon Lester while Andruw Jones will be in his 10th and final ballot (unless he makes it this time). The ballot after that, Albert Pujols and Yadier Molina arrive in addition to David Price. The 2029 ballot adds Miguel Cabrera, Joey Votto and Zack Greinke, while it's possible Evan Longoria and Adam Wainwright make a dent too. All signs point to this being Beltrán's year. If it's not, though, that means it's possible his group of voters has plateaued and then the path just gets tougher moving forward. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baseball Hall of Fame: Will Astros cheating scandal keep Carlos Beltrán out of Cooperstown? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/c3242bb1-a16c-4e49-bff1-73cbd2c8def5/thumbnail/1200x675/59d3cfb01b73b8cc110e0c8a2f453de4/carlos-beltran-getty.png"
      ],
      "datePublished": "2025-12-08T16:45:40.000Z",
      "dateModified": "2025-12-08T16:45:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-champions-league-returns-on-paramount-as-real-madrid-face-off-against-manchester-city/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/99b4b119-042f-48cd-ba10-a3d31360663d/thumbnail/1200x675/7448abf07d391802251e68aa25cf2507/396111-uclm-25-ratio-cbssportshq-slate-1920x1080.jpg",
    "tag": "Sports",
    "date": "2025-12-08T19:02:27.000Z",
    "description": "\n        A very happy jam-packed UEFA Champions League week to all! There's a double dose of action this week with the men's and women's competitions ",
    "body": "\n        A very happy jam-packed UEFA Champions League week to all! There's a double dose of action this week with the men's and women's competitions taking part at the same time.  I'm Pardeep Cattry with the latest.📺 Footy fixAll times U.S./EasternMonday, Dec. 8🏴󠁧󠁢󠁥󠁮󠁧󠁿 EPL: Wolverhampton Wanderers vs. Manchester United, 3 p.m. ➡️ USA NetworkTuesday, Dec. 9🇪🇺 UCL: Kairat vs. Olympiacos, 10:30 a.m. ➡️ Paramount+🇪🇺 UCL: Bayern Munich vs. Sporting Lisbon, 12:45 p.m. ➡️ Paramount+🇪🇺 UWCL: St. Polten vs. Juventus, 12:45 p.m. ➡️Paramount+🇪🇺 UCL: Tottenham Hotspur vs. Slavia Praha, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Monaco vs. Galatasaray, 3 p.m. ➡️ Paramount+🇪🇺 UCL: PSV vs. Atletico Madrid, 3 p.m. ➡️ Paramount+, CBS Sports Network🇪🇺 UCL: Union Saint-Gilloise vs. Marseille, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Atalanta vs. Chelsea, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Inter vs. Liverpool, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Barcelona vs. Eintracht Frankfurt, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Real Madrid vs. Wolfsburg, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Arsenal vs. Twente, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Paris Saint-Germain vs. OH Leuven, 3 p.m. ➡️ Paramount+\nWednesday, Dec. 10🇪🇺 UCL: Villarreal vs. Copenhagen, 12:45 p.m. ➡️ Paramount+🇪🇺 UCL: Qarabag vs. Ajax, 12:45 p.m. ➡️ Paramount+🇪🇺 UWCL: Valarenga vs. Paris FC, 12:45 p.m. ➡️ Paramount+🇪🇺 UWCL: Barcelona vs. Benfica, 12:45 p.m. ➡️ Paramount+🇪🇺 UCL: Benfica vs. Napoli, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Juventus vs. Pafos, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Bayer Leverkusen vs. Newcastle United, 3 p.m ➡️ Paramount+, CBS Sports Network🇪🇺 UCL: Club Brugge vs. Arsenal, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Athletic Club vs. Paris Saint-Germain, 3 p.m. ➡️ Paramount+🇪🇺 UCL: Real Madrid vs. Manchester City, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Chelsea vs. Roma, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Manchester United vs. OL Lyonnes, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: Athletico Madrid vs. Bayern Munich, 3 p.m. ➡️ Paramount+Don't Miss It!\n                                                                    Paramount+\n                                                            What's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/99b4b119-042f-48cd-ba10-a3d31360663d/thumbnail/1200x675/7448abf07d391802251e68aa25cf2507/396111-uclm-25-ratio-cbssportshq-slate-1920x1080.jpg"
      ],
      "datePublished": "2025-12-08T19:02:27.000Z",
      "dateModified": "2025-12-08T19:02:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee parts ways with DC Tim Banks: Josh Heupel comments on 'tough decision' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tennessee-defensive-coordinator-tim-banks-josh-heupel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/369333a0-c035-46f9-a872-e504accc47af/thumbnail/1200x675/9665ddf753650f9aa8fbcf2381694eef/tim.jpg",
    "tag": "Sports",
    "date": "2025-12-08T18:58:24.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Tennessee Volunteers made a major change to th",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Tennessee Volunteers made a major change to their coaching staff, as CBS Sports' Matt Zenitz reported that they parted ways with defensive coordinator Tim Banks. Linebackers coach William Inge will serve as Tennessee's interim defensive coordinator for the Vols' Music City Bowl matchup against Illinois. Banks served as Tennessee's defensive coordinator since 2021, which was the first year of the Josh Heupel era. Prior to his stint in Knoxville, Banks served as the co-defensive coordinator for Penn State under James Franklin.\"I want to thank Tim for everything he has done for Tennessee the last five seasons,\" Heupel said in a statement, via 247Sports. \"He helped restore our program to national prominence. More importantly, Tim is a great man of character and someone I have the utmost respect for. We wish Tim all the best moving forward.\"These are tough decisions but one I ultimately felt was necessary for the future of our program. We are fully committed to identifying our next defensive coordinator who will uphold the standard that Tennessee has historically been known for.\"\nAfter finishing second in the SEC in yards allowed per game in 2024, the Vols defense took a step backwards this season. Tennessee allowed 395.3 yards per contest and 28.2 points per game, both of which ranked third-worst in the conference. The Vols boasted the No. 7 scoring defense in the FBS last year (16.1 points allowed per game), as Tennessee finished the regular season with a 10-2 record, and earn a berth in the College Football Playoff. This season, Tennessee finished 8-4.Banks earned finalist status for the Broyles Award last year, which is given to the top assistant in the country. However, hereceived a tough hand this season. Not only did the Vols lose defensive linemen James Pearce Jr. and Omarr Norman-Lott to the NFL draft, but his unit suffered a number of notable injuries. Banks did not have his top two cornerbacks, Jermod McCoy and Rickey Gibson III, for virtually the entire season, cornerback Boo Carter was dismissed in the middle of the year, linebacker Arion Carter played through turf toe in both feet and defensive tackle Jaxson Moi suffered an arm injury early on that caused him to miss multiple games.\nThe Vols finished 0-4 against AP-ranked teams while averaging 28 points per game in those contests. Tennessee went 8-0 and averaged 47.1 points per game vs. unranked teams. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee parts ways with DC Tim Banks: Josh Heupel comments on 'tough decision' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/369333a0-c035-46f9-a872-e504accc47af/thumbnail/1200x675/9665ddf753650f9aa8fbcf2381694eef/tim.jpg"
      ],
      "datePublished": "2025-12-08T18:58:24.000Z",
      "dateModified": "2025-12-08T18:58:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25: Arizona jumps to No. 1 in updated college basketball rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ap-top-25-college-basketball-rankings-arizona-michigan-duke/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/c3781bab-e97d-4177-8479-18dab2b5a369/thumbnail/1200x675/9e8675ded7b6e86aa6cb67fc4de56f96/usatsi-27763000-720.jpg",
    "tag": "Sports",
    "date": "2025-12-08T18:33:38.000Z",
    "description": "\n        The fifth AP Top 25 poll of the 2025-26 season released Monday, and for the third time this season, a new No. 1 team emerged. After Iowa Stat",
    "body": "\n        The fifth AP Top 25 poll of the 2025-26 season released Monday, and for the third time this season, a new No. 1 team emerged. After Iowa State upset Purdue, it opened the door for one of the remaining unbeatens (Duke, Arizona and Michigan) to jump to No. 1.Arizona jumped to No. 1 in the latest poll and received 33 first-place votes. Michigan (19), Duke (seven) and Iowa State (one) also received first-place votes in the poll. The Wildcats own wins over UCLA, UConn, Auburn and Florida.Michigan received the second-most first-place votes last week (15) and jumped one spot to No. 2 in the poll this week. The Wolverines are off to an 8-0 start and have wins on their résumé over San Diego State, Auburn and Gonzaga. The Wolverines opened Big Ten play with a 101-60 blowout win over Rutgers. The Wolverines won five consecutive games by at least 30 points after surviving an upset scare against TCU last month. Duke jumped one spot to No. 3 after recording wins over reigning national champion Florida and Michigan State on the road. Duke faces Michigan Feb. 21 in one of the biggest nonconference games of the season.After falling to 5-4 with losses to North Carolina and Gonzaga, Kentucky dropped out of the poll for the first time during Mark Pope era. Kentucky is off to its worst start since the shortened 2020-21 season, when former coach John Calipari had his team 1-6 before SEC play began. Before that, the last time Kentucky lost at least four games before SEC play started, you have to go back to the 2007-08 campaign, when the program started 6-7.\nAP Top 251. Arizona (33)2. Michigan (19)3. Duke (7)4. Iowa State (1)5. UConn6. Purdue7. Houston8. Gonzaga9. Michigan State10. BYU11. Louisville12. Alabama13. Illinois14. North Carolina15. Vanderbilt16. Texas Tech17. Arkansas18. Florida19. Kansas20. Tennessee21. Auburn22. St. John's23. Nebraska24. Virginia25. UCLAOthers receiving votes: Iowa 60, Oklahoma State 54, USC 50, Georgia 49, Saint Mary's 38, Seton Hall 31, Kentucky 29, Wisconsin 24, Indiana 18, Clemson 14, LSU 14, Villanova 9, California 6, Notre Dame 4, Miami 4, SMU 3, TCU 2, Arizona State 2, Miami (Ohio) 2, St. Bonaventure 1.Let the debate for No. 1 beginFour different teams received at least one first-place vote after Purdue lost to Iowa State. Voters couldn't go wrong with Arizona, Michigan or Duke. Arizona has one of the country's best résumés. Duke just picked up two big wins over Florida and Michigan State. And you can't forget about Michigan, a team that won five consecutive games by at least 30 points. The results will play out over the next several weeks. \nKentucky is in the midst of a freefallThere hasn't been a more disappointing team than Kentucky. The Wildcats entered this season with a tremendous amount of hype under Pope, and the early results haven't been kind. Kentucky is 0-4 against ranked opponents this season and its best win came against Valparaiso, a team ranked in the 200s of the NET Rankings. Kentucky, truthfully, has a very expensive problem. This is the first time during Pope's tenure that his team fell out of the rankings. The good news for him and his team is that there is plenty of time to get back on track. Kentucky has two big nonconference games upcoming against Indiana and St. John's. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25: Arizona jumps to No. 1 in updated college basketball rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/c3781bab-e97d-4177-8479-18dab2b5a369/thumbnail/1200x675/9e8675ded7b6e86aa6cb67fc4de56f96/usatsi-27763000-720.jpg"
      ],
      "datePublished": "2025-12-08T18:33:38.000Z",
      "dateModified": "2025-12-08T18:33:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women's college basketball AP Top 25: UConn stays No. 1 as conference play opens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-college-basketball-ap-top-25-uconn-stays-no-1-conference-play-iowa-kentucky/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/27d8dba6-6fdc-44be-8c9b-db8db635fbf9/thumbnail/1200x675/f6806f47583c15352d61d7eb3f02ab9a/uconn-womens-basketball-azzi-fudd-sarah-strong.png",
    "tag": "Sports",
    "date": "2025-12-08T17:18:19.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UConn held on tight to the No. 1 spot of the AP To",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UConn held on tight to the No. 1 spot of the AP Top 25 with a dominant 102-35 win over DePaul the day of Sue Bird's jersey retirement. The top 10 remained unchanged, but it was by no means a boring week as many teams tipped off conference play.Maryland stayed at No. 7 after surviving double overtime in the Big Ten opener against Minnesota and walking away with a 100-99 victory. The Terrapins were down by seven with 44 seconds remaining in the second overtime period, but they showed a lot of fight to make the comeback. The team is 11-0 despite having three season ending injuries, most recently Kaylene Smikle who has been playing through pain and is opting to have knee surgery.Ole Miss has not faced an SEC opponent yet, but Rebels are down to No. 17 and no longer undefeated following a 61-60 loss to Kansas State. They struggled making much happen on offense, but they were by no means the only ones with that issue this week. \nShots were not falling in the game between USC and Washington, particularly in the first quarter when both teams combined for 12 points. The Trojans eventually walked away with a 59-50 victory and stayed at No. 16 while Washington surprisingly moved up one spot to No. 20. USC has some work to do this week to prepare for a matchup against UConn on Saturday afternoon. Other big matches this week include a Wednesday in-state rivalry game between No. 10 Iowa State and No. 11 Iowa. On Sunday, No. 2 Texas will be tested against No. 13 Baylor.\nAP Women's Basketball Top 25RankTeamRecordPointsPrev.1UConn9-0791 (23)12Texas10-0777 (9)23South Carolina9-172634UCLA9-171145LSU10-064956Michigan8-164267Maryland11-059078TCU10-056689Oklahoma9-1553910Iowa State10-05051011Iowa9-04741212North Carolina9-24221113Baylor9-13921414Vanderbilt9-03691515Kentucky10-13321716USC7-23281617Ole Miss8-12921318Tennessee6-22571919Notre Dame6-21791820Washington8-11632121Ohio State7-11602322Louisville8-31542223Oklahoma State10-11302424Nebraska9-074NR25Michigan State8-17220Others receiving votes: Princeton 31, Texas Tech 24, Georgia 12, Alabama 11, NC State 8, Oregon 3, Stanford 1, Illinois 1, West Virginia 1.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women's college basketball AP Top 25: UConn stays No. 1 as conference play opens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/27d8dba6-6fdc-44be-8c9b-db8db635fbf9/thumbnail/1200x675/f6806f47583c15352d61d7eb3f02ab9a/uconn-womens-basketball-azzi-fudd-sarah-strong.png"
      ],
      "datePublished": "2025-12-08T17:18:19.000Z",
      "dateModified": "2025-12-08T17:18:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs' dynasty is on life support and 2026 has potential to be worse than 2025 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-dynasty-life-support-2026-has-potential-to-be-worse/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/8fd31b7b-510b-4b97-a124-83158fd0fd8e/thumbnail/1200x675/1dc19800975543db85d59e3e249b0e19/patrick-mahomes.jpg",
    "tag": "Sports",
    "date": "2025-12-08T18:16:07.000Z",
    "description": "\n        The Kansas City Chiefs are on the ropes. Following Sunday's home loss to the Houston Texans, Patrick Mahomes and Co. are firmly at risk of mi",
    "body": "\n        The Kansas City Chiefs are on the ropes. Following Sunday's home loss to the Houston Texans, Patrick Mahomes and Co. are firmly at risk of missing out on the playoffs entirely. K.C. dropped to 6-7 on the season, which triggered some statistics that you would've found jaw-dropping had we told you they'd unfold before the 2025 campaign. Most losses (7) in a season since Patrick Mahomes became the full-time starter in 2018.Latest the Chiefs have been under .500 since 2012, the season before hiring Andy Reid. Already eliminated from winning the AFC West, snapping a nine-season streak as division champions.According to SportsLine's projections, Kansas City has just a 10% of making the playoffs at this stage with four games to go in the regular season. On top of winning out, the Chiefs will need extraordinary external help in order to squeak in. As those projections indicate, however, those hopes are dwindling in a hurry. If/when the Chiefs are officially eliminated from playoff contention, it'll mark a seismic moment for their dynasty and the NFL landscape as a whole. And it could be just the top of the iceberg, as the road forward through 2026 could be even worse for Kansas City. \n        \n            \n                Chiefs' NFL playoff hopes aren't quite dead yet: Here's how fading Kansas City could still get in postseason\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nLooking ahead to next season, we already know most of their opponents as the AFC West is slated to play the AFC East and NFC West in 2026. That's arguably an even tougher division draw than what they were dealt during this trying 2025 season, squaring off against the NFC North and AFC South. \nHere's a look at who the Chiefs are slated to play in 2026, and where (Not including their AFC West rivals: Broncos, Chargers, and Raiders).HomeAwayNew England PatriotsBuffalo BillsNew York JetsLos Angeles RamsArizona CardinalsMiami DolphinsSan Francisco 49ersSeattle SeahawksAFC South (TBD)AFC North (TBD)NFC South (TBD)Those teams that have yet to be determined will only be known at the end of the 2025 regular season, as the Chiefs will face whichever teams finish in the same spot as them in the standings. With Kansas City sitting in third place in the AFC West at the moment, these are the teams they are currently slated to face if the season ended today: Cincinnati Bengals (road)Indianapolis Colts (home)Atlanta Falcons (road)Specifically, Kansas City's road schedule in 2026 is projected to be a gauntlet with trips to Buffalo, Los Angeles, and Seattle on deck, with the possible addition of Cincinnati. Collectively, their road opponents (excluding the rest of the AFC West) are 43-35 this season through Week 14. Their home opponents (excluding the rest of the AFC West) are 34-31. While the home schedule is a touch lighter, hosting the Patriots and 49ers won't be gimmies whatsoever. Of course, the \"when\" piece of Kansas City's schedule won't be revealed until the spring, which is a key element still looming. Nevertheless, the opponents are slated to be just as, if not more, daunting in 2026, creating the potential for this stumble to continue through next year if they don't rectify some of their issues.  And addressing some key needs may not be the easiest endeavor, as they are currently projected to be $42.7 million over the salary cap, which is the second-lowest amount of space in the league (via Over the Cap). While they can do some cap gymnastics to under the threshold through restructures and releases, it'll be a process. But let's look at a couple of key areas they need to address this offseason to better gear up for this upcoming slog of 2026 opponents to avoid the disaster that has been the 2025 season. How can the Chiefs fix issues this offseason?Bolster the backfield\nOne thing that stands out when watching the Chiefs is the lack of an explosive ground attack. Sure, Kareem Hunt has been good in short-yardage situations, but neither Hunt nor Isiah Pacheco has shown us the ability to break off an explosive run. Through Week 14, Kansas City has just three rushes for 20-plus yards, which is tied for the second-fewest in the NFL. Bringing in someone like New York Jets running back Breece Hall -- a pending unrestricted free agent -- could give the Chiefs the type of dynamic back they've been sorely missing. Hall has seven runs of 20-plus yards this season, and would give Patrick Mahomes a trusted option as a pass-catcher out of the backfield as well. Find a Travis Kelce replacement\nFather Time is ticking when it comes to Travis Kelce, who has looked a step slower in recent years. After mulling retirement last offseason, it's fair to wonder if this will be it for the future Hall of Fame tight end. Regardless of whether it's this offseason or some point down the line, Kansas City needs to bring in his replacement. And that doesn't just mean a tight end; they need to identify the next go-to target for Patrick Mahomes in the passing game. Could that simply be Rashee Rice? Sure. That said, K.C. may want to add as many playmakers as possible. Pending free agent tight ends like David Njoku, Kyle Pitts, and Isaiah Likely could be intriguing options to fill Kelce's shoes at his position and be another weapon for Mahomes. Refresh the secondary\nKansas City's secondary could go through an overhaul this offseason, with corner Jaylen Watson and safety Bryan Cook slated to hit free agency. Meanwhile, corner Trent McDuffie has just one year left on his rookie deal after the Chiefs picked up his fifth-year option for 2026, so he could be due an extension as well. Kansas City is allowing a 92.7 passer rating against this season, which ranks 18th in the NFL. The secondary is allowing quarterbacks to complete 67.7% of their passes against them, which is 28th in the league. Something needs to change there, maybe with the infusion of some young talent via the NFL Draft, especially with the group of elite quarterbacks they are slated to play in 2026. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs' dynasty is on life support and 2026 has potential to be worse than 2025 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/8fd31b7b-510b-4b97-a124-83158fd0fd8e/thumbnail/1200x675/1dc19800975543db85d59e3e249b0e19/patrick-mahomes.jpg"
      ],
      "datePublished": "2025-12-08T18:16:07.000Z",
      "dateModified": "2025-12-08T18:16:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Can Chiefs still make the playoffs? Here's what needs to happen for a K.C. postseason berth - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-nfl-playoff-hopes-arent-quite-dead-yet-heres-how-fading-kansas-city-could-still-get-in-postseason/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/c30c2705-34d3-476d-b427-4a73fdd84732/thumbnail/1200x675/c7e0d480dbc267eaff44e0911bdbeaf4/mahomes-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-12-08T17:19:23.000Z",
    "description": "\n        It took nine years, but the Kansas City Chiefs have finally been knocked out of the top spot in the AFC West. Following their loss to the Hou",
    "body": "\n        It took nine years, but the Kansas City Chiefs have finally been knocked out of the top spot in the AFC West. Following their loss to the Houston Texans on Sunday night, the Chiefs have officially been eliminated from winning the division title. Although their reign atop the AFC West is over, the Chiefs' playoff hopes aren't officially dead yet. At 6-7, the Chiefs will need quite a few things to go their way down the stretch if they want to make the postseason, which explains why our SportsLine projection is giving them just a 9.1% chance of getting in. Patrick Mahomes can do that math. \"We know the (playoff) chances are getting lower and lower, but I know the guys on this team are going to give everything they have, every opportunity we get,\" Mahomes said following the loss to Houston. The Chiefs haven't been great this year, but if they found a way to get into the playoffs, they would instantly become the team that no one wants to play and that's mostly because Mahomes has a 9-0 record when playing in the wild card (2-0) or divisional round (7-0). \nAt this point, there are a lot of things working against the Chiefs, like the fact that the Texans, Bills and Jaguars all hold a head-to-head tiebreaker over them. It also doesn't help that they have the worst conference record of any of the top 10 AFC playoff contenders. So what has to happen for the Chiefs to pull off a miracle playoff berth? Let's break down the most realistic scenario.First, we're going to assume the Bills and Jaguars both get in. At 9-4, both teams just need to go 2-2 over the their final four games to guarantee that they finish ahead of Kansas City and that seems pretty likely. Also, the 8-5 Texans have the second-easiest remaining strength of schedule in the AFC, and they only have to go 3-1 down the stretch to finish ahead of Kansas City, so we're going to give them a playoff spot, too. \nThat leaves the Chiefs, Chargers, Colts, Dolphins and Ravens fighting for one spot. Let's check out the Chiefs' easiest path to the postseason: \n        \n            \n                Andy Reid takes 'full responsibility' for Chiefs' failed fourth down plays as playoff hopes dwindle\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nChiefs must win outChiefs' remaining schedule: vs. Chargers, at Titans, vs. Broncos, at RaidersBreakdown: The biggest upside for the Chiefs down the stretch is that their two most difficult games are at home. The Chiefs have won three straight home games against the Chargers and nine straight home games against the Broncos. Not to mention, the Chiefs are 5-2 at home this year, so winning both games is certainly within the realm of possibility. If they don't slip up against the Titans or Raiders, 10-7 is definitely realistic. Chargers must finish 10-7 or worseChargers' remaining schedule: vs. Eagles, at Chiefs, at Cowboys, vs. Texans, at BroncosBreakdown: The Chargers (8-4) currently have the fourth-most difficult remaining strength of schedule in the NFL, so it would be completely possible for them to go 2-3 or worse down the stretch. Of the Chargers' five remaining games, they HAVE to lose to the Chiefs and Broncos. The reason the Chiefs need those two specific losses is so that they can finish with the same division record (4-2) as the Chargers, which would create a tiebreaker situation that would benefit Kansas City. Of the three non-divisional games that L.A. has left, the Chiefs could still make the playoffs even if the Chargers go 2-1 against the Eagles, Texans and Cowboys. If that happens, the Chargers will finish 10-7 and they'll be tied with the Chiefs at 4-2 in the division, but Kansas City will finish ahead of L.A. due to the common games tiebreaker. \nWhat Chiefs need from Colts, Dolphins and RavensBreakdown: The Colts (8-5) finishing at 9-8 or worse would be the best-case scenario for Kansas City and that's certainly possible because Indy has the most difficult remaining strength of schedule in the NFL with games against the Seahawks, 49ers, Jaguars and Texans. With Daniel Jones done for the year, it's hard to see Indy winning any of those, but even if the Colts manage to win one, the Chiefs would still be in good shape. The Dolphins and Ravens are both 6-7, so they'd have to win out to get to 10-7, which doesn't seem likely. The Ravens close the season with the Bengals, Packers, Patriots and Steelers, and it's hard to see them running the table there. As for the Dolphins, they have the Steelers, Bengals, Buccaneers and Patriots. The Dolphins have been hot, but they still haven't won a game when it's under 40 degrees with Tua Tagovailoa, which could make things difficult since they travel to Pittsburgh and New England over the final four weeks. When it comes to tiebreakers, the Chiefs are in a mostly good spot with these three teams. They have the head-to-head tiebreaker over both the Colts and Ravens, but the problem is that if THREE teams get to 10-7, then the head-to-head tiebreaker is thrown out and conference record comes in. If the Chiefs win out, they'd be 7-5 in the AFC, which would put them ahead of the other three teams assuming Indy loses to the Jaguars and Texans (That would drop the Colts to 6-6 in the AFC). \nThe Chiefs winning out might be the most improbable part of this path, but as you can see, there is still a somewhat plausible path for Kansas City to make the playoffs. Here's what the AFC standings would look like if everything goes Kansas City's way: AFC playoffsPatriots (14-3)Broncos (13-4)Texans (12-5)Steelers (9-8)Bills (12-5)Jaguars (12-5)Chiefs (10-7)Even if the Jaguars win the AFC South, that wouldn't impact things here. The Ravens could also win the AFC North and that wouldn't impact the Chiefs unless they somehow finished in a tie with the Steelers at 10-7, but as we noted above, it seems highly unlikely that the Ravens will win out. \nIf the Chiefs do miss the postseason, it will mark the first time in Mahomes' career that his team has missed the playoffs. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Can Chiefs still make the playoffs? Here's what needs to happen for a K.C. postseason berth - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/c30c2705-34d3-476d-b427-4a73fdd84732/thumbnail/1200x675/c7e0d480dbc267eaff44e0911bdbeaf4/mahomes-jpeg.jpg"
      ],
      "datePublished": "2025-12-08T17:19:23.000Z",
      "dateModified": "2025-12-08T17:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff selection: Notre Dame AD details damaged ACC relationship - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-selection-notre-dame-ad-miami-acc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/d0a54209-a0a4-4b2d-a115-1f278df9ff9f/thumbnail/1200x675/8fe92e589e25dc3190191f6df605af4b/notre-dame.jpg",
    "tag": "Sports",
    "date": "2025-12-08T17:53:09.000Z",
    "description": "\n        When the final College Football Playoff rankings were announced, Notre Dame saw its postseason hopes dissolve. Alabama remained at No. 9 afte",
    "body": "\n        When the final College Football Playoff rankings were announced, Notre Dame saw its postseason hopes dissolve. Alabama remained at No. 9 after getting blasted in the SEC Championship. Despite both teams being idle, Miami jumped the Irish for the No. 10 spot after weeks of being ranked behind them. It was both shocking and somewhat predictable, as there was never going to be an acceptable outcome given the way the committee handled this situation all year. Notre Dame felt bamboozled by a number of parties, including the committee, the CFP's TV partner ESPN and the ACC. As a result, Notre Dame declined all bowl bids, offering a bit of a parting shot at ESPN which broadcasts and operates most bowl games. Athletic director Pete Bevacqua has been making the rounds to voice the school's displeasure with the situation. He joined the Dan Patrick Show Monday where he addressed the ACC's role in the situation.\"We have no gripes about any of the schools in the ACC. But we were mystified by the actions of the conference to attack their biggest business partner in football and a member of their conference in 24 of our other sports,\" Bevacqua said. \"And I wouldn't be honest with you if I didn't say that they've certainly done permanent damage between the conference and Notre Dame.\"\n\"Just we didn't appreciate the fact that we were singled out repeatedly and compared to Miami,\" Bevacqua explained when asked to elaborate. \"Not by Miami — Miami has every right to do that — but it raised a lot of eyebrows here that the conference was taking shots at us.\" The relationship between Notre Dame and the ACC certainly complicated matters here, but when push came to shove, there was never a world where the ACC wouldn't back one of their actual member programs in favor of a \"business partner,\" as Bevacqua put it.Notre Dame is an ACC member in most other sports. In football, they have a deal to play five games per season against ACC teams while retaining their beloved independency. They recently added a long-term scheduling agreement with Clemson to play each year from 2027-38 that raised some questions among other ACC programs about how that will impact the Irish's agreement, and it seems there is some serious tension building within their partnership. \nAs for what the ramifications are for the \"permanent damage\" Bevacqua claims has been done by the ACC stumping for the Canes, that's not abundantly clear. Perhaps the Irish will look to solidify more scheduling deals with the ACC's biggest programs, frustrating others who could lose home games with Notre Dame that would be huge revenue drivers. The biggest problem Notre Dame should have with the ACC is that they could have avoided this debacle with a better tiebreaker policy to put the highest ranked teams in the ACC title game. Miami winning the ACC would have kept Notre Dame in the field as the final at-large team, but instead the Canes watched as their old friend Manny Diaz and Duke win an ACC title before them. All of this will become a moot issue next year when Notre Dame's MOU with the Playoff kicks in and they're guaranteed a spot if they rank inside the top 12. That doesn't help the Irish this year, and in the meantime they're searching for anyone to blame other than themselves for losing their first two games against their two best opponents. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff selection: Notre Dame AD details damaged ACC relationship - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/d0a54209-a0a4-4b2d-a115-1f278df9ff9f/thumbnail/1200x675/8fe92e589e25dc3190191f6df605af4b/notre-dame.jpg"
      ],
      "datePublished": "2025-12-08T17:53:09.000Z",
      "dateModified": "2025-12-08T17:53:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs' Andy Reid shoulders decision-making blame as NFL playoff hopes dwindle - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-andy-reid-nfl-playoff-texans/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/9889ad5a-4573-48a3-929c-bcac7ea966a5/thumbnail/1200x675/f3e6ef91befdc93169716add7e377565/reid.jpg",
    "tag": "Sports",
    "date": "2025-12-08T16:46:59.000Z",
    "description": "\n        The Kansas City Chiefs fell to 6-7 Sunday in a 20-10 home loss to the surging Houston Texans. The loss dropped Kansas City's playoff odds to ",
    "body": "\n        The Kansas City Chiefs fell to 6-7 Sunday in a 20-10 home loss to the surging Houston Texans. The loss dropped Kansas City's playoff odds to 15% with just four games left to play. Coach Andy Reid put the loss on his own shoulders, specifically related to two failed fourth downs in the fourth quarter.A win over the Texans, who are now 8-5 and own the head-to-head tiebreaker with Kansas City, would have given the Chiefs a real shot at the postseason. Given the importance of finding a way to win Sunday night's game, even on a night where the offense didn't have its best against Houston's elite defense, there was an even brighter spotlight on the Chiefs' critical mistakes. \"I put the guys offensively in a tough position with the fourth downs,\" Reid said. \"I tried to stay aggressive with it. I take full responsibility for that. I thought we could get it, that was the decision. I was confident we could do that. It's important that you take advantage of opportunities (and) I thought it was an opportunity. I was wrong, no? I mean, hindsight, it was wrong. We've been pretty good on fourth downs. I messed that one up.\"The most notable of those came early in the fourth quarter with the game tied 10-10 when Reid left the offense on the field for a fourth-and-1 on their own 31. Will Anderson Jr. immediately pressured Patrick Mahomes, who couldn't connect with Rashee Rice on a crosser that set up Houston in scoring position.\nThe Texans scored a touchdown on the ensuing drive for what became the game-winning score. The Chiefs failed on another fourth down on their next drive, and a Travis Kelce drop popped into the arms of Azeez Al-Shaair for an interception for their third turnover of the quarter in their own territory.\nThat fourth quarter performance was a microcosm of the season for the Chiefs, where they simply have not made the kinds of plays in key spots for which this offense is known. While Reid rightfully took responsibility, everyone on that offense has played a role in their struggles.With the loss to Houston, the Chiefs are now 10th in the AFC and their playoff fate is no longer in their hands. Winning out won't be enough, as the Chiefs need some help to extend their playoff streak to 11 consecutive years. Catching the Texans, who moved into the 7-seed with the win, would require Kansas City to win out and Houston to go 1-3 in their final four games because of tiebreakers. The best hope for stealing a playoff berth is catching the Los Angeles Chargers (8-4) and passing the reeling Indianapolis Colts (8-5), who lost Daniel Jones to an Achilles injury, and Baltimore Ravens (6-7). \nFor a team that made it to the conference title game in seven consecutive seasons, winning three championships along the way, failing to make the playoffs would require some serious introspection. All great teams eventually come to an end, and it usually happens faster than anyone expects. The Chiefs will always have a chance with Mahomes under center, but this season proves they need to make some changes to re-open that championship window. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs' Andy Reid shoulders decision-making blame as NFL playoff hopes dwindle - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/9889ad5a-4573-48a3-929c-bcac7ea966a5/thumbnail/1200x675/f3e6ef91befdc93169716add7e377565/reid.jpg"
      ],
      "datePublished": "2025-12-08T16:46:59.000Z",
      "dateModified": "2025-12-08T16:46:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 8 Start/Sit: Why Raynaud belongs in your lineups - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-8-startsit/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/690dc6d4-dd17-465a-af52-27044bfe51a0/thumbnail/1200x675/e25a41012acfdc69ca5b7a2ed22e01ed/maxime-raynaud-sacramento-kings-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-08T17:48:44.000Z",
    "description": "\n        The NBA Cup finals are upon us, meaning we have a week loaded with rest for many teams. Unlike the past few weeks, deciding who to sit and wh",
    "body": "\n        The NBA Cup finals are upon us, meaning we have a week loaded with rest for many teams. Unlike the past few weeks, deciding who to sit and who to start can be dictated by the schedule, with very few players worthy of a starting spot, should they only suit up once.Week 8 sees a host of players with a very light schedule, with 14 teams suiting up only once and 12 teams with just two games. That leaves four teams to focus on in terms of schedule, taking to the court three times each, those being the Pacers, Timberwolves, Pelicans, and Kings.Sitting players who only go two or three times has its advantages, but fantasy managers still have to make smart decisions when figuring out whom to play, regardless of game count. Being aware of back-to-back sets is also a key factor, especially with so many teams now sitting players during the home stretch.Four Games: N/AThree Games: IND, MIN, NOP, SACTwo Games: ATL, BKN, CHA, CHI, CLE, GSW, MIL, PHI, PHO, POR, SAS, WASOne Game: BOS, DAL, DEN, DET, HOU, LAC, LAL, MEM, MIA, NYK, OKC, ORL, TOR, UTAHere are four potential starts and four potential sits entering the eighth week of the NBA season. Just keep in mind that this is based on games played for the week. If you play in a rotisserie league, the number of games played each week may not matter in your format.\nGuardsConsider starting: T.J. McConnell, INDOpponents: SAC, @PHI, WASArguably the best case of quantity over quality this week, McConnell having three games makes him at least a starting candidate. His production of late has been adequate, at best. With that said, he has been able to contribute in the categories we need, those being assists and steals. In seven games over the past two weeks, McConnell has averaged 10.6 points, 5.1 assists, and 1.7 steals in 18.2 minutes per game. If his playing time can push to 20 minutes per game, we could be looking at a player who could accumulate 25 assists and eight steals over the next seven days. More than helpful given how many players only suit up once.Consider sitting: Ryan Nembhard, DALOpponents: BKNDespite his recent rise up the ranks, one game this week simply isn't enough to warrant a starting roster spot for a largely unproven player. Since assuming the starting role in Dallas, Nembhard has certainly made the most of his opportunity. He has scored double digits in five of the six games, while also averaging 6.8 assists and 2.5 3-pointers. However, with Brandon Williams nipping at his heels and head coach Jason Kidd likely to change his mind at any time, there is likely too much risk with starting Nembhard this week.Consider sitting: Reed Sheppard, HOUOpponents: LACA player who is on the opposite trajectory, Sheppard has seen his role and production reduce over the past week, with head coach Ime Udoka seemingly not on board with having him as a permanent starter. In four appearances over the past week, Sheppard has averaged nine points, 3.8 rebounds, three assists, one steal, and two 3-pointers in just 23 minutes per game. As a player who could very well give you 20 minutes off the bench for his one game this week, moving Sheppard to your bench also seems like a wise decision.\nForwardsConsider starting: Saddiq Bey, NOPOpponents: SAS, POR, @CHIAnother injury to Zion Williamson has seemingly presented Bey with arguably the best opportunity of his career. He has now started in eight straight games, recording three double-doubles in that span. In seven games over the past two weeks, he has averaged 20.1 points, 8.3 rebounds, 2.4 assists, 1.4 steals, and two 3-pointers in 35 minutes per contest. While Herb Jones could return as soon as Monday against the Spurs, Bey has likely done enough to hold down a significant role in the rotation. Managers are certainly within their rights to have a little hesitation when it comes to Bey, although given the lopsided schedule this week, even two good games from Bey would likely be enough to warrant a starting spot.Consider starting: Noah Clowney, BKNOpponents: @DAL, MILAfter years of teasing us with his upside, it appears as though Clowney has finally figured things out. While it was a slow start to the season, Clowney has thrived since moving into the starting lineup in early November. In 15 games over the past month, he has averaged 16.6 points, 3.6 rebounds, 2.9 3-pointers, and 1.8 combined steals and blocks, logging 31 minutes per contest. Although the Nets are going nowhere, Clowney seems to have carved out a consistent role, something that has eluded him in the past. Two games make him a borderline starting candidate, but he should certainly be in the discussion given his recent play.Consider sitting: Tobias Harris, DETOpponents: ATLA player with very little upside, one game for Harris simply isn't enough for him to be handed a starting role this week. He is well outside the top 150 this season despite playing 29.7 minutes per game. Through 14 appearances, he is averaging 14.7 points, 5.1 rebounds, and 1.8 3-pointers, shooting 45.3 percent from the floor. Detroit is a team looking to win, meaning Harris will likely hold onto his starting spot, something that is actually a negative when it comes to his overall fantasy appeal. Don't overthink this one just because of who he is. Move him to the bench.\nCentersConsider starting: Maxime Raynaud, SACOpponents: @IND, DEN, @MINIn a season full of weird and strange decisions, Sacramento finally did the right thing, moving Raynaud into the starting lineup. With Domantas Sabonis likely to miss at least another two weeks, the starting center spot is open for business. Drew Eubanks was given first crack at the job, although he failed miserably, much to no one's surprise. Raynaud has quietly put up numbers off the bench before being inserted into the starting lineup in a win over the Heat. In his last four games, the rookie has averaged 16.3 points, 6.5 rebounds, and 1.3 blocks. Assuming he holds on to the starting job, Raynaud should not only be rostered everywhere, but he is also worth starting this week with a favorable three-game schedule.Consider sitting: Kel'el Ware, MIAOpponents: @ORLDespite starting the past two games, Ware's production continues to be a source of frustration for managers. His role typically fluctuates based on the opposition, meaning he is no guarantee to start this week against the Magic. In four games over the past week, Ware averaged 7.8 points, 8.3 rebounds, and 1.3 blocks in 23.3 minutes per contest. However, he scored no more than five points in three of those four games, while blocking multiple shots only once. Given the uncertainty regarding both his role and production, a spot on the bench seems like the easy and correct decision.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 Start/Sit: Why Raynaud belongs in your lineups - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/690dc6d4-dd17-465a-af52-27044bfe51a0/thumbnail/1200x675/e25a41012acfdc69ca5b7a2ed22e01ed/maxime-raynaud-sacramento-kings-imagn-images.jpg"
      ],
      "datePublished": "2025-12-08T17:48:44.000Z",
      "dateModified": "2025-12-08T17:48:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff selection: Notre Dame has assurance, light 2026 schedule - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-selection-notre-dame-mou-2026-schedule/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/d3bf0d1a-8290-493c-92dc-3c602fcfa03b/thumbnail/1200x675/261613ac6a5105da9731c46c24077ef0/dame.png",
    "tag": "Sports",
    "date": "2025-12-08T16:24:11.000Z",
    "description": "\n        Notre Dame athletic director Pete Bevacqua laments the Fighting Irish had a potential College Football Playoff berth \"stolen\" by the selectio",
    "body": "\n        Notre Dame athletic director Pete Bevacqua laments the Fighting Irish had a potential College Football Playoff berth \"stolen\" by the selection committee, but doesn't expect there to be any legitimacy questions in 2026 and beyond. Bevacqua said Sunday language in a memorandum of understanding signed by Notre Dame last spring guarantees the Fighting Irish a playoff appearance if they rank inside the top 12 of the final poll.In this scenario, Notre Dame would have been this season's final at-large selection over Miami. Notre Dame's playoff \"assurance\" for being ranked inside the top 12 doesn't go into effect until next season, according to Yahoo Sports. The Fighting Irish opted of bowl season altogether. Multiple sources confirmed to CBS Sports that the Pop-Tarts Bowl invited Notre Dame to play BYU and waited \"several hours\" before the Fighting Irish declined.Notre Dame's 2026 scheduling will not win any awards, and should be one of college football's most favorable. Not all dates are finalized, but Notre Dame plays only three true road games — North Carolina, Syracuse and Purdue — and has neutral-site contests against Wisconsin and Navy.The Midshipmen are the only team among those five that finished bowl-eligible, and Notre Dame has won eight straight in the rivalry series, including six by at least 20 points.\nNotre Dame 2026 football schedulevs. Wisconsin (Lambeau Field, Green Bay, Wis.)Sept. 6vs. RiceSept. 12vs. Michigan StateSept. 19at PurdueSept. 26at North CarolinaOct. 3vs. SMUTBAat SyracuseTBAvs. Navy (Gilette Stadium, Foxborough, Mass.)Oct. 31vs. MiamiNov. 7vs. StanfordTBAvs. Boston CollegeNov. 21vs. USCTBALooking at the list of games for Notre Dame, you don't need sportsbooks to spit out future lines to know the Fighting Irish should be a heavy favorite in most of those matchups.The Fighting Irish went 2-2 against ranked competition this season, beating USC and Pittsburgh down the stretch after losing to Miami and Texas A&M to open. The loss to the Aggies in South Bend was the final game of a two-year agreement with the Aggies.Notre Dame's new MOU also states the Fighting Irish will be guaranteed a playoff berth by being ranked No. 13 or higher if the bracket expands to 14 teams.While the committee chose Miami as the last-team-in, the decision to keep Alabama at No. 9 was also a sting for the Fighting Irish. The Crimson Tide were not docked for getting blown out by Georgia in the SEC Championship Game like BYU was after losing in similar fashion to Texas Tech in the Big 12 final.That subjective ruling involving Alabama and Notre Dame is what ultimately pushed Miami one spot behind Notre Dame for the first time all season in the committee's rankings, per chair Hunter Yurachek.The logic there doesn't make much sense, but nothing said publicly from this committee truly has. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff selection: Notre Dame has assurance, light 2026 schedule - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/d3bf0d1a-8290-493c-92dc-3c602fcfa03b/thumbnail/1200x675/261613ac6a5105da9731c46c24077ef0/dame.png"
      ],
      "datePublished": "2025-12-08T16:24:11.000Z",
      "dateModified": "2025-12-08T16:24:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]