[
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by betting Eagles-Packers, Bulls-Spurs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-get-300-bonus-bets-free-nba-league-pass-eagles-packers-bulls-spurs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-11-10T23:47:22.000Z",
    "description": "\n        The Green Bay Packers and Philadelphia Eagles will square off on Monday Night Football to conclude Week 10 of the 2025 NFL season. It will be",
    "body": "\n        The Green Bay Packers and Philadelphia Eagles will square off on Monday Night Football to conclude Week 10 of the 2025 NFL season. It will be one of the most popular games of the entire week for online sports betting, and with the latest DraftKings promo code, new users can receive $300 in bonus bets and three free months of NBA League Pass. The SportsLine model projects the Packers to defend home field and exit MNF with a victory while covering as 1.5-point home favorites in its Monday best bets at DraftKings Sportsbook. The over/under for Eagles vs. Packers is 45 points. The model has also found value on the hardwood, projecting the Chicago Bulls to upset the San Antonio Spurs at +140. One of SportsLine's top experts also has a college basketball bet on Xavier vs. Santa Clara. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 10 on a sizzling 47-29 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Monday best bets at DraftKings SportsbookPackers (-1.5) vs. EaglesBulls to defeat the Spurs (+140)Santa Clara vs. Xavier: Under 157.5 pointsCombining the model's three picks into a Monday parlay at DraftKings would result in a payout of +816 (risk $100 to win $816). Bet it at DraftKings here:\nPackers (-1.5) vs. EaglesThe Packers have played up and down to their competition at times this season, and although that's delivered frustrating losses for Green Bay fans against the Panthers and Browns while defeating the Lions and the Commanders when they were healthier earlier in the season, there is no bigger opponent to play up for than the defending Super Bowl champions, especially when they play in your conference. The Green Bay defense has the tools to take away what Philadelphia does best also, with the second-best run defense at 89.4 yards allowed per game and the fewest passing yards per attempt (5.8) in the NFL. The model projects the Packers to win and cover in 54% of simulations. Back Green Bay at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Bulls to defeat the Spurs (+140)Chicago won six of its first seven games to open the new season, and although it has lost back-to-back contests, the Bulls return home, where they are 5-0 this season. Chicago has home victories over teams such as the Pistons, Knicks and 76ers, knocking off strong opponents on its home floor this year. Josh Giddey is nearly averaging a triple-double at 21.4 points, 9.6 rebounds and 9.3 assists per game this season. Those numbers increase to 23.6 points, 10.2 rebounds and 9.8 assists at home this season, as the model projects the Bulls to win in 52% of simulations, showcasing strong value at plus-money odds. Back Chicago at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Santa Clara vs. Xavier: Under 157.5 points\"Herb Sendek has his Santa Clara shooting lots of three-balls as in recent seasons, but it remains to be seen if he has similar marksmen on the roster,\" legendary SportsLine expert Bruce Marshall said. \"In Friday's 79-67 win over McNeese, the Broncos hit 12 of 31 triples, though it took 5 of 8 from Villanova transfer guard Sash Gavalyugov to up the percentage. While SCU's not quite a well-oiled machine yet, Xavier surely isn't for its new HC Richard Pitino (whose dad Rick once had Sendek on his staff). It might be asking a lot of these two sides to ramp up the scoreline.\" Back the Under at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:\nWant more Monday Night Football, NBA, college basketball picks?You've seen some of the model's Monday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by betting Eagles-Packers, Bulls-Spurs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-11-10T23:47:22.000Z",
      "dateModified": "2025-11-10T23:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 322 fight card -- Makhachev vs. Della Maddalena: Top storylines to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-322-islam-makhachev-jack-della-maddalena-fight-card-storylines-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/4cb489ba-eef8-493a-8790-b53cf15a8db1/thumbnail/1200x675/a4310cac5eab45079052a84055a36416/jdm-makhachev-nyc-ufc-322.jpg",
    "tag": "Sports",
    "date": "2025-11-10T22:36:19.000Z",
    "description": "\n        A pair of title bouts top an absolutely loaded return to Madison Square Garden on Saturday when UFC 322 comes to New York. In the main event,",
    "body": "\n        A pair of title bouts top an absolutely loaded return to Madison Square Garden on Saturday when UFC 322 comes to New York. In the main event, former lightweight champion Islam Makhachev looks to add a second divisional title when he challenges Jack Della Maddalena for the welterweight crown. Meanwhile, in the co-feature, former women's strawweight champion Zhang Weili moves up to 125 pounds to challenge flyweight queen Valentina Shevchenko.As we draw closer to this weekend's must-see event, let's take a closer look at the biggest storylines surrounding UFC 322. 1. How much greater can Islam Makhachev be? From a historical standpoint, that's the biggest question surrounding the 34-year-old native of Dagestan, Russia, who looks to become the 11th two-division champion in UFC history when he challenges Della Maddalena for his 170-pound title. Not only has Makhachev not lost since just his second UFC fight in 2015 (a first-round knockout against Adriano Martins), he can equal Anderson Silva's UFC record of 16 consecutive wins should he be victorious on Saturday. Already on the short list of the greatest fighters in the promotion's 32-year history, there's a wonder as to whether Makhachev might be able to extend his legacy even further than the daunting shadow of his long-time teammate and coach, Khabib Nurmagomedov, who retired undefeated in 2020 as the reigning lightweight champion and pound-for-pound king. The 27-1 Makhachev, a perennial P4P standout who is already the record holder for most UFC lightweight title defenses with four, is a more complete fighter than Nurmagomedov but he will need to prove he can carry his power and skill set up to welterweight in order to further cement his greatness. \n2. Doubt Jack Della Maddalena at your own perilDespite being more than a 2-to-1 betting underdog as the defending champion, the Australian slugger is the champion of the sport's deepest division for a reason, even if his path to the crown was anything but typical. Della Maddalena, who is riding an 18-fight win streak after losing his first two pro bouts in 2016, was the benefiter of great timing when an injury to top contender Shavkat Rahmanov opened up a shot at Belal Muhammad's title in March. JDM had been inactive, himself, due to injuries and had appeared just once in the previous 20 months. He was also fresh off of back-to-back split decision wins (Bassil Hafez, Kevin Holland) and needed a last-round knockout of 37-year-old Gilbert Burns in 2024 to keep pace in the rankings. But once he got his title shot at UFC 315, he stepped his game up considerably by stuffing all of Muhammad's takedown attempts over the first three rounds en route to a hard-fought decision win to earn a spot in the P4P top 10. Knowing how important it will be that his ground game be even more stingy against a grappling ace like Makhachev, Della Maddalena has once again sought the services of countrymen Alexander Volkanovski, the UFC featherweight champion, and jiu-jitsu ace Craig Jones for his first title defense. For whatever JDM lacks in technique opposite Makhachev, he makes up for in heart, desire and a willingness to go through hell in order to get his hand raised. For Makhachev to unseat him, he will surely have to earn it the hard way. 3. Call Valentina Shevchenko-Zhang Weili what it is: a women's MMA superfight Already among the most decorated fighters in UFC strawweight history as a two-time champion, Zhang will join Makhachev in pursuit of a second title in as many divisions on Saturday when she moves up to 125 pounds against the two-time flyweight queen Shevchenko. A virtual pick 'em from a betting standpoint, this matchup belongs in the same conversation as the 2018 Amanda Nunes-Cris Cyborg featherweight title bout at UFC 232 as one of the most decorated matchups between future Hall-of-Fame fighters that women's MMA has ever seen. Zhang, the 36-year-old Chinese star, is 10-0 inside the Octagon against everyone not named Rose Namajunas (who she lost to twice). The 37-year-old Shevchenko, meanwhile, is 14-1-1 in the UFC against everyone not named Nunes (who she lost to twice at bantamweight) and she avenged her lone flyweight loss (a 2023 submission against Alexa Grasso) in their trilogy one year later. Shevchenko can also tie Nunes with a victory for most title wins in UFC women's history with 10. Talk about two fighters meeting at a historic point with so much at stake and so many combined accolades between them. Even better, the winner will likely have scored the defining victory of their respective (and incredible) careers.\n4. The welterweight division will be on full displayFrom No. 1 to 15 in the rankings, there isn't a division within UFC as deep and full of title-ready participants than that of 170 pounds. Not only will the title be at stake in Saturday's main event, a pair of additional well-matched bouts on the PPV main card should go a long way in shaking up the overall title picture (just one week out from an incredible Ian Machado Garry fight against Muhammad in the co-main event at UFC Qatar). The 18-1 Sean Brady has only lost as a pro to Muhammad and the Philadelphia grappler brings a three-fight win streak into a mouth-watering bout against the explosive striking of Michael Morales, who is 18-0 with 13 knockouts. Meanwhile, former champion Leon Edwards looks to shake off a two-fight losing skid when he welcomes the red-hot striking skills of Carlos Prates, who is 5-1 in UFC with five spectacular knockouts. In all, five of the division's top 10 fighters will be competing at UFC 322 in what amounts to a true showcase of the diverse talent welterweight has to offer. \n5. It's referendum time for three-time NCAA wrestling champion Bo NickalJust three years and eight fights into his pro MMA career, the former Penn State standout has gone from can't-miss prospect who once received a pair of showcase appearances on \"The Dana White Contender Series\" to one of the company's biggest question marks. The 29-year-old Nickal might be 7-1 as a pro but his lone defeat in May was an absolute disaster when grappling ace Reinier de Ridder gassed him out and stopped him with knees to the body in Round 2. This came just one fight after he hung on to defeat Paul Craig by decision in a woeful striking performance in which Nickal refused to shoot for a takedown while being booed by the crowd. It's not that Nickal is lacking in talent. His ground game, which was showcased throughout a trio of stoppage wins to open his UFC run beginning in 2023, remains strong from both a wrestling and submission standpoint. But Nickal's critics have pointed to his sometimes delusional responses as to where his game is truly at, including a 2024 interview in which Nickal said he would likely be a -1000 betting favorite by the time he faces Khamzat Chimaev, who has since gone on to win the UFC middleweight title. Nickal returns on the featured prelim bout against 36-year-old submission ace Rodolfo Viera, who is 6-3 since making his UFC debut in 2019. Even though Nickal has held strong as a betting favorite, the jury is still out as to whether he can mix his striking and wrestling together in complimentary ways while living up to the pressure that comes with being such a prized prospect. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 322 fight card -- Makhachev vs. Della Maddalena: Top storylines to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/4cb489ba-eef8-493a-8790-b53cf15a8db1/thumbnail/1200x675/a4310cac5eab45079052a84055a36416/jdm-makhachev-nyc-ufc-322.jpg"
      ],
      "datePublished": "2025-11-10T22:36:19.000Z",
      "dateModified": "2025-11-10T22:36:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zay Jones injury updates: Cardinals WR out for rest of season with torn Achilles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/zay-jones-injury-updates-cardinals-receiver-out-for-remainder-of-season-with-torn-achilles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/8b8954a3-7e45-4506-8419-0881d4713390/thumbnail/1200x675/d9610068f06d3e886d8f884bfa75d9bf/zay-jones-cardinals.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:40:44.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cardinals wide receiver Zay Jones suffered a torn ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cardinals wide receiver Zay Jones suffered a torn Achilles Sunday against the Seahawks when he turned to complain to an official about not getting a call in his favor. The injury will sideline him for the remainder of the season, coach Jonathan Gannon said Monday. Jones appeared to take a few steps after getting hurt, just before going down to the turf. Medical personnel helped him off the field, and the team ruled him out shortly thereafter.\nSeveral telltale signs of a torn Achilles were present: Jones looked down at the back of his leg as if someone had kicked him, and slow-motion replays showed a clear \"pop\" in his calf.The Cardinals were already down by 35 points in an eventual 44-22 loss when the Jones injury occurred, making the injury yet another brutal turn of events in what had already been a disastrous afternoon for Arizona.\n        \n            \n                NFL QB carousel already spinning: Kyler Murray's future, Jets' next move and more\n                \n                    Jonathan Jones                \n            \n                            \n    \n                \n                    \n    \nJones, 30, has dealt with several injuries throughout his NFL career, including multiple shoulder ailments, knee and hamstring issues and a concussion. This is his second season with Arizona; he has also spent time with the Bills (who drafted him in the second round in 2017), Raiders and Jaguars.\nThe Cardinals have dealt with several injuries this season; starting quarterback Kyler Murray (foot) has not played in over a month and was recently placed on IR. James Conner was lost for the season early in the year, and backup Trey Benson got injured shortly after that. Starting cornerbacks Will Johnson and Max Melton were also out against the Seahawks.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zay Jones injury updates: Cardinals WR out for rest of season with torn Achilles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/8b8954a3-7e45-4506-8419-0881d4713390/thumbnail/1200x675/d9610068f06d3e886d8f884bfa75d9bf/zay-jones-cardinals.jpg"
      ],
      "datePublished": "2025-11-11T00:40:44.000Z",
      "dateModified": "2025-11-11T00:40:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Garrett Wilson injury updates: Jets WR avoids knee surgery, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/garrett-wilson-injury-updates-jets-wr-avoids-surgery-will-miss-3-4-weeks-with-knee-sprain-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/a6d8842f-0e21-40b2-a24c-3b9ca8a08f44/thumbnail/1200x675/68609fb9e2eefeb7103240c19f61647a/gettyimages-2236818202-2.jpg",
    "tag": "Sports",
    "date": "2025-11-10T22:22:37.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        New York Jets wide receiver Garrett Wilson will mi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        New York Jets wide receiver Garrett Wilson will miss more time during an injury-plagued season with his second knee issue of the campaign. According to ESPN, the star wideout is expected to miss at least three to four weeks with a knee sprain, which he sustained in Sunday's win over the Cleveland Browns. The silver lining is that Wilson will not require surgery, thus aiding in the likelihood that he returns before the end of the regular season.The looming absence will mark Wilson's second multi-week recovery of the year. He sat out of the Jets' Week 7 and Week 8 games due to a hyperextended knee and returned after the team's bye week. It was just one game back on the field for the former first-round pick, though, before he landed back on the shelf with another ailment.Wilson left in the second half on Sunday and did not return to the game. He limped off the field after an attempted diving catch, and coach Aaron Glenn confirmed after the victory that Wilson suffered another injury to the same knee that hampered him earlier in the year.The early exit kept Wilson out of the box score as he did not haul in any of his three targets for catches. It was a quiet day for the Jets' passing game as a whole. Quarterback Justin Fields completed six passes for 54 yards, and all but 12 of those yards came on one connection with running back Breece Hall.\nWilson's injury comes at an inopportune time for the Jets, who have momentum for the first time this year. New York won each of its last two games, reversing its fortunes after a dreadful 0-7 start. And it did so in a couple of different fashions, leaning on its offense in a 39-38 shootout with the Cincinnati Bengals and relying on its defense in a 27-20 battle with the Browns.The multiple absences will likely prevent Wilson from reaching the 1,000-yard mark this season. If that is the case, it will be the first time in his four years as a pro that he does not crack that threshold. His four touchdowns, however, are the second-most of his career.\nIf Wilson misses just three games, he would be back in the lineup for the Jets' Dec. 7 matchup with the Miami Dolphins. A four-game spell would have him return for a Dec. 14 trip to face the Jacksonville Jaguars.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Garrett Wilson injury updates: Jets WR avoids knee surgery, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/a6d8842f-0e21-40b2-a24c-3b9ca8a08f44/thumbnail/1200x675/68609fb9e2eefeb7103240c19f61647a/gettyimages-2236818202-2.jpg"
      ],
      "datePublished": "2025-11-10T22:22:37.000Z",
      "dateModified": "2025-11-10T22:22:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UCLA freshman Sienna Betts ruled out of clash vs. No. 6 Oklahoma with leg injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/ucla-freshman-sienna-betts-ruled-out-oklahoma-left-leg-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/ae84ad4e-e5f5-443b-b6c1-104d4984345d/thumbnail/1200x675/d815f487d2937a7056199d6880f3310a/ucla-sienna-betts-injury.png",
    "tag": "Sports",
    "date": "2025-11-10T21:03:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UCLA freshman Sienna Betts will miss the No. 3 Bru",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UCLA freshman Sienna Betts will miss the No. 3 Bruins' Top 10 matchup against No. 6 Oklahoma on Monday night while still dealing with a left leg injury. She is no longer in a boot but is still working toward full recovery. Betts, the No. 2 player of the 247Sports class of 2025 rankings, got injured during a scrimmage against UC Riverside on Oct. 19 and has yet to make her college debut. She has been doing individual work during practices, but has still not been cleared for contact. Betts and the training staff are taking her recovery day by day and haven't announced a specific timeline for her return.Despite not playing a game yet, the 6-foot-4 forward is expected to be an impactful part of the roster. Betts is the younger sister of UCLA star center Lauren Betts, but she brings her own skillset and talent. Sienna averaged 23 points and 16.5 rebounds per game during her senior year at Grandview High School in Colorado, and Close has talked about how her \"challenger\" personality will help make the team even more competitive.\nThe Bruins are fresh off their first-ever NCAA Tournament Final Four appearance, and the expectations remain high this season. The matchup against Oklahoma will be a good test for both teams because the Sooners are coming off of their first Sweet 16 appearance in over a decade. One of the biggest storylines of this game was supposed to be Betts playing against No. 1 freshman Aaliyah Chavez, but that encounter will have to wait a little longer. Five Bruins have averaged double figures in the first two games, led by Gabriela Jaquez and Lauren Betts. Meanwhile, Oklahoma has four double-digit scorers with leader Reagan Beers averaging 29 points per contest. There will be a lot of talent on the court, and the venue also makes this matchup stand out. The game will take place at Golden 1 Center, which will host the Sacramento Regional of the 2026 NCAA Tournament.\nNo. 3 UCLA vs. No. 6 Oklahoma is set for Monday at 10:30 p.m. ET on Fox Sports. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UCLA freshman Sienna Betts ruled out of clash vs. No. 6 Oklahoma with leg injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/ae84ad4e-e5f5-443b-b6c1-104d4984345d/thumbnail/1200x675/d815f487d2937a7056199d6880f3310a/ucla-sienna-betts-injury.png"
      ],
      "datePublished": "2025-11-10T21:03:04.000Z",
      "dateModified": "2025-11-10T21:03:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jedd Fisch speaks on 'ridiculousness' of coaching carousel as Florida job opens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/jedd-fisch-doubles-down-on-ridiculousness-of-college-football-coaching-carousel-after-florida-job-opens/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/7a406b27-3407-4710-a0e5-a828720e7846/thumbnail/1200x675/449776331b156771264f13a3cbd291f8/gettyimages-2243841465-1.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:22:52.000Z",
    "description": "\n        The work Jedd Fisch accomplished in his first two seasons at Washington, and his propensity to move from one job to another, made him a popul",
    "body": "\n        The work Jedd Fisch accomplished in his first two seasons at Washington, and his propensity to move from one job to another, made him a popular name on the 2025 college football coaching carousel. His alma mater, Florida, is in search of a new coach, which only adds to the speculation that he could bolt from Seattle early in his tenure. Fisch was vocal about his status with the Huskies amid the numerous ongoing coaching searches across the country.While he did not explicitly state his disinterest in other jobs, Fisch made it clear in a lengthy statement that he very much enjoys his position at Washington.\"Those lists are made by people that have no idea what's going on, honestly,\" Fisch said Monday of those speculating about his future. \"They don't know what's happening in our program. They have no idea how excited I am about the youth in our program. They have no idea how excited I am about the fact that we're playing six or seven true freshmen. No idea how excited I am about the fact that Demond Williams, I believe, has a chance over the next year or two years after this to be one of the all-time best quarterbacks that have come through this area.\"If Fisch were to leave Washington after just two seasons, Florida would be the obvious destination. Fisch graduated from Florida in 1998 and landed a job on Steve Spurrier's staff in 1999 as a graduate assistant, making his college coaching debut with the Gators. His ties to the university are deep and provide fuel to the intrigue of a potential return to the Sunshine State.\n\"I don't think that they would know how I enjoy coaching here, that we've spent a ton of money into building this program the way we want to build it, that I had a great hand in all the facilities,\" Fisch said. \"I was a big part of making the decisions on how we wanted to recreate this space to give our players an unbelievable opportunity to have a recovery room that they never had, working on making sure that they have the best nutrition they could possibly have, give them great new meeting rooms, new office spaces for our coaches.\"Beyond Florida, Fisch could be an attractive candidate for a number of the other open jobs across the nation. He has spent time in effectively every region of the country throughout his college and NFL coaching careers, and after resurrecting the Arizona program in short order and positioning Washington for College Football Playoff contention in Year 2, his limited track record as a head coach speaks for itself.\"I think, unfortunately, what happens is they just want to tie coaches to lists,\" Fisch said, \"and then we have to sit there and defend it rather than just be able to just tell our fans -- our players, our coaching staff, myself, my family, we love coaching at the University of Washington.\n\"The ridiculousness of people that want to claim that because my wife and daughters are living in Arizona, because I have a 16-year-old who's been in five different schools in the last eight years to finish her high school, has anything to do with my decision. Or the ridiculousness of just putting my name on a list just to do it. Not only does that affect recruiting, it affects our team, it affects our staff. My hope is that our players, our coaches, our families understand how much we love it at Washington.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jedd Fisch speaks on 'ridiculousness' of coaching carousel as Florida job opens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/7a406b27-3407-4710-a0e5-a828720e7846/thumbnail/1200x675/449776331b156771264f13a3cbd291f8/gettyimages-2243841465-1.jpg"
      ],
      "datePublished": "2025-11-11T00:22:52.000Z",
      "dateModified": "2025-11-11T00:22:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB Rookie of the Year award: Predicting the top candidates for 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2026-mlb-rookie-of-the-year-candidates-yesavage-mcgonigle-mclean-prospects/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/02a83c16-5a78-4e19-8db7-7bbec38dc7f5/thumbnail/1200x675/7e69ff00108e8973f3ca27b9414431d0/yesavage-getty.png",
    "tag": "Sports",
    "date": "2025-11-11T01:19:12.000Z",
    "description": "\n        Athletics first baseman Nick Kurtz and Braves catcher Drake Baldwin have been named the 2025 Rookies of the Year. Kurtz won the award unanimo",
    "body": "\n        Athletics first baseman Nick Kurtz and Braves catcher Drake Baldwin have been named the 2025 Rookies of the Year. Kurtz won the award unanimously following his monster debut season. In most other years, A's shortstop Jacob Wilson or Red Sox outfielder Roman Anthony would have taken home the hardware. They instead finished behind Kurtz. The National League class was stacked -- Baldwin beat out the equally deserving Caleb Durbin (Brewers) and Cade Horton (Cubs). No award gets you excited about the future the way Rookie of the Year  does. It's a young player being recognized for his greatness, and great  young players are what sports hopes are built on. With that in mind,  here's a look ahead at the 2026 rookie class and, more importantly, who could be in the  running for the 2026 Rookie of the Year awards.\n        \n            \n                MLB Rookie of the Year awards: Athletics' Nick Kurtz takes home AL honors, Braves' Drake Baldwin wins in NL\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nAmerican LeagueC Samuel Basallo, Orioles: The O's believe so much in Basallo that they signed him to an eight-year, $67 million extension in August. The 21-year-old mostly struggled during his late-season cameo (.559 OPS in 31 games), though he's already had two walk-off hits, and those 31 games were valuable experience. There's something to be said for taking your lumps, learning what adjustments you have to make, and spending the offseason getting better. Basallo, who did not play enough to exhaust his rookie eligibility, figures to share catcher/DH duty with Adley Rutschman in 2026, which could equal more playing time than the typical rookie catcher. That won't hurt his Rookie of the Year chances.SS Kevin McGonigle, Tigers: Arguably the best prospect in baseball, McGonigle slashed .305/.408/.583 with 19 home runs and more walks (59) than strikeouts (46) across three minor league levels in 2025. He has yet to reach Triple-A and the lack of minor-league seasoning could work against him, but teams increasingly view Triple-A as a pit stop more than a level to spend a full season for development. The shortstop position is wide open in Detroit. McGonigle may not make his MLB debut until June or July, though he wouldn't be the first Rookie of the Year winner to play only half a season in the big leagues, or thereabouts.\nRHP Trey Yesavage, Blue Jays: Baseball fans are already more than familiar with Yesavage given his postseason heroics. He made only three regular-season starts, however, and postseason play does not count toward rookie status, so Yesavage is still eligible for next year's Rookie of the Year award. We've already seen how good he can be on the game's biggest stage, and he'll have the added advantage of not having to compete for a big-league job in spring training. We already know Yesavage will break camp in Toronto's rotation. There's a long way to go between now and then, but given what we know right now, Yesavage has to be considered the 2026 Rookie of the Year frontrunner.National LeagueRHP Bubba Chandler, Pirates: The Pirates slow-played Chandler's development this season, so much so that he admitted he was \"mad\" he was not called up sooner. He pitched well following his August debut, striking out 31 batters against only four walks in 31 ⅓ innings. Impressive command for a rookie, that is. Chandler, 23, neither pitched enough nor spent enough time in the big leagues to exhaust his rookie status. He's eligible for the 2026 Rookie of the Year award and is likely to be part of Pittsburgh's rotation right out of the gate on Opening Day.RHP Nolan McLean, Mets: McLean could've been the National League's version of Yesavage in the postseason had the Mets, you know, made the postseason. The 24-year-old was impressive in his MLB debut this year, pitching to a 2.06 ERA with 57 strikeouts in eight starts and showing lively stuff with movement that can best be described as cartoonish. McLean threw 48 innings for the Mets, two fewer than the 50-inning rookie limit. He remains Rookie of the Year eligible going into next season and is certain to be in New York's season-opening rotation. It's not out of the question that McLean will start Opening Day in 2026.\nIF JJ Wetherholt, Cardinals: Arguably the best all-around prospect in the minors, Wetherholt hit .306/.421/.510 with 17 home runs and nearly as many walks (72) as strikeouts (73) in the minors this season. He played 47 games in Triple-A too. He's knocking on the door. Wetherholt won't unseat Masyn Winn at shortstop but he shouldn't have any trouble playing second or third. The only question is how the Cardinals will make room for him (Brendan Donovan trade?) and how soon they will do it. Wetherholt is about as close to MLB ready as a prospect can get.Mystery League Several prominent Japanese veterans are expected to make their way over to MLB via the posting system this offseason. We don't know where they will sign yet, but the rules say these players will be Rookie of the Year eligible regardless of their age or years of experience in Japan, so we're going to include them here.RHP Tatsuya Imai: Imai, 27, has been one of Japan's top pitchers with the Seibu Lions the last few years, and this year he threw 163 ⅔ innings with 178 strikeouts and a 1.92 ERA. It's the mid-to-upper-90s fastball with the usual deep array of secondary pitches you find with Japanese starters (slider, splitter, curveball, etc.). Imai is not the next Yoshinobu Yamamoto. He's viewed as more of a mid-rotation starter with untapped potential than a plug-and-play ace. The Lions posted Imai this week.\n3B Munetaka Murakami: The 25-year-old Murakami has been on the radar since his historic 56-homer season for the Tokyo Yakult Swallows in 2022, which is the single-season record for a Japanese-born player. The years since have not been quite as dominant, and an oblique injury limited him to 69 games this season, but in that timeframe he hit 24 home runs. There are real questions about Murakami's bat-to-ball ability (his 27.0% strikeout rate in 2025 was well north of the 19.5% league average) and his third base defense, but no one doubts the power. Murakami's 45-day posting window closes Dec. 22.1B/3B Kazuma Okamoto: Perhaps a safer bet to perform right away than Murakami, Okamoto has been one of the Japan's top hitters the last decade. He hit .322/.411/.581 with 15 home runs in 77 games around a non-throwing elbow injury this year (it was a fluke injury suffered in a collision at first base) and has a history of big pull power and excellent contact rates. Okamoto is a bit older than Imai and Murakami (30 in June), which will be baked into the contract. The Yomiuri Giants have never posted a position player in their history (Hideki Matsui left as a free agent). Okamoto will be the first and could land with a team willing to stick with him at third base. He not yet been officially posted.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB Rookie of the Year award: Predicting the top candidates for 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/02a83c16-5a78-4e19-8db7-7bbec38dc7f5/thumbnail/1200x675/7e69ff00108e8973f3ca27b9414431d0/yesavage-getty.png"
      ],
      "datePublished": "2025-11-11T01:19:12.000Z",
      "dateModified": "2025-11-11T01:19:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Monday Night Football SGP bets, props, predictions: Eagles vs. Packers same-game parlay - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-packers-props-sgp-monday-night-football-same-game-parlay-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/d2833ecb-9afb-4f26-baef-a8a41b0a7038/thumbnail/1200x675/3e36e3e0127f4f293ba8b3b20ab733bf/jordan-love-packers-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-10T23:51:52.000Z",
    "description": "\n        NFC powers will collide on 'Monday Night Football' as the Green Bay Packers host the Philadelphia Eagles at 8:15 p.m. ET. The Packers are 1.5",
    "body": "\n        NFC powers will collide on 'Monday Night Football' as the Green Bay Packers host the Philadelphia Eagles at 8:15 p.m. ET. The Packers are 1.5-point favorites, and the over/under is 45. Matthew Golden (shoulder) is inactive for Green Bay. You can conclude NFL Week 10 with a MNF SGP involving Eagles vs. Packers picks versus the spread, on the money line, with the total or in regard to NFL player props. Both backfields are star-laden with Jalen Hurts and Saquon Barkley of Philly countered by Jordan Love and Josh Jacobs of Green Bay. However, consider the recent series history, spread and money line NFL bets will draw lots of attention with this 'Monday Night Football' same-game parlay.The Eagles have both covered and outright won in each of the last three matchups, which includes both a regular season and a playoff game last season. Love had three picks in the latter and will now have to move forward without the services of Tucker Kraft (knee). Is Over 0.5 interceptions (+124) a plus-money NFL prop too good to pass up on with your NFL same-game parlay? Before locking in any Packers vs. Eagles picks for your 'Monday Night Football' SGP, be sure to see the Eagles vs. Packers prop predictions powered by SportsLine's Machine Learning AI.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. Now, the model has analyzed Packers vs. Eagles on Monday Night Football and locked in three confident best bets for an NFL SGP. If you successfully parlay its picks, you'd be looking at a payout of well over 6-1. You can only see the Machine Learning Model player prop predictions for Philadelphia vs. Green Bay here.New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:Top Monday Night Football SGP picksAfter simulating Eagles vs. Packers, SportsLine AI says Love goes Over 233.5 passing yards (-112 at FanDuel). Love has hit the Over with his passing yards prop in four of his last five games, averaging 281.6 yards over this stretch. Also, three of the last four starting quarterbacks the Eagles have faced have had at least 242 passing yards, with only rookie Jaxson Dart being the outlier.The Eagles' run defense has held each of its last two opponents under 90 rushing yards, but their pass rush is a concern as just six teams have fewer sacks. Thus, Green Bay should lean more on Love and the passing game than Jacobs and the ground game. Love is projected to have 280.2 passing yards on average on Monday. This NFL prop is rated 5 stars and could be a part of a winning Monday Night Football SGP. See which other MNF same-game parlay picks to make here, and bet this prop here:How to make Packers vs. Eagles SGP picksIn addition, the SportsLine Machine Learning Model has 13 other NFL props that are rated 4 stars or better, including one that returns plus money, that could be a part of your Eagles vs. Packers SGP picks. You can only see the Machine Learning Model's Monday Night Football NFL parlay at SportsLine.What are the model's top same-game parlay picks you should target with your Packers vs. Eagles predictions? Visit SportsLine now to see the Monday Night Football SGP from the SportsLine Machine Learning Model and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Monday Night Football SGP bets, props, predictions: Eagles vs. Packers same-game parlay - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/d2833ecb-9afb-4f26-baef-a8a41b0a7038/thumbnail/1200x675/3e36e3e0127f4f293ba8b3b20ab733bf/jordan-love-packers-cbs.jpg"
      ],
      "datePublished": "2025-11-10T23:51:52.000Z",
      "dateModified": "2025-11-10T23:51:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football fights fallout: 40 players suspended after weekend brawls - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-fights-fallout-40-players-suspended-two-programs-end-seasons-after-multiple-weekend-brawls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/5290c0c5-0dae-428f-bd6b-be3c25d7d81f/thumbnail/1200x675/2d1ff181f4de3d03591d962dc996dbee/grambling-state-football-helmet.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:03:25.000Z",
    "description": "\n        Tempers erupted in college football this past weekend, igniting on-field brawls and postgame confrontations that led to numerous player suspe",
    "body": "\n        Tempers erupted in college football this past weekend, igniting on-field brawls and postgame confrontations that led to numerous player suspensions, institutional fines and a season-ending decision at the Division III level.The SWAC announced disciplinary actions Monday following a halftime altercation between Bethune-Cookman and Grambling State on Saturday. Video footage captured players from both teams exchanging punches and being thrown along the benches as coaching staff struggled to restore order.\"We're extremely disappointed by the events that transpired during halftime of the Bethune-Cookman at Grambling State football game,\" SWAC commissioner Dr. Charles McClelland said in a release. \"Acts of that nature have zero place in the Southwestern Athletic Conference and intercollegiate athletics. The Conference Office has and will continue to enforce a zero-tolerance policy for all acts deemed to be unsportsmanlike and contrary to the high standard of good sportsmanship we expect from all individuals associated with the athletics programs within our league.\"A total of 27 players -- nine from Bethune-Cookman and 18 from Grambling State -- were suspended, with three receiving two-game suspensions for particularly severe conduct. However, specific names were not given. Additionally, fines of $25,000 and $40,000 were levied against Bethune-Cookman and Grambling State, respectively.\nGrambling State coach Mickey Joseph defended his players after the 31-23 win, suggesting that Bethune-Cookman's delayed exit from the locker room contributed to the escalation.\"That's the disrespect stuff,\" Joseph said, via KNOE-TV's Clay Witt. \"We're not going to tolerate disrespect here at Grambling. You won't disrespect us. We're going to meet disrespect with disrespect.\"On Monday, Joseph clarified in a prepared statement that his comments were not meant to condone violence.\nTexas State-Louisiana postgame scuffle results in 13 player suspensionsThe Sun Belt handed down several suspensions after a postgame confrontation following Louisiana's 42-39 win against Texas State. The conflict began during the final offensive plays and intensified as players and coaches gathered for postgame handshakes, ultimately spilling into the stadium tunnel.\nTexas State had six players suspended, including defensive end Tymere Jackson for two games. Louisiana suspended seven players, with safety Tyree Skipper sidelined for the remainder of the season, including any potential bowl game.Louisiana suspensions:Tyree Skipper*, safety (remainder of the 2025 season including any potential bowl game)Kaliep Edwards, linebacker (1 game)Courtline Flowers*, safety (1 game)Kody Jackson, safety (1 game)Collin Jacob, safety (1 game)De'Antonio Lesueur, defensive lineman (1 game)Evan Stroman, wide receiver (1 game)Texas State suspensions:Tymere Jackson*, defensive end (2 games)Khamari Terrell*, cornerback (1 game)Justin DeLeon*, offensive line (1 game)Kyran Bourda, defensive line (1 game)J.P. Deeter, defensive line (1 game)Devarrick Woods, defensive line (1 game)* denotes starterThe altercation has left both programs dealing with fallout from the incident while trying to chase bowl eligibility in the final weeks of the season.\n\"We got some preliminary stuff that we're trying to sort through, trying to appeal some of them,\" Louisiana coach Michael Desormeaux said Monday. \"I just think it's really hard. I mean you get attacked and I don't know how you're supposed to respond. I don't understand how this wasn't cleared up before once it broke the first time I don't understand how we didn't get people off the field. I just don't understand how this happened.\"Louisiana's next game is scheduled at Arkansas State on Nov. 20, while Texas State travels to Southern Mississippi on Saturday.ODAC ends Guilford, Averett seasons after postgame altercationAt the Division III level, the Old Dominion Athletic Conference (ODAC) made the unprecedented decision to end the football seasons of Guilford College and Averett University following a postgame altercation this past Saturday. Both schools will forfeit their remaining game, with opponents Bridgewater College and Roanoke College having the opportunity to play against each other to complete their season.\n\"While competition is at the heart of what we do, the integrity with which we compete defines who we are,\" ODAC commissioner Brad Bankston said in a release. \"The actions following Saturday's contest did not reflect those values, and this decision underscores our commitment to maintaining the standards our conference represents. I want to thank both schools for their cooperation and open dialogue in reaching this decision.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football fights fallout: 40 players suspended after weekend brawls - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/5290c0c5-0dae-428f-bd6b-be3c25d7d81f/thumbnail/1200x675/2d1ff181f4de3d03591d962dc996dbee/grambling-state-football-helmet.jpg"
      ],
      "datePublished": "2025-11-11T00:03:25.000Z",
      "dateModified": "2025-11-11T00:03:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lane Kiffin lays out criteria for good coaching job amid Florida speculation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-lays-out-criteria-for-quality-coaching-job-says-blue-bloods-still-have-inherent-advantages/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/6a60d04c-ee2a-42d8-a51a-5aaf3951787e/thumbnail/1200x675/f2b41e832f5056bce00b8b7ef666cf12/gettyimages-2244520146-2.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:13:13.000Z",
    "description": "\n        Lane Kiffin is the hottest name on the college football coaching carousel. If he wants to leave Ole Miss, Kiffin will get to pick between som",
    "body": "\n        Lane Kiffin is the hottest name on the college football coaching carousel. If he wants to leave Ole Miss, Kiffin will get to pick between some of the top programs in the country, and he already has a checklist for what makes a great job.Rumored to be the top priority for Florida's vacancy, Kiffin was asked about what makes a \"good\" college coaching job at his Monday press conference, just days before the Gators roll into Oxford.In a lengthy answer, the sixth-year Rebels coach said the days of worrying about \"facilities\" or \"practice fields\" are long gone. NIL and revenue sharing have changed the college football landscape, and Kiffin said as much, drawing comparisons to \"baseball and the payrolls.\" Those with the most money win more often than not.However, even in the era of teams firing money cannons at the transfer portal and high school recruiting, Kiffin admitted that the \"blue blood\" programs still have inherent advantages over everyone else.\"People will say it's narrowed, and some stuff has narrowed because you can't stockpile [talent] at those blue bloods, or however you want to refer to it,\" Kiffin said. \"But there are still things where you're gonna struggle to beat those guys because kids get recruited, and they see the size of stadiums, traditions, Heismans and national championships. Then your location to talent. I think all of those are in there.\"\nFlorida just happens to be one of the few programs that checks all of those boxes. The Swamp seats just shy of 89,000 fans, the Gators have three national championships and three Heisman Trophy winners, and Florida is one of the most talent-rich football states in the country.Now, there are other schools that meet those criteria as well, including an LSU team in the midst of its own coaching search. Alabama, Texas and Ohio State all fit the bill when discussing those blue bloods.Does that mean Kiffin would immediately jump ship for those jobs if they came open tomorrow? Not necessarily, but by Kiffin's own admission, those programs have a leg up on others. If he wants to coach with those advantages on his side, Florida would certainly be a fit.\nFor the moment, though, Kiffin's focus is on defeating the Gators. With Ole Miss at 8-1 and No. 6 in the initial College Football Playoff rankings, the first playoff berth of Kiffin's tenure in Oxford is well within reach.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lane Kiffin lays out criteria for good coaching job amid Florida speculation - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/6a60d04c-ee2a-42d8-a51a-5aaf3951787e/thumbnail/1200x675/f2b41e832f5056bce00b8b7ef666cf12/gettyimages-2244520146-2.jpg"
      ],
      "datePublished": "2025-11-11T00:13:13.000Z",
      "dateModified": "2025-11-11T00:13:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool's faint Premier League hopes hinge on embracing need for change - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arne-slot-liverpool-premier-league-chances-dwindling/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/ac2a0240-e6c1-44c9-96f8-140351cbff03/thumbnail/1200x675/556a156e7e936447c83c760b7080edfc/slot.jpg",
    "tag": "Sports",
    "date": "2025-11-10T22:26:53.000Z",
    "description": "\n        As Arne Slot was laying out what needs to happen before his side can even start thinking about a title race, it was hard to shake the sense t",
    "body": "\n        As Arne Slot was laying out what needs to happen before his side can even start thinking about a title race, it was hard to shake the sense that you'd heard this all before. Not, it should be noted, from Slot himself. Before this almighty slide, he had never had to set his team the target of \"result after result after result.\"In doing so, however, he cast this particular mind (London warped, watches too much Arsenal) back 364 days to what seemed to be the all too early end point of another title challenge. Mikel Arteta had just seen his side cede further ground to the leaders with a 2-2 draw at Chelsea. He too insisted now was not the time to discuss a title race that so many had expected them to be key riders in, that all his side could do from here on out was \"win, win, win, win, win, win, win and win.\"History records that Arsenal did not manage to do as their manager commanded. Indeed, only twice did they \"win, win, win.\" A point further from the top than the eight-point hole Liverpool find themselves, Arteta's side never regained the ground they had given up in the first third of the season. The standards they set themselves were too vertiginous. One wobble begot another; the gap felt too wide and players couldn't help but let their focus drift to the competitions they were still alive in.Already you can see how that might be a template for Liverpool in 2025-26. Between now and Christmas, their league fixtures look rather more favorable but it only takes a rough trip to the London Stadium or some off color finishing against Robin Roefs and there's a chance for Arsenal and Manchester City to push away.\nAs Andrew Robertson acknowledged, what comes next could be an almighty slog. \"We've given ourselves a huge uphill battle,\" he said after the 3-0 loss at the Etihad, \"but I don't think any of the teams will really look at the league table until we're halfway through. That's what we've got to do but we've got to pick up points on a more consistent basis. Then let's see where we are after Christmas time or whatever. We've just got to focus on ourselves and focus on performance levels.\"I don't think you can talk about the title this early on in the season, regardless of what position you're in, but you need to then consistently start winning games again for that to even come into question. It's definitely not a question that's getting spoken about in the changing room or anything. We just need to get back to the levels that we know we can, the levels that we brought the last two games in particular. If we do that on a more regular basis, then we pick up more points than we won't.\"Selection troublesSomething needs to change drastically with Liverpool. That may start on a tactical level. Slot went back to last season's template with great success against Aston Villa and Real Madrid last week, wins which delivered two of the meager four clean sheets this side have kept in 17 games. It is worth noting that the man himself had spoken of his qualms that that particular approach might have been figured out by opponents at the end of last season. After all, the champions have lost 40 percent of their games since Paris Saint-Germain slipped by them in the Champions League. The problems might have been exacerbated, for now, by the hierarchy's actions in the window but that's the point. They were there.\nThat much was apparent as City brushed them aside. To many it would have seemed like Liverpool lacked the stomach for the fight, that the events of the preceding eight days had taken too much out of them, a worrying sign indeed given that their hosts had played 24 hours later. Instead Slot laid the blame for the first half struggles on himself. \n        \n            \n                Liverpool's title defense over? Loss to Man City after Real Madrid win in UCL showcases alarming inconsistency\n                \n                    James Benge                \n            \n                            \n    \n                \n                    \n    \n\"It's easy for players to win their duels if the game plan and the tactics are working and I think that's what it did against Villa and what it did against Madrid,\" he said. \"We struggled now a lot with them bringing so many players into the centre of the pitch and it was difficult then for some of our players to make the right decisions. It wasn't about my players not wanting to make the duel, they had to run a lot because [City] were so much better on the ball than us.\"Out of possession, Liverpool tend to defend in something between a 4-2-3-1 and a 4-2-4, depending on whether Dominik Szoboszlai is pushed up into the front line of the press. In the first half, City found the holes in that with supreme efficiency, Rayan Cherki drifting infield to give his side at least four options to stretch apart Liverpool's three, Erling Haaland also dropping off the front line on occasion to add more ballast. Liverpool could only respond by chucking more and more bodies into midfield positions, in doing so, leaving Conor Bradley defenseless as Jeremy Doku put him in the blender. \nNow there are only a handful of teams who can do to Liverpool what a near-peak efficiency City did. Not many of them play in the Premier League. If, for instance, Nuno Espirito Santo fancies packing the middle with Tomas Souceks and James Ward-Prowses in three weeks' time then that will probably be a win for Slot. This is, however, only one of a few ways to skin this particular Liverpool cat.There is certainly a bit of misfortune in their record of dead-ball concession, seven goals against from 3.4 xG, but Slot's seeming dismissal of Nico Gonzalez's goal, City's second, as nothing more than \"a set piece\" was alarming. Teams are allowed to defend these and it was alarming how poorly prepared Liverpool seemed when their opponent manoeuvred a corner around with a few short passes.Those comparisons to last season's Arsenal rear their heads when you consider the injuries, too. Certainly, Liverpool haven't yet been dogged by the sort of relentless blows that hit the Gunners later on in 2024-25 but at this stage of last season that wasn't the issue for the title challengers. They had really just lost one load-bearing figure in their structure, Martin Odegaard, who limped back from an ankle injury too soon because the attack just couldn't get going without him.\nIn Liverpool's case, you sub in not Alexander Isak (though it might help to have him competing with Hugo Ekitike now the Frenchman has gone off the boil) but Alisson. Giorgi Mamardashvili has performed ably since stepping in between the sticks, not least in saving Haaland's penalty, but he is not the best one vs. one goalkeeper of his generation. Nor does he have Alisson's ball-playing skills, the sweeping skills that can push a defensive line five yards up the pitch nor an authority that radiates beyond the backline. At a time when so many of the totems of last season's title win are askew -- the Ibrahima Konate, Virgil van Dijk axis, Alexis Mac Allister, Mohamed Salah -- they need the transformative impact of the best goalkeeper in the game.Can Liverpool get 'result after result?'If nothing else, it would help no end to have a truly elite goalkeeper while they are as vulnerable down the flanks as they have been so far this season. Right now, there is not much of a case to be made that Liverpool can get \"result after result,\" given how their defensive standards have slipped this season. Once more, the parallels with old Arsenal are striking, perhaps even a bit more pronounced. Eleven games into the campaign, Arteta's side had gone from holding teams to an exceptional 0.69 non-penalty expected goals (npxG) per game to 1.03. Liverpool too have faltered, allowing a rot that began to set in around March to carry on into a season where they are allowing 1.12 npxG per game. To consistently deliver title-winning results with those sort of underlying defensive metrics requires one of the greatest attacks in the sport. Liverpool don't have that. They have scored 18 in 11 Premier League games, good for sixth most, and have 17.25 npxG, seventh best. When that gives you an npxG difference that that is only the fifth best in the league at 0.44 per game, you aren't profiling as a team that is going to go on a run. The narrative arc of this season might feel like Arsenal's but the data is closer to 2024-25 Aston Villa, who would go on to pick up 48 points from their remaining 27 games of the season. Suffice to say they never got \"result after result after result.\"\nThat was in a division that might have been more stratified than this season's. The story of the first 11 games of the season is, as Slot put it, \"one team is quite far ahead ... the rest is quite close.\" There is no great gap in npxG difference either. From Liverpool at 4.88 to Tottenham at -4.26 there are 14 teams. Perhaps only Wolverhampton Wanderers and Burnley are legitimately bad this season. Take out maybe half the gimme games there were last year and it becomes so much harder to get on a roll. On paper, Liverpool face teams ranked 18th and 19th immediately after the international break and then two newly promoted sides. In reality, both West Ham and Nottingham Forest look to be toughening up under veteran coaches well versed in defend and counter play. Leeds on an Elland Road night sounds like a tough task too, Sunderland might not be the same force away from the Stadium of Light but would you bet on them not giving Liverpool a bloody nose after what they did to Arsenal?It felt the same for the Gunners 12 months ago after all. They thought they'd got through the hard part and that succour was on the horizon. Instead they ended up as living proof that even title contenders can't flick a switch and \"win, win, win.\" If that is true of Liverpool, then their title race is already run.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool's faint Premier League hopes hinge on embracing need for change - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/ac2a0240-e6c1-44c9-96f8-140351cbff03/thumbnail/1200x675/556a156e7e936447c83c760b7080edfc/slot.jpg"
      ],
      "datePublished": "2025-11-10T22:26:53.000Z",
      "dateModified": "2025-11-10T22:26:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/golazo-newsletter-liverpool-premier-league-hopes-gone-ucwl-returns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/8c092e39-d0a2-4241-b5a5-2ac464630730/thumbnail/1200x675/45b2e00d6fde2179c21ada98769f5e43/lfc-8.jpg",
    "tag": "Sports",
    "date": "2025-11-10T21:59:20.000Z",
    "description": "\n        Happy men's international break to all who celebrate! Manchester City went into the break on a high with a statement-making win over Liverpoo",
    "body": "\n        Happy men's international break to all who celebrate! Manchester City went into the break on a high with a statement-making win over Liverpool, while the UEFA Women's Champions League soaks up the spotlight midweek. I'm Pardeep Cattry with the latest to start a new week.📺 Footy fixAll times U.S./EasternTuesday, Nov. 11🇪🇺 UWCL: Roma vs. Valarenga, 12:45 p.m. ➡️ Paramount+, CBS Sports Network🇪🇺 UWCL: Real Madrid vs. Paris FC, 3 p.m. ➡️ Paramount+, CBS Sports Golazo Network🇪🇺 UWCL: St. Polten vs. Chelsea, 3 p.m. ➡️ Paramount+🇪🇺 UWCL: OL Lyonnes vs. Wolfsburg, 3 p.m. ➡️ Paramount+, CBS Sports Network⚽ The Forward Line🏴󠁧󠁢󠁥󠁮󠁧󠁿 A title contender bites the dustIt is definitely too early to anoint a Premier League champion, but 11 games in, it just might be time to ring the death knell on Liverpool's chances of going all the way. The Reds notched a 3-0 defeat at Manchester City on Sunday, completely outmatched by Pep Guardiola's side as first place slips further out of reach for Arne Slot's group.Liverpool's 1-0 win over Real Madrid in the UEFA Champions League may have inspired some confidence that things are finally trending in the right direction for Slot's side, but on Sunday, their imperfections were once again clear to see. The manager went with an identical lineup and received an early boost as Giorgi Mamardashvili saved Erling Haaland's penalty, all while ruing Virgil van Dijk's disallowed goal in the first half and hyping up the fact that they limited City to just 0.81 expected goals outside of the spotkick. None of it erases the fact that the Reds took just one shot on target and had just 0.71 expected goals of their own to speak of. As James Benge observed at Etihad Stadium, Liverpool have done little to address the problems that have plagued them all season long.\nBenge: \"When they return [from the international break], they will do so to a team that has not addressed the issues that have been apparent since the Community Shield. This team cannot defend its flanks … The problem wasn't [Conor] Bradley. There are maybe a handful of fullbacks in world football who could have dealt with [Jeremy] Doku in his current form. Liverpool threw two at him, but Dominik Szoboszlai was no more effective a shield. On the rare occasions where [Mohamed] Salah did track back, you could see why Slot was so prepared to let him shade the defending last season.\"The defeat leaves them in eighth place, eight points adrift of the first-place spot they had such a firm grip on this time last season. City were also imperfect, but Haaland finally had a supporting cast join him on the scoresheet as Doku and Josko Gvardiol each bagged a goal of their own. Guardiola's side are now just four points behind Arsenal after 11 games, positioning themselves as the most likely title challenger as the race for top spot begins to take shape. Matchday 3  🔜\n                                                                    Paramount+\n                                                            🔗  Midfield Link Play🇫🇷🇩🇪 Lyon look to extend perfect UWCL startIt may still be early days in this season's edition of the UEFA Women's Champions League but heading into Matchday 3, a few teams have already begun to stake their claim as potential winners. Five teams enter this week's fixtures with two wins out of two, the list including a match of surprises like Wolfsburg, Manchester United and Real Madrid. They are joined by two heavyweights in Barcelona and OL Lyoness, the latter of which can extend that winning streak on Tuesday when they host Wolfsburg.Lyon, the record eight-time UEFA Women's Champions League winners, are the definition of a behemoth but have reinvented themselves to match the modern ambitions of the women's game. A handful of mainstays departed the club in recent years, but a selection of younger stars has replaced them – midfielders Melchie Dumonay and Lily Yohannes have stolen the show in their first wins of the European season, Dumonay doing so in a 2-1 win at reigning champions Arsenal on Matchday 1. It is appropriate, then, that their slogan of the season is \"New Story, Same Legend,\" especially so under new ownership and management. Ballon d'Or winner Ada Hegerberg, one of the team's mainstays during a period of transition, said in a recent interview that the newcomers have been welcome additions to a storied Lyon team, including new manager Jonatan Giraldez.\nHegerberg: \"He's a guy who is very intense in the way he wants to work. He's very competitive, and I find that very positive. I like competition. He's already doing his interviews in French, which shows commitment and leadership our team like Lyon. I hope we manage to work hard together, and do what he wants to develop as a team, because that's what we need moving forward. It's exciting. We have to build, stone by stone, piece by piece and make sure we achieve something.\"How quickly Giraldez can put all the new pieces together is the big question that faces Lyon this season, including in Tuesday's clash against Wolfsburg. Lyon will be heavily favored but this match will mark an important opportunity for Giraldez's side to create some distance between them and the other Champions League participants, with only the league phase's four teams guaranteed direct qualification for the quarterfinals.🔗  Top Stories🏆 \"We're not underdogs\": Gotham FC pulled off the first big upset of the NWSL playoffs, ousting No. 1 Kansas City Current in extra time to set up a semifinal meeting with the Orlando Pride. Plus, the Washington Spirit will host the Portland Thorns as the last four NWSL champions make up the last four teams standing.🆕 NWSL to Atlanta: The NWSL will reportedly award Atlanta with an expansion team, accepting a league record expansion fee of $165 million for a franchise backed by the owners of MLS' Atlanta United and the NFL's Atlanta Falcons.\n🔴 A \"clear\" mistake?: Liverpool manager Arne Slot said it was \"obvious and clear that the wrong decision had been made\" when Virgil van Dijk's goal was disallowed in the first half of his side's loss at Manchester City.🌴 Miami advance: Lionel Messi scored a brace in Inter Miami's 4-0 win over Nashville SC on Saturday, booking a berth in Eastern Conference semifinals against FC Cincinnati in the process.💰  The Back Line💵 Best betsUEFA Women's Champions League: OL Lyonnes vs. Wolfsburg, Tuesday, 3 p.m.💰 THE PICK: Under 2.5 goals scored (+140) – OL Lyonnes enter this match as the clear favorites, with talented attackers like Tabitha Chawinga and Melchie Dumonay likely to lead the charge as they look for a third win in three. Wolfsburg may still come out on the losing side despite their best efforts but goalkeeper Stina Johannes may have it in her to come up with a big performance that at least restricts Lyon's attacking might, especially since the French side are only off to a modest start up top with just five goals in two games so far this season in Europe.For more picks, predictions, expert tips and the latest betting news, don't miss out on CBSSports.com's betting home page.\n📺  What We're Watching\n                                                                    Paramount+\n                                                            What's on CBS Sports Golazo Network🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool's Premier League title hopes are likely over after loss to Manchester City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/8c092e39-d0a2-4241-b5a5-2ac464630730/thumbnail/1200x675/45b2e00d6fde2179c21ada98769f5e43/lfc-8.jpg"
      ],
      "datePublished": "2025-11-10T21:59:20.000Z",
      "dateModified": "2025-11-10T21:59:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL Power Rankings: NJ/NY Gotham again a team of destiny? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-power-rankings-playoffs-gotham-fc-believe-after-huge-upset-portland-thorns-clear-underdogs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/9667270d-6d8f-4149-87d5-2bd3a587c631/thumbnail/1200x675/9216550211327de25c5a99e369352045/power-rankings-soccer-nwsl-template.png",
    "tag": "Sports",
    "date": "2025-11-10T21:31:40.000Z",
    "description": "\n        The NWSL's great promise is its parity, a theory the Kansas City Current downright rejected as the runaway winners of the Shield, commanding ",
    "body": "\n        The NWSL's great promise is its parity, a theory the Kansas City Current downright rejected as the runaway winners of the Shield, commanding a 21 point lead between first and second place at the conclusion of the regular season. The Current's surprise elimination by Gotham FC on Sunday, though, means it just might be anyone's game as the postseason reaches its penultimate stage, setting up for an intriguing final batch of games this season.At this point, the NWSL Championship just might be the Washington Spirit's to lose, partially by default as the highest seed left in the playoffs. It would not be hard to envision a single one of the semifinalists winning the whole thing, each of them heavyweights in their own right – the Orlando Pride, Gotham, the Portland Thorns and the Spirit are the last four NWSL champions. The quartet feel as evenly matched as it gets, though – none of the remaining teams enter the semifinals in perfect shape, but have demonstrated an ability to problem solve with the talented players that they have.Here's a look at where each team stands as they target a spot in the NWSL Championship on Nov. 22 at San Jose's PayPal Park.NWSL Playoffs semifinal scheduleAll times U.S./EasternSaturday, Nov. 15Washington Spirit vs. Portland Thorns, 12 p.m. (CBS, Paramount+)\nSunday, Nov. 16Orlando Pride vs. Gotham FC, 3 p.m. (ABC, ESPN+)4. Portland ThornsThe Portland Thorns have punched above their weight all season long, rising all the way to a third place finish and booking a berth in the playoff semifinals. They have reached these heights because of an overreliance on midfielder Sam Coffey, who has often made up for her team's defensive vulnerabilities during a career-best season. The Thorns may finally be peaking at the right time, though – Olivia Moultrie's run of eight goals and one assist in her last 11 games for club and country gives her side an attacking edge that they have missed at times this season.3. Orlando PrideThe Orlando Pride's end product has slowed since Barbra Banda sustained a season-ending hip injury in August, scoring just 11 goals in the 10 regular season games she missed down the stretch. The good news for the Pride, though, is that they are well-positioned to survive the issue – they won the NWSL Championship a year ago with a gritty 1-0 win over the Spirit, opting to absorb the opponent's pressure after taking an early lead. Reigning defender of the year Emily Sams remains a fixture in the back line, while Lizbeth Ovalle has settled in well and ranks inside the NWSL's top 10 for chances created since Banda's injury.2. Gotham FCIt has been an imperfect season for Gotham but in their 2-1 win over the Current in the quarterfinals, they found a response to the doubts they have faced in recent months. They have been overreliant on MVP candidate Esther Gonzalez, who has scored around 40% of the team's goals this season, but their depth paid off against the Current. Jaedyn Shaw has been a game-changer since her September arrival, showcasing her skill yet again with a goal on Sunday, while Katie Stengel proved to be a surprise hero with the last-gasp game winner in Kansas City. Like the Thorns, they may also have hit their stride at the right time – and could really challenge the Pride's stingy defense if Gonzalez is able to participate in the semifinals.\n1. Washington SpiritThe Spirit's playoff run has centered around Trinity Rodman's availability following an MCL sprain, her return potentially imminent if her recovery has gone as expected. Until Rodman's prognosis suggests otherwise, the Spirit are the team to beat, especially since she is buoyed by Gift Monday and Croix Bethune. Without Rodman, though, the Spirit are a very different team – they have just four wins in 12 matches without her and their goal difference swings from +13 when she is on the field to -3 when she is not.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL Power Rankings: NJ/NY Gotham again a team of destiny? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/9667270d-6d8f-4149-87d5-2bd3a587c631/thumbnail/1200x675/9216550211327de25c5a99e369352045/power-rankings-soccer-nwsl-template.png"
      ],
      "datePublished": "2025-11-10T21:31:40.000Z",
      "dateModified": "2025-11-10T21:31:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How PGA Tour should alter FedEx Cup Fall format after adding two new tournaments - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/pga-tour-alter-fedex-cup-fall-format-new-tournaments-2026-asheville-austin/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/b8615b7c-a95f-4619-a2db-39cdee8efc18/thumbnail/1200x675/4424e6c73c93be60fd57ec3b3b3f02d9/pga-tour-logo-blue-grass-g.jpg",
    "tag": "Sports",
    "date": "2025-11-10T21:24:15.000Z",
    "description": "\n        The PGA Tour on Monday announced that a new tournament will join the FedEx Cup Fall schedule next season, the Biltmore Championship in Ashevi",
    "body": "\n        The PGA Tour on Monday announced that a new tournament will join the FedEx Cup Fall schedule next season, the Biltmore Championship in Asheville, North Carolina. It will be held at The Cliffs at Walnut Cove, one week before the Presidents Cup at Medinah Country Club.The Biltmore Championship marks the second change to the PGA Tour's fall swing as the Good Good Championship was previously announced as joining the slate. That event will be held at Omni Barton Creek Resort & Spa's Fazio Canyons Course in Austin, Texas.Reading the tea leaves, it appears as if the 2026 FedEx Cup Fall will look relatively the same in terms of overall tournaments being played.The Mexico Open, typically held in the regular season, was not on the 2026 schedule; it will instead take place next October. Baycurrent debuted as a new title sponsor in 2025, and it is on board for multiple years, while the Bank of Utah and World Wide Technology have deals through 2027. RSM and Butterfield go through 2028, leaving the Procore Championship in Napa, California, and the Sanderson Farms Championship in Jackson, Mississippi, in flux.\nIf the fall schedule holds or grows, what did PGA Tour CEO Brian Rolapp mean this past summer when he announced that a new competition committee would be driven by three principles: competitive parity, simplicity and scarcity?If scarcity was going to be employed for a portion of the PGA Tour schedule, FedEx Cup Fall would be the first place to pare back, especially when considering what has taken place the last few seasons -- fewer PGA Tour cards up for grabs, smaller fields, elimination of Monday qualifiers, etc. However, whittling down the number of fall tournaments would contradict what Rolapp believes to be one of the PGA Tour's greatest strengths (another one of those three principles): competitive parity.\n\"All sports chase competitive parity,\" said Rolapp at the Tour Championship. \"The PGA Tour has incredible competitive parity and balance among its players today. We're going to lean into this while also maintaining another key characteristic of the PGA Tour: meritocracy. Anyone on Tour who's a good enough golfer should have a shot at winning, and we're going to lean into that and preserve that.\"The FedEx Cup Fall is outlined as a seven-tournament run meant to provide players with an opportunity to secure or improve their position in priority ranking, securing additional playing opportunities for the following season. Those ranked Nos. 51-60 get into the first two signature events, those inside the top 100 receive full-time status on the PGA Tour and down the list it goes.The headliners of these events have not been those players but rather Scottie Scheffler and the U.S. Ryder Cup team at the Procore Championship, Xander Schauffele at the Baycurrent Classic and now Ben Griffin at the World Wide Technology Championship. Meanwhile, some notable names outside the top 50 -- like Jordan Spieth and Tony Finau -- have yet to play in the fall.\nThis may not seem like an issue on the surface -- why would the world No. 1 winning be problematic? -- but it may present an opportunity and chance to improve scarcity and even simplicity while maintaining competitive parity.1. Increase cut-off points, increase the incentive to play In a perfect world, requiring those outside the top 50 in the FedEx Cup standings to play a certain number of tournaments would be the answer, but as we have seen over the last handful of years, professional golfers do not love being told what to do. Instead, adding qualifying tiers for tournaments in the regular season would be the play.The 70-90 range in the FedEx Cup standings is a no man's land with exciting players like Finau, Rasmus Højgaard, Nicolai Højgaard, Davis Thompson and Cam Davis. They may tell themselves they are too far outside the Aon Next 10 (Nos. 51-60) and well-positioned to avoid the top 100 cutoff. Add in exemptions from prior wins, and the incentive to play is close to zero.\nThe same can be said for those like Spieth already inside the Aon Next 10. He has the possibility of sponsor exemptions into signature events to cushion his fall -- that's a conversation for a different day-- and has only dropped one spot in the standings from No. 56 to 57 this fall. Fold in a FedEx Cup Fall champion exemption for all signature events and another cut-off point at No. 75, and it may be enough alter the schedules of players in the same position as Spieth and Finau. 2. Allow play on the DP World Tour to countLook at the DP World Tour's 2026 schedule, and one will find only three PGA Tour events: the Scottish Open, ISCO Championship and Corales Puntcana Championship. With the top 10 players in the Race to Dubai (not otherwise exempt) receiving PGA Tour playing privileges for the following season, on the surface, the strategic alliance between the two leagues has been a bit one-sided.\nA way to help both sides would be allowing those inside the top 50 of the FedEx Cup standings the opportunity to play on the DP World Tour, even if a regular-season tournament goes head-to-head with a non-signature PGA Tour event.While there is still plenty at stake during that time -- like ensuring one is inside the top 50 of the Official World Golf Rankings for major-championship qualification -- that can be achieved anywhere. With some higher-ranked European players like Rory McIlroy and Tommy Fleetwood in those DP World Tour fields, the added depth would mean more OWGR points up for grabs.Factor in what tournaments are played (Irish Open, French Open, Spanish Open), where those tournaments are played (Alfred Dunhill Links plays across St. Andrews, Carnoustie and Kingsbarns, for example) and when those tournaments are played from a U.S. perspective (in the morning before football games kick off). Suddenly, the positives pile up.\n3. Keep adding young players to the fieldWithout the top 50 players in the FedEx Cup standings participating, the composition would be much simpler and give the fall season more of an identity beyond: This is the season for those who want to improve their place on the PGA Tour for the following year.Such a move could lead to additional spots opening in these fields -- the Bermuda Championship only has one player inside the top 50 (Sam Stevens) participating -- but if it does, those should go to young, up-and-coming players, including those who recently graduated from the Korn Ferry Tour.In 2025, not a single rookie qualified for the BMW Championship, meaning no one new to the PGA Tour locked up a spot in the 2026 signature events. After Michael Brennan's win at the Bank of Utah Championship, that number was up to 36 players.\nOn the outside looking in as their PGA Tour careers begin, recent Korn Ferry graduates and soon-to-be rookies would lick their lips at the opportunity of using the fall slate as a way to get their feet underneath them. Both the players and the league would be better off because of it.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How PGA Tour should alter FedEx Cup Fall format after adding two new tournaments - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/b8615b7c-a95f-4619-a2db-39cdee8efc18/thumbnail/1200x675/4424e6c73c93be60fd57ec3b3b3f02d9/pga-tour-logo-blue-grass-g.jpg"
      ],
      "datePublished": "2025-11-10T21:24:15.000Z",
      "dateModified": "2025-11-10T21:24:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs Packers: How to watch, odds, picks, MNF prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-vs-packers-preview-prediction-how-to-watch-monday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/645ace7a-b1ac-4393-8ebb-6793a8df98c5/thumbnail/1200x675/28fe7de74058cc31927ecb96daa7e2db/jalen-hurts-jordan-love.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:39:55.000Z",
    "description": "\n        In the Week 10 edition of \"Monday Night Football,\" the Green Bay Packers play host to the Philadelphia Eagles in an NFC showdown.Green Bay is",
    "body": "\n        In the Week 10 edition of \"Monday Night Football,\" the Green Bay Packers play host to the Philadelphia Eagles in an NFC showdown.Green Bay is coming off a dispiriting loss last week to the Carolina Panthers -- its second loss of the season to a team that it should have beaten badly. The Packers remain right in the thick of things in the race for the NFC North and the top seed in the NFC even after that loss, but they'll need to knock off another contender here to avoid falling backward in both of those chases. The Eagles are coming off their bye in Week 9, having demolished the Giants prior to the break. They seemingly got their offense back in a groove in that contest, and they'll be looking to continue rolling on that front against an excellent Green Bay defense. They're firmly in control of the NFC East at the moment, but they, like the Packers, are looking to keep pace near the top of the conference.Will the Packers bounce back, or will the Eagles deal them another loss? We'll find out soon enough. But before we break down the matchup, here's a look at how you can watch the game.\nLIVE updates: Follow along with all the action as the Eagles battle the Packers on \"Monday Night Football.\"Where to watch Packers vs. Eagles liveDate: Monday, Nov. 10 | Time: 8:15 p.m. ETLocation: Lambeau Field (Green Bay, Wisconsin)TV: ESPN | Stream: Fubo (Try for free) Follow: CBS Sports AppOdds: Packers -1.5; O/U 45.5 (via DraftKings Sportsbook)Bet Packers vs. Eagles at DraftKings Sportsbook, where new users who win a $5 wager get $300 in bonus bets and three free months of NBA League Pass.When the Eagles have the ballWhen we last saw the Eagles, it looked like they were getting things going offensively. \nThey hung a season-high 427 yards, a season-high 23 first downs and a season-high 38 points on the Giants back in Week 8, with Saquon Barkley leading the way with his 14 carries for 150 yards and a score. Saquon left the game briefly with an injury, and Tank Bigsby ran for over 100 yards on just nine carries in his stead. Jalen Hurts was efficient in the passing game with 179 yards on just 20 pass attempts, and he also threw for four touchdowns.Philly should be rested and mostly healthy coming off its bye week, though it faces a tough challenge in a Green Bay defense that has been quite good so far this year. The Packers check in fifth in yards allowed per game and eighth in points allowed per game. They've been especially stingy on the ground (at least until last week against the Panthers), yielding fewer than 100 yards rushing in six of their eight games to date. Further, the only team to total more than 236 net passing yards against them is the Cowboys, so it's not like they're slouches against aerial attacks. \nThe ground game is really the matchup to watch here. The Packers aren't especially big up front, especially after dealing away Kenny Clark in the Micah Parsons trade, but they've nonetheless won in the run game for most of the year. The Eagles, meanwhile, were not the same team running the football for most of the first part of the season that they were last year. Barkley had rarely, if ever, been explosive through the first seven weeks of the season before ripping off several long runs in that pre-bye game against the Giants. If he can get chunk gains on the ground against this Green Bay front, that changes the math elsewhere on the field. \nPhilly remains without Cam Jurgens up front, so that could affect whether Barkley is able to find room to run. The Packers won't have Lukas Van Ness along their defensive line, though, and that could affect both their run defense and their pass rush. Green Bay will be without Nate Hobbs in the defensive backfield as well, which could scramble the matchups on the back end of things.\nA.J. Brown has reportedly (and pretty openly) been frustrated with his role for much of the season, and when you look at his numbers it makes sense why. Brown has just 29 receptions for 395 yards and three scores through eight games (he's played in seven of them), and he's often seemed like a secondary option behind DeVonta Smith and even Dallas Goedert at times. He's second on the team in targets, but he and Hurts have struggled to get on the same page. It wouldn't be surprising if the Eagles came out of the bye and made a concerted effort to get him going, and it'll be up to the likes of Keisean Nixon and Carrington Valentine on the outside, as well as Javon Bullard in the slot and Xavier McKinney and Evan Williams over the top to make sure he doesn't get untracked.\n\n        \n            \n                Eagles vs. Packers prediction, odds: 'Monday Night Football' picks, best bets from proven model\n                \n                    Ross Kelly                \n            \n                            \n    \n                \n                    \n    \nWhen the Packers have the ballIt'll be very interesting to see how this Philadelphia defense lines things up, especially in the secondary. The Eagles had a need at outside cornerback and swung trades for two different defensive backs, one of whom plays in the slot. Will they keep Cooper DeJean inside, where he is a total game-wrecker, and try to see if they can get by with Adoree' Jackson, Kelee Ringo or whatever Jaire Alexander has left in the tank? Or will they slide DeJean outside, where he is merely solid, and try to make it work with Michael Carter II at the nickel spot? No matter how they align, they'll be facing a Packers receiving corps that is extremely banged up. Tucker Kraft is out for the season after tearing his ACL last week. Jayden Reed remains on injured reserve. Dontayvion Wicks, Matthew Golden and Savion Williams are each listed as questionable after either being limited or not practicing at all throughout the week. The Packers could be down to Romeo Doubs, Christian Watson (who is in his third game back from a knee injury), Malik Heath and not much else at receiver if the questionable players can't go, and they'll have to turn to Luke Musgrave and John Fitzpatrick in Kraft's absence.\nJordan Love has been efficient (he's averaging 8.3 yards per attempt on a 70.3% completion rate while ranking first in the NFL in EPA per dropback, according to Tru Media) and explosive (the fourth-highest rate of 20-plus-yard completions in the league) this season. But the Packers' passing game has at times left something to be desired, as it has counted on Love to bail the team out with third-down completions (46.5% conversion rate, second in the NFL) rather than staying ahead of the chains. He's done exactly that all year, though, and with the exception of two games, the Packers have racked up yards and points with relative ease because he has. They've just... sputtered in very strange ways on occasion, and it's come back to bite them.\nPart of the issue is that their rushing attack hasn't been as consistent as it was a year ago. Josh Jacobs has been banged up and playing through injury, and he's averaging only 3.8 yards per carry so far this year. That's down from 4.4 per carry during his first year in Green Bay, during which he rushed for 1,329 yards and 15 touchdowns. Without the same threat on the ground, the Packers have wound up in worse down-and-distance situations than they had last year, and it's played into the occasional inefficiency. The Philadelphia defense has been more vulnerable against the run (18th in EPA per play) than the pass (third) so far this year, so it'll be interesting to see if the Packers can get their run game on track on Monday night. The Eagles added some help up front in the form of Jaelan Phillips and Brandon Graham, who will likely play in the rotation alongside Jalyx Hunt and Josh Uche, depending on game situation. Graham, at his age, is likely to see a smaller snap load, while Phillips could play a significant role up front. Prediction\nThis is a game in which neither team seems to have a significant advantage on either side of the ball. In fact, it looks a lot like a strength vs. strength matchup. When it comes to those types of games, I tend to lean toward which team has the advantage in the passing game, and that seems like Green Bay. It doesn't hurt that the Packers also get to play this one at home. \nPick: Packers 23, Eagles 21\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs Packers: How to watch, odds, picks, MNF prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/645ace7a-b1ac-4393-8ebb-6793a8df98c5/thumbnail/1200x675/28fe7de74058cc31927ecb96daa7e2db/jalen-hurts-jordan-love.jpg"
      ],
      "datePublished": "2025-11-11T00:39:55.000Z",
      "dateModified": "2025-11-11T00:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]