[
  {
    "title": "Barcelona vs. Olympiacos UEFA Champions League picks, prediction for Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/barcelona-vs-olympiacos-odds-how-to-watch-stream-time-uefa-champions-league-picks-oct-21-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/db12fc61-3e74-4103-83d8-50d8ff8b8d4d/thumbnail/1200x675/97c54f2c003f03a65d1db223fcc8f87f/lamine-yamal-barcelona-approved-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-21T12:08:41.000Z",
    "description": "\n        Barcelona and Olympiacos are set to square off in a UEFA Champions League battle on Tuesday on Paramount+. The Spanish giants are five time U",
    "body": "\n        Barcelona and Olympiacos are set to square off in a UEFA Champions League battle on Tuesday on Paramount+. The Spanish giants are five time UCL champions and currently sit second in La Liga while Olympiacos are second in Super League Greece and won the UEFA Europa Conference League in 2024. Barcelona currently sits 16th in the UCL standings with three points from their first two matches while Olympiacos are 29th with one point entering Tuesday's match. You can catch all the action when you stream the match live on Paramount+, which you can get annual plans starting at $30 for your first year, and stream over 2,400 soccer matches a year. Kickoff from Lluís Companys Olympic Stadium in Barcelona is set for 12:45 p.m. ET. The latest Barcelona vs. Olympiacos odds list the hosts as the -500 favorites (risk $500 to win $100) on the 90-minute money line, with Olympiacos listed as the +1100 underdogs. A draw is priced at +650, and the over/under for total goals is 3.5. Tuesday's match will be streamed live on Paramount+ with their must-have Premium plan.Pick Champions League player props now at Underdog Fantasy. Use the latest Underdog Fantasy promo code CBSSPORTS2 to claim $100 in site credits with a $5 entry:Paramount+ is the only place to watch every minute of every UEFA Champions League match this season and over 2,400 soccer matches a year. A subscription also gives you access to other sports content, including the Italian Serie A, Europa League, NFL on CBS, and countless movies and shows. For a limited time, annual plans start at $30 for your first year, so sign up right here.How to watch Olympiacos vs. BarcelonaBarcelona vs. Olympiacos date: Tuesday, Oct. 21Barcelona vs. Olympiacos time: 12:45 p.m. ETBarcelona vs. Olympiacos live stream: Paramount+ Before you tune in to Tuesday's match, you need to see what SportsLine soccer expert Jon Eimer has to say. Here are his best bets for Olympiacos vs. Barcelona on Tuesday:     Barcelona vs. Olympiacos picks, predictionOver 3.5 total goals (+100) Both teams to score (-110)Over 3.5 total goals (+100)Barcelona have scored a goal in every match that they've played this season and they've scored multiple goals in eight of 11 matches across all competitions. Expect Hansi Flick's men to apply plenty of pressure going forward even with a lengthy injury list entering UCL Matchday 3. Meanwhile, Olympiacos haven't found their sea legs yet in the Champions League, but have been prolific domestically and they've got the potential to make a contribution here with an experienced roster.You can place this bet at +100 odds at DraftKings. The latest DraftKings promo code offers $200 in bonus bets if your first bet of $5 or more wins. Sign up for DraftKings here:Both teams to score (-110)\"Barcelona will be without the services of Joan Garcia, Marc-Andre ter Stegen, Robert Lewandowski, Raphina, Dani Olmo, and Ferran Torres. The only thing crazier than the amount of big names Barcelona will be missing, is the fact that they'll still be able to field a solid starting eleven,\" Eimer said. \"Meanwhile, I'm expecting Olympiacos to understand that they are heavy underdogs, and expect them to finally push against a Barcelona side that no one can stop from scoring right now.\"You can place this bet at -110 odds at BetMGM. Use the latest BetMGM bonus code to get up to $1,500 back in bonus bets if your first bet loses or $150 in bonus bets if your first bet of at least $10 wins. Get started at BetMGM here:    How to watch, live stream UEFA Champions League on Paramount+Now that you know what to pick, get ready to watch the Champions League. Visit Paramount+ now to stream the UEFA Champions League, your live local CBS sporting events, the world's top soccer matchups, and much more for only $30 for one year.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barcelona vs. Olympiacos UEFA Champions League picks, prediction for Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/db12fc61-3e74-4103-83d8-50d8ff8b8d4d/thumbnail/1200x675/97c54f2c003f03a65d1db223fcc8f87f/lamine-yamal-barcelona-approved-cbs-imagn.jpg"
      ],
      "datePublished": "2025-10-21T12:08:41.000Z",
      "dateModified": "2025-10-21T12:08:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Opening Night NBA parlay, predictions: These 3 picks could return around +500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-opening-night-2025-basketball-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/29542483-083a-4c17-952c-e0b201daf9e5/thumbnail/1200x675/32e5f34efcb0433444aeab8efe574734/kevin-durant-houston-rockets-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-21T11:59:31.000Z",
    "description": "\n        The NBA is back with Opening Night 2025 on Tuesday. The latest NBA odds show the Oklahoma City Thunder, who will raise their championship ban",
    "body": "\n        The NBA is back with Opening Night 2025 on Tuesday. The latest NBA odds show the Oklahoma City Thunder, who will raise their championship banner, as 6.5-point favorites against the Houston Rockets, while the Golden State Warriors are 2.5-point road favorites against the Lakers at 10 p.m. ET. LeBron James (sciatica) will miss the opener as he aims for a return in a few weeks.It's a smaller slate, but with spread, money lines and props on the board, there are still plenty of opportunities to build Opening Night NBA parlays. What are the best NBA bets on the board? Before locking in any NBA picks be sure to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout higher than +500. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Opening NightAfter simulating every game 10,000 times, the model is taking the Under (227.5) in Rockets vs. Thunder in the first tip of the season at 7:30 p.m. ET on Tuesday. While the core pieces for the Thunder return, the Rockets saw a big shake up in the offseason when Kevin Durant came over via trade that sent Jalen Green and Dillon Brooks to the Suns.There very well could be some adjustments for Houston as it works Durant, a high-volume scorer, into the mix. The model, in fact, is projecting just 20.6 points for Durant, which is a big reason that the teams are projected to combine for just 219 points, helping the Under hit in 63% of simulations. See which other NBA parlay picks to make here, and bet Under right here:How to make NBA predictions for Opening NightThe model also locked in a spread pick for both games, and it says one team covers more than 70% of the time in an A-rated pick. You can only see the model's NBA Opening Night parlay at SportsLine.What are the model's top NBA Opening Night parlay picks, and which best bets should you target for a chance at a payout of more than +500? Visit SportsLine now to see NBA best bets from a model that's returned more than $4,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Opening Night NBA parlay, predictions: These 3 picks could return around +500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/29542483-083a-4c17-952c-e0b201daf9e5/thumbnail/1200x675/32e5f34efcb0433444aeab8efe574734/kevin-durant-houston-rockets-imagn-images.jpg"
      ],
      "datePublished": "2025-10-21T11:59:31.000Z",
      "dateModified": "2025-10-21T11:59:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baker Mayfield criticizes officials during and after Buccaneers' loss to Lions on 'MNF' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/baker-mayfield-criticizes-officials-during-and-after-buccaneers-loss-to-lions-on-mnf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/0fd63eee-ab6e-4f3f-a45c-22228a291d79/thumbnail/1200x675/08004514da68107670400b16ddf31609/mayfieldmnf.jpg",
    "tag": "Sports",
    "date": "2025-10-21T04:41:19.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Baker Mayfield took the officials to task during a",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Baker Mayfield took the officials to task during and after the Tampa Bay Buccaneers' 24-9 loss to the Detroit Lions on Monday night. Tampa Bay's quarterback was seen giving NFL official John Hussey an earful following the Buccaneers' final offensive drive. Mayfield was transparent afterwards when asked about his exchange with referee John Hussey and his overall thoughts on the night's officiating crew.\"A third down defensive holding call that wasn't called, and also still pretty damn confused about the double review,\" said Mayfield, who didn't hold back. \"A lot of things in that game that were a little questionable ... I work my ass off, and I put a lot into this game, so when [calls are made] that I don't think are deemed fair, I'm going to let somebody know.\"  The \"double review\" that Mayfield referenced occurred early in the fourth quarter when Mayfield completed a four-yard pass to tight end Cade Otton on a fourth-and-4 play. The officials upheld that Otton had secured the catch and subsequent first down after the Lions challenged the play. \nTo the surprise of everyone, Hussey was called back to monitor and ultimately reversed the call on the field, giving the Lions possession and also awarding Detroit its timeout back. That was the second overturned play of the night involving Mayfield and Otton. Late in the first half, the officials overturned a three-yard completion to Otton while determining that Mayfield's pass was instead intercepted by Arthur Maulet. By rule, possession is awarded to the offensive player where is 50-50 possession. There's no denying that the Buccaneers were on the wrong side of the close calls on Monday night. That being said, Tampa Bay's loss was also a byproduct of the Lions simply playing better on both sides of the ball, especially on the ground. Detroit ran for 164 yards that included 136 yards and two scores by Jahmyr Gibbs. Conversely, the Buccaneers ran for just 41 yards on 12 carries as they spent the majority of the game playing from behind. \nAdding insult to injury was the fact that Mayfield's squad lost one of their its players in Mike Evans, who is slated to miss the majority of the Buccaneers' remaining regular season games after breaking his collarbone during the second quarter. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baker Mayfield criticizes officials during and after Buccaneers' loss to Lions on 'MNF' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/0fd63eee-ab6e-4f3f-a45c-22228a291d79/thumbnail/1200x675/08004514da68107670400b16ddf31609/mayfieldmnf.jpg"
      ],
      "datePublished": "2025-10-21T04:41:19.000Z",
      "dateModified": "2025-10-21T04:41:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texans Pro Bowl wide receiver Nico Collins exits 'Monday Night Football' game vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/texans-pro-bowl-wide-receiver-nico-collins-exits-monday-night-football-game-vs-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/4113cb00-fa70-40ff-8f74-1a278fef5a3f/thumbnail/1200x675/786a918524e73c35b5465f20ec1bb51c/nico-collins-texans.jpg",
    "tag": "Sports",
    "date": "2025-10-21T05:19:21.000Z",
    "description": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        The Houston Texans' brutal offensive performance on \"Mon",
    "body": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        The Houston Texans' brutal offensive performance on \"Monday Night Football\" took a turn for the worse in the fourth quarter, when star wide receiver Nico Collins left the game with a concussion. He was initially ruled questionable to return, and then he walked to the locker room shortly thereafter.The injury occurred when Collins went up for a contested catch against Josh Jobe, who broke up the pass. Collins' head snapped back and hit the turf hard when he landed, and he immediately grabbed for his head. The team's medical staff tended to him immediately.\nCollins, 26, had a breakout 2023 with 80 receptions for 1,297 yards and eight touchdowns. He followed that up 68 catches for 1,006 yards and seven touchdowns in 2024 even though he missed time with a hamstring injury, and he earned his first Pro Bowl selection.Collins, much like Houston's offense as a whole, got off to a slow start in 2025, but he had started to come on strong with a touchdown in three of his previous four games. The Texans have leaned heavily on Collins this season with Christian Kirk missing time due to injury; Xavier Hutchinson has seen increased playing time, and rookie Jaylin Noel and Jayden Higgins would do the same should Collins miss extended time.\nThe Texans were trailing 27-12 when Collins got injured, with their only touchdown coming when Will Anderson Jr. strip-sacked Sam Darnold it the end zone and recovered the ball.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans Pro Bowl wide receiver Nico Collins exits 'Monday Night Football' game vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/4113cb00-fa70-40ff-8f74-1a278fef5a3f/thumbnail/1200x675/786a918524e73c35b5465f20ec1bb51c/nico-collins-texans.jpg"
      ],
      "datePublished": "2025-10-21T05:19:21.000Z",
      "dateModified": "2025-10-21T05:19:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Series schedule: Dodgers vs. Blue Jays in 2025 MLB playoffs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/world-series-schedule-dodgers-blue-jays-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/64949fb9-af2c-4000-a8a0-474c765e7032/thumbnail/1200x675/91d1d2d12c0c2ae13a1648336ae2df73/dodgers-jays-getty.png",
    "tag": "Sports",
    "date": "2025-10-21T04:27:54.000Z",
    "description": "\n        If the Los Angeles Dodgers are to become the first back-to-back World Series champions since the 1998-2000 New York Yankees, they will have t",
    "body": "\n        If the Los Angeles Dodgers are to become the first back-to-back World Series champions since the 1998-2000 New York Yankees, they will have to go through the Toronto Blue Jays. The Blue Jays punched their ticket to the Fall Classic with a Game 7 win over the Seattle Mariners on Monday night as George Springer hit a game-winning home run. This is Toronto's first World Series appearance since 1993, when they won their second consecutive title.The Dodgers thoroughly dismantled the Milwaukee Brewers, owners of MLB's best record during the regular season, in the NLCS to return to the World Series. They are the first defending champion to reach the World Series the next season since the 2008-09 Philadelphia Phillies, and, in more than a few ways, this year's Dodgers are better than last year's. On the mound, Tyler Glasnow is L.A.'s worst starter, and he's pretty darn good. Blake Snell, Yoshinobu Yamamoto, and the singular Shohei Ohtani have all pitched like aces the last few weeks and they're all healthy. Ohtani also provides impact at the plate, as evidenced by his historic three-home run performance in the pennant-clinching NLCS Game 4 win. As for the Blue Jays, they've ridden a high-powered offense to seven wins in 11 postseason games. Vladimir Guerrero Jr. has been the best hitter on the planet this month and is doing just about everything he can to bring a championship to Toronto. Others like George Springer, Ernie Clement, and Andrés Giménez have come up big at times this postseason as well. Toronto's pitching staff is neither as deep nor as star-studded as L.A.'s, but it is formidable. Rookie righty Trey Yesavage has shown himself to be unfazed by postseason pressure and veteran starters Shane Bieber, Kevin Gausman, and Max Scherzer have proven their postseason chops. The bullpen can be shaky, though the same is true of the Dodgers. \nThe Blue Jays (94-68) will be the home team over the Dodgers (93-69) in the World Series because they had the better regular-season record. Here now is the schedule for the 2025 World Series. All games can be streamed on fubo (try for free). 2025 World Series schedule Game \t\t\t\t \t\t\t\t \t\t\t\tDate \t\t\t\t \t\t\t\t \t\t\t\tStart time \t\t\t\t \t\t\t\t \t\t\t\tVenue \t\t\t\t \t\t\t\t \t\t\t\tTV \t\t\t\t \t\t\t\t \t\t\t\t1 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tFri. Oct. 24 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t8 p.m. ETRogers CentreFox \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t2 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tSat. Oct. 25 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t8 p.m. ET \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tRogers CentreFox \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t3 \t\t\t\tMon. Oct. 27 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t4 \t\t\t\tTues., Oct. 28 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t5 (if nec.) \t\t\t\tWed., Oct. 29 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t6 (if nec.) \t\t\t\tFri., Oct. 31 \t\t\t\t8 p.m. ET \t\t\t\tRogers CentreFox \t\t\t\t7 (if nec.) \t\t\t\tSat., Nov. 1 \t\t\t\t8 p.m. ET \t\t\t\tRogers CentreFox \t\t\t\t2025 World Series oddsOdds via Caesars SportsbookDodgers: -230Blue Jays: +190Game 1 storylinesDodgers: The Dodgers are attempting to become Major League Baseball's first repeat World Series champions since the New York Yankees won three consecutive titles from 1998-2000. Additionally, the Dodgers are, by far, the more experienced club in this setting. Los Angeles will have now appeared in five of the last nine World Series, including three of the past six.Blue Jays: The Blue Jays are in their first World Series since 1993, when they won their second title in a row. Toronto became just the third club in the last 20 years to overcome a 2-0 deficit in a best-of-seven series, with the others being the Arizona Diamondbacks (in 2023) and the Dodgers (in 2020).\nGame 1 predictionI picked Los Angeles to win the whole thing heading into the postseason, and I have to stand by that now. The Dodgers were the better team during the regular season, in terms of run differential, even if they had the worse record. Most importantly, the Dodgers now have a healthy rotation. I think that'll prove to be the difference, starting with a tight victory here in Game 1. I'll say 3-2 Dodgers. -- R.J. Anderson\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Series schedule: Dodgers vs. Blue Jays in 2025 MLB playoffs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/64949fb9-af2c-4000-a8a0-474c765e7032/thumbnail/1200x675/91d1d2d12c0c2ae13a1648336ae2df73/dodgers-jays-getty.png"
      ],
      "datePublished": "2025-10-21T04:27:54.000Z",
      "dateModified": "2025-10-21T04:27:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doug Martin dies in police custody: Ex-Bucs RB, suffering mental health issues, struggled while being detained - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/doug-martin-dies-at-36-police-investigating-detention-boise-state-star-alleged-break-in/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/d73888ed-6a7e-4f17-916b-bc2242fc22fe/thumbnail/1200x675/b0cf1070a1b4430debefdce4cf248be6/martin.jpg",
    "tag": "Sports",
    "date": "2025-10-21T02:13:47.000Z",
    "description": "\nFormer Tampa Bay Buccaneers All-Pro running back and Boise State star Doug Martin died while in police custody following a struggle with officers who",
    "body": "\nFormer Tampa Bay Buccaneers All-Pro running back and Boise State star Doug Martin died while in police custody following a struggle with officers who were investigating a break-in at a home in Oakland, California, on Sunday according to the Oakland Police Department. Martin, 36, became unresponsive after his arrest and was transported to the hospital after receiving medical aid on the scene. A cause of death has not been released, though the Alameda County Coroner's Office will do an autopsy to determine what happened.A first-round pick by Tampa Bay in the 2012 NFL Draft, Martin played seven seasons in the pros prior to his career ending after a brief stint with the Oakland Raiders.Oakland police said Monday that Martin \"was involved in a break-in at a residence in Oakland,\" and as officers were attempting to detain him, a \"brief struggle occurred\" with Martin becoming unresponsive after being taken into custody.\"Paramedics responded to the scene, provided medical aid, and transported Martin to a local hospital, where he later died,\" police said. \"Since Saturday, OPD has been in contact with Martin's family. The family has requested privacy as they grieve this tragic loss. No additional details are being released at this time, as this remains an ongoing investigation.\"The officers involved in the incident have been placed on paid administrative leave.Athletes First and agency CEO Brian Murphy, who represented Martin, released an additional statement on behalf of his family. Within the statement, it was revealed that Martin battled menal health challenges \"that profoundly impacted his personal and professional life.\"\"Ultimately, mental illness proved to be the one opponent from which Doug could not run,\" the statement continued. \"Following recent media reports about Doug's untimely passing, the family wishes to clarify the circumstances. Doug's parents were actively seeking medical assistance for him and had contacted local authorities for support. Feeling overwhelmed and disoriented, Doug fled his home during the night and entered a neighbor's residence two doors down, where he was taken into custody by police.\"Martin rushed for 1,454 yards as a rookie in 2012 before playing in only 17 games over his next two years with the Buccaneers. Martin's resurgence was notable in 2015 when he posted an All-Pro and Pro Bowl season in which he rushed for 1,402 yards. \nThat offseason, Tampa Bay signed Martin to a five-year, $35 million contract extension. He struggled thereafter for the NFC South franchise with a suspension for violating the NFL's substance abuse policy causing him to miss multiple games at the end of the year. The suspension came amid Martin being benched while the Buccaneers were making a playoff push during the 2016 season. The franchise released Martin after the 2017 season, and he later signed with the Raiders to back up Marshawn Lynch.Known for his bruising style at 5-feet-9 and 225 pounds, Martin starred at Boise State and earned the nickname \"Muscle Hamster\" during his time on the blue turf. \nPrior to Heisman finalist Ashton Jeanty's career, Martin was considered one of the top ballcarriers in program history after ranking third all-time at the school with 43 rushing touchdowns and 48 total touchdowns, fifth with 3,431 yards and sixth with 617 rushing attempts.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doug Martin dies in police custody: Ex-Bucs RB, suffering mental health issues, struggled while being detained - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/d73888ed-6a7e-4f17-916b-bc2242fc22fe/thumbnail/1200x675/b0cf1070a1b4430debefdce4cf248be6/martin.jpg"
      ],
      "datePublished": "2025-10-21T02:13:47.000Z",
      "dateModified": "2025-10-21T02:13:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers' Matt LaFleur won't stress significance of facing Aaron Rodgers ahead of Week 8 showdown vs. Steelers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-matt-lafleur-wont-stress-significance-of-facing-aaron-rodgers-ahead-of-week-8-showdown-vs-steelers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/4474a5b4-f028-4f76-b8d5-e52bf4ce285c/thumbnail/1200x675/184e685d6f5318144071e01ef42a574f/lafleurrodgers.jpg",
    "tag": "Sports",
    "date": "2025-10-21T00:00:45.000Z",
    "description": "\n        While Aaron Rodgers has acknowledged that Sunday night's game will be different, his former coach is treating the Green Bay Packers' showdown",
    "body": "\n        While Aaron Rodgers has acknowledged that Sunday night's game will be different, his former coach is treating the Green Bay Packers' showdown against Rodgers' Pittsburgh Steelers like any other game.Rodgers will face his former team for the first time when the Pittsburgh hosts Green Bay on prime time. Rodgers spent his first 18 seasons with the Packers that included the last four with LaFleur as his coach. \"We're playing the Pittsburgh Steelers who happen to have Aaron Rodgers,\" LaFleur said. \"I mean, it's as simple as that. That is for you guys to talk about. \"Granted, I mean, we've got a lot of respect and love for Aaron. What he's done here. He's a Hall of Famer. I know, like our past together, we had a lot of great moments, but this game is not about that. It's about going to Pittsburgh. 'Sunday Night Football.' Our guys will be jacked up. Their guys will be jacked up. It's about the Green Bay Packers versus the Pittsburgh Steelers. And that's for you guys to talk about all those other storylines.\" When asked if he will deliver the same message to his team, LaFleur pointed out that many of the current Packers didn't even play with Rodgers during his final years in Green Bay. \n\"I'm going talk about -- just like we do every week -- what is our blueprint and what are our keys in order to go to Pittsburgh, which is a damn good football team, and a really tough, hostile environment, and try to play our best, because we haven't ... to date,\" LaFleur said. \"We've got a lot of work to do.\" \n        \n            \n                NFL Week 8 early odds: Aaron Rodgers, Steelers home underdogs vs. Packers; Colts 14.5-point favorite vs. rival\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nRodgers aside, Sunday is big game for both teams from a positioning standpoint. Pittsburgh (4-2) is currently 1.5 games ahead of Cincinnati in the AFC North standings. Green Bay (4-1-1) had a slight lead over Detroit (4-2) entering the Lions' Monday night game against the Buccaneers. Like LaFleur, Rodgers is surely more focused on facing Green Bay's defense than he is about facing his former team. But unlike LaFleur, Rodgers -- who is already 1-0 this season against his former teams -- has openly admitted that Sunday night's game will undoubtedly be different. Rodgers did so when asked how it felt to face the Jets shortly following Pittsburgh's Week 1 win. \n\"It doesn't come close to how it's gonna feel playing Green Bay, because that was 18 years of my career,\" said Rodgers, who is hoping to join former teammate Brett Favre as former Packers legends who were able to beat their former team. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers' Matt LaFleur won't stress significance of facing Aaron Rodgers ahead of Week 8 showdown vs. Steelers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/4474a5b4-f028-4f76-b8d5-e52bf4ce285c/thumbnail/1200x675/184e685d6f5318144071e01ef42a574f/lafleurrodgers.jpg"
      ],
      "datePublished": "2025-10-21T00:00:45.000Z",
      "dateModified": "2025-10-21T00:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' predictions, odds, best bets: Buccaneers vs. Lions picks from expert on 34-20 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-spread-line-best-bets-top-lions-buccaneers-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/69f5f14f-523b-43dc-a59a-2d8df1aa4736/thumbnail/1200x675/cac9621523becb6acc7218ddbcb7dc48/jared-goff-detroit-lions-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-20T22:48:20.000Z",
    "description": "\n        Two of the NFC's best teams collide on 'Monday Night Football' when the Tampa Bay Buccaneers take on the Detroit Lions. Tampa Bay is coming o",
    "body": "\n        Two of the NFC's best teams collide on 'Monday Night Football' when the Tampa Bay Buccaneers take on the Detroit Lions. Tampa Bay is coming off a 30-19 win over the San Francisco 49ers last week, while Detroit dropped a 30-17 decision to the Kansas City Chiefs. The Buccaneers (5-1), who lead the NFC South, are 3-0 on the road this year. The Lions (4-2), who are second in the NFC North, are 2-0 on their home field in 2025. Running back Bucky Irving (foot) and receiver Chris Godwin (fibula) are out for Tampa Bay, while receivers Emeka Egbuka (hamstring) and Mike Evans (hamstring) are both active for Tampa Bay after being listed as quesstionable.Kickoff from Ford Field in Detroit is set for 7 p.m. ET. Detroit leads the all-time series 33-30. The Lions are 6-point favorites in the latest Buccaneers vs. Lions odds, while the over/under for total points scored is 54.5. Before making any Lions vs. Buccaneers picks, make sure to check out the Monday Night Football predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the Lions. He is an outstanding 34-20-2 (+1287) on his last 56 picks in games involving the Detroit Lions. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Buccaneers vs. Lions and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Lions vs. Buccaneers:Buccaneers vs. Lions         spreadDetroit -6 at DraftKings SportsbookBuccaneers vs. Lions             over/under54.5 pointsBuccaneers vs. Lions             money line Detroit -281, Tampa Bay +225Buccaneers vs. Lions         picksSee picks at SportsLineBuccaneers vs. Lions             streaming Fubo (Try for free)Why the Lions can winVeteran quarterback Jared Goff is off to a solid start to the season. In six starts, he has completed 132 of 174 passes (75.9%) for 1,390 yards and 14 touchdowns with two interceptions and a 120.6 rating. In last week's loss at Kansas City, Goff completed 23 of 29 passes (79.3%) for 203 yards and two touchdowns. In a 52-21 win over the Chicago Bears on Sept. 14, he completed 23 of 28 passes for 334 yards and five touchdowns.Also helping power the offense is wide receiver Amon-Ra St. Brown. He leads the team with 44 receptions for 452 yards and six touchdowns. He has five explosive plays of 20 yards or more, including a long of 34, with 169 yards after the catch and 28 first-down conversions. In a 34-10 win over the Cleveland Browns on Sept. 28, he caught seven passes for 70 yards and two touchdowns. He had nine catches for 115 yards and three scores against Chicago. See which team to back at SportsLine. Why the Buccaneers can winEight-year veteran quarterback Baker Mayfield is playing at an MVP-type level. In six starts, he has completed 129 of 195 passes (66.2%) for 1,539 yards and 12 touchdowns with just one interception and a rating of 108.5. He also has rushed 22 times for 158 yards (7.2 average), including a long of 33. In a 38-35 win at Seattle on Oct. 5, he completed 29 of 33 passes (87.9%) for 379 yards and two touchdowns.The Bucs are dealing with a lengthy injury list at receiver, but Sterling Shepard can step up. In six games, he has 19 receptions for 242 yards (12.7 average) and one touchdown. He has four explosive plays of 20 yards or more, including a long of 36, with 102 yards after the catch and 11 first-down conversions. In the win over Seattle, Shepard had four receptions for 24 yards and a score. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Buccaneers vs. Lions  picksWhite has analyzed Lions vs. Buccaneers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Buccaneers vs. Lions, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Buccaneers vs. Lions spread you need to jump on, all from the expert that is 34-20-2 on his last 56 Detroit Lions picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' predictions, odds, best bets: Buccaneers vs. Lions picks from expert on 34-20 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/69f5f14f-523b-43dc-a59a-2d8df1aa4736/thumbnail/1200x675/cac9621523becb6acc7218ddbcb7dc48/jared-goff-detroit-lions-imagn-images.jpg"
      ],
      "datePublished": "2025-10-20T22:48:20.000Z",
      "dateModified": "2025-10-20T22:48:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA DFS picks, lineups, advice from daily Fantasy pro with over $2 million in winnings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-dfs-daily-fantasy-basketball-picks-tuesday-october-21-luka-doncic/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/03/09/21ec4dd9-b9de-4334-971b-0e089de38dcb/thumbnail/1200x675/284fd314c807cf597a0b85bdad97a3ea/doncic.jpg",
    "tag": "Sports",
    "date": "2025-10-20T23:20:23.000Z",
    "description": "\n        The 2025-26 NBA season has arrived, with Opening Night taking place on Tuesday, October 21. There's a two-game slate that will see Rockets vs",
    "body": "\n        The 2025-26 NBA season has arrived, with Opening Night taking place on Tuesday, October 21. There's a two-game slate that will see Rockets vs. Thunder at 7:30 p.m. ET, followed by Lakers vs. Warriors at 10 p.m. ET. Top NBA DFS picks such as Shai Gilgeous-Alexander, Luka Doncic and Stephen Curry are ready to tip off the season, while an old face in a new place will make his Rockets debut in Kevin Durant. He's been a fixture in NBA DFS lineups for years, but with the hefty price tag he'll command on daily Fantasy basketball sites, are you better off seeing how he performs with his new squad before fitting him under your NBA DFS salary cap?Rostering big-name players like the above means you'll have to also find values in the NBA daily Fantasy player pool. With Houston's Fred VanVleet (ACL) out for the year, the likes of Reed Sheppard or Aaron Holiday could form a productive NBA DFS stack alongside Durant. Before making any NBA DFS picks, be sure to check out the NBA DFS advice, player rankings, stacks, and top daily Fantasy basketball picks from SportsLine's Mike McClure.New users can also target the DraftKings promo code, which offers $300 in bonus bets if your initial $5 bet wins + 3 months of NBA League Pass:McClure is a DFS professional with more than $2 million in career winnings. He's also a predictive data engineer at SportsLine who uses a powerful prediction model that simulates every minute of every game 10,000 times, taking factors like matchups, statistical trends and injuries into account. This allows him to find the best NBA DFS values on sites like DraftKings and FanDuel and create optimal lineups that he shares only over at SportsLine. They're a must-see for any NBA DFS player.McClure has turned his attention to NBA action on Tuesday and locked in his top daily Fantasy basketball picks. You can only see them by heading to SportsLine.New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:Top NBA DFS picks for Tuesday, October 21For Tuesday, one of McClure's top NBA DFS picks is Doncic, who is listed at $11,000 on DraftKings and $11,700 on FanDuel. Doncic will take part in his first NBA Opening Night in a Lakers uniform, and he'll do so without LeBron James (sciatica) alongside him. If preseason was any indication of what Doncic could do without James available, then Doncic would justify his NBA DFS price tags as he led NBA Preseason in scoring. That came after a dominant run with the Slovenian National Team at EuroBasket this summer as he averaged the most points by any player at the event in over 35 years.The five-time All-Star is just as productive in NBA games that matter, as his 28.2 points with the Lakers last season were slightly more than what he averaged in Dallas to begin the year. Doncic has to be thrilled that a matchup with the Warriors takes place on NBA Opening Night, considering his best game of the 2024-25 season came versus the Warriors. In a late December game, he had a 45-point triple-double, filling up the box score with 13 assists, 11 rebounds, three steals and two blocks.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:Another part of McClure's optimal NBA DFS strategy includes rostering Thunder center Isaiah Hartenstein ($5,400 on DraftKings and $5,800 on FanDuel). In his first year in OKC, Hartenstein posted career highs across the board. He averaged 11.2 points, 10.7 rebounds, 3.8 assists and 1.1 blocks while knocking down 58.1% of his field goal attempts. He has some extra motivation to face Houston on Tuesday as the Rockets were his original team before unceremoniously cutting him after two seasons.It certainly shows that revenge is a motivating factor for Hartenstein as he saved some of his best performances for the Rockets last year. His 16 ppg versus Houston were his most versus any team (min. two games), and the Rockets' shooting woes allow opposing big men to pile up rebounds. Houston was bottom-10 in both field goal percentage and 3-point percentage a year ago, and while Durant will help solve some of that, there should still be plenty of defensive rebounds to grab for Hartenstein on Tuesday. See McClure's other NBA DFS picks right here.How to set your NBA DFS lineups for Tuesday, October 21McClure is also targeting a player who could go off for massive numbers on Tuesday because of a dream matchup. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is here.Who is DFS pro Mike McClure putting in his optimal NBA DFS lineups for Tuesday? Visit SportsLine now to see optimal NBA DFS picks, rankings, advice, and stacks, all from a professional DFS player who has over $2 million in career winnings, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA DFS picks, lineups, advice from daily Fantasy pro with over $2 million in winnings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/03/09/21ec4dd9-b9de-4334-971b-0e089de38dcb/thumbnail/1200x675/284fd314c807cf597a0b85bdad97a3ea/doncic.jpg"
      ],
      "datePublished": "2025-10-20T23:20:23.000Z",
      "dateModified": "2025-10-20T23:20:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice, daily Fantasy strategy guide for 'Monday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-lineups-monday-night-football-buccaneers-lions-texans-seahawks-daily-fantasy-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/d8870beb-f3dd-4895-a7e8-ab18ba4e4f9a/thumbnail/1200x675/39c3cadc51215497c0032dec5466c114/baker-mayfield-buccaneers-cbs-2.jpg",
    "tag": "Sports",
    "date": "2025-10-20T22:46:55.000Z",
    "description": "\n        The Week 7 NFL schedule concludes with a 'Monday Night Football' doubleheader. The Detroit Lions host the Tampa Bay Buccaneers at 7 p.m. ET, ",
    "body": "\n        The Week 7 NFL schedule concludes with a 'Monday Night Football' doubleheader. The Detroit Lions host the Tampa Bay Buccaneers at 7 p.m. ET, and the Seattle Seahawks host the Houston Texans at 10 p.m. ET. The Lions vs. Buccaneers game has an over/under of 54.5 points, while the Seahawks vs. Texans games has an over/under of 41 points, so those potential game flows could play into NFL DFS strategy. The NFL DFS player pool is headlined by Baker Mayfield, Jared Goff, Jahmyr Gibbs, Amon-Ra St. Brown, Jaxon Smith-Njigba and Nico Collins. Emeka Egbuka and Mike Evans are both active for Tampa Bay after being listed as questionable with hamstring injuries. All are expected to be popular NFL DFS picks and centerpieces of NFL DFS lineups. Who are the top NFL DFS picks for Lions vs. Buccaneers and Seahawks vs. Texans, and which daily Fantasy sleepers should you target to differentiate your NFL DFS lineups and NFL DFS stacks? Before making any NFL DFS picks for Monday Night Football on sites like DraftKings and FanDuel, be sure to check out the NFL DFS lineup advice, strategy and player stacks from SportsLine NFL daily Fantasy expert Jimmie Kaylor. Kaylor is a NFL betting and DFS expert for SportsLine, who opened the 2022 NFL season by winning DraftKings' NFL Showdown Thursday Kickoff Millionaire contest. He edged out over 355,000 other entrants in the contest and also has multiple five-figure tournament wins on his DFS resume. Kaylor has covered the NFL and college football for close to a decade as a member of the Pro Football Writers of America, and his background as a former college and NFL player gives him a unique perspective when building his fantasy lineups and locking in his betting picks. Now, Kaylor has turned his attention to 'Monday Night Football' and just locked in his top daily Fantasy football picks. You can only see his Monday Night Football DFS picks and analysis at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5: Top NFL DFS picks, lineups, stacks for Monday Night FootballOne of Kaylor's top DFS picks for 'Monday Night Football' is Buccaneers quarterback Baker Mayfield. The former No. 1 overall pick's resurgence with the Buccaneers in 2024 was eye-opening. He threw for 4,500 yards, 41 touchdowns, and had a passer rating of 106.8 across 17 games. He also rushed for a career-high 378 yards, showing his dual-threat ability. Through six weeks in 2025, Mayfield has continued to excel, posting 1,539 passing yards, 12 touchdowns, and only one interception through six games with a passer rating of 108.5. He is now listed among the top contenders to win the 2025 NFL MVP award. See who else to roster here.Part of Kaylor's optimal NFL DFS strategy also includes rostering Lions running back Jahmyr Gibbs. The former Alabama standout has emerged as a dynamic offensive weapon for the Lions. In 2024, he rushed 250 times for 1,412 yards and scored 16 rushing touchdowns, while also adding 52 receptions for 517 yards and four receiving touchdowns. That performance earned him a second Pro Bowl nod and established him as one of the league's most efficient all-purpose backs. Through the early part of 2025, he has continued to produce, carrying the ball 87 times for 390 yards (4.5 yards per carry) and finding the end zone four times, while adding 23 receptions for 112 yards. While his per-carry average dipped slightly compared to 2024, his explosiveness and versatility continue to define his value to the Lions' offense. You can see the rest of Kaylor's NFL DFS picks here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:How to build NFL DFS lineups for Monday Night FootballKaylor is also targeting another undervalued player who could explode for huge numbers on 'Monday Night Football.' This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and get the rest of Kaylor's NFL DFS picks, at SportsLine. So who is Jimmie Kaylor including in his optimal NFL DFS lineups for the doubleheader on Monday Night Football, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice, and stacks, all from SportsLine's proven DFS expert who won a single-game millionaire maker tournament, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice, daily Fantasy strategy guide for 'Monday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/d8870beb-f3dd-4895-a7e8-ab18ba4e4f9a/thumbnail/1200x675/39c3cadc51215497c0032dec5466c114/baker-mayfield-buccaneers-cbs-2.jpg"
      ],
      "datePublished": "2025-10-20T22:46:55.000Z",
      "dateModified": "2025-10-20T22:46:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos' Dre Greenlaw suspended one game for verbally threatening referee - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dre-greenlaw-suspended-one-game-referee-incident-broncos-giants/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/6802c814-3bdb-465e-8914-747d1912dcdb/thumbnail/1200x675/d1a3a5d08a634d229593737306675fb2/greenlaw.jpg",
    "tag": "Sports",
    "date": "2025-10-20T23:17:32.000Z",
    "description": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        Dre Greenlaw has been suspended by the NFL for one game ",
    "body": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        Dre Greenlaw has been suspended by the NFL for one game without pay for his actions immediately following the Denver Broncos' Week 7 win over the New York Giants, the league announced Monday night.As you can see below, the veteran linebacker confronted referee Brad Allen moments after Denver's shocking come-from-behind victory. The NFL determined Greenlaw's actions toward Allen warranted a suspension.\nGreenlaw, who will reportedly appeal his suspension, made his season debut Sunday after being placed on injured reserve ahead of Week 3. He missed the start of the season while dealing with multiple lower-body injuries prior to Week 1. \nIn 2024, Greenlaw played in just two games while recovering from an Achilles injury he sustained during the San Francisco 49ers' loss to the Kansas City Chiefs in Super Bowl LVIII. He spent his first six NFL seasons in San Francisco before inking a three-year deal with Denver this past offseason. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos' Dre Greenlaw suspended one game for verbally threatening referee - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/6802c814-3bdb-465e-8914-747d1912dcdb/thumbnail/1200x675/d1a3a5d08a634d229593737306675fb2/greenlaw.jpg"
      ],
      "datePublished": "2025-10-20T23:17:32.000Z",
      "dateModified": "2025-10-20T23:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandon Graham returns to Eagles: Impact on pass rush, trade deadline plans - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brandon-graham-returns-eagles-pass-rush-trade-deadline-targets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/02/09/dcf46de5-b251-43c5-9f05-9c95b9223716/thumbnail/1200x675/e28ee41911fc08cf1a5b7f8d8a856884/getty-brandon-graham-eagles.jpg",
    "tag": "Sports",
    "date": "2025-10-21T01:03:05.000Z",
    "description": "\n        PHILADELPHIA -- Desperate times call for desperate measures. Brandon Graham is returning to the Philadelphia Eagles, sources confirmed to CBS",
    "body": "\n        PHILADELPHIA -- Desperate times call for desperate measures. Brandon Graham is returning to the Philadelphia Eagles, sources confirmed to CBS Sports, seven months after the 37-year-old, two-time Super Bowl champion retired from the league. Graham has been in discussions with the Eagles about coming back to help a pass rush that is in dire need of help, as the Eagles ranked 29th in the NFL in sack percentage (4.3%) and 26th in sacks (11.0). Graham will officially announce his return Tuesday morning.\nThe edge rushers have combined for 3.5 sacks through seven games, with Za'Darius Smith the leader in the clubhouse with 1.5 sacks. Smith retired from the NFL last week after only playing five games with the Eagles, and he wasn't on the roster Week 1. Josh Uche and Patrick Johnson are the only other Eagles edge rushers with sacks (1.0 each), showcasing how depleted the position is. To make matters worse, the Eagles have plenty of injuries at edge rusher. Nolan Smith and Ogbo Okoronkwo are on injured reserve with triceps injuries with Okoronkwo ruled out for the season. Azeez Ojulari also left Sunday's win over the Minnesota Vikings with a hamstring injury.For those counting at home, the Eagles have just three healthy edge rushers on the roster: Uche, Johnson and Jalyx Hunt. They need Graham back just for depth, even if he's not the answer to a bigger problem. \nWhat can Graham actually provide for Eagles? In short, who knows? Graham played through a torn triceps injury in Super Bowl LIX, the same injury he suffered in November of what was his final season. Graham won't be judged on his performance on the field, but what he brings to the locker room in veteran experience.The Eagles had that with Za'Darius Smith prior to his sudden retirement, as Smith actually occupied Graham's locker. With that locker vacant, Graham will fill the role as veteran mentor and leader. \"His locker will be ready,\" said Eagles quarterback Jalen Hurts to reporters following his press conference after Sunday's win over the Vikings. \nThe Eagles just need bodies at edge rusher at this stage of the season until Nolan Smith returns, which is expected to be sometime after the bye week (Week 9). They're depleted at the position, so Graham returning and taking snaps on Sunday against the New York Giants would be a net positive. Graham coming out of retirement after a Super Bowl championship where he could walk into the sunset is unorthodox, but not unprecedented. The Eagles could use another player on the edge just to help out what they currently have on the active roster.Adding Graham doesn't mean the Eagles are done at edge rusher. Far from it. Who can Eagles target at edge rusher?There are certainly some edge rushers who will be available at the trade deadline, and the Eagles have plenty of premium draft capital to acquire one. The Eagles have 10 draft picks available in the 2026 NFL Draft.\nEagles' 2026 draft picksRoundAcquired1Own2Own3Own3From Jets3Projected compensatory4Own4Projected compensatory5Conditional (from 49ers)5Projected compensatory6From VikingsThe Eagles have five picks in the first three rounds and seven in the first four rounds, allowing them to afford parting ways with a pick or two to get a premium edge rusher. While the Eagles would prefer to keep their picks for future assets, the point of having premium draft picks is to make a Super Bowl contending roster better at the trade deadline.This is what the Eagles have to do if they wish to repeat as Super Bowl champions, as the pass rush played a major part in winning Super Bowl LIX. What the Eagles currently have at edge rusher isn't cutting it, so here are some candidates who could fill a void. \nTrey Hendrickson is the premier edge rusher available, and the Bengals are not out of the AFC North race as of yet. Cincinnati may not actually trade Hendrickson unless they get an offer they can't pass up. Hendrickson has a 14.5% pressure rate with 4.0 sacks on the season, and he's coming off consecutive 17.0-sack seasons. Adding Hendrickson would arguably place the Eagles as the best team in the NFC, even with their struggles on both sides of the ball. \nThe Dolphins are in a free fall as they have already had conversations about Mike McDaniel's future. They will be sellers at the deadline, and have a few players available. Jaelan Phillips is in the fifth-year option of his rookie deal, so he'll be a free agent after the season. Phillips has a 16.7% pressure rate this season with 2.0 sacks and 22 pressures. He would be bolstered depth for an Eagles pass rush that needs good players. Phillips has also played one season under Eagles defensive coordinator Vic Fangio, having 27 pressures, 6.5 sacks, and a 13.6% pressure rate in eight games in 2023. \nAnother Dolphins player available at the deadline, the 29-year-old Bradley Chubb has an 11.5% pressure rate with 4.0 sacks and 15 pressures in seven games. A young pass rush (even with the addition of Graham), could use a veteran like Chubb -- who had 11.0 sacks, 70 pressures, and a 15.7% pressure rate in his year with Fangio. Chubb has two years and $61.7 million in cap money left on his deal, so acquiring him would be difficult. He still would benefit going back in Fangio's scheme, as he also played for the Eagles defensive coordinator with the Denver Broncos. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandon Graham returns to Eagles: Impact on pass rush, trade deadline plans - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/02/09/dcf46de5-b251-43c5-9f05-9c95b9223716/thumbnail/1200x675/e28ee41911fc08cf1a5b7f8d8a856884/getty-brandon-graham-eagles.jpg"
      ],
      "datePublished": "2025-10-21T01:03:05.000Z",
      "dateModified": "2025-10-21T01:03:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bayer Leverkusen vs. PSG live stream, odds: How to watch Champions League, predicted lineups, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/bayer-leverkusen-vs-psg-live-stream-odds-how-to-watch-champions-league-predicted-lineups-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/5ae5060c-4379-49ca-8515-8d543f30f322/thumbnail/1200x675/ad093a575bbb2522cae2a65d3b641654/untitled-design-2025-10-21t120331-521.png",
    "tag": "Sports",
    "date": "2025-10-21T10:04:51.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The German team will host the 2024-25 UEFA Champions League champions at the Bay ArenA\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 21, 2025\n                            \n                    at\n    6:04 am ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \nThe 2024-25 UEFA Champions League winners have won both opening matches of the European season, first against Atalanta in their home debut, before winning away against Barcelona, a key win for their league phase run. Luis Enrique's team are currently leading the standings and are only one point behind Olympique Marseille in the Ligue 1, showing their dominance both domestically and in Europe. Here's all you need to know ahead of Tuesday's game: Viewing informationDate: Tuesday, Oct. 21 | Time: 3 p.m. ETLocation: Bay ArenA -- LeverkusenLive stream: Paramount+Odds: Bayer Leverkusen +410; Draw +380; PSG -172Possible lineupsBayer Leverkusen XI: Mark Flekken; Loic Bade, Robert Andrich, Edmond Tapsoba; Arthur, Ezequiel Fernandez, Aleix Garcia, Alejandro Grimaldo; Ernest Poku, Jonas Hofmann; Christian Kofane.PSG XI: Lucas Chevalier; Achraf Hakimi, Ilya Zabarnyi, Willian Pacho, Nuno Mendes; Warren Zaire-Emery, Vítinha, Desire Doue; Khvicha Kvaratskhelia, Goncalo Ramos, Bradley Barcola.PredictionThe team coached by Luis Enrique are expected to win despite playing away in one of the most difficult away matches around Europe against the side now managed by Kasper Hjulmand. Pick: PSG 2, Bayer Leverkusen 1. \n        \n            \n                UEFA Champions League predictions: All eyes on Barcelona's Marcus Rashford and Arsenal-Atletico Madrid game\n                \n                    Pardeep Cattry                \n            \n                            \n    \n                \n                    \n    \nHow to watchAll of the action on Matchday 3 of the UEFA Champions League can be caught on Paramount+, while CBS Sports Network and CBS Sports Golazo Network will have select simultaneous coverage. Each day's coverage begins with Champions League Matchday, streaming on Paramount+ and CBS Sports Golazo Network ahead of the early games before the UEFA Champions League Today pre-match show begins on Paramount+ and CBS Sports Network. The Golazo Show on Paramount+ also returns for the late slate of matches, while the UEFA Champions League Today post-match show on Paramount+ and CBS Sports Network picks things up at the end of the day. The day's coverage concludes on CBS Sports Golazo Network with The Champions Club (also streamed live on YouTube) and Scoreline.Matchday 3 TV scheduleAll times U.S./EasternTUESDAY, OCT. 21TIMEHOW TO WATCHChampions League Matchday12 p.m.Paramount+, CBS Sports Golazo NetworkBarcelona vs. Olympiacos12:45 p.m.Paramount+Kairat vs. Pafos12:45 p.m.Paramount+, CBS Sports Golazo NetworkUEFA Champions League Today pre-match2 p.m.Paramount+, CBS Sports NetworkChampions League Matchday2:45 p.m.CBS Sports Golazo NetworkThe Golazo Show3 p.m.Paramount+Newcastle United vs. Benfica3 p.m.Paramount+, CBS Sports NetworkPSV vs. Napoli3 p.m.Paramount+, CBS Sports Golazo NetworkBayer Leverkusen vs. Paris Saint-Germain3 p.m.Paramount+Union Saint-Gilloise vs. Inter3 p.m.Paramount+Copenhagen vs. Borussia Dortmund3 p.m.Paramount+Villarreal vs. Manchester City3 p.m.Paramount+Arsenal vs. Atletico Madrid3 p.m.Paramount+UEFA Champions League Today post-match5 p.m.Paramount+, CBS Sports NetworkThe Champions Club5 p.m.CBS Sports Golazo Network, YouTubeScoreline7 p.m.CBS Sports Golazo NetworkWEDNESDAY, OCT. 22TIMEHOW TO WATCHChampions League Matchday12 p.m.Paramount+, CBS Sports Golazo NetworkAthletic Club vs. Qarabag12:45 p.m.Paramount+Galatasaray vs. Bodo/Glimt12:45 p.m.Paramount+, CBS Sports Golazo NetworkUEFA Champions League Today pre-match2 p.m.Paramount+, CBS Sports NetworkChampions League Matchday2:45 p.m.CBS Sports Golazo NetworkThe Golazo Show3 p.m.Paramount+Chelsea vs. Ajax3 p.m.Paramount+Real Madrid vs. Juventus3 p.m.Paramount+Sporting Lisbon vs. Marseille3 p.m.Paramount+, CBS Sports Golazo NetworkMonaco vs. Tottenham Hotspur3 p.m.Paramount+Atalanta vs. Slavia Praha3 p.m.Paramount+Eintracht Frankfurt vs. Liverpool3 p.m.Paramount+Bayern Munich vs. Club Brugge3 p.m.Paramount+, CBS Sports NetworkUEFA Champions League Today post-match5 p.m.Paramount+, CBS Sports NetworkThe Champions Club5 p.m.CBS Sports Golazo Network, YouTubeScoreline7 p.m.\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bayer Leverkusen vs. PSG live stream, odds: How to watch Champions League, predicted lineups, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/5ae5060c-4379-49ca-8515-8d543f30f322/thumbnail/1200x675/ad093a575bbb2522cae2a65d3b641654/untitled-design-2025-10-21t120331-521.png"
      ],
      "datePublished": "2025-10-21T10:04:51.000Z",
      "dateModified": "2025-10-21T10:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tyler Lockett landing spots: Titans part ways with veteran WR after he asks for release, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/tyler-lockett-landing-spots-titans-part-ways-with-veteran-wr-after-he-asks-for-release-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/140f8b57-576d-4c82-9917-d8cf8d652e77/thumbnail/1200x675/2cb54c1caa7cad0ad0da9c9be5e8478b/locket.jpg",
    "tag": "Sports",
    "date": "2025-10-20T23:57:34.000Z",
    "description": "\n        Tennessee Titans wide receiver Tyler Lockett asked for his release from the team and was granted it, per ESPN. The 33-year-old pass-catcher i",
    "body": "\n        Tennessee Titans wide receiver Tyler Lockett asked for his release from the team and was granted it, per ESPN. The 33-year-old pass-catcher is now free to choose his next NFL home.Lockett was not a major contributor for the 1-6 Titans, as he caught just 10 passes for 70 yards in seven games played. His 21 targets ranked fifth on the team, behind Calvin Ridley along with rookie wideouts Elic Ayomanor and Chimere Dike.\n        \n            \n                Kayshon Boutte says Patriots took advantage of 'lazy cornerback play' vs. Titans\n                \n                    Chris Bengel                \n            \n                            \n    \n                \n                    \n    \nLockett, who said he grew up a Titans fan after the team drafted Vince Young in 2006, signed a one-year, $4 million deal this offseason with Tennessee that was worth up to $6 million. The Seattle Seahawks legend was released in March by the team that selected him in the third round back in 2015 after 10 productive seasons. Lockett left Seattle as the franchise's No. 2 all-time leading receiver, having caught 661 passes for 8,594 yards and 61 touchdowns. Only Steve Largent has caught more passes, touchdowns and recorded more receiving yards in a Seahawks uniform. Lockett's production has dipped over four straight seasons. In 2024, he caught 49 passes for 600 yards and two touchdowns for the Seahawks. While he's an older player, there could be some interest in the veteran wide receiver. Let's take a look at a handful of potential landing spots for Lockett.\n                            \n    \n                                                \n                    \n    Lockett could join forces with Pete Carroll and the Las Vegas Seahawks -- I mean, Raiders. Geno Smith has struggled mightily with his new team and this new wide receiving corps, which could be set to lose Jakobi Meyers at the trade deadline. Lockett doesn't automatically turn Vegas into a contender, but it would make life a bit easier on Smith and the passing game. \n\n                            \n    \n                                                \n                    \n    Through six games, there is just one player on the Pittsburgh Steelers that has recorded more than 187 yards receiving, and that's DK Metcalf. Not only would this hypothetical move reunite Lockett with Metcalf, but give Aaron Rodgers another reliable veteran. The Steelers passing attack ranks in the bottom half of the league, so adding a player like Lockett makes some sense.\n                            \n    \n                                                \n                    \n    Mike Vrabel just won his revenge game against the Titans, and now could pick up a discarded weapon Tennessee wasn't too interested in using. The New England Patriots wide receiving corps is not as bad as many believed it would be entering this season. Stefon Diggs has 456 yards receiving, Kayshon Boutte has emerged as a WR2 and then Mack Hollins and DeMario Douglas have been sprinkled in effectively as well. New England's passing attack now ranks No. 9 in the NFL (239 yards per game). Lockett could be another pass-catcher that helps Drake Maye gear up for his MVP run. \n                            \n    \n                                                \n                    \n    Ricky Pearsall missed last week with a knee injury, Jauan Jennings is dealing with ankle, rib and shoulder injuries, and then Brandon Aiyuk is not ready to make his 2025 debut just yet. Despite all of the injuries, the San Francisco 49ers sit atop the NFC West at 5-2. They could plan on bringing a former rival in to aid the passing game. \n\n                            \n    \n                                                \n                    \n    Perhaps Lockett could return home. Seattle doesn't have a glaring need at receiver with Jaxon Smith-Njigba, Cooper Kupp and Tory Horton leading the way for Sam Darnold, but the Seahawks didn't completely close the door on Lockett returning when the team released him this offseason. Seahawks general manager John Schneider said at the time, \"Go out and see what's shaking [on the market], and we'll stay in touch.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tyler Lockett landing spots: Titans part ways with veteran WR after he asks for release, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/140f8b57-576d-4c82-9917-d8cf8d652e77/thumbnail/1200x675/2cb54c1caa7cad0ad0da9c9be5e8478b/locket.jpg"
      ],
      "datePublished": "2025-10-20T23:57:34.000Z",
      "dateModified": "2025-10-20T23:57:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys injuries: Updates on DeMarvion Overshown, Shavon Revel, Kenny Clark - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-injury-updates-defensive-reinforcements-overshown-revel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/2ac36e3e-f14c-4e8e-abdd-87e121776027/thumbnail/1200x675/d97032307413c2826eecd14927f3f7e6/overshown.jpg",
    "tag": "Sports",
    "date": "2025-10-21T00:47:02.000Z",
    "description": "\n        FRISCO, Texas -- Fresh off the Dallas Cowboys' best defensive performance of the 2025 season in a 44-22 win over the Washington Commanders in",
    "body": "\n        FRISCO, Texas -- Fresh off the Dallas Cowboys' best defensive performance of the 2025 season in a 44-22 win over the Washington Commanders in Week 7, owner and general manager Jerry Jones promised reinforcements were on the way.\"We got a chance to evolve into the kind of team that our fans deserve,\" Jones said after the game.That wasn't simply Jones trying to stir the pot. Electrifying Cowboys linebacker DeMarvion Overshown tweeted \"T-21\" on Monday, indicating that his 21-day practice window -- which gives teams three weeks to decide whether to activate a player or move him to season-ending injured reserve -- had opened. That timeline suggests Overshown could return after the team's Week 10 bye for Week 11 at the Las Vegas Raiders on \"Monday Night Football.\"Overshown tore his ACL for the second time in his career on Thanksgiving last season. Cowboys head coach Brian Schottenheimer confirmed that Overshown's window had opened, along with those for third-round rookie cornerback Shavon Revel Jr. (knee) and starting center Cooper Beebe (ankle). Wide receiver Jonathan Mingo (knee) will be activated this week from injured reserve. Beebe has been working in the rehab group at Dallas practice the past few weeks along with Overshown and Revel.\n\"Don't predict they're all playing, but again, we're excited to get those guys back. They've worked so hard. Demo [Overshown] and Von [Revel] and really all the guys have worked so hard to get back that I'm excited to get them out there. But we'll be smart, and we'll ramp them up and see how they do\"Here's the outlook for Overshown and Revel this season, plus an update on defensive tackle Kenny Clark, who suffered an elbow injury on Sunday.\nOvershown is working his way back from his second major knee injury after tearing his ACL in the 2023 preseason as a rookie. He's ahead of schedule in his rehab after saying during organized team activities that his target return date was Thanksgiving. Schottenheimer said he's been impressed by Overshown's growth on the mental side during his recovery.\n\"I think how much he's been around [defensive coordinator Matt Eberflus] 'Flus and how he sits right in front of the meetings. As I've been sitting in the [defensive] meetings, he sits right in front, and he's got sunglasses on, which is kind of cool. I can't pull that off. I try,\" Schottenheimer said.\"He's intent. You hear him wanting to answer all the questions when they're asking another guy. You see him kind of mouthing the answer. I think it's the understanding of he knows the physical part is going to take care of itself, but mentally and understanding the system and the calls: closed left, rock logs and all the different things that we do. The checks have to make versus certain formations, man, he's all into that. So I think as you mature as a player you understand that it's not just the movement skills and the ability to tackle and run guys down. It's the mental side. It's a chess match, and I think he's gotten older and wiser. I think he's really attacking the play.\"\nClark suffered an elbow injury on a three-yard touchdown run by Commanders running back Chris Rodriguez Jr. with 2:39 left in the third quarter. He was officially listed as questionable but returned with 11:13 remaining in the fourth. Clark generated five quarterback pressures on Sunday, tying his 2025 season high. His 23 pressures lead the Cowboys this year.\n\"I think he's going to be good,\" Schottenheimer said of Clark. \"He's tough as nails, and I thought he did a really good job yesterday affecting the quarterback from a pass-rush standpoint too. The push that he and Osa [Odighizuwa] got in the middle was good to see.\"\nEven after Dallas' best defensive outing of the year against Washington, the Cowboys still rank last in the NFL in pass defense, allowing 260.3 yards per game. Getting Revel back can only help Eberflus' maligned secondary.\"You've just seen it over the last couple of weeks working with [director of rehab] Britt [Brown] -- you've seen the confidence and the change of direction in the things that he's doing, which now makes us very comfortable opening his window and letting him go out there and play football, which he loves to do,\" Schottenheimer said. \"Again, it'll be mostly scout-team stuff probably this week. Let him run around and chase CeeDee and George and those guys around, see how he does. He's going to make mistakes, but I'm pretty sure that he's really, really good at football too. ... I'm proud of him.\"\nDallas has been eager to get its third-round pick on the field given the attrition at cornerback this season, especially with Pro Bowl corner Trevon Diggs having suffered a concussion. There's plenty of excitement around the building for when Revel finally suits up.\"The size [6-foot-1, 194 pounds] and the athleticism jumped off the film in college. I think that, again, he has the traits that we love in corners: they have length, they have competitive spirit, things like that,\" Schottenheimer said. \"I don't want to go too far over the top in my praise for Von because it's going to be a little bit of a process. I'm excited to get him out there on the grass, running around and chasing around some pretty good receivers.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys injuries: Updates on DeMarvion Overshown, Shavon Revel, Kenny Clark - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/2ac36e3e-f14c-4e8e-abdd-87e121776027/thumbnail/1200x675/d97032307413c2826eecd14927f3f7e6/overshown.jpg"
      ],
      "datePublished": "2025-10-21T00:47:02.000Z",
      "dateModified": "2025-10-21T00:47:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]