[
  {
    "title": "Mississippi State vs. Wake Forest prediction, odds, spread: 2026 Duke's Mayo Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/mississippi-state-wake-forest-prediction-odds-time-2026-dukes-mayo-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/9bbbc69d-36f8-4438-816b-f38803e46a1b/thumbnail/1200x675/d0d7818d80ce6f49eadfc224fc773fe7/kamario-taylor-mississippi-state-bulldogs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-02T22:45:36.000Z",
    "description": "\n        The final non-CFP bowl matchup will see the Wake Forest Demon Deacons facing the Mississippi State Bulldogs on Friday in the 2026 Duke's Mayo",
    "body": "\n        The final non-CFP bowl matchup will see the Wake Forest Demon Deacons facing the Mississippi State Bulldogs on Friday in the 2026 Duke's Mayo Bowl. The Bulldogs (5-7) enter in on a three-game losing streak but have a 15-11 all-time record in bowl games. The Demon Deacons (8-4) enter the Duke's Mayo Bowl 2026 off a loss to the Duke Blue Devils, 49-32, but Wake sports an 11-6 all-time bowl record. An ACC team has lost in each of the last six editions of the Duke's Mayo Bowl. With MSU qurterback Blake Shapen opting out, freshman Kamario Taylor will start for the Bulldogs. Wake Forest running back Demond Claiborne has opted out as well.Kickoff is at 8 p.m. ET from Bank of America Stadium in Charlotte, N.C. The Bulldogs are 3-point favorites in the latest Wake Forest vs. Mississippi State odds from DraftKings Sportsbook, while the over/under for total points is 53.5. Before making any Mississippi State vs. Wake Forest picks, check out the college football predictions from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Wake Forest vs. Mississippi State. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Mississippi State vs. Wake Forest:Wake Forest vs. Mississippi State   spreadMississippi State -3 at DraftKings SportsbookWake Forest vs. Mississippi State   over/under53.5 pointsWake Forest vs. Mississippi State   money line Mississippi State -156, Wake Forest +130Wake Forest vs. Mississippi State   picksSee picks at SportsLineWake Forest vs. Mississippi State  streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Mississippi State vs. Wake Forest picksAfter simulating Wake Forest vs. Mississippi State   10,000 times, SportsLine's model is going Under on the total (53.5 points). Both teams are missing an important part of the offense with the veteran Shapen out for MSU and Claiborne sitting for Wake Forest.SportsLine's model is projecting 53 combined points, making the Under the slight value play. The model also says one side of the spread hits almost 60% of the time. You can see the model's pick at SportsLine.  So who wins Mississippi State vs. Wake Forest, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Wake Forest vs. Mississippi State spread to jump on, all from the advanced model that's simulated this mathcup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mississippi State vs. Wake Forest prediction, odds, spread: 2026 Duke's Mayo Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/9bbbc69d-36f8-4438-816b-f38803e46a1b/thumbnail/1200x675/d0d7818d80ce6f49eadfc224fc773fe7/kamario-taylor-mississippi-state-bulldogs-imagn-images.jpg"
      ],
      "datePublished": "2026-01-02T22:45:36.000Z",
      "dateModified": "2026-01-02T22:45:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arizona vs. SMU prediction, odds, time, spread: 2026 Holiday Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arizona-smu-prediction-odds-time-2026-holiday-bowl-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/3871091c-a1d8-4034-ae96-605856b5f681/thumbnail/1200x675/bde888be1476254dc6afcbe997d41d56/kevin-jennings-smu-mustangs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-02T22:30:50.000Z",
    "description": "\n        The 17th-ranked Arizona Wildcats battle the SMU Mustangs in the 2026 Holiday Bowl on Friday night. Arizona is coming off a 23-7 win at Arizon",
    "body": "\n        The 17th-ranked Arizona Wildcats battle the SMU Mustangs in the 2026 Holiday Bowl on Friday night. Arizona is coming off a 23-7 win at Arizona State on Nov. 28, while SMU is coming off a 38-35 loss at California on Nov. 29. The Wildcats (9-3), who finished tied for fourth at 6-3 in the Big 12 Conference, have won five in a row. The Mustangs (8-4), who tied for second in the ACC at 6-2, are 1-0 against ranked teams this season. Kickoff from Snapdragon Stadium in San Diego is at 8 p.m. ET. After opening as slight underdogs, the Mustangs are now 1.5-point favorites in the latest Arizona vs. SMU odds, while the over/under for total points scored is 51.5 via SportsLine consensus. Before making any SMU vs. Arizona picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Arizona vs. SMU. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for SMU vs. Arizona:Arizona vs. SMU                                                                                                                                                                                     spreadSMU -1.5 Arizona vs. SMU                                                                                                                                                                                 over/under51.5 pointsArizona vs. SMU                                                                                                                                                                                                                                                                                                 money line SMU -113, Arizona -105Arizona vs. SMU                                                                                                                                                                                                                                                                                         picksSee picks at SportsLineArizona vs. SMU                                                                                                                                                                                                                                                                                           streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Arizona vs. SMU picksAfter 10,000 simulations, SportsLine's model is going Over (51.5) on the total. The Over has hit in two of the last three games for the Mustangs. The model has Arizona quarterback Noah Fifita passing for more than 260 yards and two touchdowns, while SMU quarterback Kevin Jennings will surpass 250 yards passing and two scores. The teams are projected to combine for 58 points as the Over clears in nearly 60% of simulations. The model also says one side of the spread is the better value. You can see the model's pick at SportsLine.  So who wins Arizona vs. SMU, and which side of the spread is the better value? Visit SportsLine now to see which side of the Arizona vs. SMU spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arizona vs. SMU prediction, odds, time, spread: 2026 Holiday Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/3871091c-a1d8-4034-ae96-605856b5f681/thumbnail/1200x675/bde888be1476254dc6afcbe997d41d56/kevin-jennings-smu-mustangs-imagn-images.jpg"
      ],
      "datePublished": "2026-01-02T22:30:50.000Z",
      "dateModified": "2026-01-02T22:30:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. 49ers prediction, odds, time, date, line: NFL Week 18 Saturday picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-49ers-prediction-odds-spread-time-week-18-nfl-saturday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/200718f6-303d-4afd-8efb-88bcad28777e/thumbnail/1200x675/6e35110872d6d3738016468283dd94d9/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-03T02:05:27.000Z",
    "description": "\nThe top seed in the NFC will be up for grabs when the Seattle Seahawks battle the San Francisco 49ers in a key NFC West matchup on Saturday night. Se",
    "body": "\nThe top seed in the NFC will be up for grabs when the Seattle Seahawks battle the San Francisco 49ers in a key NFC West matchup on Saturday night. Seattle is coming off a 28-10 win at Carolina on Sunday, while San Francisco outlasted Chicago 42-38. The Seahawks (13-3), who lead the NFC West, have won six in a row. The 49ers (12-4), who are second in the division, have also won six straight and are 9-2 within the conference. Receiver Ricky Pearsall (knee, ankle) is questionable for the Niners. Kickoff from Levi's Stadium in Santa Clara, Calif., is set for 8 p.m. ET. The Seahawks lead the all-time series 31-24, but San Francisco has won seven of the past eight meetings. Seattle is the 2.5-point favorite in the latest 49ers vs. Seahawks odds, while the over/under for total points scored is 47.5 via DraftKings Sportsbook. Before making any Seahawks vs. 49ers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Seahawks vs. 49ers. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for 49ers vs. Seahawks:Seahawks vs. 49ers                                                                             spreadSeattle -2.5 at DraftKings SportsbookSeahawks vs. 49ers                         over/under47.5 pointsSeahawks vs. 49ers                                                                                                                                                                                         money line Seattle -138, San Francisco +117Seahawks vs. 49ers                                                                                                                                                                                 picksSee picks at SportsLineSeahawks vs. 49ers                                                                                                                                                                                   streaming Fubo (Try for free)   \nWhy the Seahawks can coverVeteran quarterback Sam Darnold helps power the Seattle offense. He has completed 67.2% of his passes for 3,850 yards and 25 touchdowns with 14 interceptions and a 99.2 rating. In a 38-37 overtime win over the Los Angeles Rams on Dec. 18, he completed 22 of 34 passes for 270 yards and two touchdowns with two interceptions. In a 38-14 win at Washington on Nov. 2, he completed 21 of 24 passes for 330 yards and four touchdowns with one pick.His top target is third-year veteran wide receiver Jaxon Smith-Njigba. In 16 games, he has 113 receptions for 1,709 yards and 10 touchdowns. He has 27 explosive plays of 20 yards or more, including a long of 63, with 505 yards after the catch and 74 first-down conversions. In the win over Carolina, he caught nine passes for 72 yards, including a long of 18. See which team to back at SportsLine. Why the 49ers can coverQuarterback Brock Purdy has been solid since returning from injury. In eight games this season, he has completed 69.3% of his passes for 2,040 yards and 20 touchdowns with nine interceptions and a 104.2 rating. He has also carried 31 times for 126 yards and three touchdowns. In the win over Chicago, he completed 24 of 33 passes for 303 yards and three touchdowns with one interception. He also rushed six times for 28 yards and two touchdowns.San Francisco's MVP may be Christian McCaffrey, who does not have an injury designation for the game despite missing practice on Tuesday (back). In 16 games this season, he has carried 303 times for 1,179 yards (3.9 average) and 10 touchdowns. He also leads the 49ers in receiving, with 96 receptions for 890 yards and seven touchdowns. In the win over the Bears, he carried 23 times for 140 yards (6.1 average) and one touchdown, while catching four passes for 41 yards. See which team to back at SportsLine.How to make Seahawks vs. 49ers picksSportsLine's model is going Over on the total, projecting 51 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins 49ers vs. Seahawks, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Seahawks vs. 49ers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. 49ers prediction, odds, time, date, line: NFL Week 18 Saturday picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/200718f6-303d-4afd-8efb-88bcad28777e/thumbnail/1200x675/6e35110872d6d3738016468283dd94d9/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-03T02:05:27.000Z",
      "dateModified": "2026-01-03T02:05:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Wake Forest-Mississippi State, Winter Classic - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-get-200-bonus-bets-wake-forest-mississippi-state-winter-classic/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-02T21:21:42.000Z",
    "description": "\n        Friday features a variety of high-quality online sports betting options, with the final day of non-playoff college football bowl games, a 10-",
    "body": "\n        Friday features a variety of high-quality online sports betting options, with the final day of non-playoff college football bowl games, a 10-game NBA slate, and the 2026 NHL Winter Classic, providing plenty of opportunities to utilize the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The Florida Panthers play the New York Rangers from the Miami Marlins' loanDepot Park in the Winter Classic, and the SportsLine advanced computer model is backing the visiting Rangers as +120 underdogs to defeat the Panthers as one of its Friday best bets at DraftKings Sportsbook. The Rangers are 14-8-2 on the road this season. The model also has a Friday best bet from the NBA, backing the Milwaukee Bucks to cover as 5.5-point favorites against the Hornets. One of SportsLine's top experts has a pick on Arizona vs. SMU in the Holiday Bowl. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 11 of the 2025-26 NBA season on a sizzling 32-14 roll on top-rated NBA spread picks dating back to last season, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookRangers (+120) vs. PanthersBucks (-5.5) vs. HornetsArizona (+1.5) vs. SMUCombining the model's three picks into a Friday parlay at DraftKings would result in a payout of +645 (risk $100 to win $645). Bet it at DraftKings here:\nRangers (+120) vs. PanthersThe Winter Classic is one of the most unique events in sports, and this year, rather than being played in a traditional outdoor cold-weather environment, the 2026 Winter Classic takes place in South Beach. The game will be played at the Marlins' loanDepot Park, but regardless of the venue, the Rangers have been an elite squad on the road this year. New York has the most road victories (14) this season and is 14-8-2 away for one of the best road winning percentages in the league. The Panthers have won back-to-back Stanley Cups, but they are 21-15-3 for 45 points, which is ninth in the Eastern Conference this year. The Rangers are 19-18-5 for 43 points, and given their strong play on the road, the model projects them to win in 52% of simulations, showcasing strong value at plus-money odds. Back the Rangers at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Bucks (-5.5) vs. Hornets (-110)The Bucks defeated the Hornets, 123-113, in Charlotte on Monday, and they'll have the homecourt advantage for tonight's matchup. Giannis Antetokounmpo has played the last three games since missing three weeks with a calf injury, and he had 33 points and 15 rebounds in just 28 minutes on Wednesday against the Wizards, showcasing he's back as his dominant self. The Bucks are 2-1 in his return. The two-time NBA MVP is averaging 28.9 points and 10 rebounds per game this season, and he had 24 points in just 25 minutes against the Hornets on Monday. He's off the injury report for Monday. The Hornets are 11-22 this season and coming off back-to-back losses. The model projects the Bucks to cover in 67% of simulations. Back the Bucks at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Arizona (+1.5) vs. SMU (-115)\"On the plus side, both of these star QBs (Arizona's Noah Fifta & SMU's Kevin Jennings) will play at the Holiday Bowl,\" legendary SportsLine expert Bruce Marshall said. \"As the campaign progressed, however, we began looking harder at the Cats, who started to resemble their 2023 entry under Jedd Fisch that had turned into a juggernaut at the end of the season and beat Oklahoma in the Alamo Bowl...with Fifita at QB. Fifita (26 TD passes, just 5 picks in 2025) was doing many of the same things this season as Brent Brennan got his regime back on course after a difficult 2024. Meanwhile, we wonder about the Ponies' focus after blowing their chance at an ACC title game berth in the season-ending loss at Cal.\" Back Arizona at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more college football, NBA and NHL picks on Friday?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Wake Forest-Mississippi State, Winter Classic - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-02T21:21:42.000Z",
      "dateModified": "2026-01-02T21:21:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL awards update: It's a two-man race for NFL Offensive Rookie of the Year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-awards-update-analysis-finding-value-in-the-2025-offensive-rookie-of-the-year-race-entering-week-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/4c26b4cf-8821-40f7-966a-a87e80a21e2c/thumbnail/1200x675/d4a5cc4d6b14e7dce89ca01af3b98128/tetairoa-mcmillan-carolina-panthers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-02T22:36:36.000Z",
    "description": "\nThe AP Offensive Rookie of the Year won't be announced until Feb. 5, but the leading candidates will make their final cases this weekend. According t",
    "body": "\nThe AP Offensive Rookie of the Year won't be announced until Feb. 5, but the leading candidates will make their final cases this weekend. According to current odds at DraftKings Sportsbook, the award is seemingly down to two candidates: Carolina Panthers receiver Tetairoa McMillan and New Orleans Saints quarterback Tyler Shough.At DraftKings, McMillan is the -175 favorite entering the final week of the regular season, while Shough is the +150 second choice. Patriots running back TreVeyon Henderson (+1200), Giants quarterback Jaxson Dart (+1400) and Buccaneers receiver Emeka Egbuka (+1600) round out the top five choices in the wagering but are considerable longshots.The case for McMillan to be the Offensive Rookie of the Year is strong. He leads all rookies in receiving touchdowns (seven), while ranking second in receiving yards (929) and third in receptions (66) for an 8-8 Panthers team that leads the division and can clinch a spot in the playoffs with either a win or tie against Tampa Bay (7-9) on Saturday or a Saints loss to the Falcons on Sunday. McMillan and Carolina are three-point underdogs in the latest odds from DraftKings to the Buccaneers.\nMeanwhile, Shough also has an argument to win the award. Since taking over the starting job for New Orleans in Week 9, the strong-armed quarterback has completed 69.6% of his passes for 1,997 yards and nine touchdowns against four interceptions. Most importantly, he has the Saints on a four-game winning streak, which is the franchise's longest in a single season since 2020. Shough and New Orleans are 3.5-point underdogs in the latest odds from DraftKings against Atlanta.\nBut there are two reasons why the betting value may still be on McMillan even though he's the favorite. First, he has a plus matchup against the Tampa Bay defense. Against this same defense just two weeks ago, he had six catches for 73 yards and a touchdown. The Buccaneers have one of the worst pass defenses in the league, allowing 236.4 yards per game through the air (26th in the league), and will be without cornerback Jamel Dean, who's out for Saturday with a shoulder injury.In addition, the structure of the voting could help McMillan. Voters are required to rank their top five Offensive Rookie of the Year candidates, and the players earn points on a 10-5-3-2-1 basis (10 points for a first-place vote, five for a second and so on). Past results show that voters favor players who play a full schedule versus those who play a shortened one. That could very well put McMillan, who has every game, on more ballots than Shough, who has played just 10 games and started eight of those.The -175 odds on McMillan to win the award translates to a 63.6% chance of winning, which means there's value to a bettor who believes McMillan's chance to win is roughly two-thirds or more.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL awards update: It's a two-man race for NFL Offensive Rookie of the Year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/4c26b4cf-8821-40f7-966a-a87e80a21e2c/thumbnail/1200x675/d4a5cc4d6b14e7dce89ca01af3b98128/tetairoa-mcmillan-carolina-panthers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-02T22:36:36.000Z",
      "dateModified": "2026-01-02T22:36:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Driver in fatal car accident involving Anthony Joshua faces charges - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/anthony-joshua-car-crash-fatality-driver-charged/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/f051f91c-abf1-44fb-af7b-cb29640eae50/thumbnail/1200x675/422368e497e6278497c5527d27d7b1b5/aj.jpg",
    "tag": "Sports",
    "date": "2026-01-02T21:08:43.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Police say the driver in the car accident that kil",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Police say the driver in the car accident that killed two people in Nigeria on Monday while also injuring boxer Anthony Joshua will face charges, according to the Associated Press. Adenyi Mobalaji Kayode has been charged with \"reckless\" and \"dangerous driving causing death,\" driving without a valid driver's license and driving \"without due care and attention, causing bodily harm and damage to property,\" according to police in Lagos. He was arraigned in Sagamu Magistrate Court Friday.The Federal Road Safety Corps previously said the findings of their preliminary investigation indicated the SUV carrying Joshua was speeding and lost control before crashing into a stationary truck. Joshua and Kayode suffered minor injuries, but Sina Ghami and Latif Ayodele -- both of whom were members of Joshua's team -- were killed. Joshua was taken to a local hospital to be treated for his injuries, and was released on Wednesday. Joshua was in Nigeria visiting the homeland of his parents. Nigerian president Bola Ahmed Tinubu posted a statement on Monday offering his condolences. \"I have spoken with AJ to personally convey my condolences over the passing of his two close associates, Kevin Latif Ayodele and Sina Ghami in the recent accident,\" Tinubu posted. \"I wished him a full and speedy recovery, and prayed with him. AJ assured me he is receiving the best possible care.\"\nThe former heavyweight champion had just knocked out Jake Paul on Dec. 19. Paul also posted a statement on social media, saying \"Life is much more important than boxing. I am praying for the lost lives, AJ and anyone impacted by today's unfortunate accident.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Driver in fatal car accident involving Anthony Joshua faces charges - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/f051f91c-abf1-44fb-af7b-cb29640eae50/thumbnail/1200x675/422368e497e6278497c5527d27d7b1b5/aj.jpg"
      ],
      "datePublished": "2026-01-02T21:08:43.000Z",
      "dateModified": "2026-01-02T21:08:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtic vs. Rangers: Where to watch Old Firm live stream, TV channel - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/celtic-rangers-wilfried-nancy-old-firm-turn-season-around/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/7e4b5895-e75f-4de1-bd9e-7413f3376b7f/thumbnail/1200x675/51fcbe3db4729f51c6dfb249e1b1b232/untitled-design-2026-01-02t205554-926.png",
    "tag": "Sports",
    "date": "2026-01-02T20:17:47.000Z",
    "description": "\nWe don't have to wait too long into 2026 for the first Old Firm of the year as Celtic and Rangers will meet on Saturday at Celtic Park at 7:30 a.m. E",
    "body": "\nWe don't have to wait too long into 2026 for the first Old Firm of the year as Celtic and Rangers will meet on Saturday at Celtic Park at 7:30 a.m. ET, (catch all the action on CBS Sports Network). But it's also a strange Old Firm, not only are both teams on their second manager of the year, but for the first time in recent memory, someone other than Celtic are leading the league entering the new year. How to watch Celtic vs. Rangers, oddsDate: Saturday, Jan. 3 | Time: 7:30 a.m. ETLocation: Celtic Park -- Glasgow, ScotlandTV: CBS Sports NetworkOdds: Celtic -105; Draw +290; Rangers +290You have to roll back the clock to 1985 for when a Sir Alex Ferguson led Aberdeen were the last team not named Celtic or Rangers to win the league in Scotland, but thanks to set piece dominance, Hearts are leading the league at the moment, with Celtic three points behind and chasing. The Bhoys have turned to Wilfried Nancy to right the ship, hiring him on December 4 from the Columbus Crew, and it has been a tough transition with him only winning one of his five matches in charge of the club.Falling in the Scottish League Cup final to St. Mirren, Celtic have already missed out on one chance at silverware and could see the league slip away after winning the title for four consecutive seasons. Oh, and your biggest rivals are around the corner. With all that together, it should come as no surprise that pressure is mounting on Nancy to turn things around, as time waits for no one, especially when you're expected to win the title. Nancy asked for time in his pre-match press conference, but that doesn't exist with Rangers and Hearts both on the schedule in January.\"In context, I knew this kind of situation could happen. I need time. Give me time, and you will see my team. You are going to see what I am going to do because you can see already what I did before,\" Nancy said during an almost seven minute monologue.\"I didn't start [in coaching] yesterday. If you do your job you will see the way I want to play, the way I defend, the way I want to attack; it is clear. It is totally normal that you guys, you kill me. I am fine with that. I am totally fine with that because I know where I want to go. Judge me in a few weeks, months.\"He's right that in previous stops with CF Montreal and the Columbus Crew in Major League Soccer that he has turned those teams into winners, and he rarely lost matches for extended periods but Scotland offers a new challenge for him. Not only does Nancy now need to turn around a team with no preseason and come from behind to win the title while also taking part in the Europa League, but he also needs to cope with the pressure that comes with managing one of the biggest clubs in the world.It doesn't get much bigger than the Old Firm as far as rivalry matches between teams go. Taking place since 1888, this series has featured 488 meetings and has been balanced with each club winning 171 times. Even during down seasons, a win in the Old Firm will provide bragging rights that go a long way to lifting morale but in that same vein, a loss during a down period is what can get a coach fired.Celtic haven't been slow to make changes when needed, and while Nancy is a manager who enterd being held in high regard, a lopsided loss to Rangers at home could lead to more changes. Celtic have added to the squad, acquiring right back Julian Araujo on loan from Bournemouth, but just like Nancy, he hasn't been with the club long and will need to make an impact out of the gate.It's all at stake on Saturday, and if Nancy is going to have a long tenure in charge of the Scottish club, the time is now to get his second win in charge of the club.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtic vs. Rangers: Where to watch Old Firm live stream, TV channel - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/7e4b5895-e75f-4de1-bd9e-7413f3376b7f/thumbnail/1200x675/51fcbe3db4729f51c6dfb249e1b1b232/untitled-design-2026-01-02t205554-926.png"
      ],
      "datePublished": "2026-01-02T20:17:47.000Z",
      "dateModified": "2026-01-02T20:17:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts vs. Texans where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-vs-texans-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/30/c9c43961-5946-443e-80a6-58acf8681764/thumbnail/1200x675/c650cec0e5f621fb879dea3a1a7cb28e/cj17.png",
    "tag": "Sports",
    "date": "2026-01-02T19:45:35.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The season arc for these two teams illustrates the old adage: it's not about how you start, but how you finish\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 2, 2026\n                            \n                    at\n    2:45 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After an 0-3 start, the Houston Texans are playoff bound. And depending on what happens in Week 18, still have a chance at winning a third straight AFC South title. Standing in their way is an Indianapolis Colts team playing for pride after an injury to Daniel Jones sent a once promising season into a tailspin. Houston (11-5) claims the AFC South with a win and a Jaguars loss to the Titans. As it stands, the Texans would enter the playoffs as the No. 5 seed and to face the AFC North champion (either the Ravens or Steelers) in the wild card round. If they win the AFC South, the Texans become the No. 3 seed and host either the Bills or Chargers next weekend. The Jaguars eliminated Indianapolis (8-8) last week from playoff contention. After an 8-2 start, the Colts lost six straight games, becoming the first team in 30 years to hold such a dubious distinction.\nWhere to watch Colts vs. Texans liveDate: Sunday, Jan. 4 | Time: 1 p.m. ETLocation:  NRG Stadium -- Houston, TexasTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Texans -10.5, O/U 38.5 (via DraftKings)Colts vs. Texans: Need to know New QB for Colts. After starting 44-year-old Philip Rivers for the past three games, the Colts turn the offense over to rookie Riley Leonard, who attempted 33 passes over four games. Leonard helped lead Notre Dame to the College Football Playoff National Championship Game last season, throwing for 21 touchdown passes while running for 17 more scores. Taylor in pursuit of rushing title. Colts running back Jonathan Taylor is 47 yards behind James Cook in the race to win the rushing title. Taylor faces a Texans defense Sunday that is fourth in the NFL in rushing. He had 21 carries for 85 yards in the Colts' 20-16 loss to Houston back in Week 13. Money in the red zone. Despite their recent slide, the Colts remain one of the NFL's best red zone teams on both sides of the ball. The Colts rank third and ninth in the NFL in red zone offense and defense, respectively. Taylor has been a key to the Colts' offensive red zone success as his 18 rushing touchdowns leads the NFL. Steady C.J. One of the NFL's most overlooked players, C.J. Stroud has once again been solid for the Texans. He is completing a career-high 64.8% of his passes with 18 touchdowns against just eight picks. Stroud received solid protection this season with just 23 sacks taken.Emerging skill players. Stroud's success can also be attributed to the Texans' young but emerging group of skill players. While Nico Collins continues to be the Texans' primary weapon, rookies Jayden Higgins, Jaylin Noel and Woody Marks add to the skill arsenal. No. 1 defense. Houston's defense may be the primary reason why it is playoff bound after an 0-3 start. The unit allows an average of just 16.5 points per game, featuring a ferocious pass rush led by Danielle Hunter and Will Anderson Jr.. They have a combined 26 sacks. The secondary features four players with at least four interceptions.Colts vs. Texans prediction, pick \nThe Colts would be better off starting Rivers if they're serious about winning this game. Instead, they gave Leonard his first career start against the league's top defense. Good luck, kid. Pick: Texans -10.5, Under 38.5 \n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts vs. Texans where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/30/c9c43961-5946-443e-80a6-58acf8681764/thumbnail/1200x675/c650cec0e5f621fb879dea3a1a7cb28e/cj17.png"
      ],
      "datePublished": "2026-01-02T19:45:35.000Z",
      "dateModified": "2026-01-02T19:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers vs. Vikings where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-vs-packers-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/31/eefebc09-8801-4ee1-866d-cbc8456a7ee3/thumbnail/1200x675/236c6a1db7984ec49baf9b8706302d61/gb.jpg",
    "tag": "Sports",
    "date": "2026-01-02T19:50:28.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Green Bay wraps up the regular season in Minnesota before turning its attention to wild card weekend\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 2, 2026\n                            \n                    at\n    2:50 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Minnesota Vikings will finish out the 2025 regular season at home against the rival Green Bay Packers. The 8-8 Vikings have been eliminated from playoff contention, while the 9-6-1 Packers are in as a wild card. With how the playoff picture looks in the NFC, this game is meaningless for Green Bay. The Packers will be the No. 7 seed in the conference.The Packers are actually the only team locked into their seed in the NFL. They've made the playoffs three straight years, but have been the No. 7 seed each time. Green Bay will play either the Chicago Bears or the Philadelphia Eagles on the road in the wild-card round. Perhaps the Packers would like a shot at revenge against the Bears after that Week 16 loss in Chicago, or revenge against the Eagles for the postseason loss last year. Let's break down this NFC North matchup. But first, here's how you can watch the game.\nWhere to watch Packers vs. Vikings liveDate: Sunday, Jan. 4 | Time: 1 p.m. ETLocation: U.S. Bank Stadium -- Minneapolis, MinnesotaTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Vikings -7.5; O/U 35.5 (via DraftKings)Packers vs. Vikings: Need to knowClayton Tune gets the start at QB: Jordan Love has cleared concussion protocol, but the Packers will be starting third-stringer Clayton Tune at quarterback with backup Malik Willis also dealing with injuries. A 2023 fifth-round pick of the Arizona Cardinals, Tune is 0-1 as a starter. He has thrown for 78 career yards and three interceptions in 14 games played. Malik Willis impressing: Despite the loss to the Baltimore Ravens last week, Willis impressed in significant action in relief of Love. He completed 18 of 21 passes for 288 yards and one touchdown, and led the team in rushing with 60 yards and two more touchdowns. The former third-round pick of the Tennessee Titans became the first quarterback all-time to complete 85% of his passes while averaging 13 yards per attempt and rush for 60 yards. However, coach Matt LaFleur wants to \"pump the brakes\" on any speculation that he will take Love's job.Trending in the wrong direction: The Packers have lost three straight games and allowed 41 points to the Ravens last week. Those are the most points allowed by Green Bay in a game since 2016. The Packers have also recorded just two sacks over the last four games. It's tied for the fewest sacks over a four-game span in team history.A surprising win streak: The Vikings have now won four straight games, which is their longest win streak of the season. In the surprise upset of the Detroit Lions on Christmas, Minnesota's defense forced a whopping six turnovers while quarterback Max Brosmer completed 9 of 16 passes for just 51 yards. Surging defense: The Vikings have recored at least five sacks in each of the last two games after having just one such game earlier this season. The Vikings are one of three teams with four or more players that have recorded six sacks on the year. Packers vs. Vikings prediction, pick\nThe Packers certainly would like to finish out the regular season strong, but that could be tough with an inexperienced quarterback on the road. The trends point to Minnesota covering the 7.5 points. The Vikings are a perfect 4-0 against the spread over their last four games, while the Packers are 1-7 against the spread vs. teams entering the matchup .500 or worse. Pick: Vikings -7.5, Under 35.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers vs. Vikings where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/31/eefebc09-8801-4ee1-866d-cbc8456a7ee3/thumbnail/1200x675/236c6a1db7984ec49baf9b8706302d61/gb.jpg"
      ],
      "datePublished": "2026-01-02T19:50:28.000Z",
      "dateModified": "2026-01-02T19:50:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TJ Watt injury: Steelers star 'excited to play' in Week 18 against Ravens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-tj-watt-injury-lung-ravens-week-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/a0419c0c-b910-4fcd-81f8-9462e3cc4d21/thumbnail/1200x675/f2d8aa401b669ad2ab6bce98943065b4/gettyimages-2249563802-1.jpg",
    "tag": "Sports",
    "date": "2026-01-02T20:56:19.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It appears as if the Pittsburgh Steelers will have",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It appears as if the Pittsburgh Steelers will have one of their top players back on the field as they push for an AFC North title in Week 18. Star edge rusher T.J. Watt, who returned to practice in a limited capacity this week, indicated Friday when speaking with reporters that he will play in Sunday's decisive clash against the Baltimore Ravens. Watt has been sidelined since Dec. 7 after undergoing surgery to correct a partially collapsed lung. \"I feel pretty good,\" Watt said. \"Honestly, I don't know if I could say that a week ago but I feel really good. I feel really confident about the week of practice and excited to play.\" Watt initially went to a Pittsburgh hospital last month when he experienced discomfort in his chest after a dry needle treatment session. The ensuing surgery caused him to miss three games. \nWatt indicated that he plans on taking a break from dry needling for the time being. \"It was very scary,\" Watt said. \"Just a significant amount of pain. Obviously, anytime you go to work and then have to all of a sudden need surgery, it sucks. Just a lot of unknown. But I'm glad to have the doctors that we had, surgery that I had. To be able to be here and play in a football game this weekend is all I'm really focused on now.\" Prior to the setback, Watt, a four-time first-team All-Pro with the Steelers, had 53 total tackles, including 15.5 for a loss, and seven sacks. He also logged an interception and seven pass deflections. \nPittsburgh will win its first AFC North title since 2020 if it's able to beat Baltimore Sunday night. A loss would eliminate the Steelers from playoff contention. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TJ Watt injury: Steelers star 'excited to play' in Week 18 against Ravens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/a0419c0c-b910-4fcd-81f8-9462e3cc4d21/thumbnail/1200x675/f2d8aa401b669ad2ab6bce98943065b4/gettyimages-2249563802-1.jpg"
      ],
      "datePublished": "2026-01-02T20:56:19.000Z",
      "dateModified": "2026-01-02T20:56:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Browns vs. Bengals where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/browns-vs-bengals-where-to-watch-pick-odds-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/30/5b264a10-dde0-43c6-9696-75a678f29967/thumbnail/1200x675/9ec48245249c7114c30754b9aeb6ede9/burrow17.png",
    "tag": "Sports",
    "date": "2026-01-02T19:45:41.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Burrow & Co. seek a third straight win; Garrett needs one sack for NFL's single-season record\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 2, 2026\n                            \n                    at\n    2:45 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        While there are no playoff stakes attached to it, rest assured that the Cincinnati Bengals and Cleveland Browns are both highly motivated to win Sunday's \"Battle of Ohio\" while ending the 2025 season with a win. Both teams are coming off of impressive wins. Cincinnati (6-10) picked up its second straight win in a 37-14 rout of the visiting Arizona Cardinals. Cleveland (4-12) recorded a 13-6 upset win over the visiting Pittsburgh Steelers that deprived Pittsburgh of a chance to capture the AFC North ahead of its Week 18 showdown with Baltimore. These two teams will end the season the way they started it. Back in Week 1, the Bengals left Cleveland with a hard-earned, 17-16 win. The Browns' starting quarterback that day, Joe Flacco, is currently backing up Joe Burrow in Cincinnati after making six starts for the Bengals earlier this season after being dealt from Cleveland prior to the trade deadline. \nWhere to watch Browns vs. Bengals liveDate: Sunday, Jan. 4 | Time: 1 p.m. ETLocation: Paycor Stadium -- Cincinnati, Ohio TV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Bengals -7.5, O/U 44.5 (via DraftKings)Browns vs. Bengals: Need to know Finishing strong. After getting shut out at home by the Ravens in Week 15, the Bengals have responded with two wins by a combined score of 82-35. Cincinnati received stellar performances in both games from Burrow, who completed 77.8% of his passes with six touchdowns and no picks in those games while averaging 307 passing yards per outing. The Burrow effect. Cincinnati is 5-2 this season in games with Burrow and 1-8 in games without him. The Bengals started 2-0 before going 1-8 after Burrow sustained a turf toe injury that sidelined him for nine weeks. Had the Bengals managed to win two more games during Burrow's absence, there's a very good chance that Cincinnati would be vying to win the AFC North division title this weekend. Burrow's supporting cast. The Bengals have one of the league's most formidable group of skill players, led by Ja'Marr Chase, who has been targeted a league-high 175 times this season. Cincinnati's offense also features Tee Higgins -- who has caught a team-high 10 touchdown passes this season -- and running back Chase Brown, who is 53 yards away from recording his first 1,000-yard season. Improving defense. Burrow's injury and a subpar defense is what ultimately sunk the Bengals' ship this season. A positive, though, has been that the defense has steadily improved under first-year coordinator Al Golden. Specifically, the team has received encouraging seasons from former first-round pick Myles Murphy, rookie linebacker Demetrius Knight Jr. and 2023 third-round pick Jordan Battle. Myles chasing history. After being held without a sack against the Steelers, Myles Garrett remains a sack away from breaking T.J. Watt and Michael Strahan's single-season sack record. Garrett currently has 22 sacks. Sanders' struggles. Shedeur Sanders threw the game-winning touchdown pass against the Steelers, but he also threw two interceptions that could have been costly. Sanders has thrown seven interceptions against just two touchdown passes over his last three games.  Browns vs. Bengals prediction, pick \nCleveland, led by Garrett, has a tough defense that could prevent Burrow & Co. from lighting up the scoreboard as much as they have in recent weeks. That being said, I expect the Bengals to pick up their third straight win while ending their season on a high note. Garrett will get his coveted sack record. Pick: Bengals -7.5, Under 44.5 \n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Browns vs. Bengals where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/30/5b264a10-dde0-43c6-9696-75a678f29967/thumbnail/1200x675/9ec48245249c7114c30754b9aeb6ede9/burrow17.png"
      ],
      "datePublished": "2026-01-02T19:45:41.000Z",
      "dateModified": "2026-01-02T19:45:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. Commanders where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-vs-commanders-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/30/e42f7e8f-5a6e-426d-a57e-7ef7b3b043ae/thumbnail/1200x675/436662c0f9c01b7d8a017a8f4ed9212f/jalen-hurts-eagles-4.jpg",
    "tag": "Sports",
    "date": "2026-01-02T19:50:24.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Philadelphia has wrapped up the NFC East but could have more playoff seeding on the line\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 2, 2026\n                            \n                    at\n    2:50 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        What a difference a year makes. After facing off in last season's NFC Championship Game, the playoff-bound Philadelphia Eagles host the disappointing Washington Commanders in the regular season finale.Even as Philadelphia (11-5) plans to rest or limit snaps for most of its starters -- Jalen Hurts will not play, and Tanner McKee will get the start at quarterback -- there are potentially some seeding implications up for grabs.The Eagles have already clinched the NFC East, becoming the division's first repeat champion in over two decades, and are currently the No. 3 seed in the NFC. They could move up to the No. 2 seed if the following happens ...Eagles win and the Chicago Bears lose to/tie the Detroit Lions OREagles tie and Bears loseAfter an up-and-down first few months to the season, the Eagles are looking like their reigning champion selves having won three straight, including a 13-12 win over the Buffalo Bills in Week 17. The defense especially has rounded into form led by Pro Bowl selections Jalen Carter, Cooper DeJean, Quinyon Mitchell and Zack Baun, though don't expect to see much from those players, if they even play at all.\nOn the other side, things couldn't have gone much worse for the Commanders (4-12) this season, and that's reflected in the quarterback situation. Josh Johnson, a journeyman backup, is likely to draw his second straight start. After an injury-riddled season, Jayden Daniels was shut down for the year several weeks ago, and Marcus Mariota (hand/quad) was injured in Washington's Week 16 loss to Philadelphia. Though Daniels has been the headliner for the difficult year, Washington has fielded one of the NFL's worst defenses, too.Here's how to watch the game, followed by betting information, top things to know and a prediction.\nWhere to watch Eagles vs. Commanders liveDate: Sunday, Jan. 4 | Time: 4:25 p.m. ETLocation: Lincoln Financial Field -- Philadelphia, PennsylvaniaTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Eagles -4.5, O/U 38.5 (via DraftKings)Eagles vs. Commanders: Need to knowTanner McKee gets another chance to impress. McKee has been in this situation before -- his only career NFL start came in Week 18 last season -- and thrived. He went 27 for 41 for 269 yards and two touchdowns. In his career, he has thrown four touchdown passes and zero interceptions while completing nearly 69% of his passes. He's one of the NFL's top backups. Eagles defense back to its dominant self. Over the past four weeks, the Eagles have allowed just 52 points, second-fewest in the NFL, and are first in yards per game allowed, yards per play allowed, passing yards per game allowed and sack rate. But perhaps most importantly, Philadelphia has played much better against the run. After allowing 281 rushing yards to the Bears, the Eagles are allowing just 3.8 yards per carry over the past four weeks, a top 10 rate in the NFL.Commanders looking for any positive signs. Washington has lost 10 of its last 11 games, but there have at least been a few nice signs of late. Rookie running back Jacory Croskey-Merritt has 226 rushing yards and four rushing touchdowns over his past three games, and second-year defensive lineman Johnny Newton had three sacks last week against the Dallas Cowboys.Eagles vs. Commanders pick, prediction\nThe Eagles may be resting most starters, but there is still plenty of talent. McKee has impressed before, and he should be able to do so again facing one of the league's worst defenses. Washington is depleted across the board and ready to put this season in the rearview. Pick: Eagles -4.5, Under 38.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. Commanders where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/30/e42f7e8f-5a6e-426d-a57e-7ef7b3b043ae/thumbnail/1200x675/436662c0f9c01b7d8a017a8f4ed9212f/jalen-hurts-eagles-4.jpg"
      ],
      "datePublished": "2026-01-02T19:50:24.000Z",
      "dateModified": "2026-01-02T19:50:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the scores and results from the 2025-26 college football postseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-schedule-scores-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/06/05/26e80b32-0f14-4b20-a9dc-f390a93fe891/thumbnail/1200x675/be898d509aa7443229d5effb3c6e8523/pop-tarts-bowl.jpg",
    "tag": "Sports",
    "date": "2026-01-03T05:07:43.000Z",
    "description": "\n\n\n    \n                                    Follow along with all the scores from every college football bowl game for the 2025-26 postseason\n        ",
    "body": "\n\n\n    \n                                    Follow along with all the scores from every college football bowl game for the 2025-26 postseason\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 3, 2026\n                            \n                    at\n    12:07 am ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the most exciting times of the year for college football games has arrived this holiday season as we are treated to an all-you-can-watch buffet of bowl game action. The schedule is stacked once again this year as fanbases are afforded the opportunity to see their teams in action one more time before the attention turns to the 2026 season. The bowl schedule kicked off Saturday, Dec. 13 and goes all the way until Jan. 2. The College Football Playoff carries us from there to Jan. 19, when two teams will vie for a national championship in Miami Gardens, Florida. \nBelow is a detailed look at the complete schedule and results for the 2025-26 college football bowl season, including dates, locations and TV channels. All times are Eastern.  College Football Playoff                                       DateBowlTime (TV)MatchupJan. 19 (Monday)College Football Playoff National ChampionshipMiami Gardens, Florida7:30 (ESPN)Semifinal winners \t\t\t\tJan. 9 (Friday)Peach (CFP Semifinal)Atlanta, Georgia7:30 p.m. (ESPN)(5) Oregon vs. (1) IndianaJan. 8 (Thursday)Fiesta (CFP Semifinal)Glendale, Arizona7:30 p.m. (ESPN)(10) Miami vs. (6) Ole MissJan. 1 (Thursday)Sugar (CFP Quarterfinal) New Orleans, Louisiana8:00 p.m. (ESPN)(6) Ole Miss 39, (3) Georgia 34Jan. 1 (Thursday)Rose (CFP Quarterfinal) Pasadena, California4 p.m. (ESPN(1) Indiana 38, (9) Alabama 3Jan. 1 (Thursday) Orange (CFP Quarterfinal) Miami Gardens, Florida12 p.m. (ESPN)(5) Oregon 23, (4) Texas Tech 0Dec. 31 (Wednesday)Cotton (CFP Quarterfinal) Arlington, Texas7:30 p.m. (ESPN)(10) Miami 24, (2) Ohio State 14Dec. 20 (Saturday)CFP First Round Game7:30 p.m. (TNT)(5) Oregon 51, (12) James Madison 24Dec. 20 (Saturday)CFP First Round Game3:30 p.m. (TNT)(6) Ole Miss 41, (11) Tulane 10Dec. 20 (Saturday)CFP First Round Game12 p.m. (ABC)(10) Miami 10, (7) Texas A&M 3Dec. 19 (Friday)CFP First Round Game8 p.m. (ABC)(9) Alabama 34, (8) Oklahoma 24  Other bowl games                                       DateTime (TV channel)BowlLocationMatchupDec. 13 (Saturday)12 p.m. ABCCricket Celebration BowlMercedes-Benz Stadium Atlanta, GeorgiaSouth Carolina State 40, Prairie View A&M 38 (4OT)Dec. 13 (Saturday)8 p.m. ESPNLA Bowl Hosted By GronkSoFi Stadium Inglewood, CaliforniaWashington 38, Boise State 10Dec. 16 (Tuesday)9 p.m. ESPNSalute to Veterans BowlCramton Bowl Montgomery, AlabamaJacksonville State 17, Troy 13Dec. 17 (Wednesday)5 p.m. ESPNCure BowlCamping World Stadium Orlando, FloridaOld Dominion 24, South Florida 10Dec. 17 (Wednesday)8:30 p.m. ESPN68 Ventures BowlHancock White Stadium Mobile, AlabamaDelaware 20, Louisiana 13Dec. 18 (Thursday)9 p.m. ESPN2Xbox BowlFord CenterFrisco, TexasArkansas State 34, Missouri State 28Dec. 19 (Friday)11 a.m. ESPNMyrtle Beach BowlBrooks Stadium Conway, South CarolinaWestern Michigan 41, Kennesaw State 6Dec. 19 (Friday)2:30 p.m. ESPNGasparilla BowlRaymond James Stadium Tampa, FloridaNC State 31, Memphis 7 Dec. 22 (Monday)2 p.m. ESPNFamous Idaho Potato BowlAlbertsons Stadium Boise, IdahoWashington State 34, Utah State 21Dec. 23 (Tuesday)2 p.m. ESPNBoca Raton BowlFlagler Credit Union Stadium Boca Raton, FloridaLouisville 27, Toledo 22Dec. 23 (Tuesday)5:30 p.m. ESPNNew Orleans BowlCaesars Superdome New Orleans, LouisianaWestern Kentucky 27, Southern Miss 16Dec. 23 (Tuesday)9 p.m. ESPNFrisco BowlFord Center at The StarFrisco, TexasOhio 17, UNLV 10Dec. 24 (Wednesday)8 p.m. ESPNHawai'i BowlClarence T.C. Ching Athletics Complex Honolulu, HawaiiHawaii 35, California 31Dec. 26 (Friday)1 p.m. ESPNGameAbove Sports BowlFord FieldDetroit, Mich.Northwestern 34, Central Michigan 7Dec. 26 (Friday)4:30 p.m.  ESPNRate BowlChase FieldPhoenix, Ariz.Minnesota 20, New Mexico 17Dec. 26 (Friday)8 p.m.  ESPNFirst Responder BowlGerald J. Ford Stadium Dallas, TexasUTSA 57, FIU 20Dec. 27 (Saturday)11 a.m. ESPNMilitary BowlNavy-Marine Corps Memorial Stadium Annapolis, MarylandEast Carolina 23, Pitt 17 Dec. 27 (Saturday)12 p.m. ABCPinstripe BowlYankee Stadium Bronx, New YorkPenn State 22, Clemson 10Dec. 27 (Saturday)2:15 p.m. ESPNFenway BowlFenway Park Boston, MassachusettsArmy 41, UConn 16Dec. 27 (Saturday)3:30 p.m. ABCPop-Tarts BowlCamping World Stadium Orlando, FloridaBYU 25, Georgia Tech 21Dec. 27 (Saturday)4:30 p.m. The CWSnoop Dogg Arizona Bowl Presented By Gin & Juice By Dre and SnoopArizona Stadium Tucson, ArizonaFresno State 18, Miami (OH) 3Dec. 27 (Saturday)5:45 p.m. ESPNNew Mexico BowlBranch Field at University Stadium Albuquerque, New MexicoNorth Texas 49, San Diego State 47Dec. 27 (Saturday)7:30 p.m.  ABCGator BowlEverBank Stadium Jacksonville, FloridaVirginia 13, Missouri 7Dec. 27 (Saturday)9:15 p.m. ESPNTexas BowlNRG Stadium Houston, TexasHouston 38, LSU 35Dec. 29 (Monday)2 p.m. ESPNBirmingham BowlProtective Stadium Birmingham, AlabamaGeorgia Southern 29, Appalachian State 10Dec. 30 (Tuesday)2 p.m. ESPNIndependence BowlIndependence Stadium Shreveport, LouisianaLouisiana Tech 23, Coastal Carolina 14Dec. 30 (Tuesday)5:30 p.m. ESPNMusic City BowlNissan Stadium Nashville, TennesseeIllinois 30, Tennessee 28Dec. 30 (Tuesday)9 p.m. ESPNAlamo BowlAlamodome San Antonio, TexasTCU 30, USC 27 (OT)Dec. 31 (Wednesday)12 p.m. ESPNReliaQuest BowlRaymond James Stadium, Tampa, FloridaIowa 34, Vanderbilt 27Dec. 31 (Wednesday)2 p.m. CBSTony the Tiger Sun BowlSun Bowl Stadium El Paso, TexasDuke 42, Arizona State 39Dec. 31 (Wednesday)3 p.m. ABCCitrus BowlCamping World Stadium Orlando, FloridaTexas 41, Michigan 27Dec. 31 (Wednesday)3:30 p.m. ESPNLas Vegas BowlAllegiant Stadium Las Vegas, NevadaUtah 44, Nebraska 22Jan. 2 (Friday)1 p.m. ESPNArmed Forces BowlAmon Carter Stadium Fort Worth, TexasTexas State 41, Rice 10Jan. 2 (Friday)4:30 p.m. ESPNLiberty BowlSimmons Bank Liberty Stadium Memphis, TennesseeNavy 35, Cincinnati 13Jan. 2 (Friday)8 p.m. ESPNMayo BowlBank of America Stadium Charlotte, North CarolinaWake Forest 43, Mississippi State 29 Jan. 2 (Friday)8 p.m. FOXHoliday BowlSnapdragon Stadium San Diego, CaliforniaSMU 24, Arizona 19\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the scores and results from the 2025-26 college football postseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/06/05/26e80b32-0f14-4b20-a9dc-f390a93fe891/thumbnail/1200x675/be898d509aa7443229d5effb3c6e8523/pop-tarts-bowl.jpg"
      ],
      "datePublished": "2026-01-03T05:07:43.000Z",
      "dateModified": "2026-01-03T05:07:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kawhi putting up Kobe-like stats during streak that might save Clippers' season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/clippers-winning-streak-kawhi-leonard-stats/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/9f6ad98e-64ca-4446-b58c-c922d5ef7d0c/thumbnail/1200x675/a9912ef4cbbb4b5c6e90057024824d70/kawhi-getty-8.png",
    "tag": "Sports",
    "date": "2026-01-02T20:52:55.000Z",
    "description": "\n        On Dec. 18, the Los Angeles Clippers were crushed by the reigning champion Oklahoma City Thunder. With the loss, their 10th in their last 11 ",
    "body": "\n        On Dec. 18, the Los Angeles Clippers were crushed by the reigning champion Oklahoma City Thunder. With the loss, their 10th in their last 11 games, they fell to 6-21 on the season, which at the time was tied for the third-worst record in the NBA. As Christmas approached, it seemed there was no end in sight for the Clippers' misery. They were five games out of the final Play-In Tournament spot in the Western Conference, trade talk was rampant and tanking wasn't really an option because their 2026 first-round pick belongs to the Thunder. Two weeks later, the Clippers are beginning the New Year as the hottest team in the league. They've won six games in a row -- the NBA's longest active winning streak -- to improve to 12-21 and are now just 1½ games out of the Play-In spots in the West. Over this span, they have the best offensive rating (127.2), defensive rating (105.6) and net rating (+21.6) in the league. \"We're still trying to get better individually and as a unit,\" Kawhi Leonard said after the team's win over the Utah Jazz on Thursday. \"We might not be contenders but we just gotta keep fighting.\" \nThe Clippers still have plenty of work to do to salvage something from this season, but the situation no longer looks completely hopeless. Let's take a closer look at how the Clippers have turned things around lately, and whether this resurgence is sustainable. Kawhi has reminded everyone of his brillianceSince 2017, the last time he reached the 70-game mark, Kawhi Leonard has played in 358 of a possible 669 regular season games (53.5%) for the San Antonio Spurs, Toronto Raptors and Los Angeles Clippers. You may not know when Leonard is going to suit up, but when he does, there are few players you'd rather have. His recent play has been a strong reminder of his place in the league's hierarchy when he's fully healthy. \nDuring the winning streak, the 34-year-old Leonard is averaging 39 points, 8.5 rebounds, four assists, 2.7 steals and 1.5 blocks on 53.2/44.1/93.5 shooting splits. He has three 40-point games in that span, including a career-high 55 points in the Clippers' win over the Eastern Conference-leading Pistons on Dec. 28. If you take only the last five games into account, Leonard joined Kobe Bryant as the only players in league history to have a five-game span where they averaged 40-plus points on 50/40/90 shooting splits with a perfect record, per Opta Sports. \nNotably, Leonard has attempted as many shots in the restricted area (29) in the last six games as he did in his first 17 games this season. He's made 75.9% of them, and has thrown down nine dunks, which is a telling sign that he feels healthy and trusts his body. Just look at this slam against the Trail Blazers. \nLeonard is also taking more 3s than ever before. Against the Jazz, he took a career-high 16 attempts, and during the six-game winning streak is shooting 44.1% on 9.8 attempts a night. After the Clippers' win over the Rockets, Leonard said he's trying to \"get as many 3s up as possible.\"Since the winning streak began, the Clippers have outscored their opponents by 117 points in 230 minutes with Leonard on the floor. For the season, the Clippers are 10-13 with Leonard in the lineup and 2-8 without him. When he's on the floor, they have a +2.7 net rating, and when he sits it plummets to -5.5. \"Finally getting healthy, finally being able to play enough minutes to be very, very effective. When he's healthy, he's one of the top guys in the league,\" Clippers coach Tyronn Lue said after Leonard's career-high effort. \"We've been able to see that as of late.\" \nAs always, though, \"when he's healthy\" is a major qualifier for Leonard. Can he stay on the floor consistently over the next three-plus months? The answer will likely determine whether the Clippers are able to grab a postseason spot. 3-point luck?Since Lue took over as head coach of the Clippers in 2020, the team has never finished higher than 14th in 3-point attempts per game, but has also never finished worse than seventh in 3-point percentage. Early this season, they were staying true to their inside-out approach, but were not hitting enough 3s to make up for the lack of volume. During their six-game winning streak, however, they've flipped a switch. Their 3-point attempts are way up -- their 51 3-point attempts in their win over the Jazz on Thursday were the second-most in franchise history -- and they've made at least 14 3s in each win. \nJust look at the difference:Period3PA3P%League ranksFirst 27 games35.535.1%20th / 20thLast 6 games40.541.2%t-7th / 3rd\"If they're good shots,\" Lue said, when asked if he wanted his team taking as many 3s as they did against the Jazz. \"You gotta take those shots, that's the way the game is being played nowadays.\"Leonard, Brook Lopez, Nicolas Batum, Kris Dunn, John Collins and Kobe Sanders are all shooting at least 38.5% on two or more attempts per game during the winning streak. Ironically, James Harden (30% on 8.3 attempts per game) is the one key contributor who has been ice cold in this span. As a team, the Clippers are shooting a league-best 50.5% on wide-open (closest defender six-plus feet away) 3s and 38.5% (fourth-best) on pull-up 3s over the last six games. Worringly, though, they're tied for 15th in wide-open 3 attempts per game (19) and 2nd in pull-up 3s (13). It's difficult to have sustained efficiency on that type of shot diet. The Clippers have also completely turned around their 3-point defense. They went from the worst 3-point defense in the league over the first 27 games to the best during this winning streak. PeriodOpp. 3PAOpp. 3P%Opp. league ranksFirst 27 games37.438.9%20th / 30thLast 6 games31.727.9%4th / 1stGetting Derrick Jones Jr. back from a knee injury has certainly helped their 3-point defense, as has playing the Rockets, Kings and Pistons, who are 30th, 29th and 28th, respectively, in 3-point attempts per game. Additionally, teams are just missing open shots. Here's a look at the Clippers' opponents' wide-open 3-point shooting:Period3PA3P%League ranksFirst 27 games18.742%11th / 28thLast 6 games1734.1%t-8th / 5thAnd the Clippers' opponents' open (closest defender four-to-six feet away) 3-point shooting:Period3PA3P%League rankFirst 27 games15.437.3%26th / 29thLast 6 games1223.3%5th / 1stThe Clippers are giving up about the same number of wide-open and open 3s during this winning streak as they did earlier in the season, but opponents are making them at a significantly lower rate. The drop-off in opponent open 3-point percentage, in particular, is stunning.While the Clippers were unlucky early in the season, they've been extremely lucky during the winning streak. It will be interesting to see how they fare in their next three games, which are against the Celtics, Warriors and Knicks -- all 3-point heavy offenses. Yanic and KobeThe Clippers went all-in on experience this offseason. They brought in Bradley Beal, Chris Paul, Lopez and Collins, and re-signed Harden and Batum. On opening night, they had the oldest roster in NBA history, with an average age of 33.2 years. Almost immediately, the plan fell apart. The Clippers looked completely out of place in the modern NBA, which is becoming faster and more athletic with each passing year. Experience isn't worth much if you can't keep up with your opponents. Beal ended up playing just six games before being ruled out for the season with a hip injury, while Paul was banished from the team early last month. \nWith Beal and Paul gone, and others in and out of the lineup due to injuries, Lue has had to turn to rookies Yanic Konan Niederhäuser and Kobe Sanders -- their first- and second-round selections in the 2025 NBA Draft. That duo, which combined for 16 points, 14 rebounds, four assists, a steal and two blocks on 7-of-14 shooting in the Clippers' win over the Jazz on Thursday, has given the team a much-needed boost of youth and athleticism. \"I thought his energy, just being able to sprint the pick-and-rolls and get out of the rolls fast enough to get behind the defense, was good,\" Lue said about Niederhäuser after he put up 16 points and six rebounds in their win over the Kings. \"I thought he was really good defensively at the rim, either blocking shots or altering shots. His energy -- running the floor, pick-and-rolls, getting off of it. He has done a really good job, and he is only going to get better.\"\nDuring the six-game winning streak, Niederhäuser is putting up 5.4 points, 4.4 rebounds and one block on 61.1% shooting in 18.4 minutes per game, while Sanders is contributing 6.5 points, 2.7 rebounds and 1.8 assists on 55.6% shooting in 18.8 minutes a night. It will be interesting to see if either rookie remains in the rotation once Ivica Zubac and Bogdan Bogdanovic are healthy, but it may be wise for Lue to find them some minutes. They've both proven that they can help on certain nights, at least during the regular season. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kawhi putting up Kobe-like stats during streak that might save Clippers' season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/9f6ad98e-64ca-4446-b58c-c922d5ef7d0c/thumbnail/1200x675/a9912ef4cbbb4b5c6e90057024824d70/kawhi-getty-8.png"
      ],
      "datePublished": "2026-01-02T20:52:55.000Z",
      "dateModified": "2026-01-02T20:52:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BYU vs. Kansas State prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/byu-kansas-state-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/ae758be4-3703-4f78-89cb-07fc0d07d181/thumbnail/1200x675/f9fb855c2cf40d38c207ec552b9b8f1b/aj-dybantsa.png",
    "tag": "Sports",
    "date": "2026-01-03T05:22:33.000Z",
    "description": "\n        Roadkills are gold in the chase for conference titles, and they might be everything in a Big 12 that has six teams with legitimate shots to h",
    "body": "\n        Roadkills are gold in the chase for conference titles, and they might be everything in a Big 12 that has six teams with legitimate shots to hang a banner. No. 10 BYU is one of those Scary Six, and the Cougars are getting thrown right into the fire by the Big 12's schedule-makers with Saturday's opening tilt on the road against a Kansas State club that could desperately use a signature win.AJ Dybantsa and PJ Haggerty are the two titans in this one. Dybantsa sits second in America in scoring, averaging over 23 points per game. Haggerty (22.9 ppg), meanwhile, checks in third nationally. These two are destined to go toe-to-toe for the Big 12 scoring title.Dybantsa might be the only person who was hesitant to celebrate New Year's Day because he had December to remember. The ballyhooed freshman had one of the best months in basketball history. He became the first Division I or NBA player in the last 30 seasons to have a calendar month averaging at least 25.0 points, 5.0 rebounds and 5.0 assists while shooting over 65% from the field for an undefeated team, according to OptaSTATS. Legitimately ludicrous stuff from the mean-muggin' stud.He can't be quite as dominant in Big 12 play ... right? We're about to find out.BYU vs. Kansas State: Need to knowCan Kansas State check AJ Dybantsa? Defense has been a major red flag for Kansas State all year, but especially against big wings. California's Chris Bell (27 points), Creighton's Josh Dix (18), Nebraska's Pryce Sandfort (21) and Bowling Green's Sam Towns (27) have all had eye-popping days against this K-State defense. It checks out on tape. With Mobi Ikegwuruka sidelined with a leg injury, Kansas State really has no true wing stopper on the roster. That's a scary thought ahead of a matchup against Dybantsa, who is the best pure wing in all of college basketball. I'd expect Nate Johnson and CJ Jones to get cracks at trying to slow down the BYU star, but the 6-9 Dybantsa is so much bigger than both Johnson (6-3) and Jones (6-5). If Kansas State isn't careful, Dybantsa could get to his patented midrange fadeaway whenever he wants over smaller defenders. Dybantsa is averaging a sparkling 1.4 points per possession on post-ups. Kansas State better have a sound defensive plan because it doesn't have the personnel to handle Dybantsa one-on-one without sending help.\nCan PJ Haggerty get Keba Keita in foul trouble? BYU has been a top-three (!) defense in America this year when Keba Keita is on the floor, per hoop-explorer. The chiseled big man is a true difference-maker on that end, but BYU's defense drops off significantly (allowing 13 more points per 100 possessions) when Keita is off the floor. Kansas State's PJ Haggerty is one of the elite foul-drawing guards in the country going up against a BYU defense that has been excellent at defending without fouling (11th-best rate, per KenPom). What gives? If he can get Keita a couple early fouls, the scales start tipping in K-State's direction in a hurry. Keep a close eye on Kennard Davis' impact as well. The big, strong wing has been an outstanding defender for BYU. He should get the first crack at Haggerty. If he can chest up and keep Haggerty out of the paint, that could keep Keita out of harm's way, too.Second-half Cougs: BYU has been the best second-half team in the country. Its +43.9 net rating in the second half is simply overwhelming and rates in the 100th percentile nationally, per CBB Analytics. Miami, Dayton and Clemson all learned just how hard it is to hold a lead against BYU, and the Cougars nearly erased a 20-point deficit in their lone loss to UConn back in mid-November. I wouldn't expect this stat to stick all year, but there's proof of concept that this club believes it can claw out of every hole. However, Kevin Young would likely prefer to quit digging said holes ... starting Saturday against Kansas State, because if K-State jumps out to an early advantage, Bramlage can feel overwhelming in a jiffy. Where to watch BYU vs. Kansas State live  Date: Saturday, Jan. 3 | Time: 1:30 p.m. ETLocation: Bramlage Coliseum -- Manhattan, KansasTV: CBS | Live stream: CBSSports.com, CBS Sports AppStreaming on Paramount+ Premium    \nBYU vs. Kansas State prediction, picks\nBYU has had 12 days off to enjoy Christmas break and sink its teeth into this matchup. If it wins, time off will be dubbed a good thing for rest and relaxation. If it loses, I'm sure the long layoff will be blamed by a few. Ultimately, this game will be decided by transition defense. Kansas State loves to push the pace in transition for quick buckets. BYU hasn't been one to run away from a track meet, so it better build a wall against Haggerty and recover to the shooters.But the worst unit in this game is easily Kansas State's defense. Dybantsa has too many guys he can pick at to find mismatches. BYU's offense is so good at finding the hot spots with Richie Saunders or Rob Wright, too. Even on the road, I think BYU has four of the best five players on the floor at all times. Kansas State can hang around because of the quick-strike transition scoring and Haggerty's individual brilliance, but BYU has too many edges schematically, coaching-wise and talent-wise to ignore. Pick: Kansas State +7.5\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            BYU -7.5\n                            \n    \n                                                \n                    \n    \n        \n                            Kansas St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BYU vs. Kansas State prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/ae758be4-3703-4f78-89cb-07fc0d07d181/thumbnail/1200x675/f9fb855c2cf40d38c207ec552b9b8f1b/aj-dybantsa.png"
      ],
      "datePublished": "2026-01-03T05:22:33.000Z",
      "dateModified": "2026-01-03T05:22:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]