[
  {
    "title": "Columbia vs. Cornell prediction, odds: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/columbia-cornell-odds-prediction-2026-ivy-league-college-basketball-picks-january-5/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/d42a853a-2783-4a3a-993c-db03c04e525e/thumbnail/1200x675/ca92ed2a57f4f7aa4c014023d9afa52a/cooper-noard-cornell-big-redcbs.jpg",
    "tag": "Sports",
    "date": "2026-01-05T12:20:43.000Z",
    "description": "\n        Teams coming off big wins clash when the Columbia Lions battle the Cornell Big Red in a key Ivy League opener on Monday afternoon. Columbia i",
    "body": "\n        Teams coming off big wins clash when the Columbia Lions battle the Cornell Big Red in a key Ivy League opener on Monday afternoon. Columbia is coming off a 106-51 win over Penn State-Abington on Wednesday, while Cornell rolled to a 133-65 victory over Alfred State on Friday. The Lions (11-3), who finished eighth in the league last year at 1-13, are 4-3 on the road this season. The Big Red (7-6), who finished second in the Ivy in 2024-25 at 9-5, are 4-0 on their home court this year.Tipoff from Newman Arena in Ithaca, N.Y., is set for 5 p.m. ET. Cornell leads the all-time series 100-81, including wins in each of the last nine meetings. Cornell is a 2.5-point favorite in the latest Columbia vs. Cornell odds from SportsLine consensus, while the over/under for total points scored is 169.5. Before making any Cornell vs. Columbia picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 10 on a sizzling 9-1 run on its top-rated over/under college basketball picks dating back to last season. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns. Now, the model has simulated Columbia vs. Cornell 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Cornell vs. Columbia:Columbia vs. Cornell                                                                            spread:    Cornell -2.5 at DraftKings SportsbookColumbia vs. Cornell                                                           over/under:    169.5 pointsColumbia vs. Cornell                                                                                         money line:    Columbia +117, Cornell -139Columbia vs. Cornell                                                                                         picks:    See picks at SportsLineColumbia vs. Cornell                                                                                         streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Columbia vs. Cornell picksSportsLine's model is going Over on the total (168.5 points). The Over has hit in each of the last six meetings between the teams. The model projects the Lions to have three players register 12.6 points or more, led by Kenny Noland's projected 19.2 points. The Big Red, meanwhile, are projected to have three players scoring 14.7 or more points, led by Cooper Noard, who is projected to score 22.3 points. The model projects a combined total of 171 points as the Over clears in well over 54% of simulations.The model also says one side of the spread hits over 70% of the time. You can only see that pick at SportsLine.So who wins Cornell vs. Columbia, and which side of the spread hits over 70% of the time? Visit SportsLine now to see which side of the Columbia vs. Cornell spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Columbia vs. Cornell prediction, odds: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/d42a853a-2783-4a3a-993c-db03c04e525e/thumbnail/1200x675/ca92ed2a57f4f7aa4c014023d9afa52a/cooper-noard-cornell-big-redcbs.jpg"
      ],
      "datePublished": "2026-01-05T12:20:43.000Z",
      "dateModified": "2026-01-05T12:20:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers vs. Ravens prediction, odds, time: 'Sunday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-ravens-prediction-odds-spreads-time-week-18-sunday-night-football-picks-lines-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/25de109c-911e-4ff1-8645-72149a41b19f/thumbnail/1200x675/189910a20d1bdd841e679d31553ada6f/lamar-jackson-baltimore-ravens-2.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:22:04.000Z",
    "description": "\nThe final game of the NFL regular season is a winner-take-all contest with the Pittsburgh Steelers hosting the Baltimore Ravens on 'Sunday Night Foot",
    "body": "\nThe final game of the NFL regular season is a winner-take-all contest with the Pittsburgh Steelers hosting the Baltimore Ravens on 'Sunday Night Football.' The victor will claim the AFC North and the conference's No. 7 seed, while the loser gets left out of the postseason picture. Pittsburgh (9-7) saw a three-game win streak come to an end with a 13-6 defeat to Cleveland in Week 17. Baltimore (8-8) ran over Green Bay to the tune of a 41-24 triumph on Saturday without Lamar Jackson (back). The two-time MVP returned to practice this week and will play in this one, as will T.J. Watt (lung), while Pittsburgh remains without DK Metcalf (suspension). Rashod Bateman is inactive for Baltimore, as is Roman Wilson for Pittsburgh.Kickoff is at 8:20 p.m. ET from Acrisure Stadium in Pittsburgh. The Steelers prevailed, 27-22, when these squads met in Week 14. The latest Ravens vs. Steelers  odds have Baltimore as a 3.5-point road favorite, while the over/under for total points scored is 41.5 via DraftKings Sportsbook. The Under is 8-2 over the last 10 meetings between the teams. Before making any Steelers vs. Ravens picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Ravens vs. Steelers. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends for Steelers vs. Ravens:Ravens vs. Steelers                                                                  spreadRavens -3.5 at DraftKings SportsbookRavens vs. Steelers              over/under41.5 pointsRavens vs. Steelers                                                                                                                                                                             money line Baltimore -202, Pittsburgh +167Ravens vs. Steelers                                                                                                                                                                      picksSee picks at SportsLineRavens vs. Steelers                                                                                                                                                                        streaming Fubo (Try for free)\nWhy the Ravens can coverBaltimore got back to its identity of dominating the trenches in Saturday's win over Green Bay by rushing for 307 yards, which is the fourth-most in franchise history. The Ravens also had 217 yards on the ground in Week 14 versus Pittsburgh, so it has shown it can exploit the Steelers in that regard, and the latter already struggles in defending through the air as Pittsburgh ranks 29th in pass defense. Additionally, Baltimore held Pittsburgh to a season-low of 34 rushing yards in that earlier contest, while the Steelers failed to find the endzone without Metcalf on Sunday. Thus, there are multiple areas where Baltimore should excel over Pittsburgh, and one can't overlook that the Ravens are 4-1 ATS over their last five road games. See which team to back at SportsLine. Why the Steelers can coverPittsburgh has confidence in that it just beat the Ravens, in Baltimore, a month ago, and Aaron Rodgers has experienced nothing but success versus the Ravens. He's 4-0 versus the team over his career, making it one of two opponents he's undefeated against. Pittsburgh's success versus its rival extends beyond when Rodgers joined the team as the Steelers are 7-3 ATS versus Baltimore over their last 10 meetings. The Steelers' defense is also playing its best, allowing just 17.3 points over its last three games, and it is poised to get its best player back with T.J. Watt (lung) off the injury report and expected to return on Sunday night. Finally, Pittsburgh boasts the fifth-best turnover differential (plus-11), while Baltimore has the fifth-most giveaways (22). See which team to back at SportsLine.How to make Steelers vs. Ravens  picksSportsLine's model has simulated Ravens vs. Steelers  10,000 times is going Over on the total, projecting 47 combined points. It also says one side of the spread hits well over 50% of the time.         You can only get the pick at SportsLine. So who wins Steelers vs. Ravens, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Ravens vs. Steelers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers vs. Ravens prediction, odds, time: 'Sunday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/25de109c-911e-4ff1-8645-72149a41b19f/thumbnail/1200x675/189910a20d1bdd841e679d31553ada6f/lamar-jackson-baltimore-ravens-2.jpg"
      ],
      "datePublished": "2026-01-05T00:22:04.000Z",
      "dateModified": "2026-01-05T00:22:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-spread-time-ravens-steelers-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/36a1df33-1136-4561-8304-00b51f69280c/thumbnail/1200x675/a25cce6e48ddce2339cf341ad96ee05a/aaron-rodgers-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:32:26.000Z",
    "description": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday ",
    "body": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday Night Football.' Baltimore is coming off a 41-24 thumping of the Green Bay Packers in Week 17, while Pittsburgh dropped a 13-6 decision to the Cleveland Browns. The Ravens (8-8), who have won the past two division championships, would hold the tiebreaker with Pittsburgh if they finish with the same record. The Steelers (9-7), who are looking for their first AFC North crown since 2020, are 5-3 on their home field. Lamar Jackson (back) will start at quarterback for the Ravens, while receiver Rashod Bateman is inactive. Pittsburgh will again be without receiver DK Metcalf (suspension), but T.J. Watt (lung) is expected to return after having surgery.Kickoff from Acrisure Stadium in Pittsburgh is set for 8:20 p.m. ET. The Steelers lead the all-time series 37-27, including a 27-22 win in Baltimore on Dec. 7. Baltimore is a 3.5-point favorite in the latest Ravens vs. Steelers odds from DraftKings Sportsbook, while the over/under for total points scored is 41.5. Baltimore is at -202 on the money line (risk $202 to win $100), with Pittsburgh at +167 (risk $100 to win $167). The Under is 8-2 over the teams' last 10 matchups. Before locking in any Steelers vs. Ravens picks, make sure to check out the 'Sunday Night Football' predictions from SportsLine NFL expert Mike Tierney.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nA veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. Mike is 235-189-13 in the NFL the past three seasons, returning $2,505 to $100 players. In addition, he is an amazing 31-14-1 on his last 46 picks in games involving the Baltimore Ravens, returning $1,527. Anyone who has followed him could be way up. Now, Tierney has set his sights on Ravens vs. Steelers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Ravens vs. Steelers: Ravens vs. Steelers                                         spreadBaltimore -3.5 at DraftKings SportsbookRavens vs. Steelers                                                 over/under41.5 pointsRavens vs. Steelers                                                 money line Baltimore -202, Pittsburgh +167Ravens vs. Steelers                                             picksSee picks at SportsLineRavens vs. Steelers                                                 streaming Fubo (Try for free)  \nWhy the Ravens can winVeteran running back Derrick Henry can put the offense on his back, as he did in last week's win over the Packers. Henry rushed 36 times for 216 yards and four touchdowns at Green Bay. For the season, he has carried 287 times for 1,469 yards and 16 touchdowns. He has 15 explosive plays of 20 yards or more, including a long of 59, with 74 first-down conversions. He has also caught 20 passes for 150 yards and has over 100 scrimmage yards earlier this year versus Pittsburgh.Wide receiver Zay Flowers has been solid in the passing game. In 16 games, Flowers has 82 receptions for 1,073 yards and three touchdowns. He also has 17 big plays of 20 yards or more, including a long of 56, with 400 yards after the catch and 45 first-down conversions. Against the Packers, he caught four passes for 30 yards and a score. Facing Pittsburgh's No. 29 passing defense, Flowers should find holes in the secondary. See which team to back at SportsLine. Bet Lamar Jackson to go Over 214.5 passing yards at DraftKings:\nWhy the Steelers can winVeteran quarterback Aaron Rodgers, who is in his 21st season in the league, powers the Pittsburgh offense. In 15 games, he has completed 65.6% of his passes for 3,028 yards and 23 touchdowns with seven interceptions and a 95.3 rating. Rodgers has also rushed for one score and should be able to take advantage of Baltimore's 29th-ranked pass defense. In the win over the Ravens in December, he completed 23 of 34 passes for 284 yards and one touchdown. He also rushed for one score.Four-year veteran running back Jaylen Warren helps lead the Steelers' ground attack. In 15 games, he has carried 197 times for 892 yards (4.5 average) and six touchdowns. He has six explosive plays of 20 or more yards, including a long of 45. He has converted 48 first downs, and he scored a touchdown versus Baltimore earlier this season. In a 29-24 win at Detroit on Dec. 21, he carried 14 times for 143 yards and two touchdowns. See which team to back at SportsLine.Bet Jonnu Smith to go Over 16.5 total receiving yards at DraftKings:\nHow to make Ravens vs. Steelers  picksTierney has analyzed Ravens vs. Steelers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Steelers vs. Ravens, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Ravens vs. Steelers spread you need to jump on, all from the expert that is 31-14-1 on his last 46 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/36a1df33-1136-4561-8304-00b51f69280c/thumbnail/1200x675/a25cce6e48ddce2339cf341ad96ee05a/aaron-rodgers-imagn.jpg"
      ],
      "datePublished": "2026-01-05T00:32:26.000Z",
      "dateModified": "2026-01-05T00:32:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Did Baylor just reveal the cheat code on how to slow Iowa State's Audi Crooks? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/baylor-cheat-code-how-to-slow-down-iowa-state-audi-crooks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/2b5d9a44-9f8e-4d36-b46d-b19e44dce695/thumbnail/1200x675/7667c589608c9c240701ba79eab7ccc7/untitled-design-2026-01-04t230115-233.png",
    "tag": "Sports",
    "date": "2026-01-05T07:11:04.000Z",
    "description": "\n        In the process of handing No. 10 Iowa State its first loss of the season Sunday afternoon, No. 22 Baylor and Bears coach Nicki Collen may hav",
    "body": "\n        In the process of handing No. 10 Iowa State its first loss of the season Sunday afternoon, No. 22 Baylor and Bears coach Nicki Collen may have given the rest of the country a blueprint on how to slow down Naismith Player of the Year candidate Audi Crooks. The game log will show that Baylor's Taliah Scott, who scored all of her 21 points in the second half, sank a last-second jumper to power the Bears' 72-70 upset win over the Cyclones (14-1) in Ames, Iowa, but the plan and execution regarding how to handle Crooks is what set the table for the stunning upset.Prior to the game, Collen joked that Baylor (13-3) would need supernatural help to defend Crooks, who entered Sunday as the leading scorer in the nation at 29.4 points per game on a historic 72.5% shooting. In NCAA Division I women's basketball history (which officially dates back to 1981-82), there have been 24 previous instances of a player averaging at least 29 points per game, per Stathead. None of them have shot above 60.1%. Crooks has largely been unstoppable this season thanks to her rolodex of post moves, deft footwork and unique frame. She already has three 40-point outings, including a career-high 47 points against Indiana, and hasn't shot worse than 57.1% in any game. \nEarly against Baylor, it was more of the same. Crooks, allowed to play one-on-one, scored Iowa State's first nine points with ease, and had 14 points on a perfect 6-6 from the field in the first quarter. By the end of the first half, she was up to 22 points on 9 of 11, and one of those misses was a rare 3-pointer just before the halftime buzzer. \nCrooks' productive second quarter overshadowed the fact that Baylor had started to change their defensive gameplan. In the middle of the frame, there were multiple possessions where Jada Williams' defender sank into the paint to front Crooks and prevent the Cyclones from getting her the ball. \nThat foreshadowed the Bears' even more drastic approach in the fourth quarter, when they refused to let Crooks impact the game. Once again, the Bears ignored Williams (Reese Beaty briefly got the same treatment when she was in the game for Williams) so they could have two defenders sandwich Crooks in the post. While Williams is a strong playmaker -- team-high 7.2 assists per game -- she entered Sunday shooting just 39.7% from the field, including 26.7% from 3-point range. \n\"One of the guards was just sitting in front of me the whole time, and the other girl that was actually guarding me was behind me,\" Crooks said. \"It made it really, really hard for the guards to make post-entry passes because they were also both I think at least 6-foot with ups, so that makes it difficult to get it inside. It was a good defensive plan by Baylor.\"Even late in the fourth, the Bears were content to let Williams walk into 15-footers rather than let Crooks get involved. \nCrooks went scoreless in the fourth quarter, and her two shot attempts were a rushed fadeaway the one time she got a post touch and a putback from an offensive rebound that got blocked. As a team, the Cyclones managed just 14 points on 6 of 17 from the field, as the Bears completed the comeback victory. \n\"Obviously made it hard to get Audi the ball,\" Iowa State coach Bill Fennelly said after the game. \"At the end of the day, it's hard to beat a really good team playing two against five, and that's basically what it came down to today,\"Crooks finished with 26 points on 11 of 20 from the field, but just four of them came in the second half. Williams, meanwhile, had 28 points on 11 of 28 shooting, including 6 of 17 from 3-point range -- all of those marks were career-highs for the junior guard. Everyone other Iowa State player combined for 16 points on 5 of 23. Throughout Crooks' dominant start to the season, there has been plenty of chatter about why opponents have not sent more double teams her way. The obvious answer has been Iowa State's elite 3-point shooting. The Cyclones entered Sunday shooting 38.2% from behind the arc as a team, which ranked 14th in the country, and three of their starters -- Mackenzie Hare, Arianna Jackson and Addy Brown -- were shooting 43.2% or better.\nThe Cyclones' spacing in their four-out offense makes it difficult to properly execute a double without giving up an open shot, but it has still been surprising that opposing coaches have not attempted to take the ball out of Crooks' hands more often. Collen and the Bears took that idea one step further. You don't have to worry about how to get the ball out of her hands if she never has it in the first place. Plus, by ignoring Williams and face-guarding the Cyclones' elite 3-point threats, the Bears exerted more control over who had the ball and was forced to shoot instead of Crooks. \"We had to find a way to take Crooks away, and so we obviously made the decision to let Jada Williams shoot,\" Collen said after the game. \"Sometimes it looks crazy, because she obviously made some, but at the end of the day, when you look at the analytics, and Crooks shoots 70%, and Jackson and Hare shoot 50% from 3, we had to pick our poison. I thought we executed that at a high level.\"\nCollen's bold and daring strategy helped her team pick up its biggest win of the season, and showed that it's possible to slow down Crooks -- even without supernatural help. Was this a one-off success that caught Iowa State off-guard, or will their upcoming opponents take a page out of Baylor's book. And if they do, how will the Cyclones respond?Connelly doesn't expect to wait long to find out. \"We'll probably see it Wednesday,\" he said, when his team travels to Ohio to take on Cincinnati. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Did Baylor just reveal the cheat code on how to slow Iowa State's Audi Crooks? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/2b5d9a44-9f8e-4d36-b46d-b19e44dce695/thumbnail/1200x675/7667c589608c9c240701ba79eab7ccc7/untitled-design-2026-01-04t230115-233.png"
      ],
      "datePublished": "2026-01-05T07:11:04.000Z",
      "dateModified": "2026-01-05T07:11:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brendan Sorsby commits to Texas Tech: Cincinnati transfer QB joins Red Raiders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/brendan-sorsby-transfer-portal-texas-tech-cincinnati-qb-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/4a0492c5-8cb5-47d8-8ed9-497252c2e753/thumbnail/1200x675/67d86384e0f837980723f2080f702666/brendan-sorsby.jpg",
    "tag": "Sports",
    "date": "2026-01-05T05:01:43.000Z",
    "description": "\n        Cincinnati transfer quarterback Brendan Sorsby has committed to Texas Tech, CBS Sports' Chris Hummer and Matt Zenitz report, choosing the Red",
    "body": "\n        Cincinnati transfer quarterback Brendan Sorsby has committed to Texas Tech, CBS Sports' Chris Hummer and Matt Zenitz report, choosing the Red Raiders after a quick visit schedule that also included LSU.Sorsby is rated as the No. 2 quarterback and the No. 2 overall transfer prospect in this cycle in the 247Sports transfer rankings.Sorsby's decision keeps him in the Big 12 and gives Texas Tech an experienced option at quarterback after a season that ended with lingering questions at the position. The Red Raiders won the Big 12 Championship for their first out-right conference title since 1955 but struggled offensively in their College Football Playoff quarterfinal loss to Oregon at the Orange Bowl, where Behren Morton was unable to generate much production in a 23-0 shutout.\n        \n            \n                Drew Mestemaker commits to Oklahoma State: Former North Texas QB joins coach Eric Morris in Stillwater\n                \n                    Cody Nagel                \n            \n                            \n    \n                \n                    \n    \nTexas Tech has already demonstrated a willingness to be aggressive in the transfer portal, using resources and NIL opportunities to target impact players at positions of need. Sorsby's addition signals that the Red Raiders are prepared to continue that approach, blending proven experience with a roster built to compete at the highest level of the conference.How Sorsby fits with Texas Tech Sorsby joins a room that includes rising sophomore Will Hammond, who suffered a torn ACL this season. While he could be ready for the start of 2026, Sorsby provides immediate experience and the option for Hammond to gain more experience in a backup role before taking over the reins in 2027.\nWhen Sorsby initially made his decision to enter the transfer portal, there was speculation he could also explore the NFL Draft after a breakout season that put him on the radar as a potential early-round pick. Instead, he appears ready to return to college for a final year, giving him an opportunity to further refine his game and improve his draft stock.Sorsby will arrive at Texas Tech with three years of starting experience and a track record of production at the Power Four level, though team success has varied. He is 13-17 (.433) as a starter in his career, including a 1-6 mark at Indiana as a redshirt freshman in 2023. After that season, he transferred to Cincinnati ahead of the 2024 campaign and went on to establish himself as one of the Big 12's more efficient passers across two seasons with the Bearcats.Sorsby does it with arm, legsDuring his time at Cincinnati, Sorsby passed for 5,613 yards and 45 touchdowns, completing 62.9% of his passes. He led the Big 12 in yards per completion (13.5) this season. He showed consistent command of the offense early in the season, including a seven-game stretch without an interception. Sorsby matched a career-low with only five picks in 12 games this season. He earned second-team All-Big 12 honors.\nSorsby also adds value as a runner, becoming more involved in the ground game as his career progressed. He finished this year at Cincinnati with a career-high 580 rushing yards on 100 carries and nine rushing touchdowns, matching his total from the previous season. While Cincinnati closed the year with four straight losses and his passing efficiency dipped late, his overall body of work made him one of the most sought-after quarterbacks in the portal.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brendan Sorsby commits to Texas Tech: Cincinnati transfer QB joins Red Raiders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/4a0492c5-8cb5-47d8-8ed9-497252c2e753/thumbnail/1200x675/67d86384e0f837980723f2080f702666/brendan-sorsby.jpg"
      ],
      "datePublished": "2026-01-05T05:01:43.000Z",
      "dateModified": "2026-01-05T05:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, TV for every round from wild card to Super Bowl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg",
    "tag": "Sports",
    "date": "2026-01-05T04:39:36.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                    ",
    "body": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 4, 2026\n                            \n                    at\n    11:39 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports Design\n            \n            \n    \n        After one of the wildest seasons in NFL history, the playoffs are finally here. This year's postseason won't have Patrick Mahomes and the Chiefs, but there will still be plenty of familiar faces. The Eagles are in the playoffs for the fifth straight season and they'll be looking to become the first NFC team in 31 years to repeat as Super Bowl champion. Jalen Hurts is one of just two quarterbacks in the playoffs this year who has won a Super Bowl along with Matthew Stafford and Aaron Rodgers. The Steelers quarterback actually has more career playoff wins than every other QB in the AFC playoff field combined. There are also plenty of new faces in the postseason this year, including six teams that didn't make the playoffs last year with the Seahawks, 49ers, Panthers, Bears, Patriots and Jaguars all getting in. The final five teams in that group all lost at least 11 games last year before rebounding to make the postseason this year. The Panthers are in playoffs for the first time since 2017 and they'll be kicking off the postseason this year by hosting the Saturday afternoon game. With that in mind, let's get to the full playoff schedule. \n        \n            \n                2026 NFL Draft order: Raiders land No. 1 pick as Giants, Browns hurt draft position by winning in Week 18\n                \n                    Josh Edwards                \n            \n                            \n    \n                \n                    \n    \nWild Card WeekendSaturday, Jan. 10(5) Rams at (4) Panthers, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Packers at (2) Bears, 8 p.m. ET (Amazon Prime)Sunday, Jan. 11(6) Bills at (3) Jaguars, 1 p.m. ET (CBS) (Stream on Paramount+)(6) 49ers at (3) Eagles, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Chargers at (2) Patriots, 8 p.m. ET (NBC)Monday, Jan. 12(5) Texans at (4) Steelers, 8 p.m. ET (ESPN/ABC) (Stream: Fubo -- try for free)Divisional RoundSaturday, Jan. 17AFC or NFC divisional matchup, 4:30 p.m. ET AFC or NFC divisional matchup, 8 p.m. ETSunday, Jan. 18AFC or NFC divisional matchup, 3 p.m. ETAFC or NFC divisional matchup, 6:30 p.m. ETNote: The winner of the Monday night game in the wild card round will play on Sunday in the divisional round. The Broncos and Seahawks will both host a game in the divisional round after getting a bye in the wild card round. Championship SundaySunday, Jan. 25\nAFC Championship, 3 p.m. ET (CBS)NFC Championship, 6:30 p.m. ET (Fox)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, TV for every round from wild card to Super Bowl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg"
      ],
      "datePublished": "2026-01-05T04:39:36.000Z",
      "dateModified": "2026-01-05T04:39:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No NFL team had ever gone an entire season without an interception. Until now - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/no-nfl-team-had-ever-gone-an-entire-season-without-an-interception-enter-the-2025-new-york-jets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/900f8e3a-e561-478b-b857-08a26206e36c/thumbnail/1200x675/0b150817f0bc446c44032dc9f59862a6/aaron-glenn.jpg",
    "tag": "Sports",
    "date": "2026-01-05T01:36:42.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        For nearly the last 100 years, going back to when ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        For nearly the last 100 years, going back to when the league began recording interceptions in 1933, every NFL team had recorded at least one pick during every NFL season.Until now.The New York Jets find themselves on the wrong side of history to end the 2025 season, failing to record a single interception over their last 17 games.The Jets had one final chance to keep themselves from the history books on Sunday during their Week 18 divisional game against the Buffalo Bills, and despite New York facing backup quarterback Mitchell Trubisky instead of reigning MVP Josh Allen, the Jets couldn't find a way to record the pick.\nThe Dallas Cowboys, San Francisco 49ers and Tennessee Titans were tied for the second-fewest number of interceptions this season with six each, a significant jump from what the Jets posted. New York's entire team struggled overall under first-year head coach Aaron Glenn and the defense was no exception. They finished among the worst in the league in sacks, passing touchdowns allowed and rushing touchdowns and yards allowed.\nSunday's 35-8 loss gave the 3-14 Jets the No. 2 overall pick, putting them behind the 3-14 Las Vegas Raiders, who will have the first overall selection in the 2026 NFL Draft in April. This also marks the Jets' 15th straight season failing to make the playoffs, the longest active postseason drought in the league.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No NFL team had ever gone an entire season without an interception. Until now - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/900f8e3a-e561-478b-b857-08a26206e36c/thumbnail/1200x675/0b150817f0bc446c44032dc9f59862a6/aaron-glenn.jpg"
      ],
      "datePublished": "2026-01-05T01:36:42.000Z",
      "dateModified": "2026-01-05T01:36:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff picture: Panthers win NFC South with help from Falcons; Ravens-Steelers for AFC North - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-playoff-picture-standings-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/fd32ef96-35da-41d3-80e5-74b36f98c778/thumbnail/1200x675/2be42ee5f6e4ee9ab6501b6b15bfa86e/rodgers-jpeg.jpg",
    "tag": "Sports",
    "date": "2026-01-05T05:05:22.000Z",
    "description": "\n        It all comes down to this. We've reached the final weekend of the 2025 regular season, and Week 18 is poised to bring plenty of chaos as we c",
    "body": "\n        It all comes down to this. We've reached the final weekend of the 2025 regular season, and Week 18 is poised to bring plenty of chaos as we cross the finish line. Entering the weekend, four division titles were still up for grabs, along with the No. 1 seeds in the AFC and NFC. In the NFC, the No. 1 seed was decided Saturday night when the Seattle Seahawks defeated the San Francisco 49ers in San Francisco. With the win, Seattle clinched the NFC West and a first-round bye as the conference's top seed. On Sunday, the Panthers (8-9) backed into an NFC South title thanks to the Falcons beating the Saints.In the AFC, the Broncos wrapped up the AFC's top seed and the first-round bye that comes with it. The red-hot Jaguars clinched the AFC South and the third seed.Beyond the top seeds, the AFC North title came down to a thrilling game between the Ravens and Steelers on Sunday night, as Pittsburgh escaped with a 26-24 victory.\nAs we close the book on the 2025 regular season and put the postseason into focus, let's take a look at the official playoff picture. \n        \n            \n                NFL playoff picture after Week 18: Who clinched, final standings and every wild card matchup\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nAFC standingsz-Denver Broncos (14-3)z-New England Patriots (14-3)z-Jacksonville Jaguars (13-4)z-Pittsburgh Steelers (10-7)x-Houston Texans (12-5)x-Buffalo Bills (12-5)x-Los Angeles Chargers (11-6)x-clinched playoff berth; z-clinched division\n                            \n    \n                                                \n                    \n    1. Denver Broncos (14-3)Denver took care of business in Week 18 against the Chargers to clinch the No. 1 seed in the AFC.\n                            \n    \n                                                \n                    \n    2. New England Patriots (14-3)The Patriots crushed the Dolphins in Week 18 to clinch the No. 2 seed. They will face the No. 7 Chargers in the wild card round.\n\n                            \n    \n                                                \n                    \n    3. Jacksonville Jaguars (13-4)The Jaguars wrapped up the AFC South with a convincing win over the Titans. They will face the Bills in Jacksonville in the wild card round.  \n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (10-7)The Steelers punched the last ticket to the playoffs with a victory over the Ravens, winning the AFC North title thanks to a missed Tyler Loop field goal. \n                            \n    \n                                                \n                    \n    5. Houston Texans (12-5)After starting the year 0-3, the Texans closed out the regular season winning their final nine games, including a Week 18 victory over the Colts. They clinched the No. 5 seed and will face the Steelers in the wild card round.\n\n                            \n    \n                                                \n                    \n    6. Buffalo Bills (12-5)The Bills rested their starters but still had little trouble blowing out the Jets to wrap up the sixth seed. They face the Jaguars in the opening round.\n                            \n    \n                                                \n                    \n    7. Los Angeles Chargers (11-6)The Chargers closed out the regular season with back-to-back losses. They dropped to the seventh seed with their loss to the Broncos and will travel to New England next week. NFC standingsz-Seattle Seahawks (14-3)z-Chicago Bears (11-6)z-Philadelphia Eagles (11-6)z-Carolina Panthers (8-9)x-Los Angeles Rams (12-5)x-San Francisco 49ers (12-5)x-Green Bay Packers (9-7-1)x-clinched playoff berth; z-clinched division  \n                            \n    \n                                                \n                    \n    1. Seattle Seahawks (14-3)With Mike Macdonald, Sam Darnold and a ferocious defense leading the way, the NFC playoffs will go through Seattle. The Seahawks earned that right by suffocating the 49ers on Saturday night to not only win the NFC West, but also claim the conference's No. 1 seed and the first-round bye that comes with it.\n\n                            \n    \n                                                \n                    \n    2. Chicago Bears (11-6)The Bears lost their season finale against the Lions but still landed the No. 2 seed when the Eagles lost to the Commanders. They will face NFC North foe Green Bay for a third time this year in the wild card round. \n                            \n    \n                                                \n                    \n    3. Philadelphia Eagles (11-6)Philadelphia rested its starters in a Week 18 loss to the Commanders. The defending Super Bowl champions will open up their title defense next week against the 49ers.\n                            \n    \n                                                \n                    \n    4. Carolina Panthers (8-9)Despite falling to the Buccaneers in the season finale, the Panthers backed into the playoffs when the Falcons beat the Saints. They will now host a wild card game against the Rams.\n\n                            \n    \n                                                \n                    \n    5. Los Angeles Rams (12-5)The Rams blew out the Cardinals in Week 18 and landed the No. 5 seed. They get to face the 8-9 Panthers in Carolina.\n                            \n    \n                                                \n                    \n    6. San Francisco 49ers (12-5)Entering Week 17, the 49ers had a chance to play five straight home games to end the season, with the Super Bowl set to be played at Levi's Stadium. That will no longer be the case after Saturday night's deflating 13-3 loss to the Seahawks.Instead of winning the NFC West and earning a first-round bye as the conference's top seed, the 49ers will be playing in Philadelphia against the Eagles.\n\n                            \n    \n                                                \n                    \n    7. Green Bay Packers (9-7-1)Green Bay, locked into the No. 7 seed, rested its starters in a Week 18 loss to the Vikings. The Packers will visit either the Bears in the wild card round.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff picture: Panthers win NFC South with help from Falcons; Ravens-Steelers for AFC North - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/fd32ef96-35da-41d3-80e5-74b36f98c778/thumbnail/1200x675/2be42ee5f6e4ee9ab6501b6b15bfa86e/rodgers-jpeg.jpg"
      ],
      "datePublished": "2026-01-05T05:05:22.000Z",
      "dateModified": "2026-01-05T05:05:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals coach Zac Taylor upset over game delay after Myles Garrett's sack record - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/zac-taylor-upset-for-officials-pausing-bengals-browns-game-following-myles-garretts-sack-record/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/0f61f784-6338-4b81-8f3e-25a2216ecf68/thumbnail/1200x675/b43fc50fa56430e38435bc24333aa1b4/garrettrecord.png",
    "tag": "Sports",
    "date": "2026-01-04T22:29:05.000Z",
    "description": "\n        Not everyone was in a celebratory mood after Myles Garrett broke the NFL's single-season sack record. Specifically, Bengals coach Zac Taylor ",
    "body": "\n        Not everyone was in a celebratory mood after Myles Garrett broke the NFL's single-season sack record. Specifically, Bengals coach Zac Taylor did not appreciate the official's decision to briefly pause the game after Garrett made history with just over five minutes remaining and the Bengals trying to score the go-ahead touchdown. Taylor was visibly upset after the game was temporarily paused after Garrett took down Joe Burrow to record his record 23rd sack of the season. Cincinnati, down 17-12 at the time, ended up punting after not gaining a yard on the next two plays. Taylor made it clear afterward that he didn't appreciate how the situation was handled. \"There's five minutes left in our season,\" Taylor said. \"We're playing for our lives here. I was never told that we're going to stop the game. In a critical moment like that, the refs just said that they made a decision that they were going to stop the game. They said they tried to do it as quickly as possible. I didn't feel that.\"\nWhile Garrett's record was being acknowledged, the Bengals tried to quickly run another play but to no avail. \"We didn't sub,\" Taylor said. \"We're trying to be on the ball and go and play with tempo. The umpire just held the ball so that we couldn't do anything. And I'm yelling at Joe, 'Get on the ball.' ... And so again, trying to get an answer was not easy. They just said that they made a decision as a crew to stop the game when that happened. I guess it didn't matter when it happened.\"\nTaylor reiterated that he was not informed prior to kickoff that the officials would temporarilly pause the game if Garrett got the record. \n\"They didn't say one word,\" Taylor said. \"We meet with [the officials] in the 90-minute meeting before the game. They didn't they never said one word about that.\"While Cincinnati (6-11) had already been eliminated from the postseason, Taylor's frustration is a reflection of his and his team's desire to win every game regardless of the situation. The Bengals, like the Browns, were trying to end their season with a win over a division rival while having one final positive moment to carry into the offseason. The Bengals were able to take the lead on their final offensive possession of the season on a Burrow touchdown pass to Ja'Marr Chase. The Browns, however, pulled off the win after Andre Szmyt drilled a 49-yard field goal as time expired. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals coach Zac Taylor upset over game delay after Myles Garrett's sack record - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/0f61f784-6338-4b81-8f3e-25a2216ecf68/thumbnail/1200x675/b43fc50fa56430e38435bc24333aa1b4/garrettrecord.png"
      ],
      "datePublished": "2026-01-04T22:29:05.000Z",
      "dateModified": "2026-01-04T22:29:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenny Minchey commits to Nebraska: Former Notre Dame QB replaces Dylan Raiola - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/kenny-minchey-commits-to-nebraska-former-notre-dame-qb-replaces-dylan-raiola/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/18e63eac-7b0b-4765-b375-f98a16f8a49e/thumbnail/1200x675/8d52fb1ba073580379753052cd26916c/gettyimages-2249247138-2.jpg",
    "tag": "Sports",
    "date": "2026-01-04T22:09:09.000Z",
    "description": "\n        The Nebraska Cornhuskers have found their replacement for Dylan Raiola in the NCAA transfer portal. Former Notre Dame quarterback Kenny Minch",
    "body": "\n        The Nebraska Cornhuskers have found their replacement for Dylan Raiola in the NCAA transfer portal. Former Notre Dame quarterback Kenny Minchey has committed to Nebraska, sources told CBS Sports' Matt Zenitz.A four-star recruit and the No. 12 quarterback in the 2023 signing class, Minchey pushed C.J. Carr for the starting job at Notre Dame ahead of the 2024 season. The redshirt sophomore ultimately lost the battle, and Carr never looked back as he led the Fighting Irish to a 10-2 record.Although Minchey came up short against Carr, he made the competition much closer than most expected. After Carr was announced as the starter, one source told CBS Sports that it could have gone either way.\"I think it was 50-50 where guys think it could have gone either way where some guys expected one guy and some the other,\" the source said.\nSources also told CBS Sports that Minchey started to win over the coaching staff with his consistency, which ran counter to Carr, who flashed the ability to make big plays but was careless with the football at times.That Minchey was able to outshine Carr in some areas probably gives Nebraska hope that it just landed a budding star in the transfer portal. Minchey wasn't able to put much on film at Notre Dame as he really only saw action in a mop-up role. This past season, Minchey completed 20 of his 26 passes for 196 yards, no touchdowns and no interceptions.Minchey was able to find the end zone on the ground as he finished the year with 84 rushing yards and one score.\nWhen he arrives in Lincoln, Minchey will be tasked with getting Nebraska over the hump. The Huskers have now turned in back-to-back 7-6 seasons under coach Matt Rhule, and the program wants to take another step toward competing for a Big Ten title.Minchey will be replacing Raiola, a former five-star recruit who failed to truly deliver on that pedigree in Lincoln. Raiola entered the transfer portal after two seasons with the Huskers.Speculation about Raiola's eventual exit really picked up when his brother Dayton decommitted from Nebraska in November. Rhule also fired Donovan Raiola, Dylan's uncle and the offensive line coach, after the season ended.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenny Minchey commits to Nebraska: Former Notre Dame QB replaces Dylan Raiola - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/18e63eac-7b0b-4765-b375-f98a16f8a49e/thumbnail/1200x675/8d52fb1ba073580379753052cd26916c/gettyimages-2249247138-2.jpg"
      ],
      "datePublished": "2026-01-04T22:09:09.000Z",
      "dateModified": "2026-01-04T22:09:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers RB Emanuel Wilson registers worst NFL carry in 31 years - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-rb-emanuel-wilson-nfl-carry/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/8e44da26-2db6-4481-aae9-4441e5e6cbb7/thumbnail/1200x675/4d1ebe8df65bb61c1cf8d91345524952/em.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:44:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers sat a large number of starte",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers sat a large number of starters in their Week 18 matchup against the Minnesota Vikings, as they are locked into the No. 7 seed in the NFC. Games like this provide opportunities for players that usually do not get many snaps to stand out, but late in the second quarter, Packers running back Emanuel Wilson stood out in the wrong way.On a rushing attempt, the Vikings defense stood up Wilson behind the line of scrimmage. He then decided to run backwards before being taken down for a loss of 18 yards. \nThe last running back to lose 18 or more yards on a carry without a fumble was Jon Vaughn of the Seattle Seahawks on Sept. 18, 1994, when he lost 20 yards on a rushing attempt, according to CBS Sports Research. Wilson's carry was the worst NFL carry in 31 years.\nOverall, Wilson has been solid this year when playing in the place of Josh Jacobs. He entered Sunday with 452 yards rushing and three touchdowns on a career-high 107 carries. That includes a 107-yard, two-touchdown performance against the Vikings in Week 12. However, his loss of 18 yards is a play he'd like to forget soon. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers RB Emanuel Wilson registers worst NFL carry in 31 years - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/8e44da26-2db6-4481-aae9-4441e5e6cbb7/thumbnail/1200x675/4d1ebe8df65bb61c1cf8d91345524952/em.jpg"
      ],
      "datePublished": "2026-01-04T20:44:14.000Z",
      "dateModified": "2026-01-04T20:44:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Tomlin ties Steelers Hall of Fame coach Chuck Noll on all-time career wins list - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-tomlin-ties-steelers-hall-of-fame-coach-chuck-noll-on-all-time-career-wins-list/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/881277b0-2422-4678-8cac-c06778fcb997/thumbnail/1200x675/2e594a514d6a1ece45a22d19d870583a/tomlinrodgers.png",
    "tag": "Sports",
    "date": "2026-01-05T05:23:58.000Z",
    "description": "\n        Mike Tomlin now stands alongside a fellow Pittsburgh Steelers coach in the NFL record book. By virtue of the Pittsburgh Steelers' thrilling W",
    "body": "\n        Mike Tomlin now stands alongside a fellow Pittsburgh Steelers coach in the NFL record book. By virtue of the Pittsburgh Steelers' thrilling Week 18 win over the Baltimore Ravens, Tomlin is now tied with Hall of Fame coach Chuck Noll on the all-time regular season wins list. Tomlin and Noll are tied for ninth all-time with 193 regular-season wins. Tomlin's 193 win was also special in that it came in a game that saw the Steelers capture the AFC North division title and a spot in the AFC playoffs. \"I'm appreciative of some of those things,\" Tomlin recently said when asked about some of his recent career milestones. \"It's been a blessing, but really of no relevance as I stand here today leaning in on this Cleveland Browns opportunity this week. There are just so many people in this collective that it doesn't apply to, and with football being what it is, the ultimate team game, I better display that focus.\" Two weeks ago, Tomlin increased his NFL record of most consecutive non-losing seasons to begin a career, which is now at 19. He's one season off Tom Landry's record for the most consecutive non-losing seasons in NFL history.  NFL all-time regular-season wins CoachWinsT1.Don Shula**3282. George Halas**3183.Bill Belichick 3024.Andy Reid2795.Tom Landry**2506.Curly Lambeau**2267. Paul Brown**2138. Marty Schottenheimer200T9. Mike Tomiln193T9. Chuck Noll**19311. Dan Reeves190** -- Members of the Pro Football Hall of Fame \nAs far as coaching icons are concerned, it doesn't get much bigger than Noll, who in just five years time turned the Steelers from a 1-13 outfit into Super Bowl champions. During the 1970s, Noll's Steelers became the first team to win four Super Bowls. Pittsburgh remains the only team to win back-to-back Super Bowls twice and four Super Bowls over a six-year span. Noll was first and foremost a teacher who preached fundamentals to his teams. A former offensive lineman, Noll's expertise in that area helped birth one of Pittsburgh's go from a power running team to a big-play passing attack in the middle of their dynasty after the league had made rules to help open up the passing game. It took a while, but Noll ultimately developed a successful partnership with Terry Bradshaw, the last Steelers' player to win league MVP. Their working relationship undoubtedly played a big role in Bradshaw not only becoming a Hall of Fame player, but a successful play-caller in Pittsburgh's huddle. \nNow in his 19th season, Tomlin has continued Pittsburgh's legacy of success that was started by Noll over 50 years ago. He will look to help lead the Steelers to their first playoff win since 2016 when Pittsburgh hosts the Texans next Monday night in the AFC wild-card round. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Tomlin ties Steelers Hall of Fame coach Chuck Noll on all-time career wins list - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/881277b0-2422-4678-8cac-c06778fcb997/thumbnail/1200x675/2e594a514d6a1ece45a22d19d870583a/tomlinrodgers.png"
      ],
      "datePublished": "2026-01-05T05:23:58.000Z",
      "dateModified": "2026-01-05T05:23:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts WR Alec Pierce's breakout game ends in ejection after touching official - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-alec-pierce-ejected-contact-with-official/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/2d7d9350-1d61-473c-8bee-412d5807162d/thumbnail/1200x675/21c7da526574e60e810b6597f9747550/alec-pierce-colts.jpg",
    "tag": "Sports",
    "date": "2026-01-04T21:08:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Alec Pierce's career day to cap a career season ca",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Alec Pierce's career day to cap a career season came to a disappointing end: The Indianapolis Colts wide receiver was ejected for making contact with an official late in Indianapolis' Week 18 game at the Houston Texans. Though the contact seemed minimal -- really just Pierce's left arm nudging the official as he went to argue his case for a flag -- it was indeed contact, and CBS Sports rules analyst Gene Steratore said he agreed with the decision.\nPierce caught four passes for 132 yards and two touchdowns; the 132 yards were 2 short of matching his career high, and the two touchdowns tied a career high. It was his first career game with 100 receiving yards and two touchdowns.\nWith the performance, Pierce crossed the 1,000-yard mark for the first time in his career. He finishes the season with 47 receptions for 1,003 yards and six touchdowns, the first two marks representing career highs. He also led the NFL in yards per reception for the second straight season.\nWhether the ejection is the final act of Pierce's Colts career remains to be determined. His rookie deal expires at the end of this season, and he's set to be a free agent with several potential suitors. Still just 25, Pierce could command significant interest as a big-play threat who showed great improvement in 2025.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts WR Alec Pierce's breakout game ends in ejection after touching official - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/2d7d9350-1d61-473c-8bee-412d5807162d/thumbnail/1200x675/21c7da526574e60e810b6597f9747550/alec-pierce-colts.jpg"
      ],
      "datePublished": "2026-01-04T21:08:26.000Z",
      "dateModified": "2026-01-04T21:08:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ole Miss offensive coordinator Charlie Weis Jr. being eyed by NFL teams as OC candidate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-teams-eyeing-ole-miss-charlie-weis-jr-as-potential-offensive-coordinator-candidate/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/aa384a1f-9b41-474c-90b3-bcd10a4a50b9/thumbnail/1200x675/a22e33344031796380a6e6f7664b1222/gettyimages-2182597689-2.jpg",
    "tag": "Sports",
    "date": "2026-01-04T22:47:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Charlie Weis Jr. is considered an up-and-coming st",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Charlie Weis Jr. is considered an up-and-coming star in college coaching ranks, but he may not stay at that level for long. Sources told CBS Sports' Matt Zenitz that NFL teams have identified Weis as a possible offensive coordinator candidate heading into the offseason job cycle.Weis has spent the last four seasons as the quarterbacks coach and offensive coordinator at Ole Miss, and he's only raised his stock in the eyes of decision-makers. Weis helped develop New York Giants first-round pick Jaxson Dart, and he turned Trinidad Chambliss into a household name while overseeing the Rebels' top-ranked offense in 2025.Although Weis is expected to join Lane Kiffin's staff at LSU, he's stayed behind in Oxford to run the Ole Miss offense in the College Football Playoff. Through the first two rounds, which includes a thrilling quarterfinal win over Georgia, the Rebels are averaging 40 points per game.\nAs our own Brandon Marcello reported, many LSU-bound assistant coaches are expected to leave Ole Miss ahead of its Fiesta Bowl semifinal matchup against Miami on Thursday night in Glendale, Arizona. However, Weis will remain with the Rebels as they pursue a national championship.Weis, 32, has spent most of his coaching career at the collegiate level. The one exception came in 2017, when he was an offensive assistant for the Atlanta Falcons under offensive coordinator Steve Sarkisian.\nFrom 2018-19, Weis worked under Kiffin as an offensive coordinator at FAU. He also spent two seasons as a coordinator at USF before rejoining Kiffin at Ole Miss in 2022.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ole Miss offensive coordinator Charlie Weis Jr. being eyed by NFL teams as OC candidate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/aa384a1f-9b41-474c-90b3-bcd10a4a50b9/thumbnail/1200x675/a22e33344031796380a6e6f7664b1222/gettyimages-2182597689-2.jpg"
      ],
      "datePublished": "2026-01-04T22:47:28.000Z",
      "dateModified": "2026-01-04T22:47:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TCU quarterback Josh Hoover expected to transfer to Indiana - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tcu-quarterback-josh-hoover-expected-to-transfer-to-indiana/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/30bab8cd-d31f-402a-a0fe-d7519335f959/thumbnail/1200x675/634fb9f71fd77e33226e461a40bdb3c4/josh-hoover.jpg",
    "tag": "Sports",
    "date": "2026-01-04T23:03:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indiana Hoosiers have landed a quarterback tha",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indiana Hoosiers have landed a quarterback that could replace Fernando Mendoza should the reigning Heisman Trophy winner enter the 2026 NFL Draft, as CBS Sports' Matt Zenitz reports that former TCU signal-caller Josh Hoover is expected to commit to Indiana.Hoover is coming off a season in which he completed 65.9% of his passes for 3,472 yards, 29 touchdowns and 13 interceptions. He went 8-4 as the starter as TCU's offense took a step back after losing its top three receivers from the year prior to the NFL in Jack Bech, Savion Williams and JP Richardson.As a sophomore in 2024, Hoover broke TCU's single-season record by throwing for 3,949 yards to go along with 27 touchdowns and 11 interceptions. He led the Big 12 with 60 completions of 20-plus yards, and was one of two returning quarterbacks that averaged 300 passing yards in 2024, the other being LSU's Garrett Nussmeier.The Hoosiers, of course, are the premier program in college football right now. Curt Cignetti is 25-2 as lead man, including a perfect 14-0 campaign this year that included a Big Ten Championship victory over the Ohio State Buckeyes, and a No. 1 seeding for the College Football Playoff. The Hoosiers handed the Alabama Crimson Tide a 38-3 loss in the Rose Bowl last week, and face the Oregon Ducks in the Peach Bowl in Atlanta this Friday. \nIndiana is actually the first-ever top four seed and lone conference champion to reach the semifinals of the expanded College Football Playoff, and have already registered the most wins in a season in school history. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TCU quarterback Josh Hoover expected to transfer to Indiana - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/30bab8cd-d31f-402a-a0fe-d7519335f959/thumbnail/1200x675/634fb9f71fd77e33226e461a40bdb3c4/josh-hoover.jpg"
      ],
      "datePublished": "2026-01-04T23:03:40.000Z",
      "dateModified": "2026-01-04T23:03:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]