[
  {
    "title": "Indiana vs. Miami prediction, odds, spread, line: 2026 CFP national championship game picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-miami-prediction-odds-time-2026-college-football-playoff-national-championship-game-picks-computer-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/f6032852-3c08-4bc4-bc08-709385944a36/thumbnail/1200x675/1e079faabea5d8abe80edbb0db2334a0/fernando-mendoza-indiana-hoosiers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-19T23:38:19.000Z",
    "description": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes i",
    "body": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes in the 2026 College Football Playoff National Championship game on Monday. Miami (13-2) upset Texas A&M and Ohio State in the first two rounds and then won and covered (-3.5) against Ole Miss in the semifinals. Indiana (15-0) has breezed through its CFP schedule after enjoying a first-round bye, beating Alabama 38-3 in the quarterfinals and dominating Oregon 56-22 in the semifinals. Miami starting safety Xavier Lucas is suspended for the first half after being called for targeting in the semifinals. Starting tight end Elija Lofton is out for Miami, while reserve safety Damari Brown is considered a game-time decision. Kickoff is at 7:30 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., which is the Hurricanes' home venue, with kickoff temperature in the low 60s. The Hoosiers are 7.5-point favorites in the latest Miami vs. Indiana odds. The over/under for total points scored is 46.5 via DraftKings Sportsbook. Before locking in any any Indiana vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. \nNow, the model has set its sights on Miami vs. Indiana. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Indiana vs. Miami:Miami vs. Indiana                                                                                                                                                                                         spreadIndiana -7.5 (-115) at DraftKings SportsbookMiami vs. Indiana                                                                                                                                                                                     over/under46.5 pointsMiami vs. Indiana                                                                                                                                                                                                                                                                                                     money line Indiana -310, Miami +250Miami vs. Indiana                                                                                                                                                                                                                                                                                             picksSee picks at SportsLineMiami vs. Indiana                                                                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Indiana can coverJunior quarterback and Heisman Trophy winner Fernando Mendoza helps power the Hoosiers' offense. In 15 games, he has completed 73% of his passes for 3,349 yards and 41 touchdowns with just six interceptions. He also has rushed 83 times for 284 yards and six scores. In the national semifinal win over the Oregon Ducks, he completed 17 of 20 passes for 177 yards and five touchdowns. Mendoza's elite accuracy makes Indiana's offense extremely tough to stop, but the Hoosiers are also incredibly strong on defense. Indiana finished the regular season ranked fourth nationally in total defense. Indiana has been just has stingy in the postseason, holding Ohio State, Alabama and Oregon to an average of just 11.6 points per game.  See which team to back at SportsLine.\nWhy Miami can cover Senior quarterback Carson Beck helps guide the Hurricanes. In 15 games, he has completed 73.3% of his passes for 3,581 yards and 29 touchdowns with 11 interceptions. He has also rushed for a pair of touchdowns. In the national semifinal win over Ole Miss, he completed 23 of 37 passes for 268 yards and two touchdowns with one interception. The Miami ground attack is led by junior running back Mark Fletcher Jr. In 13 games this season, he has carried 199 times for 1,080 yards (5.4 average) and 10 touchdowns. Miami's defensive front could be an x-factor in this matchup. Defensive end Rueben Bain Jr. has been borderline unblockable at times as the likely top-10 pick in the 2026 NFL Draft has piled up four sacks in the CFP. See which team to back at SportsLine.How to make Indiana vs. Miami picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.So who wins Indiana vs. Miami, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Miami vs. Indiana spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana vs. Miami prediction, odds, spread, line: 2026 CFP national championship game picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/f6032852-3c08-4bc4-bc08-709385944a36/thumbnail/1200x675/1e079faabea5d8abe80edbb0db2334a0/fernando-mendoza-indiana-hoosiers-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-19T23:38:19.000Z",
      "dateModified": "2026-01-19T23:38:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Miami-Indiana, Suns-Nets, Warriors-Heat - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-300-bonus-bets-targeting-miami-indiana-suns-nets-warriors-heat/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-01-19T23:48:21.000Z",
    "description": "\n        The College Football Playoff National Championship Game and a full NBA schedule on MLK Day provide ample opportunities to take advantage of t",
    "body": "\n        The College Football Playoff National Championship Game and a full NBA schedule on MLK Day provide ample opportunities to take advantage of the newest DraftKings promo code offering $300 in bonus bets. Kickoff for Indiana vs. Miami is scheduled for 7:30 p.m. ET, and the Hurricanes covering an 8.5-point spread (-115) is among the top picks from SportsLine's team of experts tonight. Indiana is a -310 money line favorite (risk $310 to win $100), while Miami is a +250 underdog. Meanwhile, the SportsLine Projection Model is backing Over 217.5 points in Nets vs. Suns (7:30 p.m. ET) and is all over Golden State -5.5 against the Heat (10 p.m. ET). Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season.  Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Monday best bets at DraftKings SportsbookMiami +8.5 vs. Indiana (-115)Over 216.5 points in Nets vs. Suns (-118)Warriors -5.5 vs. Heat (-108)Combining the three picks into a Monday parlay at DraftKings would result in a payout of +564 (risk $100 to win $564). Bet it at DraftKings here: (Odds subject to change)\nMiami +8.5 vs. Hoosiers (-115)\"The temptation to simply side with rampant Indiana at whatever the price is understandable, given the dominating form over Alabama and Oregon in the playoffs, seen off a combined 94-25. Yet we recall struggles vs. Iowa, Penn State, and Ohio State in the Big Ten final; the Buckeyes are the only common foe with the Canes, and Miami arguably was more impressive in its 24-14 Cotton Bowl win over OSU,\" SportsLine college football expert Bruce Marshall said. \"Indiana has been a bully most of this season, and the script could flip on the Hoosiers if Miami holds its nerve, establishes the punishing ground game that has helped it get to the final, and QB Carson Beck meets the moment.\" Back the Texans at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Over 216.5 points in Nets vs. SunsOnly a few years after joining up as trade partners in a blockbuster Kevin Durant deal, both of these rosters look completely different. The injury report will require close monitoring, with Jalen Green (hamstring) and Devin Booker (ankle) listed as questionable for the Suns. However, Michael Porter Jr. should be back after a night of rest on Sunday against the Bulls. The model predicts that the two teams combine for 230 points on average and that the Over hits 66% of the time. Back the Over at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Warriors -5.5 vs. Heat (-108)Golden State has won and covered the spread in five of its last six outings and Miami will be without Tyler Herro (rib) on Monday. Both teams are eighth in their respective conferences, but the Warriors are 24-19 on the season while the Heat are 22-20. The model predicts that Golden State covers the spread in 68% of simulations. Back the Warriors at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:\nWant more NBA picks for Monday?You've seen some of the model's Monday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Miami-Indiana, Suns-Nets, Warriors-Heat - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-01-19T23:48:21.000Z",
      "dateModified": "2026-01-19T23:48:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NBA All-Star Game rosters: 10 starters announced for new-look ASG - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/2026-nba-all-star-game-rosters-starters-announcement/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/d72d564e-9123-4f1c-83df-e9ab027016a2/thumbnail/1200x675/03e9cb5910aebfbff2ed45827fbafc2f/untitled-design-164.png",
    "tag": "Sports",
    "date": "2026-01-19T19:59:20.000Z",
    "description": "\n        Ten starter for the 2026 NBA All-Star Game, which will take place on Feb. 15 at the Intuit Dome in Los Angeles, were announced on Monday. Thi",
    "body": "\n        Ten starter for the 2026 NBA All-Star Game, which will take place on Feb. 15 at the Intuit Dome in Los Angeles, were announced on Monday. This year's All-Star Game starters were headlined by multiple familiar faces, including Lakers guard Luka Dončić and Bucks forward Giannis Antetokounmpo.Dončić will be making his first appearance in the All-Star game as a member of the Lakers after being traded from the Dallas Mavericks last year. The Lakers star received the most fan votes and will be appearing in sixth All-Star game. The rest of the West starters are listed below. A fan vote broke the tie between Victor Wembanyama and Timberwolves star Anthony Edwards for the final spot.NBA All-Star Game starters -- Western Conference Luka Dončić, Lakers (sixth selection)Stephen Curry, Warriors (12th)Shai Gilgeous-Alexander, Thunder (fourth)Nikola Jokić, Nuggets (eighth)Victor Wembanyama, Spurs (second)Antetokounmpo led the East in fan voting and will be playing in his 10th All-Star game. Here are the rest of the East selections:NBA All-Star Game starters -- Eastern Conference Tyrese Maxey, 76ers (second selection)Jalen Brunson, Knicks (third)Cade Cunningham, Pistons (second)Jaylen Brown, Celtics (fifth)Giannis Antetokounmpo, Bucks (10th)And here are the results of the fan, player and media voting to determine starters in both conferences:\nThe format of this year's All-Star game will look drastically different. That's because the league is implementing a new format with two U.S. teams and one international team competing in a round-robin tournament of 12-minute games.\nThe 2026 NBA All-Star Game has a new USA vs. The World format, but the ASG selection process remains the same. That means there will be 12 initial All-Stars picked per conference, including the 10 players revealed Monday. Each conference will also get seven reserves. The All-Star reserves are set to be named next week, per NBC Sports.If there are not at least 16 American players or eight international players through the initial All-Star roster-building process, commissioner Adam Silver would then add additional All-Stars to fill out the rosters. The All-Star Game, taking place on Sunday, Feb. 15, will feature two American teams and one World team, all of which will have at least eight players.With the new format, we know who should be representing the starters for \"The World\" team: Dončić, Gilgeous-Alexander, Jokić, Wembanyama and Antetokounmpo. The USA starters will be determined later.\nAnother new wrinkle for the voting this year is that players are no longer being selected via backcourt and frontcourt designations.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NBA All-Star Game rosters: 10 starters announced for new-look ASG - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/d72d564e-9123-4f1c-83df-e9ab027016a2/thumbnail/1200x675/03e9cb5910aebfbff2ed45827fbafc2f/untitled-design-164.png"
      ],
      "datePublished": "2026-01-19T19:59:20.000Z",
      "dateModified": "2026-01-19T19:59:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin Durant passes Dirk and eyes MJ on all-time scoring list: How he's getting it done in Year 18 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/kevin-durant-dirk-nowitzki-michael-jordan-all-time-scoring-list/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/4f6bb5bd-d81c-4399-97f3-32717edcfd66/thumbnail/1200x675/f28bf9a0eecc85c5481852a914033cef/kd-shoots-getty.png",
    "tag": "Sports",
    "date": "2026-01-19T18:29:32.000Z",
    "description": "\n        With 15.2 seconds remaining in the Houston Rockets' win over the New Orleans Pelicans on Sunday, the crowd inside the Toyota Center rose to i",
    "body": "\n        With 15.2 seconds remaining in the Houston Rockets' win over the New Orleans Pelicans on Sunday, the crowd inside the Toyota Center rose to its feet as Kevin Durant strode to the free-throw line. Durant received the ball from the ref, went through his normal routine and hit nothing but net on his first attempt. Free throws, even those that help seal a victory, don't usually deserve standing ovations, but with that make Durant passed Dirk Nowitzki to move into sixth place on the NBA's all-time scoring list. \nIronically, Durant had one of his worst game of the season against the Pelicans -- 18 points on 5-of-18 shooting -- but he did enough to move up another rung on the all-time scoring ladder. Durant now has 31,562 career points, and only needs 731 to pass Michael Jordan and move into the top five. PlayerCareer points1. LeBron James42,7272. Kareem Abdul-Jabbar38,3873. Karl Malone36,9284. Kobe Bryant33,6435. Michael Jordan32,2926. Kevin Durant31,562Sunday's poor shooting performance aside, Durant is putting together another incredible scoring season: 26.1 points per game on 51/39.3/88.7 shooting splits. At that pace, he'll need just 29 more games to pass Jordan. The Rockets have 42 games remaining in the season, and assuming Durant doesn't miss any significant time, he should move ahead of Jordan in mid- to late-March. Durant (again, assuming health) should have no trouble catching Bryant, who is 2,081 points ahead of him, at some point next season. It will be a number of years until the 37-year-old Durant has a chance to move into the top three, however. He needs 5,366 points to catch Malone, and may have to play into his 40s to do so. Whether he'll be willing or able to play that long remains to be seen. \"To be up there with Dirk, somebody I looked up to, I idolized, I competed against. We had some great battles. He always was supportive of my career and my game. So, you know to be up there with a legend like that, it's just insane. And be right under Michael Jordan, it's crazy man, Durant said. \"I want to continue to keep stacking, keep climbing up the charts, just see how I finish. It's been amazing so far.\"\nLet's take a closer look at how Durant is putting together yet another incredible season for the Rockets, who have won three of their last four to climb back into fifth place in the crowded Western Conference at 25-15. 'To be up there with a legend like that, it's just insane,' Durant said about passing Nowitzki. \n                                                                    Getty Images\n                                                            KD is still incredibly efficientDurant's historic efficiency has long been his calling card. At 24 years old he became the joint-youngest player (along with Mark Price) to join the 50/40/90 club -- 50% shooting overall, 40% from 3-point range and 90% on free throws -- and is one of three players (along with Larry Bird and Steve Nash) to have multiple 50/40/90 seasons. His 29.1 points per game in 2023 are also the third-most by a player in a 50/40/90 season. Once again, Durant is within striking distance of a 50/40/90 season and has been one of the league's most efficient scorers. His 26.1 points per game rank 13th in the league. Of the top 15 scorers, only Nikola Jokić (60.5%) and Shai Gilgeous-Alexander (54.7%) have a better field goal percentage than Durant, who has made 51% of his attempts. (Giannis Antetokounmpo has not played enough games to qualify for the official leaderboards, but he has also been more efficient than Durant.) Just look at his shot chart. The NBA's stat site breaks things down in 14 specific areas of the floor. Durant is only below the league average on right wing 3s. Kevin Durant's shot chart \n                                                                    NBA.com\n                                                            Tough shot-makingFew players make difficult shots look as easy as Durant, who, in his 18th season, is still among the league's best in this department. Durant is fourth in the league in mid-range attempts at 5.6 per game, and making 49.5% of them. Of the five players averaging at least five such attempts, only Gilgeous-Alexander (50.5%) has been more efficient. PlayerMid-range attemptsMid-range %Shai Gilgeous-Alexander550.5%Kevin Durant5.649.5%Brandon Ingram5.749%DeMar DeRozan6.547.8%Jaylen Brown5.944.8%Durant often acts as a safety valve for the Rockets' offense, which lacks a true point guard and spacing. As a result, he's tied for ninth in the league in late shot clock attempts (0-4 seconds remaining) per game at 1.9. Remarkably, he's shooting 50% on those attempts. No one else in the top-10 is shooting better than 44.3% (Jalen Brunson). \nFurthermore, the NBA has a new stat called expected field goal percentage, which uses a \"Shot Difficulty\" rating to measure the expected field goal percentage for the average NBA player on every shot. You can then compare a player's expected field goal percentage to their actual field goal percentage to get an idea of which players are best at making tough shots. To no surprise, Durant is right near the top. His expected field goal percentage is 43.9%, but he's shooting 51%. +7.1% differential ranks sixth in the league. PlayerxFG%FG%FG%+Nikola Jokić47.8%60.5%+12.7%Cam Spencer39.8%47.8%+8%Shai Gilgeous-Alexander47.3%54.7%+7.4%DeMar DeRozan43.6%50.8%+7.2%Steph Curry39.8%47%+7.2%Kevin Durant43.9%51%+7.1%However you want to slice it, Durant's shot-making has once again been incredible. \nAging with graceDurant was the No. 2 overall pick in the 2007 NBA Draft, and has spent nearly half of his life in the league. While most of his peers are out of the league or relegated to bit roles off the bench, Durant is likely going to make his 16th All-Star appearance, which would move him into fourth place on the all-time list, behind only LeBron James, Kareem Abdul-Jabbar and Kobe Bryant. Few players in NBA history have ever matched what Durant is doing at this stage of their career. No one has averaged more points in their 18th season. The only other players to average at least 26 points per game at 37 or older are James and Steph Curry. The only other players to average at least 18 shots per game and shoot 50% or better after turning 35 are James and Karl Malone. \n\"It means a great deal to be around the league for this long. I mean, it takes playing a thousand-plus games to be in this category, at least,\" Durant said Sunday. \"I'm grateful for all the people that have helped me play this many games -- coaches, friends, family that invested in my game. You know how it goes. Without them, without the village, I wouldn't be here. I don't do anything on my own. Never have, never will. It's great to kind of celebrate that with them.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin Durant passes Dirk and eyes MJ on all-time scoring list: How he's getting it done in Year 18 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/4f6bb5bd-d81c-4399-97f3-32717edcfd66/thumbnail/1200x675/f28bf9a0eecc85c5481852a914033cef/kd-shoots-getty.png"
      ],
      "datePublished": "2026-01-19T18:29:32.000Z",
      "dateModified": "2026-01-19T18:29:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guehi transfer: Defender joins Manchester City from Palace - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/marc-guehi-manchester-city-transfer-pep-guardiolas-rebuild/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/8d439b14-e3aa-4c91-9d09-50f0753f8451/thumbnail/1200x675/9d8c70da3fff45baafdb3034a7d8c2cd/untitled-design-2026-01-19t190742-754.png",
    "tag": "Sports",
    "date": "2026-01-19T18:12:07.000Z",
    "description": "\n        Marc Guehi officially completed his move from Crystal Palace to Manchester City on Monday, days after a long-awaited move away from the Londo",
    "body": "\n        Marc Guehi officially completed his move from Crystal Palace to Manchester City on Monday, days after a long-awaited move away from the London club was all but confirmed by Palace's (eventually) outgoing coach Oliver Glasner.City reportedly paid Palace $26.8 million for Guehi's services, according to The Athletic, bringing an end to a months-long saga over his departure. Guehi'd deal with Palace expired at the end of the season, prompting him to pursue a move to Liverpool last summer that eventually collapsed on deadline day when Palace could not secure a replacement. Guehi missed Palace's defeat at Sunderland on Saturday as his transfer to City was being finalized.Guehi immediately provides much-needed depth for City as their busy season continues, especially considering the injuries that Pep Guardiola's side currently have to contend with. Ruben Dias is out with a hamstring issue and John Stones is currently dealing with a thigh injury, each of them expected to return in the coming weeks, while Josko Gvardiol recently underwent surgery for an ankle issue that will keep him out until the spring.Though City are seven points adrift of first place Arsenal in the Premier League, Guardiola's group remain active in the three other competitions they entered at the start of the season -- they advanced to the fourth round of the FA Cup, are currently in the mix for a top eight finish in the UEFA Champions League with two league phase games to go and carry a 2-0 advantage into the second leg of the EFL Cup semifinals against Newcastle United.\nIt is unclear exactly when Guehi will make his debut for City, who have a jam-packed schedule over the next week and change. Guardiola's side return to play on Tuesday for a Champions League fixture at Bodo/Glimt and return home on Saturday for a match against Premier League bottom-dwellers Wolverhampton Wanderers.Manchester City's rebuilding phase continuesCity have now spent roughly $100 million in the January transfer window with Guehi's addition, the bulk of their funds spent on Antoine Semenyo from Bournemouth earlier this month. It marks the third straight transfer window in which the club has spent upwards of $100 million on signings, a signal that City are still in the process of restructuring their squad as a batch of veterans departed – and after Guardiola's first trophyless season since his first campaign with the club in 2016-17.The new players have almost entirely been recruited with the hopes of making an immediate impact, especially as City's title charge continues. The Premier League title may be be unlikely at this point but Guardiola's side are one game away from reaching the EFL Cup final, are still in the early stages of an FA Cup run and have excelled enough in the Champions League this season that a title run there cannot be ruled out just yet.\nAs Guardiola introduces one new signing after another, though, it is clear the club are also building with one eye towards the future. Part of their hardships this season have been down to an adjustment period for Guardiola's new vision for the team, the group coming up with enough strong performances over the first half of the campaign to demonstrate that they are on the right track. It is clear, though, that there is still room for improvement – City are still overly reliant on Erling Haaland in attack, for example, his ineffective performance proving costly in their 2-0 defeat to Manchester United on Saturday.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guehi transfer: Defender joins Manchester City from Palace - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/8d439b14-e3aa-4c91-9d09-50f0753f8451/thumbnail/1200x675/9d8c70da3fff45baafdb3034a7d8c2cd/untitled-design-2026-01-19t190742-754.png"
      ],
      "datePublished": "2026-01-19T18:12:07.000Z",
      "dateModified": "2026-01-19T18:12:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zach Charbonnet injury: Seahawks RB needs knee surgery, out for rest of season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/zach-charbonnet-injury-seahawks-rb-knee-surgery/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/4cc12d45-cf15-4a23-a761-9aec493753e4/thumbnail/1200x675/bf97fde95303fa4ba9b3719315810f78/charbonnet.png",
    "tag": "Sports",
    "date": "2026-01-19T18:57:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If the Seattle Seahawks are going to win Super Bow",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If the Seattle Seahawks are going to win Super Bowl LX, they will have to do so without the services of running back Zach Charbonnet, who will miss the rest of the season after suffering a \"significant\" knee injury, coach Mike Macdonald said Monday. The injury, reportedly a torn ACL, occurred during Seattle's 41-6 win over the San Francisco 49ers in the NFC divisional round on Saturday. Charbonnet had just 20 yards on five carries prior to getting injured and now will miss the NFC Championship against the Los Angeles Rams.\"He's got a significant knee injury unfortunately,\" Macdonald said. \"Breaks your heart. He's going to need surgery. He's going to have a long road back.\"A 2023 second-round pick, Charbonnet was a vital part of Seattle's offense this season. Charbonnet, who turned 25 earlier this month, set career highs with 730 yards and 12 touchdowns on the ground. He also caught 20 of 24 targets in 16 regular season games. \nCharbonnet was playing at an especially high level late in the season. He ran for 110 yards and two scores during Seattle's Week 17 win over the Carolina Panthers and then 74 yards and a score on 17 carries during the Week 18 win over the 49ers that clinched the No. 1 seed in the NFC.\nWith Charbonnet out, the Seahawks will have to lean even more on Kenneth Walker III, who ran for 119 yards and three touchdowns against the 49ers. Walker's 1,027 rushing yards during the regular season was his best since his rookie season (2022). He also caught 31 passes for 282 yards in 17 regular season games. \nSeattle has other possible options at running back in veterans Cam Akers and Velus Jones Jr., who are currently on the practice squad. Akers helped the Rams win Super Bowl LVI after returning from an injury that sidelined him for most of the 2021 regular season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zach Charbonnet injury: Seahawks RB needs knee surgery, out for rest of season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/4cc12d45-cf15-4a23-a761-9aec493753e4/thumbnail/1200x675/bf97fde95303fa4ba9b3719315810f78/charbonnet.png"
      ],
      "datePublished": "2026-01-19T18:57:04.000Z",
      "dateModified": "2026-01-19T18:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CFP National Championship 2026: Where to watch Miami vs. Indiana game, TV channel, kickoff time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/cfp-national-championship-2026-where-to-watch-miami-indiana/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/be1579c6-0659-4500-ab53-87b04561a16e/thumbnail/1200x675/bc73e49f6171863bb11c79c6d944a7df/untitled-design-158.png",
    "tag": "Sports",
    "date": "2026-01-20T03:19:57.000Z",
    "description": "\n        The 2025 college football season is approaching its conclusion as the final game is scheduled for Monday night in Miami when No. 10 Miami fac",
    "body": "\n        The 2025 college football season is approaching its conclusion as the final game is scheduled for Monday night in Miami when No. 10 Miami faces No. 1 Indiana in the 2026 College Football Playoff National Championship. The Hoosiers are seeking their first title in program history, while Miami is looking to claim its first championship since 2001.Indiana's road to the title game began earlier this month with a blowout 38-3 win over Alabama in the CFP quarterfinal at the Rose Bowl. That win marked the Hoosiers' first bowl game win of any kind since 1991. Curt Cignetti's program followed up that performance with an even more dominant showing the following week with a 56-22 win over Big Ten foe Oregon in the Peach Bowl.Bet Indiana vs. Miami at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:Miami had to win three games away from South Florida to become the first team in the CFP era to play for the national title at its own stadium. The Hurricanes defeated Texas A&M 10-3 in the first round of the CFP before eliminating reigning national champion Ohio State in the CFP quarterfinals at the Cotton Bowl.\nFollow live updates as Indiana vs. Miami headlines in the CFP National ChampionshipThe Hurricanes punched their ticket to the title game with a dramatic 31-27 win over Ole Miss in the Fiesta Bowl after quarterback Carson Beck scored a go-ahead touchdown with 18 seconds remaining.Where to watch Miami vs. Indiana in CFP National ChampionshipGame: 2026 College Football Playoff National ChampionshipDate: Monday, Jan. 19 | Time: 7:30 p.m. ETLocation: Hard Rock Stadium -- Miami Gardens, FloridaTV: ESPN | Live stream: fuboTV (Try for free)\nMiami vs. Indiana: Alternate viewing optionsField Pass with Pat McAfee Show -- ESPN2, fuboTV (Try for free)Film Room -- ESPNU, fuboTV (Try for free)Skycast -- ESPNEWS, fuboTV (Try for free)Field Pass with ACC Huddle  -- ACC Network, fuboTV (Try for free)All-22 with ESPN Radio, High Skycast, Command Center, hometown radio, halftime band performances and more available via ESPN's appMiami vs. Indiana storylinesMiami: Miami is seeking its sixth national championship in program history and first since 2001. Miami coach Mario Cristobal could become the first coach in the AP poll era (since 1936) to win a national title as a player and the coach of his alma mater. Cristobal played at Miami (1989-92) as an offensive tackle.With a win, Miami can become the third two-loss national champion in FBS history. The Hurricanes would join LSU (2007) and Ohio State (2024). It would also mark the second consecutive season that the 12-team CFP format produced a two-loss champion. Ohio State lost to Oregon and Michigan before winning four games in a row en route to a title.Miami's path to the CFP title game was difficult with three games away from home, but now the Hurricanes will do something that no team in the BCS or CFP era has done: play for a title at their home stadium. Miami has played at Hard Rock Stadium since 2008 and lost the Orange Bowl in 2017 to Wisconsin.\nIndiana: The Hoosiers are in the midst of one of the most unlikely turnarounds in college football history. The Hoosiers could become the lowest-ranked team (No. 20) in the AP preseason poll to win the national championship since Auburn, who began the season at No. 22, did it in 2010.The Big Ten (Michigan and Ohio State) has won the last two national titles. If Indiana wins, it would be the first time since the 1940s that the conference has won three consecutive national titles. It would also become the third time (SEC twice) a conference had won three consecutive national titles with three different schools.Indiana star quarterback and Heisman Trophy winner Fernado Mendoza will be returning to South Florida for the national title game. Mendoza grew up near the Miami campus, and his father, Fernando Mendoza Sr., was teammates with Cristobal at Christopher Columbus High School in Miami.\nMiami vs. Indiana prediction, pickHaving watched Indiana up close at the Rose Bowl earlier this month, Cignetti's squad feels like a team of destiny. Indiana has everything you need to win a title. The Hoosiers are physical in the trenches on both sides of the football, have a star quarterback to pair with talented skill position players and are disciplined. This game is going to come down to who can control the line of scrimmage. I'll give the edge to Indiana, although Miami is very talented up front on both sides of the football. I don't think this will be a blowout, but Indiana wins by 10. Pick: Indiana -8.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CFP National Championship 2026: Where to watch Miami vs. Indiana game, TV channel, kickoff time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/be1579c6-0659-4500-ab53-87b04561a16e/thumbnail/1200x675/bc73e49f6171863bb11c79c6d944a7df/untitled-design-158.png"
      ],
      "datePublished": "2026-01-20T03:19:57.000Z",
      "dateModified": "2026-01-20T03:19:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills fire Sean McDermott: Coach issues statement after nine seasons in Buffalo - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-fire-sean-mcdermott-buffalo-coach-nfl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/2fd422cb-b295-4890-b0de-eb6e1376c525/thumbnail/1200x675/7121bdf7b52df2bb41e95b4d77e87df7/sean-mcdermott-getty.png",
    "tag": "Sports",
    "date": "2026-01-19T22:49:13.000Z",
    "description": "\n        The Buffalo Bills have fired coach Sean McDermott following the team's AFC divisional round playoff loss to the Denver Broncos. Brandon Beane",
    "body": "\n        The Buffalo Bills have fired coach Sean McDermott following the team's AFC divisional round playoff loss to the Denver Broncos. Brandon Beane is being retained with the title of president of football operations/general manager and will help lead the search for Buffalo's next coach. \"Sean has done an [admirable] job of leading our football team the past nine seasons,\" Bills owner Terry Pegula said in a statement. \"But I feel we are in a need of a new structure within our leadership to give this organization the best opportunity to take our team to the next level. We owe that to our players and to Bills Mafia.\" McDermott, 51, had a largely successful nine-year run with the Bills that included five consecutive AFC East division titles from 2020-24. However, Buffalo went just 8-8 in the playoffs under McDermott with repeated gut-wrenching losses, including Saturday's 33-30 defeat to the Broncos that included several self-inflicted wounds. While McDermott led the Bills to the franchise's first road playoff win in 33 years a week earlier against the Jacksonville Jaguars, he was unable to snap Buffalo's longtime stretch without a Super Bowl appearance, which dates back to the 1993 season. Buffalo has been unable to advance past the AFC Championship despite having one of the NFL's best players in quarterback Josh Allen, whose eight playoff wins without a Super Bowl start is an NFL record. With Allen at quarterback, the Bills lost once in the wild-card round, four times in the divisional round, and twice in the AFC Championship.\nIn all, McDermott posted a 98-50 record with the Bills and made the postseason in eight of his nine seasons. McDermott's eight postseason wins are the most by any coach without a Super Bowl appearance. His 98 wins is the second-most in NFL history during a coach's first nine seasons. When McDermott arrived in 2017, the Bills had not been to the postseason since 1999.\"Sean helped change the mindset of this organization and was instrumental in the Bills becoming a perennial playoff team. I respect all the work, loyalty and attention to detail he showed for this team and community,\" Pegula said.McDermott released his own statement Monday night.For nearly a decade I have had the opportunity to wake up every morning as the Head Coach of the Buffalo Bills, which has truly been a gift. I want to express my sincere gratitude and appreciation to the Pegula family, the Buffalo Bills organization, and to the fans for allowing me to live out the dream of being a Head Coach in the NFL in this incredibly special place.I am proud and humbled to have worked alongside amazing staff and players as we shared life together and poured out our hearts and souls into both winning football games and making a positive impact in our community. This community graciously embraced not only me but my family and in some ways helped raise our children over the last 9 years. For that I say thank you to all of the teachers, coaches, and friends whom we met along the way...the City of Good Neighbors! We Love You! We will miss Buffalo.Bills Mafia, you are one of one! It has been a joy and inspiration to witness your passion and commitment first hand. I always wanted our teams to play with the same level of toughness and grit that is true to Buffalo and that you demonstrate every day!God gave me and my family an incredible opportunity, one that we will cherish for the rest of our lives. Yet we know that HE has a plan.Thank you for allowing me to serve as your head coach.\n        \n            \n                Firing Sean McDermott is a risk. Promoting Brandon Beane is the real mistake.\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nBuffalo's 73-27 record since 2020 is the best in the NFL. This season, the Bills became the fifth team in NFL history with six straight 11-win seasons. They also became the first team in NFL history to lose a playoff game by three points or less in three straight seasons. The Bills enter an offseason where they are slated to have just $3 million in projected cap space (which ranks 24th in the NFL) but will have at least one pick in each of the first five rounds of the upcoming NFL Draft. Receiver, defensive tackle and edge rusher are the Bills' biggest projected areas of need heading into the offseason. Buffalo also has several notable pending free agents, including pass rusher Joey Bosa, defensive lineman DaQuan Jones, center Connor McGovern and linebacker Matt Milano. McDermott is the latest in a string of high-profile coaching moves in the AFC. Mike Tomlin stepped down after 19 seasons leading the Pittsburgh Steelers and John Harbaugh was fired after 18 seasons with the Baltimore Ravens. Harbaugh has already landed with the New York Giants. With the Giants and Atlanta Falcons jobs filled (Atlanta hired Kevin Stefanski Sunday), the Bills become the eighth NFL opening, joining the Arizona Cardinals, Ravens, Cleveland Browns, Las Vegas Raiders, Miami Dolphins, Steelers and Tennessee Titans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills fire Sean McDermott: Coach issues statement after nine seasons in Buffalo - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/2fd422cb-b295-4890-b0de-eb6e1376c525/thumbnail/1200x675/7121bdf7b52df2bb41e95b4d77e87df7/sean-mcdermott-getty.png"
      ],
      "datePublished": "2026-01-19T22:49:13.000Z",
      "dateModified": "2026-01-19T22:49:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas' Bill Self to miss Colorado game after hospital visit for IV treatment - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-bill-self-hospital-colorado-basketball-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/20/f6abec0e-2152-4572-84c1-596aba0cecda/thumbnail/1200x675/6dc9281fb90e95b58b1ce56fe96d793f/billselfjan26headline.jpg",
    "tag": "Sports",
    "date": "2026-01-20T01:59:44.000Z",
    "description": "\n    \n    \n                    \n                Getty images\n            \n            \n    \n        Kansas coach Bill Self did not make the trip with ",
    "body": "\n    \n    \n                    \n                Getty images\n            \n            \n    \n        Kansas coach Bill Self did not make the trip with his team to Boulder, Colorado, and will not coach the Jayhawks' game against the Buffaloes on Tuesday night. Self, 63, felt sickness on Monday and, according to a two-sentence press release from KU, went to the hospital to make sure matters weren't worse. Fortunately, it seems all is OK.\"Bill Self felt under the weather earlier today and, out of an abundance of caution, was taken to [Lawrence Memorial Hospital] Health where he received IV fluids. He is feeling better but did not accompany the team to Boulder,\" the release said.A source told CBS Sports that the acting coach for the game will be determined either late Monday night or early Tuesday morning. Jeremy Case is KU's associate head coach, while longtime assistant Kurtis Towsend has experience coaching in Self's stead. KU also recently brought on alum and veteran NBA assistant Jacque Vaughn. \nMonday's trip to the hospital was the latest health event for Self, who did not coach in the 2023 Big 12 and NCAA tournaments after having a heart procedure to insert two stents to alleviate blood flow. Self had a second significant hospital stay for heart treatment last summer. At Big 12 Media Day last October, a slimmed-down Self told CBS Sports, \"I feel better now than I have in a long time.\"It's been a bit of a bumpy season for Kansas. The Jayhawks are 13-5 and coming off an 80-62 home win Friday against Baylor, but that was just the ninth game out of 18 of which star freshman guard Darryn Peterson was available. Peterson's battled an annoying hamstring problem for the entire season. Not having Self for the Colorado game is the latest disruption for a program looking to bounce back after going 21-13 last year, its worst campaign in Self's 23-year tenure.\nBarring any setbacks, Self is expected to resume his coaching duties when the team returns for practice later in the week. KU plays Saturday at in-state rival Kansas State.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas' Bill Self to miss Colorado game after hospital visit for IV treatment - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/20/f6abec0e-2152-4572-84c1-596aba0cecda/thumbnail/1200x675/6dc9281fb90e95b58b1ce56fe96d793f/billselfjan26headline.jpg"
      ],
      "datePublished": "2026-01-20T01:59:44.000Z",
      "dateModified": "2026-01-20T01:59:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions to hire offensive coordinator Drew Petzing, who was formerly Cardinals' OC - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/detroit-lions-hire-drew-petzing-offensive-coordinator/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/826a1aee-8b1f-4f1c-a89e-415736e666ca/thumbnail/1200x675/ab213658ae65002fa3082016dcf1a96a/gettyimages-1627597722-2.jpg",
    "tag": "Sports",
    "date": "2026-01-19T20:42:56.000Z",
    "description": "\n        The Detroit Lions intend to hire Drew Petzing to be their next offensive coordinator, sources tell Jonathan Jones of CBS Sports. Petzing spen",
    "body": "\n        The Detroit Lions intend to hire Drew Petzing to be their next offensive coordinator, sources tell Jonathan Jones of CBS Sports. Petzing spent the last three seasons in that role with the Arizona Cardinals, producing mixed results for their offense.Petzing, 38, has been coaching since he worked as a graduate assistant at Boston College from 2010-11. He's been in the NFL since he was hired by the Cleveland Browns to be a football operations intern in 2013.Following stints as an offensive assistant with the Minnesota Vikings and Cleveland Browns, Jonathan Gannon hired Petzing to be his offensive coordinator in 2023. In Petzing's first season with the team, Arizona averaged just 19.4 points per game, but that improved to 23.5 points per game in 2024. That was good for 12th in the NFL.This past season, the Cardinals' offense was plagued by injuries to key players like Kyler Murray, James Conner and Marvin Harrison Jr. As a result, Arizona ranked 23rd in the NFL at 20.9 points per game. The Cardinals' rushing attack ranked 31st in the NFL with just 93.1 yards per game, although the passing attack was far more potent at 232.6 yards per game, which was good enough for seventh overall.\nThose numbers may not inspire much confidence in Petzing as a playcaller, but he will have far more talent with which to work in Detroit. Between Jared Goff, Jahmyr Gibbs, Amon-Ra St. Brown, Jameson Williams and Sam LaPorta, the Lions are loaded at the offensive skill positions. Besides, this was a team that averaged 28.3 points in what was considered to be a down year.That talent didn't always click under former offensive coordinator John Morton, who was fired after just one year on the job. Following a relatively slow start for the Detroit offense, coach Dan Campbell took over playcalling duties in Week 10 and never relinquished them.\"It was just, let's try something a little different,\" Campbell said about the move in November. \"Look, I know what I want to do, I know how I want to do it. Now, that being said, this is a collaborative effort. I was taking input from John Morton that whole time, and the other coaches.\"\nPetzing will be tasked with pushing the Lions offense closer to the heights of the Ben Johnson era from 2022-24. If he can do that, Detroit should be poised for a bounce back campaign after missing out on the current postseason.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions to hire offensive coordinator Drew Petzing, who was formerly Cardinals' OC - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/826a1aee-8b1f-4f1c-a89e-415736e666ca/thumbnail/1200x675/ab213658ae65002fa3082016dcf1a96a/gettyimages-1627597722-2.jpg"
      ],
      "datePublished": "2026-01-19T20:42:56.000Z",
      "dateModified": "2026-01-19T20:42:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dolphins hiring Jeff Hafley as head coach: What it means for Tua Tagovailoa, next QB - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-hire-jeff-hafley-head-coach-replace-mike-mcdaniel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/60557ded-04fd-42b1-9a13-6b9df7e15a79/thumbnail/1200x675/5ccf28a9a6edb8262992d065b62bc9ba/jeff.jpg",
    "tag": "Sports",
    "date": "2026-01-20T01:25:57.000Z",
    "description": "\n        The Miami Dolphins found their new lead man, announcing Green Bay Packers defensive coordinator Jeff Hafley as their next head coach on Monda",
    "body": "\n        The Miami Dolphins found their new lead man, announcing Green Bay Packers defensive coordinator Jeff Hafley as their next head coach on Monday evening. Hafley was a popular name this cycle and ultimately landed in Miami.Hafley, who turns 47 in April, just wrapped up his second season as the Packers' defensive coordinator. His unit ranked No. 12 in total defense, allowing 311.8 yards per game, and No. 11 in scoring defense, allowing 21.2 points per game. The Packers were eliminated in the wild card round last week after blowing the largest lead (18 points) in postseason franchise history to rival Chicago Bears.Hafley is well-traveled and experienced. He last served as the head coach at Boston College for four seasons, going 22-26 before leaving for the Packers. Before his time at Boston College, he spent a season as Ohio State's co-defensive coordinator and defensive backs coach. The Buckeyes allowed 13.7 points per game and 259.7 yards per game that season, which ranked the fewest in the FBS. Hafley also coached defensive backs with the Tampa Bay Buccaneers, Cleveland Browns and San Francisco 49ers, as well as at the college level at Pittsburgh and Rutgers.Miami viewed Hafley as a favorite, as the Dolphins recently hired former Packers vice president of player personnel Jon-Eric Sullivan to serve as their new general manager. Now, Sullivan brings in a familiar face to turn the franchise around.\nMiami turns to Hafley to replace Mike McDaniel, who the Dolphins fired after he registered a 33-35 record over four seasons. McDaniel posted winning records in each of his first two seasons with the Dolphins but went 15-19 over the last two years. He failed to win a single playoff game and went 4-17 against teams with winning records during his tenure.The Dolphins haven't won a postseason game since 2000, the longest active playoff win drought in the NFL. There is plenty to be figured out in South Beach this offseason, as star wide receiver Tyreek Hill is expected to be released and the Dolphins could be in the market for a new quarterback as well. The Dolphins benched Tua Tagovailoa for rookie Quinn Ewers after Tagovailoa threw a career-high 15 interceptions in 14 games. He signed a four-year, $212.4 million extension in 2024 and carries a $56.4 million cap hit in 2026.Hafley a harbinger of a particular QB?Given Tagovailoa's contract, odds are he will be on Miami's roster in 2026. A post-June 1 release would result in a $67.4 million dead cap hit for the Dolphins in 2026, a $31.8 million dead cap hit in 2027, plus an $11 million salary cap increase in 2026. \nWhat the Dolphins could do is bring in \"competition\" to battle Tagovailoa -- similar to what the Indianapolis Colts did with Anthony Richardson last year by adding Daniel Jones. Interestingly enough, Hafley comes over from a team that currently has what may be the most intriguing quarterback on its roster this offseason.\nMalik Willis is set to be a free agent this offseason, and he has earned the right to at least battle for a starting job. After Jordan Love suffered a concussion in the Packers' Week 16 loss to the Bears, Willis stepped into the starting lineup the following week against the Baltimore Ravens. While Green Bay lost that game, 41-24, Willis' performance was remarkable.Malik Willis is set to be a free agent this offseason, and he's earned the right to at least battle for a starting job. After Jordan Love suffered a concussion in the Packers' Week 16 loss to the Bears, Willis was called upon to step into the starting lineup the following week against the Baltimore Ravens. While Green Bay did lose that game, 41-24, Willis' performance was remarkable. \nThe former third-round pick out of Liberty completed 18 of 21 passes for 288 yards and one touchdown and led the Packers in rushing with 60 yards and two more touchdowns. According to CBS Sports Research, Willis became the first quarterback ever to complete 85% of his passes while averaging 13 yards per attempt and rushing for 60 yards. His 13.7 yards per attempt were the most by a quarterback with 50 rushing yards in a game in the past 50 seasons.\n        \n            \n                Ranking the top 50 NFL free agents for 2026: Early look at the stars who could hit the market in March\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nSince the Tennessee Titans traded him to the Packers in 2024, Willis has gone 2-1 as a starter in Green Bay while averaging 204 passing yards per game. He has thrown three touchdowns with zero interceptions in those starts and posted a 132.4 passer rating. After his performance against Baltimore, Packers coach Matt LaFleur even had to publicly \"pump the brakes\" on the Willis hype.With Willis looking for a new opportunity, and the former Packers vice president of player personnel taking over as the Dolphins' general manager -- who then brought over the former Packers defensive coordinator to serve as head coach -- the Dolphins suddenly become a team to watch as a potential Willis landing spot.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dolphins hiring Jeff Hafley as head coach: What it means for Tua Tagovailoa, next QB - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/60557ded-04fd-42b1-9a13-6b9df7e15a79/thumbnail/1200x675/5ccf28a9a6edb8262992d065b62bc9ba/jeff.jpg"
      ],
      "datePublished": "2026-01-20T01:25:57.000Z",
      "dateModified": "2026-01-20T01:25:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Indiana vs. Miami: Live stream, TV channel, time for CFP National Championship - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-miami-where-to-watch-time-date-channel-cfp-national-championship-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/d664b42c-a9da-4691-bc78-d0aafd83f5d4/thumbnail/1200x675/760605f03895b494177f9a4651a9baee/indiana.png",
    "tag": "Sports",
    "date": "2026-01-20T03:20:30.000Z",
    "description": "\n        Indiana will be looking to cap one of the most remarkable turnarounds in college sports history as the No. 1 seed Hoosiers take on No. 10 see",
    "body": "\n        Indiana will be looking to cap one of the most remarkable turnarounds in college sports history as the No. 1 seed Hoosiers take on No. 10 seed Miami on Monday in the College Football Playoff National Championship. A win would make IU the first-ever 16-0 college football team and vault second-year coach Curt Cignetti to mythical status for his work in bringing the previously irrelevant Hoosiers to life.With Heisman-winning quarterback Fernando Mendoza and a fierce defense leading the way, Indiana pummeled Alabama and Oregon in its first two CFP games, winning by 35 and 34, to reach this point. Taking down a physically imposing Miami team could be a more significant challenge.Bet Indiana vs. Miami at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:While the Hurricanes enter as an underdog, they have the advantage of playing on their home field inside Hard Rock Stadium. For fourth-year coach Mario Cristobal, a former national-title winning Miami offensive lineman, this represents a unique opportunity to return the 'Canes to the top of college football. \nHe's already guided Miami past better-seeded foes Texas A&M, Ohio State and Ole Miss during a magical CFP run. Given that the Hurricanes squeaked into the field as the final at-large selection, they have already surpassed expectations.Follow live updates as Indiana vs. Miami headlines in the CFP National ChampionshipNow comes the grand finale of the 2025-26 college football season. Will it be Indiana or Miami as the last team standing on Monday night?\nWhere to watch Indiana vs. Miami liveDate: Monday, Jan. 19 | Time: 7:30 p.m. ETLocation: Hard Rock Stadium -- Miami Gardens, FloridaTV: ESPN | Stream: Fubo (Try for free)Indiana vs. Miami: Alternate viewing optionsField Pass with Pat McAfee Show -- ESPN2, fuboTV (Try for free)Film Room -- ESPNU, fuboTV (Try for free)Skycast -- ESPNEWS, fuboTV (Try for free)Field Pass with ACC Huddle  -- ACC Network, fuboTV (Try for free)All-22 with ESPN Radio, High Skycast, Command Center, hometown radio, halftime band performances and more available via ESPN's appIndiana vs. Miami: Players to watchFernando Mendoza, QB, Indiana: Indiana has been a dominant team, yes. It's also been a clutch team. Tight regular season wins over Iowa, Oregon and Penn State required a heroic touch from Mendoza, as did the Big Ten Championship Game victory over Ohio State. In each instance, the Miami native led clutch, late-game scoring drives to keep the Hoosiers unbeaten. He's a precisely accurate passer, deceptively mobile runner and the unflappable leader for IU.Carson Beck, QB, Miami: Beck rewrote his college football legacy by leading a pair of late touchdown drives in Miami's Fiesta Bowl win over Ole Miss. The Georgia transfer capped the performance with a go-ahead touchdown run with 18 seconds remaining. His career -- and his 2025 season -- has featured ups and downs. But after a season-ending elbow injury in last year's SEC Championship Game and subsequent public divorce with Georgia, the sixth-year senior is entering his final game on a high note.\nElijah Sarratt, WR, Indiana: With four touchdown grabs over the course of Indiana's three postseason games, Sarratt is up to 15 for the season. That tally would likely be even higher if not for hamstring injury that forced him to miss two games. The 6-foot-2 senior is a sturdy target on the outside who uses his physicality to box out corners and rise above them for big plays. He is among the contingent of players who followed Indiana coach Curt Cignetti from James Madison after the 2023 season.Malachi Toney, WR, Miami: Miami's freshman speedster was just a three-star prospect and the No. 55 overall receiver in the Class of 2025, per 247Sports. But it was clear from the jump that the Hurricanes identified a gem from their own backyard in Fort Lauderdale, Florida. Toney earned first-team All-ACC honors and is set to surpass 100 receptions in the title game. Offensive coordinator Shannon Dawson has done a great job of scheming up ways to get Toney the football. Once he gets it, watch out.D'Angelo Ponds, CB, Indiana: Ponds opened up Indiana's CFP semifinal win over Oregon with a pick six on the first play from scrimmage. The James Madison transfer has been a game-changer in the secondary all season, earning second-team All-American honors from CBS Sports. He's only 5-foot-9, but Ponds' draft stock is on the rise amid a strong finish to his junior season.\nRueben Bain Jr., EDGE, Miami: Bain is a high-motor edge rusher who ranks No. 3 in the CBS Sports NFL Draft Prospect Rankings. He enters the title game with 8.5 sacks and 13 tackles for loss. Combine him with Akheem Mesidor and you get arguably the nastiest 1-2 pass-rushing punch in college football. The Miami native has been a critical building block in the program's foundation under Cristobal and will be a challenge for Indiana to contain.Indiana vs. Miami prediction, pick \nMiami's offensive line is strong enough to keep Indiana's defensive front from wreaking total havoc, which is going to be critical if the Hurricanes want to keep it close. Conversely, Miami has enough juice with its defensive front — led by Rueben Bain Jr. and Akeem Mesidor — to at least make the Hoosiers sweat. In the end, IU appears to be a team of destiny and should win the game outright. With Heisman Trophy winning quarterback Fernando Mendoza leading the charge, Indiana appears to be the better team. But don't dismiss Miami's ability to make it a battle. Prediction: Miami +8.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Indiana vs. Miami: Live stream, TV channel, time for CFP National Championship - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/d664b42c-a9da-4691-bc78-d0aafd83f5d4/thumbnail/1200x675/760605f03895b494177f9a4651a9baee/indiana.png"
      ],
      "datePublished": "2026-01-20T03:20:30.000Z",
      "dateModified": "2026-01-20T03:20:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL power ratings: Broncos QB adjustment, spread projections - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-power-ratings-spread-projections-broncos-qb-playoff-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/08/25/e7c61e77-a554-4f4e-a85c-220c9305ca01/thumbnail/1200x675/b0a4cae9e551486d21c5e6627b5249f9/usatsi-jarrett-stidham-broncos.jpg",
    "tag": "Sports",
    "date": "2026-01-19T18:31:04.000Z",
    "description": "\nAfter an incredible divisional round that started and ended with overtime classics, we're left with four NFL teams vying to be Super Bowl champions i",
    "body": "\nAfter an incredible divisional round that started and ended with overtime classics, we're left with four NFL teams vying to be Super Bowl champions in the Broncos, Patriots, Seahawks and Rams. The matchups give us two interesting angles, one involving part three of a divisional rivalry that this year started with a defensive slugfest and then gave us an overtime shootout to lay out the path to the No. 1 seed for Seattle. The other features an MVP candidate at QB who has struggled against top defenses in the postseason facing another, though in a much different QB matchup than we were expecting.We'll get into both games a bit more as I use my power ratings to project where I would set the spread for each, but first we need to talk about the difference between Bo Nix and Jarrett Stidham when it comes to rating the Broncos. When a team turns to a backup, a rating adjustment will typically follow in the market. In some cases there may not be a perceived difference between QBs, particularly if a struggling starter is outright benched, and the adjustment to the line will be little to nothing. In the other extreme, a player like Lamar Jackson going from projected starter to out can cause an adjustment as high as 10 points depending on the quality of the backup.Typically, I'm reserving adjustments of seven points or higher to elite-level QBs like Jackson, Josh Allen and Patrick Mahomes, and the size of the adjustment will depend on my faith in the backup. Mahomes to Gardner Minshew and Mahomes to Chris Oladokun are two very different scenarios for moving a line. If I see the fill-in starter as a potential disaster -- and we've seen a few of those this year -- I may push an adjustment just inside that 7-10 point window for a good but not elite QB. Knowing what we know now, you can make an argument for a seven-point adjustment from Mahomes to Minshew and then another seven-point adjustment from Minshew to Oladokun, moving the Chiefs from one of the highest rated teams to one of the lowest in two moves.That brings us to this particular situation with the Broncos. Nix is not near that elite tier for me, although he has come up big in late game situations. He's put the team on his back at times this season, but too often the Broncos offense has lacked the juice to put away bad opponents, leaving them in a lot of competitive games late even against opponents like the Jets and Raiders. I think it's fair to put him mid-range and make him a four-point improvement over a generic QB, and part of that is due to Sean Payton being in place to elevate whoever gets the start at quarterback on a week-to-week basis.Then we come to Stidham, a career backup whose claim to fame has been starting the final two games of two straight seasons in place of big-name QBs the team wanted to keep healthy in order to have no issues parting ways with them in the offseason. He played very well in his first start, taking the Raiders to overtime and throwing three TDs in a 37-34 overtime loss to a 49ers team that finished the year first in points allowed, but he struggled in his next start against the Chiefs. Cleaning up for the Broncos a year later, he won a low-scoring game against the Chargers and then got outplayed by Aidan O'Connell and his former team in the finale.What I'm getting from that track record is that Stidham is an inconsistent QB who is not as bad as many of the backups we've seen forced into action this year, and on a good day he can play well enough to beat anybody. I'm comfortable making him a midrange backup on this profile with more potential to surprise on the high end than the low end, which is what we could generally say about Nix when rating him among starters. My ratings actually had a Broncos -2.5 projection prior to the divisional round as I had the Patriots as a half-point better but the Broncos getting three points for home-field advantage. I'm moving the Broncos 4.5 points with the QB change, and when coupled with a slight adjustment upward for New England, it means the best I can do is move the game to Patriots -2.5.The sportsbooks and betting market felt differently. The Broncos opened as 4.5-point underdogs on Sunday, a six-point adjustment that is already either getting Nix close to that top tier of MVP candidates or Stidham down to the Trey Lance level of \"this probably isn't going to go very well.\" The market then bet the Patriots up to 5.5, even touching 6 at some books on Sunday night. That's getting to level of Mahomes to Minshew or Minshew to Oladokun, and you can judge for yourself if either of those is a comparable gap to Nix vs. Stidham. I'm almost certainly going to be on the 'dog here, and we'll get into that more below.I'll have my picks this week at SportsLine, where members are able to access all my picks as they're made throughout the week and hopefully take advantage of some good line value. For now, let's dive into our betting power ratings and then take a look at what the spread should be for both conference title games.Conference championship power ratingsTeam2120191817LAR887.57.57.5SEA87.5777NE6.56555DEN1   5.5544Taking a break from the AFC, I now have the two NFC finalists as dead even after a strong performance by the Seahawks offense. You could certainly give them the overall edge after the Rams offense struggled against a questionable Bears defense, and to do that I think you'd have to be sure Sam Darnold isn't a concern in big spots any longer. He didn't exactly get tested in the divisional round, watching the opening kickoff get returned for a touchdown and then completing 12 passes in a game that felt over by the end of the first quarter.The Rams offense managed just 4.4 yards per play on the road against the Bears, and they certainly have seemed out of their element in the outdoor conditions in the first two rounds despite gutting out two wins. Matthew Stafford completed less than half of his pass attempts in the win, and he's going to have to be a lot better on Sunday for the Rams to advance.The Patriots get another bump from me despite the offense's struggles, as I think it's abundantly clear the defense is in a much better spot than it was for most of the season. While Drake Maye and Co. have not risen to the challenge of facing elite defenses after many questioned the ease of their schedule in the regular season, the defense has stepped up and then some.Then we have the Broncos, and we talked about my ratings adjustment above. Making them a +1 team puts them 11th among the 14 playoff teams, including everyone who is eliminated but who received ratings adjustments after their final games. I'd definitely take the Broncos over the Panthers (-1) and Steelers (0), and I moved the 49ers without George Kittle down to zero as well. Are the Broncos in a worse place than those teams heading into this game? Could I potentially have them too low putting them behind a Texans squad that got horrendous play from its QB and a Chargers team with major offensive line issues that couldn't be papered over against a good defense? Are we sure this team wouldn't be a coin flip on a neutral field with the Packers or maybe even the Bears?Let's take a quick look at each game's spread projection.Patriots at Broncos\nIn order for a line of Patriots -6 to make sense to me, you'd have to make the Broncos an average team without Bo Nix, give them just two points of home-field advantage, then put the Patriots on level in my ratings with the Seahawks and Rams. I can't do any of those things, so I see a lot of value backing the Broncos really at anything above 3.5.That becomes even more of a key number in this situation of a home underdog in the playoffs. Heading into this postseason, home underdogs of four points or more were 9-0 ATS over the last 50 years, combining three straight close losses from 2012-20 with six outright wins from 1976 to 2011.I pounded the table for the Panthers as 10.5-point underdogs in the wild card round for this reason, saying that these perceived bad teams outperform expectations consistently in the playoffs with everything on the line and the prospect of their season ending. I was told that this time is different, that the Rams were really good and the Panthers were really bad, as if the other situations when a team was laying more than a touchdown on the road in the playoffs didn't have the same perception.Once the spread got up to four against the Bears this past week, I backed the home team again. This one came close to being the streak ender before Caleb Williams unleashed one of the best passes in the history of postseason football to send the game into OT, where the Rams won but didn't cover. That makes the home 'dogs of four or more 11-0 against the spread heading into this matchup.What would be the situation where the Broncos could cover or even win this game? Could it be an elite defense shutting down an offense that has not been in good form and reducing the impact of poor quarterback play? How often do we see that happen?My spread for this game is Patriots -2.5.Rams at Seahawks\nHeading into the start of the week, this feels like a game where you could argue any range of spreads. The Seahawks probably have to be favored at home after a dominant win over the 49ers while the Rams barely survived in overtime, but what about the first two meetings in this matchup would give you confidence laying points with either team considering how close each was?I think the easiest thing to do -- and, in fact, what I've done -- is to say these are two even teams and then make the spread whatever you give Seattle for home-field advantage. The defense is playing at a high level, giving up a total of 548 yards in its last three games combined, which all came against playoff teams (Panthers and the 49ers twice). But the game prior the defense allowed 587 yards to these Rams in Seattle in an overtime game won by the Seahawks' decision to go for two and execute. The Rams turned the ball over three times in that one and still nearly won.The spread for that shootout in Seattle was Seahawks -1.5, so moving this spread to 2.5 must either mean the Seahawks have gotten better since that game or the Rams have gotten worse. I'd chalk the point of line movement up to Stafford not looking 100% these last few weeks, but we'll see if he can look more like the QB in the previous meeting as that will probably determine which of these teams is representing the NFC in the Super Bowl.My spread for this game is Seahawks -2.5.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL power ratings: Broncos QB adjustment, spread projections - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/08/25/e7c61e77-a554-4f4e-a85c-220c9305ca01/thumbnail/1200x675/b0a4cae9e551486d21c5e6627b5249f9/usatsi-jarrett-stidham-broncos.jpg"
      ],
      "datePublished": "2026-01-19T18:31:04.000Z",
      "dateModified": "2026-01-19T18:31:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking seven NFL head coaching vacancies: Which jobs look most appealing in 2026? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ranking-head-coaching-vacancies-which-of-these-remaining-jobs-is-the-most-desirable/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/fa7a1d0b-0060-4b54-8144-82b8c686351b/thumbnail/1200x675/bf0fa27f4da67d758de25e37f3baed20/getty-sean-mcdermott-josh-allen-bills.jpg",
    "tag": "Sports",
    "date": "2026-01-19T22:17:12.000Z",
    "description": "\n        The 2025 NFL regular season is in the books, and change is already in the air. The offseason is a time of immense turnover, as players switch",
    "body": "\n        The 2025 NFL regular season is in the books, and change is already in the air. The offseason is a time of immense turnover, as players switch teams via free agency or trade, teams change their rosters by acquiring them through one of those avenues or in the draft, and plenty of clubs swap out their coaches as they look to improve from one year to the next.We're here today to talk about the latter group of teams. So far nine NFL teams have fired their coaches and one, Mike Tomlin, has stepped down. The Tennessee Titans and New York Giants fired Brian Callahan and Brian Daboll during the regular season. The Atlanta Falcons fired Raheem Morris right after their season ended. And on Black Monday, the Cleveland Browns fired Kevin Stefanski, the Las Vegas Raiders fired Pete Carroll and the Arizona Cardinals fired Jonathan Gannon. The Baltimore Ravens fired John Harbaugh after 18 seasons. Then the Miami Dolphins fired Mike McDaniel. Tomlin stepped down from his post as the Pittsburgh Steelers head coach after 19 seasons last week. Following a playoff loss to the Broncos in the divisional round, the Buffalo Bills entered the coaching hunt after firing Sean McDermott. In the wake of all of those changes, let's rank the coaching vacancies in order of their desirability.Follow live updates on NFL coaching and GM changes, firings and rumors.\n                            \n    \n                                                \n                    \n    1. BillsThe Buffalo Bills have arguably the best player in the league at the most important position in the sport in Josh Allen. That alone makes this the most coveted job of this cycle, after the Bills fired Sean McDermott after their latest playoff loss to the Denver Broncos. Pairing yourself next to Allen has championship potential, so every head coach who hasn't already accepted a job will almost certainly stop what they're doing and see if they can align themselves with Allen. \nOutside of the elite QB, Buffalo does have other things going for it. James Cook is coming off a 2025 regular season where he led the NFL in rushing, the defense allowed a league-low 156.9 passing yards per game, and they are just about to move into a brand new stadium. That said, whoever is hired will need to help improve a horrid run defense and get the most out of a lacking pass-catching group to truly help Allen get over the hump in the postseason. \n                            \n    \n                                                \n                    \n    2. RavensThe Baltimore Ravens are the only team this coaching cycle that can offer prospective candidates the opportunity to coach a multi-time NFL MVP quarterback in Lamar Jackson. Plus, running back Derrick Henry showed no signs of slowing down in his age-31 season in 2025, rushing for 1,585 yards -- the second-most in the entire NFL. There are also a couple All-Pro building blocks on defense with linebacker Roquan Smith and safety Kyle Hamilton. Baltimore should make a playoff return in 2026 no matter who their head coach is provided they reinforce Jackson's offensive line as well as their defensive line. The Ravens do have some cap space to play with at the moment with $12.4 million in effective cap space, according to OverTheCap.com. Moving off of defensive tackle Nnamdi Madubuike's contract down the road following his neck injury could free up significant cap space in the coming years. \n\n                            \n    \n                                                \n                    \n    3. TitansTennessee restructured its front office over the weekend such that Mike Borgonzi will oversee the 53-man roster and lead the coaching search while Chad Brinker will handle the other football operations responsibilities. The Titans had one of the worst rosters and coaching situations in the NFL this season, but they might be set up to make a jump next year.Cam Ward's overall numbers don't look great, but there were so many flashes of high-level talent when you turn on the film. He was let down by a decrepit supporting cast and has a chance to be much better next year if the Titans improve the talent around him. And they'll have every chance to do so because Tennessee is set to enter the offseason with over $105 million in cap space and the No. 4 pick in the draft. They're not necessarily a candidate to go worst-to-first like the Bears and Patriots did this year, but they definitely have a chance to be a lot better next season if they hit on the right coach and use their budget and draft capital wisely, like those teams did. \n\n                            \n    \n                                                \n                    \n    4. RaidersThe Raiders are here for four reasons: Brock Bowers, Ashton Jeanty, the No. 1 pick in the draft and $100 million in cap room. (You could say five reasons and include Maxx Crosby, but there are already rumors swirling that the Raiders are finally willing to listen to trade offers for the star edge rusher, so he may not be long for Las Vegas.) There is just not much talent on this team outside of those players. There is a loooong way to go before the Raiders can be remotely competitive, and it doesn't help that they play in the AFC West, which is one of the most competitive divisions in football. Like the Titans, though, they can take a jump next season if they hit on their coach and whichever quarterback they presumably draft with the No. 1 pick, and spend their free-agent money to upgrade the talent level on the roster.One drawback here is the ownership situation, where Mark Davis seems to flail wildly from one plan to the next in quick succession. The Vegas job is not exactly stable, and doesn't come with a lot of job security, as evidenced by all the changes the Raiders have made over the last several years. \n\n                            \n    \n                                                \n                    \n    5. SteelersThe Pittsburgh Steelers have a patient ownership group under the Rooney family: they've only had three head coaches since the 1970 AFL/NFL merger. Their defense remains stout led by All-Pro edge rusher T.J. Watt with the Steelers generating three takeaways -- an interception and two fumbles recoveries -- off of Houston Texans quarterback C.J. Stroud in an eventual defeat thanks to their crumbling offense around Aaron Rodgers. This is an organization headed for a rebuild after five consecutive seasons with 9 or 10 wins with four of those years ending with wild card round defeats. Pittsburgh does have $23.6 million in effective cap space according to OverTheCap.com, but this offseason doesn't have a great free agency quarterback class, notable considering the Steelers haven't had a long-term quarterback since Ben Roethlisberger's retirement after the 2021 season. The best options are Daniel Jones coming off of a torn Achiles, Rodgers entering his age-43 season or Green Bay Packers backup quarterback Malik Willis who shined in relief of Jordan Love the last two seasons. On the trade market, Kyler Murray is likely the best choice. Whoever takes this job will be tasked with helping the Steelers build around that elusive franchise quarterback, rebuild a stale offense and manage what's becoming a quickly aging defense.  \n\n                            \n    \n                                                \n                    \n    6. BrownsThe Browns have a good defense built around Myles Garrett, who is just an inhuman monster coming around the edge. They drafted a pair of star rookies in tight end Harold Fannin Jr. and linebacker Carson Schwesinger. They have multiple first-round picks in this year's draft thanks to last year's Travis Hunter trade. What the Browns don't have is much other talent on offense (Quinshon Judkins will be coming off a dislocated ankle and fractured fibula), an answer at quarterback or any cap space to solve their various issues. Cleveland is set to begin the offseason more than $12 million over the cap, according to Over the Cap, and it still has the albatross of Deshaun Watson's contract weighing down its books in both 2026 and 2027, at least.The Browns also have an ownership and management situation that is, shall we say, not all that desirable. The Haslam family has run one of the most unstable organizations in the league, and Andrew Berry hasn't exactly put together a great roster. (The combination of the Haslams and Berry was responsible for the disastrous Watson trade.)\n\n                            \n    \n                                                \n                    \n    7. CardinalsArizona lost 14 of its final 15 games this season and looked incredibly listless in doing so. The Cardinals have an uncertain quarterback situation with Kyler Murray seemingly not long for the team, and they really have no viable path to solving that situation this offseason unless it becomes a three-quarterback draft or the Jets decide to pass on someone like Dante Moore (if he enters) or Fernando Mendoza at No. 2 overall. Arizona is set to have only around $21 million in cap room (and only $9.8 million in effective cap space), per Over the Cap, so it's not like there are a lot of resources here to solve the various roster issues. They do have players like Trey McBride, Michael Wilson, Paris Johnson Jr., Josh Sweat, Budda Baker, Garrett Williams, Walter Nolen and Will Johnson, but there are still a lot of holes here and not that much to build around.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking seven NFL head coaching vacancies: Which jobs look most appealing in 2026? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/fa7a1d0b-0060-4b54-8144-82b8c686351b/thumbnail/1200x675/bf0fa27f4da67d758de25e37f3baed20/getty-sean-mcdermott-josh-allen-bills.jpg"
      ],
      "datePublished": "2026-01-19T22:17:12.000Z",
      "dateModified": "2026-01-19T22:17:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Backup QBs to reach Super Bowl: Can Jarrett Stidham join Foles, Brady, others? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jarrett-stidham-backup-qbs-to-start-in-a-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/7bb3d462-7bfd-4f31-b53b-f1444b7cc513/thumbnail/1200x675/68d099a5a8b11e2d6908b10c8450e416/warnerbrady.jpg",
    "tag": "Sports",
    "date": "2026-01-20T03:40:38.000Z",
    "description": "\n        Jarrett Stidham will join a pretty unique group of quarterbacks if the Denver Broncos defeat the New England Patriots in Sunday's AFC Champio",
    "body": "\n        Jarrett Stidham will join a pretty unique group of quarterbacks if the Denver Broncos defeat the New England Patriots in Sunday's AFC Championship. Stidham -- who will replace Bo Nix in the starting lineup following Nix's season-ending ankle injury that was sustained in this past week's divisional round playoff win over the Buffalo Bills -- would become the 13th backup quarterback in NFL history to start in a Super Bowl. Of the previous 12, eight backup quarterbacks ended up hoisting the Vince Lombardi Trophy by game's end. None of those players, however, started in their respective conference championship game without having started in any other game that season, which is what Stidham will do on Sunday. In fact, the 29-year-old Stidham hasn't made a start in a non-exhibition game since 2023 and has not attempted a pass in a non-exhibition game in over two years. Given his lack of recent game reps, you could argue that Stidham would pull off one of the most impressive feats in NFL history if he is able to help the Broncos defeat the visiting Patriots. In doing so, he would also join the following list of backup quarterbacks who started on pro football's biggest stage. \nEarl Morrall, Colts: 1968Owner of one of the most unique careers in NFL history, Morrall was 34 and living the life of a veteran backup when an injury to reigning league MVP Johnny Unitas thrust him into the Colts' starting lineup ahead of the 1968 season. Morrall ran with the opportunity as he won league MVP honors while leading the Colts to a 15-1 record entering their Super Bowl showdown with the 18-point underdog New York Jets, who were led by their brash young quarterback, Joe Namath. Namath guaranteed victory prior to the game, and he and his teammates backed it up by recording a shocking 16-7 win over the Colts to secure the AFL's first win over the NFL. Morrall threw three interceptions before he was replaced by Unitas, who led Baltimore to its only points of the game. \nIronically, Morrall replaced an injured Unitas two years later in Super Bowl V and helped the Colts capture their first Super Bowl win. Two years after that, he won each of his starts with the Dolphins after replacing injured starter Bob Griese in the season's fifth week. Morrall started the AFC Championship, but Don Shula (his former coach in Baltimore) later went with Griese as the Dolphins' offense needed a spark. Griese led the Dolphins on two scoring drives en route to a 21-17 win over the Steelers. The Dolphins would then cap off their undefeated season with a 14-7 win over Washington in Super Bowl VII. Roger Staubach, Cowboys: 1971Staubach, who was 29 at the time, shared the starting job with veteran Criag Morton (who had led the Cowboys to their first Super Bowl appearance a year earlier) during the season's first seven games before Tom Landry finally gave him the keys to the Cowboys' offense for good following a loss to the Bears in Week 7. \nUnder Staubach, the Cowboys were a perfect 10-0 during the regular season. In the playoffs, Dallas bested the Vikings and 49ers before posting a dominant, 24-3 win over Shula's Dolphins in Super Bowl VI. Staubach won the game's MVP award after throwing a pair of scores to future Hall of Famers Mike Ditka and Lance Alworth. \nStaubach went on to enjoy a Hall of Fame career with the Cowboys that included another Super Bowl win at the end of the 1977 season. Vince Ferragamo, Rams: 1979 Ferragamo took over as the Rams' starting quarterback with five games left in the regular season. He took over after starter and former Pro Bowler Pat Haden sustained a season-ending injury and rookie and fellow backup Jeff Rutledge struggled in a loss to Chicago that dropped the Rams' record to 5-6. \nWhile most had given up on the Rams at that point, Ferragamo led them to four straight wins en route to a seventh consecutive NFC West title. He then helped the Rams upset the Cowboys and Buccaneers to punch the franchise's first Super Bowl ticket. \nA 10.5-point underdog to the defending champion Pittsburgh Steelers, Ferragamo's steady play helped the Rams take a 13-10 halftime lead and a 19-17 lead heading into the fourth quarter of Super Bowl XIV. But his one mistake -- an interception to Steelers linebacker Jack Lambert -- contributed to the Rams' eventual 31-19 loss as Pittsburgh scored 14 unanswered points during the game's final quarter. \nIn defeat, Ferragamo was lauded for his performance against arguably the greatest defense in NFL history. In fact, Steelers center Mike Webster said that Ferragamo outplayed Terry Bradshaw, who won the game's MVP award. \nJim Plunkett, Raiders: 1980 Plunkett is the standard-bearer for former No. 1 overall picks who revived their careers after a rough start. After several rocky seasons with the Patriots (who selected him with the No. 1 overall pick in the 1971 NFL Draft) and 49ers, Plunkett began the 1980 season as a backup on a Raiders team that wasn't expected to be very good.But an injury to Dan Pastorini five weeks into the season set in motion one of the most unexpected team and individual turnarounds in history. After throwing five interceptions in his first game following Pastorini's injury, Plunkett won his first six starts and would end up going 9-4 as the Raiders' starter during the regular season. His success helped the Raiders clinch a playoff berth with an 11-5 record. In the playoffs, the Oakland defeated the Oilers (who were quarterbacked by Kenny Stabler, a former Raiders legend who was traded to Houston that season in exchange for Pastorini, who had led the Oilers to consecutive AFC title game appearances prior to being dealt), the cardiac Browns (a win that included the infamous Red Right 88 play) and Dan Fouts and the Chargers' high-scoring offense to reach the Super Bowl. \nUnderdogs heading into their Super Bowl showdown with the Philadelphia Eagles, the Raiders dominated the game from start to finish. Plunkett took home MVP honors after throwing for 261 yards and three touchdowns as the Raiders became the first wild card team to win it all. \nThree years later, Plunkett and the Raiders once again reached the mountaintop after defeating defending champion Washington in Super Bowl XVIII. Doug Williams, Washington: 1987 Williams, despite losing both of his regular-season starts, was named Washington's starter going into the 1987 playoffs over Jay Schroeder, a Pro Bowler the previous season who went 8-2 as Washington's starter that season. Williams (who had dealt with injuries during the regular season) earned the starting job after replacing a struggling Schroeder and leading Washington to a win over the Vikings in Washington's regular-season finale. \nA former first-round pick, Williams was back in the spotlight eight years after he helped lead the Buccaneers to their first NFC title game appearance. Now 32, Williams made the most of his new opportunity, helping Washington defeat the Bears and Vikings in the NFC playoffs before he and his teammates obliterated the Broncos in Super Bowl XXII. Williams' and Washington's performance that day was nothing short of historic. Trailing 10-0 after the first quarter, Washington scored a Super Bowl record 35 points in the second quarter that included four touchdown passes from Williams, who threw for a then-Super Bowl record 340 yards in leading Washington to a 42-10 win. Williams was named MVP after becoming the first starting Black quarterback to win the Super Bowl. \nJeff Hostetler, Giants: 1990 In his seventh season at the time, Hostetler had grown tired of sitting on the bench after making just two starts during his first six seasons. It got to the point where he had made up his mind that he would retire after the 1990 season. \nHostetler's career took a drastic turn, however, in Week 15 after Phil Simms went down with a season-ending injury. But despite injuries to Simms and star rookie running back Rodney Hampton, Hostetler and 34-year-old running back Ottis Anderson stepped in and helped the Giants finish the season with five straight wins that included two of the most shocking upsets in NFL history. In the 1990 NFC title game, the Giants recorded a stunning, 15-13 upset win over a 49ers team that was in pursuit of a record three straight Super Bowl wins. The 49ers' quest came up short after two clutch throws from Hostetler set up Matt Bahr's game-winning field goal as time expired. \nIn Super Bowl XXV, the Giants were again decided underdogs against a Bills team that had posted a 51-3 win over the Raiders in the AFC title game. In an attempt to keep Buffalo's high-scoring offense off the field, Giants coach Bill Parcells employed a ball control offense that maintained possession for a Super Bowl record 40 minutes, 33 seconds. Hostetler directed four scoring drives that included several big third-down completions, none bigger than his 14-yard completion to Mark Ingram on a third-and-13 play that gave the Giants the lead late in the third quarter. \nHostetler's poise was complemented by Anderson, who bullied Buffalo's defense to the tune of 102 yards and a touchdown on 21 carries. Defensively, Giants defensive coordinator Bill Belichick instructed his defense to concede the running game while not allowing Jim Kelly and Buffalo's passing game to beat them. While Thurman Thomas gashed them for 135 yards, Buffalo's passing game was held in check. The Giants won game, 20-19, after Bills kicker Scott Norwood missed his 47-yard field goal try with eight seconds left. Belichick's game plan vs. Buffalo now resides in the Pro Football Hall of Fame. Kurt Warner, Rams (1999)Of all the Super Bowl-winning backup quarterbacks, Warner's story might be the most incredible (it was later made into a movie, after all). After playing collegiately at Iowa State, Warner spent the next four years trying to land a spot on an NFL roster. He also spent part of that time as a grocery store clerk before having success with the Indoor Football League's Iowa Barnstormers. His success there led to him signing a future contract with the Rams during the 1998 offseason. He ultimately earned a spot on the team's 53-man roster and attempted 11 passes during the '98 season. Warner entered the 1999 season as Trent Green's backup, but that quickly changed after Green suffered a season-ending knee injury during the preseason. Instead of trying to sign a veteran via free agency, Rams coach Dick Vermeil said that his team would \"rally around Kurt Warner, and we'll play good football.\"Vermeil's statement proved to be prophetic as Warner and the Rams' offense set the league on fire that season. En route to a 13-3 season, Warner (who credited the fast pace of arena football to his quick success in the NFL) led the NFL with 41 touchdowns, a 65.1% completion percentage and a 109.2 passer rating. Warner won both league and Super Bowl MVP after throwing for a then-Super Bowl record 414 yards during the Rams' 23-16 win over the Titans in Super Bowl XXXIV. His 73-yard touchdown pass to Isaac Bruce (which came with reigning Defensive Rookie of the Year Javon Kearse bearing down) proved to be the game winner. \nWarner would win another league MVP two years and would start in two more Super Bowls before retiring after the 2009 season. He was inducted into the Hall of Fame in 2017. Tom Brady, Patriots (2001)Warner may have the most incredible story, but Brady is undeniably the greatest former backup QB in NFL history. Heck, many consider him to be the best player in league history given that he retired with more Super Bowl wins (seven) than any team in NFL history. Brady's first ring came at Warner and the Rams' expense after he led the Patriots to what was at the time the greatest upset in Super Bowl history since the Jets' win over the Colts 33 years earlier. After Warner and the Rams rallied to tie the score, Brady defied the odds (and legendary broadcaster John Madden included) by not playing for overtime and instead driving the Patriots into field goal range in the game's closing minute. His five completions on New England's final drive set up Adam Vinatieri's game-winning, 48-yard kick as time expired. \nBrady's incredible career may not have happened if not for Drew Bledsoe's injury that occurred way back in Week 2 of the 2001 season. Brady, a second-year player at the time, had thrown just three career passes before taking over for Bledsoe and the 0-2 Patriots. To the surprise of everyone, Brady gave the Patriots an immediate jolt that included a blowout win over Peyton Manning's Colts in his first career start. And despite a loss to the Rams that dropped the Patriots to 5-5 and Bledsoe being cleared to return to action, Bill Belichick decided to stick with Brady as his starter for the remainder of the season. That decision proved to change the course of NFL history. Brady and the Patriots never lost again that season while beginning one the longest stained run of success the league has ever seen. That run, however, did include one last moment of brilliance from Bledsoe, who led the Patriots to a win over Pittsburgh in the 2001 AFC title game after relieving an injured Brady. Jack Delhomme, Panthers: 2003 Delhomme had a cup of coffee as the Panthers' backup in 2003 before replacing veteran Rodney Peete in the starting lineup during Carolina's season-opener. Down 17-0, Delhomme led Carolina to a come-from-behind win that day against the Jaguars and never looked back. Carolina started 5-0 and finished the regular season with an 11-5 record. Delhomme played well in the regular season, but he took his play to another level in the postseason. He led the NFL with six touchdown passes during the playoffs while leading the Panthers to playoff wins over the Cowboys, Rams and Eagles. Delhomme took full advantage of Carolina's talented skill set that included wideouts Mushin Muhammad, Steve Smith Jr., and running back Stephen Davis. In the Super Bowl, Delhomme and Brady exchanged blows in one of the most explosive fourth quarters in Super Bowl history. During the quarter, Delhomme fired two touchdown passes that included the game-tying score with 1:08 left. \nBrady, though, once again had the final say as he led the Patriots on a last-minute drive that ended with another game-winning kick by Vinatieri. While 2003 was the pinnacle of his career, Delhomme did have several more Pro Bowl level seasons while enjoying a lengthy NFL career. Colin Kaepernick, 49ers: 2012In his second year at the time, Kaepernick got his chance to play after former No. 1 overall pick Alex Smith sustained a concussion in Week 10. Despite leading the 49ers to a 6-2 start and the previous year's NFC title game, Smith lost his starting job to Kapernick, who went 5-2 as San Francisco's starter during the regular season. Kaepernick was mostly exceptional during the playoffs. He scored four total touchdowns while rushing for 181 yards in San Francisco's divisional round win over the Packers. He then completed 76.2% of his throws as the 49ers edged Matt Ryan and the Atlanta Falcons to clinch a spot in the Super Bowl. \nAgainst the Ravens, the 49ers fell behind big before a power outage shifted the game's momentum. Down 28-6, Kaepernick led 49ers on an epic comeback attempt that come up short in an eventual 34-31 loss. In defeat, Kaepernick threw for 302 yards and a score while also rushing for 62 yards and another score. Kaepernick would lead the 49ers back to the NFC title game the following season and would spend the ensuing three years in San Francisco. He hasn't played, however, since the 49ers released him ahead of the 2017 season. Nick Foles, Eagles: 2017Many forget that Foles as a Pro Bowler in 2013 after throwing 27 touchdowns and just two interceptions for the Eagles. He struggled to regain that level of success in the following years, though, which led to him spending the 2017 season as a backup before he replaced an injured Carson Wentz in Week 14. Wentz, in his second season at the time, was in the midst of an MVP season at the time of his season-ending injury. And while many expected the Eagles to fade following his injury, that instead went 5-1 with Foles that included the franchise's first Super Bowl win. In the playoffs, Foles completed an impressive 72.6% of his passes for 971 yards with six touchdowns and one pick. He matched wits with Brady in Super Bowl LII and won MVP honors after throwing for 373 yards and three touchdowns. He also called a touchdown pass on a play that immediately went down in Super Bowl lore. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Backup QBs to reach Super Bowl: Can Jarrett Stidham join Foles, Brady, others? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/7bb3d462-7bfd-4f31-b53b-f1444b7cc513/thumbnail/1200x675/68d099a5a8b11e2d6908b10c8450e416/warnerbrady.jpg"
      ],
      "datePublished": "2026-01-20T03:40:38.000Z",
      "dateModified": "2026-01-20T03:40:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]