[
  {
    "title": "Juventus reveal UEFA investigation for potential Financial Fair Play breaches; CEO Maurizio Scanavino to leave - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/juventus-reveal-uefa-investigation-for-potential-financial-fair-play-breaches-ceo-maurizio-scanavino-to-leave/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/121f02e7-44cf-4995-aa51-faef6617e1c3/thumbnail/1200x675/efd749a4cab2d337f8f99ab42d410763/untitled-design-2025-10-17t124316-356.png",
    "tag": "Sports",
    "date": "2025-10-17T10:47:09.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of Serie A's biggest and most historic teams, ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of Serie A's biggest and most historic teams, Juventus, have announced that they are being investigated by UEFA, European soccer's governing body, for possible financial fair play breaches. The Italian giants announced the news in the club's financial statements, which are scheduled to be presented at its annual shareholders' meeting on Nov. 7. The statement reveals that on Sept. 18 UEFA informed the club about the current investigation for possible breaches between 2022 and 2025 with a verdict expected to take place in 2026. \nThe club have also announced that on November 7, Juventus CEO Maurizio Scanavino will step down from his position after three years, a job he began when he was appointed to replace the former board and CEO who all stepped down after a separate financial scandal, and the resignation of the former president Andrea Agnelli. Scanavino said, \"Three years ago, I accepted this prestigious position at an extremely critical time, one not without risks for those entrusted with the responsibility of leading the Club. The goal was clear: to embark on a path based on economic sustainability and sporting competitiveness. With the support of the owners, directors and talented colleagues, we faced and overcame numerous challenges with determination, despite the difficulties. Today more than ever, I look to the future of Juventus with great confidence, and I am certain there will be many more important pages to write.\"\nAfter the scandal, UEFA banned Juventus for the 2023-24 Conference League season and forced the Italian club to pay an \"additional financial contribution of €20 million\". Juventus received a 10-point deduction in the 2022-23 Serie A season after the Italian club were found guilty by the Italian FA appeals court (Corte d'Appello) for rules violations. According to the financial statement, the club exceeded the spending limit of €30 million from 2022 to 2025 and Juventus could potentially be facing both financial and sporting restrictions over the next several years, or also be banned from registering players for the UEFA competitions. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Juventus reveal UEFA investigation for potential Financial Fair Play breaches; CEO Maurizio Scanavino to leave - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/121f02e7-44cf-4995-aa51-faef6617e1c3/thumbnail/1200x675/efd749a4cab2d337f8f99ab42d410763/untitled-design-2025-10-17t124316-356.png"
      ],
      "datePublished": "2025-10-17T10:47:09.000Z",
      "dateModified": "2025-10-17T10:47:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "San Jose State vs. Utah State odds, picks, predictions from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/san-jose-state-utah-state-prediction-odds-2025-week-8-friday-college-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/d132e5bf-93c6-4630-a99f-efc08118e1e0/thumbnail/1200x675/1b1d9c5cc5bf1b29054471cbb4742d0b/walker-eget-sjsu-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-17T11:29:57.000Z",
    "description": "\n        Mountain West rivals will square off in college football Week 8 action as the Utah State Aggies host the San Jose State Spartans on Friday. T",
    "body": "\n        Mountain West rivals will square off in college football Week 8 action as the Utah State Aggies host the San Jose State Spartans on Friday. The Aggies (3-3, 1-1) are looking to end a two-game skid after losses to Vanderbilt and conference rival Hawaii. The Spartans are also looking to get back into the win column, falling 3-28 to Wyoming their last time out.Kickoff from Maverik Stadium is set for 9 p.m. ET on CBS Sports Network. The Aggies are 4-point favorites in the latest San Jose State vs. Utah State odds, and the over/under for total points scored is 61.5. Before making any Utah State vs. San Jose State picks, be sure to see what the SportsLine projection model has to say.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has zeroed in on Utah State vs. San Jose State. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for SJSU vs. Utah State in Week 8:San Jose State vs. Utah State spreadUtah State -4 at DraftKings SportsbookSan Jose State vs. Utah State over/under61.5 pointsSan Jose State vs. Utah State money line Utah State -185, SJSU +154San Jose State vs. Utah State picksSee picks at SportsLineSan Jose State vs. Utah State streaming Fubo (Try for free)  Why San Jose State can coverThe Spartans are a solid 3-3-0 ATS through six games this season, even covering as a 37-point underdog in Week 2 against Texas. Quarterback Walker Eget was held without a touchdown in that game, but has been on fire ever since, and leads the Mountain West with 1,816 passing yards. He has been especially good against conference opponents, completing 73.1% of his passes for 629 with seven touchdowns and no interceptions. Eget will be SJSU's weapon to cover as underdogs against an Aggies defense that allows 257.2 passing yards and 32.7 points per game. See which team to back at SportsLine. Why Utah State can coverThe Aggies are 5-1-0 ATS this season and are 2-0-0 ATS as a 4-point favorite or greater. They are also undefeated at home this season -- while SJSU has yet to win a road game -- and have outscored visiting opponents 125-53. Utah State quarterback Bryson Barnes has played particularly well at home, averaging 10.6 yards per pass with a 71.4% completion rate and 6-1 TD-INT ratio. He also adds 81 carries for 309 rushing yards and six touchdowns on the ground. San Jose State's defense is good at defending the rush but struggles to contain a good passing game, so Barnes' dual abilities could be the Aggies covering the spread in another home victory. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Utah State vs. SJSU picksFor San Jose State vs. Utah State in Week 8, the model is leaning over the total, and also says one side of the spread hits in well over 60% of simulations. See what it is at SportsLine.Who wins SJSU vs. Utah State, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Utah State vs. San Jose State spread you need to jump, all from the model that is a combined 39-27 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "San Jose State vs. Utah State odds, picks, predictions from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/d132e5bf-93c6-4630-a99f-efc08118e1e0/thumbnail/1200x675/1b1d9c5cc5bf1b29054471cbb4742d0b/walker-eget-sjsu-imagn-cbs.jpg"
      ],
      "datePublished": "2025-10-17T11:29:57.000Z",
      "dateModified": "2025-10-17T11:29:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nebraska vs. Minnesota odds, picks, predictions from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/nebraska-minnesota-prediction-odds-line-time-2025-college-football-week-8-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/e3b9115b-789f-470c-8721-3e85c3120019/thumbnail/1200x675/940d498dd5193abe5959368d7f253943/dylan-raiola-nebraska-cornhuskers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-17T11:20:46.000Z",
    "description": "\n        Head coach Matt Rhule and the 25th-ranked Nebraska Cornhuskers look to win their third game in a row when they battle the Minnesota Golden Go",
    "body": "\n        Head coach Matt Rhule and the 25th-ranked Nebraska Cornhuskers look to win their third game in a row when they battle the Minnesota Golden Gophers in a key Big Ten matchup on Friday night. Nebraska is coming off a 34-31 win at Maryland, while Minnesota rallied to defeat Purdue 27-20 last week. The Cornhuskers (5-1, 2-1 Big Ten), who are looking for their best conference finish since 2016, are 1-0 on the road this season. The Golden Gophers (4-2, 2-1 Big Ten), who are tied with Nebraska for fourth in the conference, are 4-0 on their home field this year.Kickoff from Huntington Bank Stadium in Minneapolis, Minn., is at 8 p.m. ET. Minnesota leads the all-time series 37-25-2, including a 13-10 win in 2023. The Cornhuskers are 7-point favorites in the latest Nebraska vs. Minnesota odds, while the over/under for total points scored is 47.5 via SportsLine consensus. Before making any Minnesota vs. Nebraska picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Nebraska vs. Minnesota. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Minnesota vs. Nebraska:Nebraska vs. Minnesota                                                                     spreadNebraska -7 at DraftKings SportsbookNebraska vs. Minnesota                                                                               over/under47.5 pointsNebraska vs. Minnesota                                                                               money line Nebraska -276, Minnesota +224Nebraska vs. Minnesota                                                                       picksSee picks at SportsLineNebraska vs. Minnesota                                                                         streaming Fubo (Try for free)  Why Nebraska can coverSophomore quarterback Dylan Raiola has been dominant so far this season. In six games, he has completed 138 of 188 passes (73.4%) for 1,591 yards and 16 touchdowns with five interceptions. In last week's win at Maryland, he overcame three interceptions to complete 20 of 29 passes for 260 yards and four touchdowns. In a 68-0 win over Akron on Sept. 6, he completed 24 of 31 passes for 364 yards and four touchdowns.Leading the Cornhuskers' ground attack is junior running back Emmett Johnson. He has rushed 105 times for 650 yards (6.2 average) and seven touchdowns. He also has 24 receptions for 130 yards (5.4 average) and one touchdown. In last week's win over Maryland, he carried 21 times for 176 yards (8.4 average), including a long of 50. He carried just 13 times for 83 yards (6.4 average) and three touchdowns. See which team to back at SportsLine. Why Minnesota can coverThe Golden Gophers' offense is led by redshirt freshman quarterback Drake Lindsey. He has completed 113 of 188 passes (60.1%) for 1,284 yards and nine touchdowns with three interceptions for a 130.1 rating. He has also rushed for one score. In last week's win over Purdue, he threw for 232 yards and two touchdowns. He was 31 of 41 passing for 324 yards and three touchdowns in a 31-28 win over Rutgers on Sept. 27.Lindsey's top target is senior wide receiver Le'Meke Brockington. In six games, he has 23 receptions for 253 yards (11.0 average) and two touchdowns. He also has carried twice for nine yards, including a seven-yard touchdown run in a 66-0 win over Northwestern State on Sept. 6.  He had eight receptions for 106 yards, including a long of 23. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Nebraska vs. Minnesota picksSportsLine's model is going Under on the total, projecting 47 combined points. It also says one side of the spread hits in more than 60% of simulations.     You can only get the pick at SportsLine. So who wins Minnesota vs. Nebraska, and which side of the spread hits more than 60% of the time? Visit SportsLine now to see which side of the Nebraska vs. Minnesota spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nebraska vs. Minnesota odds, picks, predictions from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/e3b9115b-789f-470c-8721-3e85c3120019/thumbnail/1200x675/940d498dd5193abe5959368d7f253943/dylan-raiola-nebraska-cornhuskers-imagn-images.jpg"
      ],
      "datePublished": "2025-10-17T11:20:46.000Z",
      "dateModified": "2025-10-17T11:20:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louisville vs. Miami odds, picks, predictions from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-louisville-prediction-odds-line-time-2025-college-football-week-8-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/70d3083c-b52c-4bbc-ba2b-cc3a282f519c/thumbnail/1200x675/d7e52b33269c4291aabc1808442dcf47/carson-beck-miami-hurricanes-quarterback-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-17T11:12:25.000Z",
    "description": "\n        Carson Beck and the second-ranked Miami (Fla.) Hurricanes look to stay perfect on the season when they battle the Louisville Cardinals in an ",
    "body": "\n        Carson Beck and the second-ranked Miami (Fla.) Hurricanes look to stay perfect on the season when they battle the Louisville Cardinals in an ACC matchup on Friday night. Louisville is coming off a 30-27 overtime loss to Virginia on Oct. 4, while Miami defeated Florida State 28-22 that same night. The Cardinals (4-1, 1-1 ACC), who are 0-1 against ranked opponents, are 1-0 on the road this season. The Hurricanes (5-0, 1-0 ACC), who are 2-0 against unranked opponents, are 4-0 on their home field in 2025.Kickoff from Hard Rock Stadium in Miami Gardens, Fla., is at 7 p.m. ET. Miami leads the all-time series 11-4-1, but Louisville has won four of the last six, including a 38-31 decision in 2023. The Hurricanes are 13.5-point favorites in the latest Louisville vs. Miami odds, while the over/under for total points scored is 50.5 via SportsLine consensus. Before making any Louisville vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Louisville vs. Miami. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Miami vs. Louisville:Louisville vs. Miami                                                                 spreadMiami -13.5 at DraftKings SportsbookLouisville vs. Miami                                                                           over/under50.5 pointsLouisville vs. Miami                                                                           money line Miami -562, Louisville +414Louisville vs. Miami                                                                   picksSee picks at SportsLineLouisville vs. Miami                                                                     streaming Fubo (Try for free)  Why Miami can coverBeck has led the Hurricanes' offensive attack in his first season with the program after four years at Georgia, completing 102 of 139 passes (73.4%) for 1,213 yards and 11 touchdowns with three interceptions in five games. He has also rushed for one touchdown. In last week's win over Florida  State, he completed 20 of 27 passes (74.1%) for 241 yards and four touchdowns. In a 49-12 win over South Florida on Sept. 13, he completed 23 of 28 passes (82.1%) for 340 yards and three touchdowns with two interceptions. He also rushed six times for 28 yards and a score. Also leading the Miami offense is junior running back Mark Fletcher Jr. He has carried 78 times for 428 yards (5.5 average) and five touchdowns. He also has five receptions for 53 yards. In a 26-7 win over Florida on Sept. 20, he rushed 24 times for 116 yards and one touchdown. He carried 16 times for 120 yards and two touchdowns in the win over USF. See which team to back at SportsLine. Why Louisville can coverFormer USC quarterback Miller Moss is Louisville's signal caller. The transfer senior, who played four years with the Trojans, has completed 120 of 179 passes (67%) for 1,358 yards and seven touchdowns with four interceptions for a 139.2 rating. In last week's loss to No. 24 Virginia, he completed 34 of 48 passes (70.8%) for 329 yards and two touchdowns with one interception. He also rushed for one touchdown.His top target is senior wide receiver Chris Bell. In five games, he has 35 receptions for 502 yards (14.3 average) and four touchdowns. In the loss to Virginia, he caught 12 passes for 170 yards (14.2 average) and two touchdowns. In a 34-27 win over Pittsburgh on Sept. 27, he caught 10 passes for 135 yards and one score. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Miami vs. Louisville picksSportsLine's model is going Over on the total, projecting 64 combined points. It also says one side of the spread hits in nearly 70% of simulations.     You can only get the pick at SportsLine. So who wins Miami vs. Louisville, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Louisville vs. Miami spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisville vs. Miami odds, picks, predictions from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/70d3083c-b52c-4bbc-ba2b-cc3a282f519c/thumbnail/1200x675/d7e52b33269c4291aabc1808442dcf47/carson-beck-miami-hurricanes-quarterback-cbs.jpg"
      ],
      "datePublished": "2025-10-17T11:12:25.000Z",
      "dateModified": "2025-10-17T11:12:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Don't bury the Bengals just yet: With Joe Flacco, there's a path to win the AFC North - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dont-bury-the-bengals-just-yet-with-joe-flacco-theres-a-path-to-win-the-afc-north/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/73cbd409-9f63-4e65-a2a4-0ece6ce3a4b2/thumbnail/1200x675/d61fa41865194e22431cfea501905730/untitled-design-2025-10-16t235549-440.png",
    "tag": "Sports",
    "date": "2025-10-17T07:02:34.000Z",
    "description": "\n        CINCINNATI -- The Cincinnati Bengals are officially back from the dead. Ten days ago, their season was on life support and it looked like thi",
    "body": "\n        CINCINNATI -- The Cincinnati Bengals are officially back from the dead. Ten days ago, their season was on life support and it looked like things were about to take a turn for the worse, but then the front office decided to do something crazy: They made a deal for Joe Flacco. It was the biggest in-season trade in franchise history and the gamble is already paying off. The 40-year-old quarterback led the Bengals to a stunning 33-31 win over the Pittsburgh Steelers on Thursday night. Flacco somehow managed to throw for 342 yards and three touchdowns despite the fact that he had only participated in a total of five practices going into the game. That's like winning the Indianapolis 500 five days after you get your driver's license. Flacco didn't know all the play calls, he had trouble communicating with Zac Taylor at times and Ja'Marr Chase still hasn't really gotten to practice with his new quarterback, but somehow, it all worked. Chase went off for 161 yards and a touchdown on a night where he caught a franchise record 16 passes. \nFollowing the game, the Bengals star receiver was asked why he already has so much chemistry with Flacco and the usually talkative Chase had no explanation. \"That's a good question, I don't know,\" Chase said. The receiver noted that the two guys haven't really practiced much together because Chase missed some practice time last week due to an illness, and this week, the Bengals only held walk-through practices heading into Thursday's game. In this new upside down world that the Bengals occupy, maybe not practicing together is actually helping, but whatever it is, the two definitely already have a connection. Over the past few days, Flacco made it clear that his goal was going to be to get the ball to Chase and Tee Higgins as often as possible and he came through on that one. He targeted Chase and Higgins with 33 of his 47 passes. (Higgins caught six passes for 96 yards and a touchdown.) \nWith the Bengals passing game firing on all cylinders, that opened up other things for the offense. Going into Week 7, the Bengals were averaging just 56.7 yards per game on the ground, which was the worst number in the NFL. With the Steelers living in fear of Flacco's right arm, that opened things up for Chase Brown, who topped 100 yards rushing for just the second time in his career. \nThe run above went for 37 yards, which is mostly notable, because the Bengals didn't have a single run of more than 15 yards through the first six weeks of the season, but then Flacco showed up and everything suddenly started working. As a team, the Bengals rushed for 142 yards, which was their highest total since Week 18 of the 2023 season. Brown came through with 108 of those.  \nThe Bengals offense was working so well that even their broken plays were gaining big chunks. The most shocking play of the game came in the fourth quarter when Flacco gained 12 yards after making the decision to keep the ball on a zone read. \n\"We were not aligned correctly. I don't know why,\" Taylor said. \"It was a zone read that never in a million years we would keep. ... I was shocked.\"Broken plays have a tendency to happen when you have a quarterback who's only been with the team for nine days. They also happen when the quarterback can't understand everything his coach is saying. \n\"I got to do a better job enunciating, I think my Oklahoma accent got him a couple of times, but I thought he did a great job managing the game,\" Taylor said. If this is how the Bengals are playing when Flacco is still learning the offense (and his coach's accent), he'll likely only get better once he has a few more practices under his belt. When the Bengals offense is working, it's one of the best in the NFL, and right now, it's working. The Steelers were 4-1 going into Thursday's game and if they had won, it would have given them a chance to run away with the AFC North, but instead, the 3-4 Bengals are right back in it. \nAre the Bengals one of the best teams in the NFL? No, but they don't have to be, they just have to be the best team in a bad division and they can certainly pull that off. If you're wondering how interesting things might get in the AFC North race, just look at the next four weeks for both the Bengals and Steelers: Bengals: Jets, Bears, bye, at SteelersSteelers: Packers, Colts, at Chargers, BengalsBy the time these two teams meet again in Week 11, first place in the AFC North could be on the line. The Bengals also have the advantage of having the second-easiest remaining strength of schedule. Five of their final 10 games will be coming against teams that currently have zero or one win. There's a reason Mike Tomlin didn't like the Flacco trade and there's a reason he was mad at Browns general manager Andrew Berry for making it: The Browns threw the Bengals a lifeline. \nThe Bengals season was sinking and it was going down fast, but then the Browns came through and saved the day. Tomlin was clearly upset about the trade earlier this week, but in Cincinnati, fans were thanking the Browns for sending them Flacco. \nNo one in the city of Cincinnati has ever thanked anyone in Cleveland for anything ever, so you know someone messed up when Bengals fans are sending thanks to northeast Ohio. Bengals kicker Evan McPherson, who booted through the game-winning field goal from 36 yards out with seven seconds left to play, might have given the best explanation for why Flacco means so much to the team. \n\"I love Joe,\" McPherson said. \"I love his attitude and what he brings to the team. He's done a really good job connecting with guys on really short notice.\"The AFC North is officially up for grabs and the Bengals might be able to steal it, and it's all thanks to Joe Flacco -- and the Browns for sending him to Cincinnati. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Don't bury the Bengals just yet: With Joe Flacco, there's a path to win the AFC North - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/73cbd409-9f63-4e65-a2a4-0ece6ce3a4b2/thumbnail/1200x675/d61fa41865194e22431cfea501905730/untitled-design-2025-10-16t235549-440.png"
      ],
      "datePublished": "2025-10-17T07:02:34.000Z",
      "dateModified": "2025-10-17T07:02:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 7 picks, odds, best bets: Mike Vrabel wins revenge game vs. Titans, Dillon Gabriel scores first win - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-7-picks-mike-vrabel-wins-revenge-game-vs-titans/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/df625dd4-0a6f-4eb3-bb6b-6e5de74a4bd1/thumbnail/1200x675/ea5223d8f41d3fb11d16acc70dc4be18/mike.jpg",
    "tag": "Sports",
    "date": "2025-10-17T11:25:11.000Z",
    "description": "\n        Despite a down week, I still hold the No. 1 spot at CBS Sports with a 52-41 against-the-spread mark. However, I'm not dominating my best bets",
    "body": "\n        Despite a down week, I still hold the No. 1 spot at CBS Sports with a 52-41 against-the-spread mark. However, I'm not dominating my best bets, as the Denver Broncos struggled with the New York Jets in London, the Carolina Panthers are apparently unbeatable at home and the Indianapolis Colts couldn't cover the spread vs. the Arizona Cardinals. This week, we will see if the Tennessee Titans get an interim coach bump against their former lead man, Mike Vrabel, as he leads the New England Patriots into Nashville, the New York Giants look to build on their momentum against the Broncos, and Baker Mayfield aims to further his MVP case against the Detroit Lions. We also get another Monday night double-header, if you're into those. Here's a look at what I'm thinking for Week 7. As always, credit to the CBS Sports research team for making me sound smart. Odds via FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 bet:\nTop five picks ATS record: 12-18Overall ATS record: 52-41Straight up record: 61-31-1New England Patriots (-7) at Tennessee TitansSunday, 1 p.m. ET (CBS, Stream on Paramount+)\nSince 2015, teams that fire their head coach midseason are 13-12 in their next game. Titans owner Amy Adams Strunk is clearly hoping for that \"interim bump\" against Mike Vrabel, but I can't bring myself to bet on this Titans squad. One coach for the Las Vegas Raiders told The Athletic's Michael Silver this week that the Titans may be the worst team they have seen in the last 25 years. Four of Tennessee's five losses have come by double digits, and the Titans have covered the spread just once according to the lines I've included in this column. The Patriots hold first place in the AFC East for the first time since 2021, are clearly playing good football and Vrabel is motivated to win on his former home field. The Titans on the other hand haven't shown much promise, and could be down their top three pass rushers on Sunday plus WR1 Calvin Ridley. Vrabel beats his former team, but does so respectfully. \nThe pick: Titans -7Projected score: Titans 27-17Miami Dolphins at Cleveland Browns (-2.5)Sunday, 1 p.m. ET (CBS, Stream on Paramount+)\nThe Browns have been included in my best bets plenty this year, but usually because I'm fading them. This time, I'm backing them. This Miami defense allows 389.3 yards of total offense, which ranks third-worst in the NFL, and 29 points per game, which ranks fourth-worst in the NFL. Then, the run defense ranks dead last with 168.5 rushing yards surrendered per game, so Quinshon Judkins should be able to find success.This is the first time the Browns have been favored in a game since Week 11 last year, but I think it's warranted. Not only are the Dolphins bad, but Tua Tagovailoa may have rubbed teammates the wrong way by randomly bringing up that some have been late to players-only meetings. It's just more negative attention for a head coach and a franchise that doesn't need it. This is the Browns' first home game since Week 3, when they upset Jordan Love and the Green Bay Packers. Dillon Gabriel scores his first career victory this Sunday. The pick: Browns -2.5Projected score: Browns 20-17Indianapolis Colts at Los Angeles Chargers (-1.5)Sunday, 4:05 p.m. ET (CBS, Stream on Paramount+)\nThis week, the Colts are looking to avenge their lone loss of the season, which came to the Rams in SoFi Stadium. This time, Indiana Jones is taking on the Chargers in SoFi Stadium, who have struggled a bit as of late. L.A. was upset by Jaxson Dart in his first NFL start in Week 4, got upset again by the Washington Commanders and Bill Croskey-Merritt the following week, then needed a game-winning drive to defeat the lowly Dolphins last week.\nKimani Vidal had 124 yards rushing in place of Omarion Hampton, but that came against a Dolphins defense that ranks dead last against the run. Justin Herbert is still dealing with an injured offensive line, but we will get more clarity on that Friday afternoon. The Colts lead the NFL in points per game (32.3) and point differential per game (+13) this season. If they want to be talked about as a legitimate AFC contender, they need to win this game.The pick: Colts +1.5Projected score: Colts 28-24New York Giants at Denver Broncos (-7)Sunday, 4:05 p.m. ET (CBS, Stream on Paramount+)\nThe Broncos are coming off a disgusting win in London with no bye week and an offense that looks disjointed, while the Giants are coming off a mini bye following a statement blowout victory over the Philadelphia Eagles, yet the Broncos are favored by a whole touchdown? I think that's too much. The Giants have registered two wins while being an underdog of at least five points in just the last three weeks!\nDenver has won three straight games following a 1-2 start, but only one of those victories was relatively impressive. The Broncos punked the hapless Cincinnati Bengals, had a comeback win over the struggling Eagles and then defeated the winless Jets by just two points. Justin Fields had negative 10 net passing yards and still had his team within two points.Jaxson Dart and Cam Skattebo are the dynamic duo the Giants deserve. As long as they don't turn the ball over on five straight drives like in Week 5, I say this game will be close. The pick: Giants +7Projected score: Broncos 24-20Washington Commanders (-1.5) at Dallas CowboysSunday, 4:25 p.m. ET (Fox, Stream: Fubo, try for free)\nYes, the Cowboys have the worst defense in the NFL as the only unit to allow more than 400 yards of total offense per game, but there are three reasons why I'm falling into the Dallas trap yet again. \nDak Prescott is 6-0 with 17 passing touchdowns and zero interceptions in his career vs. the Commanders at home, and Dallas is averaging 41.3 points per game in those contests. He is also 34-9 SU and 30-12-1 ATS in his career vs. the NFC East. CeeDee Lamb is set to make his return to the lineup after missing three games with an ankle injury. It's going to be fun to see him play alongside George Pickens, who has been on fire. Washington's injury report is worrisome. Deebo Samuel (heel) and Terry McLaurin (quad) did not practice on Thursday, nor did defensive end Dorance Armstrong (hamstring). Jayden Daniels will still be able to move the ball vs. a bad defense, but if Washington loses the turnover battle in grandiose fashion like it did on Monday night, Dallas definitely wins this game. The pick: Cowboys +1.5Projected score: Cowboys 31-30Other Week 7 picksSteelers 21-17 over Bengals (+5.5)Rams (-3) 24-18 over JaguarsEagles (-2.5) 27-21 over VikingsChiefs 28-19 over Raiders (+11.5)Bears 23-21 over Saints (+4.5)Panthers (-1.5) 17-14 over JetsPackers 22-20 over Cardinals (+6.5)Falcons (+1.5) 21-20 over 49ersLions (-5.5) 31-24 over BuccaneersSeahawks 20-17 over Texans (+3.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 7 picks, odds, best bets: Mike Vrabel wins revenge game vs. Titans, Dillon Gabriel scores first win - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/df625dd4-0a6f-4eb3-bb6b-6e5de74a4bd1/thumbnail/1200x675/ea5223d8f41d3fb11d16acc70dc4be18/mike.jpg"
      ],
      "datePublished": "2025-10-17T11:25:11.000Z",
      "dateModified": "2025-10-17T11:25:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prisco's Week 7 NFL picks: Lions slip past Bucs in NFC showdown, Jaguars top Rams in London - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/pete-priscos-week-7-nfl-picks-odds-best-bets-steelers-bengals-lions-buccaneers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/17fb94aa-4b40-4318-8762-aac679dc88ea/thumbnail/1200x675/a65d5a6bbd9f10642de2ff94c7682752/amon-ra-st-brown-jared-goff-lions-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-17T11:27:26.000Z",
    "description": "\n        The picks have leveled off some after a good start, which is never a good thing.I went 6-9 against the spread last week and 9-6 straight up. ",
    "body": "\n        The picks have leveled off some after a good start, which is never a good thing.I went 6-9 against the spread last week and 9-6 straight up. That's not good considering the first five weeks of the season had me nicely above .500 for both. The 6-9 ATS record felt a lot worse, too. It just wasn't pretty. That brings my ATS record to 49-44 on the season -- still above .500 in a tough year -- and my straight-up record is now 66-26-1.It's not good. It's not bad. It just is. So let's hope the string of mediocrity changes this week. I do like the card, so let's go.Bet NFL Week 7 games and NFL odds at DraftKings, where new users who win a $5 wager get $300 in bonus bets and 3 free months of NBA League Pass: Click here to get started:Los Angeles Rams vs. Jacksonville Jaguars (+3), in LondonSunday, 9:30 a.m. on NFL Network (Stream: Fubo -- try for free)\nThe Rams beat the Ravens last week, while the Jaguars lost to the Seahawks. The Seattle line sacked Trevor Lawrence seven times in that game. The Rams' defensive front has to be licking its chops. The Los Angeles offense will be without Puka Nacua, its best receiver. That matters. The Jaguars will pull one out late. Pick: Jaguars 24, Rams 21 | Odds via BetMGMCarolina Panthers at New York Jets (+2)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Panthers head out on the road as favorites for the first time since 2022. The Jets are winless, so there's the reason. They also haven't played well. The Panthers are physical on both lines, but I think the Jets will be up to it. They will limit the run game and win with their defense.  Pick: Jets 20, Panthers 17 | Odds via Caesars SportsbookLas Vegas Raiders at Kansas City Chiefs (-11.5)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nThe Chiefs are big favorites here for a reason. They are getting the offense cranked up and will have Rashee Rice back to add to it. The Raiders have defensive issues, which Patrick Mahomes will use to his advantage. Geno Smith won't keep up and will continue to turn it over. Chiefs big.   Pick: Chiefs 35, Raiders 20 | Odds via FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 bet:Miami Dolphins at Cleveland Browns (-2.5)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nThis is the dog game of the day between two bottom feeders. The Browns haven't done much on offense with Dillon Gabriel playing, but the Dolphins defense will be the perfect tonic. They can't stop anybody. The Browns defense can. That's the difference. Pick: Browns 26, Dolphins 23 | Odds via DraftKings SportsbookNew England Patriots at Tennessee Titans (+7)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nFormer Titans coach Mike Vrabel takes his Patriots team to Nashville to play his old team. The Titans are reeling having fired coach Brian Callahan this week. They aren't playing well, but New England is for sure. But this is a third straight road game for the Patriots. That's tough. Titans will hang around as they get the interim-coach bump.Pick: Patriots 23, Titans 19 | Odds via Caesars Sportsbook\n        \n            \n                NFL Week 7 picks and score predictions: Bengals shock Steelers, Rams top Jaguars in London\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nNew Orleans Saints at Chicago Bears (-5.5)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Bears are 3-2 coming off an impressive road victory against the Commanders. Caleb Williams is playing good football for Chicago. The Saints have hung around in games and Spencer Rattler is coming off a good game last week. But this will be the Bears pulling it out in the second half behind Williams. Pick: Bears 27, Saints 20 | Odds via BetMGMPhiladelphia Eagles at Minnesota Vikings (+2.5)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Eagles have lost two straight and just don't look right. The Vikings are coming off a bye, and might have quarterback J.J. McCarthy back. If not, it's Carson Wentz. It doesn't matter. This will come down to the Eagles getting Saquon Barkley going and he will run through the Vikings. Eagles will win a tight one.   Pick: Eagles 24, Vikings 22 | Odds via Caesars Sportsbook, where new users get 20 100% profit boosts with the code CBS20X:Indianapolis Colts at Los Angeles Chargers (-1.5)Sunday, 4:05 p.m. on CBS (Stream on Paramount+)\nThis is an enormous game for these two, and especially a prove-it game for the Colts since they have played a softer schedule. They have been impressive, but this will be a challenge. I think the Chargers and Justin Herbert will be up to it. This will be fun to watch with a lot of points.Pick: Chargers 34, Colts 27 | Odds via BetMGMNew York Giants at Denver Broncos (-7)Sunday, 4:05 p.m. on CBS (Stream on Paramount+)\nThe Giants are rested after beating the Eagles last Thursday, while Denver is back from a trip overseas. Advantage, Giants. But this will be a tough test for Giants rookie quarterback Jaxson Dart. The Denver defense leads the NFL in sacks. That will be the difference as they speed him up and force turnovers.   Pick: Broncos 28, Giants 16 | Odds via DraftKings SportsbookGreen Bay Packers (-6.5) at Arizona CardinalsSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\nThere is a good chance this could be Jacoby Brissett starting again for the injured Kyler Murray at quarterback. Brissett played well last week in the loss to the Colts, but this Green Bay defense will be a tougher test. Look for the Green Bay offense to get it going in the passing game as well. Packers win it. Pick: Packers 31, Cardinals 23 | Odds via Caesars SportsbookWashington Commanders (-1.5) at Dallas CowboysSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\nBoth of these teams are coming off tough losses, while the Commanders are playing on a short week out on the road. That's tough to do. But the Dallas defense is so bad right now that it won't matter. This will be a shootout, but the Commanders and Jayden Daniels will get the best of it against Dak Prescott. Pick: Commanders 34, Cowboys 30 | Odds via FanDuel SportsbookAtlanta Falcons at San Francisco 49ers (-2.5)Sunday, 8:20 p.m. on NBC (Stream: Fubo -- try for free)\nThe Falcons are on a short week having played Monday, but the 49ers are so banged up. There is a chance Brock Purdy can be back after missing the past two games with a toe injury. That matters. The Falcons have a fierce pass rush these days, so that will challenge Kyle Shanahan to call a game to minimize it. I think he does, and the 49ers take advantage of a team on the road on a short week.   Pick: 49ers 23, Falcons 19 | Odds via FanDuel SportsbookTampa Bay Buccaneers (+5.5) at Detroit LionsMonday, 7 p.m. ET on ABC (Stream: Fubo -- try for free)\nThis is a big game in terms of NFC dominance. Both teams have a lot of injury issues, yet they have fought through them. The Bucs are the top seed right now in the NFC because of Baker Mayfield. With Jared Goff also rolling up big numbers, this has the look of a game with a lot of points. I see the Lions winning a close one.Pick: Lions 35, Buccaneers 34 | Odds via DraftKings SportsbookHouston Texans at Seattle Seahawks (-3.5)Monday, 10 p.m. ET on ESPN (Stream: Fubo -- try for free)\nThe Seahawks looked dominant in their win at Jacksonville last week, especially on defense. Quarterback Sam Darnold also continues to play well, but he will face a tough Houston defense. The Texans are off a bye, so they are rested. But I think this will come down to the Seattle front getting the best of the Houston offensive line. Poor C.J. Stroud.   Pick: Seahawks 23, Texans 17 | Odds via DraftKings Sportsbook\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prisco's Week 7 NFL picks: Lions slip past Bucs in NFC showdown, Jaguars top Rams in London - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/17fb94aa-4b40-4318-8762-aac679dc88ea/thumbnail/1200x675/a65d5a6bbd9f10642de2ff94c7682752/amon-ra-st-brown-jared-goff-lions-cbs.jpg"
      ],
      "datePublished": "2025-10-17T11:27:26.000Z",
      "dateModified": "2025-10-17T11:27:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/c86c3b3d-53b1-4ffd-bfb8-b58b0218887e/thumbnail/1200x675/2ab193cebefa6f0053d9da8c835400d5/mlb-bracket-lcs.jpg",
    "tag": "Sports",
    "date": "2025-10-17T03:31:50.000Z",
    "description": "\n        The Los Angeles Dodgers are just one win away from the 2025 World Series. The Dodgers took Game 3 from the Milwaukee Brewers on Thursday, put",
    "body": "\n        The Los Angeles Dodgers are just one win away from the 2025 World Series. The Dodgers took Game 3 from the Milwaukee Brewers on Thursday, putting them up 3-0 in the NLCS. Tyler Glasnow allowed just one run in 5 ⅔ innings and Mookie Betts and Tommy Edman drove in enough runs for the bullpen to hold. If they win Friday, they're in.The Toronto Blue Jays, meanwhile, have tied up the ALCS with a big Game 4 win against the Seattle Mariners Thursday night. That guarantees the series will head back to Toronto for at least one more game.The Mariners punched their ticket to their first ALCS since 2001 last week by eliminating the Tigers in 15 innings in a winner-take-all ALDS Game 5. The Blue Jays knocked out the Yankees in the ALDS. The Dodgers, meanwhile, took out the Phillies in four games in the NLDS, and the Brewers got past the Cubs in five games.The LCS round could wrap up as early as this weekend, and the 2025 World Series begins on Oct. 24. Below is a look at the full 2025 MLB playoff bracket.\n   2025 MLB playoff bracket   \n                                                                    Keytron Jordan, CBS Sports\n                                                               2025 MLB playoff schedule, TV channel   All games on ESPN, ABC, Fox and FS1 are streaming on fubo (Try for free). All times Eastern.   * = if needed      Championship Series   Sunday, Oct. 12   ALCS Game 1: Mariners 3, Blue Jays 1 Monday, Oct. 13   ALCS Game 2: Mariners 10, Blue Jays 3   NLCS Game 1: Dodgers 2, Brewers 1 Tuesday, Oct. 14   NLCS Game 2: Dodgers 5, Brewers 1Wednesday, Oct. 15   ALCS Game 3: Blue Jays 13, Mariners 4Thursday, Oct. 16   NLCS Game 3: Dodgers 3, Brewers 1 (Los Angeles leads 3-0)   ALCS Game 4: Blue Jays 8, Mariners 2 (Series tied 2-2)\nFriday, Oct. 17   ALCS Game 5: Mariners vs. Blue Jays, 6:08 p.m. | FS1/fuboNLCS Game 4: Dodgers vs. Brewers, 8:38 p.m. | TBSSaturday, Oct. 18   NLCS Game 5*: Dodgers vs. Brewers, 8:08 p.m. | TBSSunday, Oct. 19   ALCS Game 6: Blue Jays vs. Mariners, 8:03 p.m. | FS1/fuboMonday, Oct. 20   NLCS Game 6*: Brewers vs. Dodgers, 5:08 p.m. | TBS   ALCS Game 7*: Blue Jays vs. Mariners, 8:08 p.m. | Fox/fuboTuesday, Oct. 21   NLCS Game 7*: Brewers vs. Dodgers, 8:08 p.m. | TBS   World Series      Friday, Oct. 24   World Series Game 1   Saturday, Oct. 25   World Series Game 2   Monday, Oct. 27   World Series Game 3   Tuesday, Oct. 28   World Series Game 4   Wednesday, Oct. 29   World Series Game 5*   Friday, Oct. 31   World Series Game 6*   Saturday, Nov. 1   World Series Game 7*      Division Series results      Saturday, Oct. 4   NLDS Game 1: Brewers 9, Cubs 3    ALDS Game 1: Blue Jays 10, Yankees 1    NLDS Game 1: Dodgers 5, Phillies 3    ALDS Game 1: Tigers 3, Mariners 2 (11)    \nSunday, Oct. 5   ALDS Game 2: Blue Jays 13, Yankees 7    ALDS Game 2: Mariners 3, Tigers 2    Monday, Oct. 6   NLDS Game 2: Dodgers 4, Phillies 3    NLDS Game 2: Brewers 7, Cubs 3    Tuesday, Oct. 7   ALDS Game 3: Mariners 8, Tigers 4    ALDS Game 3: Yankees 9, Blue Jays 6   \nWednesday, Oct. 8   ALDS Game 4: Tigers 9, Mariners 3   NLDS Game 3: Cubs 4, Brewers 3    ALDS Game 4: Blue Jays 5, Yankees 2 (Toronto wins series 3-1)   NLDS Game 3: Phillies 8, Dodgers 2   Thursday, Oct. 9   NLDS Game 4: Dodgers 2, Phillies 1 (11) (Los Angeles wins series 3-1)    NLDS Game 4: Cubs 6, Brewers 0 (Series tied 2-2)   Friday, Oct. 10   ALDS Game 5: Mariners 3, Tigers 2 (15) (Seattle wins series 3-2)   \nSaturday, Oct. 11   NLDS Game 5: Brewers 3, Cubs 1 (Milwaukee wins series, 3-2)      Wild Card Series scores   Tuesday, Sept. 30   AL Wild Card Series Game 1: Tigers 2, Guardians 1   NL Wild Card Series Game 1: Cubs 3, Padres 1    AL Wild Card Series Game 1: Red Sox 3, Yankees 1    NL Wild Card Series Game 1: Dodgers 10, Reds 5   Wednesday, Oct. 1   AL Wild Card Series Game 2: Guardians 6, Tigers   NL Wild Card Series Game 2: Padres 3, Cubs 0   AL Wild Card Series Game 2: Yankees 4, Red Sox 3   NL Wild Card Series Game 2: Dodgers 8, Reds 4 (Los Angeles wins 2-0)   \nThursday, Oct. 2   AL Wild Card Series Game 3: Tigers 6, Guardians 3 (Detroit wins 2-1)   NL Wild Card Series Game 3: Cubs 3, Padres 1 (Chicago wins 2-1)   AL Wild Card Series Game 3: Yankees 4, Red Sox 0 (New York wins 2-1)   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/c86c3b3d-53b1-4ffd-bfb8-b58b0218887e/thumbnail/1200x675/2ab193cebefa6f0053d9da8c835400d5/mlb-bracket-lcs.jpg"
      ],
      "datePublished": "2025-10-17T03:31:50.000Z",
      "dateModified": "2025-10-17T03:31:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Max Scherzer turns back the clock in ALCS Game 4, just when the Blue Jays needed him the most - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/max-scherzer-turns-back-the-clock-in-alcs-game-4-just-when-the-blue-jays-needed-him-the-most/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/fb5039d0-d0dd-4017-ba2e-4e00f9d8d13a/thumbnail/1200x675/f355aaf23a9970f6d35461add0271171/scherzer-getty.png",
    "tag": "Sports",
    "date": "2025-10-17T04:28:24.000Z",
    "description": "\n        With the Toronto Blue Jays having evened the series in the best-of-seven ALCS at two games apiece, a trend is starting to emerge. The Seattle",
    "body": "\n        With the Toronto Blue Jays having evened the series in the best-of-seven ALCS at two games apiece, a trend is starting to emerge. The Seattle Mariners won both games in Toronto and the Blue Jays have, so far, won the first two games in Seattle, including Thursday night's 8-2 victory (box score). Yes, the road team has won every single game. We've seen a road team win all seven games twice before in seven-game series. The 2023 ALCS and the 2019 World Series. You know who was on that 2019 Nationals team that won it all? Max Scherzer. He took the ball for the Blue Jays in Game 4, hoping to help the Jays avoid falling behind 3-1 in the series. And though vintage Mad Max isn't really there anymore, the 41-year-old truly turned back the clock Thursday night, enough to gut out the win.The final line was less impressive than he actually looked for the last several innings, thanks to a stranded runner coming around to score after Scherzer's departure, though it was still plenty good: 5 ⅔ IP, 3 H, 2 ER. \nAgain, though, it was more than the numbers. It was Max Freaking Scherzer. Mad Max.We've all seen his facial expressions and mannerisms on the mound long enough to recognize them. He was all but breathing fire on the mound from his first pitch. He paced around the mound after getting swings and misses. There was a lout outburst after an inning-ending strikeout of Eugenio Suárez. And, of course, there was manager John Schneider having the audacity to go out and check on Mad Max with two outs in the fifth. \n\"I've been waiting for that all year, for Max to yell at me on the mound,\" Schneider said after the game. \"I think at that point there's numbers, there's projections, there's strategy, and there's people. So I was trusting people.\"...I thought he was going to kill me. It was great.\"Scherzer would strike the next hitter out. The intensity was on full display. \nScherzer's numbers, the ones Schneider was talking about, screamed \"don't start me\" in this game. Once he gutted through the fifth inning, there was no reason to send him back out for the sixth. Any number cruncher would've said get him out of the game. Just watching Scherzer, though, you could feel that maybe, just maybe, they could squeeze another few outs out of him. Maybe it was emotion. Maybe it was yearning for the past with Prime Scherzer. He just gave off that vibe. The numbers weren't with Scherzer. But his manager was.He is 41 years old. He had a 9.00 ERA in his last five starts of the regular season. He hadn't pitched in a game since Sept. 24 and wasn't even on the ALDS roster. He wasn't supposed to do this against a good Mariners offense. \nAnd yet, the longer he stayed on that mound Thursday, the closer he looked to Prime Scherzer. He got in trouble in the first and a double play got him out of it. He allowed a solo homer to start the second. He had no strikeouts through 2 ⅔. He ended with five strikeouts through 5 ⅔ innings. He only threw his curveball 10 times, but he got 10 swings on it, including six whiffs. On the 20 swings he drew with his four-seam fastball, 12 were foul balls. Some out there -- myself included, admittedly -- thought it was a mistake for the Blue Jays to trust Scherzer for many outs in a game that they needed to win. Schneider saw something, though. \n\"I think everyone in the dugout was kind of waiting for that moment,\" Schneider said after the game. \"When you sign Max Scherzer, you're kind of waiting for that moment. So it definitely gave us a little bit of a jolt when he came in. And all that aside, I'm just really -- I'm proud of the way Max has handled everything, from getting himself right physically, being left off the roster last series against the Yankees and handling it like a pro, and then coming out and performing like this. So that was big for everyone going forward.\"After 18 seasons in the majors, Scherzer knew how he felt and trusted, like his manager, what he was capable of.\"It was a pitching moment in the game right there. It was just a situation. I was going through it in my head. I understood where the game state was, knew how I wanted to attack, and then all of a sudden I saw Schneids coming out, and I kind of went 'woah, woah, woah.' Like, I'm not coming out of this ball game. I feel too good,\" Scherzer said after the game.\n\"So we had a little conversation that basically I wanted to stay in the ball game but just with some other words involved. I just knew I was strong, I knew I wanted the ball, I knew I could get outs in this situation. I just wanted to stay in. I wanted it.\"This wasn't Babe Ruth allegedly calling his shot or anything that dramatic, but Scherzer did lay it out. He said he needed to find a way to navigate the game. He did exactly that for his 17 outs of work.None of this is surprising, of course. Scherzer has won three Cy Young awards and two World Series titles. In the regular season, he's won 221 games and struck out nearly 3,500 hitters. In 143 playoff innings before Game 4, he had 171 strikeouts and seven wins. \nIn Game 4, he recorded his first postseason win since 2019. You know, that same year that Scherzer and his Nationals won four road games to take the World Series. The Blue Jays, after starting in a 2-0 hole, are halfway there in the 2025 ALCS. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Max Scherzer turns back the clock in ALCS Game 4, just when the Blue Jays needed him the most - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/fb5039d0-d0dd-4017-ba2e-4e00f9d8d13a/thumbnail/1200x675/f355aaf23a9970f6d35461add0271171/scherzer-getty.png"
      ],
      "datePublished": "2025-10-17T04:28:24.000Z",
      "dateModified": "2025-10-17T04:28:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Commanders sign Treylon Burks: Washington reportedly adds former first-round WR to boost thin group - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-sign-treylon-burks-washington-reportedly-adds-former-first-round-wr-to-boost-thin-group/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/ab2f5ecd-d980-4f40-9890-2c67a2cd6961/thumbnail/1200x675/3979de78d6dc9356cceaaa6a32ebdef7/tre.jpg",
    "tag": "Sports",
    "date": "2025-10-16T22:47:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Washington Commanders are taking a flier on a ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Washington Commanders are taking a flier on a former first-round pick at wide receiver, as NFL Media reports they plan to sign Treylon Burks to the practice squad. Given all of the injuries Washington has seen at receiver recently, Burks, who spent his entire career with the Tennessee Titans before being waived earlier this month, could be elevated quickly.Commanders star wideout Terry McLaurin has missed the last three games with a quad injury, and did not practice on Thursday after being limited on Wednesday. Deebo Samuel is also dealing with a heel injury that has held him out of practice this week, and Noah Brown was recently placed on injured reserve. \n        \n            \n                Predicting overreactions for NFL Week 7: Trey Hendrickson done with Bengals? Commanders miss playoffs?\n                \n                    Jeff Kerr                \n            \n                            \n    \n                \n                    \n    \nSamuel played through the heel injury on Monday night during Washington's 25-24 loss to the Chicago Bears. He caught four passes for just 15 yards. Chris Moore was actually the Commanders' leading receiver in Week 6 with 46 yards and a touchdown on three receptions. Moore, Luke McCaffrey and rookie Jaylin Lane have been called upon to step up in the past few weeks.\nDespite the thin receiver corps, the Commanders, now 3-3 on the year, are 1.5-point road favorites (via FanDuel) against the Dallas Cowboys on Sunday. Burks reportedly visited with Washington this week. The former No. 18 overall pick cleared waivers earlier this month after Tennessee parted ways with him following three unproductive seasons. He has played just 27 career games, and caught 53 passes for 699 yards and one touchdown. Burks has struggled to stay on the field, having never played more than 11 games in a single season. He tore his ACL in practice late last season, then broke his collarbone in training camp just three months ago. \nThe 25-year-old pass-catcher certainly needed a change of scenery, and could potentially get his career on track in Washington. Burks has legitimate size at 6-foot-2, 225 pounds, and was a versatile playmaker during his days at the University of Arkansas.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Commanders sign Treylon Burks: Washington reportedly adds former first-round WR to boost thin group - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/ab2f5ecd-d980-4f40-9890-2c67a2cd6961/thumbnail/1200x675/3979de78d6dc9356cceaaa6a32ebdef7/tre.jpg"
      ],
      "datePublished": "2025-10-16T22:47:40.000Z",
      "dateModified": "2025-10-16T22:47:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals vs. Steelers: Ja'Marr Chase becomes first NFL player in 28 years to pull off this improbable feat - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-vs-steelers-jamarr-chase-becomes-first-nfl-player-in-28-years-to-pull-off-this-improbable-feat/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/99182782-4fd6-4f81-a34e-b752648ae3a0/thumbnail/1200x675/197975ff2731170b08d85d277c45e5b2/untitled-design-2025-10-16t200218-015.png",
    "tag": "Sports",
    "date": "2025-10-17T03:08:41.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        CINCINNATI -- Ja'Marr Chase has been forced to cat",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        CINCINNATI -- Ja'Marr Chase has been forced to catch passes from three different quarterbacks this year, and so far, that hasn't slowed him down. The Cincinnati Bengals star receiver, who won the triple crown last season, is making history once again this year. Through three quarters against the Steelers, Chase has caught 12 passes for 109 yards. That makes Chase just the second receiver in NFL history to have a 100-yard receiving game with three different starting quarterbacks through the first seven games of a team's season. The only other receiver to pull it off was Jimmy Smith, who accomplished the feat with the Jacksonville Jaguars in 1997. (His quarterbacks were Rob Johnson, Steve Matthews and Mark Brunell.) As for Chase, he hit the 100-yard mark with Flacco on Thursday night against the Steelers. Before hitting 100 yards, Chase opened up the scoring for the Bengals in the second quarter with a short touchdown catch. \nBesides Flacco, Chase has also had a 100-yard receiving game with both Joe Burrow and Jaken Browning as his starting quarterbacks this season. In Week 2, Burrow was the starter and although he didn't finish the game, Chase went off for 165 yards in a 31-27 win over the Jaguars. In Week 5, Browning was his starter and he finished with 110 yards in a 37-24 loss to the Lions. The Bengals' season started with Burrow at quarterback, but after Burrow suffered a toe injury in Week 2, they were forced to turn to Browning. However, the Browning experiment only lasted three weeks before he was sent to the bench in favor of Flacco, who was brought in to save the season after Cincinnati made a trade with Cleveland. \nIt doesn't matter who's under center for Cincinnati, as long as they can throw a forward pass, Chase will put up big numbers with them. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals vs. Steelers: Ja'Marr Chase becomes first NFL player in 28 years to pull off this improbable feat - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/99182782-4fd6-4f81-a34e-b752648ae3a0/thumbnail/1200x675/197975ff2731170b08d85d277c45e5b2/untitled-design-2025-10-16t200218-015.png"
      ],
      "datePublished": "2025-10-17T03:08:41.000Z",
      "dateModified": "2025-10-17T03:08:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Dodgers vs. Brewers: Game 4 TV channel, prediction, pick, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-vs-brewers-nlcs-schedule-prediction-odds-tv-channel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/317ed6d5-be66-4a02-ae00-137e8e6a3997/thumbnail/1200x675/7cbdc107bf9afc3a7e931a8909c5cdde/dodgers-getty-2.png",
    "tag": "Sports",
    "date": "2025-10-17T02:41:33.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    It's a rematch of the 2018 NLCS as the Dodgers continue their push for a repeat\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 16, 2025\n                            \n                    at\n    9:31 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Dodgers have a 3-0 lead in the National League Championship Series against the Milwaukee Brewers and are now just one win away from the World Series. After dominant starts from Blake Snell and Yoshinobu Yamamoto, Tyler Glasnow couldn't quite go the distance in Game 3, but the offense put up enough runs to get the job done. They'll go for the clinch Friday in Game 4.The Brewers, the top overall seed in Major League Baseball's postseason, became the fourth and final team to advance to the league championship round on Saturday night. The Brewers advanced to their first NLCS since 2018 when they defeated the Chicago Cubs in Game 5 of their NLDS matchup to take the best-of-five series by a 3-2 margin.Whereas the Dodgers are making their fourth NLCS appearance in six years, the Brewers have reached this stage just twice since moving to the NL in 1998: back in 2018 (when they met the Dodgers) and in 2011, when they were knocked off by the St. Louis Cardinals. The Dodgers are attempting to become MLB's first repeat World Series champions since the New York Yankees won three in a row in 1998-2000.\nDodgers vs. Brewers scheduleDateStart time/scoreTVLive streamGame 1Mon., Oct. 13LAD 2, MIL 1TBSHBO MaxGame 2Tue., Oct. 14LAD 5, MIL 1TBSHBO MaxGame 3Thur., Oct. 16LAD 3, MIL 1TBSHBO MaxGame 4Fri., Oct. 178:38 p.m. ETTBSHBO MaxGame 5 (if nec.)Sat., Oct. 188:08 p.m. ETTBSHBO MaxGame 6 (if nec.)Mon., Oct. 205:08 p.m. ETTBSHBO MaxGame 7 (if nec.)Tue., Oct. 218:08 p.m. ETTBSHBO MaxDodgers vs. Brewers: Game 4 infoTime: 8:08 p.m. ET | Date: Friday, Oct. 17Location: Dodger Stadium -- Los AngelesTV channel: TBS | Live stream: HBO MaxStarting pitchers: RHP Shohei Ohtani (LAD) vs. TBA (MIL)Odds: Dodgers -187, Brewers +152 (via DraftKings)\nGame 4 storylinesDodgers: Well, this one's pretty easy. One win and they're in. Normally, we'd say easier said than done, but given how the Dodgers have breezed through this series so far, it might be just that easy.Brewers: The Brewers have scored a combined three runs in the first three games of this series. Suffice to say, that won't get it done. It doesn't matter who's on the mound. The offense simply has to figure it out if they want to stand any chance at winning a game, let alone four.\nGame 4 predictionThe Dodgers have Ohtani on the mound and a well-rested bullpen to back him up. On the Milwaukee side, the pitching staff is in much worse shape, the offense can't score runs, and Jackson Chourio might not be 100%. The Dodgers close it out 4-2 and advance to the World Series again. -- Dayn Perry\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Dodgers vs. Brewers: Game 4 TV channel, prediction, pick, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/317ed6d5-be66-4a02-ae00-137e8e6a3997/thumbnail/1200x675/7cbdc107bf9afc3a7e931a8909c5cdde/dodgers-getty-2.png"
      ],
      "datePublished": "2025-10-17T02:41:33.000Z",
      "dateModified": "2025-10-17T02:41:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Player prop picks for Steelers vs. Bengals on 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-bengals-nfl-player-props-bets-thursday-night-football-jamarr-chase/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/71233814-3c0c-4bf4-a670-1f853c65f6d2/thumbnail/1200x675/7b7e196281e909e34a568df737787c54/usatsi-27256283.jpg",
    "tag": "Sports",
    "date": "2025-10-16T23:03:11.000Z",
    "description": "\n        Aaron Rodgers will get his induction into the Steelers vs. Bengals rivalry on 'Thursday Night Football' to kick off NFL Week 7. Several NFL p",
    "body": "\n        Aaron Rodgers will get his induction into the Steelers vs. Bengals rivalry on 'Thursday Night Football' to kick off NFL Week 7. Several NFL prop picks will center on Rodgers, Jaylen Warren, DK Metcalf and other Steelers considering Cincy ranks in the bottom five in points allowed, yards allowed, rushing defense and passing defense. However, Pittsburgh hasn't been a Steel Curtain on that side of the ball either. It ranks 27th in passing defense, so Joe Flacco, Ja'Marr Chase and Tee Higgins will also be popular with NFL player props and Thursday Night Football betting. Cincy's Trey Hendrickson, who led the NFL in sacks last season, is out, so his absence could further boost Pittsburgh offensive players in prop predictions.Rodgers has an NFL prop bar of 219.5 passing yards, after he threw for 235 yards in Week 6 and hit the Over. However, he went under this NFL prop total in three straight games prior to Sunday, and with Cincy possessing the No. 28 run defense, Pittsburgh may lean more on the ground game. With the same prop odds of -112 for the Over and Under, this may be one TNF prop to simply avoid altogether. Before betting any Bengals vs. Steelers props for Thursday Night Football, you need to see the Steelers vs. Bengals prop predictions powered by SportsLine's Machine Learning AI.You can make NFL prop picks at DraftKings, where you can get $300 in bonus bets if your initial $5 wager wins + 3 months of NBA League Pass. Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Bengals vs. Steelers NFL betting on Thursday Night Football, the Machine Learning Model  has evaluated the NFL player prop odds and provided Steelers vs. Bengals prop picks. You can only see the Machine Learning Model player prop predictions for Cincinnati vs. Pittsburgh here.Top NFL player prop bets for Bengals vs. SteelersAfter analyzing the Steelers vs. Bengals props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Bengals WR Chase goes Over 73.5 receiving yards (-114 at FanDuel). The Steelers have always struggled to contain Chase, who has at least 81 receiving yards in four straight versus Pittsburgh. He's averaged 98 receiving yards over this stretch, and many of those defenses were much better than this year's unit in Pittsburgh. The Steelers are giving up 178.8 receiving yards to opposing wideouts, which is the third-most in the NFL.Chase is also coming off 94-plus receiving yards in each of the last two weeks, and he showed great rapport with Flacco on Sunday, posting a stat line of 10-94-1. It's also important to note that Thursday's game will take place in Cincinnati, where Chase has gone over his receiving yardage prop in each of his last five home games, which includes a Week 13 contest versus the Steelers last season. The AI model projects Chase to have 93.7 receiving yards, giving this NFL prop bet a 4.5-star rating. See more NFL props here.New users can also target the FanDuel promo code, which offers new users $300 in bonus bets if their first $5 bet wins:How to make NFL player prop bets for Bengals vs. SteelersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has 13 additional NFL props that are rated four stars or better. You need to see the Machine Learning Model analysis before making any Steelers vs. Bengals prop bets for Thursday Night Football.Which Bengals vs. Steelers prop bets should you target for Thursday Night Football? Visit SportsLine now to see the top Steelers vs. Bengals props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Player prop picks for Steelers vs. Bengals on 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/71233814-3c0c-4bf4-a670-1f853c65f6d2/thumbnail/1200x675/7b7e196281e909e34a568df737787c54/usatsi-27256283.jpg"
      ],
      "datePublished": "2025-10-16T23:03:11.000Z",
      "dateModified": "2025-10-16T23:03:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals vs. Steelers NFL DFS picks, expert lineup advice - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-lineups-bengals-steelers-thursday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/e62dbb73-8b3c-4942-940a-0e10abf83c78/thumbnail/1200x675/f258ceaec0ee3207804249c3d6b8db76/usatsi-27308635.jpg",
    "tag": "Sports",
    "date": "2025-10-16T22:58:07.000Z",
    "description": "\n        The Week 7 NFL schedule kicks off with a 'Thursday Night Football' showdown between the Pittsburgh Steelers and Cincinnati Bengals. Kickoff i",
    "body": "\n        The Week 7 NFL schedule kicks off with a 'Thursday Night Football' showdown between the Pittsburgh Steelers and Cincinnati Bengals. Kickoff is scheduled for 8:15 p.m. ET at Paycor Stadium in Cincinnati. Both teams feature a mix of proven star power and young talent. Pittsburgh's offensive core of Aaron Rodgers, DK Metcalf, and Jaylen Warren headline the NFL DFS player pool. On the other side, the Bengals' dynamic duo of Ja'Marr Chase and Tee Higgins also factor in as likely popular NFL DFS picks for Thursday night. How should you build your NFL DFS lineups and NFL DFS stacks for Thursday Night Football? Which potential NFL DFS sleepers, like Andrei Iosivas, Noah Fant, Kenneth Gainwell or Jonnu Smith should you target in Steelers vs. Bengals? Before locking in any NFL DFS picks on sites like DraftKings and FanDuel for Thursday Night Football, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him is way up.Now, McClure has turned his attention to Thursday Night Football and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New players can get $50 in Pick6 credits at DraftKings when they play $5: Top NFL DFS picks for Steelers vs. BengalsOne of McClure's top NFL DFS picks for TNF is Bengals wide receiver Ja'Marr Chase. The former LSU star turned in a truly electric 2024 campaign, leading the NFL in catches (127), receiving yards (1,708), and touchdown receptions (17), earning him the rare receiving \"Triple Crown.\" That season's performance cemented his status as one of the league's elite wideouts and a focal point of the Bengals' offense. In 2025, through six games, Chase has already recorded 42 receptions for 468 yards and four touchdowns, averaging 11.1 yards per catch. While those numbers don't yet match his 2024 peak, he remains one of the most reliable and explosive targets in football. Chase displayed an obvious rapport with new Cincinnati starter Joe Flacco, catching 10 passes for 94 yards and a touchdown in their first game together. See who else to roster here.New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:Part of McClure's optimal NFL DFS strategy also includes rostering Steelers running back Jaylen Warren. The former undrafted free agent out of Oklahoma State showcased his versatility and efficiency during the 2024 season, recording 120 carries for 511 rushing yards (4.3 yards per carry), along with 38 receptions for 310 receiving yards. Despite splitting time in the backfield, he consistently provided a spark for the Steelers' offense with his quick burst and reliable hands. In 2025, through four games, Warren has rushed 54 times for 184 yards (3.4 yards per carry) and added 13 catches for 153 yards, averaging 11.8 yards per reception. While his rushing efficiency has dipped slightly, his impact as a pass-catcher continues to stand out. With an expanded role in Pittsburgh's offense, Warren's combination of toughness, balance, and versatility has made him one of the team's most dependable offensive weapons. See who else to roster here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:How to set NFL DFS lineups for Bengals vs. SteelersMcClure is targeting another undervalued player who could explode for huge numbers on Thursday Night Football. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Thursday Night Football, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals vs. Steelers NFL DFS picks, expert lineup advice - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/e62dbb73-8b3c-4942-940a-0e10abf83c78/thumbnail/1200x675/f258ceaec0ee3207804249c3d6b8db76/usatsi-27308635.jpg"
      ],
      "datePublished": "2025-10-16T22:58:07.000Z",
      "dateModified": "2025-10-16T22:58:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers' Micah Parsons goes off on NFL officials, says he hasn't gotten a call in 'five years' in rant - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-micah-parsons-goes-off-on-nfl-officials-says-he-hasnt-gotten-a-call-in-five-years-in-rant/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/2316e644-f713-4244-9713-c88f40109799/thumbnail/1200x675/605a0c0e649694fc78c541d4cdfcb546/parsonsgb.jpg",
    "tag": "Sports",
    "date": "2025-10-16T23:16:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Micah Parsons isn't pleased with the current state",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Micah Parsons isn't pleased with the current state of NFL officiating. The Packers' All-Pro pass rusher went on a lengthy rant on Thursday that included him stating that NFL officials make calls to placate fans who want to see points, often at the defense's expense. \"They don't call offsides for offense, but they'll call it on defense,\" Parsons said, via ESPN. \"They won't call offensive pass interference, but they'll call defensive pass interference. We know what they're trying to do. They want to load the points up so fans can be happy. They'll call defensive holding, but they won't call offensive holding. Let's just wake up.\"\nParsons, who said that he hasn't gotten a call from the officials in \"five years,\" said that there's also a double standard in terms of player safety while alluding to an incident involving him that occurred during Green Bay's recent win over the Bengals. \nDuring the win, Parsons said that when he suffered a popped a blood vessel after getting poked in the eye by a Bengals player who wasn't flagged for illegal hands to the face. \"If you're going to say it's about protecting players, then protect all players,\" said Parsons, who added that he switched to a more protective face mask after the incident occurred. \"Don't just protect one side of the ball. Like, I don't mind guys chipping from the outside, but running backs want to come and [hit] players while we're engaged with offensive linemen, that's complete bulls---. That's not good football. That's not safe football.\"You want to fine guys for putting their head down [and leading with the helmet], but you can be engaged with an offensive tackle and a guard can put his head right into your head. What are we talking about here? Look at how many times that's on film, guys putting their head down and trying to come clean your clock. But you can't do that to offensive players. S---. You'll get a $50,000 fine. I might get a fine for this [news] conference.\"Parsons is far from the first defensive player to rail against NFL officials and faces the task of continuing to play at a high level despite not getting as many calls as he would like. \nWhile Parsons himself acknowledged Thursday that the way he's officiating comes with \"being one of the best,\" he isn't simply going to accept not getting what he feels is a fair shake from the officials. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers' Micah Parsons goes off on NFL officials, says he hasn't gotten a call in 'five years' in rant - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/2316e644-f713-4244-9713-c88f40109799/thumbnail/1200x675/605a0c0e649694fc78c541d4cdfcb546/parsonsgb.jpg"
      ],
      "datePublished": "2025-10-16T23:16:28.000Z",
      "dateModified": "2025-10-16T23:16:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]