[
  {
    "title": "Ukrainian athlete disqualified from Winter Olympics for helmet depicting victims of war - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-ukraine-skeleton-racer-bannedhelmet-war-victims/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/edda6af9-5046-45b1-a651-7a29ef788b49/thumbnail/1200x675/ad812d530c75a841db0ec685efd8cd0e/gettyimages-2260155291-1.jpg",
    "tag": "Sports",
    "date": "2026-02-12T16:02:58.000Z",
    "description": "\n        The International Olympic Committee banned Ukrainian skeleton racer Vladyslav Heraskevych from competing in the 2026 Milan Cortina Winter Oly",
    "body": "\n        The International Olympic Committee banned Ukrainian skeleton racer Vladyslav Heraskevych from competing in the 2026 Milan Cortina Winter Olympics after Heraskevych refused to refrain from racing in a helmet that honors athletes killed in Russia's invasion of Ukraine. Heraskevych trained in the helmet, which depicts at least 20 athletes and coaches, as late as Wednesday before the IOC made its final decision to bar him from Thursday's race. The IOC said Monday that Heraskevych's helmet would not be allowed in competition, citing a rule against making political statements on the Olympic field of play. \"I never wanted a scandal with the IOC, and I did not create it,\" Heraskevych wrote in a statement on social media. \"The IOC created it with its interpretation of the rules, which many view as discriminatory. Although the IOC's actions have made it possible to loudly speak about Ukrainian athletes who have been killed, at the same time the very fact of the scandal distracts a tremendous amount of attention away from the competitions themselves and from the athletes participating in them.\"Heraskevych also posted a picture of his wearing the helmet during training after the ban was announced.   \nIOC spokesperson Mark Adams noted while speaking with the media that Heraskevych had the opportunity to \"express his grief\" on social media, during press conferences and in the mixed zone, where athletes interact with reporters following competitions. \"In the end, let me be clear, it's not the message, it's the place that counts,\" Adams said. \"That for us -- and not actually us. We are, in this sense, in a back seat. It's the message of the athletes, that the athletes reiterate to us time and time again. There are 130 conflicts going on in the world. We cannot have 130 different conflicts feature. However terrible they are, we cannot have them featured during the field of play.\"   Other prominent Ukrainian athletes have come out in support of Heraskevych. Boxer Oleksandr Usyk, a two-time undisputed world heavyweight champion and a gold medalist in boxing while representing Ukraine in 2012, added his voice on social media. \n\"I'm proud of you @heraskevych, for your courage and bravery,\" Usyk wrote. \"The helmet with portraits of fallen Ukrainian athletes is a tribute, not a rule violation!  Sport doesn't mean forgetting. True strength is having the courage to remain human, even in the toughest times.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainian athlete disqualified from Winter Olympics for helmet depicting victims of war - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/edda6af9-5046-45b1-a651-7a29ef788b49/thumbnail/1200x675/ad812d530c75a841db0ec685efd8cd0e/gettyimages-2260155291-1.jpg"
      ],
      "datePublished": "2026-02-12T16:02:58.000Z",
      "dateModified": "2026-02-12T16:02:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arsenal vs. Brentford prediction, odds, best bets for EPL match - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-vs-brentford-prediction-odds-picks-best-bets-for-thursdays-premier-league-match/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/b880fdb4-769e-4fa2-a89f-931ab4e39aca/thumbnail/1200x675/ad847bd118ab9e546b52426dfe86bc6f/mikel-arteta.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:55:28.000Z",
    "description": "\nArsenal will be looking for their fifth straight victory in all competitions while maintaining their English Premier League lead when they visit Bren",
    "body": "\nArsenal will be looking for their fifth straight victory in all competitions while maintaining their English Premier League lead when they visit Brentford on Thursday. The Gunners (17-5-3) have a six-point lead over Manchester City in the EPL table after cruising to a 3-0 home victory against Sunderland on Saturday. The Bees (12-3-10) are seventh in the Premier League table and won 3-2 at Newcastle following a big 1-0 victory against top-four Aston Villa the previous weekend.     Kickoff at Brentford, England's Gtech Community Stadium is set for 3 p.m. ET. Arsenal are -155 favorites on the money line in the latest Arsenal vs. Brentford odds at DraftKings Sportsbook, Brentford are +425 and a draw is priced at +290. The total for match goals is set at 2.5 (Over -120, Under -105). Head over to SportsLine to see the latest on Brentford vs. Arsenal, including the SportsLine Projection Model picks, and make sure you read what expert Martin Green is betting.After working in the sports betting industry for several years, Green became a professional sports writer and handicapper and has covered the game worldwide. Last year, Green was profitable in multiple areas on his soccer betting picks, including Euro qualifying (+6.30 units), EFL Cup (+4.47), FA Cup (+3.07) and Champions League (+3.05), among others. Anyone who follows him could be way up.    Here are Green's best bets and analysis for Arsenal vs. Brentford on Wednesday, Feb. 11.Arsenal vs. Brentford best betsArsenal to Win and Under 4.5 goals -110 (1 unit)Arsenal to Keep a Clean Sheet +137 (0.5 units)Arsenal will try to tighten their grip on the Premier League title race when they take on Brentford at the Gtech Community Stadium on Thursday. The Gunners remain six points clear of title rivals Man City at the top of the table after beating Sunderland 3-0 at the weekend. They're on a four-game winning streak in all competitions, so they'll carry a great deal of momentum into this game.Arsenal have the best away record in the league this season, with seven wins, three draws and just two defeats from 12 games. However, Brentford's home record is identical -- seven victories, three draws and two losses from 12 at Gtech. The Bees have the sixth-best home record in the division and are full of confidence right now. It promises to be a tight game and could be decided by a set piece or a moment of individual brilliance.Arsenal Dominate Head-to-HeadsBrentford secured promotion to the Premier League in 2021, ending a 74-year exile from England's top division. Their first Premier League game was against Arsenal, and they earned a famous 2-0 win in front of their jubilant home fans.That was a joyous occasion for Brentford, but their record against Arsenal has been dismal in the ensuing years. Since then, Arsenal have picked up seven wins and two draws from nine games against Brentford.Their latest clash took place at Arsenal's Emirates Stadium two months ago. Goals from Mikel Merino and Bukayo Saka earned the Gunners a deserved 2-0 victory. They had 64% of the possession, and Brentford didn't manage a single shot on target in the game.The Gunners have also won their last four away games against Brentford, scoring 11 goals and conceding just once. They've absolutely dominated the Bees in recent years, which should give them confidence as they travel to the Gtech.Arsenal's players could be feeling a little jittery, as they're bidding to win the Premier League title for the first time in 22 years. They're the -600 favorites to win the league with most sportsbooks, but they've choked several times over the past few years.However, they looked supremely composed in their 4-0 away win against Leeds on Jan. 31 and followed it up with a 1-0 win against Chelsea. They earned a third consecutive clean sheet when beating Sunderland 3-0 on Saturday, and their defense looks rock-solid right now.Arsenal have kept 13 clean sheets in 25 league games this season and have only conceded 0.68 goals per game, so they could thwart Brentford's attack.Brentford are Flying HighBrentford will be on a high after beating Newcastle 3-2 at St. James' Park on Saturday. The Bees have won their last two league games and are up to seventh in the league table, level on points with reigning champions Liverpool.Most pundits expected Brentford to be in a relegation battle this season. After all, manager Thomas Frank moved to Tottenham in the summer. They also lost their two best forwards, as Bryan Mbeumo moved to Man United and Yoan Wissa joined Newcastle.They've defied all expectations, so new manager Keith Andrews deserves a great deal of credit. This is a strong, athletic Brentford team, with a powerful spine. Nathan Collins and Sepp van den Berg are solid at the back, veteran Jordan Henderson patrols the midfield, and Igor Thiago and Dango Outtara have been very prolific in attack.They have no major injury concerns right now, although winger Kevin Schade is suspended. Meanwhile, Arsenal are missing Saka and Merino through injury. Captain Martin Ødegaard, and winger Leandro Trossard could also miss this game.Yet the Gunners have strength in depth. They're playing Wigan in the FA Cup at the weekend, so they can afford to play their best XI in this game then rest key players against Wigan. We could see a front three of Gabriel Martinelli, Viktor Gyökeres, and Noni Madueke, which would give Arsenal pace on the counter-attack. The Gunners have a world-class midfield and are always dangerous at set pieces.They can also call upon the likes of Kai Havertz, Eberechi Eze, and Gabriel Jesus, and that strength in depth could ultimately prove decisive, allowing them to secure a narrow away win. The last 10 games between these teams have seen Under 4.5 goals, so combining Arsenal to Win with Under 4.5 Goals looks appealing.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arsenal vs. Brentford prediction, odds, best bets for EPL match - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/b880fdb4-769e-4fa2-a89f-931ab4e39aca/thumbnail/1200x675/ad847bd118ab9e546b52426dfe86bc6f/mikel-arteta.jpg"
      ],
      "datePublished": "2026-02-12T15:55:28.000Z",
      "dateModified": "2026-02-12T15:55:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/eb90b318-7013-4d88-8ac0-18c5a9bba5d7/thumbnail/1200x675/018c4be0e2670a4016cdcfe285e8690b/getty-lemley-kauf-olympics.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:28:49.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA will try to improve upon those numbers in 2026, and they have some golden opportunities to do just that. Both the men's and women's hockey team should be in the running for a gold medal, Jordan Stolz is a favorite in speed skating, Chloe Kim is hitting the halfpipe in snowboarding and Mikaela Shiffrin will once again be on the ski slopes. And figure skaters Alysa Liu and Ilia Malinin have high potential to reach the podium.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Norway has won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    72514\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    62715\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    46313\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    4318\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    4127\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    35311\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    3418\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    3328\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    2259\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    1304\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    1102\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    1102\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    1001\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    0336\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    0123\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    0112\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0112\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0101\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0101\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0011\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/eb90b318-7013-4d88-8ac0-18c5a9bba5d7/thumbnail/1200x675/018c4be0e2670a4016cdcfe285e8690b/getty-lemley-kauf-olympics.jpg"
      ],
      "datePublished": "2026-02-12T15:28:49.000Z",
      "dateModified": "2026-02-12T15:28:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Cup coaches aim navigate 'red flags' of North American summers in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/world-cup-schedule-coaches-prepare-for-elements-in-usa-mexico-and-canada/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/06/57fba900-3ac0-4dfe-b9aa-71b79f2c5741/thumbnail/1200x675/8eb38467412f158e44378f4761d7f00c/wc2026.jpg",
    "tag": "Sports",
    "date": "2026-02-12T16:18:09.000Z",
    "description": "\n        WASHINGTON, D.C. – The first 48-team World Cup was always destined to have unique quirks but as FIFA closed out their week in Washington, D.C",
    "body": "\n        WASHINGTON, D.C. – The first 48-team World Cup was always destined to have unique quirks but as FIFA closed out their week in Washington, D.C., they came up with one final random twist for a week centered around Friday's draw. Representatives from the qualified teams gathered one last time on Saturday for a schedule reveal event, one so random that even president Gianni Infantino did not know what to call it when he entered the stage. The event, though, did serve a practical purpose – visiting national teams finally found out which stadiums they would play their opening games in, FIFA essentially splitting the experience of the luck of the draw in two parts.While head coaches waited to find out their exact opponents on Friday before pondering their side's strengths against their group stage foes, the major talking points from Saturday's schedule reveal were  the elements that await them regardless of the other team on the pitch. Whether they watched from up close or from a distance, many got a preview of a North American summer during this year's Club World Cup – a not-so-pleasant preview, to be exact. Hot and humid days were essentially experienced by all 32 club teams at the U.S.-based tournament, leaving World Cup coaches rooting for the best-case scenario in terms of logistics.Several got what they wanted and breathed a sigh of relief once the schedule was unveiled. The list included Germany's Julian Nagelsmann, who will open their World Cup against the Caribbean nation of Curacao at Houston's NRG Stadium, the first NFL venue to build a retractable roof. They will then take on Ivory Coast at Toronto's BMO Field and close out Group E action against Ecuador at MetLife Stadium in the New York suburbs in a match that kicks off at 4 p.m. local time.\"I think it's three good stadiums, climate [controlled] stadiums so it's more easy for us,\" Nagelsmann said. \"We're not used to this high temperature, less [so] than Curacao, but now it's in a climate [controlled] stadium, air conditions. It's more easy for us. Second game in Toronto, I think it's not that hot compared to Miami or other venues so at least the last game in New York, it will be very hot but … we'll try to travel as early as possible to the U.S. so that we can adapt to the temperature and we'll be very prepared.\"\nMuch like the temperatures, distance was top of mind ahead of a World Cup with a sizable geographic footprint. The 2026 tournament will be spread from coast to coast and features host cities as far north as Vancouver and as far south as Mexico City, which varies greatly from the 2022 World Cup in Qatar and the 2018 competition that was confined to Russia's western cities. Head coach Rudi Garcia considered himself lucky that Belgium will be confined to the west coast for their Group G games against Egypt, Iran and New Zealand. Belgium are targeting a base camp in Seattle following the draw.\"Our base camp will be the west coast so normally, we'll be in Seattle,\" Garcia said. \"We are lucky about that because we are in the west coast, but in the north of the west coast. Seattle, Vancouver, it will not be hot to play, just a long flight – or an important flight – to go to [Los Angeles]. Maybe it will be a little hotter but not so much. The particularity of our games, the two first games, is that we will play at noon, at 12 [p.m], so it's not so easy to prepare. We need to wake up the players earlier.\"Portugal were also on the receiving end of a favorable situation with two games at NRG Stadium – one against Uzbekistan and another against the winner of an intercontinental playoff – and a third at Hard Rock Stadium in Miami Gardens, the last one a game against Colombia with a 7:30 p.m. local kickoff time that will at least ensure the sun will not be beating down on players. Head coach Roberto Martinez, a member of FIFA's technical study group during the Club World Cup, said the game-time conditions are just one part of navigating North America's unique summertime patterns.\n\"It really alerted me for many red flags and aspects we need to anticipate so from that point of view, it was essential to have that experience,\" Martinez said about the Club World Cup. \"Now, I stayed in Miami for a long time so we got to play in Miami. I'm really happy with that. We're going to play in Houston. … Red flags is the training times, what you should do in terms of the cooling breaks, in terms of the potential threat of a storm and logistics, where would you train before a game. There are many aspects with the logistics that are very unique, very different. It's never happened that three countries are organizing a World Cup. You can imagine that there are many aspects that are still a little bit unknown.\"Final World Cup preparations underwayAs a global soccer convention of sorts comes to a close in Washington, D.C., the focus for World Cup-bound teams immediately shifts to scouting the teams they will face six months from now. In March, though, those national teams will reconvene for their final international break before the World Cup. Portugal and Belgium have booked trips to North America to face World Cup co-hosts U.S. and Mexico, the pair of friendlies offering an important trial run with next summer's tournament now fully in sight.Those friendlies were confirmed before Friday's draw and Saturday's schedule reveal, the visiting national teams among several who wanted to get a feel for things in North America before the tournament began. Portugal's March schedule was mostly constructed with a visit to Azteca Stadium to face Mexico in mind in case a trip to the venue would be required during the World Cup, something that is now unlikely. They will also face the U.S. men's national team in Atlanta, where they could play knockout matches depending on their run.\n\"I think playing in the Azteca, for us, was the main point,\" Martinez said. \"Playing at altitude is not something we can do playing in Europe. In Europe, playing at 1,500 meters is nowhere near the preparation you need for the Azteca so for us, the aspect of reliv[ing] the big moments in '86. We all grew up having many memories of those moments in the Azteca so for us from a psychological aspect, I think it makes total sense to live that in March rather than in the opening game of our World Cup story.\"Martinez previously visited Atlanta's Mercedes-Benz Stadium for the Super Bowl 2017 but as a spectator, though playing against the USMNT offers a chance to face a team from North America. While the final member of Group K will not be determined until March, that spot could be occupied by Jamaica should they get through a playoff that includes New Caledonia and DR Congo.\"To be honest, I haven't seen them,\" he said of the USMNT. \"We were focused on our preparation and qualifying for the World Cup but we're excited because I think playing USA is the only opportunity to play Concacaf teams so we're really looking forward. Obviously, Mauricio Pochettino is a very experienced coach and the technical staff, and they worked at the highest levels in Europe so we know them very, very well so it'll be only good things about their work and their preparation for the team so I think it's a great game for both national teams to prepare for the World Cup.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Cup coaches aim navigate 'red flags' of North American summers in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/06/57fba900-3ac0-4dfe-b9aa-71b79f2c5741/thumbnail/1200x675/8eb38467412f158e44378f4761d7f00c/wc2026.jpg"
      ],
      "datePublished": "2026-02-12T16:18:09.000Z",
      "dateModified": "2026-02-12T16:18:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joey Porter says Steelers protected Ben Roethlisberger, but QB wasn't a 'good person' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/former-steelers-teammate-says-team-protected-ben-roethlisberger-says-he-wasnt-a-good-person/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png",
    "tag": "Sports",
    "date": "2026-02-12T03:26:58.000Z",
    "description": "\n        While he never played for the coach, former Steelers outside linebacker Joey Porter is going to bat for Mike Tomlin while taking aim at two f",
    "body": "\n        While he never played for the coach, former Steelers outside linebacker Joey Porter is going to bat for Mike Tomlin while taking aim at two former teammates who have been outspoken about Tomlin since he decided to step down as Pittsburgh's leader. Fellow former Steelers outside linebacker James Harrison has been extremely vocal in his criticism of Tomlin, going as far as to say he isn't a Hall of Fame-caliber coach. Former quarterback Ben Roethlisberger hasn't been as extreme, but he did make headlines when he suggested late in the 2025 season that Tomlin should become Penn State's new coach. Roethlisberger has since said on his podcast that it was probably time for a change regarding the Steelers' coaching post. Porter, who also served on Pittsburgh's coaching staff from 2015-18, was largely diplomatic in terms of his comments regarding Harrison, but things got personal when he discussed Roethlisberger, his teammate from 2004-06. \"Seven definitely broke the brotherhood,\" Porter said on Steelers defensive tackle Cameron Heyward's podcast. \"The shit that Seven did that we don't talk about is crazy. Out of anybody, he should never grab a microphone and really talk Steelers business, because if we're talking Steelers business, his ass is foul of all foul, like the shit that he did is foul of all foul. \n\"He's not a good teammate. Won a Super Bowl with him, but the person, he's just not a good teammate. Like he knows that, anybody in the Steeler building knows that, but we protected him, because I've only won one Super Bowl, and that was my quarterback. So do I love my quarterback? Yeah, but is he a good person? No.\" When asked why he felt Roethlisberger was a bad teammate, Porter mentioned that Roethlisberger did not sign autographs for teammates' family members during his rookie season. Porter, a team captain at the time, decided to have a meeting with Roethlisberger after he specifically declined to sign something for defensive end Aaron Smith. \"Who the hell is too cool to sign for your teammate?\" said Porter, alluding to former teammate and Hall of Fame running back Jerome Bettis and his constant willingness to do things for teammates and fans. \"I always looked at it like this. Look at the team when Joey was a captain, when Jerome was captain, when Hines Ward was a captain. You heard nothing in the locker room. \n\"Captains have to do captain shit, right? We voted to be captains; you had to be voted in. He came in an era where they just gave you a seat, because if he wasn't a captain, he'd probably have a hissy fit, but nobody's going to vote for him as captain because he don't have no captain qualities.\"Beyond his alleged locker room issues, Roethlisberger was suspended for four games in 2010 amid a violation of the NFL's personal conduct policy, as multiple women accused him of misconduct in 2008 and 2010. \"I got caught up being Big Ben the whole time,\" Roethlisberger said at the time. \"I lost track of who Ben Roethlisberger was. It's not something I'm proud of. \n\"Big Ben just kept building up. It ended up coming off the field. It kept taking over. Superman kept taking over Clark Kent and you just never saw who Ben Roethlisberger was anymore. At the time, I didn't see it. I was gaining everything, but I was losing a lot of who I was raised to be.\"Roethlisberger himself previously acknowledged that he wasn't always the best teammate. He did, however, maintain some close relationships during his early years in Pittsburgh with several teammates, specifically Bettis and former tight end Heath Miller, among others. In later years, he developed a close bond with center Maurkice Pouncey, who was inducted into the Steelers Hall of Honor this past year alongside Roethlisberger and Porter. In 2019, departing teammates Le'Veon Bell and Antonio Brown both questioned Roethlisberger's leadership or lack thereof. One of their criticisms of Roethlisberger was that he didn't spend enough time with them outside of the facility. \nRoethlisberger appeared to respond by hosting Pittsburgh's skill players at his lake house that offseason. He also pulled the plug on his local radio show, which often led to public criticisms of teammates, like Martavis Bryant in 2015 and fellow receiver James Washington in 2018. In later years, Roethlisberger publicly vouched for several teammates to get contract extensions, like running back James Conner prior to Conner becoming a free agent after the 2020 season. In 2021, his final season in Pittsburgh, Roethlisberger agreed to a contract restructure that cleared $15 million, which helped Pittsburgh re-sign JuJu Smith-Schuster, one of Roethlisberger's favorite receivers. While he at least appeared to be a better teammate during his later seasons, Roethlisberger wasn't perfect. In 2018, for example, he loudly questioned the Steelers' decision to draft fellow quarterback Mason Rudolph, who supported Porter's comments on social media. He recently alluded to the Steelers giving him a \"center that had never played center before\" for his final season (he has since apologized to said center, Kendrick Green). \nRoethlisberger also hasn't been shy as it relates to how his career in Pittsburgh ended. While he ultimately chose to retire instead of playing elsewhere, he acknowledged that at least one of the Steelers' head decision-makers didn't want him back after the 2021 season. It appears that led to the harboring of some negative feelings, at least on Roethlisberger's side. As far as the criticism of Tomlin is concerned, Roethlisberger and Harrison have their own podcasts and have never been afraid to express their opinions. And while both are entitled to their stances, Porter doesn't feel that either is in a position to speak negatively of someone who did so much for their careers, his included. \"What makes it crazy for me to watch them two talk like that and really act like we don't have the real receipts of how this really works,\" Porter said. \"Like, you know what he just did for y'all? ... When they tell their stories, you'll think Mike didn't do shit for them. I don't know how to shit on somebody that looked out for me.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joey Porter says Steelers protected Ben Roethlisberger, but QB wasn't a 'good person' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/96351cbe-6e9d-4cff-beec-b237528738cd/thumbnail/1200x675/b35add5186a7f1296c0c508298a0c63c/bigben.png"
      ],
      "datePublished": "2026-02-12T03:26:58.000Z",
      "dateModified": "2026-02-12T03:26:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thomas Frank exits Spurs after lifeless, ineffective spell in charge - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/thomas-frank-pays-price-tottenham-failure-premier-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/03ee3949-512f-4896-b0fd-82c31469d899/thumbnail/1200x675/ff5c64f4f92f315e122bf1450027a9f3/frank.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:01:01.000Z",
    "description": "\n        Six months into a season, it is not unusual to know what to expect from any given team on any given day and that was certainly the case for a",
    "body": "\n        Six months into a season, it is not unusual to know what to expect from any given team on any given day and that was certainly the case for anyone who cared to check on Tottenham Hotspur on Tuesday as they faced Newcastle United. A sluggish team who seemed a step or two behind the opponent in terms of intensity levels? Check. A porous defense that seems to lack chemistry? Check. An attack that has very few ideas? Check. Few redeeming qualities as the team slouched to yet another Premier League defeat? Check again.Thomas Frank, whose months-long spell in charge of the team finally came to an end after their latest drab performance, did not create all of Spurs' issues. He is right to point to the fact that he, like his predecessor Ange Postecoglou last season, had to contend with an injury crisis of epic proportions, all while captain Cristian Romero serves a suspension for a red card in their 2-0 defeat at Manchester United on Saturday. He was not wrong to note that this very team finished 17th in the Premier League last season, an admission that the ceiling is only so high for the current iteration of Spurs. Frank, though, did not do himself a single favor during his brief stint in north London, emerging as a rare example of a coach who truly earned a promotion to the big leagues but failed to prove his worth for the most part.Frank's tenure with Spurs is remarkable for all the wrong reasons, the Denmark native unable to live up to the billing in any real sense. He was supposed to be a practical alternative to Postecoglou, who spent much more time ensuring his team had a functioning attack than a competent defense. It was not the only issue the next coach should have theoretically fixed – his Brentford side were organized when defending set pieces and impactful on the flip side, a signal that Frank's Spurs would be efficient on both ends of the pitch.His perceived pragmatism, though, was mistaken for ability. Frank inherited a mess but he also failed to improve the issues that were fully in his control. There were very few categories in which Frank made a noticeable positive impact, an underperformance that is easy to spot regardless of how one chooses to define success. Averaging 0.1 more point per match compared to Postecoglou's Spurs last season is not much of a flex, and neither is making an improvement of 0.3 goals against per game when the team ranks 13th in the Premier League when sorting for expected goals against. If Postecoglou was reckless for allowing a porous back line to take shape despite boasting brilliant defenders in Cristian Romero and Micky van de Ven, Frank is guilty of the same crime despite having the upper hand of a fit first-choice center back duo for much of the season.\nTottenham (2025-26)Tottenham  (2024-25) Brentford (2024-25)Points per game1.11.01.5Goals per game1.41.71.7Expected goals per game1.11.61.6Goals against per game1.41.71.4Expected goals against per game1.51.71.5Spurs' defensive shortcomings were hard to ignore even in a superficial watch on any given matchday. The defenders at his disposal had years of experience alongside one another and yet appeared completely disjointed, the natural result of Frank failing to lock in tactical foundations and going back to the drawing board more often than a coach of his caliber usually does. His defenders seemed unsure of their next move, unable to rely upon their instincts and mistake-prone as a result. Frustration and despair oozed out of the players each time a goal was conceded, no matter how predictable it was; contempt grew amongst the fanbase, who were more prone to booing than cheering quickly enough in Frank's tenure.Frank's Spurs underperformed in equal measure in front of goal. The coach had the bare bones of an attacking idea from the start of the season, one that seemed to go hand-in-hand with Spurs' odd squad construction. He would bypass midfield for the most part and instead prioritize play on the wings to generate attacking opportunities, a solution of sorts for a team that lacked any real passers after James Maddison tore his ACL in preseason, all while nicking a few goals off of set pieces. That plan did not pan out all that much – Spurs' attacking statistics this season are buoyed by an early season blitz in which they outperformed their expected goals tally, a run of beginner's luck that is generally hard to sustain.In no time at all, Spurs were out of ideas. Completing simple attacking plays was a difficult task, while their game was never built around earning more set pieces even though it was the rare area of the game they actually excelled in. At times, Frank sucked the life out of games instead, hoping his disinterest in scoring goals would grind opponents' attacks into dust. The coach gave an overly conservative approach the runout a handful of times last fall in matches that could have served as statement-making performances and at this point, it should come as no surprise that it did not work. Spurs tallied three shots and 0.12 xG in a 1-0 loss to Chelsea in which the Blues were unlucky not to have scored more as they racked up 15 attempts and 3.68 xG. Days later, Arsenal made sure not to waste their chances – they cruised to a 4-1 win as they tallied 17 shots and 1.93 xG, all while Spurs had three shots and 0.07 xG to speak of. It was evidently worse than Postecoglou's figures, but even Frank's own in his final season at Brentford.The inability to defend and attack properly was visible even at the end of Frank's tenure, perfectly encapsulated in the final goal Spurs conceded before his firing. His side could not complete a simple breakaway minutes after notching an equalizer against Newcastle, instead letting Anthony Gordon dance around a still Spurs defense before Jacob Ramsey popped the ball into the back fo the net.\nFrank's Spurs were lifeless, a whiplash-inducing exercise for anyone who remembers watching Postecoglou's version of the team. It was strange to watch Frank's Spurs give attacking a try for 45 minutes at a time every third or fourth game and then settle into a defensive structure that they could not maintain, inviting opponents into the match rather than killing the game entirely. Almost singlehandedly, he demonstrated that the belief that pragmatism is inherently efficient is a trope rather than a tried and tested philosophy for success in this sport. There is nothing practical about taking the foot off the gas when things are trending in the right direction. It is not effective to keep taking a stab at a losing strategy, hoping it will finally turn good. It is painfully unrealistic not to find a way to lean on your strengths, even if they are few and far between. There is nothing sensible about failing to lay down tactical foundations, rendering your team unable to execute a stylistic vision that seems like a prerequisite to being an elite coach.With Frank at the helm, Spurs merely dragged their feet through matches as if they were simply there to collect an attendance award rather than play. No one wins trophies with style points but Frank proved one can certainly lose without them, his team always hitting the pitch with a sense of aimlessness. It is no wonder, then, that he drew the ire of the Spurs faithful, who, unlike his team in attack, wasted no chance to lambast him for spearheading a \"boring, boring Tottenham\" – in every sense, he sucked the entertainment value and the inherent joy out of the game. In a landscape where the sport's next great managers increasingly prefer tactical rigidity, Frank's Spurs will act as a prime example in the downside of straying too far down that path. Being cautious does not inherently come with rewards, nor does it necessarily come with stability and in this case, it can slowly contribute to the erosion of an already decaying product. It forces existential questions, too, of what exactly the point of this particular exercise was for a team in desperate need of a course correction.Spurs' squad may not be up to the task of finishing even remotely close to a UEFA Champions League spot, but neither is Frank. In an age where clubs are quick to dispose of managers, he was given a chance but threw it away completely, the glimmer of hope that came in the UEFA Super Cup outing against Paris Saint-Germain an outlier rather than the start of a promising trend. Frank's firing will require a serious rethink by Spurs' leaders, many of whom are brand new to their roles after longtime chairman Daniel Levy's exit in September, because their current woes are the result of years of mismanagement and remarkably poor squad building, their trip to the Champions League final seven years ago now a distant memory of a long-gone era.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thomas Frank exits Spurs after lifeless, ineffective spell in charge - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/03ee3949-512f-4896-b0fd-82c31469d899/thumbnail/1200x675/ff5c64f4f92f315e122bf1450027a9f3/frank.jpg"
      ],
      "datePublished": "2026-02-12T15:01:01.000Z",
      "dateModified": "2026-02-12T15:01:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brentford vs. Arsenal live stream: Premier League odds, where to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-brentford-preview-premier-league-ucl-race/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/5eb6dec7-e0c3-4651-b1b2-1cee2bf94e35/thumbnail/1200x675/c34af0fa0de86f05ae11e9fa38009cca/afc-1.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:34:08.000Z",
    "description": "\nIt may just be a quirk of the schedule but as Arsenal and Brentford meet at the Gtech Community stadium on Thursday, there is an onus on each of them",
    "body": "\nIt may just be a quirk of the schedule but as Arsenal and Brentford meet at the Gtech Community stadium on Thursday, there is an onus on each of them to prove their worth as they each chase elusive accomplishments.Manchester City's 3-0 win against Fulham on Wednesday means the Gunners have just a three point cushion atop the table heading into the midweek clash, the odds still in the visitors' favor that the gap will go back to six points by the time the final whistle blows on Thursday. They enter the Brentford match understaffed, though – a handful of important players may not make the trip, a list that now reportedly includes Kai Havertz, according to The Athletic. The injury-prone attacker has sustained a muscle issue that will not just keep him out of Thursday's match but will also force him to miss their FA Cup tie against Wigan Athletic on Sunday and the North London Derby against Tottenham Hotspur the following week.Get ready for the Knockout Stage like never before with the UEFA Champions League Bracket Games! Create a pool to compete against friends or enter our Bracket Challenge for a chance to win a dream trip to London, including 2 UCL tickets and a tour of the UCL Today set! Plus, see how you stack up against UCL Today's own Jamie and Micah. Signup now before brackets are unlocked after the Round of 16 Draw. Visit here or play on the CBS Sports App!Havertz has only played seven games this season while dealing with different injuries, but he will not be the only player who will not be in the mix on Thursday. Mikel Merino recently underwent surgery for a foot injury, his recovery trending in the right direction, according to coach Mikel Arteta.How to watch Brentford vs. Arsenal, oddsDate: Thursday, Feb. 12 | Time: 3 p.m. ETLocation: Gtech Community Stadium -- Brentford, EnglandLive stream: Peacock Odds: Brentford +420; Draw +290; Arsenal -150\"The doctors were really happy with the way it went,\" Arteta said in his pre-match remarks on Wednesday. \"The time frame we're talking about is months, whether it's three, four or five, I don't know.\"It was not the only fitness concern on Arteta's mind.\"Max [Dowman] is still not available,\" he added. \"The rest [Bukayo Saka, Martin Odegaard and Leandro Trossard] we will see with the medical team.\"Arteta will be able to call upon the likes of Viktor Gyokeres and Gabriel Jesus amongst others, the former generally acting as a focal point for the Gunners' attacks. How well he has settled into his first season in the Premier League, though, is another question entirely – he has eight goals this season in league play, a modest tally for someone who was tasked with solving the attacking issues that plagued them during last season's failed title run. Arsenal have generally been able to paper over the cracks thanks to their focus on building a deep squad, creating a team that spreads the goalscoring burden out. Trossard, Merino and Saka have each contributed four-plus goals each in the Premier League, though, posing questions about whether or not their attack will sputter at Brentford.The Bees, meanwhile, enter the match with just two losses in their last 12, allowing them to climb up the table and emerge as a surprise contender for a Champions League berth. They are still on the outside looking in, currently sitting six points behind fourth place Manchester United and five behind Chelsea, who are in a fifth place spot that will likely also earn qualification to the Champions League thanks to England's standing in UEFA's association coefficient race. A win, however unlikely, on Thursday could turn the race on its head – they would sit just two points behind United and one behind Chelsea, a chance to close the gap afforded to them because of their rivals' draws earlier this week.Thursday's game may become a tale of two attackers, since Brentford boast one of the league's best in Igor Thiago. He has 17 goals this season, second only to City's Erling Haaland, and is only five goals behind the Norway international as he continues a dry spell. Breaking through the Gunners' impressive defense is not easy but Brentford will count on Thiago to accomplish that feat in the hopes of notching a statement-making result.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brentford vs. Arsenal live stream: Premier League odds, where to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/5eb6dec7-e0c3-4651-b1b2-1cee2bf94e35/thumbnail/1200x675/c34af0fa0de86f05ae11e9fa38009cca/afc-1.jpg"
      ],
      "datePublished": "2026-02-12T15:34:08.000Z",
      "dateModified": "2026-02-12T15:34:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Rodriguez to Minnesota United: Colombian midfielder remains star passer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/james-rodriguez-minnesota-united-colombian-midfielder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/06/3e40d1e7-d05a-4e6f-a3f8-3884bec0a61c/thumbnail/1200x675/b6d4440763e435913329d1339bab2645/untitled-design-2026-02-06t220640-373.png",
    "tag": "Sports",
    "date": "2026-02-12T16:17:57.000Z",
    "description": "\n        Just in time for the World Cup, James Rodriguez has a new club, joining Minnesota United as a free agent. The Colombian national team captain",
    "body": "\n        Just in time for the World Cup, James Rodriguez has a new club, joining Minnesota United as a free agent. The Colombian national team captain was last at Club Leon in Liga MX, departing after a strange time there. While Roriguez joined as part of the club ramping up to compete in the Club World Cup, they ended up being banned from the tournament, and Rodriguez departed after the end of his contract after making 14 appearances and scoring three goals and assisting two more.Now 34, Rodriguez heads to the North Star State on a six-month contract with a club option to extend  for another six months. This allows him time to get back up to speed ahead of the World Cup while adding a top attacker alongside Joaquin Pereya. While there may be questions about how much Rodriguez has left in his legs as he heads to MLS, one certain thing is that he can still pass with the best midfielders in North America.The chart below shows Rodriguez from his time at Club Leon, and there's a lot to like about the passing numbers that he brings. \n\n                                                                    CBS Sports\n                                                            With Pereya, Bongokuhle Hlongwane ad Kevin Yeboah tasked with putting the ball in the back of the net, the Colombian midfielder can drop it in a bucket for attackers to run onto. He can also bring excellent set play delivery to a team that led the league in goals from set pieces, excluding penalties. Looking at their set piece goals, Minnesota led the league by five with 22 goals in 34 games played, and it's a number that could rise via Rodriguez.After goalkeeper Dayne St. Clair's departure for Inter Miami and head coach Eric Ramsay leaving for West Bromwich Albion, there will be questions about whether the midfield and backline can handle Pereya and Rodriguez being light on the defensive end of things, but it will still make for fun soccer this season. Wil Trapp and Nectarios Triantis started Minnesota's final game of the season in midfield, a conference semifinal loss to San Diego FC, and will need to be everywhere to protect the midfield this season.\nTrapp is 33, though, and there's always a point where it can become too much for defensive midfielders trying to keep up with the pace of play. If Minnesota can avoid that, they'll be in a great place this season with Rodriguez in the squad, but having such an attacking luxury doesn't come without drawbacks. It's all about balance when competing on all fronts, and that's a task that will now fall on new head coach Cameron Knowles. It's also easier to defend when your team can put the ball in the back of the net, and Minnesota United should score early, often, and frequently this season.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Rodriguez to Minnesota United: Colombian midfielder remains star passer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/06/3e40d1e7-d05a-4e6f-a3f8-3884bec0a61c/thumbnail/1200x675/b6d4440763e435913329d1339bab2645/untitled-design-2026-02-06t220640-373.png"
      ],
      "datePublished": "2026-02-12T16:17:57.000Z",
      "dateModified": "2026-02-12T16:17:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why it's good Pepi's USMNT chances that move to Fulham failed - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/ricardo-pepi-transfer-fulham-usmnt-world-cup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/02/a7df3bd3-804b-4468-9825-2241d55e3361/thumbnail/1200x675/38c0931bd70322df5924dc50fa9c20a8/untitled-design-2026-02-02t215440-854.png",
    "tag": "Sports",
    "date": "2026-02-12T16:17:41.000Z",
    "description": "\n        For soccer players around the world, playing in the Premier League can be a crowning achievement of their careers while also offering lucrati",
    "body": "\n        For soccer players around the world, playing in the Premier League can be a crowning achievement of their careers while also offering lucrative financial rewards. That allure can cause players to leave good situations in other European leagues for a chance to compete in England, which may not manifest in reality. A move was close for PSV Eindhoven striker Ricardo Pepi to join Fulham, but it fell through on deadline day due to PSV not being able to secure a replacement striker for the American.On one hand, Pepi won't be able to join Antonee Robinson at a club that has a rich history of American players becoming stars, but, on the flip side, Pepi's last move to a big five league should act as a word of caution. After leaving FC Dallas, Pepi went to Augsburg in the Bundesliga, featuring in only 16 matches across two seasons before moving to FC Groningen in the Netherlands, where he was able to rebuild his career, showing that he was still a top striker, and earning a move to his current club.But the damage was already done during that time in the Bundesliga. Pepi fell down the pecking order for the United States men's national team, eventually missing the 2022 World Cup in Qatar. Pepi then made a move to PSV, where he has been able to get back on the right track, but despite having impressive production when he's on the pitch, he has yet to complete a full season's workload since coming to the club.Ricardo Pepi European minutes per seasonClubSeasonMinutes playedGoalsAssistsAugsburg2021-2247500Augsburg/ FC Groningen2022-232,746133PSV2023-2476493PSV2024-251,132183PSV2025-26983112Knee injuries and a broken arm have stopped Pepi from making more appearances over the past few seasons, but PSV have also had numerous options all over the pitch, leading to rotation all over. For example, in three seasons, Pepi has made 22 appearances in the Champions League, scoring nine goals and assisting three more. Only three of those 22 appearances were starts. Not only is it a different pace coming off the bench, but when also taking into account the physicality of the Premier League, a midseason move to England would be quite a shift for Pepi.\nWith another World Cup on the horizon in 2026, any drops in playing time could lead to a deja vu scenario for Pepi. Even with the injury, he's on track for the most minutes played for any club since the 2022-23 season, and PSV have shown trust in him by presenting him with the number nine shirt. Another move before the World Cup could have seen Pepi lose out on playing time and an opportunity to make it, but that's especially the case right now when Pepi hasn't scored for the USMNT since the Concacaf Nations League quarterfinals in November of 2024.Call it What You Want: A weekly podcast where Jimmy Conrad, Charlie Davies and Tony Meola cover all things USMNT and the state of the beautiful game in the United States. Catch the show YouTube live every Tuesday and Thursday at 10 a.m. ET.He didn't get his first cap under Mauricio Pochettino until facing Paraguay in November of 2025, so while Pepi is expected to be in the World Cup squad, it's not something that can be taken for granted at this time. Only being 23, another European move gone wrong wouldn't be enough to be a full setback in his young career, but it wouldn't be optimal when so much is at stake.\nThe grass isn't always greener when it comes to transfers, and it can't be taken for granted how important carving out a role with a club can be. There's still much more for Pepi to prove as a player with the Dutch side, and with the transfer window closing while he's still there, he'll have a chance to do it. With a strong end to the season and good performances at the World Cup, there's every chance that a move to a club like Fulham could still be there during the summer.  Striker Raul Jimenez isn't getting any younger, and moving then would give Pepi the best chance of settling in with time on his side.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why it's good Pepi's USMNT chances that move to Fulham failed - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/02/a7df3bd3-804b-4468-9825-2241d55e3361/thumbnail/1200x675/38c0931bd70322df5924dc50fa9c20a8/untitled-design-2026-02-02t215440-854.png"
      ],
      "datePublished": "2026-02-12T16:17:41.000Z",
      "dateModified": "2026-02-12T16:17:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL teams poised to take major fall in 2026: Bears, Patriots among regression candidates - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-regression-candidates-patriots-bears-broncos-steelers-eagles-major-fall-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/ee6b6287-fe68-48f4-ad74-6371044414c5/thumbnail/1200x675/ef9b92dd7c99d43d5ab18dff807cb1be/maye-williams.jpg",
    "tag": "Sports",
    "date": "2026-02-12T16:05:01.000Z",
    "description": "\n        Every NFL season since 1990 has seen at least four teams that missed the playoffs the prior year make the postseason the following year.The 2",
    "body": "\n        Every NFL season since 1990 has seen at least four teams that missed the playoffs the prior year make the postseason the following year.The 2025 playoff field was arguably the most parity-filled bracket of all time, considering the following:It had the most playoff teams (five) coming off of 11-plus loss seasons It had the most division winners (four) with five or fewer wins from the year beforeIt had the most worst-to-first division winners (three)Those trends indicate that anything is possible in the NFL. From year to year, bad teams one year can become elite the next: the New England Patriots going from being a four-win team in both 2023 and 2024 to winning the AFC in 2025. Great teams from 2024 fell off the map entirely and missed the playoffs like the 15-win Kansas City Chiefs, the 15-win Detroit Lions and the 14-win Minnesota Vikings did in 2025. So which teams could take a tumble down a few notches from their 2025 seasons? Here's a look at five such candidates as the offseason is now underway for all 32 teams following the Seattle Seahawks' 29-13 Super Bowl LX victory over the Patriots. \n\n                            \n    \n                                                \n                    \n    Chicago BearsNo team had a more clutch year in close games in the  2025 season than the Bears. Their seven wins when trailing in the final two minutes of the fourth quarter, including the playoffs, is an NFL record. Some of that likely had to do with Chicago regularly living on the edge thanks to their high-wire act of winning close games with an NFL-most eight wins by fewer than seven points this season, including the playoffs. He'll need to recapture that magic again in 2026, as well as relying on prayer, because regression to the mean hits almost every year for NFL teams that rely on clutch or one-score wins. The 2024 Chiefs were an NFL record 11-0 in one-score games last season en route to a third consecutive Super Bowl trip. In 2025, the Chiefs' late-game success completely evaporated as they lost nine of their 10 one-score games this season. OverTheCap.com projects the Bears to have the ninth-fewest effective cap space, defined as the cap space a team will possess after signing at least 51 players and its projected rookie draft class, in the NFL entering the 2026 offseason at -$9.49 million. That will hamper their ability to improve the roster. The biggest area where the Bears need to improve is on defense. Chicago was the NFL's No. 9 scoring offense (25.9 points per game) while it was the league's No. 23 scoring defense (24.4 points per game allowed). Continuity typically helps, and they'll have Dennis Allen back as their defensive coordinator in 2026. \nHowever, the Bears don't have the money to maintain that continuity in their defensive backfield. Safety Kevin Byard, a 2025 first-team All-Pro after leading the NFL with seven interceptions, is set to become a free agent, as is fellow starting safety Jaquan Brisker, nickel C.J. Gardner-Johnson and outside cornerback Nahshon Wright, who led the NFL with eight takeaways (five interceptions and three fumble recoveries). The potential losses of both Byard and Wright, who combined to account for 15 of Chicago's NFL-most 33 takeaways (45.4%), could certainly set the Bears' defense back. While it sounds wild to say, the 2025 season may have been the Bears' best shot to make a Super Bowl run with Williams on his rookie contract. \n                            \n    \n                                                \n                    \n    Denver BroncosThe Denver Broncos are similar to the Bears in terms of being a regression candidate. Of their 14 regular-season wins, Denver won an NFL record 12 in comebacks. The previous record was 11 by the Chiefs in 2024, and the Broncos tied the Chiefs' mark with 11 one-score wins. As mentioned with the Bears, the Chiefs fell back to earth and missed the playoffs entirely in 2025. \nIt's also worth wondering whether Bo Nix could regress in 2026, given his recovery from an ankle fracture and a relative step back in his performance in 2025. His efficiency metrics -- completion percentage, touchdown to interception ratio, and passer rating -- all declined to being ranked in the bottom 10 among 33 qualified quarterbacks, while his pass yards per attempt average has remained in the bottom 10 in the NFL in each of his first two seasons. Bo Nix career, NFL ranks2024*2025**Comp pct66.3% (15th)63.4% (24th)Pass yards3,775 (12th)3,931 (8th)Pass yards per attempt6.7 (29th)6.4 (28th)Pass TD29 (6th)25 (T-9th)TD-INT ratio29-12 (16th)25-11 (19th)Passer rating93.3 (18th)87.8 (26th)* Rank out of 36 qualified quarterbacks** Rank out of 33 qualified quarterbacks  Denver's defense will likely remain elite thanks to retaining defensive coordinator Vance Joseph and the vast majority of their defensive starters, but the uncertainty around Nix's offensive performance could make the Broncos' record look considerably different in 2026. \n                            \n    \n                                                \n                    \n    Pittsburgh SteelersThe Pittsburgh Steelers won the AFC North for the first time since the 2020 season in 2025 in Aaron Rodgers' first season as their starting quarterback. However, Rodgers turns 43 in December and will hit free agency this offseason. The hiring of Mike McCarthy, the head coach Rodgers played with for the majority of his career, as the Steelers' new head coach likely increases the chances he is back in 2026. However, the Steelers are still lacking in wide receiver depth outside of DK Metcalf, and Rodgers will be another year or older if he returns to Pittsburgh. The franchise does have the ninth-most projected cap space in the NFL this offseason ($39.31 million), according to OverTheCap.com, so upgrades could be made. Their ceiling with an aging Rodgers is likely a 10-7 record in 2025, with a chance to regress if Rodgers is injured. If Will Howard or Mason Rudolph is the starting quarterback, a major fall could easily be in order. \n                            \n    \n                                                \n                    \n    New England PatriotsThe 2025 AFC champion New England Patriots coasted to a 14-3 record while playing the easiest regular-season strength of schedule, with a .391 opponent winning percentage, the lowest by any team since the 1999 Rams. Eleven of their 17 games came against teams whose head coach is not returning in 2026, which is tied for the most such games in NFL history along with the 1925 Frankford Yellow Jackets, according to CBS Sports Research. That's a nearly unprecedented cakewalk.  Come playoff time, their path continued to provide soft landings. The Los Angeles Chargers were without both starting offensive tackles Joe Alt and Rashawn Slater, the Houston Texans were without their top two passing targets in wide receiver Nico Collins and tight end Dalton Schultz (departed in game at New England) and the Denver Broncos had to start Jarrett Stidham, who hadn't throw a pass in a game all season, at quarterback over the injured Bo Nix. It wasn't exactly a huge surprise that they fell behind the healthy Seahawks 19-0 in an eventual 29-12 Super Bowl defeat. This isn't to say New England will miss the playoffs in 2026, but they could easily see their regular-season record decline by four or five wins while playing a first-place schedule. Patriots schedule, 2025 regular seasonHead coach statusWeek 1 vs. RaidersFiredWeek 2 at DolphinsFiredWeek 3 vs. SteelersParted waysWeek 4 vs. PanthersNot fired (NFC South champs)Week 5 at BillsFiredWeek 6 at SaintsNot Fired (First-year head coach)Week 7 at TitansFiredWeek 8 vs. BrownsFiredWeek 9 vs. FalconsFiredWeek 10 at Buccaneers Not Fired (Fired OC, STC)  Week 11 vs. JetsNot Fired (First-year head coach, fired OC, DC)Week 12 at BengalsNot FiredWeek 13 vs. GiantsFiredWeek 14 (Bye)N/A Week 15 vs. Bills FiredWeek 16 at RavensFiredWeek 17 at JetsNot Fired (First-year head coach, fired OC, DC)  Week 18 vs. DolphinsFired\n                            \n    \n                                                \n                    \n    Philadelphia Eagles The Philadelphia Eagles have had a tumultuous offseason since their wild card round home loss against the San Francisco 49ers. Defensive coordinator Vic Fangio considered retiring, but it seems like he's decided to stick around for 2026. Philadelphia let go of offensive coordinator Kevin Patullo, and Jeff Stoutland, the best offensive line coach in the NFL today, chose to leave the Eagles' organization. The Dallas Cowboys hired away Philadelphia secondary coach Christian Parker to be their new DC, and the Eagles hired Green Bay Packers quarterbacks coach Sean Mannion to be their new OC, marking his first ascent to the coordinator level. That's just the coaching staff turmoil. On the field, Philadelphia took a big step back, going from winning Super Bowl LIX in 2024 to losing in the opening round of the playoffs in 2025. What happened? A couple of things. The Eagles were the NFL's No. 2 rushing offense (173.9 rushing yards per game) behind Saquon Barkley's 2,000-yard season in 2024, but they fell to 18th in rushing in 2025 while averaging 116.9 rushing yards per game. The other issue was quarterback Jalen Hurts' regression. He averaged a career-low 7.1 yards per pass attempt, and he also produced the lowest completion percentage (64.8%) in a season since 2021, his first as Philadelphia's full-time starting quarterback.   If Mannion can't get Hurts back on track in 2026, the coming season could once again be another slog with another precipitous decline. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL teams poised to take major fall in 2026: Bears, Patriots among regression candidates - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/ee6b6287-fe68-48f4-ad74-6371044414c5/thumbnail/1200x675/ef9b92dd7c99d43d5ab18dff807cb1be/maye-williams.jpg"
      ],
      "datePublished": "2026-02-12T16:05:01.000Z",
      "dateModified": "2026-02-12T16:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1 college basketball rankings: Late surge lifts Michigan to win - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-michigan-ucla/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/e5fc5537-f8fa-4c51-8eb7-7d1ba2f95564/thumbnail/1200x675/7d19f436b27107f6b25d08e1d166beb0/michigan-t25-1.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:41:44.000Z",
    "description": "\n\n\n    \n                                    Northwestern provided a stiffer challenge than expected, but the No. 1 Wolverines met the moment with a 45",
    "body": "\n\n\n    \n                                    Northwestern provided a stiffer challenge than expected, but the No. 1 Wolverines met the moment with a 45-17 run down the stretch\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 12, 2026\n                            \n                    at\n    10:41 am ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        After Arizona lost at Kansas on Monday, the only thing standing between Michigan and a return to the No. 1 spot in next week's AP Top 25 was wins over unranked Northwestern on Wednesday and unranked UCLA on Saturday.One down. One to go. But if you watched the game at Northwestern, you know it was more difficult than oddsmakers anticipated.Final score: Michigan 87, Northwestern 75.But that 12-point margin doesn't properly illustrate what happened at Welsh-Ryan Arena in a game in which Michigan closed as a 15.5-point favorite. Yes, it was another double-digit victory for the 23-1 Wolverines -- but they were actually down 58-42 with 14:04 remaining. From that point, Michigan outscored Northwestern 45-17 and turned a 16-point deficit into a 12-point road-win that didn't feel much like a road game given how many Michigan fans made the trip to Northwestern's campus.\"When we took our lead, they just erupted,\" Michigan coach Dusty May said. \"I told our guys, 'This is a home game.'\"So now the Wolverines are on to UCLA -- and two things can be true at the same time:\nThe Bruins, No. 13 in the preseason AP poll, are the highest-ranked preseason team that's no longer in the top 25 -- point being they've been disappointing.But they've been better lately.UCLA will enter this weekend's matchup with the Bruins 17-7 and outside of the top 35 of the NET. That's not great. But it's definitely better than where they were, because where they were, back in early December, was as low as 78th in the NET.Now they're 39th.That's the result of UCLA going 5-1 in its past six games with the highlight being a Q1 win over Purdue. Things are good. But no team in the sport has a tougher three-game stretch on tap than the Bruins.Check this out:Saturday: at Michigan (on CBS)Tuesday: at Michigan State (on Peacock)Feb. 21: Illinois at home (on Fox)Anyway. ... \nMichigan remains No. 1 in Thursday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings. The Wolverines are also No. 1 in the NET, at KenPom.com, BartTorvik.com and EvanMiya.com. Top 25 And 1 rankings \n        Biggest Movers\n    \n                1\n            \n                Saint Louis\n            \n                3\n            \n                Clemson\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Michigan\n                                \n                            L.J. Cason finished with 18 points and four steals in Wednesday's 87-75 win at Northwestern. The Wolverines' next game is Saturday against UCLA.\n                        \n                            --\n                        \n                            23-1\n                        \n                                2\n                            \n                                    Arizona\n                                \n                            Koa Peat missed nine of the 11 shots he attempted in Monday's 82-78 loss at Kansas. The Wildcats' next game is Saturday against Texas Tech.\n                        \n                            --\n                        \n                            23-1\n                        \n                                3\n                            \n                                    UConn\n                                \n                            Solo Ball finished with 24 points and one rebound in Wednesday's 80-70 win at Butler. The Huskies' next game is Saturday against Georgetown.\n                        \n                            --\n                        \n                            23-2\n                        \n                                4\n                            \n                                    Duke\n                                \n                            Isaiah Evans finished with 21 points and two rebounds in Tuesday's 70-54 win at Pitt. The Blue Devils' next game is Saturday against Clemson.\n                        \n                            --\n                        \n                            22-2\n                        \n                                5\n                            \n                                    Houston\n                                \n                            Emanuel Sharp finished with 27 points and three rebounds in Tuesday's 66-52 win at Utah. The Cougars' next game is Saturday against Kansas State.\n                        \n                            --\n                        \n                            22-2\n                        \n                                6\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic missed eight of the 12 shots he attempted in Tuesday's 62-55 loss at TCU. The Cyclones' next game is Saturday against Kansas.\n                        \n                            --\n                        \n                            21-3\n                        \n                                7\n                            \n                                    Kansas\n                                \n                            Flory Bidunga finished with 23 points and 10 rebounds in Monday's 82-78 win over Arizona. The Jayhawks' next game is Saturday at Iowa State.\n                        \n                            --\n                        \n                            19-5\n                        \n                                8\n                            \n                                    Purdue\n                                \n                            Fletcher Loyer finished with 18 points and three rebounds in Tuesday's 80-77 overtime win at Nebraska. The Boilermakers' next game is Saturday at Iowa.\n                        \n                            --\n                        \n                            20-4\n                        \n                                9\n                            \n                                    Nebraska\n                                \n                            Pryce Sandfort missed eight of the 12 shots he attempted in Tuesday's 80-77 loss to Purdue. The Cornhuskers' next game is Saturday against Northwestern.\n                        \n                            --\n                        \n                            21-3\n                        \n                                10\n                            \n                                    Illinois\n                                \n                            Zvonimir Ivisic missed both of the 3-pointers he attempted in Tuesday's 92-90 loss to Wisconsin. The Illini's next game is Sunday against Indiana.\n                        \n                            --\n                        \n                            20-5\n                        \n                                11\n                            \n                                    Gonzaga\n                                \n                            Graham Ike finished with 20 points and seven rebounds in Tuesday's 83-53 win over Washington. The Zags' next game is Saturday at Santa Clara.\n                        \n                            --\n                        \n                            24-2\n                        \n                                12\n                            \n                                    Michigan St.\n                                \n                            Jeremy Fears Jr. finished with 26 points and 15 assists in Saturday's 85-82 overtime win over Illinois. The Spartans' next game is Friday at Wisconsin.\n                        \n                            --\n                        \n                            20-4\n                        \n                                13\n                            \n                                    Florida\n                                \n                            Xaivian Lee finished with 18 points and seven assists in Wednesday's 86-66 win at Georgia. The Gators' next game is Saturday against Kentucky.\n                        \n                            --\n                        \n                            18-6\n                        \n                                14\n                            \n                                    Virginia\n                                \n                            Jacari White finished with 19 points and four rebounds in Tuesday's 61-58 win at Florida State. The Cavaliers' next game is Saturday against Ohio State.\n                        \n                            --\n                        \n                            21-3\n                        \n                                15\n                            \n                                    Vanderbilt\n                                \n                            Tyler Tanner finished with 25 points and six assists in Tuesday's 84-76 win at Auburn. The Commodores' next game is Saturday against Texas A&M.\n                        \n                            --\n                        \n                            20-4\n                        \n                                16\n                            \n                                    St. John's\n                                \n                            Zuby Ejiofor finished with 25 points and seven rebounds in Monday's 87-82 overtime win over Xavier. The Red Storm's next game is Saturday at Providence.\n                        \n                            --\n                        \n                            19-5\n                        \n                                17\n                            \n                                    Texas Tech\n                                \n                            JT Toppin finished with 16 points and 18 rebounds in Wednesday's 78-44 win over Colorado. The Red Raiders' next game is Saturday at Arizona.\n                        \n                            --\n                        \n                            18-6\n                        \n                                18\n                            \n                                    Arkansas\n                                \n                            Darius Acuff Jr. finished with 28 points and five assists in Tuesday's 91-62 win at LSU. The Razorbacks' next game is Saturday against Auburn.\n                        \n                            --\n                        \n                            18-6\n                        \n                                19\n                            \n                                    Saint Louis\n                                \n                            Ishan Sharma finished with 15 points and two rebounds in Saturday's 82-58 win over La Salle. The Billikens' next game is Friday at Loyola Chicago.\n                        \n                            1\n                        \n                            23-1\n                        \n                                20\n                            \n                                    N. Carolina\n                                \n                            Derek Dixon missed eight of the nine shots he attempted in Tuesday's 75-66 loss at Miami. The Tar Heels' next game is Saturday against Pitt.\n                        \n                            1\n                        \n                            19-5\n                        \n                                21\n                            \n                                    Louisville\n                                \n                            Mikel Brown Jr. finished with 45 points and nine rebounds in Monday's 118-77 win over NC State. The Cardinals' next game is Saturday against Baylor.\n                        \n                            1\n                        \n                            18-6\n                        \n                                22\n                            \n                                    Clemson\n                                \n                            Jestin Porter missed seven of the eight shots he attempted in Wednesday's 76-66 loss to Virginia Tech. The Tigers' next game is Saturday at Duke.\n                        \n                            3\n                        \n                            20-5\n                        \n                                23\n                            \n                                    Miami (Ohio)\n                                \n                            Eian Elmer finished with 18 points and nine rebounds in Saturday's 90-74 win at Marshall. The RedHawks' next game is Friday against Ohio.\n                        \n                            --\n                        \n                            24-0\n                        \n                                24\n                            \n                                    BYU\n                                \n                            AJ Dybantsa finished with 36 points and seven assists in Tuesday's 99-94 win at Baylor. The Cougars' next game is Saturday against Colorado.\n                        \n                            --\n                        \n                            18-6\n                        \n                                25\n                            \n                                    Alabama\n                                \n                            Latrell Wrightsell finished with 21 points and three assists in Wednesday's 93-74 win at Ole Miss. The Crimson Tide's next game is Saturday against South Carolina.\n                        \n                            --\n                        \n                            17-7\n                        \n                                26\n                            \n                                    Kentucky\n                                \n                            Otega Oweh finished with 21 points and four rebounds in Saturday's 74-71 win over Tennessee. The Wildcats' next game is Saturday at Florida.\n                        \n                            --\n                        \n                            17-7\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1 college basketball rankings: Late surge lifts Michigan to win - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/e5fc5537-f8fa-4c51-8eb7-7d1ba2f95564/thumbnail/1200x675/7d19f436b27107f6b25d08e1d166beb0/michigan-t25-1.jpg"
      ],
      "datePublished": "2026-02-12T15:41:44.000Z",
      "dateModified": "2026-02-12T15:41:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Women's college basketball Power Rankings: Is Minnesota peaking at the right time? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-college-basketball-power-rankings-are-the-minnesota-golden-gophers-peaking-at-the-right-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/9d0a97de-41a3-4030-9ea3-faa537fa349d/thumbnail/1200x675/700ba6529b5666db3ae6df2161acf40b/wbbpowerrankings0212.png",
    "tag": "Sports",
    "date": "2026-02-12T15:36:38.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        Duke has entered the top 10 in the CBS Sports",
    "body": "\n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        Duke has entered the top 10 in the CBS Sports women's college basketball power rankings thanks to a 15-game winning streak, which includes a 59-58 road victory over Louisville last week. The Blue Devils have grown a lot throughout the season and are now the only undefeated team remaining in the ACC.Meanwhile, Iowa slipped out of the top 10 after losing three of its last four matchups -- including a 91-85 loss at home to Minnesota. The Hawkeyes haven't gone too far as they are only down to No. 12. They got a boost thanks to their 65-56 win over Washington on Wednesday night.For the Huskies, that result led them to fall off the power rankings. They were still being considered for No. 25, but Minnesota's win over Iowa helped the Golden Gophers' case to take that spot. It wasn't an easy decision because Washington did beat Minnesota on Jan. 18, but the win over Iowa shows Dawn Plitzuweit's squad could be peaking at the right time. Minnesota has also been competitive in close losses to other top opponents, including a one-point overtime loss to Maryland in December and a 10-point loss at Michigan in January. Until Iowa, Minnesota's best win had been a 63-62 result at USC on Jan. 11.One team experiencing a rollercoaster of a season is Iowa State. The Cyclones are still being affected by the absence of forward Addy Brown, who is out indefinitely with a lower-body injury. According to Big 12 analyst Rachel Gilligan, Iowa State became the first team in the conference to lose five consecutive games and then win five straight. However, that winning streak snapped with an 83-69 loss to BYU on Tuesday, which led the Cyclones to drop out of the rankings again.This is a big week for the SEC as No. 3 Texas will take on No. 6 Vanderbilt on Thursday. A few days later, No. 4 South Carolina and No. 5 LSU will meet in Baton Rouge on Valentines day. There is still a lot of basketball left to play in the regular season, but what happens in the next few days could give us a clearer picture of who could finish the SEC on top and perhaps even affect who might earn a No. 1 seed for the NCAA Tournament.Here are the latest CBS Sports women's college basketball Power Rankings.\nWomen's college basketball Power Rankings1\n                            \n    \n                                                \n                    \n    \n        \n                            Huskies\n                    \n    \n    Last week: 12\n                            \n    \n                                                \n                    \n    \n        \n                            Bruins\n                    \n    \n    Last week: 23\n                            \n    \n                                                \n                    \n    \n        \n                            Longhorns\n                    \n    \n    Last week: 34\n                            \n    \n                                                \n                    \n    \n        \n                            Gamecocks\n                    \n    \n    Last week: 45\n                            \n    \n                                                \n                    \n    \n        \n                            Lady Tigers\n                    \n    \n    Last week: 56\n                            \n    \n                                                \n                    \n    \n        \n                            Commodores\n                    \n    \n    Last week: 77\n                            \n    \n                                                \n                    \n    \n        \n                            Wolverines\n                    \n    \n    Last week: 88\n                            \n    \n                                                \n                    \n    \n        \n                            Buckeyes\n                    \n    \n    Last week: 119\n                            \n    \n                                                \n                    \n    \n        \n                            Sooners\n                    \n    \n    Last week: 910\n                            \n    \n                                                \n                    \n    \n        \n                            Blue Devils\n                    \n    \n    Last week: 1511\n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    Last week: 612\n                            \n    \n                                                \n                    \n    \n        \n                            Hawkeyes\n                    \n    \n    Last week: 1013\n                            \n    \n                                                \n                    \n    \n        \n                            Bears\n                    \n    \n    Last week: 1414\n                            \n    \n                                                \n                    \n    \n        \n                            Rebels\n                    \n    \n    Last week: 1215\n                            \n    \n                                                \n                    \n    \n        \n                            Terrapins\n                    \n    \n    Last week: 1616\n                            \n    \n                                                \n                    \n    \n        \n                            Horned Frogs\n                    \n    \n    Last week: 1317\n                            \n    \n                                                \n                    \n    \n        \n                            Mountaineers\n                    \n    \n    Last week: 2018\n                            \n    \n                                                \n                    \n    \n        \n                            Spartans\n                    \n    \n    Last week: 1719\n                            \n    \n                                                \n                    \n    \n        \n                            Wildcats\n                    \n    \n    Last week: 1920\n                            \n    \n                                                \n                    \n    \n        \n                            Tar Heels\n                    \n    \n    Last week: 2521\n                            \n    \n                                                \n                    \n    \n        \n                            Lady Volunteers\n                    \n    \n    Last week: 1822\n                            \n    \n                                                \n                    \n    \n        \n                            Lady Raiders\n                    \n    \n    Last week: NR23\n                            \n    \n                                                \n                    \n    \n        \n                            Crimson Tide\n                    \n    \n    Last week: 2224\n                            \n    \n                                                \n                    \n    \n        \n                            Tigers\n                    \n    \n    Last week: 2425\n                            \n    \n                                                \n                    \n    \n        \n                            Golden Gophers\n                    \n    \n    Last week: NRFirst five out: Washington, USC, Georgia, NC State, Iowa State\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Women's college basketball Power Rankings: Is Minnesota peaking at the right time? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/9d0a97de-41a3-4030-9ea3-faa537fa349d/thumbnail/1200x675/700ba6529b5666db3ae6df2161acf40b/wbbpowerrankings0212.png"
      ],
      "datePublished": "2026-02-12T15:36:38.000Z",
      "dateModified": "2026-02-12T15:36:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Basketball Hall of Fame finalists include Blake Griffin, Candace Parker, Doc Rivers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/blake-griffin-candace-parker-doc-rivers-naismith-hall-fame-finalists/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/ce2306fa-3cbd-456e-9815-bc2c42d8724f/thumbnail/1200x675/953c2b40ce78a7eeab13294812235193/griffin.jpg",
    "tag": "Sports",
    "date": "2026-02-12T14:05:34.000Z",
    "description": "\n\n\n    \n                                    This year's induction class will be announced during Final Four weekend\n        \n                         ",
    "body": "\n\n\n    \n                                    This year's induction class will be announced during Final Four weekend\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 11, 2026\n                            \n                    at\n    10:11 pm ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Naismith Basketball Hall of Fame has revealed its finalists for enshrinement this summer. The finalists are comprised of the North American, women's, men's veterans, women's veterans, international and contributors categories. This year's induction class will be announced on Saturday, April 4, at 12 p.m. and will be televised on ESPN 2. The announcement will coincide with Final Four weekend. \"This year's group of Finalists represents the full scope of basketball's impact, from the professional and collegiate ranks to high school, international play, officiating, and innovation,\" said Jerry Colangelo, the chairman of the Naismith Basketball Hall of Fame. \"Their achievements span championships, historic milestones, and a lasting influence on how the game is played, taught, and experienced around the world. Each Finalist has made a notable contribution to basketball's growth and excellence, and their collective legacy speaks to the power of the sport.\"This year's induction ceremony will be held on Saturday, Aug. 15 at the historic Symphony Hall in Springfield, Massachusetts.Naismith Basketball Hall of Fame 2026 finalists North American Committee FinalistsJoey Crawford [referee]: A 39-year NBA officiating veteran, Crawford officiated a record 374 playoff games and 50 NBA Finals games. He worked every NBA Finals series from 1986 to 2015. Mark Few [coach]: A two-time Naismith Coach of the Year, Few has led Gonzaga to two NCAA championship game appearance and 25 consecutive NCAA Tournament berths. He was also an assistant coach on the 2024 U.S. Olympic men's basketball team that won a gold medal. Blake Griffin [player]: A six-time All-Star, Griffin was a key part of the Los Angeles Clippers' \"Lob City\" era that also included Chris Paul and DeAndre Jordan. A thunderous dunker, Griffin won the Slam Dunk Contest in 2011, which was also the year when he was named NBA Rookie of the Year. Kevin Johnson [player]: Johnson spent his entire 12-year NBA career with the Phoenix Suns and was a significant member of their 1993 Western Conference championship team. During the 1990-91 season, Johnson was the first player in NBA history to average at least 20 points, 10 assists, a .500 field goal percentage, and two steals per game.Gary McKnight [coach]: Since becoming Mater Dei High School's coach in 1982, McKnight has led the team to over 13,000 victories, the second-most all-time among high school coaches. His list of individual honors includes the Naismith Boys' High School Coach of the Year Award in 2014. Dick Motta [coach]: Motta won championships at the high school, college and pro ranks. He led the Washington Bullets to an NBA title in 1978 and was named NBA Coach of the Year in 1971. Motta's other NBA accolades include the ninth-most victories and 14th-most regular season games coached.Doc Rivers [coach]: Rivers, who is currently coaching the Milwaukee Bucks, helped lead the Boston Celtics to an NBA title in 2008 and an Eastern Conference title in 2010. As coach of the Toronto Raptors, he won NBA Coach of the Year in 2000 while coaching future Hall of Famers Vince Carter and Tracy McGrady. He also had a successful run with Griffin in Los Angeles, and previously had a 13-year NBA career of his own.Kelvin Sampson [coach]: A two-time AP Coach of the Year, Sampson has guided two schools to the Final Four (Oklahoma once and Houston twice). Sampson recently became the became the 17th men's basketball coach (and fourth active) to reach 800 career wins. Amar'e Stoudemire [player]: A versatile and accomplished scorer, Stoudemire was a five-time All-NBA selection who averaged 21.4 points and 8.3 rebounds during his first eight seasons as a member of the Suns. He and Hall of Fame point guard Steve Nash led the Suns to three Western Conference finals appearances. Jerry Welsh [coach]: One of the most successful Division III men's basketball coaches in history, Welsh led SUNY Potsdam to a national title in 1981. Over a three-year span (1985-87), SUNY Potsdam set a Division III record with 60 consecutive victories. Buck Williams [player]: An elite rebounder, Williams ranks third in NBA history in offensive boards (4,526) and 16th in total rebounds (13,017). A four NBA All-Defensive Team selection, Williams was a key member of two Portland Trail Blazer teams that reached the NBA Finals. Women's Committee Finalists1996 United States Women's National Team: Coached by Tara VanDerveer, the '96 squad captured the gold medal while winning each of their eight games with an average margin of victory of over 30 points. The team's headliners included future Hall of Famers Lisa Leslie, Sheryl Swoopes, Dawn Staley, Teresa Edwards, Rebecca Lobo, and Katrina McClain. Jennifer Azzi [player]: A 2021 Women's Basketball Hall of Fame inductee, Azzi had a season for the ages in 1990 while at Stanford. That season, she won Naismith College Player of the Year and the NCAA Tournament's Most Outstanding Player while leading Stanford to a national title. She was also a member of the 1996 Olympic team. Elena Delle Donne [player]: An extremely accomplished WNBA player, Delle Donne's list of accolades included being a two-time league MVP and a member of the WNBA's 25th Anniversary Team. She led the Washington Mystics to their first WNBA title in 2019. Chamique Holdsclaw [player]: Holdsclaw had stellar careers at Tennessee and in the WNBA. After leading Tennessee to three consecutive national titles, Holdsclaw was a six-time All-Star during his 11-year WNBA career. She won a gold medal with the women's Olympic team in 2000. Candace Parker [player]: Like Holdsclaw, Parker had a memorable run at Tennessee before having even more success in the WNBA. She won two national titles at Tennessee before capturing three WNBA titles and two league MVP awards. Parker also won Olympic gold medals in 2008 and 2012. Women's Veterans Committee FinalistMolly Bolin-Kazmer [player]: Known as \"Machine Gun Molly\" for her prolific scoring ability, Bolin-Kazmer averaged 32.8 points in 1980-81, which was the highest professional scoring average ever by a woman. She led the Iowa Cornets to back-to-back WBL championship appearances (1979, 1980) and set a single-game scoring record with 55 points on March 2, 1980. International Committee FinalistDušan Ivković [coach]: A former Serbian player, Ivković won two EuroLeague championships (1997, 2012) and led the Yugoslavia national team to an Olympic silver medal in 1988 and to a FIBA World Championship title in 1990. He coached several future NBA stars that included Dražen Petrović, Vlade Divac, and Predrag Stojaković.Contributors Committee Finalists\nTal Brody: Brody opted to play in Israel despite being the 12th overall pick in the 1965 NBA Draft. During his playing career overseas, Brody won 10 Israeli League titles and six State Cups. In 1979, he became the country's first athlete to receive the Israel Prize, its highest civilian honor. Mike D'Antoni: One of the most innovative coaches in NBA history, D'Antoni's up-tempo, space-and-pace philosophy has changed how offense is played at virtually every level of basketball. A two-time NBA Coach of the Year, D'Antoni won a gold medal in 2012 as an assistant coach. Veterans Committee FinalistsMarques Johnson: Credited with pioneering the \"point forward\" role, Johnson helped lead UCLA to a national title in 1975 while playing for legendary coach John Wooden. He was a five-time NBA All-Star who averaged 20.1 points and 7.0 rebounds per game during his 11-year career.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Basketball Hall of Fame finalists include Blake Griffin, Candace Parker, Doc Rivers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/ce2306fa-3cbd-456e-9815-bc2c42d8724f/thumbnail/1200x675/953c2b40ce78a7eeab13294812235193/griffin.jpg"
      ],
      "datePublished": "2026-02-12T14:05:34.000Z",
      "dateModified": "2026-02-12T14:05:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Batting Around: Who's your favorite MLB broadcast booth? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-best-broadcast-booth/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/5d82644b-3952-4588-95af-6a1e56e61031/thumbnail/1200x675/1311534f7d34323d940958a874df581b/padres-getty.png",
    "tag": "Sports",
    "date": "2026-02-12T15:00:42.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Throughout spring training the CBS Sports MLB    e",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Throughout spring training the CBS Sports MLB    experts will bring you  a                                       weekly  Batting Around  roundtable,         breaking         down      pretty        much            anything.       The      latest   news, a       historical       question,            thoughts         about         the  future  of          baseball,   all      sorts of     stuff. Last week we picked our favorite moves of the offseason. This week we're going to tackle our favorite broadcast booths.Who are your favorite MLB announcers?Matt Snyder: The Mets are generally a popular answer and they are  great. I love the Giants, especially when it's Kuip and Kruk.The Tigers  now with Jason Benetti on play-by-play are up there because he's  excellent. The Dodgers, Braves and Cubs are very good as well, but no  other booth, for me, comes close to the Padres with Don Orsillo and Mark  \"Mudcat\" Grant. They have absolutely everything I want in a broadcast  booth. It's only two people instead of dealing with a \"too many cooks\"  situation, they are knowledgeable without being over-the-top with  numbers, have a nice blend of old- and new-school and generally are  always having fun. It's a joy. Dayn Perry: I hate to be unoriginal, but I have to agree with Matt  and elevate Don Orsillo and Mark Grant for this honor. Their rapport is  unmatched, in my opinion, and they keep the broadcast entertaining and  humorous without going off the rails. There's also real insight to be  found on Padres broadcasts. It's just the perfect blend of what you want  in a broadcast booth. R.J. Anderson: I'd also rate the Padres booth as the best in the  business. They're the perfect pair for late-night ball. I'll throw in  two other booths that haven't been mentioned that I enjoy: 1) Dewayne  Staats and Brian Anderson and 2) Wayne Randazzo and Mark Gubicza. Staats  is an all-timer who deserves his flowers and then some, and he has great  chemistry with Anderson. Meanwhile, Gubicza might be the most underrated  analyst in the majors. \nMike Axisa: Yeah, Don Orsillo/Mark Grant (Padres) is my favorite booth by a good bit. Perfect combination of levity and ball-knowing, especially for late-night broadcasts. They sound like two guys just hanging out at a bar, and that's the ideal broadcast vibe to me. I also really like the Aaron Goldsmith/Ryan Rowland-Smith booth (Mariners). I do miss the Dave Sims/Mike Blowers tandem the Mariners had for so long, but Goldschmidt/Hyphen is great too. Duane Kuiper/Mike Krukow (Giants) are all-timers. They still have their fastball. The Mets have a great booth too, especially when they do something dopey on the field and make Keith Hernandez audibly sigh.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Batting Around: Who's your favorite MLB broadcast booth? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/5d82644b-3952-4588-95af-6a1e56e61031/thumbnail/1200x675/1311534f7d34323d940958a874df581b/padres-getty.png"
      ],
      "datePublished": "2026-02-12T15:00:42.000Z",
      "dateModified": "2026-02-12T15:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One free agent every NFL team should keep: George Pickens, Kenneth Walker III and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/free-agent-nfl-team-george-pickens-kenneth-walker-iii/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/271dd393-ef32-4f4f-9699-ec0bb2dd7b7b/thumbnail/1200x675/acf8dc24051eda83c3fb1c64e67af43c/kenneth-walker-seahawks-g.jpg",
    "tag": "Sports",
    "date": "2026-02-12T15:14:47.000Z",
    "description": "\n        The NFL calendar appears to have hit one of its brief yearly respites. The Super Bowl is in the past, the Seahawks have celebrated their vict",
    "body": "\n        The NFL calendar appears to have hit one of its brief yearly respites. The Super Bowl is in the past, the Seahawks have celebrated their victory accordingly, and free agency is still several weeks away.That doesn't mean the league will go completely radio silent, though. Far from it, in fact, between now and March 9, when the free agent contract negotiation period begins, there's the franchise tag window, the NFL combine and plenty of player movement to take place. Teams will make significant release or re-sign decisions before free agency opens, and if history serves as precedent, a big trade or two could go down as well.\n        \n            \n                2026 NFL franchise tag primer: What we're hearing on top candidates and early tag decisions\n                \n                    Jonathan Jones                \n            \n                            \n    \n                \n                    \n    \nSeveral pending free agents will not actually end up hitting free agency, whether via the franchise tag or by re-signing with their team. Keeping that in mind, here is one pending free agent from each of the 32 teams whose 2025 team would be wise to make sure doesn't leave.NFC East\n                            \n    \n                                                \n                    \n    Cowboys: WR George PickensThis is an easy and obvious place to start. Dallas is expected to franchise tag George Pickens, which doesn't preclude them from signing him long term. An NFL Media report said just because the Cowboys franchise tag Pickens doesn't mean they won't trade him, either. But letting Pickens leave would be a major mistake. All of his intriguing potential came to be realized in 2025, when he caught 93 passes for 1,429 yards and nine touchdowns, all career highs. Dallas had a top-10 offense and the NFL's worst scoring defense, though the latter can potentially be fixed with the draft capital they recouped in the Micah Parsons deal. Losing Pickens would be a mistake, and CeeDee Lamb knows it. We'll see if Jerry Jones does.\n\n                            \n    \n                                                \n                    \n    Giants: WR Wan'Dale RobinsonThe Giants could wipe the slate clean in John Harbaugh's first offseason, but keeping Wan'Dale Robinson around makes sense. The elusive slot man had 92 catches for a career-high 1,014 yards in 2025, and he showed more downfield versatility than he had previously in his career: His 11.0 yards per reception was well up from his career mark of 8.2 entering the season. Robinson showed chemistry with Jaxson Dart, and with Malik Nabers working his way back from a major injury, Robinson's return would help Dart in his second year.\n                            \n    \n                                                \n                    \n    Eagles: LB Nakobe DeanWhether or not they can actually do it, keeping Nakobe Dean makes a world of sense for Philadelphia. Dean only recently turned 25 and has shown tremendous blitzing ability, especially as he emerged as a full-time player the past two seasons alongside Zack Baun. But he's also dealt with significant injury issues, which might keep his cost from becoming prohibitively high for the Eagles, who love their former Georgia defenders.\n                            \n    \n                                                \n                    \n    Commanders: WR Treylon BurksOne year after their breakthrough NFC Championship appearance, the Commanders backtracked to 5-12 due to underperformance and major injury issues. By the end of the season, it was a skeleton crew. But Treylon Burks, a 2022 first-round pick, made the most of his opportunities with 10 catches for 130 yards and a touchdown. Washington badly needs some youth and athleticism across the roster. Burks, 25, fits both.\nNFC North\n                            \n    \n                                                \n                    \n    Bears: S Jaquan BriskerThe Bears have several pieces of their secondary set to hit free agency, but JaQuan Brisker should be at or near the top of their list of retainees. Brisker had a bumpy 2025 season as a whole, but came into his own and played very well in the playoffs. He's an athletic player who is just 26 years old, and he moves all over the formation, working effectively as a pass rusher and run defender. The coverage needs improving, but his versatility can be very helpful as Chicago builds its defense.\n                            \n    \n                                                \n                    \n    Lions: EDGE Al-Quadin MuhammadAl-Quadin Muhammad might have been the most unlikely double-digit sack player of 2025. Muhammad had just 12 career sacks across his first six seasons. He did not appear in a game in 2023 and wasn't with any team in 2024 until the Lions scooped him up onto their practice squad. He had three sacks for an injury-ravaged Detroit defense that year and then had 11 in 2025, playing on a one-year deal. Muhammad is 30, so a big deal likely isn't needed, and Detroit should keep him in the place where his career renaissance happened.\n                            \n    \n                                                \n                    \n    Packers: LB Quay WalkerBetter against the run and in the pass rush than against the pass, Quay Walker didn't have his best season in 2025, but he still racked up 128 tackles and had 2.5 sacks and eight tackles for loss. He's only 25 years old, and his athletic profile -- especially his speed -- fits the Packers' team-wide athleticism on defense. Pairing Walker and Edgerrin Cooper makes sense under new defensive coordinator Jonathan Gannon.\n\n                            \n    \n                                                \n                    \n    Vikings: DL Jalen RedmondJalen Redmond is an exclusive rights free agent, meaning all the Vikings have to do is offer him a one-year contract at the league minimum in order to prevent him from negotiating with other teams. It's a no-brainer, and he should get more than that. Redmond, formerly a UFL player, had six sacks and 62 tackles in 2025 after one sack and 18 tackles in 2024. At 26, he's an ascending talent and a great find from Minnesota.NFC South\n                            \n    \n                                                \n                    \n    Falcons: LB Kaden EllissAmid yet another frustrating year for Atlanta, Kaden Elliss had a very good year and was superb as a pass rusher. He has started all 17 games each of his three seasons in Atlanta and has been serviceable against the run and in coverage in addition to his abilities as a blitzer. At 30 years old, he shouldn't cost too much, and with Atlanta retaining defensive coordinator Jeff Ullbrich, retaining the guy in the middle of the defense makes sense.\n                            \n    \n                                                \n                    \n    Panthers: WR Jalen CokerLike Redmond with the Vikings, Jalen Coker is an exclusive rights free agent who should absolutely stay put. The 2024 undrafted rookie free agent has shown enticing upside as a physical, big-bodied receiver with some legitimate juice. Offensive Rookie of the Year Tetairoa McMillan emerged as a standout this season, but behind him, it's an uncertain hodgepodge. Coker, at just 24, could emerge as the starting outside wide receiver outside McMillan.\n\n                            \n    \n                                                \n                    \n    Saints: DL Cameron JordanCameron Jordan just belongs in New Orleans, doesn't he? The eight-time Pro Bowler had 10.5 sacks in 2025, his most since 2021, and continues to be a consummate pro and team leader in the Big Easy. As the Saints continue to build, keeping a franchise icon in place should be top of mind.\n                            \n    \n                                                \n                    \n    Buccaneers: WR Mike EvansLike Jordan in New Orleans, it's almost impossible to envision Mike Evans somewhere other than Tampa Bay. Evans' 1,000-yard season streak may have ended at 11, but he remained a threat all over the field -- especially on deep passes and in the red zone -- in 2025 when he was on the field. Baker Mayfield played at a higher level with Evans on the field in 2025, too.NFC West\n                            \n    \n                                                \n                    \n    Cardinals: DL Calais CampbellAfter 18 seasons, Calais Campbell just keeps going. The well-traveled defensive lineman had 6.5 sacks -- tied for his most in the last seven seasons -- and appeared in all 17 games in his first season in Arizona. There are a lot of moving pieces for the Cardinals, who hired Mike LaFleur as coach and are likely to move on from Kyler Murray. Campbell's veteran presence will help ease LaFleur's transition. He'll also continue to be a positive influence on Walter Nolen III, who flashed as a rookie.\n\n                            \n    \n                                                \n                    \n    Rams: S Kamren CurlKamren Curl, 26, has well outplayed the two-year, $9 million deal he signed with Los Angeles two seasons ago. Always a willing tackler against the run, Curl is a steady presence for a team that very much needs that in the secondary, especially given the ups and downs of its cornerbacks. Even if the Rams add at cornerback -- especially given their two first-round picks -- having a solid veteran presence in Curl would be smart.\n                            \n    \n                                                \n                    \n    49ers: K Eddy PineiroIt may seem like a cop out to pick a kicker here. But considering the 49ers' prior struggles at the position under Kyle Shanahan, Eddy Pineiro was a revelation. Pineiro went 28 for 29 on field goals, good for an NFL-best 97%. \n                            \n    \n                                                \n                    \n    Seahawks: RB Kenneth Walker IIIThe Seahawks have several high-level players set to hit free agency. That's the cost of winning a Super Bowl, and Seattle will certainly take that over any alternative. Kenneth Walker III was the Super Bowl MVP, putting the icing on a tremendous postseason. No Super Bowl MVP has played for a different team the next season in over two decades. With Zach Charbonnet coming off a torn ACL, the Seahawks should make Walker, 25, a priority.\n\n        \n            \n                From Super Bowl MVP to free agent? Ranking where Seahawks star Kenneth Walker III could land\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nAFC East\n                            \n    \n                                                \n                    \n    Bills: C Connor McGovernConnor McGovern had a solid 2025, his third season in Buffalo. He offers positional versatility in a pinch -- he played guard in his first season with the Bills -- and has a strong rapport with Josh Allen. He was Pro Football Focus' No. 9-ranked center in 2025. \n                            \n    \n                                                \n                    \n    Dolphins: CB Rasul DouglasThe Dolphins signed Rasul Douglas shortly before the season amid a rash of cornerback injuries. Douglas turned around and produced one of his finest seasons as a pro. Douglas allowed just a 51% completion rate as the primary defender, and his 10 yards per completion allowed was the best of his career. The Dolphins figure to be overhauled under new coach Jeff Hafley, but keeping Douglas as a solid veteran presence would be a big help.\n                            \n    \n                                                \n                    \n    Patriots: EDGE K'Lavon ChaissonThe Patriots spent the most money in free agency last year, but K'Lavon Chaisson was arguably their best bang-for-your-buck deal. On a one-year $3 million deal, Chaisson had a career-high 7.5 sacks (and added three more in the postseason). At 26, Chaisson should have a robust market.\n\n                            \n    \n                                                \n                    \n    Jets: G Alijah Vera-TuckerAlijah Vera-Tucker missed the entire 2025 season after tearing his triceps days before the season opener, but prior to that, the former first-round pick had shown steady growth throughout his career. Still just 26, Vera-Tucker should figure into Aaron Glenn's plans in 2026 as the Jets continue to dig themselves out of a big hole. In 2024, Tucker was PFF's No. 10 guard.AFC North\n                            \n    \n                                                \n                    \n    Ravens: C Tyler LinderbaumTyler Linderbaum will be heavily in demand this offseason as the top interior offensive lineman available. A three-time Pro Bowler, Linderbaum has played in 66 of a possible 68 regular-season games for Baltimore. The Ravens have questions to answer at both guard spots, so ensuring there's a top-tier center in between them is key.\n                            \n    \n                                                \n                    \n    Bengals: QB Joe FlaccoThe Bengals' top outgoing free agent, Trey Hendrickson, is almost certainly gone. There's not a ton behind him, meaning Joe Flacco is the top option almost by default. After being acquired from Cleveland, Flacco stepped in ably when Joe Burrow was out. The Bengals know all too well that backup quarterback is a crucial role, and even if it's just for a few games or a few drives, they'd appreciate being able to turn to Flacco.\n\n                            \n    \n                                                \n                    \n    Browns: LB Devin BushDevin Bush has been a diamond-in-the-rough find for Cleveland, and he delivered a strong 2025 that included three interceptions -- two of which were returned for touchdowns -- and 125 tackles. Bush will be entering his eighth season at just 28 years old. He was PFF's No. 4 linebacker, only behind standouts Fred Warner, Jack Campbell and Devin Lloyd.\n                            \n    \n                                                \n                    \n     Steelers: RB Kenneth GainwellKenneth Gainwell had 1,023 yards from scrimmage in 2025, nearly 500 yards more than his previous career high. A big part of that was his 73 receptions, fourth-most among running backs behind Christian McCaffrey, Bijan Robinson and Jahmyr Gibbs. When asked to handle a bigger load with Jaylen Warren out, he excelled: 256 yards from scrimmage and two touchdowns in two starts.AFC South\n                            \n    \n                                                \n                    \n    Texans: DL Sheldon RankinsSheldon Rankins remains a solid all-around interior defender, and when surrounded by edge rushers such as Will Anderson Jr. and Danielle Hunter, he can be disruptive against the run and the pass. He had three sacks for Houston in 2025 and also had a fumble recovery returned for a touchdown in the regular season and in the playoffs. Dependable interior defenders are more valuable than one may think.\n\n                            \n    \n                                                \n                    \n    Colts: QB Daniel JonesYes, naming a quarterback coming off a torn Achilles the top priority for a team to re-sign seems counterintuitive. But this is the corner the Colts have backed themselves into after trading away two first-round picks for Sauce Gardner in an all-in attempt for 2025. Daniel Jones played very well at the start of the year, but started to tail off ahead of his injury. Regardless, the Colts have no other options at quarterback -- and few options to get one --  if they aim to be competitive in 2026.\n        \n            \n                Agent's Take: What's next for the Colts and Daniel Jones after his Achilles injury?\n                \n                    Joel Corry                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    Jaguars: LB Devin LloydDevin Lloyd broke out this season, finishing as a second-team All-Pro and PFF's No. 3 linebacker with 81 tackles, six tackles for loss and five interceptions, including a 99-yard pick-six. He had strong numbers against the run and the pass, and he has earned a big contract as a 27-year-old premier off-ball linebacker. The Jaguars should be the ones to give it to him.\n                            \n    \n                                                \n                    \n    Titans: TE Chig OkonkwoChig Okonkwo is yet to break out as his athleticism might suggest, but he has been a consistent contributor and one of the NFL's best after-the-catch tight ends. The Titans need to build around Cam Ward, and that includes improving his wide receivers and his offensive line. Okonkwo, though, would be a nice complementary piece.AFC West\n                            \n    \n                                                \n                    \n    Broncos: CB Ja'Quan McMillianThe Broncos have several players who fit the bill here, but Ja'Quan McMillian really stands out. He's a restricted free agent, meaning the Broncos will have the upper hand, if they so choose, via a tender. McMillian, 25, had a pair of interceptions and four sacks in 2025. He was one of just six players -- and the only defensive back -- to reach both marks. He also had the Broncos' biggest play of the year, picking off Josh Allen in the playoffs. A versatile, talented player, McMillian is a strong candidate to stay in Denver.\n                            \n    \n                                                \n                    \n    Chiefs: LB Leo ChenalLeo Chenal wasn't as good as he was in 2023 and 2024, though that can be said of many Chiefs players. Still, he's a homegrown 25-year-old who has turned into a solid starter -- at the very least -- after being picked outside the top 100. He shouldn't break the bank for the cash-strapped Chiefs, either.\n                            \n    \n                                                \n                    \n    Raiders: CB Eric StokesIt's very much a new day for the Raiders, who have a new coach (Klint Kubiak) and, in all likelihood, a new quarterback (Fernando Mendoza) on the way. Las Vegas had a dismal 2025, but Eric Stokes was a bright spot. The former Packers first-round pick allowed just 4.8 yards per attempt as the primary defender this season, the ninth-lowest number among 91 players who defended at least 40 passes this season.\n                            \n    \n                                                \n                    \n    Chargers: CB Benjamin St.-JusteSigned to just a one-year, $2.5 million deal, Benjamin St.-Juste had a strong season out of nowhere. He finished as PFF's No. 11 cornerback, ahead of several bigger names. St.-Juste is a big, physical cornerback, and often that physicality got him in trouble when he was with Washington. If he has turned the corner, though, the Chargers should retain him. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One free agent every NFL team should keep: George Pickens, Kenneth Walker III and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/271dd393-ef32-4f4f-9699-ec0bb2dd7b7b/thumbnail/1200x675/acf8dc24051eda83c3fb1c64e67af43c/kenneth-walker-seahawks-g.jpg"
      ],
      "datePublished": "2026-02-12T15:14:47.000Z",
      "dateModified": "2026-02-12T15:14:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]