[
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting Blue Jays-Dodgers in World Series Game 1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-targeting-blue-jays-dodgers-world-series-game-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:56:34.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Friday's sports sche",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Friday's sports schedule offers a plethora of betting options to choose from. Game 1 of the 2025 World Series gets underway at 8 p.m. ET when the Toronto Blue Jays host the Los Anagles Dodgers. There are also three college matchups set to unfold on Friday, as well as 12 NBA games, including Celtics vs. Knicks and Lakers vs. Timberwolves. SportsLine's proven computer model is backing the Over (7.5) in the Dodgers vs. Blue Jays opener, and it has also revealed a best bet for college football and the NBA. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. It is on a sizzling 43-28 run on top-rated picks dating back to 2024. Additionally, the model is up well over $10,000 for $100 players on top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. Anybody following its NBA betting picks and NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Friday's top picks, best betsBlue Jays vs. Dodgers: Over 7.5 runsCalifornia +5.5 vs. Virginia TechSpurs -3.5 vs. PelicansCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +595 (risk $100 to win $595). Bet it at bet365 here:\nDodgers vs. Blue Jays: Over 7.5 runsThere is no shortage of firepower in this year's World Series, as these have been the top two offenses in the postseason. Additionally, the Blue Jays had the top batting average (.265) in the majors during the regular season, and the Dodgers ranked second in home runs (244). The Blue Jays went Over in five of their last six games in the ALCS, and the model has the Over cashing in 65% of simulations on Friday. Bet it at bet365 here:California +5.5 vs. Virginia TechThese teams have been trending in opposite directions this season, as California heads into this game with a 5-2 record, while Virginia Tech is a disappointing 2-5. The Golden Bears are in the thick of the ACC title hunt, and they are one win away from securing bowl eligibility. Virginia Tech has dropped two straight games and has only covered the spread once in its last eight games. The model has identified value on California, which covers the spread 57% of the time. Bet it at bet365 now:Spurs -3.5 vs. Pelicans San Antonio went unbeaten during the preseason and built on that momentum with a 125-92 win at Dallas in its season opener on Wednesday night, pulling off the upset as a 3.5-point underdog. Center Victor Wembanyama flew up the MVP odds board after scoring 40 points and grabbing 15 rebounds in that game. The model has him finishing with 25.5 points and 11.3 rebounds in its simulations for Friday's game against New Orleans, helping the Spurs cover the spread 66% of the time. Bet it at bet365 here:\nLooking for Week 8 NFL picks?You've seen the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting Blue Jays-Dodgers in World Series Game 1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-24T20:56:34.000Z",
      "dateModified": "2025-10-24T20:56:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by betting Dodgers-Blue Jays, Cal-Virginia Tech, Nevada-Boise - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/use-betmgm-bonus-code-cbssports-get-150-bonus-dodgers-blue-jays-cal-virginia-tech-nevada-boise-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:28:02.000Z",
    "description": "\n        There are ample amount of opportunties for new users to take advantage of the latest etMGM bonus code CBSSPORTS, offering up to $1,500 in bon",
    "body": "\n        There are ample amount of opportunties for new users to take advantage of the latest etMGM bonus code CBSSPORTS, offering up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins. Game 1 of the 2025 World Series gets underway when the Los Angeles Dodgers take on the Toronto Blue Jays at 8 p.m. ET, and three college football matchups are set to unfold on Friday, including California vs. Virginia Tech (7:30 p.m. ET) and Boise State vs. Nevada (10 p.m. ET).Picks from all three of those games are among our MLB and college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every MLB game 10,000 times. It enters the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Friday's best bets at BetMGMDodgers money line vs. Blue Jays (-154)California +5.5 vs. Virginia Tech (-110)Over 51.5 points in Nevada vs. Boise State (-110)Combining these three picks into a Friday MLB and CFB parlay at BetMGM would result in a payout of +501 (risk $100 to win $501). Bet it at BetMGM here:Dodgers money line vs. Blue Jays (-154)\"The thing that matters most right now is the pitching of Blake Snell, who has won his last six starts, allowing a total of three runs. This is why he's a -150 favorite, and it might be cheap based on his current form,\" former Vegas bookmaker and SportsLine handicapper Micah Roberts said. \"This guy is pitching his best of the season, maybe career, and it came at the right time to start the playoffs. Not only Snell, but the entire starting pitching staff of the Dodgers is pitching their best of the season cumulatively for the NLCS, leading into the World Series. Snell hasn't allowed a run in his last two starts, both on the road, and pitched a season-high eight innings in his last game at Milwaukee. Back the Dodgers at BetMGM Sportsbook now:Cal +5.5 vs. Virginia Tech (-110)\"Virginia Tech has played a bit better since the firing of former coach Brent Pry, going 2-2 following an 0-3 start. At 5-2, Cal is a well-coached and solid team that is prone to the occasional lapse,\" SportsLine college football analyst Josh Nagel said. \"Last week, the Bears were rolling early against North Carolina before hitting a sleepwalking mode that nearly cost them the game. Expect them to bounce back with a focused effort against a Hokies club that appears to be fetching too much respect in this number.\" Back the Golden Bears at BetMGM Sportsbook now:\nOver 51.5 points in Nevada vs. Boise State (-110)These two Mountain West rivals are at opposite ends of the spectrum in recent years, with Nevada going 9-36 since the start of the 2022 season while Boise State is 35-14 in that span. The Broncos aren't likely to make the College Football Playoff like they did a season ago, but the offense has scored 41 points or more in five of its last six games. Meanwhile, the Boise State defense is also giving up 26.1 points per game, and Nevada just scored a season-high 22 points last week. It shouldn't take much of a contribution from the Wolfpack for this over to hit, and the model predicts that it does in 61% of simulations. Back the Over at BetMGM Sportsbook now:Want more NFL picks for this week?You've seen some of the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NFL game on the schedule, all from the model that's simulated every game 10,000 times. Also at SportsLine:\nYou can also see World Series picks from legendary handicapper Bruce Marshall, who is 182-168-3 (+2940) over his last 353 MLB picks. See his best bets right here. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by betting Dodgers-Blue Jays, Cal-Virginia Tech, Nevada-Boise - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-24T20:28:02.000Z",
      "dateModified": "2025-10-24T20:28:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by backing Dodgers-Blue Jays, Hawks-Magic, Pelicans-Spurs today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/use-fanduel-promo-code-get-300-bonus-bets-dodgers-blue-jays-hawks-magic-pelicans-spurs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-24T21:29:29.000Z",
    "description": "\n        Friday's sports calendar is action-packed, with games unfolding in the MLB, NBA, NHL and college football, providing bettors an opportunity t",
    "body": "\n        Friday's sports calendar is action-packed, with games unfolding in the MLB, NBA, NHL and college football, providing bettors an opportunity to take advantage of the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. Game 1 of the 2025 World Series begins on Friday when the Toronto Blue Jays host the Los Angeles Dodgers at 8 p.m. ET. According to the latest MLB odds at FanDuel Sportsbook, the Dodgers are -154 money line favorites, while the over/under for total runs scored is 7.5. In the NBA, the Atlanta Hawks (0-1) will play the Orlando Magic (1-0) at 7 p.m. ET. Later in the evening, the San Antonio Spurs (1-0) and New Orleans Pelicans (0-1) will battle at 8 p.m. ET.SportsLine's model has the over cashing (7.5) in Dodgers vs. Blue Jays, with the over hitting in 64% of simulations of the MLB odds. The model's best bets also include the Magic covering the spread (-4.5) against the Atlanta Hawks in 60% of simulations of the NBA odds. Meanwhile, SportsLine's model is backing the Spurs to cover the spread (-4) on the road against the New Orleans Pelicans in 62% of simulations. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Best Friday picksHawks vs. Magic (-4.5) (-110)Spurs (-4) vs. Pelicans (-110)Dodgers vs. Blue Jays: Over 7.5 total runs (-105)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +605 (risk $100 to win $605). Bet it at FanDuel here:\nHawks vs. Magic (-4.5) (-110)In the opener, the Hawks lost by 20 points to the Raptors, with the Magic coming away with a 125-121 win over the Miami Heat. Orlando has also beaten the Hawks in two of the last three games. Atlanta allowed 138 total points, while the Magic had five players score in double figures on Wednesday. Last season, Orlando was 18-11 ATS as the home favorite and 32-26 ATS in conference games. SportsLine's model has the Magic covering the spread in 60% of simulations. Bet Magic to cover at FanDuel Sportsbook:Spurs (-4) vs. Pelicans (-110)San Antonio was able to score the ball at ease in the opener against the Mavericks, scoring 125 total points and shooting 57% from the field. Victor Wembanyama poured in 40 points, 15 rebounds, and three blocks. Meanwhile, last season New Orleans was 19-29-1 ATS with one day off and 24-35 ATS following a loss. In the loss to the Grizzlies, the Pelicans allowed Memphis to shoot 51% from the floor. SportsLine's model has San Antonio covering the spread in 62% of simulations. Bet Spurs to cover at FanDuel Sportsbook:Dodgers vs. Blue Jays: Over 7.5 total runs (-105)This regular season, the Dodgers were second in the league in team runs per game (5.06), and Toronto is right behind them at third (5.02). The over has cashed in five of their last six games for the Blue Jays. In addition, the over hit in two of the three regular-season games between these teams. Los Angeles' Shohei Ohtani has five home runs this postseason. Toronto's Vladimir Guerrero owns six home runs and 12 runs driven in the playoffs. SportsLine's model has these teams combining for 9.4 total runs and the over hitting in 64% of simulations. Bet Dodgers vs. Blue Jays over at FanDuel Sportsbook:\nWant more NBA picks?You've seen the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by backing Dodgers-Blue Jays, Hawks-Magic, Pelicans-Spurs today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-24T21:29:29.000Z",
      "dateModified": "2025-10-24T21:29:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by targeting Rockets, World Series Over - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/use-draftkings-promo-code-get-300-bonus-bets-free-nba-league-pass-rockets-blue-jays-dodgers-game-1-world-series/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:23:34.000Z",
    "description": "\n        The Toronto Blue Jays host the Los Angeles Dodgers for Game 1 of the 2025 World Series on Friday night. Dodgers vs. Blue Jays is just one of ",
    "body": "\n        The Toronto Blue Jays host the Los Angeles Dodgers for Game 1 of the 2025 World Series on Friday night. Dodgers vs. Blue Jays is just one of many enticing options on Friday's sports schedule, which inlcudes games in the NBA, NHL and college football. SportsLine's advanced computer model sees strong value in backing Over 7.5 runs scored for World Series betting, projecting the Over to hit in 67% of simulations as one of its Friday best bets at DraftKings when online sports betting. With the latest DraftKings promo code, new users can get $300 in bonus bets and three free months of NBA League Pass.The model also sees value in other sports in action on Friday, such as the Houston Rockets to cover as 6.5-point favorites over the Detroit Pistons in NBA betting, and California to cover as 6-point underdogs against Virginia Tech in college football betting for Friday best bets at DraftKings. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. It enters the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. Anyone following its NBA betting advice or MLB betting picks at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookDodgers vs. Blue Jays Over 7.5 total runs (-115)Rockets (-6.5) vs. Pistons (-108)Cal +6 vs. Virginia Tech (-108)Combining the model's three picks into a Friday parlay at DraftKings would result in a payout of +593 (risk $100 to win $593). Bet it at DraftKings here:\nDodgers vs. Blue Jays Over 7.5 total runs (-115)These are two of the top five scoring offenses in baseball this season, with the Dodgers second at 5.09 runs per game and the Blue Jays fourth at 4.93 runs per game going head-to-head to determine the best team in the sport. Both teams showcased their offensive abilities in the League Championship Series as well, with the Dodgers posting five runs in two of four NLDS games, and the Blue Jays averaging 6.6 runs per game over their final five contests. The Blue Jays are starting 22-year-old rookie Trey Yesavage, who didn't make his MLB debut until Sept. 15, as he's barely more than 12 months removed from pitching in college mounds while playing for East Carolina. The model projects the Over to hit in 67% of simulations. Back the Over at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Rockets (-6.5) vs. Pistons (-108)The Rockets led nearly the entirety of their season opener on the road against the defending champion Oklahoma City Thunder before a 125-124 double-overtime loss. But Houston proved night one that it's ready to compete with the best teams in the league after trading for Kevin Durant, who had 23 points on Tuesday. Alperen Sengun dominated with 39 points, 11 rebounds and seven assists and Amen Thompson added 18 points, four rebounds and five assists. Meanwhile, the Pistons opened with a 115-111 loss to the Bulls. The model projects the Rockets to cover in 63% of simulations. Back the Rockets at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Cal +6 vs. Virginia Tech (-108)Cal improved to 5-2, including 2-1 in the ACC, with a 21-18 victory over North Carolina last week. The Golden Bears never trailed against Bill Belichick's Tar Heels, and the defense forced three turnovers against North Carolina. Cal has forced multiple turnovers in two of its last four games. Turnovers have been the biggest differentiator in the Golden Bears' season, with five forced turnovers over their last two victories, compared to turning the ball over seven times in their last two losses. If the Golden Bears prioritize being careful with the football, they can pull off the upset, or at least keep the score close enough to cover the spread. Virginia Tech is 2-5 this season despite being home in five of those games, going 1-4. Homefield advantage hasn't been much of an advantage for the Hokies, leading the model to project Cal to cover in 56% of simulations. Back Cal at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:\nWant more World Series picks and NBA picks?You've seen the model's Friday best bets. Now, get against the spread, total and money-line picks for all games on Friday, including NBA, college football, World Series and NHL, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by targeting Rockets, World Series Over - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-10-24T20:23:34.000Z",
      "dateModified": "2025-10-24T20:23:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seattle Storm expected to hire Liberty assistant Sonia Raman as next coach, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/seattle-storm-expected-to-hire-liberty-assistant-sonia-raman-as-next-coach-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/c1de6a05-66ad-4bf3-8529-0ff2e12e0225/thumbnail/1200x675/1f8553f2d6b452662419d00fdde5e2d9/sonia-raman.jpg",
    "tag": "Sports",
    "date": "2025-10-24T21:35:24.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Seattle Storm are set to hire New York Liberty",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Seattle Storm are set to hire New York Liberty assistant coach Sonia Raman as their next coach, according to ESPN's Shams Charania. Raman joins the Storm after a coaching career that spans across the collegiate and professional ranks and in both the WNBA and NBA.Prior to her lone season with the Liberty this year, Raman was an assistant for the NBA's Memphis Grizzlies from 2020 to 2024. Before making the jump to the professional ranks, she was the head coach of MIT women's basketball team for 12 years between 2008 and 2020. During her tenure, she led the team to its first two conference championships and two NCAA Tournament appearances at the Division III level. Before that, she was the lead assistant at Wellesley College for six seasons, and began her coaching career at her alma mater of Tufts University.Raman comes with a wealth of coaching experience at a variety of levels, and becomes the first person of Indian-origin to become a head coach in the WNBA. Raman also interviewed for the Liberty's head coaching vacancy, according to The Athletic's Ben Pickman, after the team parted ways with Sandy Brondello following a first-round playoff exit to the Phoenix Mercury. Ultimately, though, she lands the lead job with the Storm where she'll look to aid in the development of Dominique Malonga, who earned All-Rookie honors this past season.Raman takes over after the Storm parted ways with Noelle Quinn in September following a first-round playoff exit. Quinn spent seven seasons with the Storm, two of which were as an assistant before being elevated to head coach in 2021. She led the team to four playoff appearances in her five seasons in charge, but in the last two years could not make it out of the first round. Following the end of the 2024 season, Quinn and her coaching staff were investigated for alleged mistreatment of players that included bullying and harassment. Quinn and her staff were cleared of any wrongdoing, but Jewell Loyd requested a trade from the team, who then became a vital piece of the Las Vegas Aces' title run this year.\nFollowing the early playoff exit, the Storm face an offseason with several questions to answer. Only two players are under contract for next season, and with Malonga expected to be the future face of the franchise, the Storm have to figure out how they want to approach next season.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seattle Storm expected to hire Liberty assistant Sonia Raman as next coach, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/c1de6a05-66ad-4bf3-8529-0ff2e12e0225/thumbnail/1200x675/1f8553f2d6b452662419d00fdde5e2d9/sonia-raman.jpg"
      ],
      "datePublished": "2025-10-24T21:35:24.000Z",
      "dateModified": "2025-10-24T21:35:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Vesia left off Dodgers' World Series roster as reliever deals with 'deeply personal family matter' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-world-series-roster-alex-vesia/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/5e5ca408-a146-4c86-9b18-989151d5ebf1/thumbnail/1200x675/603f820f516a65125b658256c29bd3d5/vesia-getty.png",
    "tag": "Sports",
    "date": "2025-10-24T22:23:48.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Dodgers reliever Alex Vesia is not on ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Dodgers reliever Alex Vesia is not on the club's World Series roster as he deals with what the team characterized Thursday as \"a deeply personal matter\" within his family. Manager Dave Roberts told reporters Friday ahead of Game 1 versus the Blue Jays that Vesia \"most likely\" won't participate in the series.\"I think that's probably the most likely,\" Roberts said. \"Unless something unforeseen happens, that's kind of what we're anticipating.\"Vesia is not on family medical emergency list, Dodgers president of baseball operations Andrew Friedman confirmed. If he were on the list, Vesia could be activated later in the World Series. As it is, he can be added only to replace an injured player.\"We just didn't want to have any potential for any kind of pressure,\" Friedman said Friday before Game 1. \"This is so much bigger than baseball. For us, it was doing whatever small part we could to just a hundred percent be supportive.Here is the club's Thursday statement in full: \"It's with a heavy heart that we share that Alex Vesia is away from the team as he and his wife Kayla navigate a deeply personal family matter. The entire Dodgers organization is sending our thoughts to the Vesia family, and we will provide an update at a later date.\"This year, the 29-year-old left-hander made 68 appearances for the Dodgers during the regular season with an ERA of 3.02 and 80 strikeouts and 19 unintentional walks in 59 ⅔ innings. During the team's current playoff run, Vesia has a 3.86 ERA in 4 ⅔ innings. Over that span, he's allowed a run in only one of his seven appearances. Vesia has been a reliable fixture in the Dodger bullpen since they acquired him from the Miami Marlins via trade in February of 2021. \nGame 1 of the World Series is scheduled for Friday in Toronto at 8 p.m. ET.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Vesia left off Dodgers' World Series roster as reliever deals with 'deeply personal family matter' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/5e5ca408-a146-4c86-9b18-989151d5ebf1/thumbnail/1200x675/603f820f516a65125b658256c29bd3d5/vesia-getty.png"
      ],
      "datePublished": "2025-10-24T22:23:48.000Z",
      "dateModified": "2025-10-24T22:23:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 8 Sunday NFL DFS picks, lineup advice for FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-week-8-fanduel-draftkings-daily-fantasy-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/dbaaee37-10b4-4c20-848f-40aa25138b94/thumbnail/1200x675/fb3ebe1e00f04ab1a3fc6c613ed001a4/jamarr-chase-bengals-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:46:02.000Z",
    "description": "\n        Building winning NFL DFS lineups requires finding the right mix of big-name fantasy stars to combine with NFL DFS sleepers when making NFL DF",
    "body": "\n        Building winning NFL DFS lineups requires finding the right mix of big-name fantasy stars to combine with NFL DFS sleepers when making NFL DFS picks. Among the marquee matchups in the early window of the Week 8 NFL schedule are Bills vs. Panthers, Eagles vs. Giants, and Bears vs. Ravens. In the afternoon window, there is Cowboys vs. Broncos, Buccaneers vs. Saints, and Titans vs. Colts, all of which could be fast-paced offensive contests.Which players should you target in your core NFL DFS picks for Week 8 on Sunday, and which potential NFL DFS values could help your NFL DFS lineups cash? Before locking in any NFL DFS picks on sites like DraftKings and FanDuel for Sunday, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him is way up.Now, McClure has turned his attention to Sunday and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New players can get $50 in Pick6 credits at DraftKings when they play $5: Top NFL DFS picks for Week 8One of McClure's top NFL DFS picks for Sunday is Bengals wide receiver Ja'Marr Chase. The former LSU standout exploded in 2024 with one of the most dominant statistical seasons at wide receiver in NFL history, recording 127 receptions for 1,708 yards and 17 touchdowns to claim the receiving \"Triple Crown.\" He averaged over 100 yards per game and cemented his status as one of the NFL's premier playmakers. Chase has continued to produce at a high level in 2025 with 58 catches for 629 yards and five touchdowns through seven games, though his yards per reception have dipped slightly to 10.8. He remains the focal point of the Bengals' passing attack and one of the most feared receivers in football. See who else to roster here.Part of McClure's optimal NFL DFS strategy also includes rostering Falcons running back Bijan Robinson. The former Texas standout took a big step forward in 2024, carrying the ball 304 times for 1,456 yards and 14 rushing touchdowns while adding 61 receptions for 431 yards and another score through the air. That breakout season firmly established him as one of the NFL's premier dual-threat running backs. Through six games in 2025, Robinson has totaled 97 carries for 524 yards (5.7 yards per carry) and two touchdowns, along with 30 receptions for 390 yards and two scores. His efficiency has improved in both rushing and receiving, showcasing his continued development and explosiveness. The Falcons' offense remains built around his versatile skill set, utilizing him as both a workhorse on the ground and a dynamic weapon in the passing game. See who else to roster here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:How to set NFL DFS lineups for Week 8McClure is targeting another undervalued player who could explode for huge numbers on Sunday. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Sunday, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 Sunday NFL DFS picks, lineup advice for FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/dbaaee37-10b4-4c20-848f-40aa25138b94/thumbnail/1200x675/fb3ebe1e00f04ab1a3fc6c613ed001a4/jamarr-chase-bengals-cbs.jpg"
      ],
      "datePublished": "2025-10-24T20:46:02.000Z",
      "dateModified": "2025-10-24T20:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics star Jaylen Brown says NBA has not prepared, protected players in new sports betting environment - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-star-jaylen-brown-says-nba-has-not-prepared-protected-players-in-new-sports-betting-environment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/67f6f2e9-89f0-4027-90dc-6691e9e8de6e/thumbnail/1200x675/419408209181e4ca785a30055852a6e4/gettyimages-2240653793-1-1.jpg",
    "tag": "Sports",
    "date": "2025-10-24T21:39:44.000Z",
    "description": "\n        The arrests of Chauncey Billups and Terry Rozier in the federal investigation into sports betting and illegal gambling called into question h",
    "body": "\n        The arrests of Chauncey Billups and Terry Rozier in the federal investigation into sports betting and illegal gambling called into question how the NBA is working to protect its players from the dark side of the wagering world. And according to Boston Celtics forward Jaylen Brown, the league has not done enough in that regard.Brown, who serves as a vice president of the National Basketball Players Association, lamented the lack of discourse between the league and its athletes about staying safe in the era of legalized sports betting. Whether it be the dangers of soliciting information to bettors or fans' regrettable behavior towards players, Brown said there is ample work to be done in keeping players out of harm's way.\"A lot more could have been done to help players and prepare players,\" Brown said in his Friday pregame media availability. \"But even in the aftermath, I don't think little care or attention to detail goes into it. They're like, 'You make X amount of money or X, Y and Z, you should be able to deal with all the extra negativity, people approaching you about parlays. It creates a negative discourse around the game and players when people have money involved.\"Complicating matters is that the NBA has business partnerships with sportsbooks, which produce immense revenue from wagers made on the league's games, teams and individual players. Commissioner Adam Silver called this week for stricter regulations on sports betting and said the NBA asked some of its partners to pull back on some of their player prop bet offerings in an attempt to prevent game manipulation.\n\"I don't think once from my conversations with the union and the NBA has been like 'How can we protect players more with the environment?'\" Brown said. \"There's been little to no conversation about that. It's all about 'How can we increase business and increase revenue?' I'm not sure if we're having enough conversations about the aftermath or the consequences some of that stuff has.\"Billups and Rozier were among the more than 30 people arrested by the FBI as part of the investigation. Billups was allegedly connected with illegal high-stakes poker games, and Rozier was allegedly tied to a ring of current and former NBA players trading inside information with bettors.\"That whole world was introduced a couple of years ago, and I don't think they took players into consideration, especially with the energy and the behavior that goes around gambling and how that directly correlates with players,\" Brown said. \"We don't benefit from any of the profits or anything like that, but we gotta deal with a lot of the extra negativity and scrutiny behind all the gambling stuff. On top of that, it creates more integrity issues, et cetera. I'm not sure what the answer is going forward, but definitely something that people gotta spend more time having conversations about.\"\nThis is the NBA's second major gambling scandal in the last two years. The league banned Jontay Porter in 2024 for his role in a scheme involving his prop bets.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics star Jaylen Brown says NBA has not prepared, protected players in new sports betting environment - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/67f6f2e9-89f0-4027-90dc-6691e9e8de6e/thumbnail/1200x675/419408209181e4ca785a30055852a6e4/gettyimages-2240653793-1-1.jpg"
      ],
      "datePublished": "2025-10-24T21:39:44.000Z",
      "dateModified": "2025-10-24T21:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch 49ers vs. Texans: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-49ers-vs-texans-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/3923502b-ac32-476c-ba6e-ad29ad0a097f/thumbnail/1200x675/9cde2d3e04bd756ac191d47967434239/christian-mccaffrey-falcons.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:48:26.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The injury-ravaged 49ers will look to keep pace in the NFC West with a win against the Texans\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 24, 2025\n                            \n                    at\n    4:48 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Texans will host the 49ers in a battle of teams that aren't currently operating at full strength. It's safe to say that San Francisco has been heavily impacted by the injury bug in 2025. Brock Purdy, Brandon Aiyuk, Fred Warner, and Ricky Pearsall are just some of the 49ers that are currently sidelined. Still, San Francisco has managed to produce a 5-2 record. The 49ers came away with a hard-fought 20-10 win against the Atlanta Falcons in Week 7.Meanwhile, the Texans haven't been as fortunate to begin the 2025 campaign. Houston has started 2-4 and is fresh off a 27-19 loss at the hands of the Seattle Seahawks. To make matters worse, the Texans could be without star wide receiver Nico Collins, who suffered a concussion against the Seahawks.Click here to bet 49ers vs. Texans at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:\nWhere to watch 49ers vs. Texans liveDate: Sunday, Oct. 26 | Time: 1 p.m. ETWhere: NRG Stadium -- Houston, TexasTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Texans -1.5; O/U 41.5 (via FanDuel)49ers vs. Texans: Need to knowSan Francisco must keep feeding McCaffrey. The 49ers definitely missed star running back Christian McCaffrey during last season as he was limited to just four games due to injury. Entering Week 8, McCaffrey has paced San Francisco's offense and leads the NFL with 981 scrimmage yards. While his 3.5 yards per carry isn't lighting the world on fire, he's continued to be an offensive weapon when it comes to catching the ball out of the backfield. Considering that the 49ers are shorthanded at wide receiver, getting the ball in McCaffrey's hands will be essential to the team's success.Jones to remain under center.  Purdy has been dealing with a toe injury that has sidelined the 49ers starting quarterback for five games. Mac Jones hasn't been flashy, but has played well in relief of Purdy up to this point. The former first-round pick is completing 67.0% of his passes for 1,404 yards to go along with six touchdowns. Jones isn't a flashy signal caller, but has managed to lead San Francisco to four wins across his five starts.Texans could be shorthanded at wide receiver. Entering the season, the Texans were already at a disadvantage at the wide receiver position after losing Tank Dell to an awful knee injury in 2024. Veteran receiver Christian Kirk has been limited to just three games this season as he deals with a nagging hamstring injury. Kirk is currently being listed as questionable Sunday's contest as is the status of star wideout Nico Collins. Collins suffered a concussion during the fourth quarter of Monday's game against the Seahawks, so he'd have to complete all the protocols before being medically cleared to suit up. If Collins and Kirk are sidelined, Xavier Hutchinson, rookie Jaylin Noel, and Dalton Schultz will likely see increased targets against San Francisco.49ers vs. Texans pick, prediction\nThis has the potential to be one of the more lower-scoring games of Week 8. It's no secret that the 49ers are extremely banged up on both sides of the ball, but still have the potential to pull off the narrow upset on the road. Jones continues to excel filling in for Purdy and the offense will do just enough to win. Pick: 49ers +1.5, Under 41.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch 49ers vs. Texans: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/3923502b-ac32-476c-ba6e-ad29ad0a097f/thumbnail/1200x675/9cde2d3e04bd756ac191d47967434239/christian-mccaffrey-falcons.jpg"
      ],
      "datePublished": "2025-10-24T20:48:26.000Z",
      "dateModified": "2025-10-24T20:48:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs rookie LT Josh Simmons to rejoin team in 'a few weeks' after absence for personal reasons, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-rookie-lt-josh-simmons-to-rejoin-team-in-a-few-weeks-after-absence-for-personal-reasons-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/12653b33-94dc-45b2-8f2f-df149639ceb6/thumbnail/1200x675/1096dafd0f5e21e70dbaaaffba102dc8/adobe-express-file-26.jpg",
    "tag": "Sports",
    "date": "2025-10-24T23:36:33.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kansas City Chiefs left tackle Josh Simmons is exp",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kansas City Chiefs left tackle Josh Simmons is expected to rejoin the team in a few weeks, according to ESPN. The rookie started the first five games of his career but missed the last two weeks with what was described as a \"family situation.\" He has not practiced this week and is reportedly set to miss at least one more game with the Chiefs set to host the Washington Commanders on \"Monday Night Football.\"Simmons, the No. 32 overall pick in the 2025 NFL Draft, returned home to California prior to the Chiefs' Week 6 game and was ruled out on the availability report with a \"personal\" designation. Coach Andy Reid initially declined to comment on the situation but this week offered a positive update on his first-year offensive lineman.\"My update for you with Josh would just be, there's communication,\" Reid said. \"I'm not going to get into all of it. Everything's positive. It's not a negative situation. He's taking care of family.\"Simmons protects quarterback Patrick Mahomes' blind side, and in his absence, backup Jaylon Moore stepped into the lineup to handle the blocking duties in victories over the Detroit Lions and Las Vegas Raiders. When asked for comment on Simmons' situation, Mahomes said he would keep things behind closed doors.\n\"I'll keep conversations kind of between us,\" Mahomes said last week. \"But I'm always praying for him. I'm praying for all my teammates, so I'm always praying for him. I'll just keep everything else kind of private to us.\"The Chiefs are 2-0 without Simmons and won their last two games by at least two scores. They racked up 30 points against the Lions and 31 points against the Raiders.\nThis is the second time in as many seasons that Simmons missed extended time. He sat more than half of his final year at Ohio State after he suffered a season-ending knee injury, but he still played a key role in the Buckeyes' run to the national championship. Across his six games in the lineup, Simmons posted the lowest pressure rate (0.7%) of any tackle in the country with at least 100 pass-blocking snaps.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs rookie LT Josh Simmons to rejoin team in 'a few weeks' after absence for personal reasons, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/12653b33-94dc-45b2-8f2f-df149639ceb6/thumbnail/1200x675/1096dafd0f5e21e70dbaaaffba102dc8/adobe-express-file-26.jpg"
      ],
      "datePublished": "2025-10-24T23:36:33.000Z",
      "dateModified": "2025-10-24T23:36:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Patriots vs. Browns: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-patriots-vs-browns-tv-channel-live-stream-prediction-pick-odds-spread/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/84af6dbc-41fc-4de8-8c55-3948d0f09222/thumbnail/1200x675/68f0a661788425b6060469006f437de2/drake-maye-mike-vrabel.jpg",
    "tag": "Sports",
    "date": "2025-10-24T21:29:53.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Drake Maye has been great for New England, but Cleveland's defense could present a bigger challenge\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 24, 2025\n                            \n                    at\n    5:29 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The New England Patriots three-game road trip is over and this week they will host the Cleveland Browns. The Patriots are on a four-game win streak and the Browns got a win last week against the Dolphins to end their three-game losing streak. Cleveland currently sits at 2-5, while the Patriots are 5-2.The Patriots are one of the top teams in the AFC right now and have already passed their win total from the 2024 season. Drake Maye is looking like the real deal and the team is getting attention under Mike Vrabel, who is in his first season coaching his old team.The Browns dealt with their share of drama in the offseason, with multiple quarterbacks to choose from. Their Week 1 starter Joe Flacco is now on the Cincinnati Bengals and it's 2025 third-round pick Dillon Gabriel who the team is moving forward with.\nWhere to watch Patriots vs. Browns liveDate: Sunday, Oct. 26 | Time: 1 p.m. ETLocation: Gillette Stadium -- Foxboro, MassachusettsTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Patriots -7; O/U 40.5 (via DraftKings)    Patriots vs. Browns: Need to knowDrake Maye is breaking records. Maye is only in year two and is already breaking some records previously set by Tom Brady. Not bad company for the sophomore quarterback. Last week against the Titans, Maye had a 91.3% completion rate which broke Brady's best single-game record (and franchise record) of 88.5. Maye is also the first player in NFL history to record 4,000 passing yards and 500 rushing yards with at least a 69% completion percentage in the first 20 games of their career. The Browns defense will be a tougher challenge. While many are praising the Patriots success this year, others have said New England has yet to face a real challenge, particularly a team with a solid defense, which is something that the Browns have. Cleveland is struggling to rack up wins but its defense has been a bright spot this season. This will be one of the tougher defenses the Patriots have faced this season and it's a chance for New England's offense to prove itself against a capable squad or show the holes the team has. The Patriots' challenge this week will be to not go back to what they were doing earlier in the season when they were turning over the football.Protect Dillon Gabriel. The Browns quarterback had his best game last week, granted it was against a struggling Dolphins team, but is still a confidence booster for the first-year player. Gabriel hasn't turned the ball over this season, but opposing defenses are getting pressure on him. In total the Browns have allowed 19 sacks on their quarterback this season, including 10 on Gabriel. Protecting the young QB will be crucial.Patriots vs. Browns prediction, pick\nI think the Patriots will continue their winning streak alive, but the Browns defense will put up a good fight. I think Gabriel will see his first pick this week. Pick: Patriots -7; Over 40.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Patriots vs. Browns: TV channel, live stream, prediction, pick, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/84af6dbc-41fc-4de8-8c55-3948d0f09222/thumbnail/1200x675/68f0a661788425b6060469006f437de2/drake-maye-mike-vrabel.jpg"
      ],
      "datePublished": "2025-10-24T21:29:53.000Z",
      "dateModified": "2025-10-24T21:29:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boise State vs. Nevada odds, picks, predictions, bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/boise-state-nevada-prediction-odds-2025-week-9-college-football-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/f66d2148-3d1c-4148-a2d6-66e91d78f045/thumbnail/1200x675/4d3ee130d3f72cdd40c28f502331655b/madsen-gaines-boise-state-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-24T23:45:35.000Z",
    "description": "\n        Conference rivals on opposite ends of the Mountain West standings square off as the Boise State Broncos (5-2, 3-0) visit the Nevada Wolf Pack",
    "body": "\n        Conference rivals on opposite ends of the Mountain West standings square off as the Boise State Broncos (5-2, 3-0) visit the Nevada Wolf Pack (1-6, 0-3) in college football Week 9 action on Friday. Boise State tops the Mountain West and is coming off of a big 56-31 win against UNLV. Meanwhile, the Wolf Pack occupy the conference cellar and are looking for their first victory since Week 2 against Sacramento State. Kickoff from Mackay Stadium is set for 10 p.m. ET on CBS Sports Network. The Broncos are 21-point favorites in the latest Boise State vs. Nevada odds, and the over/under for total points scored is 50.5. Before making any Nevada vs. Boise State picks, be sure to see what the SportsLine projection model has to say.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Nevada vs. Boise State. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for Boise State vs. Nevada in Week 9:Boise State vs. Nevada spreadBoise State -21 at DraftKings SportsbookBoise State vs. Nevada over/under50.5 pointsBoise State vs. Nevada money line Boise State -1724, Nevada +948Boise State vs. Nevada picksSee picks at SportsLineBoise State vs. Nevada streaming Fubo (Try for free)  Why Boise State can coverThe Broncos are 5-1-1 ATS this season, and three of their wins have been by more than 22 points. The offense leads the Mountain West with 478.6 average yards per game and is holding opposing quarterbacks to 189.7 passing yards. Starting quarterback Maddux Madsen is coming off of a four-touchdown day against the Rebels where he also threw for 253 yards, and he should comfortably move the ball down field against a mediocre Nevada passing defense. Boise State's defense is allowing 351.3 total yards and 26.1 points per game but is expected to contain a weak Wolf Pack offense. See which team to back at SportsLine. Why Nevada can coverThe Wolf Pack might be struggling overall, but they are still 3-4-0 ATS this season and have covered the spread in two of their last three games. That includes covering in a 24-22 loss to New Mexico as 13.5-point underdogs in Week 8. Nevada also covered as a 42.5-point underdog against Penn State in Week 1. Over three home games this season, the Wolf Pack has held two opponents to under 20 points. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Nevada vs. Boise State picksFor Boise State vs. Nevada in Week 9, the model is leaning over the total, and also says one side of the spread hits in well over 50% of simulations. See what it is at SportsLine.Who wins Boise State vs. Nevada, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Nevada vs. Boise State spread you need to jump, all from the model that is a combined 42-30 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boise State vs. Nevada odds, picks, predictions, bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/f66d2148-3d1c-4148-a2d6-66e91d78f045/thumbnail/1200x675/4d3ee130d3f72cdd40c28f502331655b/madsen-gaines-boise-state-imagn-cbs.jpg"
      ],
      "datePublished": "2025-10-24T23:45:35.000Z",
      "dateModified": "2025-10-24T23:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. Knicks odds, picks, best bets, NBA predictions for Friday from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-knicks-prediction-odds-start-time-2025-nba-picks-october-24-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/4d34d4be-ab1f-4e62-9e30-0be8c39d936c/thumbnail/1200x675/661b49d66b897b369a4e992decfea0fa/jalen-brunson-nyk.png",
    "tag": "Sports",
    "date": "2025-10-24T21:15:31.000Z",
    "description": "\n        The New York Knicks (1-0) have the Boston Celtics (0-1) rolling into town for an Eastern Conference showdown on Friday night. The Knicks open",
    "body": "\n        The New York Knicks (1-0) have the Boston Celtics (0-1) rolling into town for an Eastern Conference showdown on Friday night. The Knicks opened the campaign with a 119-111 win over the Cleveland Cavaliers on Wednesday night. The Celtics weren't able to defend their home court, as the Philadelphia 76ers beat Boston 117-116 on Oct. 22. The Celtics swept the season series 4-0 during the 2024-25 season. Karl-Anthony Towns (quad) is questionable for New York.Tipoff is at 7:30 p.m. ET from Madison Square Garden in New York City, where the Knicks went 27-14 last season. New York is a 3.5-point favorite in the latest Celtics vs. Knicks odds, while the over/under for total points scored is 230.5. Before locking in any Celtics vs. Knicks picks, make sure to check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Celtics vs. Knicks 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. Knicks:Celtics vs. Knicks   spreadNew York -3.5 at DraftKings SportsbookCeltics vs. Knicks     over/under230.5 pointsCeltics vs. Knicks    money lineNew York -155, Boston +135Celtics vs. Knicks     picksSee picks at SportsLineCeltics vs. Knicks    streamingAmazon Prime Why the Knicks can coverThe Knicks hired Mike Brown as the head coach this offseason, and his impact was felt immediately, as New York had 11 players step on the floor in the season-opening win. Forward OG Annouby played well on both sides of the ball, logging 24 points and tying a career-high 14 rebounds. He also had three steals, one block and knocked down four 3-pointers. Forward Mikal Bridges is another two-way threat in the frontcourt. Bridges stuffed the stat sheet, finishing with 16 points, five rebounds, six assists, three steals and two blocks. Meanwhile, guard Jalen Brunson poured in 23 points, four boards and five assists. Last season, New York went 23-20-1 ATS as the home favorite. See which team to back at SportsLine.Why the Celtics can coverWith Jayson Tatum (Achilles) out for an extended period, the Celtics are leaning on both Derrick White and Jaylen Brown. Last season, White averaged 16.4 points, 4.8 assists and made 38% of his 3-pointers. In the opener against the 76ers, the 31-year-old racked up 25 points, three rebounds, four assists and knocked down four 3-pointers.Brown can also create his own shot from all over the floor. On Tuesday against the 76ers, the California product dropped 25 points, six rebounds, four assists, and went 9-of-18 from the field. Guard Payton Pritchard is another floor spacer for this group. On Tuesday, Pritchard had 16 points, five boards and two steals. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Celtics vs. Knicks picksSportsLine's model has simulated Celtics vs. Knicks and is leaning Under the total, projecting 221 combined points. The model also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. Knicks, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Celtics vs. Knicks spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. Knicks odds, picks, best bets, NBA predictions for Friday from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/4d34d4be-ab1f-4e62-9e30-0be8c39d936c/thumbnail/1200x675/661b49d66b897b369a4e992decfea0fa/jalen-brunson-nyk.png"
      ],
      "datePublished": "2025-10-24T21:15:31.000Z",
      "dateModified": "2025-10-24T21:15:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, picks, predictions: This basketball parlay returns nearly +600 on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-parlay-best-bets-for-friday-oct-24/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/dffd54a7-6638-4ace-bfd5-3e754cf46d10/thumbnail/1200x675/a08e8e56c8d842063a1013e8163c6a22/paolo-banchero-orlando-magic-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-24T20:41:47.000Z",
    "description": "\n        The 2025-26 NBA season rolls on Friday with a dozen more matchups. The early tip is Bucks vs. Raptors (-1.5) at 6:30 p.m. ET. Other notable N",
    "body": "\n        The 2025-26 NBA season rolls on Friday with a dozen more matchups. The early tip is Bucks vs. Raptors (-1.5) at 6:30 p.m. ET. Other notable NBA lines on Friday include Knicks (-3.5) vs. Celtics at 7:30 p.m. ET and Timberwolves (-1.5) vs. Lakers at 10 p.m. ET as Luka Doncic (groin) is off the injury report and set to play. With 12 games listed in the latest NBA odds, there are plenty of opportunities to build NBA parlays for this slate. What are the best NBA bets on the board? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of just under +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Friday, Oct. 24After simulating every game 10,000 times, the model is going Under 235.5 in Magic vs. Hawks at 7 p.m. ET in Orlando. This is the highest total on the board, but the model projects that these teams will combine for just 225 points, helping the Under hit in well over 60% of simulations. Orlando was one of the league's best defensive teams last season, and the Magic went Under in 57% of games, the second-highest rate in the league. Atlanta is more offensively-focused, but the model projects that Orlando's defense will limit the Hawks in this one. See which other NBA parlay picks to make here, and bet this pick right here:How to make NBA predictions for Friday, October 24The model also has locked in two other picks, both of which hit well over 60% of the time in the simulations. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Friday, and which best bets should you target for a chance at a payout of nearly +600. Visit SportsLine now to see NBA best bets from a model that's returned more than $4,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, picks, predictions: This basketball parlay returns nearly +600 on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/dffd54a7-6638-4ace-bfd5-3e754cf46d10/thumbnail/1200x675/a08e8e56c8d842063a1013e8163c6a22/paolo-banchero-orlando-magic-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-24T20:41:47.000Z",
      "dateModified": "2025-10-24T20:41:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Injury tracker: Updates on Lamar Jackson, A.J. Brown, Garrett Wilson, and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-8-injury-report-lamar-jackson-a-j-brown-garrett-wilson/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/792ddd24-89df-40e8-b669-2e420f474ac0/thumbnail/1200x675/1b324d912756a5597673d1a5ab294f00/lamarweek4.jpg",
    "tag": "Sports",
    "date": "2025-10-24T22:08:46.000Z",
    "description": "\n        No matter how hard teams try to avoid them, injuries are a constant throughout a given season, and the upcoming Week 8 slate is no exception.",
    "body": "\n        No matter how hard teams try to avoid them, injuries are a constant throughout a given season, and the upcoming Week 8 slate is no exception. Despite this being a smaller collection of games with a total of six teams on the bye, there are plenty of high-profile players whose statuses are in question. Already, we know that the Washington Commanders will be without starting quarterback Jayden Daniels for their Monday night matchup with the Kansas City Chiefs. Meanwhile, star wideout Terry McLaurin's status is also in question for that contest. Beyond Washington's spat with the injury bug, we're monitoring the statuses of Lamar Jackson, A.J. Brown, Sauce Gardner, Garrett Wilson, and others. Below, you can find the final injury designations for those players and more as teams turn in their final reports heading into the Week 8 slate.NFL odds via Caesars Sportsbook. You can bet NFL Week 8 games at Caesars Sportsbook, where new users get 20 100% profit boost tokens with the promo code CBS20X.\nCleveland Browns at New England Patriots (-7)Sunday, 1 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusBrownsAdin HuntingtonDTConcussionQuestionableDavid NjokuTEKneeQuestionablePatriotsKyle DuggerSKneeQuestionableBoth Huntington and Njoku were limited on Friday, so they are both have a good shot to suit up in Week 8. Meanwhile, the Patriots are just as healthy with just one player, Kyle Dugger, listed on the injury report. Dugger was limited on Friday with a knee injury. Miami Dolphins at Atlanta Falcons (-7.5)Sunday, 1 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusDolphinsJulian HillTEAnkleOutJason Marshall Jr.CBHamstringQuestionableFalconsDivine DeabloILBForearmOutJalon WalkerEDGEHamstringOutStorm NortonOLFootOutMichael Penix Jr.QBKneeQuestionableTyler AllgeierRBHip, kneeQuestionableJordan FullerSKneeQuestionableZach HarrisonDLKneeQuestionableAfter appearing on the injury report on Thursday with a hamstring injury, wideout Jaylen Waddle was a full participant on Friday and carries no designation. \nAtlanta is listing quarterback Michael Penix Jr. as questionable after he was limited throughout the week of practice due to a knee injury. That said, when asked this week if he expects to play Sunday, he said, \"that's the plan.\" Buffalo Bills (-7) at Carolina PanthersSunday, 1 p.m. ET on Fox | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatusBillsDaQuan JonesDTCalfOutJosh PalmerWRKnee, ankleOutTaylor RappSKneeOutPanthersBryce YoungQBAnkleDoubtfulJones, Palmer, nor Rapp practiced this week, so the Bills ultimately deciding to rule them out is not a big surprise. Head coach Sean McDermott did note that Rapp will be placed on injured reserve, meaning he will miss a minimum of four games. Young did not participate in practice throughout the week, and is officially listed as doubtful of Week 8. That has veteran Andy Dalton in line to start for Carolina. Meanwhile, no other player carries an injury designation for this matchup, which includes defensive tackle Cam Jackson, who missed Thursday's session with an illness. He returned Friday as a full participant. \nChicago Bears at Baltimore Ravens (-6.5)Sunday, 1 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusBearsKyler GordonDBGroin, calfOutRoschon JohnsonRBBackOutBraxton JonesOLKneeOutCole KmetTEBackOutTyrique StevensonDBShoulderOutD'Andre SwiftRBGroinQuestionableAustin BookerDLKneeQuestionableAmen OgbongbemigaLBKneeQuestionableCairo SantosKRight thighQuestionableRavensLamar JacksonQBHamstringQuestionableChicago will be without a number of notable figures in Week 8, including within the secondary with both Gordon and Stevenson sidelined. Meanwhile, with Kmet out, that could open the door for first-round rookie tight end Colston Loveland to see more opportunity. As for D'Andre Swift, he was limited both Thursday and Friday. After logging a full practice on Friday, the Ravens are listing Lamar Jackson as questionable for Sunday. Given that Jackson's practice participation improved as the week progressed (limited, limited, and then full) it does appear he is in line to make is return. New York Giants at Philadelphia Eagles (-7.5)Sunday, 1 p.m. ET on Fox | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatusGiantsPaulson AdeboCBKneeOutChauncey GolstonDLNeckOutJevon HollandSKneeDoubtfulBrian BurnsOLBHipQuestionableD.J. DavidsonDLAnkleQuestionableGraham GanoKGroinQuestionableEaglesA.J. BrownWRHamstringOutAdoree' JacksonCBConcussionOutCam JurgensIOLKneeOutAzeez OjulariOLBHamstringOutJakorian BennettCBPectoralOutBrandon GrahamDENot injury relatedOutDarius CooperWRShoulderQuestionableDespite being listed on the injury report with an ankle injury, quarterback Jaxson Dart carries no designation heading into Week 8, so he is good to go. As for Holland, he did not practice at all this week. Meanwhile, Burns did practice on a limited basis on Friday, giving him a shot to play despite that questionable status. \nA.J. Brown will miss Week 8 after the star wideout was unable to practice at all this week due to a hamstring injury. Meanwhile, Brandon Graham, who just came out of retirement this week, will need a little more ramp-up time before getting back onto the field and will not play this weekend. San Francisco 49ers at Houston Texans (-2.5)Sunday, 1 p.m. ET on Fox | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatus49ersBrock PurdyQBToeOutRicky PearsallWRKneeOutJake BrendelOLHamstringOutBryce HuffDLHamstringOutYetur Gross-MatosDLHamstringOutDeommodore LenoirDBQuadQuestionableLuke GiffordLBHamstringQuestionableSpencer BurfordOLKneeQuestionableTexansNico CollinsWRConcussionOutChristian KirkWRHamstringOutAlijah HuzzieCBKneeOutJaylin SmithCBHamstringQuestionableDenico AutryDEKneeQuestionableThe San Francisco 49ers will once again be without starting quarterback Brock Purdy after the team ruled him out for Week 8. In his place, Mac Jones will get another start as he was not given any designation on the final injury report. On a more positive note, head coach Kyle Shanahan did note Friday that the team could open the practice window for Brandon Aiyuk next week. Houston will be down two of its top wide receivers in Week 8 after ruling out Nico Collins and Christian Kirk. That should result in plenty of action for rookies Jayden Higgins and Jaylin Noel. Neither Collins or Kirk practiced at all this week. \nNew York Jets at Cincinnati Bengals (-6.5)Sunday, 1 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusJetsGarrett WilsonWRKneeOutSauce GardnerCBConcussionOutKene NwangwuRBConcussionOutCam JonesLBHipOutStone SmarttTEQuadOutJay TufeleDLKneeOUTBreece HallRBKneeQuestionableTyrod TaylorQBKneeQuestionableQuincy WilliamsLBShoulderQuestionableMason TaylorTEQuadQuestionableJosh ReynoldsWRHipQuestionableBengalsMatt LeeCKneeDoubtfulMarco WilsonCBHamstringDoubtfulCam SampleDEKneeDoubtfulTrey HendricksonDEHipQuestionableCedric JohnsonDE CalfQuestionableNew York will be missing two of its biggest stars in Week 8 as both Garrett Wilson and Sauce Gardner have been ruled out. The receiver room may take even more of a hit with Josh Reynolds popping up on the injury report on Friday with a hip injury that now has him questionable. At quarterback, Tyrod Taylor was limited throughout the week and is officially questionable as Aaron Glenn has yet to announce a starter. Trey Hendrickson isn't trending in the right direction, despite his questionable status. After being limited on both Wednesday and Thursday, the pass rusher did not practice on Friday. Tampa Bay Buccaneers (-4) at New Orleans SaintsSunday, 4:05 p.m. ET on Fox | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatusBuccaneersChris Godwin Jr.WRFibulaOutLuke HaggardGShoulderOutBucky IrvingRBFoot, shoulderOutHaason ReddickOLBAnkle, kneeOutVita VeaNTFootQuestionableSaintsN/AN/AN/AN/ARookie wideout Emeka Egbuka is off the injury report after logging a full practice on Friday, so he is available for Week 8. This comes after the receiver missed Wednesday's practice and was limited on Thursday due to a hamstring injury. Quarterback Baker Mayfield also carries no designation, despite being limited on Friday with a knee injury. \nNew Orleans enters with Week 8 extremely healthy with no players holding a game designation. Dallas Cowboys at Denver Broncos (-3.5)Sunday, 4:25 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusCowboysTrevon DiggsCBConcussion, kneeOutDeMarvion OvershownLBKneeOutShavon Revel Jr.CBKneeOutDonovan WilsonSElbow, shoulderOutCooper BeebeCAnkleQuestionableAjani CorneliusOTKneeQuestionableTyler Guyton OTGluteQuestionableMarshawn KneelandDEAnkleQuestionableBroncosN/AN/AN/AN/ATrevon Diggs was unable to practice at all this week, and has since been ruled out. Meanwhile, Overshown and Revel are both still on injured reserve and their returns will have to wait at least another week despite being limited at practice throughout the week. Tyler Guyton, who popped up on Thursday as a limited participant due to a glute injury, was again limited on Friday and is officially questionable.The Denver Broncos are healthy coming into Week 8, listing not players with any designation on the final injury report. \nTennessee Titans at Indianapolis Colts (-14.5)Sunday, 4:25 p.m. ET on CBS | Stream on Paramount+TeamPlayerPositionInjuryStatusTitansBlake HanceOLShoulder, backOutBryce OliverWRKneeOutCalvin RidleyWRHamstringOutL'Jarius SneedCBQuadOutArden KeyOLBQuadQuestionableXavier WoodsSAnkleQuestionableColtsJaylon JonesCBHamstringOutSamson EbukamDEKneeOutTyquan LewisDEGroinQuestionableCalvin Ridley remains sidelined for the Titans, and Tennessee with be without a key playmaker on defense as well in Jeffery Simmons. Neither practiced at all this week due to hamstring injuries. Wide receiver Josh Downs has cleared concussion protocol, logged back-to-back full practices, and the Colts did not give him a designation for Week 8, meaning he will suit up. Green Bay Packers (-3) at Pittsburgh SteelersSunday, 8:20 p.m. ET on NBC | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatusPackersDontayvion WicksWRCalfOutLukas Van NessDLFootOutDevonte WyattDLKneeQuestionableChristian WatsonWRKneeQuestionableBrandon McManusKRight quadQuestionableWarren BrinsonDLHamstringQuestionableMatthew GoldenWRHipQuestionableSteelersScotty MillerWRFingerOutWill HowardQBRight handQuestionableMalik HarrisonLBKneeQuestionableZach FrazierCCalfQuestionableGreen Bay rookie wideout Matthew Golden appeared on the injury report on Friday with a hip injury and is now officially questionable. Meanwhile, running back Josh Jacobs is off the injury report after being limited throughout the week of practice. \nAfter giving him a rest day on Thursday, DK Metcalf was back as a full participant at practice on Friday and carries no designation for Week 8. Washington Commanders at Kansas City Chiefs (-12.5)Monday, 8:15 p.m. ET on ABC | Stream: Fubo (try for free)TeamPlayerPositionInjuryStatusCommanders------------------------Chiefs------------------------Analysis to come. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Injury tracker: Updates on Lamar Jackson, A.J. Brown, Garrett Wilson, and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/02/792ddd24-89df-40e8-b669-2e420f474ac0/thumbnail/1200x675/1b324d912756a5597673d1a5ab294f00/lamarweek4.jpg"
      ],
      "datePublished": "2025-10-24T22:08:46.000Z",
      "dateModified": "2025-10-24T22:08:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]