[
  {
    "title": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-lineup-advice-daily-fantasy-fanduel-draftkings-optimizer-week-12-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/fbc182b6-65bc-497d-81fd-4a152b47e980/thumbnail/1200x675/bd75d0858bea10f87967935686b5d243/bijan.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:56:39.000Z",
    "description": "\n        There are no international games in Week 12, so 11 more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET w",
    "body": "\n        There are no international games in Week 12, so 11 more NFL games are set for Sunday afternoon either in the 1 p.m. ET or 4:05/4:25 p.m. ET window. Those matchups comprise what is considered the main slate for NFL DFS sites like FanDuel and DraftKings. Two games -- Lions vs. Giants and Chiefs vs. Colts -- have an over/under of 50 or higher, meaning they'll be a focus for NFL daily Fantasy players with big names like Patrick Mahomes, Travis Kelce, Daniel Jones, Jonathan Taylor and Amon-Ra St. Brown in action. Some big names will be missing, however, as Joe Burrow (toe) won't return yet and Cincinnati's top receiver, Ja'Marr Chase, is serving a one-game suspension. How should all that NFL news factor into your NFL DFS picks this week, and who are the sleepers in the NFL DFS player pool that can help differentiate your lineups? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 12 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 12 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is New England Patriots quarterback Drake Maye at $6,900 on DraftKings and $8,400 on FanDuel. Maye is in the MVP conversation this season thanks to him leading the NFL with 2,836 passing yards and ranking fifth in touchdowns (20). He's also added value as a runner with 285 yards and two scores. Patriots vs. Bengals has an over/under of 49.5, and the Bengals have given up the second-most Fantasy points to opposing QBs, making this a dream matchup for Maye. See who else to pick here.The optimizer's NFL DFS strategy also includes building around Falcons running back Bijan Robinson at $8,500 on DraftKings and $9,600 on FanDuel. Robinson had 143 scrimmage yards and two scores last week. Now he takes on a New Orleans defense that ranks 20th in the league in both yards and Fantasy points given up to opposing running backs. With quarterback Michael Penix Jr. (knee) out for the year, top receiver Drake London (knee) ruled out this week, Robinson should be an even bigger focal points for this offense. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to build Sunday Week 12 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/fbc182b6-65bc-497d-81fd-4a152b47e980/thumbnail/1200x675/bd75d0858bea10f87967935686b5d243/bijan.jpg"
      ],
      "datePublished": "2025-11-23T15:56:39.000Z",
      "dateModified": "2025-11-23T15:56:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 12 NFL betting guide, expert and computer picks, props, DFS, fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-12-nfl-betting-guide-props-picks-predictions-parlay-dfs-fantasy-football-advice-lineups-strategy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/45ad842c-1980-4c2c-af65-c01d21506563/thumbnail/1200x675/f0a3af1a4199743ab17be2f0b4ac668d/baker-mayfield-buccaneers.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:51:03.000Z",
    "description": "\n        No team has a worst NFL spread record than Washington, but with it on a bye, you'll have to pick on other teams with your Week 12 NFL bets. T",
    "body": "\n        No team has a worst NFL spread record than Washington, but with it on a bye, you'll have to pick on other teams with your Week 12 NFL bets. Tennessee could be that squad as it has just one more ATS victory than the Commanders, and the Titans take on a Seattle team which has covered a league-high eight times, including being 5-0 ATS on the road as it will visit Tennessee. A thorough Week 12 NFL betting guide will look at trends like these, while also taking into account recent performances, injuries and more to allow you to be fully informed before making any NFL predictions.Seahawks vs. Titans (+13.5), along with Steelers vs. Bears (-2.5) and Jaguars vs. Cardinals (+2.5), are the lone cross-conference games this week. Apart from making Week 12 NFL picks against the spread for them, the likes of Sam Darnold, Rome Odunze, Travis Etienne and Trey McBride could factor into NFL player props, plugged into Fantasy football lineups or be a part of your NFL DFS strategy. If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 12, SportsLine has you covered with its proven model, Machine Learning Model and team of experts.Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 12 that pays 25-1, and one of the legs is the Seahawks (-13.5, 40.5) covering against the Titans. The model has Seattle covering in nearly 60% of simulations, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $200 in bonus bets + 3 months of NBA League Pass if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Patriots' TreVeyon Henderson as one of its top value picks at running back, while New Orleans' Chris Olave is among the best values at receiver for Sunday's main slate. Here are its complete Week 12 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Packers' Emmanuel Wilson as a top-10 Fantasy running back this week. Get his full Week 12 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 12 Fantasy football rankings that can be used to make start-sit decisions. The Jaguars' Parker Washington is projected to be a top-20 Fantasy wide receiver this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model enters Week 12 of the 2025 NFL season up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024 and has revealed picks for every Week 12 NFL game. One of its favorite picks is the Ravens (-13.5, 44.5) covering versus the Jets, which cashes over 50% of the time. You can find the model's picks for every NFL Week 12 game here. You can also use the latest FanDuel promo code to get $150 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Larry Hartstein, who is 21-14 (+536) over his last 35 ATS picks in Patriots games, is backing New England (-7.5) to cover versus Cincinnati, who won't have Ja'Marr Chase (suspension) or Joe Burrow (toe) this week, despite Burrow return for some practice. \"Entering Week 12, the Bengals own the worst defense in the history of DVOA. Led by Drake Maye, Stefon Diggs and TreVeyon Henderson, the Pats should put up at least 27 points here. New England had extra rest and will be highly motivated to stay on top in the race for the AFC's top seed. Reeling Cincy won't have its top threat after Ja'Marr Chase was suspended.\" Hartstein's NFL best bets for Week 12 can be found here.Rams vs. Buccaneers 'Sunday Night Football' picksNFC contenders meet in primetime on 'Sunday Night Football' as the Rams host the Buccaneers (+6.5, 49.5). These teams have been trending in different directions recently with Tampa Bay dropping two straight, while Los Angeles has won five in a row. One of SportsLine's self-learning AI's top picks is that Baker Mayfield goes Over 242.5 passing yards.Mayfield has stepped up against top defenses. He's cleared his passing line four times in his past five games against top 1/3 defenses, and the AI projects that he'll throw for 291 yards in this one. Get more 'Sunday Night Football' picks at SportsLine.49ers vs. Panthers 'Monday Night Football' picksChristian McCaffrey faces his former team when the 49ers host the Panthers on Monday. San Francisco is a 7-point favorite and the over/under is 49.5, up two points from the opening line. After 10,000 simulations, SportsLine's model is backing the Niners to cover in well over 50% of simulations, making it an A-rated pick. Get more 'Monday Night Football' picks at SportsLine.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 12 NFL betting guide, expert and computer picks, props, DFS, fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/45ad842c-1980-4c2c-af65-c01d21506563/thumbnail/1200x675/f0a3af1a4199743ab17be2f0b4ac668d/baker-mayfield-buccaneers.jpg"
      ],
      "datePublished": "2025-11-23T15:51:03.000Z",
      "dateModified": "2025-11-23T15:51:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model locks in Jaguars vs. Cardinals picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jaguars-cardinals-where-to-watch-nfl-week-12-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/7049f47a-c1f0-4556-ba24-ad3dafad5335/thumbnail/1200x675/7d7a887b27a2063c6f471ffb38d4aefd/trevor-lawrence-jga.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:47:40.000Z",
    "description": "\n        The Jacksonville Jaguars (6-4) look to win their third in four games, including two in a row, when they take on the Arizona Cardinals (3-7) i",
    "body": "\n        The Jacksonville Jaguars (6-4) look to win their third in four games, including two in a row, when they take on the Arizona Cardinals (3-7) in Week 12 on Paramount+. The Jaguars, second in the AFC South, are two games behind first-place Indianapolis. The Cardinals, meanwhile, are fourth in the NFC West, but are 3.5 games out of the final playoff spot in the conference. Trevor Lawrence and the Jaguars are coming off a 35-6 win over the Los Angeles Chargers, while the Cardinals were throttled 41-22 by San Francisco on Sunday.Kickoff from State Farm Stadium in Glendale, Ariz., is set for 4:05 p.m. ET on CBS and Paramount+. Jacksonville is a 2.5-point favorite in the latest Jaguars vs. Cardinals odds from SportsLine consensus, while the over/under for total points scored is 47.5. The Jaguars are -135 money line favorites (risk $135 to win $100), while the Cardinals are +114 underdogs. Before making any Jaguars vs. Cardinals picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Jaguars vs. Cardinals at DraftKings Sportsbook, where new users get $200 in bonus bets if your initial $5 bet wins and three months of NBA League Pass free:Where to bet on Jaguars vs. CardinalsBrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $150 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Jaguars vs. Cardinals on SundayWhen: Sunday, Nov. 23Time: 4:05 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppJaguars vs. Cardinals betting previewOdds: Jaguars -2.5, over/under 47.5Trevor Lawrence, the top pick of the 2021 NFL Draft, powers the Jacksonville offense. In 10 starts this season, he has completed 59.8% of his passes for 2,151 yards and 11 touchdowns with eight interceptions. He has also rushed 49 times for 181 yards (3.7 average) and five touchdowns. Also powering the offense is Travis Ettienne Jr. In 10 games, he has carried 154 times for 729 yards (4.7 average) and five touchdowns. He has four explosive plays of 20 yards or more, including a long of 71.Arizona, meanwhile, has struggled all season, losing eight of its last nine games. With Kyler Murray still out, Jacoby Brissett will be playing in his eighth game. He has completed 66.7% of his passes for 1,570 yards and 10 touchdowns with three interceptions and a 98.1 rating. In last week's loss to San Francisco, he completed 47 of 57 passes (82.5%) for 452 yards and two touchdowns with two interceptions. Tight end Trey McBride has been the Cardinals' top target in the passing game. He leads the team with 71 receptions for 718 yards and seven touchdowns. He has at least one score in each of the last five games. Click here to bet Jaguars vs. Cardinals at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Jaguars vs. Cardinals score prediction, picksThe Jaguars are 5-4-1 against the spread, while the Cardinals are 5-5 ATS. Arizona has the 14th-best offense and 21st best defense, while Jacksonville has the 19th-best offense and14th-best defense. Jaguars vs. Cardinals score prediction: Jaguars 26, Cardinals 23 Jaguars vs. Cardinals same game parlayCardinals +132Michael Wilson, Arizona Cardinals, Under 62.5 receiving yards (-114)Trevor Lawrence, Jacksonville Jaguars, Over 214.5 passing yards (-114) Want more Week 12 NFL picks?You've seen the model's best bets for Jacksonville Jaguars vs. Arizona Cardinals. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model locks in Jaguars vs. Cardinals picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/7049f47a-c1f0-4556-ba24-ad3dafad5335/thumbnail/1200x675/7d7a887b27a2063c6f471ffb38d4aefd/trevor-lawrence-jga.jpg"
      ],
      "datePublished": "2025-11-23T15:47:40.000Z",
      "dateModified": "2025-11-23T15:47:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model locks in Raiders vs. Browns picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/raiders-browns-where-to-watch-nfl-week-12-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/003d5649-6a4b-41c9-938b-06b06a582bad/thumbnail/1200x675/deab3e0c948f2b2595bbf48bff26be37/shedeur-sanders-browns.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:37:21.000Z",
    "description": "\n        Teams desperate to get in the win column meet on Sunday when the Las Vegas Raiders (1-8) face the Cleveland Browns (2-7) in NFL Week 12 actio",
    "body": "\n        Teams desperate to get in the win column meet on Sunday when the Las Vegas Raiders (1-8) face the Cleveland Browns (2-7) in NFL Week 12 action on CBS and Paramount+. Cleveland has lost three straight, but did cover as a 7.5-point underdog last week against the Ravens. Las Vegas, meanwhile, has dropped four straight overall, but has covered in two of its last three. Despite struggling this season, the Raiders are expected to stick with Geno Smith at quarterback, while the Browns plan to start rookie Shedeur Sanders for the first time with Dillon Gabriel in concussion protocol. Kickoff from Allegiant Stadium is set for 4:05 p.m. ET on CBS and Paramount+. Las Vegas is a 3.5-point favorite in the latest Raiders vs. Browns odds from SportsLine consensus, while the over/under for total points scored is 36.5. The Raiders are -174 money line favorites (risk $174 to win $100), while the Browns are +144 underdogs. Before making any Browns vs. Raiders picks, make sure you check out the NFL picks from the SportsLine Projection Model. Also, be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Raiders vs. Browns at DraftKings Sportsbook, where new users get $200 in bonus bets if your initial $5 bet wins and three months of NBA League Pass free:Where to bet on Raiders vs. BrownsBrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $150 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Raiders vs. Browns on SundayWhen: Sunday, Nov. 23Time: 4:05 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppRavens vs. Browns betting previewOdds: Raiders -3.5, over/under 36.5Both teams have struggled offensively, which is a big factor in why this is one of the lower totals of the season. It starts with quarterback concerns for both teams, but these sides also lack many game-breaking skill players to help them. Running back Ashton Jeanty was supposed to be just that for Las Vegas, but has averaged just 3.7 yards per carry this season. Quinshon Judkins has been a bit more effective for Cleveland, but only one player for either side -- Raiders receiver Tre Tucker (502 yards) -- has more than 500 receiving yards on the season. These teams, however, both have a game-wrecker coming off the edge. Cleveland's Myles Garrett leads the NFL with 15 sacks, while Maxx Crosby of the Raiders has six sacks and ranks third in the NFL in tackles for loss with 14. How these offensive lines contain those players could be an x-factor in who wins what is expected to be a low-scoring battle. Click here to bet Raiders vs. Browns at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Raiders vs. Browns score prediction, picksBoth teams are 4-6 against the spread, and Cleveland has been especially poor on the road with an 0-4 ATS mark. Despite that, the model is projecting an extremely low-scoring game, and that often is a case for backing the team getting points, as the Browns are in this spot. SportsLine's model projects a one-point game, helping the Browns cover in nearly 60% of simulations. Raiders vs. Browns score prediction: Raiders 20, Browns 19Ravens vs. Browns same game parlayBrowns +3.5 (-105)Shedeur Sanders, Cleveland Browns, Over 160.5 passing yards (-113)Shedeur Sanders, Cleveland Browns, Under 19.5 rushing yards (-117) Want more Week 12 NFL picks?You've seen the model's best bets for Baltimore Ravens vs. Cleveland Browns. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model locks in Raiders vs. Browns picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/003d5649-6a4b-41c9-938b-06b06a582bad/thumbnail/1200x675/deab3e0c948f2b2595bbf48bff26be37/shedeur-sanders-browns.jpg"
      ],
      "datePublished": "2025-11-23T15:37:21.000Z",
      "dateModified": "2025-11-23T15:37:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL odds, betting lines, spreads: Week 12 picks, predictions, best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-12-nfl-odds-picks-predictions-bets-lines-spreads/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/12/2a4cda4d-786f-4c0d-8b40-0c8a27c134bc/thumbnail/1200x675/be2036066747d7237d62a0290d6c8495/likely.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:54:16.000Z",
    "description": "\n        The Week 12 NFL odds feature four games with a spread of under a field goal, while three contests have a double-digit NFL line. Amongst the f",
    "body": "\n        The Week 12 NFL odds feature four games with a spread of under a field goal, while three contests have a double-digit NFL line. Amongst the former are Steelers vs. Bears (-2.5), with Aaron Rodgers (wrist) out and Mason Rudolph drawing the start, and Jaguars vs. Cardinals (+2.5), while double-digit favorites to place Week 12 NFL bets include Seattle (-12.5) versus Tennessee and Detroit (-13.5) versus the Giants, with New York again without Jaxson Dart (concussion). A team that isn't even over .500, however, is tied for the biggest favorite on the Week 12 NFL schedule. Baltimore has won four straight to get back into the playoff picture, and they'll host the Jets on Sunday. The Ravens are at -13.5 to use in Week 12 NFL picks, and while double-digit favorites are 10-1 straight up this season, they are just 6-5 ATS. One of those games whose spread falls in between the aforementioned extremes is Chiefs vs. Colts, which has another .500 team in Kansas City as 3.5-point favorites over an 8-2 Colts squad coming off a bye. All of the updated Week 12 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 12 NFL picks now. LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can also target the DraftKings promo code, which offers $200 in bonus bets if your initial $5 bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 12 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top Week 12 NFL predictionsWe can tell you one of the model's strongest Week 12 NFL picks is that the Cardinals (+2.5, 47.5) cover at home versus Jacksonville in a Sunday 4:05 p.m. ET kickoff. Arizona is 6-1 ATS versus AFC opponents since 2024, which is the second-best spread record for any team in non-conference matchups. Meanwhile, the Jags are just 1-4 ATS this year outside of Jacksonville, and the takeaways that fueled their early success have nearly dried up. The Jaguars averaged 3.3 takeaways over their first four games but have averaged just 0.8 turnovers forced per game over their last six. Thus, extra offensive possessions for Arizona allow it to take advantage of the Jags' 26th-ranked passing defense, as Jacoby Brissett is projected to have more yards and touchdowns than Trevor Lawrence. With that, the Cardinals cover in over 50% of simulations. See which other teams to pick here.\nAnother one of its Week 12 NFL predictions: the Ravens (-13.5, 44.5) cover versus the Jets in well over 50% of simulations. New York is coming off a mini-bye, having played last Thursday, but there's no spread advantage with this rest edge. The Jets are 3-11-1 ATS over their last 15 games when they have a rest advantage over their opponent. Their Sunday opponent, Baltimore, has recently looked like the team most expected them to be all season as the Ravens have allowed just 14.8 points over their last five games. That includes a pair of games versus top-10 scoring offenses, but the team doesn't have to worry about seeing that with the Jets, who rank dead last in passing offense and 25th in scoring. Baltimore covers with points to spare, and the model also says the Over hits in over 70% of simulations. See which other teams to pick here.\nHow to make Week 12 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 12 NFL schedule and just revealed five teams projected to win by double-digits, potentially giving you a huge payday by playing the alternate lines. You can only get every pick for every game at SportsLine.So what Week 12 NFL picks can you make with confidence, and which five teams should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 12 NFL betting odds, lines, live spreads, scoresGet Week 12 NFL picks at SportsLineGameSpreadTotalPicksBills at Texans (Thursday)F: Texans 23, Bills 19Jets at RavensBAL -13.544.5SEE  PICKS HERESteelers at BearsCHI -2.546.5SEE  PICKS HEREPatriots at BengalsNE -7.550SEE  PICKS HEREGiants at LionsDET -12.550.5SEE  PICKS HEREVikings at PackersGB -6.541.5SEE  PICKS HEREColts at ChiefsKC -3.549.5SEE  PICKS HERESeahawks at TitansSEA -12.540.5SEE  PICKS HEREJaguars at CardinalsJAX -2.547.5SEE  PICKS HEREBrowns at RaidersLV -436SEE  PICKS HEREEagles at CowboysPHI -347.5SEE  PICKS HEREFalcons at SaintsATL -240SEE  PICKS HEREBuccaneers at RamsLAR -749.5SEE  PICKS HEREPanthers at 49ers (Monday)SF -749.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL odds, betting lines, spreads: Week 12 picks, predictions, best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/12/2a4cda4d-786f-4c0d-8b40-0c8a27c134bc/thumbnail/1200x675/be2036066747d7237d62a0290d6c8495/likely.jpg"
      ],
      "datePublished": "2025-11-23T15:54:16.000Z",
      "dateModified": "2025-11-23T15:54:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets today: This Week 12 computer parlay returns 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-12-nfl-picks-predictions-spreads-odds-parlay-best-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/26/fa8b8996-44f8-4d93-895d-ba9d8a871077/thumbnail/1200x675/4c82429cdfff47457deffaa532118f45/usatsi-sam-darnold-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:54:49.000Z",
    "description": "\n        A number of games with playoff implications highlight the 14-game NFL Week 12 schedule. Among them is an NFC North battle between the Minneso",
    "body": "\n        A number of games with playoff implications highlight the 14-game NFL Week 12 schedule. Among them is an NFC North battle between the Minnesota Vikings (4-6) and Green Bay Packers (6-3-1) at Lambeau Field. Minnesota won both matchups a year ago against the Packers. The Packers are 6.5-point favorites, but are just 3-7 against the spread, while Minnesota is 4-6 ATS. Another huge matchup has the AFC-leading Indianapolis Colts (8-2) traveling to Kansas City to face the 5-5 Chiefs, who have lost two in a row. Neither Indy nor Kansas City have picked up a spread victory over their last two games, and KC is -3.5 in this one. There are a number of other intriguing matchups on the Week 12 NFL schedule, including Steelers vs. Bears (-2.5), with Aaron Rodgers' (wrist) out, Eagles (-3) vs. Cowboys, Buccaneers vs. Rams (-7) on 'Sunday Night Football' and Panthers vs. 49ers (-7) on 'Monday Night Football,' which marks Christian McCaffrey's first game versus his former team. Before locking in any Week 12 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 12 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of around 25-1. You can only see the model's Week 12 NFL picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins:Top Week 12 NFL picksAfter simulating every game 10,000 times, the model is high on the Seattle Seahawks (-13.5, 40.5) to cover against the Tennessee Titans despite being tied with the Ravens (-13.5 vs. Jets) for the largest spread of the week. The Seahawks (7-3) had a four-game winning streak snapped on Sunday with a 21-19 loss to the Los Angeles Rams, while the Titans (1-9) dropped their fifth game in a row in a 16-13 loss to the Houston Texans. Quarterback Sam Darnold leads the Seattle offense, completing 70.2% of his passes this season for 2,541 yards and 17 touchdowns with 10 interceptions and a 105.0 rating. The model has Seattle winning outright 83% of the time and covering in 57% of simulations. See which other NFL parlay picks to make here, and bet the Cowboys to cover here:How to make Week 12 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 12 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 12 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 12 NFL best bets from a model on a 48-33 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets today: This Week 12 computer parlay returns 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/26/fa8b8996-44f8-4d93-895d-ba9d8a871077/thumbnail/1200x675/4c82429cdfff47457deffaa532118f45/usatsi-sam-darnold-seahawks.jpg"
      ],
      "datePublished": "2025-11-23T15:54:49.000Z",
      "dateModified": "2025-11-23T15:54:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 12 NFL picks, top predictions, best bets today from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-12-ai-picks-score-predictions-odds-lines-best-football-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/24168665-b5a1-4378-9520-353feae335c1/thumbnail/1200x675/9778abeda094732a86e53bfd60187330/kenneth-walker-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:20:36.000Z",
    "description": "\n        A 14-game slate is featured in NFL Week 12, including a number of matchups with playoff implications. Among the biggest is when the AFC South",
    "body": "\n        A 14-game slate is featured in NFL Week 12, including a number of matchups with playoff implications. Among the biggest is when the AFC South-leading Indianapolis Colts led by quarterback Daniel Jones face the nine-time defending AFC West champion Kansas City Chiefs and quarterback Patrick Mahomes, The Chiefs have struggled to a 5-5 mark this season, and both the Chiefs and Colts are winless ATS over their last two games. A key NFC North battle pits the 4-6 Minnesota Vikings against the 6-3-1 Green Bay Packers, with Josh Jacobs (knee) status in question. The Chiefs are -3.5, while the Packers are favored by 6.5, making them two of the nine home favorites on Sunday and Monday.A non-divisional matchup with heavy NFC playoff race implications will be played on 'Sunday Night Football' when the Tampa Bay Buccaneers meet the Los Angeles Rams (-7). Los Angeles has won eight of the past 10 meetings and is on a 4-1 ATS run this year, while Tampa's failed to cover in three of its last four. Sunday's largest spreads are Jets vs. Ravens (-13.5), Seahawks (-12.5) vs. Titans and Giants vs. Lions (-12.5), with quarterback Jaxson Dart (concussion) ruled out for New York.Before making any Week 12 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 12 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 14 games. You can only see the AI predictions for the Week 12 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 12 NFL AI picksAfter analyzing every game in Week 12, the AI says the Seahawks (-12.5), who are 8-2 against the spread, cover comfortably on the road against the Titans, who have lost five in a row. Quarterback Sam Darnold has played well in his first season in Seattle. In 10 games, he has completed 70.2% of his passes for 2,541 yards and 17 touchdowns with 10 interceptions and a 105 rating. In the Week 11 21-19 loss to the Rams, Darnold completed 29 of 44 passes for 279 yards. He was 21 of 24 passing for 330 yards and four touchdowns in a 38-14 win at Washington on Nov. 2.Tennessee has struggled this season, losing six games by double digits. Rookie quarterback Cam Ward is still finding his footing for the Titans. In 10 starts, he has completed 58.4% of his passes for 1,954 yards and six touchdowns with six interceptions. SportsLine AI rates the Seahawks as an A+ spread pick and also predicts a 30-14 win on average. See its other Week 12 football predictions and football picks at SportsLine, and bet the Seahawks here:How to make Week 12 NFL picksIn addition, the AI PickBot has generated more than a dozen highly-coveted A+ picks for Week 12. You need to see the AI's NFL picks before making any Week 12 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 12 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 12 NFL picks, top predictions, best bets today from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/24168665-b5a1-4378-9520-353feae335c1/thumbnail/1200x675/9778abeda094732a86e53bfd60187330/kenneth-walker-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2025-11-23T15:20:36.000Z",
      "dateModified": "2025-11-23T15:20:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Eagles vs. Cowboys picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-eagles-where-to-watch-nfl-week-12-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/7ac3be56-c3ff-42be-bb6e-37cdda6038f9/thumbnail/1200x675/65da7ba5e000663330cffc6d811b470d/jalen-hurts-philadelphia-eagles.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:58:44.000Z",
    "description": "\n        The Philadelphia Eagles (8-2) will try to extend their lead atop the NFC East when they face the Dallas Cowboys (4-5-1) on Sunday afternoon. ",
    "body": "\n        The Philadelphia Eagles (8-2) will try to extend their lead atop the NFC East when they face the Dallas Cowboys (4-5-1) on Sunday afternoon. Philadelphia holds a 3.5-game lead over Dallas and a 5.5-game lead over Washington in the division standings. The Eagles are riding a four-game winning streak, while the Cowboys snapped a two-game losing streak with a 33-16 win over the Raiders on Monday night. Philadelphia opened the season with a 24-20 win over Dallas in Week 1. The Eagles will be without tackle Lane Johnson (foot) on Sunday. According to the latest NFL odds, the Eagles are favored by three points, while the over/under for total points scored is 47.5. The Eagles are -165 money line favorites (risk $165 to win $100), while the Cowboys are +138 underdogs. Click here to bet Cowboys vs. Eagles at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Eagles vs. CowboysBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Cowboys vs. Eagles on SundayWhen: Sunday, Nov. 23Time: 4:25 p.m. ETTV: FOXFollow along: CBS Sports AppEagles vs. Cowboys betting previewOdds: Eagles -3, over/under 47.5Philadelphia is the defending Super Bowl champion and is off to an 8-2 start this season, taking a commanding lead atop the NFC East. The Eagles already picked up one win over the Cowboys, but they did not cover the spread as 8-point favorites in that matchup. They have covered the spread in four of their last five games, and they are 9-2 ATS in their last 11 road games. Dallas has been excellent at home in this rivalry in recent years though, going 6-1 ATS in the last seven meetings. The Cowboys are 13-6-1 in their last 20 Sunday home games, and they are coming off a dominant win over the Raiders. Quarterback Dak Prescott completed 25 of 33 passes for 268 yards, four touchdowns and zero interceptions. Model's Cowboys vs. Eagles score prediction, picksThe SportsLine Projection Model knows that both offenses have plenty of firepower, as Prescott leads an offense that ranks second in the league with 29.6 points per game. Philadelphia is averaging 23.4 points per game, and it is facing a Dallas defense that is allowing the second-most points per game (29.3). The model has Philadelphia winning by three points, but its top pick is the Over (47.5), as it is projecting 49 total points. Eagles vs. Cowboys score prediction: Eagles 26, Cowboys 23Cowboys vs. Eagles SGPOver 47.5 (-115)A.J. Brown anytime touchdown (+135)Jalen Hurts Over 27.5 rushing yards (-114)Final odds: +503 (wager $100 to win $503)Click here to bet Eagles vs. Cowboys at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Want more Week 12 NFL picks?You've seen the model's best bets for Philadelphia Eagles vs. Dallas Cowboys. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Eagles vs. Cowboys picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/7ac3be56-c3ff-42be-bb6e-37cdda6038f9/thumbnail/1200x675/65da7ba5e000663330cffc6d811b470d/jalen-hurts-philadelphia-eagles.jpg"
      ],
      "datePublished": "2025-11-23T15:58:44.000Z",
      "dateModified": "2025-11-23T15:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Vikings vs. Packers picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-packers-where-to-watch-nfl-week-12-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/d2833ecb-9afb-4f26-baef-a8a41b0a7038/thumbnail/1200x675/3e36e3e0127f4f293ba8b3b20ab733bf/jordan-love-packers-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:18:39.000Z",
    "description": "\n        The 6-3-1 Green Bay Packers aim to stay in the hunt for the NFC North when they face the division rival Minnesota Vikings in Week 12 of the N",
    "body": "\n        The 6-3-1 Green Bay Packers aim to stay in the hunt for the NFC North when they face the division rival Minnesota Vikings in Week 12 of the NFL season. Green Bay has had an up-and-down campaign with big wins and strange losses while Minnesota is having a rough year after winning 14 games in 2024. Kickoff from Lambeau Field is set for 1 p.m. ET on FOX. The Packers are 6.5-point favorites, according to the latest Vikings vs. Packers odds. The over/under for total points scored is 41.5. The Packers are -292 money line favorites (risk $292 to win $100), while the Vikings are +235 underdogs. Before making any Vikings vs. Packers picks, make sure you check out the NFL picks from the SportsLine Projection Model.Click here to bet Vikings vs. Packers at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Vikings vs. PackersBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Vikings vs. Packers on SundayWhen: Sunday, Nov. 23Time: 1 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppVikings vs. Packers betting previewOdds: Packers -6.5, over/under 41.5The Vikings are 4-6 on the year and 4-6 against the spread, but they're 7-3 on the Over side of the total this season. Green Bay is 6-3-1 but is just 3-7 ATS and 5-5 to the Over. Green Bay is also 2-3 ATS at home this year.Click here to bet Vikings vs. Packers at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Vikings vs. Packers SGPPackers -6.5 (-110, FanDuel)Under 41.5 (-115, FanDuel)Justin Jefferson anytime touchdown scorer (+200)Final odds: +971 at FanDuel (wager $100 to win $971)Model's Vikings vs. Packers score prediction, picksThe model likes the Packers at home here, projecting both a win and cover for Green Bay against Minnesota, which has lost two in a row entering Week 12. The model also favors the Under in large part because it doesn't anticipate the Vikings' offense doing much against Green Bay's defense.Vikings vs. Packers score prediction: Packers 24, Vikings 15Want more Week 12 NFL picks?You've seen the model's best bets for Minnesota Vikings vs. Green Bay Packers. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Vikings vs. Packers picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/d2833ecb-9afb-4f26-baef-a8a41b0a7038/thumbnail/1200x675/3e36e3e0127f4f293ba8b3b20ab733bf/jordan-love-packers-cbs.jpg"
      ],
      "datePublished": "2025-11-23T15:18:39.000Z",
      "dateModified": "2025-11-23T15:18:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arsenal vs. Tottenham: Live stream, how to watch, where to watch, time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-vs-tottenham-live-stream-how-to-watch-premier-league-start-time-tv-channel-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/18/0a03a8af-0809-4da8-9dfb-351184f76f81/thumbnail/1200x675/cd618e43a80069a2fbd840b9c26e8bc4/25-nwsl-champ-hq-slate-sat.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:28:12.000Z",
    "description": "\n        Welcome to the weekend! Winners' medals will be doled out in abundance in the U.S. on Saturday as the NWSL Championship and the USL Champions",
    "body": "\n        Welcome to the weekend! Winners' medals will be doled out in abundance in the U.S. on Saturday as the NWSL Championship and the USL Championship final take place, the former headlined by U.S. women's national team stars like the Washington Spirit's Trinity Rodman and Gotham FC's Jaedyn Shaw.📺 Footy fixAll times U.S./EasternFriday, Nov. 21🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Preston North End vs. Blackburn Rovers, 3 p.m. ➡️ Paramount+, CBS Sports Golazo NetworkSaturday, Nov. 22🇩🇪 Bundesliga: Bayern Munich vs. Freiburg, 9:30 a.m. ➡️ ESPN+🏴󠁧󠁢󠁥󠁮󠁧󠁿 EPL: Liverpool vs. Nottingham Forest, 10 a.m. ➡️ Peacock🇪🇸 LaLiga: Barcelona vs. Athletic Club, 10;15 a.m. ➡️ ESPN+🏆 USL Championship final: FC Tulsa vs. Pittsburgh Riverhounds, 12 p.m. ➡️ CBS, Paramount+🇮🇹 Serie A: Fiorentina vs. Juventus, 12:15 p.m. ➡️ Paramount+🏆 NWSL Championship: Washington Spirit vs. Gotham FC, 8 p.m. ➡️ CBS, Paramount+🇺🇸🇨🇦 MLS Cup playoffs: Vancouver Whitecaps vs. LAFC, 9:30 p.m. ➡️ Apple TV\nSunday, Nov. 23🏴󠁧󠁢󠁥󠁮󠁧󠁿 EPL: Arsenal vs. Tottenham Hotspur, 11:30 a.m. ➡️ Peacock🇮🇹 Serie A: Inter vs. AC Milan, 2:45 p.m. ➡️ Paramount+🇪🇸 LaLiga: Elche vs. Real Madrid, 3 p.m. ➡️ ABC🇺🇸 MLS Cup playoffs: FC Cincinnati vs. Inter Miami, 5 p.m. ➡️ Apple TV\n                                                                    Paramount+\n                                                            What's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arsenal vs. Tottenham: Live stream, how to watch, where to watch, time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/18/0a03a8af-0809-4da8-9dfb-351184f76f81/thumbnail/1200x675/cd618e43a80069a2fbd840b9c26e8bc4/25-nwsl-champ-hq-slate-sat.jpg"
      ],
      "datePublished": "2025-11-23T15:28:12.000Z",
      "dateModified": "2025-11-23T15:28:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Colts vs. Chiefs picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-chiefs-where-to-watch-nfl-week-12-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/e2e69bcf-1aa0-48dc-9e1c-7d0bf539da34/thumbnail/1200x675/498c2eb7417160a1959aad5dc6aa5a5d/patrick-mahomes-imagn.jpg",
    "tag": "Sports",
    "date": "2025-11-23T14:54:24.000Z",
    "description": "\n        Arguably the biggest game of Week 12 of the NFL season has Daniel Jones and the Indianapolis Colts visiting Patrick Mahomes and the Kansas Ci",
    "body": "\n        Arguably the biggest game of Week 12 of the NFL season has Daniel Jones and the Indianapolis Colts visiting Patrick Mahomes and the Kansas City Chiefs. Indy has shocked the league by jumping out to an 8-2 record, while Kansas City is just as surprising with its meager 5-5 record. The Chiefs are still threats to get hot and make another Super Bowl run as long as Mahomes and Andy Reid are there, but falling below .500 would be extremely disappointing. A win, meanwhile, would be a true statement for the Colts.Kickoff from Arrowhead Stadium is set for 1 p.m. ET on CBS and Paramount+. The Chiefs are 3.5-point favorites, according to the latest Chiefs vs. Colts consensus odds. The over/under for total points scored is 49.5, down one from the opening line. Before making any Colts vs. Chiefs picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Colts vs. Chiefs at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Colts vs. ChiefsBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Colts vs. Chiefs on SundayWhen: Sunday, Nov. 23Time: 1 p.m. ETTV: CBS Stream: Paramount+Follow along: CBS Sports AppColts vs. Chiefs betting previewOdds: Chiefs -3.5, over/under 49.5Indianapolis is 6-3-1 against the spread and 6-4 to the Over. Kansas City is 5-5 ATS and 7-3 to the Under. Four of the last five Colts games have gone Over, while five of the last five Chiefs games have gone Under. Colts vs. Chiefs SGPChiefs -3.5 (-104, FanDuel)Xavier Worthy anytime touchdown scorer (+220, FanDuel)Jonathan Taylor Under 20.5 receiving yards (-114, FanDuel)Final odds: +810 at FanDuel (wager $100 to win $810)Click here to bet Colts vs. Chiefs at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Colts vs. Chiefs score prediction, picksPopular sentiment says the Chiefs can't be declared dead until there's no longer a pulse to detect, and the model agrees. It expects Arrowhead to remain a fortress, as Kansas City wins in 65% of the model's simulations. The Chiefs also cover in 57% of the simulations. The Under hits 51% of the time. Colts vs. Chiefs score prediction: Chiefs 29, Colts 22Want more Week 12 NFL picks?You've seen the model's best bets for Indianapolis Colts vs. Kansas City Chiefs. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Colts vs. Chiefs picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/e2e69bcf-1aa0-48dc-9e1c-7d0bf539da34/thumbnail/1200x675/498c2eb7417160a1959aad5dc6aa5a5d/patrick-mahomes-imagn.jpg"
      ],
      "datePublished": "2025-11-23T14:54:24.000Z",
      "dateModified": "2025-11-23T14:54:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Seahawks vs. Titans: Live stream, kickoff time today, prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-vs-titans-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/20/5f110933-d018-4be2-ba83-f8ac51563584/thumbnail/1200x675/8dfc68db2eec29d2c7029336496708a4/usatsi-27546627-2.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:20:32.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Seattle has a nice bounce-back opportunity after a tough loss\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 23, 2025\n                            \n                    at\n    10:20 am ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Seattle Seahawks are coming off their first loss in over a month, and they are presented with a great opportunity to rebound. The Tennessee Titans are still searching for their second win of the season, and they have yet to taste victory at home.In a key divisional matchup against the Los Angeles Rams, Seahawks quarterback Sam Darnold played his worst game of the season. He threw four picks, and those were the difference in a 21-19 loss. Even in a disappointing effort from Darnold, star receiver Jaxon Smith-Njigba still shined with nine catches for 105 yards. Expect him to feast on this Titans secondary. On the other side of the ball, the Seahawks have one of the best units in the league, allowing just 19.3 points per game.Bet Titans vs. Seahawks at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass with a winning $5 wager:The Titans came excruciatingly close to that elusive second win last week as the Houston Texans nailed a game-winning field goal at the buzzer. Rookie quarterback Cam Ward showed signs of improvement with 226 total yards and a passing touchdown, which came on a game-tying drive in crunch time. The Titans still lack playmakers around Ward, and they might be even more depleted in that regard this week as injuries pile up in the wide receiver room.\nEverything you need to know about this inter-conference clash can be found below.Where to watch Seahawks vs. Titans liveDate: Sunday, Nov. 23 | Time: 1 p.m. ETLocation: Nissan Stadium (Nashville)TV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Seahawks -13.5; O/U 40.5 (via FanDuel Sportsbook)Bet Seahawks vs. Titans and other NFL Week 12 games at FanDuel Sportsbook, where new users get $150 in bonus bets with a winning $5 wager.\nSeahawks vs. Titans: Need to knowDarnold has been having turnover troubles. The Titans have a pretty narrow path to victory in this matchup, and it involves creating turnovers and giving their offense short fields. As good as Darnold has been at times over the last two seasons, he has been prone to turnovers. As a matter of fact, no one has turned the ball over more than Darnold in that span as he's coughed up the ball a total of 30 times. Darnold has to do a much better job of taking care of the football this weekend. Titans' woes at WR. Even when the fully healthy, the Titans don't have any real game-breakers at wide receiver. This week, that situation is even worse than usual as the offense could be without Calvin Ridley, Elic Ayomanor and Chimere Dike. That leaves Van Jefferson as Tennessee's leading receiver at wideout, so Ward will likely have to lean on tight ends Chig Okonkwo and Gunnar Helm in the passing game.Smith-Njigba making history. If there were any concerns about Smith-Njigba being a legit No. 1 receiver coming into the season, that has been completely eliminated by now. He is the first player in NFL history with at least 75 receiving yards in each of his team's first 10 games. He's eclipsed the 100-yard mark in seven of those 10 games too. Given how depleted the Titans secondary is, Smith-Njigba should only add to those numbers on Sunday.Seahawks vs. Titans prediction, pick\nThe Seahawks are massive 13.5-point favorites in this one, and it's not hard to see them covering that big number. Still, I lean toward the under 40.5 points in this one. With the Tennessee offense in shambles, Seattle's defense should have a field day. On the other side of the ball, the Seahawks may just be nursing a multiple score lead and bleeding the clock in the second half. Pick: Seahawks -13.5; Under 40.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Seahawks vs. Titans: Live stream, kickoff time today, prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/20/5f110933-d018-4be2-ba83-f8ac51563584/thumbnail/1200x675/8dfc68db2eec29d2c7029336496708a4/usatsi-27546627-2.jpg"
      ],
      "datePublished": "2025-11-23T15:20:32.000Z",
      "dateModified": "2025-11-23T15:20:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bengals vs. Patriots picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-bengals-where-to-watch-nfl-week-12-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-23T14:45:55.000Z",
    "description": "\n        The Cincinnati Bengals and New England Patriots meet on Sunday in Week 12 of the 2025 NFL season with Cincinnati hoping to make a late playof",
    "body": "\n        The Cincinnati Bengals and New England Patriots meet on Sunday in Week 12 of the 2025 NFL season with Cincinnati hoping to make a late playoff push while New England attempts to keep its winning streak going. The Bengals will be without Ja'Marr Chase thanks to a suspension, and quarterback Joe Burrow (toe) is out again. The Patriots have won eight in a row and have the No. 2 seed in the AFC but have the same record as the Broncos. Kickoff from Gillette Stadium is set for 1 p.m. ET on CBS and Paramount+. The Patriots are 7.5-point favorites, according to the latest Bengals vs. Patriots odds, and the over/under for total points scored is 50.5. Click here to bet Bengals vs. Patriots at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Bengals vs. Patriots BrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Bengals vs. Patriots on SundayWhen: Sunday, Nov. 23Time: 1 p.m. ETTV: CBS Stream: Paramount+Follow along: CBS Sports AppBengals vs. Patriots betting previewOdds: Patriots -7.5, over/under 50.5These teams met in Week 1 last season and the Patriots pulled off a surprising 16-10 win thanks to two crucial Cincinnati turnovers. A lot has changed since then. Mike Vrabel is the Patriots coach and Drake Maye is now the full-time starter in Year 2 looking like an MVP candidate, while Cincinnati has flailed thanks to injuries and poor defensive play.Bengals vs. Patriots SGPPatriots -7.5 (-110)Over 50.5 (-115)TreVeyon Henderson anytime touchdown scorer (-175)Final odds: +343 at FanDuel (wager $100 to win $343)Click here to bet Bengals vs. Patriots at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Bengals vs. Patriots score prediction, picksThe Patriots cover the 6.5-point spread in 52% of model simulations, while the Over on 50.5 hits in 49% of simulations. However, the model does believe the Bengals are worth backing on the money line as they win in 32% of simulations. That brings bettors value at the current money line odds.Bengals vs. Patriots score prediction: Patriots 30, Bengals 21Want more Week 12 NFL picks?You've seen the model's best bets for Cincinnati Bengals vs. New England Patriots. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bengals vs. Patriots picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2025-11-23T14:45:55.000Z",
      "dateModified": "2025-11-23T14:45:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Giants vs. Lions picks, score prediction, SGP for NFL Week 12 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-lions-where-to-watch-nfl-week-12-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/caca2385-699e-4ce8-95c9-93a264f5f8e6/thumbnail/1200x675/59d1702f49e242493b51b52aec4cdcb0/jared-goff-jahmyr-gibbs-detroit-lions.jpg",
    "tag": "Sports",
    "date": "2025-11-23T15:13:37.000Z",
    "description": "\n        The New York Giants and Detroit Lions will match up in Week 12 of the 2025 NFL season with both franchises trending in opposite directions. T",
    "body": "\n        The New York Giants and Detroit Lions will match up in Week 12 of the 2025 NFL season with both franchises trending in opposite directions. The Giants are operating under an interim head coach and will be without rookie sensation Jaxson Dart (concussion) again for this contest, while the Lions try to bounce back from a loss to the Eagles on Sunday Night Football in Week 11 to prove they are still contenders. The Giants are 2-9 entering this game, while the Lions are 6-4. According to the latest Giants vs. Lions odds, Detroit is favored by 13.5 points, while the over/under for total points scored is 50.5.Click here to bet Giants vs. Lions at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Giants vs. LionsBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Giants vs. Lions on SundayWhen: Sunday, Nov. 23Time: 1 p.m. ETTV: FOXFollow along: CBS Sports AppGiants vs. Lions betting previewOdds: Lions -13.5, over/under 50.5While Detroit has struggled in outdoor environments, the Lions are a juggernaut at home on offense. They should be able to rebound from a poor showing in Week 11 against the Giants, who are tied for 29th in points allowed per game at 27.3. Detroit is averaging 29.2 points per game, which is tied for fourth-best in the NFL.Click here to bet Giants vs. Lions at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Giants vs. Lions SGPGiants +13.5 (-110)Over 50.5 (-108)Amon-Ra St. Brown anytime touchdown scorer (-135)Final odds: +415 at DraftKings (wager $100 to win $415)Model's Giants vs. Lions score prediction, picksThe SportsLine Projection Model has the Giants covering the 13.5-point spread in 53% of simulations, and it sees value in backing the Giants on the money line as +640 underdogs. New York wins in 22% of simulations to bring value at those odds. With Detroit's propensity to run up the score on teams at home, the model likes the Over 50.5, which hits in 55% of simulations.Giants vs. Lions score prediction: Lions 32, Giants 21Want more Week 12 NFL picks?You've seen the model's best bets for New York Giants vs. Detroit Lions. Now, get against the spread, total and money-line picks for every Week 12 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Giants vs. Lions picks, score prediction, SGP for NFL Week 12 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/caca2385-699e-4ce8-95c9-93a264f5f8e6/thumbnail/1200x675/59d1702f49e242493b51b52aec4cdcb0/jared-goff-jahmyr-gibbs-detroit-lions.jpg"
      ],
      "datePublished": "2025-11-23T15:13:37.000Z",
      "dateModified": "2025-11-23T15:13:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Browns-Raiders, Buccaneers-Rams - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-free-nba-league-pass-browns-raiders-buccaneers-rams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/07724ebc-a1c3-41ad-bbec-197826cd3286/thumbnail/1200x675/aa9b65e1912442654f416baef5e78784/baker-mayfield-and-sean-tucker.jpg",
    "tag": "Sports",
    "date": "2025-11-23T14:38:05.000Z",
    "description": "\n        With the latest DraftKings promo code, new users receive $200 in bonus bets and three free months of NBA League Pass to bet on the Week 12 NF",
    "body": "\n        With the latest DraftKings promo code, new users receive $200 in bonus bets and three free months of NBA League Pass to bet on the Week 12 NFL schedule. The Los Angeles Rams are the betting favorites to win the 2026 Super Bowl at DraftKings Sportsbook at +500 and are 7-point favorites in the latest Sunday Night Football odds at DraftKings against the Tampa Bay Buccaneers. Although Tampa Bay has lost back-to-back games, the SportsLine model views this as too many points for a talented  Buccaneers team, backing Tampa Bay to cover the spread as a part of its Sunday NFL best bets. The model is also backing the Browns as 3.5-point underdogs and Over 44.5 total points in Ravens vs. Jets. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Sunday best bets at DraftKings SportsbookRavens vs. Jets: Over 44.5 pointsBrowns (+3.5) vs. RaidersBuccaneers (+7) vs. RamsCombining the model's three picks into a Saturday parlay at DraftKings would result in a payout of +562 (risk $100 to win $562). Bet it at DraftKings here:\nRavens vs. Jets: Over 44.5 pointsThe Ravens are 13.5-point favorites, so it's no surprise that Baltimore is the main reason why the model is siding with the Over. Lamar Jackson reappeared on the injury report during the week, but he's good to go on Sunday, which means great things for the Baltimore offense. The Ravens have scored at least 23 points in all three games since Jackson's return from injury, and now, they'll be facing the No. 27 scoring defense, with New York allowing 26.8 ppg this season. The Jets are moving from Justin Fields to Tyrod Taylor at quarterback, and after ranking 25th in the league at 20.9 ppg this season, it's hard to imagine this move as a net negative for New York. The model projects the Over to hit in 73% of simulations. Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Browns (+3.5) vs. RaidersIt may be hard to remember, but around this time last year, Shedeur Sanders was in the conversation to be the No. 1 overall pick in the NFL Draft. Sanders' Draft Day results are well known, as he plummeted down to the fifth round, but he'll have his first chance to prove himself as an NFL starter on Sunday. It's not the most challenging debut, as the Raiders rank 24th in scoring defense at 25.3 ppg, and their offense has been even worse than Cleveland's. The Browns are averaging 16.2 points per game, while the Raiders are averaging 15.5 points per game, ranking 29th and 30th in the league. Having the ability to win the wager on a 3-point result is a nice incentive as well, and the model suggests taking the points on this one. The model projects the Browns to cover in 56% of simulations. Back the Browns at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Buccaneers (+7) vs. RamsThe Rams enter on a five-game winning streak, but only one of those games came against a team that made the playoffs last season, and that was against a Ravens team without Lamar Jackson. This will be a significantly tougher challenge for Los Angeles as Tampa Bay has won the NFC South in each of the last four seasons and currently leads the division with a 6-4 record. Two of Tampa Bay's four losses this season have covered a 7-point spread as well, and the model expects the Buccaneers to keep pace with the Rams on Sunday Night Football, projecting Tampa Bay to cover in 59% of simulations. Back the Bucs at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:\nWant more NFL picks?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Browns-Raiders, Buccaneers-Rams - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/07724ebc-a1c3-41ad-bbec-197826cd3286/thumbnail/1200x675/aa9b65e1912442654f416baef5e78784/baker-mayfield-and-sean-tucker.jpg"
      ],
      "datePublished": "2025-11-23T14:38:05.000Z",
      "dateModified": "2025-11-23T14:38:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]