[
  {
    "title": "Memphis vs. South Florida prediction, odds, line, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/memphis-south-florida-odds-prediction-time-2026-college-basketball-picks-february-19/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/7f0135cb-8fcc-4c5a-ba69-57d8979cc778/thumbnail/1200x675/5d8055ebe1edafeca1bea693203aa0d4/sincere-parker-memphis-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-19T21:38:32.000Z",
    "description": "\n        The South Florida Bulls will look to win their fifth game in a row when they battle the Memphis Tigers in a key American Conference matchup o",
    "body": "\n        The South Florida Bulls will look to win their fifth game in a row when they battle the Memphis Tigers in a key American Conference matchup on Thursday. Memphis is coming off a 99-75 loss at Utah State on Saturday, while South  Florida downed Florida Atlantic 83-81 on Sunday. The Tigers (12-13, 7-5 American), who have lost two in a row, are 2-8 on the road this season. The Bulls (18-8, 10-3 American), who lead the American, are 10-2 on their home court.Tip-off from Yuengling Center in Tampa, Fla., is set for 7 p.m. ET. Memphis leads the all-time series 34-8. South Florida is a 8.5-point favorite in the latest Memphis vs. South Florida odds from DraftKings Sportsbook, while the over/under for total points scored is 163.5. Both teams have identical records related to the total this season as each has seen the Over go 13-12. Before making any South Florida vs. Memphis picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it entered Week 16 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on a 13-7 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Memphis vs. South Florida 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for South Florida vs. Memphis:Memphis vs. South Florida                                                                         spread:    South Florida -8.5     at DraftKings SportsbookMemphis vs. South Florida                                                                                                                                                                                                                                                       over/under:    163.5 pointsMemphis vs. South Florida                                                                                                                                 money line:    Memphis +352, South Florida -469Memphis vs. South Florida                                                                                                                                                                                                                                                                                    picks:    See picks at SportsLineMemphis vs. South Florida                                                                                                                                                                                                                                                                                     streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top South Florida vs. Memphis predictionsSportsLine's model is going Under on the total (163.5 points). The Under has hit in each of the last three head-to-head matchups. The Under has also hit in five of the last eight South  Florida games, including in each of the last three. The Tigers are 4-6 against the spread in their last 10 games, while the Bulls are 5-5 ATS in their last 10.The model projects the Tigers to have three players score 10.1 points or more, including Dug McDaniel's projected 15.5 points. The Bulls are projected to have five players score 10.8 or more points, led by Izaiyah Nelson, who is projected to score 16.7 points. The Under clears in 63.3% of simulations.How to make Memphis vs. South Florida picksThe model also says one side of the spread hits well over 50% of the time. You can only see that pick at SportsLine.So who wins South Florida vs. Memphis, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Memphis vs. South Florida spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Memphis vs. South Florida prediction, odds, line, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/7f0135cb-8fcc-4c5a-ba69-57d8979cc778/thumbnail/1200x675/5d8055ebe1edafeca1bea693203aa0d4/sincere-parker-memphis-cbs-imagn.jpg"
      ],
      "datePublished": "2026-02-19T21:38:32.000Z",
      "dateModified": "2026-02-19T21:38:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-thursday-february-19-basketball-parlay-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-19T22:17:07.000Z",
    "description": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (",
    "body": "\n        A 10-game schedule kick starts the post-all-star break slate. Among the notable NBA odds include Pistons vs. Knicks (-4.5), Hawks vs. 76ers (-1.5), Celtics (-5.5) vs. Warriors and Nuggets (-4.5) vs. Clippers. The largest NBA spread of the day has Cleveland as 15.5-point favorites over Brooklyn, as the Cavs covered in four of their last five games heading into the NBA All-Star break.What are the NBA best bets for Thursday, and which combination of picks should you target in a Thursday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5 bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model exited the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.  \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +450. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $100 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Thursday, Feb. 19After simulating every game 10,000 times, the model is backing the Los Angeles Clippers (+4.5) to cover the spread against the Denver Nuggets at 10:30 p.m. ET. The Nuggets look for the season sweep over the Clippers, after posting a 130-116 win in Los Angeles on Nov. 12 and a 122-109 victory at Denver on Jan. 30. The Nuggets will be without Aaron Gordon (hamstring) and Peyton Watson (hamstring) and failed to cover in three of their last four heading into the All-Star break. Meanwhile, Los Angeles has won three of the last four meetings at home against Denver.\nVeteran forward Kawhi Leonard powers the Clippers' offense. In 41 games, all starts, he is averaging 27.9 points, 6.4 rebounds, 3.7 assists and 2.1 steals in 32.8 minutes. He registered a double-double with 27 points and 12 rebounds in a 105-102 win over the Houston Rockets on Feb. 11 and is coming off an epic All-Star Game performance with 31 of the 48 points for USA Stripes against Team World.The model is projecting four Nuggets players to score 10.7 points or more, led by Nikola Jokic's 27.5 points. The Clippers, meanwhile, are projected to be led by Leonard's 30.5 points as five Los Angeles players score 10.2 points or more. The model is backing Los Angeles to cover nearly 70% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Thursday, Feb. 19The model also has locked in two more picks, including backing a team to win in nearly 80% of model simulations. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Thursday, and which best bets should you target for a chance at a payout of over +450? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Thursday parlay returns over +450 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/4623bed6-86a5-4da5-ba3c-e34571535c84/thumbnail/1200x675/d8e55e5a46019642f472b526bb84fe5e/kawhi-leonard-los-angeles-clippers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-19T22:17:07.000Z",
      "dateModified": "2026-02-19T22:17:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Genesis Invitational leaderboard: Rory McIlroy stellar, Scottie Scheffler not - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/genesis-invitational-leaderboard-2026-thursday-rory-mcilroy-scottie-scheffler/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/7b34ae19-6dde-42b4-b272-e89178576d82/thumbnail/1200x675/ccd867475d0ac5ff0d8095e0acf0b90e/rory-mcilroy-genesis-1-g.jpg",
    "tag": "Sports",
    "date": "2026-02-20T02:55:39.000Z",
    "description": "\n        On a day at Riviera Country Club that featured everything from a deluge of rain to a 3-hour weather delay to wind gusts hovering around 30 mi",
    "body": "\n        On a day at Riviera Country Club that featured everything from a deluge of rain to a 3-hour weather delay to wind gusts hovering around 30 miles per hour, a man who has done just about everything in the game of golf rose to the top of the leaderboard. Rory McIlroy was nearly flawless in the first round of the 2026 Genesis Invitational, shooting his lowest-ever score across the first 18 holes at Riviera with a 5-under 66 to sit one stroke behind Aaron Rai.Round 1 was suspended due to darkness with the likes of world No. 1 Scottie Scheffler, Xander Schauffele and Jordan Spieth all needing to complete the majority of their back nines on Friday when play resumes at 7 a.m. PT.Scheffler will take the interruption in stride as he was 5 over through 10 holes, 11 strokes off the lead and tied for last place when play was called. It's the third straight week in which the best player in the game has slipped out of the gate.McIlroy, meanwhile, was among the first players on the golf course; as such, he was able to finish his first round. He now looks to do what neither tournament host Tiger Woods nor legend Jack Nicklaus accomplished in their careers: win at the historic venue that is Riviera. On the line is not only the trophy and a signature event purse but the five-time major champion reaching the 30-win mark on the PGA Tour.\n\"I've definitely got more comfortable playing in conditions like this over the past few years as I've gotten more comfortable in controlling my ball flight, and controlling my ball flight taking a lot more club, hitting the ball low,\" McIlroy said. \"I've started to just really enjoy this style of golf. \"If you had asked me 10 years ago, I didn't enjoy these conditions, but it's been a shift in a mindset and maybe just a continuation of trying to build upon the skill set that I have. Then, when it does get to conditions like this, I'm a lot more prepared. I wouldn't say I enjoy them, but I can certainly handle them better.\"If McIlroy plays the next 54 holes in the same manner as his first 18, he will win this tournament. Battling and overcoming the conditions, he played golf in its truest essence -- flighting drives depending on the wind direction, leaving himself with easy leaves and taking care of the scoring holes.\nAttacking the early portions of both nines, McIlroy started his round emphatically, making birdie on three of his first four holes to propel himself to the top of the leaderboard. His birdie on the newly lengthened par-3 4th came right out of the rain delay as his first stroke produced a 30-foot birdie.\nOnce the rain subsided, wind entered the equation, and McIlroy answered masterfully. Showing off every tool in his belt, the 36-year-old headlined his grouping that featured another round in the 60s from Tommy Fleetwood -- the Englishman has broken 70 in 20 straight PGA Tour rounds -- and a nifty 68 from last week's winner Collin Morikawa. \"Just trying to keep the same mindset essentially,\" Morikawa said. \"You don't want to get too relaxed, but you also want to kind of find that zone to go out and play golf. A long day, a lot of back and forth kind of rain, no rain, a lot of wind, no wind. Just was able to get the ball in the hole, which was kind of the whole goal.\"\nLeader1. Aaron Rai (-6): Known as a Point A to Point B type of player, Rai kept everything in front of him on Thursday, and he was rewarded with a stellar performance on the greens. The Englishman opened with an eagle, tacked on six more birdies and made putts from nearly 80 feet on No. 9, 7 feet on No. 11, 21 feet on No. 13, 12 feet on No. 15 and finally 7 feet on No. 16. He will have a chance to extend his lead Friday morning as he starts his day on the par-5 17th.ContendersT2. Rory McIlroy, Jacob Bridgeman (-5)4. Ryan Fox (-4)T5. Pierceson Coody, Akshay Bhatia, Collin Morikawa, Aldrich Potgieter, Max Greyserman, Si Woo Kim, Marco Penge (-3)T12. Jhonattan Vegas, Taylor Pendrith, Maverick McNealy, Viktor Hovland, Hideki Matsuyama, Tommy Fleetwood, Ryo Hisatsune, Harry Hall (-2)Only two weeks into his PGA Tour season, and Hovland is already searching for answers with his driver. He may have found them on Thursday. Missing only two fairways, the Norwegian looked noticeably more comfortable with the big stick in hand and was sensational from tee to green. He will need to clean up his play on and around the green as all three bogeys were courtesy of some sloppy play in that area, but if his full swing is in order, he should love his placement.\n\"You might have seen the band drill that I was messing around with now. It's still trying to serve the same purpose, but I feel like that actually made it easier for me to find something tangible that I could take out on the golf course,\" Hovland said. \"Trying to just get a little bit wider in the downswing, not trying to pull my arms as close to me. That's what the floaties were for, trying to get some space in the downswing. It was just hard to feel that when I took the floaties away. \"But the band, because it forces your body to push against the tension, and then when you take it away, it's like, 'Wow, that's what it's supposed to feel like.' We're not quite all there yet, even though this is a great round of golf, but that was a huge step in the right direction.\"\nScheffler's Thursday struggles continueIt was an inauspicious start from the world No. 1 on the first hole as Scheffler found the surface on the easy par 5 only to need three putts and walk off the green with a par. That ultimately told the tale of his day as Scheffler never made it easy on himself.\nWith two bogeys in his first six holes, he started to head even further south on the leaderboard when he made a head-scratching double bogey on No. 8, which featured another three-putt. He turned in 4 over, made an ugly bogey on the devilish, short par-4 10th and made par on another scoring chance on the par-5 11th to put a bow on his day.Like the last three weeks, Scheffler faces a long climb back, and unlike last week, he will be staring the cutline directly in the face as the top 50 players and ties (as well as those within 10 strokes of the leader) will secure tee times over the weekend.2026 Genesis Invitational updated odds, picksOdds via DraftKings SportsbookRory McIlroy: +350Aaron Rai: 10-1Si Woo Kim: 13-1Jacob Bridgeman: 15-1Collin Morikawa: 15-1Tommy Fleetwood: 18-1Hideki Matsuyama: 19-1Scheffler is at 26-1, if that tickles your fancy, but instead, we will look at someone else on the golf course with holes remaining in his first round: Matt Fitzpatrick at 36-1. The Englishman is 1 under, through 15 holes and will have a couple of scoring chances coming in Friday morning. He made nothing on the greens Thursday, so if his fortunes change, he will make up some ground.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Genesis Invitational leaderboard: Rory McIlroy stellar, Scottie Scheffler not - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/7b34ae19-6dde-42b4-b272-e89178576d82/thumbnail/1200x675/ccd867475d0ac5ff0d8095e0acf0b90e/rory-mcilroy-genesis-1-g.jpg"
      ],
      "datePublished": "2026-02-20T02:55:39.000Z",
      "dateModified": "2026-02-20T02:55:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USA vs. Canada hockey: Megan Keller scores winning goal in OT, gives U.S. gold medal - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/megan-keller-goal-team-usa-canada-gold-medal-2026-winter-olympics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/14906f65-b392-4b7c-baa3-728b71591ad0/thumbnail/1200x675/4fc8a2790ed7970a249066ace4e66205/megan-keller-goal-getty.png",
    "tag": "Sports",
    "date": "2026-02-19T21:50:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The United States women's hockey team is golden. M",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The United States women's hockey team is golden. Megan Keller put home the game-winning goal in the 2026 Milano Cortina Winter Olympics gold-medal contest against rival Canada in overtime, placing Team USA on top in a 2-1 thriller on Thursday. Keller made a fantastic move to get past defender Claire Thompson and pushed the puck past Ann-Renée Desbiens for the clinching goal to conclude the women's hockey tournament at the Games. Keller's teammates scrambled to embrace her after she secured Team USA's first gold medal since the 2018 Pyeongchang Games.\nKeller became just the fourth player, woman or man, and first American to score an overtime goal in an Olympic gold-medal game. She joined Canada's Sidney Crosby (2010 vs. USA) and Marie-Philip Poulin (2014 vs. USA) and Russia's Kirill Kaprizov (2018 vs. Germany) as the only players to do so.These Olympics are Keller's third with the national team. The Boston College product, who plays professionally with the PWHL's Boston Fleet, finished the Olympic tournament tied with Team USA's Caroline Harvey as the competition's leading scorer with nine points. Her three goals were the most of any defender in the tournament.\nKeller's clutch goal put the finishing touches on a riveting comeback effort from the Americans, who trailed 1-0 with just over two minutes to play in regulation. Hilary Knight leveled the score with 2:04 on the clock in the third period, setting the stage for a golden-goal situation in overtime. Knight's game-tying goal made her the all-time scoring leader in U.S. Olympic women's hockey history.The United States has medaled at every Olympics since women's hockey became an official sport in 1998. This first-place finish is the third in Team USA history.The victory also improved the United States' record against Canada in Olympic gold-medal games to 3-4. The bordering nations have met in the championship in all but one tournament, and Team USA reigned victorious in two of the last three.\nThursday's match was just the second time in the tournament that the Americans needed more than one goal to win a game. They cruised through the competition with five consecutive shutouts after surrendering one goal in the preliminary round opener. The two goals they scored against Canada were their fewest in a game all Olympics, but both scores will live on in United States hockey lore.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USA vs. Canada hockey: Megan Keller scores winning goal in OT, gives U.S. gold medal - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/14906f65-b392-4b7c-baa3-728b71591ad0/thumbnail/1200x675/4fc8a2790ed7970a249066ace4e66205/megan-keller-goal-getty.png"
      ],
      "datePublished": "2026-02-19T21:50:00.000Z",
      "dateModified": "2026-02-19T21:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Hilary Knight breaks U.S. women's hockey scoring record vs. Canada - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-hilary-knight-usa-womens-hockey-scoring-record-canada/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/159ee2f4-cfd8-474b-b162-97de9c3b4476/thumbnail/1200x675/22caa0cd4d55f3f3d0a549709b2c07a8/hilary-knight-goal.png",
    "tag": "Sports",
    "date": "2026-02-19T21:12:34.000Z",
    "description": "\n        Hilary Knight has cemented herself as the greatest Olympic scorer in U.S. women's hockey history. And she did it in dramatic fashion. Knight ",
    "body": "\n        Hilary Knight has cemented herself as the greatest Olympic scorer in U.S. women's hockey history. And she did it in dramatic fashion. Knight scored the 15th goal of her Olympic career against Canada in Thursday's goal medal game, tying the score at 1-1 with just 2:04 left in regulation and opening the door for her team to win the gold medal on Megan Keller's golden goal in overtime.Knight broke the American women's record for career goals previously held by Natalie Darwitz and Katie King. In the process, she also broke the record for most career Olympic points in U.S. women's hockey history. Now at 33 points, she broke the record previously held by Jenny Potter (32 points -- 11 goals, 21 assists). Knight entered the final with 14 goals and 18 assists. \nKnight is already an American hockey icon with no qualifiers needed. From an international perspective, no U.S. player is more decorated than Knight, who won her second gold medal and fifth Olympic medal overall -- another U.S. record. Additionally, Knight is now the third Olympic hockey player in history with five medals to his or her name.Throughout her career, Knight has racked up 12 gold medals and eight silver medals between the Olympics and World Championships. In 115 career games with the U.S., Knight has piled up 81 goals and 70 assists.\n\n        \n            \n                2026 Winter Olympics: U.S. women's hockey team finishes incredible run, takes gold with OT win over Canada\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nIn addition to being a USA Hockey legend, Knight is also one of the greatest players in University of Wisconsin history. In four years with the Badgers, Knight totaled 143 goals, which still stands as the program record for men and women. Knight also led Wisconsin to national championships in 2009 and 2011.In less than three full seasons with the Professional Women's Hockey League, Knight has made her mark there as well. In 2024-25, Knight was tied for the league lead in points with 29 as a member of the Boston Fleet. This season, while captaining the Seattle Torrent in their inaugural season, Knight is tied for sixth in the league with seven assists.\nKnight, 36, doesn't need to add anything else to her resume. Her accolades are already spilling off the page as it is and a place in the Hockey Hall of Fame awaits Knight when her career is over.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Hilary Knight breaks U.S. women's hockey scoring record vs. Canada - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/159ee2f4-cfd8-474b-b162-97de9c3b4476/thumbnail/1200x675/22caa0cd4d55f3f3d0a549709b2c07a8/hilary-knight-goal.png"
      ],
      "datePublished": "2026-02-19T21:12:34.000Z",
      "dateModified": "2026-02-19T21:12:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-womens-champions-league-ranking-quarterfinalists-barcelona-real-madrid-chelsea-arsenal-lyonnes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:23:40.000Z",
    "description": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount",
    "body": "\n        The 2025-26 UEFA Women's Champions League is officially turning the page towards the quarterfinal round in March and April, live on Paramount+. After rewriting the tournament script with an 18-team Swiss model league phase, now just eight teams are left in the hunt for Europe's biggest prize. The newly shifted format of the competition produced exciting results, with some lopsided wins, exciting come-from-behind draws to salvage a point, and 181 goals during the league phase. Now it's time to plan for the quarterfinals. The quarterfinals will feature perennial powerhouses FC Barcelona and OL Lyonnes. The two sides dominated their opposition, and a three-goal differential proved the ultimate difference-maker in the standings heading into the quarterfinal phase. Manchester United and Arsenal join Chelsea FC as dominating English clubs in the next round, alongside Bayern Munich, Real Madrid, and Wolfsburg.Which teams are surging and which look untested? Time look at the results, the matchups and to rank the final eight Champions League teams:\nPlayoff resultsReal Madrid 2, Paris FC 0 (Real win 5-2 on aggregateArsenal 3, OH Leuven 1 (Arsenal win 7-1 on aggregate)Wolfsburg 2, Juventus 0 (Wolfsburg win 4-2 on aggregate)Man United 2, Atletico Madrid 0 (United win 5-0 on aggregate)Quarterfinal matchupsWatch all the action live on Paramount+.First legs to be played March 24-25, and second legs April 1-2Man United vs. Bayern MunichReal Madrid vs. BarcelonaArsenal vs. ChelseaWolfsburg vs. Lyon1. FC Barcelona  It's no secret that the Catalonians remain the team to beat in this tournament, topping the league phase with a plus-17 goal differential, and an opening 7-1 annihilation of Bayern Munich that sent defiant alarms throughout the competition. Carolina Graham Hansen, Alexia Putellas, alongside Claudia Pina and rising star Vicky Lopez, are getting it done flawlessly, with Aitana Bonmati on the sidelines with a leg injury.\n2. OL Lyonnes The eight-time winners flexed their champion experience, matched Barcelona's 16 points in the league phase, and showed they can put games away and rally from behind. Melchie Dumornay has officially reintroduced herself as a Ballon d'Or candidate with four goals (two braces) against Arsenal and Manchester United. Dumornay, alongside Kadidiatou Diani, Marie Antoinette Katoto, and Tabitha Chawinga, form an attacking quartet that strikes fear into every backline they face.3. Arsenal   The current title holders had a rocky start to their tournament but are now in solid form and back in familiar territory, the quarterfinals. Peaking at the right time is just part of the equation; scoring 88% of their open play goals off sequences in as few passes as possible makes them a dangerous side to face as the stakes get higher. New acquisition Olivia Smith is getting more lethal, and Alessia Russo is showing she's as reliable as ever in front of goal.4. Manchester UnitedDon't call them nervous newcomers, because the Red Devils keep proving they belong. They carried themselves with defensive performances in the league phase, and showed they know how to score during the knockout playoffs. Goalkeeper Phallon Tulis-Joyce of the U.S. women's national team and center back duo Dominique Jenssen and Maya Le Tissier have become a formidable defensive trio in front of goal.  \n5. Chelsea FCThe Blues earned a straight bye to the quarterfinals out of the league phase with four wins and two draws, and they matched Barcelona's 20 goals scored. They've hit a snag in form domestically, but there's no better reset than a run at the Champions League. The gradual return of Sam Kerr after a lengthy ACL absence adds another dimension to an attack highlighted by Alyssa Thompson's quick rise and skill on offense.6. Bayern MunichIt's tough to rank Bayern Munich outside of the top five but the beauty of a knockout phase highlights the more current form of other clubs, and while they earned their bye through to the quarterfinals after an embarrassing opening 7-1 loss to Barcelona, they won't be as battle tested when they go up against a rising Manchester United in the next round. 7. Real MadridAnother team that was difficult to put this low due to their recent efforts, but Real Madrid's too close for comfort performances combined with a quarterfinal match against their domestic rivals Barcelona, will force some adjusments.  Hopefully, they won't be too dramatic of changes, as Caroline Weir and Linda Caicedo are delivering right when it matters.\n8. VfL Wolfsburg The former two-time champions have quietly built their way back into the quarterfinal round. Veteran Alexandra Popp is still a game changer, with Lineth Beerensteyn and Janina Minge shifting as impact players game to game. The group performance has been fairly mixed, whether that's due to an attack that can sometimes generate, combined with a defence that can also concede. It highlights inconsistency, and that's not who you want to play heading into a quarterfinal against OL Lyonnes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking UWCL quarterfinalists: Barca team to beat; Chelsea outside top five - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/ee6cebff-b415-423d-bcb8-b09dc1d0f90b/thumbnail/1200x675/565f0304ada6df6164acbb7f076a0487/fcbarcelona-1.jpg"
      ],
      "datePublished": "2026-02-19T23:23:40.000Z",
      "dateModified": "2026-02-19T23:23:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLS superlatives: Who is stopping Lionel Messi from winning MVP? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/mls-superlatives-lionel-messi-mvp-mls-cup-inter-miami-timo-werner/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/3df254e0-6d8d-47b8-961e-2c6aa30075d6/thumbnail/1200x675/e3a41556200d1c2e7e9cb090bfb3d2df/inter-miami-1.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:10:54.000Z",
    "description": "\n        Back like it never left, another MLS season is right around the corner after Inter Miami lifted the first MLS Cup in their history in Decembe",
    "body": "\n        Back like it never left, another MLS season is right around the corner after Inter Miami lifted the first MLS Cup in their history in December and will now look to back it up with another one. But with teams around the league improving and a break for the FIFA World Cup in the middle of the season, defending the crown will be no easy task. The addition of Mexican striker German Berterame has improved the squad, but other teams in the Eastern Conference, such as Nashville SC and Orlando City SC, have also made moves to come within striking distance of the Herons.Ahead of the season is always a good time to take a look at who will win the league awards, even if MLS may be one of the most unpredictable leagues in the world, while also taking some fun looks into the crystal ball. So let's get to it:Most Valuable Player - Lionel Messi (Inter Miami CF)Lionel Messi is going for the three-peat as MVP after already becoming the first player in league history to win the award in back-to-back seasons. On one hand, it may feel as if this award has gotten boring since Messi also came close to winning it in only a half-season of play when he first joined the Herons, but no player in the league is coming close to the Argentine's production with Inter Miami. With German Berterame joining from Monterrey, Messi will also have a new partner in attack, and they've shown some chemistry in preseason play. Until proven otherwise, this award is Messi's to lose, and while some like Heung-min Son and Anders Dreyer will do the best they can to take it away from him, if the Messi that has shown up for Miami so far does what's expected in a World Cup year, look out.Seriously, Messi is one of one.\n                                                                    CBS Sports\n                                                            Golden Boot: German Berterame (Inter Miami CF)I don't love taking newcomers for Golden Boot due to needing to fit into a team and learning a new league, but thanks to Concacaf Champions Cup and Leagues Cup, Berterame doesn't have as much of a learning curve as someone coming from abroad due to playing against MLS teams on a regular basis. Scoring 13 goals and assisting three more with Monterrey before departing, Berterame will thrive with the service from Messi, which can make his +2700 odds to win it seem like a bargain. He'll have competition from Messi as well as Sam Surridge and Son in what will be a serious race for the league's top scorer, but the stage is set to succeed.\nMLS Cup champions: Inter Miami CFLike the MVP award, we've got Inter Miami going back-to-back as MLS Cup champions. Sergio Busquets and Jordi Alba may have retired, but in adding Dayne St. Clair from Minnesota United, the defense will improve in the long run. There's also the addition of Sergio Reguillon, which will add dynamism going both ways at left back, and the newness of opening a new stadium, Miami Freedom Park, will only add more energy to help the Herons reach their goal of defending the first MLS Cup title in club history. They'll have opposition, but through Messi, all things are possible.Best signing: Cristian Espinoza (Nashville SC)While a strange set of circumstances led Espinoza to Nashville, his Concacaf Champions Cup debut has already shown a small glimpse of what they'll be getting. Immediately after entering the match, Hany Mukhtar, Surridge, and Espinoza all combined for a quickfire goal for Nashville. We'll be seeing quite a lot of that as Espinoza has been one of the best creators in all of MLS despite playing for a struggling Earthquakes side. B.J. Callaghan has already raised expectations in Nashville, and now having a true third option in attack will help his side reach them as this is an improved side that will make things happen. The days may be behind us of Nashville being a defensive side who are grinding out matches; they're able to take games on their terms.\n                                                                    CBS Sports\n                                                            Worst signing: Timo Werner (San Jose Earthquakes)It may have been a free transfer that brought Timo Werner from RB Leipzig, but when San Jose are replacing Josef Martinez and Cristian Arango with a striker who has scored a total of four goals in the last four seasons is a clear downgrade. The one benefit is that Werner has fresh legs from his lack of playing time over the years, and his speed could give him space when faced against MLS defenses, but it's hard to see this working out. D.C. United get an honorable mention in spending to bring Louis Munteanu from CFR Cluj in Romania, but on potential, he's only 23 and can be molded, while Werner is firmly in his prime age-wise with plenty to prove.\nTeam to watch: Nashville SC After lifting the first trophy in club history by winning the Lamar Hunt U.S. Open Cup in 2025, this season is a time to push for more. Nashville will take part in the Leagues Cup, Concacaf Champions Cup, and MLS play, and with an improved roster, they'll be able to compete on all fronts. In the Eastern Conference, Nashville are the team who have the best chance of knocking out Miami on the way to MLS Cup.MLS Newcomer of the Year: Iago (Orlando City SC CB from Flamengo)One of the most talented young defenders in Brazil, Iago, joining from Flamengo, will be set to anchor Orlando's defense. A member of the Brazil youth national teams, he brings extensive experience to MLS despite only being 20. Oscar Pareja has been one of the best around at improving the performance of young players, and in a quick period, Iago will be able to shine as a defender in MLS. Even if he doesn't net MLS Newcomer of the Year, Iago will be in the running for being the young player of the year, topping the 22 Under 22 list.Supporters' Shield Winners: Orlando City SCTo win the Supporters' Shield, it takes a mix of circumstances, and like the Philadelphia Union last season, Orlando City SC not taking part in the Concacaf Champions Cup will give them more room to rotate and keep their squad fresh for MLS matches. Losing Alex Freeman to Villarreal is quite a loss, but in adding Griffin Dorese, they'll have enough to get by, considering the improvements elsewhere in the roster. There was a serious effort to add from the Brazilian Serie A, with Luis Otavio and Tiago also joining, so Oscar Pareja has a talented roster that can push to win the east.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLS superlatives: Who is stopping Lionel Messi from winning MVP? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/3df254e0-6d8d-47b8-961e-2c6aa30075d6/thumbnail/1200x675/e3a41556200d1c2e7e9cb090bfb3d2df/inter-miami-1.jpg"
      ],
      "datePublished": "2026-02-19T20:10:54.000Z",
      "dateModified": "2026-02-19T20:10:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LaMelo Ball accident: Hornets star not injured in incident, available to play Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/hornets-lamelo-ball-car-accident/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/ce8c94e8-f653-4cbd-8c0d-c82c54270d5a/thumbnail/1200x675/1f6c6a65292d11d23dd40bf78db5b834/lamelo.png",
    "tag": "Sports",
    "date": "2026-02-19T19:19:10.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Charlotte Hornets guard LaMelo Ball is available t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Charlotte Hornets guard LaMelo Ball is available to play in Thursday night's game against the Houston Rockets, one day after wrecking his customized GMC EV Hummer in an accident in Uptown Charlotte. Ball was not injured in the two-car crash, which came at an intersection downtown and totaled his vehicle.Video obtained by WSOC-TV showed Ball's vehicle making contact on the driver's side with a KIA sedan shortly before 5 p.m. Wednesday. The front left tire of Ball's Hummer came off of the vehicle during the accident before the GMC came to a stop near the shoulder.Ball was later spotted at the scene being picked up in a Lamborghini shortly after the accident. Both cars involved in the wreck were reportedly towed from the scene, but an accident report has not been made available.\nThe Hornets have won 10 of their last 11 games with Ball leading the charge. The sixth-year pro and former No. 3 overall pick is averaging 19.3 points per game and 7.4 assists this season.Charlotte (26-29) is currently the No. 9 seed in the Eastern Conference standings, 3.5 games back of Miami. The Hornets' starting lineup of Ball, standout rookie Kon Kneuppel, Brandon Miller, Miles Bridges and Moussa Diabate has the franchise in line to make its first postseason appearance since the 2015-16 season if the hot streak continues.\nEarlier this month against the Rockets, Ball led the Hornets with 20 points during a road victory, which marked Charlotte's eighth straight win -- the first time that's happened since the 1999-00 season.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LaMelo Ball accident: Hornets star not injured in incident, available to play Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/ce8c94e8-f653-4cbd-8c0d-c82c54270d5a/thumbnail/1200x675/1f6c6a65292d11d23dd40bf78db5b834/lamelo.png"
      ],
      "datePublished": "2026-02-19T19:19:10.000Z",
      "dateModified": "2026-02-19T19:19:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-racism-vinicius-jr-investigation-real-madrid-what-to-know-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:00:49.000Z",
    "description": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forwa",
    "body": "\n        Racism continues to overshadow the world of soccer, and the next couple of weeks may be telling as to how things will be handled moving forward. Ahead of Real Madrid and Benfica meeting at the Santiago Bernabeu on Feb. 25 in the UEFA Champions League playoffs second leg, there's a matter that needs to be sorted out due to a current UEFA investigation into an incident between Real Madrid winger Vinicius Junior and Benfica winger Gianluca Prestianni from Tuesday. An alleged racial incident caused the match to be stopped while the referee reviewed what happened, and it has now been moved to an investigation by UEFA to determine the next steps. Both teams are maintaining that their side of the story is the correct one, and here's what to know so far:What happened?After Vinicius Junior scored the winning goal in Real Madrid's 1-0 victory over Benfica in the playoff first leg, the match had to come to a stop due to alleged racial abuse. As he does many times when he scores, Vinicius went to the corner flag to celebrate while dancing, for which he was yellow carded, while objects from the stands also rained down onto the pitch. Benfica weren't happy with this, and Argentine winger Gianluca Prestianni raised his shirt to cover his mouth while speaking to the Brazilian.While it's officially unknown what Prestianni said, he was alleged to have called Vinicius a 'mono' which is the Spanish word for monkey. Vinicius reported the incident to referee Francois Letexier, who paused the match while sorting out the situation as per UEFA's three-step procedure for referees to act against incidents where racism is believed to have taken place.Since it wasn't clear what was said by Prestianni, the referee could only investigate the matter before deciding on a course of appropriate action, which in this case was resuming the match, but the incident is still subject to further investigation once the match is complete.\nUEFA released a statement calling for that investigation, which so far, Real Madrid has complied with:\"A UEFA Ethics and Disciplinary Inspector has been appointed to investigate allegations of discriminatory behaviour during the UEFA Champions League 2025/2026 knock-out play-off match between SL Benfica and Real Madrid CF on 17 February 2026.Further information regarding this matter will be made available in due course,\" the statement read.What's Real Madrid saying?In a statement on Thursday, Real Madrid confirmed that they submitted all the evidence that they have to comply with UEFA's investigation.\n\"Real Madrid C. F. announces that today it has submitted all available evidence to UEFA regarding the incidents that occurred last Tuesday, February 17, during the Champions League match our team played in Lisbon against SL Benfica. Our club has actively collaborated with the investigation opened by UEFA following the unacceptable episodes of racism experienced during that match.Real Madrid appreciates the unanimous support, backing, and affection that our player Vinicius Jr. has received from all areas of the global football community. Real Madrid will continue working, in collaboration with all institutions, to eradicate racism, violence, and hate in sports and society.\"What are Benfica saying?Benfica are supporting Prestianni's statement that what Vinicius said he heard was not what was actually said. There has yet to be an update of their compliance with the investigation, but with the two teams meeting next Wednesday to decide the tie, this is on a compressed timeline.\"The Club reaffirms, clearly and unequivocally, its historical and unwavering commitment to defending the values of equality , respect , and inclusion , which align with the core values of its foundation and which have Eusébio as their greatest symbol.Sport Lisboa e Benfica reiterates that it fully supports and believes in the version presented by the player Gianluca Prestianni , whose conduct while serving the Club has always been guided by respect for opponents, institutions, and the principles that define Benfica's identity. The Club regrets the defamation campaign to which the player has been subjected.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What to know about UEFA investigation over Vini Jr. racial abuse case - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/c9d5ec64-412b-4d56-a1ef-1b1f7527df02/thumbnail/1200x675/3ac30a420776a934da435d9e8fd5ae90/vinijr.jpg"
      ],
      "datePublished": "2026-02-19T20:00:49.000Z",
      "dateModified": "2026-02-19T20:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/alysa-liu-2026-winter-olympics-gold-medal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-19T23:57:04.000Z",
    "description": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland nati",
    "body": "\n        Alysa Liu became the first American woman to win an individual Olympic gold medal in figure skating in 24 years. The 20-year-old Oakland native delivered an electrifying performance during the women's free skate program on Thursday to surge atop the podium.   Liu started the day in third place after posting a 76.59 short program score behind Japan's Ami Nakai and Kaori Sakamoto. As the third-to-last skater of the event, Liu put together a near flawless program while skating to Donna Summer's \"MacArthur Park.\" She received roars from the crowd as she skated with confidence and ease. The positivity exuded off of her with every jump and artistic sequence, culminating with a career-best score of 226.79.\nLiu posted a whopping 150.20 score in the free skate, but had to wait out the programs of Sakamoto and Nakai to learn her fate. However, minor deductions to both Japanese skaters ensured Liu would walk away with gold. Her free skate program was nearly three points higher than the silver medalist, Sakamoto.\"Being able to do it my way on the big stage like this has been my dream,\" Liu said after winning gold, via NBC News. \"I got to do it in my short [program] in the team event and I got to do it tonight in the free skate. I'm just over the moon. I'm the luckiest girl ever, and I'm really grateful.\"   \nLiu finished with a combined score of 226.79, while her American teammates Amber Glenn and Isabeau Levito finished fifth and 12th, respectively. Liu became the first American woman to win an individual gold since Sarah Hughes in 2002 and the eighth American woman overall to accomplish that feat. Earlier in these Games, Liu and Glenn helped the Americans win team gold.NameShort programFree skatingTotal scoreAlysa Liu (USA) 🥇 \t\t\t\t \t\t\t\t \t\t\t\t76.59 \t\t\t\t \t\t\t\t \t\t\t\t150.20 \t\t\t\t \t\t\t\t \t\t\t\t226.79 \t\t\t\t \t\t\t\t \t\t\t\tKaori Sakamoto (JPN) 🥈 \t\t\t\t \t\t\t\t \t\t\t\t77.23 \t\t\t\t \t\t\t\t \t\t\t\t147.67 \t\t\t\t \t\t\t\t \t\t\t\t224.90 \t\t\t\t \t\t\t\t \t\t\t\tAmi Nakai (JPN) 🥉 \t\t\t\t \t\t\t\t \t\t\t\t78.71 \t\t\t\t \t\t\t\t \t\t\t\t140.45 \t\t\t\t \t\t\t\t \t\t\t\t219.16 \t\t\t\t \t\t\t\t \t\t\t\tMone Chiba (JPN) \t\t\t\t \t\t\t\t \t\t\t\t74.00 \t\t\t\t \t\t\t\t \t\t\t\t143.88 \t\t\t\t \t\t\t\t \t\t\t\t217.88 \t\t\t\t \t\t\t\t \t\t\t\tAmber Glenn (USA) \t\t\t\t \t\t\t\t \t\t\t\t67.39 \t\t\t\t \t\t\t\t \t\t\t\t147.52 \t\t\t\t \t\t\t\t \t\t\t\t214.91 \t\t\t\t \t\t\t\t \t\t\t\tAt no point during Liu's performance did she appear to be bothered by the pressure. Even after she received her score, it was all smiles.    No shocked reaction, no tears of joy. Just pure happiness.      A remarkable comeback for Alysa Liu   It's the perfect storybook ending for Liu, who briefly -- and abruptly -- retired from figure skating in 2022 at the age of 16. At the time, as the COVID-19 pandemic forced the cancellation of everything from school classes to entire professional sports seasons, Liu's local rink in the Bay Area closed. That provided her something she hadn't had since she started skating at five years old: a break. That forced break from skating made the idea of leaving the sport forever enticing to Liu, and so she walked away.   This wasn't just any figure skater who decided to call it a career. Liu is a prodigy. She began competing in major competitions at the age of 10. By 13, she became the youngest U.S. women's national champion ever. At 14, Liu became the youngest skater to win two senior national titles. In 2019, she became the first U.S. female figure skater to land a quadruple jump in an international competition.   Liu was at the peak of her powers. But she was satisfied with everything she had accomplished at the time, and decided to move on.   \"It was a crucial time in my life,\" Liu told 60 Minutes in an interview before the Olympics began. \"I was 16 and college was coming up. Like, I wanted to do so much. I went to Nepal and I trekked to Everest Base Camp. Me and my friends would do tons of road trips. I was really just livin' it up. I would say it was my best life.\"   \nBut after two years of quality time with friends and family, and traveling around the world, Liu got the itch to compete again. In 2024 she made her triumphant return, and surprised many in her ability to essentially pick right back up where she left things with no skill loss.   If Liu was to return, though, she wanted to do things differently.   \"I get to pick my own program music,\" Liu said. \"I get to help with the creative process of the program. If I feel like I'm skating too much, I'll back down. If I feel like I'm not skating enough I'll ramp it up. No one's gonna starve me or tell me what I can and can't eat.\"   \n        \n            \n                2026 Winter Olympics: American figure skater Alysa Liu is an unconventional talent on an improbable path\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nHer coach, Phillip DiGuglielmo, said she returned to the sport a better skater.    \"For many years she was dropped off at the rink,\" DiGuglielmo said. \"She was told what to do. Now she comes in, and it is all collaborative.\"   Since returning in 2024, Liu became a world champion in 2025. That made her the first American woman to win a world title since since Kimmie Meissner in 2006. Liu career has reached new heights in ways she never expected -- she's a gold medalist on the biggest stage. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alysa Liu's remarkable comeback from early retirement culminates in Olympic gold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/391ba6c2-00d6-431b-b3e0-0340d4b80ff5/thumbnail/1200x675/c69865a497746c37f8a0f3f1202592a7/getty-liu-2026.jpg"
      ],
      "datePublished": "2026-02-19T23:57:04.000Z",
      "dateModified": "2026-02-19T23:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Rockets-Hornets, Celtics-Warriors, college hoops on Thursday, Feb. 19 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-rockets-vs-hornets-celtics-vs-warriors-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/965cc817-09cd-4f8d-be2e-d20a8fd67ed7/thumbnail/1200x675/ae453794d2f0e16d31ccaae2d845cf21/kon-knueppel-charlotte-hornets-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-19T20:30:43.000Z",
    "description": "\nThe Charlotte Hornets entered the NBA All-Star break as one of the hottest teams in the league. They're hoping to pick up where they left off prior t",
    "body": "\nThe Charlotte Hornets entered the NBA All-Star break as one of the hottest teams in the league. They're hoping to pick up where they left off prior to the week-long hiatus.Charlotte (26-29) seeks its 11th win in 12 contests when it hosts the Houston Rockets (33-20) at the Spectrum Center on Thursday at 7 p.m. ET as the 2025-26 NBA season resumes. The Hornets were 12 games under .500 before beginning a nine-game winning streak on Jan. 22. Their run ended with a 110-104 home loss to the Detroit Pistons, but they edged the Atlanta Hawks 110-107 in their final outing before the break.One of Charlotte's triumphs during its longest winning streak since a nine-gamer in 1998-99 was a 109-99 win at Houston on Feb. 5. Rookie Kon Knueppel led the team in that contest with 24 points and LaMelo Ball added 20 as five members of the Hornets scored in double figures.Nine other games are on Thursday's NBA schedule, including a matchup between the Boston Celtics (35-19) and Golden State Warriors (29-26) at 10 p.m. ET at the Chase Center in San Francisco. The Celtics, who have won six of their last seven contests, and Warriors are squaring off for the first time in 2025-26 after having split their two-game series each of the last four seasons.In another intriguing clash, the Denver Nuggets (35-20) visit the Intuit Dome in Inglewood, Cal. to take on the Los Angeles Clippers (26-28) at 10:30 p.m. ET. The Nuggets won each of the first two meetings between the teams this season and four straight in the all-time series. The college basketball slate is loaded with games, with one being an America East Conference showdown between Vermont (17-10) and UMBC (16-8) at 6 p.m. ET at Chesapeake Employers Insurance Arena in Catonsville, Md. The Retrievers are riding a four-game winning streak, while the Catamounts have won three in a row and are looking to sweep the season series after having posted a 64-55 home victory on Jan. 29.The Rockets are 4.5-point favorites against the Hornets in the latest consensus NBA odds, while the Celtics are 5.5-point favorites over the Warriors. The Nuggets are 4.5-point favorites versus the Clippers and Vermont is a 1.5-point favorite against UMBC.Below is a snapshot of what to watch and bet for Thursday, Feb. 19. All times EasternNBA best bets, where to watchRockets at HornetsTime: 7 p.m. | Location: Charlotte, N.C. | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine pick -- Model: Over 216.5 (-109)Neither team is an offensive juggernaut, as the Hornets are 15th in the NBA in scoring with an average of 115.7 points and the Rockets are tied for 20th at 114.6 per game. When they met in Houston earlier this month, they combined for 208 points. However, the SportsLine Projection Model believes the clubs will be at the top of their game after the lengthy break as the Over hits in more than 64% of its simulations.Celtics at WarriorsTime: 10 p.m. | Location: San Francisco | TV: Prime Video\nSportsLine picks -- Model: Over 211.5 (-110) | Expert: Celtics -5 (-114, Bruce Marshall)The Celtics are averaging 115.3 points this season and recorded 124 against the Chicago Bulls in their final game before the All-Star break after failing to reach triple digits in their previous two contests. The Warriors nearly reached their 115.5-point average in both of their last two outings, scoring 114 in a victory over the Memphis Grizzlies and 113 in a loss to San Antonio. The SportsLine Projection Model sees both teams performing close to their norm as its simulations say the Over hits 68% of the time. SportsLine expert Bruce Marshall (35-22, +1083 on his last 57 NBA against-the-spread picks) likes the Celtics to cover the spread against a Golden State squad that remains without superstar Steph Curry (knee).Nuggets at ClippersTime: 10:30 p.m. | Location: Inglewood, Cal. | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 226.5 (-107) | Expert: Nuggets -3.5 (-112, Jeff Hochman)The Nuggets lead the NBA in scoring with an average of 120.4 points and have eclipsed that total in five of their last seven games. These teams went Over the projected total for Thursday's matchup in each of their first two meetings this season, combining for 246 and 231 points. The SportsLine Projection Model sees no reason for that trend to continue as the Over hits in 68% of its simulations. The Nuggets went 7-3 against the spread in their first game after the All-Star break over the last 10 seasons, and SportsLine expert Jeff Hochman (7-2-1, +580 on his last 10 ATS picks involving Denver) thinks they'll cover again this time around.CBB best bets, where to watchVermont at UMBCTime: 6 p.m. | Location: Catonsville, Md. | TV: ESPN+ | Stream: Fubo (Try for free)\nSportsLine picks -- Model: UMBC +104 | Expert: UMBC +1.5 (-115, Larry Hartstein)UMBC possesses the best home record in the America East Conference at 9-2 and has won five straight contests on its own court. Seven of the Catamounts' 10 losses this season have come away from the Roy L. Patrick Gymnasium in Burlington. The Retrievers have posted victories in 10 of their last 12 outings, and the SportsLine Projection Model thinks they'll keep rolling as its simulations have them defeating Vermont 68% of the time. SportsLine expert Larry Hartstein (17-11-1, +458 on his last 29 college basketball ATS picks) agrees and likes UMBC to cover the spread, which it did in each of its four games since losing at Vermont late last month.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Rockets-Hornets, Celtics-Warriors, college hoops on Thursday, Feb. 19 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/965cc817-09cd-4f8d-be2e-d20a8fd67ed7/thumbnail/1200x675/ae453794d2f0e16d31ccaae2d845cf21/kon-knueppel-charlotte-hornets-imagn-images.jpg"
      ],
      "datePublished": "2026-02-19T20:30:43.000Z",
      "dateModified": "2026-02-19T20:30:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Wagner, a key part of Pittsburgh's famed 'Steel Curtain' defense, dies at 76 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-wagner-pittsburgh-steel-curtain-defense-dies/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/7a63fcea-44a9-411e-92a2-c245f31c8e82/thumbnail/1200x675/950398cbfa2e255eb4c62af71d79dc0e/wagner.jpg",
    "tag": "Sports",
    "date": "2026-02-19T18:42:42.000Z",
    "description": "\nMike Wagner, a former Pro Bowl defensive back and a key member of the Pittsburgh Steelers' famed \"Steel Curtain\" defense, has died at the age of 76 f",
    "body": "\nMike Wagner, a former Pro Bowl defensive back and a key member of the Pittsburgh Steelers' famed \"Steel Curtain\" defense, has died at the age of 76 following a battle with pancreatic cancer.Wagner spent his entire 10-year career with the Steelers. Over that span, he was named to two Pro Bowls and helped Pittsburgh win four Super Bowls over a six-year span. He was inducted into the Steelers Hall of Honor in 2020. \"We are deeply saddened by the passing of Mike Wagner, a tremendous player and an integral part of some of the most successful teams in Pittsburgh Steelers history,\" said team president Art Rooney II. \"As a member of four Super Bowl-winning teams, his toughness and consistency were paramount to our secondary. His contributions on the field were significant, but it was also his steady presence and team-first mentality that truly defined him.\" An 11th round pick in the 1971 NFL Draft, Wagner was part of a notable Pittsburgh draft class that also included future Hall of Fame linebacker Jack Ham and fellow future starters in defensive linemen Ernie Holmes and Dwight White, offensive lineman Gerry Mullins, tight end/offensive lineman Larry Brown and receiver Frank Lewis. Despite his low draft stock, Wagner cracked the Steelers' lineup as a rookie and a year later finished second on the team with six interceptions. A year later, he led the entire NFL with eight interceptions. In 1974, Wagner helped the Steelers win the franchise's first Super Bowl, recording one of Pittsburgh's three interceptions during Pittsburgh's 16-6 win over the Minnesota Vikings. A year later, he was named to his first of two consecutive Pro Bowls while helping Pittsburgh repeat as champions. His fourth quarter interception of Roger Staubach in Super Bowl X set up a field goal and helped the Steelers record a 21-17 win over the Cowboys. Wagner's interception of Staubach was nothing short of brilliant. Prior to the snap, he realized that the Cowboys were about to run their bread and butter play that had resulted in the game's first touchdown. At the snap, Wagner instinctively positioned himself right in front of Staubach's pass intended for Drew Pearson. \n\"Mike was our quarterback in the secondary,\" Hall of Fame cornerback Mel Blount said, via the team's website. \"When you think about all the great players we had on that team who flew under the radar, Mike was one of those guys. I don't know if the fans or the general public really knew what an intricate part of that defense he was. He directed what we were doing back in the secondary, and at the same time made plays himself. He made some big plays for us. He did his job and made sure we were doing ours.\"More importantly with Mike, you're talking about a good human being. He was just a good person.\"In 1976, Wagner was one of a staggering eight Steelers defenders who were selected to the Pro Bowl. That season, Pittsburgh's defense recorded five shoutouts and allowed just 28 points over a nine-game span. Wagner remained a key component of the Steelers' defense when they won two more Super Bowls to close out the decade. In 1978, he filled the stat sheet with two interceptions, three forced fumbles and two sacks as Pittsburgh finished the season by defeating the Cowboys in the Super Bowl for a second time. In 1979, Wagner recorded four interceptions despite only playing in eight regular season games. The Steelers finished that season with a 31-19 win over the Los Angeles Rams in Super Bowl XIV. He retired after the 1980 season with 36 career interceptions, 12 fumble recoveries and five sacks. \"He will always be remembered as a champion,\" Rooney said, \"a great teammate, and a proud member of the Steelers family.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Wagner, a key part of Pittsburgh's famed 'Steel Curtain' defense, dies at 76 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/7a63fcea-44a9-411e-92a2-c245f31c8e82/thumbnail/1200x675/950398cbfa2e255eb4c62af71d79dc0e/wagner.jpg"
      ],
      "datePublished": "2026-02-19T18:42:42.000Z",
      "dateModified": "2026-02-19T18:42:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Teddy Bridgewater bill' moves step closer to law after passage by Florida Senate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/florida-senate-passes-teddy-bridgewater-bill-high-school-coaches/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/b5412b4c-c336-4217-a1ce-a3e895873232/thumbnail/1200x675/b51ec82d955b570cf0257652fc65c0b8/gettyimages-2247377456-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T04:09:24.000Z",
    "description": "\n        Following an incident that led NFL quarterback Teddy Bridgewater to be suspended from his high school coaching duties, the Florida Senate pas",
    "body": "\n        Following an incident that led NFL quarterback Teddy Bridgewater to be suspended from his high school coaching duties, the Florida Senate passed a bill that would make his infraction legal. According to Local 10 News, The \"Teddy Bridgewater bill\" allows high school head coaches to use personal funds to provide financial assistance to their players, so long as they report what they spend.The Florida High School Athletic Association suspended Bridgewater in September for the rest of the 2025-26 school year for providing impermissible benefits to athletes. Bridgewater coached Miami Northwestern High School football in 2024 and was set to lead the team in 2025 before he left the school to sign with the Tampa Bay Buccaneers.Northwestern suspended Bridgewater in July after he revealed in a social media post that he spent $700 a week on Uber rides for his players during the 2024 season. He also acknowledged covering transportation, team-branded clothing, meals and recovery-related expenses at combined costs of about $27,000. Bridgewater in that post asked for donations to the Northwestern football program.If Senate Bill 178 becomes law, coaches in Florida would be permitted to make such personal expenditures. A similar bill is also currently moving through the Florida House.\"I'm protective, and I'm a father first before anything,\" Bridgewater said last season upon signing with the Buccaneers. \"And when I decided to coach, those players became my sons. And I wanted to make sure that I just protected them in the best way that I can. I think that's what came about.\n\"Miami Northwestern's in a tough neighborhood and sometimes things can happen when the kids are walking home and things like that. So I was just trying to protect them and give them a ride home instead of having to take those dangerous walks.\"Bridgewater took the coaching job after announcing his retirement from the NFL in February 2024, and he led Northwestern to a Florida Class 3A state championship in his first and only season at the helm. His team went 12-2 and rolled through the playoffs with relative ease, leading to his selection as the Florida Dairy Farmers Coach of the Year.Bridgewater returned to the NFL after that championship season and signed with the Detroit Lions for the final weeks of the 2024 campaign. He played in a divisional round game in the 2024 playoffs during that brief stint. Bridgewater also logged four games of action in 2025 with the Buccaneers, good for his most since 2022. He attempted just 15 passes in a backup role behind Baker Mayfield.\nWhile his coaching suspension will expire this summer, it is unclear whether Bridgewater intends to return to the sidelines at Northwestern. If he instead spends next season back on another NFL roster, the former first-round pick would embark on Year 13 in the league.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Teddy Bridgewater bill' moves step closer to law after passage by Florida Senate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/b5412b4c-c336-4217-a1ce-a3e895873232/thumbnail/1200x675/b51ec82d955b570cf0257652fc65c0b8/gettyimages-2247377456-1.jpg"
      ],
      "datePublished": "2026-02-20T04:09:24.000Z",
      "dateModified": "2026-02-20T04:09:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-anti-tanking-rule-changes-next-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T00:27:30.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tank",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Discussions across the NBA about the league's tanking issues intensified throughout the All-Star break and will result in tangible changes starting next season. Commissioner Adam Silver informed the NBA's general managers on Thursday that the league plans on making anti-tanking rule adjustments to take effect in the 2026-27 season, according to ESPN.While the league has yet to announce the exact measures it will take to combat tanking, it reportedly discussed over the last month seven potential rule changes. Some of the proposals reflect those suggested by fans in recent weeks as tanking became the NBA's most hot-button topic.The seven potential rule changes are as follows:Allowing protection of first-round draft picks only for selections in the top four or outside the top 14Freezing lottery odds at the trade deadline or laterPreventing teams to pick in the top four in consecutive years and/or after consecutive bottom-three finishesDisallowing teams to pick in the top four the year after reaching the conference finalsAllocating lottery odds based on two-year rolling recordsExtending the lottery to include all play-in teamsFlattening the odds for all lottery teamsAll of the proposals would reduce the incentive to intentionally tumble down the standings. Presently, the lower a team finishes, the higher odds it has in the draft lottery.\nAccording to ESPN, Mike Krzyzewski -- who serves as senior adviser to basketball operations -- was among those at Thursday's meeting with general managers who suggested that the league take steps to curb tanking attempts. Silver himself addressed the issue at his All-Star media availability last weekend and noted an increased prevalence of tanking.Phoenix Suns owner Mat Ishbia also called for \"massive changes\" in a social media post Thursday, calling tanking \"losing behavior.\"The current system is ripe for tanking behavior, and teams are becoming increasingly blatant in their attempts to maximize lottery odds. Last week, the NBA issued a $500,000 fine to the Utah Jazz for conduct detrimental to the league after investigating their lineup management in Feb. 7 and Feb. 9 games against the Orlando Magic and Miami Heat. The Jazz pulled star players Lauri Markkanen and Jaren Jackson Jr. prior to the start of the fourth quarter and did not reinsert them into the games despite holding leads.\nThe NBA also fined the Pacers $100,000 for violating the Player Participation Policy during a Feb. 3 contest against the Jazz after an investigation found that Pascal Siakam and two other starters who sat out could have participated under the league's medical standard.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA to adopt anti-tanking new measures, which will start next season, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/73bc0cc8-b874-4029-b804-037d78f24bfc/thumbnail/1200x675/abbe7d42d4da56b40575019b62f04c4b/gettyimages-2261669864-1.jpg"
      ],
      "datePublished": "2026-02-20T00:27:30.000Z",
      "dateModified": "2026-02-20T00:27:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is NBA tanking good for? Lakers, 76ers among playoff hopefuls with easiest matchups down the stretch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-tanking-lakers-76ers-playoff-hopefuls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/19/4d88efac-6ec8-4df6-92b3-18594f463081/thumbnail/1200x675/50b666f837907fb68bcdc927e6d94395/luka-kings-imagn.png",
    "tag": "Sports",
    "date": "2026-02-19T19:38:56.000Z",
    "description": "\n        With the trade deadline and All-Star break in the rearview mirror and NBA action resuming Thursday night, the stretch run is upon us. Every t",
    "body": "\n        With the trade deadline and All-Star break in the rearview mirror and NBA action resuming Thursday night, the stretch run is upon us. Every team has between 26 and 29 games remaining, and of course, there is a wide disparity in the difficult of those remaining schedules. This will certainly factor, perhaps heavily, into the various postseason races and ultimately the final picture. Just as an example, if the Thunder are going to hold off the charging Spurs for the West's top seed, they'll have to do so while navigating the league's second-toughest remaining slate. The Cavs, meanwhile, are within striking distance of the East's No. 2 seed and have the league's fifth-easiest stretch-run schedule, while Boston, currently two games up on Cleveland, is saddled with the fifth-toughest. A big part of all this is of course the tanking issue that everyone is talking about right now. If you're a team fighting for playoff positioning, the more games you have left against teams actively trying to lose the better. \n\n        \n            \n                Eight best storylines for NBA stretch run: Is Jayson Tatum coming back? Can Spurs jump OKC? MVP up for grabs?\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nSo first, let's identify the teams that are, no matter what method of deception they choose to hopefully avoid punishment, in the unmitigated business of tanking for the best lottery odds possible the rest of the way. Washington WizardsIndiana PacersBrooklyn NetsSacramento KingsUtah JazzDallas MavericksThose six are unquestioned. They have absolutely no incentive to win a single game the rest of the way. Add to that the Grizzlies and Bucks, the latter of whom should be, and probably will be, an increasingly egregious tanker moving forward (their only valuable asset moving forward, either as a building block for a post-Giannis future or as part of a trade package to try to keep Giannis), and take out the Pelicans who don't own their '26 pick, and you have eight tanking teams. So, which contenders/postseason hopefuls have the most remaining games against these teams? Here's a look at the Eastern Conference. \nPLAYOFF HOPEFULS \t\t\t\tTANKING OPPONENTS \t\t\t\t76ers \t\t\t\t9 \t\t\t\tHawks \t\t\t\t9 \t\t\t\tHornets \t\t\t\t9 \t\t\t\tCavaliers \t\t\t\t9 \t\t\t\tKnicks \t\t\t\t8 \t\t\t\tMagic \t\t\t\t8 \t\t\t\tRaptors \t\t\t\t8 \t\t\t\tHeat \t\t\t\t7 \t\t\t\tPistons \t\t\t\t7 \t\t\t\tCeltics \t\t\t\t4 \t\t\t\tYou can see how much this could end up impacting the playoff picture. Take the Celtics, for instance. They enter their final 28 games with a one-game lead over the No. 3 Knicks and a two-game lead over the No. 4 Cavs (in the loss column), but while Boston has just four games left against tanking teams the Knicks have eight and the Cavs have nine.  Now let's look at the West.  PLAYOFF HOPEFULS \t\t\t\tTANKING OPPONENTS \t\t\t\tTrail Blazers \t\t\t\t10 \t\t\t\tWarriors \t\t\t\t9 \t\t\t\tClippers \t\t\t\t8 \t\t\t\tLakers \t\t\t\t8 \t\t\t\tRockets \t\t\t\t7 \t\t\t\tSpurs \t\t\t\t7 \t\t\t\tThunder \t\t\t\t7 \t\t\t\tSuns \t\t\t\t7 \t\t\t\tNuggets \t\t\t\t6 \t\t\t\tTimberwolves \t\t\t\t5 \t\t\t\tAgain, you can see the potential impact here. The Timberwolves are only one game back of the Lakers, but the Lakers have three more tank opponents left than Minnesota. The Suns are only two losses back of the Wolves for the final playoff spot and they have two more tank games left than Minnesota.  In theory, these should be pretty much guaranteed wins and having more of them is a big deal and one of the real downstream effects of nearly a third of the league being incentivized to lose the rest of the way.If Adam Silver wants this to stop, he's going to have to drastically alter the draft system, if not scrap it totally and treat incoming rookies just like every other free agent, though that idea comes with a lot of unintended pitfalls of its own. There's no great answer here, but know this: Until someone figures one out, it is always going to be the smart play for these lower-class teams to drop in the standings and rise in the lottery, and we're going to be seeing a lot of this over these six weeks. Think about it: If you're one of these eight teams with either no shot to even make the play-in or battling for a No. 10 seed, the simple truth of the matter is that every win over these next six weeks is, in fact, a loss. The benefit of possibly landing a superstar rookie who could completely reshape your franchise's trajectory over the next decade plus is just too great in comparison to winning a few more games and possibly making the play-in tournament. Just look at the Mavericks last year. They were one win from making the playoffs. Had they beaten Memphis, they wouldn't have had any lottery balls in the hopper. But they lost that game, giving them a 1.8% chance to land the top overall pick, and I'll be damned if it didn't happen. Now they have Cooper Flagg. The Sixers lost 29 of their final 33 games last year and it yielded them VJ Edgecombe. It's a no-brainer. Lose now to win later. All these teams are going to do it, and it's not just going to effect the ultimate lottery order. It's likely going to impact the playoff picture in a meaningful way. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is NBA tanking good for? Lakers, 76ers among playoff hopefuls with easiest matchups down the stretch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/19/4d88efac-6ec8-4df6-92b3-18594f463081/thumbnail/1200x675/50b666f837907fb68bcdc927e6d94395/luka-kings-imagn.png"
      ],
      "datePublished": "2026-02-19T19:38:56.000Z",
      "dateModified": "2026-02-19T19:38:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]