[
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Knicks-Lakers, Thunder-Nuggets on Sunday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-200-bonus-bets-knicks-lakers-thunder-nuggets-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-02-01T15:31:57.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Sunday's NBA schedul",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Sunday's NBA schedule provides numerous ways to unlock it. The Knicks (-4.5) will host the Lakers at 7 p.m. ET before the Nuggets (+4.5) face the Thunder at 9:30 p.m. ET. SportsLine's proven computer model is backing the favorites to cover in both matchups and is also backing the Over (214.5) in Suns vs. Clippers. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Sunday's top picks, best betsKnicks (-4.5) vs. Lakers (-110)Over 214.5 in Suns vs. Clippers (-110)Thunder (-4.5) vs. Nuggets (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:Knicks (-4.5) vs. Lakers (-110)\nNew York has a chance to match its season-best winning streak with a sixth consecutive win on Sunday night. The Knicks have knocked down 40.3% of their 3-point attempts over their last five games, and they are coming off a 127-97 win over Portland on Friday. Los Angeles is entering the final two games of an eight-game road trip, so this is a scheduling advantage for New York. SportsLine's model has the Knicks covering the spread in 63% of simulations. Back the Knicks at bet365 here:Over 214.5 in Suns vs. Clippers (-110)The Clippers have gone a league-best 16-4 since Dec. 20, while Phoenix has won three straight games, so both teams are playing with momentum entering this matchup. Jalen Green played in just his fifth game of the season for the Suns on Friday, scoring 11 points in 16 minutes to provide some scoring depth. Clippers star Kawhi Leonard has scored at least 20 points in 26 straight games, and the model has these teams combining for 225 points to help the Over cash 68% of the time. Back the Over at bet365 here:Thunder (-4.5) vs. Nuggets (-110)This is a clear buy-low spot on the defending NBA champions, as the Thunder have lost three of their last four games, and the Nuggets have star Nikola Jokic back from a knee injury. This is about as low of a spread as bettors will see for Oklahoma City, which still has the best record in the NBA. The Thunder have won four of the last six meetings between these teams, while the Nuggets have only covered the spread twice in their last six home games. The model has Oklahoma City covering in 59% of simulations on Sunday night. Back the Thunder at bet365 here:\nLooking for more NBA picks?You've seen the model's best bets for Sunday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Knicks-Lakers, Thunder-Nuggets on Sunday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-02-01T15:31:57.000Z",
      "dateModified": "2026-02-01T15:31:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bruins vs. Lightning prediction, odds, time: 2026 NHL Stadium Series picks for Sunday, Feb. 1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/bruins-lightning-odds-prediction-spread-time-2026-nhl-stadium-series-picks-february-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/8f5de964-d737-4f9b-9407-3c1cbac38249/thumbnail/1200x675/8a8a30a199f617ea675b2affafcef00a/lightning.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:00:59.000Z",
    "description": "\n        Two of the top teams in the Eastern Conference clash when the Boston Bruins battle the Tampa Bay Lightning on Sunday night in the NHL Stadium",
    "body": "\n        Two of the top teams in the Eastern Conference clash when the Boston Bruins battle the Tampa Bay Lightning on Sunday night in the NHL Stadium Series 2026. Boston is coming off a 6-3 win over the Philadelphia Flyers on Thursday, while Tampa Bay defeated Winnipeg 4-1 that same night. The Bruins (32-20-3), who are 8-1-1 in their last 10 games, are 11-12-2 on the road this season. The Lightning (34-14-4), who are also 8-1-1 over the last 10, lead the Atlantic Division with 72 points. Opening faceoff is set for 6:30 p.m. ET from Raymond James Stadium in Tampa, Fla. The Lightning are the -223 favorites (risk $223 to win $100) in the latest Lightning vs. Bruins odds from SportsLine consensus, while the over/under for total goals scored is 5.5. Before making any Bruins vs. Lightning picks, check out the NHL predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every NHL game 10,000 times and it entered Week 17 of the 2026-26 NHL schedule 51-47 on top-rated NHL betting picks this season, returning +359 in profit. Anyone following its picks at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Bruins vs. Lightning 10,000 times and just revealed its coveted NHL picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NHL odds and trends for Lightning vs. Bruins:Bruins vs. Lightning                                                                                                                             money line:    Boston +183, Tampa Bay -223        Bruins vs. Lightning                                                                                                                                             over/under:    5.5 goalsBruins vs. Lightning                                                                                                                                             puck line:    Tampa Bay -1.5 (+113)    Bruins vs. Lightning                                                                                                                                             picks:    See picks at SportsLineBruins vs. Lightning             streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Lightning vs. Bruins picksAfter 10,000 simulations of Bruins vs. Lightning, SportsLine's model is going Over on the total (5.5). The Over has hit in three of the last four head-to-head meetings between the teams. The Over has hit in six of the last seven Boston games, and once in the past three Tampa  Bay games.The SportsLine model is projecting Boston's David Pastrnak to score .50 goals and .81 assists, while goaltender Jeremy Swayman will make 23.7 saves and allow just 3.33 goals. Tampa Bay's Nikita Kucherov and Jake Guentzel both are projected 0.53 or more goals, while Kucherov is projected to add 1.14 assists. Goalie Andrei Vasilevskiy will make 22 saves and allow 2.75 goals as the model projects 6.4 combined goals. The model also says one side of the puck line hits well over 60% of the time. You can head to SportsLine to see the model's NHL picks. So who wins Lightning vs. Bruins, and which side of the puck line hits in well over 60% of simulations? Visit SportsLine now to see which side of the Bruins vs. Lightning spread to back, all from the model that has returned over $350 on top-rated NHL picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bruins vs. Lightning prediction, odds, time: 2026 NHL Stadium Series picks for Sunday, Feb. 1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/8f5de964-d737-4f9b-9407-3c1cbac38249/thumbnail/1200x675/8a8a30a199f617ea675b2affafcef00a/lightning.jpg"
      ],
      "datePublished": "2026-02-01T14:00:59.000Z",
      "dateModified": "2026-02-01T14:00:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. Bucks prediction, odds, line, time: 2026 NBA picks for Sunday, Feb. 1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-bucks-odds-prediction-time-2026-nba-picks-february-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/30/ea7fad1d-414d-4fa5-843c-4b8bc54f59f0/thumbnail/1200x675/3c949653999be98fcb9eec0e655827c1/jaylen-brown-boston-celtics-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:45:27.000Z",
    "description": "\n        The Boston Celtics and Milwaukee Bucks tip off a 10-game slate on Sunday's NBA schedule in the inaugural NBA Pioneers Classic. Boston (30-18)",
    "body": "\n        The Boston Celtics and Milwaukee Bucks tip off a 10-game slate on Sunday's NBA schedule in the inaugural NBA Pioneers Classic. Boston (30-18) has alternated wins and losses over its last five, most recently defeating Sacramento, 112-93, on Friday. Milwaukee (18-28) has lost four in a row, including a 109-99 defeat to Washington on Thursday. Giannis Antetokounmpo (calf) and Kevin Porter Jr. (oblique) are out for Milwaukee, while Jaylen Brown isn't listed on Boston's injury report after missing Friday's contest.Tipoff is set for 3:30 p.m. ET from TD Garden in Boston. The Bucks won the lone matchup earlier this season. Boston is a 13.5-point favorite in the Bucks vs. Celtics odds, while the over/under is 217.5. Before making any Celtics vs. Bucks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Bucks vs. Celtics 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. Bucks: Bucks vs. Celtics spread                                                                     Celtics -13.5 at DraftKings SportsbookBucks vs. Celtics over/under:    217.5 pointsBucks vs. Celtics money line:    Celtics -685, Bucks +489Bucks vs. Celtics picks: See picks at SportsLineBucks vs. Celtics streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Celtics vs. Bucks picksSportsLine's model has simulated Bucks vs. Celtics 10,000 times and is going Over on the total (217.5 points). These two playing in Boston seems to elicit high-scoring affairs as seven of their last eight regular season meetings in Boston have gone over 217.5 combined points. Those eight matchups have averaged 234.3 points.These are also two prolific offenses from beyond the arc, with Boston averaging the second-most made three-pointers per game, while Milwaukee has the league's second-best three-point percentage. However, on the other end, both squads rank in the bottom 10 in terms of made three-pointers allowed per game. With both squads projected to make over 16 three-point attempts, the Over hits with plenty of points to spare. The model is projecting 226 combined points as the Over hits 62.1% of the time. It also says one side of the spread hits almost 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. Bucks, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Bucks vs. Celtics spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. Bucks prediction, odds, line, time: 2026 NBA picks for Sunday, Feb. 1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/30/ea7fad1d-414d-4fa5-843c-4b8bc54f59f0/thumbnail/1200x675/3c949653999be98fcb9eec0e655827c1/jaylen-brown-boston-celtics-imagn-images.jpg"
      ],
      "datePublished": "2026-02-01T14:45:27.000Z",
      "dateModified": "2026-02-01T14:45:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Seahawks score prediction: Model projects exact score for Big Game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-patriots-score-prediction-picks-exact-score-big-game-best-nfl-betting-apps/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/bdb95250-24aa-4dff-afd8-dc5701d263f4/thumbnail/1200x675/205475c5dffd7f680a0ecf77e91fa9a1/drake-maye-patriots.jpg",
    "tag": "Sports",
    "date": "2026-02-01T15:51:38.000Z",
    "description": "\n        The Seattle Seahawks will take on the New England Patriots in the 2026 Big Game at Levi's Stadium on Sunday, February 8. One option for a pot",
    "body": "\n        The Seattle Seahawks will take on the New England Patriots in the 2026 Big Game at Levi's Stadium on Sunday, February 8. One option for a potentially massive payout is a Seahawks vs. Patriots score prediction. Both teams went 14-3, won their divisions, and then had to survive hard-fought conference championship games. The Seahawks beat the Rams, 31-27, to win the NFC Championship Game, while the Patriots earned a 10-7 win over the Broncos on the road in a defensive struggle that ended with a surprise blizzard.The latest Patriots vs. Seahawks odds list Seattle as a 4.5-point favorite, while the over/under is 45.5, both unchanged from the opening line. Seattle's over/under for total team points is 25.5, while New England's is 19.5. You can use these sportsbook promos to bet those lines or any of the numerous NFL props available. The SportsLine Projection Model is predicting that the Seahawks come away with a 24-20 win, an exact score prediction that pays as high as +15000 on some of the best sports betting apps. You can also boost your bankroll for the Big Game even further by capitalizing on some of the best Big Game promo codes.SportsLine's model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting apps could have seen strong returns.  Best Big Game Sportsbook offersBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets instantlyCBSBET365CaesarsFirst bet matched up to $250 as bonus bets, win or loseCBSSPORTS250BMFanDuelBet $5, get $200 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash CBSFANThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users $200 in bonus bets with the placement of a $5+ bet, whether the bet wins or loses. At DraftKings and FanDuel, you need to win your first bet to receive the bonus. DraftKings offers new users $300 in bonus bets if their first bet of at least $5 wins while FanDuel is offering $200 if the first $5 wager cashes.The latest Fanatics Sportsbook promo code CBSFAN provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code CBSSPORTS250BM matches your first bet up to $250 in bonus bets, whether it wins or loses. So, although you have to risk more to get a larger portion of the reward, you have the chance to essentially double your first bet's winnings if you win, plus have the safety net of bonus bets whether it wins or loses.Seahawks vs. Patriots odds, betting lines\nSeahawks vs. Patriots spreadSeattle -4.5 at DraftKings SportsbookSeahawks vs. Patriots over/under45.5 pointsSeahawks vs. Patriots money line Seahawks -233, Patriots +192Seahawks vs. Patriots picksSee picks at SportsLineSeahawks vs. Patriots streaming Fubo (try for free)Patriots vs. Seahawks exact score prediction, betting previewIn a season where the playoff picture was crowded from start to finish, both the Seahawks and Patriots established themselves as upper echelon by the midway point of the season. Seattle loss its opener to San Francisco and fell to 3-2 after a Week 5 loss to Tampa Bay, but ripped off wins in 13 of the next 14 wins to earn its way into the Big Game. Meanwhile, New England lost two of its first three but has won 16 of its last 17.Sam Darnold and Drake Maye both looked like NFL MVP candidates at points throughout the season, though they'll likely fall short to Rams quarterback Matthew Stafford. Darnold has rejuvenated his career by throwing 60 touchdown passes in the last two seasons and Maye became the youngest player in NFL history to lead the league in completion percentage (72.0%).Both teams were top five in the NFL in scoring offense and scoring defense and the SportsLine Projection Model is predicting thin margins against the spread and with the over/under. It's slightly leaning towards Seattle to cover against the spread based on the percentages and also projects that the Under hits in 59% of its 10,000 simulations of the Big Game, higher than the implied odds of 52.2%.Exact score prediction: Seattle Seahawks 24, New England Patriots 20 (best odds +15000 at BetMGM):Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks score prediction: Model projects exact score for Big Game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/bdb95250-24aa-4dff-afd8-dc5701d263f4/thumbnail/1200x675/205475c5dffd7f680a0ecf77e91fa9a1/drake-maye-patriots.jpg"
      ],
      "datePublished": "2026-02-01T15:51:38.000Z",
      "dateModified": "2026-02-01T15:51:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1: Texas A&M at top of SEC, joins updated rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-top-25-and-1-texas-a-m/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/15ba7815-3140-4478-b2ef-2690126ef8ee/thumbnail/1200x675/8f0dcdf3be9db3d66f24ced8a695f23c/texasa-m-top-25.jpg",
    "tag": "Sports",
    "date": "2026-02-01T16:03:41.000Z",
    "description": "\n\n\n    \n                                    The Aggies have won four straight and join the Top 25 And 1 rankings\n        \n                            ",
    "body": "\n\n\n    \n                                    The Aggies have won four straight and join the Top 25 And 1 rankings\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 1, 2026\n                            \n                    at\n    11:01 am ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        I realize watching a man who voluntarily left college basketball and played professionally return to college basketball and play in the SEC again -- and all of the other nonsense connected to the NCAA these days, including another player now actively trying to do more or less the same thing -- has damaged the sport in some folks' eyes.I get it.But if you can get past that stuff and just focus on the actual games, college basketball really is a terrific product filled with awesome stories -- and it's overdue for Texas A&M to be added to the list of coolest things. Arizona is undefeated and awesome. You know that. Miami (Ohio) is 22-0 and proof that success at the mid-major level remains difficult but attainable. We've been over that. Nebraska hasn't won a regular-season conference championship since 1950 but could change that this season. You're probably aware of that given that the Cornhuskers are 20-1 and didn't take their first loss until last week.Great stories, all of them.So is Texas A&M.Matt Norlander and I actually opened Friday's episode of the Eye On College Basketball Podcast -- after we discussed my snow/ice issues -- on the Aggies. Texas A&M, under first-year coach Bucky McMillan, a 42 year old who was coaching high school basketball just six years ago, is now 17-4 overall, 7-1 in the SEC and on a four-game winning streak featuring two Quadrant 1 victories after Saturday's 92-77 win at Georgia. Are the Aggies the best team in the SEC? That's debatable. But they are alone atop the SEC standings. That's a fact. And the SEC is the highest-rated conference in the country, according to the NET. That's also a fact. Which means McMillan, again, a 42 year old who was working at a high school six years ago, is now guiding the team that's alone in first in the standings of a conference that put a record 14 schools in last season's NCAA Tournament.What. A. Story.\nTexas A&M is No. 24 in Sunday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings, where Arizona remains No. 1 for the 22nd consecutive day. The Aggies have six double-digit scorers on their roster all of whom, just like their coach, are in their first year in the program. Again, what a story.\n        \n            \n                Kansas looks incredible with Darryn Peterson unleashed. Now his health stands in the way.\n                \n                    Eric Bossi                \n            \n                            \n    \n                \n                    \n    \n Top 25 And 1 rankings \n        Biggest Movers\n    \n                3\n            \n                Florida\n            \n                5\n            \n                Texas Tech\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Arizona\n                                \n                            Brayden Burries finished with 17 points and seven rebounds in Saturday's 87-74 win at Arizona State. The Wildcats' next game is Saturday against Oklahoma State.\n                        \n                            --\n                        \n                            22-0\n                        \n                                2\n                            \n                                    UConn\n                                \n                            Braylon Mullins finished with 16 points and three rebounds in Saturday's 85-58 win at Creighton. The Huskies' next game is Tuesday against Xavier.\n                        \n                            --\n                        \n                            21-1\n                        \n                                3\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 24 points and eight rebounds in Saturday's 72-59 win at Virginia Tech. The Blue Devils; next game is Tuesday against Boston College.\n                        \n                            --\n                        \n                            20-1\n                        \n                                4\n                            \n                                    Michigan\n                                \n                            Yaxel Lendeborg finished 26 points and 12 rebounds in Friday's 83-71 win at Michigan State. The Wolverines' next game is Thursday against Penn State.\n                        \n                            --\n                        \n                            20-1\n                        \n                                5\n                            \n                                    Nebraska\n                                \n                            Pryce Sandfort missed 12 of the 18 shots he attempted in Tuesday's 75-72 loss at Michigan. The Cornhuskers' next game is Sunday against Illinois.\n                        \n                            --\n                        \n                            20-1\n                        \n                                6\n                            \n                                    Gonzaga\n                                \n                            Graham Ike finished with 30 points and four rebounds in Saturday's 73-65 win over Gonzaga. The Zags' next game is Wednesday at Portland.\n                        \n                            --\n                        \n                            22-1\n                        \n                                7\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic finished with 16 points and one assist in Thursday's 97-67 win over Colorado. The Cyclones' next game is Sunday at Kansas State.\n                        \n                            --\n                        \n                            19-2\n                        \n                                8\n                            \n                                    Illinois\n                                \n                            Keaton Wagler finished with 22 points and eight assists in Thursday's 75-66 win over Washington. The Illini's next game is Sunday at Nebraska.\n                        \n                            --\n                        \n                            18-3\n                        \n                                9\n                            \n                                    Houston\n                                \n                            Milos Uzan finished with 16 points and five assists in Saturday's 76-54 win over Cincinnati. The Cougars' next game is Wednesday against UCF.\nKingston Flemings finished with 27 points and five assists in Wednesday's 79-70 win at TCU. The Cougars' next game is Saturday against Cincinnati.\n                        \n                            --\n                        \n                            19-2\n                        \n                                10\n                            \n                                    Michigan St.\n                                \n                            Jaxon Kohler missed nine of the 13 shots he attempted in Friday's 83-71 loss to Michigan. The Spartans' next game is Wednesday at Minnesota.\n                        \n                            --\n                        \n                            19-3\n                        \n                                11\n                            \n                                    Vanderbilt\n                                \n                            Tyler Tanner finished with 24 points and three assists in Saturday's 71-68 win over Ole Miss. The Commodores' next game is Saturday against Oklahoma.\n                        \n                            2\n                        \n                            19-3\n                        \n                                12\n                            \n                                    Kansas\n                                \n                            Bryson Tiller finished with 21 points and seven rebounds in Saturday's 90-82 win over BYU. The Jayhawks' next game is Monday at Texas Tech.\nFlory Bidunga finished with 21 points and 10 rebounds in Saturday's 86-62 win at Kansas State. The Jayhawks' next game is Saturday against BYU.\n                        \n                            2\n                        \n                            16-5\n                        \n                                13\n                            \n                                    Purdue\n                                \n                            Fletcher Loyer missed seven of the 10 shots he attempted in Tuesday's 72-67 loss at Indiana. The Boilermakers' next game is Sunday at Maryland.\n                        \n                            2\n                        \n                            17-4\n                        \n                                14\n                            \n                                    Florida\n                                \n                            Boogie Fland missed eight of the 12 shots he attempted in Saturday's 76-67 loss to Florida. The Gators' next game is Wednesday at South Carolina.\n                        \n                            3\n                        \n                            15-6\n                        \n                                15\n                            \n                                    Virginia\n                                \n                            Thijs De Ridder finished with 32 points and eight rebounds in Tuesday's 100-97 double-overtime win at Notre Dame. The Cavaliers' next game is Saturday at Boston College.\n                        \n                            3\n                        \n                            18-3\n                        \n                                16\n                            \n                                    Texas Tech\n                                \n                            LeJuan Watts missed six of the nine shots he attempted in Saturday's 88-80 loss at UCF. The Red Raiders' next game is Monday against Kansas.\nJT Toppin finished with 31 points and 12 rebounds in Saturday's 90-86 win over Houston. The Red Raiders' next game is Saturday at UCF.\n                        \n                            5\n                        \n                            16-5\n                        \n                                17\n                            \n                                    BYU\n                                \n                            Kennard Davis missed five of the six shots he attempted in Saturday's 90-82 loss at Kansas. The Cougars' next game is Wednesday at Oklahoma State.\n                        \n                            5\n                        \n                            17-4\n                        \n                                18\n                            \n                                    Arkansas\n                                \n                            Darius Acuff Jr. missed 12 of the 20 shots he attempted in Saturday's 85-77 loss to Kentucky. The Razorbacks' next game is Saturday at Mississippi State.\n                        \n                            2\n                        \n                            16-6\n                        \n                                19\n                            \n                                    Clemson\n                                \n                            Nick Davidson finished with 12 points and two rebounds in Saturday's 63-52 win over Pitt. The Tigers' next game is Wednesday at Stanford.\nNick Davidson finished with 13 points and six rebounds in Saturday's 77-63 win at Georgia Tech. The Tigers' next game is Saturday against Pitt.\n                        \n                            --\n                        \n                            18-4\n                        \n                                20\n                            \n                                    Saint Louis\n                                \n                            Trey Green finished with 23 points and five rebounds in Friday's 102-71 win over Dayton. The Billikens' next game is Tuesday at Davidson.\n                        \n                            --\n                        \n                            21-1\n                        \n                                21\n                            \n                                    Louisville\n                                \n                            Khani Rooths finished with 12 points and 10 rebounds in Saturday's 88-74 win over SMU. The Cardinals' next game is Wednesday against Notre Dame.\n                        \n                            --\n                        \n                            15-6\n                        \n                                22\n                            \n                                    Alabama\n                                \n                            Latrell Wrightsell finished with 21 points and two assists in Tuesday's 90-64 win over Missouri. The Crimson Tide's next game is Sunday at Florida.\n                        \n                            --\n                        \n                            14-6\n                        \n                                23\n                            \n                                    St. John's\n                                \n                            Ian Jackson finished with 18 points and five rebounds in Wednesday's 92-70 win over Butler. The Red Storm's next game is Tuesday at DePaul.\nIan Jackson finished with 18 points and five rebounds in Wednesday's 92-70 win over Butler. The Red Storm's next game is Tuesday at DePaul.\n                        \n                            --\n                        \n                            16-5\n                        \n                                24\n                            \n                                    Miami (Ohio)\n                                \n                            Brant Byers finished with 21 points and two blocks in Saturday's 85-61 win over Northern Illinois. The RedHawks' next game is Tuesday at Buffalo.\n                        \n                            1\n                        \n                            22-0\n                        \n                                25\n                            \n                                    Texas A&M\n                                \n                            Rashaun Agee finished with 18 points and 15 rebounds in Saturday's 92-77 win at Georgia. The Aggies' next game is Wednesday at Alabama.\n                        \n                            NR\n                        \n                            17-4\n                        \n                                26\n                            \n                                    N. Carolina\n                                \n                            Caleb Wilson finished with 22 points and six rebounds in Saturday's 91-75 win at Georgia Tech. The Tar Heels' next game is Monday against Syracuse.\n                        \n                            --\n                        \n                            17-4\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1: Texas A&M at top of SEC, joins updated rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/15ba7815-3140-4478-b2ef-2690126ef8ee/thumbnail/1200x675/8f0dcdf3be9db3d66f24ced8a695f23c/texasa-m-top-25.jpg"
      ],
      "datePublished": "2026-02-01T16:03:41.000Z",
      "dateModified": "2026-02-01T16:03:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 fight fallout: Next options for Alexander Volkanovski, Benoit Saint Denis and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-fight-fights-to-make-alexander-volkanovski-benoit-saint-denis-mauricio-ruffy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/7719aa19-2dd6-4ee7-8ec8-b06de387a735/thumbnail/1200x675/0e961ef10d470f897ca866e957d2d883/alexander-volkanovski-325-belt-walk.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:30:37.000Z",
    "description": "\n        UFC 325 has come and gone. With it, new opportunities have arrived for its winners and losers. UFC featherweight champion Alexander Volkanovs",
    "body": "\n        UFC 325 has come and gone. With it, new opportunities have arrived for its winners and losers. UFC featherweight champion Alexander Volkanovski built his case as the all-time best featherweight. Beating Lopes consecutively wouldn't do much on its own, but the fact that he won by a bigger margin the second time helps. To grow that legend further, it's time to fight top featherweight contenders champing at the bit.Saturday's event also injected more life into a stacked, action-packed lightweight division. Benoit Saint Denis and Mauricio Ruffy scored major finishes as they start prowling towards the very best.In the aftermath of UFC 325, take a look at the best fights to make across the featherweight and lightweight divisions.\nFeatherweightAlexander Volkanovski vs. Movsar Evloev: Volkanovski floated the rumor of an impending title eliminator between Evloev and Murphy. Doing that leaves Volkanovski with no credible contender until the end of the year. Both men deserve a title shot, but Evloev moreso. Unfortunately, Evloev and Murphy aren't colorful characters, but meritocracy should still matter. UFC should book Volkanovski vs. Evloev next. In the meantime, Murphy can face Jean Silva in a title eliminator. It's a fight with high knockout potential that provides visibility and prestige to the winner.Diego Lopes vs. Steve Garcia: Lopes shouldn't have fought Volkanovski twice in 10 months, but he's becoming a better fighter for it. He's gone 50 minutes with arguably the best featherweight ever without taking significant damage. That will serve him. While Volkanovski is champion, Lopes shouldn't get tangled up with top featherweights. He'd only risk log-jamming the division by beating guys who could progress towards the title. Garcia (No. 9) is due for a big fight. The rising contender has finished 15 opponents, including six of his last seven in the UFC. Garcia doesn't have that standout win on his resume, something Lopes provides and opportunity for.LightweightBenoit Saint Denis vs. Max Holloway or Charles Oliveira: To effectively matchmake the lightweight elite, two questions must be answered. First, when will lightweight champion Ilia Topuria return? Second, how much more will the UFC brass punish Arman Tsarukyan? Saint Denis called out five fighters on Saturday: the two aforementioned, Max Holloway, Charles Oliveira and Justin Gaethje. Saint Denis and Tsarukyan shouldn't fight anytime soon. It will set back a rising contender in a division that's on the precipice of a generational turnover. A win over Hooker doesn't equate to an undisputed or interim title shot either. That leaves the winner of the BMF title fight between Holloway and Oliveira, which headlines UFC 326. Saint Denis is obviously cut from that BMF cloth. Having him face the winner makes sense. It's Topuria's absence that gives me pause. I wonder if there's a world where the BMF winner gets booked against interim champion Justin Gaethje. If that happens, Saint Denis must settle for the loser of the BMF title fight instead.\nDan Hooker vs. Paddy Pimblett: Hooker and Pimblett exchanged nasty barbs over social media and in separate interviews. We won't rehash the subject matter; it's in poor taste. But the energy between them is something you can bottle into a thrilling fight. The media cycle and the fight have explosive potential. It's also an important crossroads fight for them. Pimblett must prove he can make the adjustments demanded of an elite lightweight. Hooker can show that there's life for him as a top fighter.Mauricio Ruffy vs. Mateusz Gamrot: Ruffy will find himself in the lightweight top 10 after a beautiful second-round KO against Fiziev. The composure he showed after training with featherweight champion Volkanovski will do wonders for his highlight reel finishing ability. The top of the division is quite crowded, and I wouldn't want to see his potential stifled by someone like Tsarukyan. Gamrot is a credible lightweight who's a half-step behind the very best. It risks seeing Ruffy get smothered by a superior grappler, but it's the kind of test Ruffy must pass to make a real run at the title.Rafael Fiziev vs. Manuel Torres: What's not to love about this fight? Both men are terrific finishers. For Fiziev, it's similar to his fight with Igancio Bahamondes. It's a chance to revitalize himself against a surging contender. For Torres, who has consecutive TKO wins, it's the right test at the right time. He fell short to Bahamondes in 2024, so beating Fiziev puts him on the right track in a deep division. \nQuillan Salkilld vs. Jalin Turner: Salkilld looked phenomenal, tearing through short-notice replacement Jamie Mullarkey. The rising prospect is at a crucial crossroads. Salkilld, 26, has his best years ahead of him. Giving him time to mature is in his best interest. However, a growing profile and ambition will likely expedite the process. Salkilld called for a top 15 lightweight. That's ambitious after beating an inconsistent veteran on short notice, but we can meet him halfway. Former ranked lightweight Turner is coming off a first-round knockout against Edson Barboza. It was a reformation for Turner, who briefly retired after a 1-4 skid. It's a solid fight between comparable names who are on the right track to a ranking.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 fight fallout: Next options for Alexander Volkanovski, Benoit Saint Denis and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/7719aa19-2dd6-4ee7-8ec8-b06de387a735/thumbnail/1200x675/0e961ef10d470f897ca866e957d2d883/alexander-volkanovski-325-belt-walk.jpg"
      ],
      "datePublished": "2026-02-01T14:30:37.000Z",
      "dateModified": "2026-02-01T14:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas City hires former Maryland, Texas A&M coach Mark Turgeon - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/mark-turgeon-kansas-city-coach-maryland-texas-a-m/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/c05599df-3afd-40ae-be83-219dacd7f0a0/thumbnail/1200x675/2133c75898f83110a85706c7b55a9b24/usatsi-17184049-1.jpg",
    "tag": "Sports",
    "date": "2026-02-01T15:43:04.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first vacancy of the 2026 coaching carousel ha",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first vacancy of the 2026 coaching carousel has filled, and it's a big get for a small school: Former Maryland coach Mark Turgeon has agreed to a five-year contract be the next man in charge at Kansas City, sources told CBS Sports. The Roos are playing out the string this season under departing coach Marvin Menzies; the school announced in January that it was moving on from Menzies' four-year run at season's end. Kansas City (formerly UMKC) is 4-18 and ranks near the bottom of Division I this season.Turgeon, who turns 61 on Feb. 5, has a 479-275 record across 23 and a half seasons. He began his career at Jacksonville State, then Turgeon upped his profile in a seven-year stint at Wichita State, including a 2006 Sweet 16 appearance. From 2007-11, Turgeon ran Texas A&M's program and took the Aggies to four straight NCAA Tournaments. That landed him his biggest job: Maryland. Turgeon had an NCAA Tournament-level team in six of his nine full seasons in College Park, though he only took the Terrapins to the Big Dance five times due to his 24-7 team not getting a chance to play in the canceled 2020 NCAA Tournament. He took over the Terps in 2011, lasting a little more than a decade. Turgeon resigned from his post at Maryland on Dec. 3, 2021, amid a rocky start and toxic situation with the fan base.\nA little more than four years removed from roaming the sidelines, Turgeon is hopping back into profession. He does so in surprising fashion by heading to the Summit League level; it's conceivable Turgeon could have landed a bigger job in March, when dozens more will inevitably come available. Turgeon has ties to the area: He played at Kansas in the 1980s and grew up in Topeka, Kansas. A source said that Turgeon will bring his son, Will, on staff as well.Kansas City AD Brandon Martin made a significant push on Turgeon in the past two weeks (and a source said it's not the first time he tried to court a former power-conference coach). Martin ultimately swayed Turgeon, and in doing so, the Roos will boast one of the most accomplished coaches at the mid-major level.\nKansas City been in Division I since the late 1980s but never made the NCAA Tournament. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas City hires former Maryland, Texas A&M coach Mark Turgeon - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/c05599df-3afd-40ae-be83-219dacd7f0a0/thumbnail/1200x675/2133c75898f83110a85706c7b55a9b24/usatsi-17184049-1.jpg"
      ],
      "datePublished": "2026-02-01T15:43:04.000Z",
      "dateModified": "2026-02-01T15:43:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Super Sunday' in women's college basketball: Can Tennessee upend UConn's perfect season? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/womens-college-hoops-tennessee-uconn-perfect-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/4bdeb137-37fd-495e-b96f-a55fe43f47e4/thumbnail/1200x675/6a5246243debf881b15e2310df1ba77b/talaysia-cooper-ashlynn-shade-tennessee-uconn.png",
    "tag": "Sports",
    "date": "2026-02-01T15:55:32.000Z",
    "description": "\n        This is a tough weekend for many sports fans, as it is the first weekend without pro or college football since last summer. And while there i",
    "body": "\n        This is a tough weekend for many sports fans, as it is the first weekend without pro or college football since last summer. And while there is still one football game left next Sunday -- just a small little one, you probably haven't heard of -- this Sunday's schedule might look a little bit empty. But don't fear, there is no need to go outside or spend quality time with friends and family, because there's enough phenomenal women's college basketball on tap to keep you firmly planted on the couch. In fact, it is such a phenomenal lineup I'm dubbing it \"Super Sunday.\"We've got three historic rivalry games on tap, including the legendary UConn vs. Tennessee game and two regional showdowns between Michigan and Michigan State and Oklahoma and Texas. We've also got battles for supremacy in the Big Ten and Big 12. \n        \n            \n                Takeaways: After USC loss, Iowa looks to Hannah Stuelke as its X factor heading into Big Ten showdown vs. UCLA\n                \n                    Isabel Gonzalez                \n            \n                            \n    \n                \n                    \n    \nIt might not be March yet, but Sunday is the first day of February, and it looks like the madness is ready to begin a month early. Keep reading for the must-watch games and most pressing questions heading into these marquee matchups. The must-watch gamesTwenty of the top 25 teams are playing on Sunday and there are a staggering seven games between ranked teams. While you can check out the full women's college hoops schedule on Sunday here, and there are plenty of great match-ups involving teams outside the top 25, these seven are must-watch games, so get multiple screens ready.\nNo. 1 UConn vs. No. 15 Tennessee; 12 pm ET; Fox/fuboNo. 24 Alabama vs. No 6 LSU; 12 pm; SEC Network/fuboNo. 9 Michigan vs. No. 13 Michigan State; 12 pm; FS1/fuboNo. 14 Baylor vs. No. 22 West Virginia; 1 pm; ESPN/fuboNo. 12 TCU vs. No. 21 Texas Tech; 2 pm; FS1/fuboNo. 10 Oklahoma vs. No. 4 Texas; 3 pm; ABC/fuboNo. 8 Iowa vs. No. 2 UCLA; 4 pm; Fox/fuboThe burning questions1. Will Tennessee spoil UConn's perfect season?The No. 1 UConn Huskies are the lone undefeated team in women's college basketball, and given they have the best player in the country in Sarah Strong and the Big East only has two other teams ranked in the top 50 in NET rankings -- Villanova at 38 and Seton Hall at 48 -- it is unlikely they get tested at all in conference play. That means their biggest hurdle before the NCAA Tournament will come from their final nonconference game against No. 15 Tennessee on Sunday. The Lady Vols are 14-4 on the season and an impressive 6-1 in SEC play. Kim Caldwell's team is much faster and more physical than any team in the Big East, and the Lady Vols' defense has been potent in the last month -- they've held SEC opponents below 60 points in four of the last six games. Plus, Tennessee actually beat UConn last season, 80-76. But while that game was in Knoxville, this one is in Hartford, Connecticut, and the Huskies have reached a new level since then -- their last loss before their current 38-game winning streak.This is, of course, a historic rivalry in women's basketball, dating back to the days when the late Pat Summitt and Auriemma battled yearly for supremacy and took the sport to new heights. While UConn is the heavy favorite in this one, it's worth tuning in to see how they handle a team of Tennessee's ilk.\n2. Can Texas keep pace with the contenders?Out of all the great games this Sunday, our Isabel Gonzalez picked this one as her must-watch of the weekend, and it is not hard to see why. No. 10 Oklahoma has the front-runner for freshman of the year, Aaliyah Chavez, and No. 4 Texas has one of the best players in the nation, Madison Booker, and is a team with national championship hopes.The Sooners have been ranked as high as No. 5 this season before hitting a rough stretch in mid-January, dropping three straight games to then-No. 18 Ole Miss, then-No. 6 Kentucky and then-No. 6 LSU. But Oklahoma turned around the skid in emphatic fashion, upsetting then-No. 2 South Carolina last Thursday, and has notched two more wins since. An upset over Texas would go a long way toward securing Oklahoma a top 16 seed in the NCAA Tournament.But, in my opinion, Texas faces the most pressure in this game. Every team in the SEC will take its lumps, but since the Longhorns lost back-to-back games to then-No. 6 LSU and then-No. 3 Texas, legitimate questions have emerged about whether this team has enough offensive firepower and ball security to make it back to the Final Four. A loss to Oklahoma would only exacerbate those concerns and put Vic Schaefer's team in rocky waters at the beginning of a string of five straight games in 15 days against ranked opponents -- after Sunday, Texas faces No. 6 LSU, No. 18 Kentucky, No. 5 Vanderbilt and No. 15 Tennessee.\nAll season, last year's Final Four teams of UConn, South Carolina, UCLA and Texas have held onto the top four spots in the rankings and have been the favorites to make it to Phoenix. But a loss to Oklahoma would put Texas in danger of losing a No. 1 seed and falling back in the pack.3. Is UCLA ready to take full control of the Big Ten?So, this was supposed to be a battle of the undefeated teams in conference play, but No. 8 Iowa stumbled before it got to the finish line when it laid an egg against a feisty USC team on Thursday night. Still, these are the top two teams in the Big Ten and Sunday's game at Pauley Pavilion should be electric. Will Hannah Stuelke be the X factor Iowa needs to get the upset and make the Big Ten a true competition? Or will Gabriela Jaquez's shooting and leadership help No. 2 UCLA distance itself from the rest of the Big Ten? It should be fun to find out. 4. Are any of the top Big 12 teams elite?I'll be honest: I did not think the Big 12 would be so entertaining this season, but it has certainly made me look foolish for my low expectations. I thought No. 12 TCU would run away with it, and figured if anyone challenged the Horned Frogs, it would be Iowa State. However, as I covered in my article on the biggest disappointments of the season, the Cyclones stumbled out of the gate in Big 12 play and while TCU still sits atop the standings, it has looked far from unstoppable.\nRight now, the top four teams in the standings are TCU (20-2 overall; 8-1 conference), No. 14 Baylor (19-3, 8-1), No. 21 Texas Tech (20-3, 7-3) and No. 22 West Virginia (17-5, 7-3). On Sunday, we will see these four teams face each other. Can Texas Tech get its season back on track and upset TCU? Will Baylor be able to keep pace with TCU -- or even take over the top spot, depending on what TCU does -- by staving off a gritty West Virginia squad? I'm hoping Sunday provides some clarity amidst the chaos and shows whether TCU and Baylor are ready to establish themselves firmly as the top dogs of the conference or if West Virginia and Texas Tech are going to fight to stay in the mix.5. Who is the top team in Michigan? Michigan vs. Michigan State is a historic rivalry, but the women's basketball version has never held much significance outside of the state. But this year, the entire country should be tuned in. No. 9 Michigan is ranked in the top 10 for the 10th straight week, the longest streak in program history, and No. 13 Michigan State is at its highest ranking since 2010. It is the first time in the rivalry's history that both teams have been ranked in the top 15, and the second time they've both been ranked in the top 25, with the first occurring just one year ago. The two teams sit third and fourth in the ultra-competitive Big Ten, just behind UCLA and Iowa, so this game won't just be for in-state pride; it will have a real impact on conference standings and on earning a top-16 seed come March. They'll play twice in the next couple of weeks, with this one taking place in East Lansing.\nWhile there are plenty of talented players in this one, I'll be keeping an eye on the versatile star sophomore guards on each team – Kenendy Blair for the Spartans and Syla Swords and Olivia Olson for the Wolverines. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Super Sunday' in women's college basketball: Can Tennessee upend UConn's perfect season? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/4bdeb137-37fd-495e-b96f-a55fe43f47e4/thumbnail/1200x675/6a5246243debf881b15e2310df1ba77b/talaysia-cooper-ashlynn-shade-tennessee-uconn.png"
      ],
      "datePublished": "2026-02-01T15:55:32.000Z",
      "dateModified": "2026-02-01T15:55:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 card, results, highlights, winners from Alexander Volkanovski vs. Diego Lopes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-fight-card-date-alexander-volkanovski-diego-lopes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/2402c560-759e-47dc-a729-e331fc35e4b1/thumbnail/1200x675/121f6e136f12eed4ea4b46b589c15c66/alexander-volkanovski-lopes-action-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T06:47:55.000Z",
    "description": "\n\n\n    \n                                    The champion retained his crown in front of his hometown fans on Saturday night in Australia\n        \n    ",
    "body": "\n\n\n    \n                                    The champion retained his crown in front of his hometown fans on Saturday night in Australia\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 1, 2026\n                            \n                    at\n    1:47 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        A second numbered event is in the books for the Paramount era. UFC headed all the way across the globe on Saturday to Sydney, Australia for UFC 325 and it gave fans plenty to get excited about -- both for the present and future.In the main event, Alexander Volkanovski once again proved to be too much to handle for challenger Diego Lopes as the Aussie handled his business to take a unanimous decision and retain his featherweight crown. \"Volk\" has now equaled the legendary Jose Aldo for most title defenses at 145 pounds and it doesn't appear anything can slow him down from passing it at present. Elsewhere on the card, Benoit Saint Denis continued his climb up the lightweight rankings with a thrashing of Dan Hooker. Saint Denis battered Hooker after securing a takedown in the second round before the referee finally waved the fight off. Plus, Mauricio Ruffy bounced back from a defeat against Saint Denis to score a knockout of his own against Rafael Fiziev in a featured bout. Both men could find themselves in interesting matchups next as they jockey for position in the title race.\nCBS Sports was with you all week long with the latest news, features and other content around this massive event. Thanks for stopping by and we'll see you at UFC 325 in Australia.UFC 325 fight card, resultsAlexander Volkanovski (c) def. Diego Lopes via unanimous decision (49-46, 49-46, 50-45)Benoit Saint Denis def. Dan Hooker via second-round TKO (punches)Mauricio Ruffy def. Rafael Fiziev via second-round TKO (punches)Tallison Teixeira def. Tai Tuivasa via unanimous decision (29-28, 29-28, 29-28)Quillan Salkilld def. Jamie Mullarkey via first-round submission (rear-naked choke)Billy Elekana def. Junior Tafa via second-round submission (rear-naked choke)Cam Rowston def. Cody Brundage via second-round TKO (punches)Jacob Malkoun def. Torrez Finney via unanimous decision (30-27, 30-26, 30-26)Jonathan Micallef def. Oban Elliott via second-round submission (rear-naked choke)Kaan Olfi def. Yizha via majority decision (29-28, 29-28, 28-28)Dom Mar Fan def. Sangwook Kim via unanimous decision (30-27, 30-27, 30-27)Keiichiro Nakamura def. Sebastian Szalay via second-round (punches)Lawrence Liu def. Sulangrangbo via split decision (29-28, 28-29, 29-28)UFC 325 countdownCampbell: Three biggest takeaways from UFC 325 in AustraliaStaff predictions and expert picks for every fight on the main cardCampbell: What can change for Volk, Lopes in rematch just nine months laterBrookhouse: Best bets to consider on the main card on SaturdayDan Hooker: I fight because 'I don't want to get a real job'Mahjouri: Hooker vs. Saint Denis among must-watch fights this weekendCampbell: Five biggest storylines to follow in Sydney\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 card, results, highlights, winners from Alexander Volkanovski vs. Diego Lopes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/2402c560-759e-47dc-a729-e331fc35e4b1/thumbnail/1200x675/121f6e136f12eed4ea4b46b589c15c66/alexander-volkanovski-lopes-action-325.jpg"
      ],
      "datePublished": "2026-02-01T06:47:55.000Z",
      "dateModified": "2026-02-01T06:47:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 takeaways: Alexander Volkanovski aging gracefully; lightweight heating up - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-takeaways-alexander-volkanovski-diego-lopes-benoit-saint-denis/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/e77100b3-2013-47a3-9f76-67693155cfc3/thumbnail/1200x675/04ffad72c408c5fdb94cabba619b7d63/alexander-volkanovski-dc-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T06:36:01.000Z",
    "description": "\n        The second numbered event in as many weeks for the UFC took place in Australia on Saturday as featherweight champion Alexander Volkanovski fo",
    "body": "\n        The second numbered event in as many weeks for the UFC took place in Australia on Saturday as featherweight champion Alexander Volkanovski fought in front of his home fans in Sydney for the first time since 2017. Volkanovski scored a second straight win over Diego Lopes in the main event, recording a clear unanimous decision to equal Jose Aldo's UFC record of eight wins in title bouts at 145 pounds. In the co-main event, Benoit Saint-Denis put a hurting on veteran Dan Hooker in a second-round stoppage before calling out the elite of the division. Here's a look at the biggest takeaways from an exciting night of action inside Qudos Bank Arena at UFC 325. 1. Death, taxes and Alexander Volkanovski on top of the featherweight divisionEven though the 37-year-old Volkanovski wouldn't cop to it himself during fight week out of respect for Aldo, whom he defeated in 2019, we can all say it for him: \"Alexander the Great\" is the best featherweight in MMA history. Volkanovski is 18-1 at 145 pounds throughout his 14-year pro career (including a mark of 13-1 in the UFC), with his only blemish being a second-round knockout loss to current lightweight champion Ilia Topuria in 2024. And not only did Volkanovski regain the vacant UFC title following the setback, he defended once more in his rematch with Lopes on Saturday that somehow looked even easier than the five-round decision he claimed nine months ago. Volkanovski took a knee on a flash knockdown in Round 3 but outside of that, it was lights out as the Australian met Lopes' pressure with clean boxing, a stiff jab and constant footwork patterns that never allowed his Brazilian foe to get into a rhythm. The fact that Volkanovski still appears to be at the top of his game this far into his 30s in a smaller weight division in which speed is prioritized is remarkable. A true living legend of the Octagon, who owns three career wins over Max Holloway, it wouldn't be out of bounds to suggest that Volkanovski is a top 15 fighter in the history of the sport. And even though some difficult style matchups remain should he choose to stay active and continue his title, it would be hard to imagine Volkanovski not being favored from a betting standpoint against the likes of Movsar Evloev, Lerone Murphy, Jean Silva or Aljamain Sterling.\n2. The lightweight division is reshuffling the deck at a rapid rateEven with 37-year-old Justin Gaethje turning back time last Saturday at UFC 324 to claim the interim title for the second time in an exciting win over Paddy Pimblett, the lightweight division has seen many of its all-action heroes retire or enter their twilight in recent years, from Dustin Poirier and Michael Chandler to Charles Oliveira and even Conor McGregor. But a new breed of 155-pound fighters are on the rise, as evidenced by Ilia Topuria's championship win last year and the rise of top contender Arman Tsarukyan. Three more lightweights scored breakthrough wins on Saturday's main card to move closer to title contention; Benoit Saint Denis, Mauricio Ruffy and newcomer Quillan Sallkilld. Saint Denis improved to 4-0 with four stoppage wins since he suffered a pair of devastating losses in 2024 and suddenly looks like a legit title contender following a violent second-round TKO win over a brave Dan Hooker. BSD took some damage at times but was able to take the fight to the ground and suffocate Hooker when it mattered most. Ruffy, meanwhile, bounced back from a humbling submission loss to Saint Denis last September by switching camps and continents to deliver an impressive second-round stoppage of Rafael Fiziev to likely catapult himself back into the top 10. But it was Sallkilld who very much looked like the long-term future of the division when the 26-year-old improved to 4-0 in the UFC since making his debut one year ago by submitting Jamie Mullarkey with relative ease.\n3. There are no excuses left for Tai TuivasaEntering the fight riding a five-fight losing streak (including four by stoppage) and an 18-month layoff to heal himself mentally and physically, Tuivasa's Sydney homecoming turned out to be an absolute disaster. Even though he nearly rallied for a dramatic stoppage win in Round 3 against an opponent, Tallison Teixeira, who had never fought past the first round in 12 career pro fights, Tuivasa's lack of cardio after so much time away was embarrassing. Claiming he undertook the layoff to heal himself both mentally and physically, Tuivasa somehow looked in worse physical shape than he did amid the losing skid and clearly hadn't improved on his lack of a ground game as the 6-foot-8 Teixeira, who isn't known as a ground specialist, largely relied on takedowns and top pressure to win the first two rounds. The only fighters in UFC history to stay employed following losing skids of at least six consecutive fights are BJ Penn, Tony Ferguson and Sam Alvey. Given that Tuivasa is a fan favorite who competes in an exciting style and is still just 32 in a division that ages slower than the rest, he just might get another opportunity inside the Octagon. The real question is, however, how much pride does Tuivasa have left to try and save his career? It's now or never. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 takeaways: Alexander Volkanovski aging gracefully; lightweight heating up - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/e77100b3-2013-47a3-9f76-67693155cfc3/thumbnail/1200x675/04ffad72c408c5fdb94cabba619b7d63/alexander-volkanovski-dc-325.jpg"
      ],
      "datePublished": "2026-02-01T06:36:01.000Z",
      "dateModified": "2026-02-01T06:36:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Super Bowl Opening Night 2026: Time, channel, streaming for Seahawks and Patriots - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-date-super-bowl-2026-opening-night/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/6b6b6af5-a659-4228-830e-afae88a5ab7a/thumbnail/1200x675/d9a4ede1d8be27e3f1247bbd4871d58f/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:00:50.000Z",
    "description": "\n    \n    \n                    \n                Photo by Aaron M. Sprecher/Getty Images\n            \n            \n    \n        And here we go! At long",
    "body": "\n    \n    \n                    \n                Photo by Aaron M. Sprecher/Getty Images\n            \n            \n    \n        And here we go! At long last, Super Bowl week has arrived, and it's pedal to the metal until we get to kickoff of Super Bowl LX between the Seattle Seahawks and New England Patriots. Before we get to that duel for a Lombardi Trophy at Levi's Stadium on Feb. 8, however, there's a plethora of events that will unfold in the Bay Area, beginning with Super Bowl Opening Night. This is one of the more lively events of Super Bowl week, as each team will take the stage to be introduced. Then, a large contingent of players and coaches will be made available at individual podiums. There, the questions will range from the nitty-gritty of the game itself to the wild and obscure pop-culture variety, making it truly a one-of-a-kind evening. Below, you can see how to watch the spectacle unfold. Super Bowl Opening Night where to watchDate: Monday, Feb. 2 | Time: 8 p.m. ETLocation: San Jose Convention Center (San Jose)TV: NFL Network | Stream: fubo (try for free)The AFC Champion Patriots will be made available first, followed by the NFC Champion Seahawks. Here's a quick breakdown of the timeline as highlighted by the NFL (all times ET):\n7 p.m.: Doors open to San Jose Convention Center7:30 p.m. to 9:30 p.m.: Session 1 for New England Patriots8 p.m.: New England Patriots introduction and media availability9 p.m. to 11 p.m.: Session 2 for Seattle Seahawks9:15 p.m.: Joint team appearance10 p.m.: Seattle Seahawks introduction and media availability11 p.m.: Event concludesFans can expect to see the likes of Drake Maye, Sam Darnold, Jaxon Smith-Njigba, Stefon Diggs, Mike Vrabel, and Mike Macdonald among the notable figures at various podiums. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Super Bowl Opening Night 2026: Time, channel, streaming for Seahawks and Patriots - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/6b6b6af5-a659-4228-830e-afae88a5ab7a/thumbnail/1200x675/d9a4ede1d8be27e3f1247bbd4871d58f/template-pic.jpg"
      ],
      "datePublished": "2026-02-01T14:00:50.000Z",
      "dateModified": "2026-02-01T14:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tottenham vs. Man City: Live stream, Premier League odds, where to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/manchester-citys-vs-tottenham-preview-live-stream-odds-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/6a0ee1f8-79b1-4f66-b03d-c5accec17a5f/thumbnail/1200x675/b998d388191d6489f9be6b8f6dbab86d/pep-1.jpg",
    "tag": "Sports",
    "date": "2026-02-01T13:06:39.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If Manchester City want to get on a run and look t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If Manchester City want to get on a run and look to close the gap at the top of the Premier League table, they'll need to do something that has been quite tough for Pep Guardiola during his time at the club -- get past Tottenham. He has struggled facing the North London side, losing three of his last five meetings with them. In August, Tottenham won the reverse fixture 2-0 at the Etihad Stadium, and now City will need to go away from home with the task of picking up all three points. How to watch Tottenham vs. Manchester City, oddsDate: Sunday, Feb. 1 | Time: 11:30 a.m. ETLocation: Tottenham Hotspur Stadium -- LondonLive stream: PeacockOdds: Tottenham +350; Draw +310; Manchester City -143On paper, it should seem easy to defeat a team placed 14th in the league, but Tottenham have defied logic all season. Securing a top four finish in Champions League play, they're able to avoid the knockout phase, where Manchester City will have to subject themselves to extra games and minutes on players' legs. It's all part of Spurs' strange existence this campaign. Every week, it seems like they could be moving onto a new manager, and then you blink, and they've advanced further into Europe while also losing in the Premier League. But then it's also an improvement on last season, when Tottenham won the Europa League while finishing 17th in league play. They'll be without Pedro Porro for this match, which adds to their struggles, while City's defense will be in a better place with Marc Guehi potentially in the XI.After Erling Haaland ended his scoring drought in the Champions League, Tottenham will need to keep a close eye on him as he can turn an inch into a goal. City will make it tough to score as only Arsenal have conceded more than their 21 goals, but historically, trends haven't mattered here. \nSeven points separate City from Arsenal, and a win would close that gap to four. The league isn't in Guardiola's control, but with a matchup with Arsenal looming, they can up the pressure and see what happens. It all starts with getting past Tottenham, but any loss at this juncture can put their league chances in serious jeopardy.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tottenham vs. Man City: Live stream, Premier League odds, where to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/6a0ee1f8-79b1-4f66-b03d-c5accec17a5f/thumbnail/1200x675/b998d388191d6489f9be6b8f6dbab86d/pep-1.jpg"
      ],
      "datePublished": "2026-02-01T13:06:39.000Z",
      "dateModified": "2026-02-01T13:06:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League picks: Tottenham vs. Manchester City betting odds, expert bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/tottenham-vs-manchester-prediction-odds-picks-for-premier-league-match-on-sunday-feb-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/497fa875-e6eb-49ad-b114-d2631798cc24/thumbnail/1200x675/7e34ce8f7bcbc867d2fb14cf335fb2f9/erling-haaland-manchester-city-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:51:43.000Z",
    "description": "\nEnglish Premier League leading scorer Erling Haaland and Manchester City are back in action on Sunday with a road matchup with Tottenham on tap. Man ",
    "body": "\nEnglish Premier League leading scorer Erling Haaland and Manchester City are back in action on Sunday with a road matchup with Tottenham on tap. Man City sit second in the EPL table entering the weekend, while Tottenham have not won an EPL match since late December and sit 14th in the standings. Kickoff from Tottenham Hotspur Stadium in London is set for 11:30 a.m. ET. Manchester City are -145 favorites (wager $145 to win $100) in the latest Tottenham vs. Manchester City odds at DraftKings Sportsbook while Tottenham are +380 underdogs (wager $100 to win $380). A draw is priced at +300 and the total is set at 2.5 (Over -160, Under +125). You can find the latest projections for Tottenham vs. Manchester City at SportsLine but before locking in any bets, you should see what soccer expert Jon Eimer has to say for this Premier League showdown.Eimer finished 2023 as SportsLine's No. 1 soccer expert, posting a 248-234-12 (+25.93 units) record on SportsLine article picks. Eimer has been red-hot in 2025, posting a profit in multiple leagues, including the Premier League, Champions League, La Liga and more. Anyone following his soccer betting picks at sportsbooks and on betting apps could have seen huge returns.  Here are Eimer's best bets and analysis for Tottenham vs. Manchester City on Sunday.Tottenham vs. Manchester City best betsUnder 2.5 goals (+115, BetMGM) -- 1uTottenham Double Chance (+110, BetMGM) -- 1uManchester's offense has cooled offManchester City for the last few years have been an absolute wagon when it comes to betting on goals. With players like Erling Haaland at the helm, it was easy to blind bet the Over for many years for Pep and his men. We are, however, seeing a bit of a different side out of Manchester City this season. Whether it's because of injuries, the congested schedule or drama off the pitch, this side just isn't firing at the same level we're used to seeing. They've now gone Under 2.5 goals in their last six straight EPL fixtures, which included a 0-0 draw to Sunderland, 1-1 draws to Brighton and Chelsea and a 2-0 loss to Manchester United. Factor in the fact that they'll be tired after hosting Galatasaray and this match has me leaning on another cagey Under. Tottenham's unpredictabilityTottenham continue to be one of the most bizarre teams in the league. One week they're getting put through the wringer by West Ham and Bournemouth, the next they're smacking down Dortmund and Frankfurt in UCL play. This team has a fairly talented side of strikers, but they're struggling with injuries and consistency alike. They also tend to be a bit of a bogey team for Manchester City at times. They've played Man City four times in the last two years, and Tottenham have won three of the four, and they're only loss over those four was a 1-0 loss. I'm going for a low-scoring, cagey match that could very well result in a draw.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League picks: Tottenham vs. Manchester City betting odds, expert bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/497fa875-e6eb-49ad-b114-d2631798cc24/thumbnail/1200x675/7e34ce8f7bcbc867d2fb14cf335fb2f9/erling-haaland-manchester-city-imagn-images-2.jpg"
      ],
      "datePublished": "2026-02-01T14:51:43.000Z",
      "dateModified": "2026-02-01T14:51:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australian Open final: Carlos Alcaraz beats Novak Djokovic to notch career grand slam - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/tennis/news/australian-open-final-carlos-alcaraz-beats-novak-djokovic-to-notch-career-grand-slam/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/6fa37e36-b075-4b43-b2c0-d9e6ba13a011/thumbnail/1200x675/178c5834db414aad30a1584911f2424e/alcaraz.png",
    "tag": "Sports",
    "date": "2026-02-01T12:48:07.000Z",
    "description": "\n        Carlos Alcaraz made history in Sunday's Australian Open men's singles final, taking out Novak Djokovic 2-6, 6-2, 6-3, 7-5 to become the young",
    "body": "\n        Carlos Alcaraz made history in Sunday's Australian Open men's singles final, taking out Novak Djokovic 2-6, 6-2, 6-3, 7-5 to become the youngest player to complete the career grand slam. The 22-year-old Spaniard broke the mark set by Don Budge in the 1938 French championships, when he was 22 years and 363 days.Alcaraz's first career Australian Open title came against an all-time great, who was previously 10-0 in Melbourne finals. With both players coming off long, five-set wins in the semifinals, Djokovic was first to apply pressure in the first set with a 6-2 cruise before Alcaraz stormed back.Over the final three sets, Djokovic struggled to combat Alcaraz's elite athleticism and speed, relaying on miscues for points instead of his usual forehand passing winners. In pursuit of his record-extending 25th major title, Djokovic battled throughout the decisive fourth set until several unforced errors led to the Alcaraz win.On match point, Djokovic sailed a forehand wide to the corner as Alcaraz dropped his racket, put his hands on his head and dropped to the court inside Rod Laver Arena in celebration.\nAlcaraz cements his status as the world's No. 1 player with the win and joins Djokovic, Andre Agassi, Roger Federer and Rafael Nadal as the only men to complete the career grand slam in the Open era.\"Nobody knows how hard I've been working to get this trophy,\" Alcaraz said, hoisting the trophy. \"I just appreciate this moment so much.\"Alcaraz now has seven major titles and is the first to do it before turning 23.\"What you've been doing ... the best word to describe it is historic, legendary,\" Djokovic told Alcaraz after the match. \"So congratulations. I wish you [the] best of luck for the rest of your career. You're so young. You have a lot of time, like myself. I'm sure we'll be seeing each other many times in the next 10 years.\"\nAfter breaking Djokovic in the third and seventh game of the second set, Alcaraz seemed to hit a different level of play the rest of the match and never let it up, wearing down Djokovic. Alcaraz notched the only service break of the fourth set to prevail.\"I have to be honest,\" Djokovic said during his runner-up speech, \"I didn't think that I would be standing in the closing ceremony of a Grand Slam once again, so I think I owe you the gratitude as well for pushing me forward over the last couple of weeks.\"Djokovic first hinted at retirement after last year's French Open loss and concluded Sunday's time at the microphone on center court with a nod in that direction. Considering his appearance in the semifinals or better of the last several majors, however, Djokovic continues to play at an elite level in search of grand slam No. 25.\n\"God knows what happens tomorrow, let alone in six months or 12 months,\" Djokovic said. \"but it has been a great ride, I love you guys.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australian Open final: Carlos Alcaraz beats Novak Djokovic to notch career grand slam - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/6fa37e36-b075-4b43-b2c0-d9e6ba13a011/thumbnail/1200x675/178c5834db414aad30a1584911f2424e/alcaraz.png"
      ],
      "datePublished": "2026-02-01T12:48:07.000Z",
      "dateModified": "2026-02-01T12:48:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 results: Benoit Saint Denis scores brutal knockout of Dan Hooker - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-results-highlights-benoit-saint-denis-dan-hooker-tko/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/83f04026-b455-4a63-88de-776c9c2706c0/thumbnail/1200x675/c607225d37e394ec3649b3d9fddf636f/bsd-hooker-action-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T04:31:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Benoit Saint Denis might be the most consistent of",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Benoit Saint Denis might be the most consistent offensive force in the lightweight division. Dan Hooker is no stranger to tough fights, but he melted under the sustained pressure that Saint Denis brought at UFC 325.Saint Denis' evolution was a talking point heading into Saturday's event. Old habits die hard, however, as his technical advancements sometimes took a backseat to his aggressive instincts. Hooker offered serious resistance early with body kicks that visibly hurt Saint Denis. Ultimately, Saint Denis' relentlessness forced critical errors from \"The Hangman.\"\"I had to resort to old Saint Denis,\" the Frenchman said in Saturday's post-fight interview. \"Seek and destroy shit.\"Follow live updates on UFC 325: Alexander Volkanovski vs. Diego Lopes as event debuts on Paramount+\nHooker worked hard to negate Saint Denis' wrestling by hunting guillotine chokes and not settling for bottom position. Amid the chaos, Hooker mistakenly pursued his own takedown. Saint Denis landed in a terribly advantageous position. Saint Denis, from the beginning stages of a mounted triangle, trapped Hooker's arm and reigned down elbows. Hooker eventually freed his arm, only to fend off a tight arm triangle choke. Through grit and a narrow airway, Hooker survived the submission attempt. Saint Denis abandoned what little caution he exercised in the fight, posturing up and throwing an elbow barrage that busted Hooker open. Referee Herb Dean gave Hooker every chance to escape, but the veteran lightweight only managed to cover up. The fight was ruled a TKO victory for Saint Denis at 4:45 of Round 2. \nPost-fight, Saint Denis demanded either a lightweight or BMF title shot. Saint Denis called out Ilia Topuria, Justin Gaethje, Max Holloway and Charles Oliveira by name, but also had one other fighter in mind.\n\"Arman Tsarukyan, you say you're the No. 1 contender? I'm here to take your f---ing spot.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 results: Benoit Saint Denis scores brutal knockout of Dan Hooker - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/83f04026-b455-4a63-88de-776c9c2706c0/thumbnail/1200x675/c607225d37e394ec3649b3d9fddf636f/bsd-hooker-action-325.jpg"
      ],
      "datePublished": "2026-02-01T04:31:27.000Z",
      "dateModified": "2026-02-01T04:31:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]