[
  {
    "title": "Hawks vs. Pacers prediction, odds, spread, start time: 2026 NBA picks for Monday, Jan. 26 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/hawks-pacers-odds-prediction-spread-time-2026-nba-picks-monday-january-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/b87ec697-5ada-4cb9-8655-8826fc12d7b0/thumbnail/1200x675/db054e251229e9cfd5759e410a2a3205/jalen-johnson-atlanta-hawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-26T17:59:31.000Z",
    "description": "\n        The Monday NBA schedule tips early as the Atlanta Hawks host the Indiana Pacers in a game that was moved to the afternoon due to the winter s",
    "body": "\n        The Monday NBA schedule tips early as the Atlanta Hawks host the Indiana Pacers in a game that was moved to the afternoon due to the winter storm impacting the area. The Hawks are 22-25 on the season and sit in 10th place in the Eastern Conference. Indiana is 11-35 and in 14th in the East. Quenton Jackson (ankle) and Bennedict Mathurin (thumb) are questionable for Indiana. Kristaps Porzingis (Achilles) and Zaccharie Risacher (knee) are out for Atlanta. Tipoff is set for 1:30 p.m. ET at State Farm Arena in Atlanta. Atlanta is a 5.5-point favorite in the latest Hawks vs. Pacers odds, while the over/under is 233.5. Before making any Pacers vs. Hawks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Hawks vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Hawks:Hawks vs. Pacers spread                                                                     Hawks -5.5Hawks vs. Pacers over/under:    233.5 pointsHawks vs. Pacers money line:    Hawks -224, Pacers +185Hawks vs. Pacers picks: See picks at SportsLineHawks vs. Pacers streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Hawks vs. Pacers picksSportsLine's model has simulated Pacers vs. Hawks 10,000 times and is going Over on the total (233.5 points). These teams met on Oct. 31 and combined for 236 points, clearing the total -- which was 232.5 -- in that game.This time around, the model is projecting 11 players to score 9.5 or more points in the simulations, with Pascal Siakam (21.4 points) leading the way for Indiana and Atlanta's Jalen Johnson (25.7 points) leading all scorers. The model is projecting 236 combined points as the Over hits 53% of the time. It has also generated an against-the-spread pick that hits in nearly 60% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Hawks vs. Pacers, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hawks vs. Pacers prediction, odds, spread, start time: 2026 NBA picks for Monday, Jan. 26 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/b87ec697-5ada-4cb9-8655-8826fc12d7b0/thumbnail/1200x675/db054e251229e9cfd5759e410a2a3205/jalen-johnson-atlanta-hawks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-26T17:59:31.000Z",
      "dateModified": "2026-01-26T17:59:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "76ers vs. Hornets prediction, odds, spread, time: 2026 NBA picks for Monday, Jan. 26 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/76ers-hornets-odds-prediction-spread-line-time-2026-nba-picks-monday-january-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/9de52ac6-b109-4860-96fc-835b002e8ab9/thumbnail/1200x675/fabca18fa2858ce8abfca54785a8f4d1/tyrese-maxey-philadelphia-76ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-26T18:55:19.000Z",
    "description": "\n        The Charlotte Hornets look to win their third game in a row when they battle the Philadelphia 76ers in a key Eastern Conference matchup on Mo",
    "body": "\n        The Charlotte Hornets look to win their third game in a row when they battle the Philadelphia 76ers in a key Eastern Conference matchup on Monday afternoon. Philadelphia is coming off a 112-109 loss to the New York Knicks on Saturday, while Charlotte downed Washington 119-115 that same day. The 76ers (24-20), who are fourth in the Atlantic Division, are 12-7 on the road this season. The Hornets (18-28), who are fourth in the Southeast Division, are 8-13 on their home court. Philadelphia will be without starters Joel Embiid (knee) and Paul George (knee).Tipoff from Spectrum Center in Charlotte, N.C., is set for 3 p.m. ET. Charlotte is a 1.5-point favorite in the latest 76ers vs. Hornets odds from DraftKings Sportsbook, while the over/under for total points scored is 228.5. Before making any 76ers vs. Hornets picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated 76ers vs. Hornets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Hornets vs. 76ers:76ers vs. Hornets                                                                                                     spread:    Charlotte -1.5 at DraftKings    76ers vs. Hornets                                                                                                                   over/under:    228.5 points76ers vs. Hornets                                                                                                                   money line:    Charlotte -126, Philadelphia +10676ers vs. Hornets                                                                                                                   picks:    See picks at SportsLine76ers vs. Hornets                                                                                                                   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make 76ers vs. Hornets picksAfter 10,000 simulations of 76ers vs. Hornets, SportsLine's model is going Over on the total (228.5). The total has gone Over in three of the last four meetings between the teams. The Over has hit in two of the last three Philadelphia games, and in five of the last eight Charlotte matchups. The SportsLine model is projecting Philadelphia's Tyrese Maxey to score 31.2 points on average and be one of four 76ers players to score 13.9 or more points. Charlotte's LaMelo Ball, meanwhile, is projected to have 19.7 points as five Hornets players score 12.7 points or more. The teams combine for 234 points in the simulations as the Over hits nearly 60% of the time. The model also says one side of the spread is the better value. You can head to SportsLine to see the model's NBA picks. So who wins 76ers vs. Hornets, and which side of the spread is the better value? Visit SportsLine now to see which side of the 76ers vs. Hornets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "76ers vs. Hornets prediction, odds, spread, time: 2026 NBA picks for Monday, Jan. 26 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/9de52ac6-b109-4860-96fc-835b002e8ab9/thumbnail/1200x675/fabca18fa2858ce8abfca54785a8f4d1/tyrese-maxey-philadelphia-76ers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-26T18:55:19.000Z",
      "dateModified": "2026-01-26T18:55:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 324 breaks records for Paramount+: More homes than any UFC event in decade - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-324-breaks-records-paramount-plus/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/eca1b76a-fc59-4df7-b778-5e3ed24119b9/thumbnail/1200x675/d8ab9c2ecba68a6bf2a280738189b95c/ufc-paramount-logo-set-belt-g.jpg",
    "tag": "Sports",
    "date": "2026-01-26T21:26:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first event of the historic media rights deal ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first event of the historic media rights deal between UFC and Paramount Skydance went down Saturday with UFC 324 from Las Vegas outperforming expectations on Paramount+. Headlined by a thrilling fight that saw Justin Gaethje defeat Paddy Pimblett to win the interim lightweight championship, UFC 324 registered as the platform's largest exclusive live event to date, delivering nearly five million streaming views and seven million households.   By officially saying goodbye to the pay-per-view model, streaming live for Paramount+ subscribers, UFC 324 reached more homes than any UFC live event in nearly a decade across linear, broadcast and streaming. The UFC 324 stream hit a concurrent peak of more than 5.9 million streams.The event was also a hit on social media, serving not only as Paramount+'s most social telecast ever, but also the No. 1 trend for six consecutive hours. UFC 324 saw a 127% increase in mentions from December's UFC 323 PPV.Every UFC numbered event and UFC Fight Night will stream live on Paramount+ -- no additional fees -- for the duration of the seven-year deal.\nIn Saturday night's main event, Gaethje outworked Pimblett in a five-round bout ended via unanimous decision, becoming the first two-time interim champion in UFC history. He scored multiple knockdowns as part of a performance that may be seen as among the best of the year in mixed martial arts. Gaethje is now in line to unify his interim belt with full champion Ilia Topuria, who has been sidelined while dealing with a contentious divorce.\nUFC 325 is next up on Saturday, airing live internationally from Sydney, Australia. The main card, headlined by Alexander Volkanovski's featherweight title defense against Diego Lopes, will stream live on Paramount+ beginning at 9 p.m. ET.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 324 breaks records for Paramount+: More homes than any UFC event in decade - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/eca1b76a-fc59-4df7-b778-5e3ed24119b9/thumbnail/1200x675/d8ab9c2ecba68a6bf2a280738189b95c/ufc-paramount-logo-set-belt-g.jpg"
      ],
      "datePublished": "2026-01-26T21:26:17.000Z",
      "dateModified": "2026-01-26T21:26:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scottie Scheffler primed to quell any doubts over dominance after full offseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/scottie-scheffler-dominance-pga-tour-2026-offseason-preparation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/99c00c88-c8e1-46cb-aa9a-452e4c716a18/thumbnail/1200x675/e7da86359deed5b363fe7cb98d366062/scottie-scheffler-amex-sunset-g.jpg",
    "tag": "Sports",
    "date": "2026-01-26T21:10:06.000Z",
    "description": "\n        There have always been \"buts\" when it comes to Scottie Scheffler at the start of his PGA Tour seasons: He's a great young player, but he hasn",
    "body": "\n        There have always been \"buts\" when it comes to Scottie Scheffler at the start of his PGA Tour seasons: He's a great young player, but he hasn't won yet. He's the world No. 1, but he didn't win during the summer. He's striking the ball at a historic clip, but his putting may be historically bad. He is the best player in the world, but he is less than 100% following an injury.Despite these \"buts,\" Scheffler produced jaw-dropping moments and head-turning victories, so let your mind wander and instead imagine what happens when the \"buts\" become \"ands.\"In 2022, Scheffler entered the PGA Tour season without a win to his name. As some questioned his ability to close, no one expected he would kick off this run of success. By the time 2023 rolled around, Scheffler had ascended to the world No. 1 ranking thanks to a four-victory campaign; this despite not entering the winner's circle since slipping on the green jacket that prior April. He picked up two more wins that year without a cooperative putter, which kept a generational ball striker from being considered a generational player. Plus, as his wins came in February and March, he again left the meat of the schedule for the field.\nScheffler entered 2024 ranked 162nd out of 193 players on the PGA Tour in strokes gained putting. Scheffler put a new mallet-style putter in rotation during his sixth start of the season, thinking he would give it a chance in the heat of the battle. No matter how he fared, he promised to keep it in the bag all four days at the Arnold Palmer Invitational.Well, Scheffler won that tournament by five strokes. The putter has not left the bag since.Scheffler's 2024 season was beyond historic. He picked up his second Masters, six other PGA Tour wins and the gold medal at the Paris Olympics. Despite the accolades, the praise and the lofty comparisons, Scheffler still believed he could improve.\nHe again field tested a new method on the greens, a claw-style putting grip from inside roughly 15 feet to repair some struggles from close range. Debuting the new process at the Hero World Challenge, he came away with a six-stroke victory that let the golf world know, yes, he could get even better.Scheffler's win in the Bahamas came less than a month before news broke of his offseason mishap. He suffered a hand injury from improperly using a wine glass to roll out ravioli dough while cooking with friends and family during the holidays. Scheffler was forced to sideline himself -- not only from playing but from preparing.\"It's a bit easier this way. I'm going to try to continue this into the future. This is a little easier offseason than last,\" Scheffler said Sunday after winning the American Express, his 20th victory on the PGA Tour. \"It's one of those things. You look at last year, it is different just because I had made what I felt was so much progress in the offseason, and then to have that basically taken away by 4-6 weeks of inactivity from golf, that has an effect.\n\"To fine-tune the skills that we have out here takes a lot of work. Like the chipping: There's a big difference between hitting a chip to a foot versus 5 feet. If I hit it to a foot, I'm probably never going to miss that foot putt. But if you hit it to 5 feet, your percentages of making that putt go down. When you just kind of see that over the course of four days, that has an effect on where my game is at. So being able to have the whole offseason to prepare to come out here ... to have that time to prepare and get my body and mind right in order to compete, I think, really paid off early in the season.\"Scheffler's preparation is one of his many separators, but it does not receive the same attention as what he accomplishes over 72 holes most weeks. His preparation is neither as breathtaking as his iron play nor as funky as his footwork. It has not seen noticeable improvement like his putting, and it cannot be measured like strokes gained.But it's preparation on which Scheffler hangs his hat. In between dodging comparisons to Tiger Woods and Jack Nicklaus, who he recently joined as the only players to claim 20 PGA Tour wins and four major championships before the age of 30, and answering a different variation of the same question, wondering how this triumph feels as opposed to the rest, Scheffler beats the same drum over and over again: prepare, prepare, prepare.\nOnce Scheffler was able to prepare himself weekly returning from injury last year, he must have felt unstoppable. He won six of his last 12 tournaments of 2025, including major victories at the PGA Championship and The Open. He has not finished outside the top 10 in a tournament since The Players Championship last March, now almost 11 months ago.Entering the year at hand (no pun intended), Scheffler spent the past offseason in the gym preparing for the long, grueling haul that is a full PGA Tour campaign. The area on which he wished to improve this time around was not a skillset but rather his overall endurance -- another trait spectators are unable to see.Through one tournament, well, so far so good.Scheffler being able to prepare this offseason -- honing his craft, identifying a spot that continues to bother him and attempting to improve upon it -- has led to him answering the bell each time it rings.\nScheffler is a great player, and he continues to close tournaments when in contention. Scheffler is the world No. 1, and he is riding momentum from the previous summer into a new season. Scheffler's ball striking remains historic, and his putting is among the best in the game.Scheffler is the most dominant player in the world, and now, he is 100% healthy at the start of the season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scottie Scheffler primed to quell any doubts over dominance after full offseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/99c00c88-c8e1-46cb-aa9a-452e4c716a18/thumbnail/1200x675/e7da86359deed5b363fe7cb98d366062/scottie-scheffler-amex-sunset-g.jpg"
      ],
      "datePublished": "2026-01-26T21:10:06.000Z",
      "dateModified": "2026-01-26T21:10:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Harrison Bader lands in NL West on two-year contract - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-harrison-bader-giants/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/90eee6fd-0cda-4816-a52b-6cf03a18eac5/thumbnail/1200x675/94b98aea04e091c80ce413cd1e26a869/harrison-bader-getty.png",
    "tag": "Sports",
    "date": "2026-01-26T19:08:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Much of the offseason activity for Major League Ba",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Much of the offseason activity for Major League Baseball is complete with spring training kicking off in just a few weeks. We're still yet to see some things settled, though, such as free agents Framber Valdez, Eugenio Suárez and Zac Gallen finding homes (free agent tracker here) and there's always the possibility another trade or two will happen as well. Let's gather the news and rumors on this Monday.Giants ink Bader to two-year dealThe Giants and free agent outfielder Harrison Bader have agreed to a two-year contract, per The Athletic. The deal is for $20.5 million with the possibility that incentives could get it to $21 million, according to the New York Post.Bader, 31, played in 146 games for the Twins (96 games) and Phillies (50) last season, hitting .277/.347/.449 (117 OPS+) with 24 doubles, 17 homers, 54 RBI, 61 runs, 11 steals and 3.9 WAR. He still rates out as an excellent defensive center fielder -- which comes in handy in the spacious Oracle Park -- and he hit for good average and OPS last season, too. \nGiven the landscape of the Giants' roster, Bader probably steps right in as the everyday center fielder, bumping Jung Hoo Lee to right field. Lee's range in center was a big problem last season, so this alignment should give the Giants much better outfield coverage.Minor-league deals for former MLB namesThe Angels have agreed to a minor-league deal with Trey Mancini (The Athletic). He last played in the majors in 2023.The Cubs have signed outfielder Dylan Carlson to a minor-league deal (The Baseball Tribune).\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Harrison Bader lands in NL West on two-year contract - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/90eee6fd-0cda-4816-a52b-6cf03a18eac5/thumbnail/1200x675/94b98aea04e091c80ce413cd1e26a869/harrison-bader-getty.png"
      ],
      "datePublished": "2026-01-26T19:08:27.000Z",
      "dateModified": "2026-01-26T19:08:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami's Rueben Bain Jr. explains why defense 'might be better' in 2026 without him - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-rueben-bain-jr-2026-college-football-defense/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/609a2119-c31b-43da-b317-a6811713bf91/thumbnail/1200x675/82185e3c1ea53528d93fb439efbfe929/bain.jpg",
    "tag": "Sports",
    "date": "2026-01-26T20:44:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Hurricanes fell just short of a national",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Miami Hurricanes fell just short of a national championship, and their run to the title game was fueled by dominance on both sides of the line of scrimmage. Their offensive line was among the best in football and their defensive front was headlined by a pair of game-wrecking pass rushers in Rueben Bain Jr. and Akheem Mesidor. One of the major questions for the Hurricanes coming into the 2026 season will be whether they can remain as dominant up front after some key departures to the NFL. Both Bain and Mesidor are headed off to the NFL, while the offensive line loses star tackle Francis Mauigoa, but if any Canes fans are looking for optimism, Bain provided it in a recent interview with CBS Miami. When asked about how he thinks the Hurricanes' defensive line will fare without his presence (and Mesidor's), Bain proclaimed that he wouldn't be surprised if that group is even better in 2026. \"I feel like they might be better than this year, because they got to see me and Akeem lead em off and show em what it's supposed to look like,\" Bain said. \"Now they got that extra chip on their shoulder from getting all the way to the dance and not finishing like we wanted to. So now they get some extra fuel, some extra drive to go in next year with the right mindset and get the job done.\" \nBain pointed to the depth of the group as one of the reasons he thinks Miami will be right back in the Playoff next year trying to win a national title, noting that the only departures are himself, Mesidor and David Blay. The challenge is, those are three of their four most productive defensive lineman -- star defensive tackle Ahmad Moten staying for 2026 was a huge coup for Mario Cristobal's group.Mesidor and Bain combined for 22 of the Hurricanes' 50 sacks as a team this year, and while they return some key players like Moten and linebacker Mohamed Toure, it'll be difficult to fill those shoes on the edge. Jason Taylor has done an unbelievable job as their defensive line coach, helping Bain and Mesidor become first round talents, and now he'll look to develop the next star pass rushers at Miami. \nWhile those of us outside Miami's facility may be a bit skeptical they can simply replace that kind of talent, Bain certainly is a believer in his now-former teammates to pick up the torch and keep Miami in the title conversation. If he's right about the defensive line being somehow better than this year's special group, the Hurricanes ought to be at the top of the ACC and back in the Playoff again. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami's Rueben Bain Jr. explains why defense 'might be better' in 2026 without him - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/609a2119-c31b-43da-b317-a6811713bf91/thumbnail/1200x675/82185e3c1ea53528d93fb439efbfe929/bain.jpg"
      ],
      "datePublished": "2026-01-26T20:44:04.000Z",
      "dateModified": "2026-01-26T20:44:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Super Bowl: Ten crazy facts about the Patriots-Seahawks matchup - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-facts-patriots-vs-seahawks-matchup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/ba2b21f1-1b04-4c0e-8f02-55316729c0c0/thumbnail/1200x675/bf426dd3d3988630aeaf5ccfd4ee76f9/sb.jpg",
    "tag": "Sports",
    "date": "2026-01-26T21:09:08.000Z",
    "description": "\n        Our Super Bowl matchup is set, as the New England Patriots will play the Seattle Seahawks at Levi's Stadium on Feb. 8. The Patriots defeated ",
    "body": "\n        Our Super Bowl matchup is set, as the New England Patriots will play the Seattle Seahawks at Levi's Stadium on Feb. 8. The Patriots defeated the Denver Broncos in the AFC Championship Game during a blizzard, 10-7, while the Seahawks outlasted Matthew Stafford and the Los Angeles Rams, 31-27. This will be a rematch of Super Bowl XLIX back in 2015 when the Patriots defeated the Seahawks, 28-24, after Malcolm Butler intercepted Russell Wilson at the 1-yard line with 20 seconds remaining in the fourth quarter. Tom Brady threw for 328 yards, four touchdowns and two interceptions in that matchup, while Marshawn Lynch rushed for 102 yards and one touchdown. Too bad he didn't get the ball when he should have!Patriots vs. Seahawks feels like an appropriate matchup to end what has been a wonky, unpredictable season. Below, we will examine 10 crazy facts about Super Bowl LX, courtesy of CBS Sports Research. \n        \n            \n                Why an NFL graphic from Week 1 is sparking Super Bowl conspiracy theories after wins by Seahawks and Patriots\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \n1. Super Bowl rematches usually favor the original victorPatriots vs. Seahawks will be the 10th Super Bowl rematch in NFL history. The winner of the first meeting is 6-3 in the second meeting, but keep in mind that the Philadelphia Eagles got their Super Bowl revenge on the Kansas City Chiefs just last year.\n2. The Patriots are the most improved team in NFL history (including playoffs)If someone told you they knew the Patriots would be in the Super Bowl before the start of this year, they're lying. New England finished 4-13 in 2024, and fired Jerod Mayo for Mike Vrabel. That was clearly a good decision, as the Patriots just surpassed the 1999 Rams in being the most improved team in NFL history. The Pats went from 4-13 to 17-3 -- a difference of 13 wins including playoffs! The Patriots are also the first team to reach the Super Bowl after a 13-loss season. 3. This is the first Super Bowl matchup since 1981 between teams who had preseason Super Bowl odds of 50-1 or longerNo one expected the Patriots to make the Super Bowl this year, but the same could be said about the Seahawks. After a 10-7 season last year, Seattle made the decision to trade quarterback Geno Smith to the Las Vegas Raiders, DK Metcalf to the Pittsburgh Steelers, and release Tyler Lockett. The Seahawks replaced Smith with Sam Darnold, who was coming off a career year with the Minnesota Vikings. There were questions about if he was going to be able to elevate the Seahawks in the most competitive division in the NFL. He certainly did. 4. This will be the first Super Bowl since the 1970 NFL-AFL merger between teams that both ranked top four in scoring offense and scoring defenseWhile this Super Bowl matchup is surprising, the Patriots and Seahawks were undoubtedly two of the best teams in the NFL this season.\n5. This will be the first Super Bowl matchup to ever feature two starting quarterbacks and two head coaches who are in their first or second seasons with their teamsDarnold is in his first season with the Seahawks and Vrabel is in his first season as the Patriots head coach. Maye and Mike Macdonald are in their second seasons with their respective franchises. 6. This could be the third time in the past six years a QB wins a Super Bowl in their first season after joining a teamIt sounds counterintuitive, but apparently riding the quarterback carousel pays immediate dividends. If Darnold wins the Super Bowl, he will be the third quarterback in the past six seasons to win a ring in his first year with a new team. Brady did it in 2020, and Stafford accomplished this in 2021. Before them, this had previously happened just twice in NFL history. 7. Drake Maye will be the second-youngest QB to start a Super BowlIt feels just like yesterday when the Patriots selected the former North Carolina quarterback No. 3 overall in the 2024 NFL Draft. Now, he's on the doorstep of returning the Patriots to glory. Maye will become the second-youngest quarterback to start a Super Bowl, behind Dan Marino. He can surpass Ben Roethlisberger as the youngest quarterback to win a Super Bowl. Maye can also become the first quarterback to win a Super Bowl in the season of his first playoff start since ... Tom Brady. \n8. Mike Vrabel is the second person ever to reach a Super Bowl as a player and a head coach with the same franchisePatriots legend Mike Vrabel joins Gary Kubiak in being the second person to ever reach a Super Bowl as a player and a coach with the same team. He can become the first to win a Super Bowl as a player and head coach with the same franchise. Vrabel played linebacker for the Patriots for eight seasons and won three Super Bowls.9. Mike Macdonald is the third-youngest head coach to make his first Super Bowl appearanceMacdonald (38 years, 213 days) is the third-youngest head coach to make his first Super Bowl appearance behind Sean McVay and Mike Tomlin. 10. Patriots have allowed the fewest points through three playoff games since 2000The Seahawks finished the regular season with the No. 1 scoring defense, allowing 17.2 points per game, but the Patriots' defense this postseason has been historic. The 26 total points New England has allowed through three playoff games are the fewest since the 2000 Baltimore Ravens! Sure, the Patriots had the help of some weather and a backup quarterback in the AFC Championship Game, but this defense suffocated legitimate starting quarterbacks like Justin Herbert and C.J. Stroud. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Super Bowl: Ten crazy facts about the Patriots-Seahawks matchup - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/ba2b21f1-1b04-4c0e-8f02-55316729c0c0/thumbnail/1200x675/bf426dd3d3988630aeaf5ccfd4ee76f9/sb.jpg"
      ],
      "datePublished": "2026-01-26T21:09:08.000Z",
      "dateModified": "2026-01-26T21:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25: Duke, Nebraska earn boosts in latest college basketball rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ap-top-25-college-basketball-rankings-duke-nebraska-purdue/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/466d0b93-8a52-4dcc-bbec-7377c86d3ccb/thumbnail/1200x675/74f18db8ab25fd163ab18904ffb289d6/untitled-design-176.png",
    "tag": "Sports",
    "date": "2026-01-26T18:07:38.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The  AP Top 25 released its final poll before the ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The  AP Top 25 released its final poll before the calendar flips to February, and movement within the top 10 stands out after a wild hoops weekend. One thing that didn't change, however, was the top team in the poll. Arizona received all 60 first-place votes for the second consecutive week and checked in at No. 1. The Wildcats have now occupied the top spot for eight weeks and counting.Duke moved up one spot to No. 4 after defeating Wake Forest, 90-69. The Blue Devils won seven consecutive games ahead of a marquee matchup against Louisville today at Cameron Indoor Stadium. Duke is the only team in the ACC that hasn't lost a game in conference play.\n        \n            \n                College basketball rankings: No. 1 Arizona goes on the road to face BYU and AJ Dybantsa in Big 12 showdown\n                \n                    Gary Parrish                \n            \n                            \n    \n                \n                    \n    \nPurdue dropped eight spots to No. 12 after going 0-2 last week with losses against UCLA and Illinois. The Boilermakers lost on the road after UCLA star Tyler Bilodeau knocked down a go-ahead 3-pointer with eight seconds remaining. Purdue also lost to Illinois 88-82 after Keaton Wagler scored 46 points on the road.\nSpeaking of the Big Ten, one of three unbeaten teams remaining in Division I basketball this week is Nebraska. The Huskers moved to No. 5 in the poll after improving to 20-0 (9-0 Big Ten) with a win over Minnesota. Nebraska's biggest test of the season will come tomorrow at Michigan.AP Top 251. Arizona (61)2. UConn3. Michigan4. Duke5. Nebraska6. Gonzaga7. Michigan State8. Iowa State9. Illinois10. Houston11. Texas Tech12. Purdue13. BYU14. Kansas15. Arkansas16. North Carolina17. Virginia18. Vanderbilt19. Florida20. Louisville21. Saint Louis22. Clemson23. Alabama24. Miami University25. St. John's\nOthers receiving votes: Tennessee 88, Kentucky 51, Georgia 49, Iowa 30, Texas A&M 27, Auburn 15, NC State 8, SMU 4, Saint Mary's 3, Utah State 2, Villanova 2, Wisconsin 1.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25: Duke, Nebraska earn boosts in latest college basketball rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/466d0b93-8a52-4dcc-bbec-7377c86d3ccb/thumbnail/1200x675/74f18db8ab25fd163ab18904ffb289d6/untitled-design-176.png"
      ],
      "datePublished": "2026-01-26T18:07:38.000Z",
      "dateModified": "2026-01-26T18:07:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks-Rams in Australia? Seattle pushes for NFL's first game Down Under in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-rams-australia-nfl-first-game-down-under-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/3ab08527-af4d-4886-85d3-9b15ec319e5a/thumbnail/1200x675/c96a627df36e6df61ce5ba4c65ec4b2a/sam-darnold.jpg",
    "tag": "Sports",
    "date": "2026-01-26T19:31:40.000Z",
    "description": "\n        The Seattle Seahawks and Los Angeles Rams have one of the best rivalries going in the NFL, and soon, they could be taking that rivalry Down U",
    "body": "\n        The Seattle Seahawks and Los Angeles Rams have one of the best rivalries going in the NFL, and soon, they could be taking that rivalry Down Under.The Rams will play the NFL's first-ever game in Australia next season, and although the opponent hasn't been announced, it seems the Seahawks have volunteered for the job. During an interview with the Herald Sun in Australia that took place in late October, the Seahawks' director of international, Isabelle Van Coevorden, made it clear her team was interested in facing the Rams at the iconic Melbourne Cricket Ground (MCG).\"We would love to,\" she said.Van Coevorden also hinted that the Seahawks have made a direct request with the NFL in hopes of being sent to Australia.\"It's something that we're waiting to hear back from the league. The NFL hasn't announced who their opponent will be,\" Van Coevorden said.\nHer comments were given exclusively to an Australian newspaper, which is likely why they flew under the radar.\n        \n            \n                Super Bowl 2026: Five reasons why Seahawks won NFC to reach big game, including historic rebuild\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nThe NFL still hasn't announced who the Rams will be playing, but the Seahawks would certainly be an attractive option. Due to the extensive travel involved, sending another West Coast team would make the most sense. The flight time from Los Angeles to Melbourne is almost 16 hours, but a team flying from the East Coast would be looking at well over 20 hours of travel time.With the Rams serving as the designated team, that means their opponent will be one of the nine teams they're scheduled to play at home in 2026: the Cardinals, 49ers, Seahawks, Giants, Packers, Cowboys, Chiefs, Chargers and Bills.\nOut of that group, the 49ers, Seahawks, Cardinals and Chargers are all in the Pacific Time Zone. (The Cardinals are technically on Mountain Standard Time, but Phoenix aligns with Pacific time during daylight saving time.)The NFL has hinted that the game is going to be played in Week 1. Due to the lengthy flight and extreme time difference between the United States and Australia, the league wants to make sure both teams have enough time to get ready for their Week 2 game, so the plan would be to play the Week 1 Australia game early in the week.During an interview back in April, the NFL's vice president of broadcast planning, Mike North, revealed that a Wednesday game is one of the possibilities being considered.\n\"I suspect it will probably be early in the week, more like a Thursday, maybe even a Wednesday. That's a possibility that we've discussed,\" North said.Australia has a 14-hour time difference with the Eastern Time Zone, which would certainly create logistical issues for the NFL. For a Wednesday night game to happen, it would have to kick off at 10:15 a.m. Thursday in Melbourne, which would create an 8:15 p.m. ET kickoff on Wednesday night in the United States (and 5:15 p.m. PT on the West Coast).One thing that could throw a wrench into Seattle's hopes of playing in Australia is the fact that the Seahawks are in the Super Bowl. The winner of the Super Bowl generally hosts the Thursday night opener the following season, so if Seattle beats the Patriots, the Seahawks could be scheduled for that game. However, the NFL could still send the Seahawks to Australia and have them host a prime-time game in Week 2. If they're sent to Australia, the Seahawks would still play in the first game of the season -- it would just be in Melbourne.\nAnd let's not forget, if the Rams had won the Super Bowl, they were still going to be playing in Australia next season. The NFL knew there was a chance the Super Bowl champ could open the season Down Under, which is why the Seahawks could conceivably still be sent, even if they beat the Patriots.\"If we do play a game, you will see a lot of Seahawks lead-up and around the game, and if we don't, we will definitely still activate and bring the energy of the Seahawks over to Melbourne,\" Van Coevorden said.It's certainly possible the NFL is waiting to see what happens in the Super Bowl before finalizing whether the Seahawks will be sent to Australia.\nSeattle has been making a strong push to promote the team Down Under. The Seahawks, who were granted marketing rights to Australia and New Zealand in March, sent a contingent to Melbourne in October. The Seahawks even paid for some team legends, the Seahawks Dancers and their mascot to take part in a watch party in Melbourne for their Week 9 game against the Commanders, a game Seattle won 38-14.Van Coevorden thinks a Seahawks-Rams game would be the perfect way to kick things off in Australia.\"I think it's a great matchup and a great first game in Australia,\" she said. \"So, we're really keen on hearing more and our fingers are crossed for sure.\"\nThe Rams and Seahawks faced each other three times during the season, with Seattle winning twice, including Sunday's 31-27 victory in the NFC Championship Game. The 2025 series marked just the third time over the past 75 years that two division rivals played three games in a single season that were all decided by four points or less.The NFL usually tries to avoid sending divisional matchups abroad, but the league softened that stance last year when it sent the Chiefs and Chargers to Brazil. With the Seahawks essentially volunteering for the Australia game, the league could have an easy decision to make -- as long as the Rams are OK losing a home game against a divisional opponent.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks-Rams in Australia? Seattle pushes for NFL's first game Down Under in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/3ab08527-af4d-4886-85d3-9b15ec319e5a/thumbnail/1200x675/c96a627df36e6df61ce5ba4c65ec4b2a/sam-darnold.jpg"
      ],
      "datePublished": "2026-01-26T19:31:40.000Z",
      "dateModified": "2026-01-26T19:31:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Footy Fix: USWNT returns to action after Trinity Rodman kicked off 2026 in style - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-uswnt-returns-to-action-after-trinity-rodman-kicked-off-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/34a2c841-4e7c-4ec0-86a2-dc65c4745fde/thumbnail/1200x675/771653c9c095299d063c39a2ecaf7eaa/untitled-design-2026-01-26t182408-756.png",
    "tag": "Sports",
    "date": "2026-01-26T18:15:23.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Hello! A manic finish to the UEFA Champions League",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Hello! A manic finish to the UEFA Champions League's league phase may be the headlining act of the week but while the wait continues, there is much to discuss after some notable results in the U.S. and England. I'm Pardeep Cattry with the latest.📺 Footy fixAll times U.S./EasternMonday, Jan. 26🏴󠁧󠁢󠁥󠁮󠁧󠁿 EPL: Everton vs. Leeds United, 3 p.m. ➡️ USA Network🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Norwich City vs. Coventry City, 3 p.m. ➡️ Paramount+, CBS Sports Golazo NetworkTuesday, Jan. 27🇮🇹 Coppa Italia: Fiorentina vs. Como, 3 p.m. ➡️ Paramount+, CBS Sports Golazo Network🌎 Friendly: USWNT vs. Chile, 10 p.m. ➡️ TBS18 Matches. All At Once\n                                                                    Paramount+\n                                                            📺 What We're WatchingWhat's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Footy Fix: USWNT returns to action after Trinity Rodman kicked off 2026 in style - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/34a2c841-4e7c-4ec0-86a2-dc65c4745fde/thumbnail/1200x675/771653c9c095299d063c39a2ecaf7eaa/untitled-design-2026-01-26t182408-756.png"
      ],
      "datePublished": "2026-01-26T18:15:23.000Z",
      "dateModified": "2026-01-26T18:15:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA trade rumors: Latest Giannis buzz after injury, possible agent drama - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-trade-rumors-latest-giannis-antetokounmpo-buzz-injury-news/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/eccf4fe3-cae0-4c66-8d63-3e61567e646e/thumbnail/1200x675/3349a642787f8424de152f0f89f20d22/giannis.jpg",
    "tag": "Sports",
    "date": "2026-01-26T17:50:17.000Z",
    "description": "\n        The NBA's Feb. 5 trade deadline is just 10 days away, and even with a number of teams clearly interested in upgrades ahead of the second half",
    "body": "\n        The NBA's Feb. 5 trade deadline is just 10 days away, and even with a number of teams clearly interested in upgrades ahead of the second half of the season, the market continues to be stuck at a standstill. That's because Giannis Antetokounmpo's future in Milwaukee remains uncertain, and no team wants to give up anything that could get them in the Giannis sweepstakes before getting a firm answer on his availability. As a result, we still have seen just one trade this season -- Trae Young getting sent from Atlanta to Washington for C.J. McCollum and Corey Kispert. At some point teams will have to start making moves with an eye on this year's postseason push, but it could be a quieter than usual deadline because even if the Bucks hold on to Giannis through this season, the pursuit of the All-NBA forward will pick back up in June around the NBA Draft. So, where do things stand on the ol' NBA rumor mill with the trade deadline rapidly approaching? Giannis remains at the forefront of every conversation, despite his latest calf injury, while the two middling teams appear set to be among the league's most active teams at the deadline. Latest after Giannis injury, possible agent dramaWhen Antetokounmpo went down with his latest calf injury that he expected to cost him 4-6 weeks -- which would put him out through the trade deadline and All-Star break -- there was a wonder of how it might impact his market. The answer, according to Marc Stein, is apparently none. \nTeams are still pursuing Giannis aggressively and hope the Bucks will change their stance on trading the star before Feb. 5. That shouldn't come as much of a surprise, because acquiring Antetokounmpo would be a play for long-term postseason relevance by any team trading for him, not the immediate impact he could have in February. Until the Bucks make up their mind on whether they'll trade Antetokounmpo prior to the deadline, teams will continue circling back to Milwaukee with calls and check-ins in hopes that the Bucks finally open the lines to actual negotiations. What makes Giannis holding up the market particularly fascinating is that we've seen what these superstar trade negotiations look like, and it's almost never a matter of truly opening things up to the best offer. The Bucks, if they trade Antetokounmpo, will likely work with him to identify a handful of preferred destinations and then work with those teams to try and get the best offer. That doesn't stop the rest of the league from dreaming right now, but it'd be shocking if when the time does come, more than a handful of teams are actually in the mix for his services. \nAdding to the drama surrounding Giannis is a report from TrueHoop's Henry Abbott that Antetokounmpo has considered changing agents amid this saga. Abbott reports Giannis came close to firing his longtime agent Alex Saratsis, who has represented him since he was in Greece, after failing to find a trade for him. That's a notable report for a few reasons, one being Giannis seems intent on getting traded without having to demand a trade. It's the latest evidence that, while everyone outside knows it's eventually coming, neither Giannis nor the Bucks are willing to be the ones to pull the plug first on their relationship and the result is a staring contest that neither is happy to be part of. Beyond that, if Giannis were to explore finding another agent, every agency would have interest. Abbott points to Klutch Sports mega-agent Rich Paul as the agent with the potential to poach Giannis away with promises of being able to steer him where he wants to go. \nWhile that may not happen before the trade deadline, it adds an additional layer of drama to the situation. It would be somewhat fitting if Antetokounmpo, after preaching loyalty for so long, not only departed the Bucks but did so with the assistance of a new agent. Kings, Bulls both expected to be active at the deadlineThe Kings and Bulls have become viewed as cosmic brethren of sorts in the NBA -- two franchises trapped on the dreaded treadmill of mediocrity -- who have only grown closer since the Zach LaVine trade. It's fitting then that they are two of the teams expected to be the most active at the deadline, whenever other teams stop daydreaming of Giannis and start getting down to business. Per Stein's latest reporting, Kings guard Keon Ellis is known to be drawing ample interest and a trade involving him is viewed as an \"inevitability.\" The real question is whether the Kings will get the first round pick in return that they're asking for currently. \nAs for the Bulls, Coby White and Ayo Dosunmu are both names garnering buzz on the market, as the Bulls look to solidify their core group for the future and clarify their rotations. For both teams, they may have to wait until deadline week itself for activity on the market to really ramp up. In the meantime, the league will wait with baited breath to find out if the Bucks will truly open up the Antetokounmpo sweepstakes. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA trade rumors: Latest Giannis buzz after injury, possible agent drama - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/eccf4fe3-cae0-4c66-8d63-3e61567e646e/thumbnail/1200x675/3349a642787f8424de152f0f89f20d22/giannis.jpg"
      ],
      "datePublished": "2026-01-26T17:50:17.000Z",
      "dateModified": "2026-01-26T17:50:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Hater Report: Stephen Curry is suffering from the ego of a sequel-obsessed owner - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-hater-report-stephen-curry-joe-lacob-warriors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/8121eea6-2b80-4396-92b3-533225c1c396/thumbnail/1200x675/d6b8f0cccc3b55b17c7fda0a15aa3a9a/lacob-curry-imagn.png",
    "tag": "Sports",
    "date": "2026-01-26T21:53:25.000Z",
    "description": "\n        Some Golden State Warriors fans can be funny. They go from rooting for one of the worst organizations in basketball to a full-on dynasty and ",
    "body": "\n        Some Golden State Warriors fans can be funny. They go from rooting for one of the worst organizations in basketball to a full-on dynasty and still their greatest joy in life seems to be tweeting about how dumb the people in charge are. Among their many gripes ...They've botched the development of young players.They've allowed Draymond Green to get away with murder. Steve Kerr has become micro-ball obsessed. The two-timeline plan is an ongoing debacle.They all but refuse to trade any draft capital. And the chief complaint, as a result of all this, is of course that the Warriors are wasting what is left of Stephen Curry's championship equity. Rather than pushing all in for a guy who clearly remains capable of captaining an honest contender, they're seemingly content to sit back and wait for him to die on the superstar vine. \n        \n            \n                Stephen Curry's championship window with the Warriors has probably closed, one way or another\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nFull disclosure: I'm a Warriors fan. Grew up on Run TMC. Fell back in love with We Believe. I have levied every one of these critiques at one point or another, often in the form of firing remotes off the wall, and in most every case, once I'm removed from the throes of competitive passion, I can admit to how stupid and spoiled I sound. Four titles is three more than any Warriors fan could've ever dreamed of. All good things end. But when people become this invested in a story, they care about the way it ends. And when it ends. The latter can be a thin needle to thread. Call it quits too late and you risk ending up like the Bucks. They should've traded Giannis a year ago. Maybe even two. But, instead, in an act of sheer desperation, they paid Damian Lillard $113 million to go back to Portland so they could give another $100 million to Myles Turner in an effort to extend a story that was clearly over. \nThe Warriors have done the opposite. They've spent the last half decade prioritizing post-Steph plans largely at the behest of Joe Lacob, the venture-capitalist owner who likes to see himself as the author of this whole thing and is desperate to prove himself capable of writing an equally successful sequel. \"I'm going to go out on a limb and say that 80% of [everything the Warriors have achieved] is [because of] Steph Curry,\" Andre Iguodala has posited. \"I know Joe doesn't like when I say it that way, but it's the truth.\"Joe doesn't like it when I say it that way. In other words, Joe wants credit. And he knows anything that happens while Curry is still on his team is going to be credited, rightfully, to Curry. It smells of the late Bulls GM Jerry Krause saying: \"Players and coaches alone don't win championships, organizations do.\" \nIt's true, good organizations matter, if only because bad organizations can screw up great players. But let's not get it twisted: the Bulls were a dynasty because they had Michael Jordan, and Krause didn't like that sentiment. He wanted to believe the Bulls, this great organization, could win after Jordan, too. They haven't come close. Lacob wants his story -- not the Warriors' story, but his story -- to end differently. And so, while Curry was busy winning another championship in 2022, Lacob had already set about casting new characters for his little \"Light Years\" script two years earlier. From Logan Murdock of The Ringer:In recent years, Lacob's grip on basketball decisions has clouded Golden State's future around Curry. In 2020, he grew enamored of James Wiseman after a predraft workout, pushing the team to draft the 6-foot-11 center instead of flipping the no. 2 pick for an established player. The following year, [Lacob] pushed his front office to draft Jonathan Kuminga over Trey Murphy III, whom many on the staff pushed for, seeing the 18-year-old as a potential star who could both help Curry in the short term and then fill the seats of Chase Center long after Curry was gone. This is the problem when rich owners get close enough to the cool kids: they think they can be one of them. Jimmy Johnson walked away from a Cowboys dynasty because Jerry Jones wanted to play GM, and now the Cowboys are the only NFC team who hasn't qualified for a single conference championship in the last 30 years. The lesson? Stay in your lane. Sign the checks. Let the basketball people make the basketball decisions. But no, Lacob thinks he's an NBA scout now. Give Curry an established player for the Wiseman pick and Murphy III over Kuminga and there's a good chance he has five titles by now with time to still catch Jordan's six. That's why fans are mad. Because unlike Giannis and the Bucks, the Curry story should not be ending yet. The Warriors had all the ammo to continue arming him with a top-shelf roster, but Lacob doesn't want to fire any of his post-Steph bullets. The only reason they traded for Jimmy Butler was because it didn't cost them any future draft picks, as the future is where Lacob plans to shine. \nThe funny thing is, Lacob thinks he's just going to find his next franchise player in the draft when, in fact, those players hardly exist in the first place, and even when they do, the Warriors have no recent history to indicate they are even capable of identifying who they are. 2021: The Warriors don't just take Kuminga over Murphy III, they take him over Franz Wagner. And then, with a chance at a re-do seven picks later, they take Moses Moody at No. 14 when Murphy III was still on the board, as were Alperen Sengun and Jalen Johnson, both of whom have become All-Stars. 2020: The Warriors can draft anyone not named Anthony Edwards. That list includes, among many others, LaMelo Ball, Tyrese Haliburton, Tyrese Maxey, Devin Vassell and Deni Avdija. But Lacob watches a Wiseman workout and thinks he's just found the next David Robinson. 2018: The Warriors draft Jacob Evans, whose NBA career lasts less than two full seasons, five picks before Jalen Brunson. Of course, everyone knows the draft is a crapshoot even when experienced basketball minds are making the calls. Which is to say, it's not so much that the Warriors whiffed on these draft picks (a lot of other teams did, too), it's that when it became apparent that they had missed they waited too long to admit their mistakes. That's because, in large part, they were Lacob's mistakes. That's almost certainly why this Kuminga saga has gone on this long. That was Lacob's baby. Him and Wiseman. To sell early on those guys would've been a hit straight to Lacob's ego, which is determined to keep a post-Steph renaissance in play. \nThat's the impetus of the two timelines when the reality is, whenever Curry is actually done, the Warriors will have max money and a premium franchise brand to go sign their next superstar or two. It's not to suggest they should do anything desperate. Even Curry has said that publicly. He believes superstars have an obligation to leave their franchise in good competitive standing rather than demand the type of cupboard cleanings that LeBron James is known for. That's commendable. But that doesn't mean Lacob doesn't have and hasn't long had, his priorities backward. Curry should be the focus. He's the reason for all this. The four championships. Your $10 billion franchise. And he remains a world-class player the likes of which you will never stumble into again in your life, even as, in 2017, Lacob reportedly had to be talked about of low-balling Curry on his next contract. From Marcus Thompson II:\nWarriors owner Joe Lacob was considering offering Curry a contract below the max, even though Curry has been one of the most underpaid players in all of sports over the last three seasons. Warriors general manager Bob Myers kept Lacob from bringing a reduced offer to the negotiating table, but it was enough of a thing that Myers reassured Curry of the franchise's commitment.Seriously. That was a real thing. Joe Lacob didn't want to offer Stephen Freaking Curry a max contract in 2017. On some level, he has always believed this to be his story. \"[Owners] really do be thinking it's them [responsible for the championships] and not us [the players]. Joe, too,\" Iguodala has said. \"They think they're going to build another [championship team] right after us…they think it's like 'oh we about to do it again'… We gotta wait six years to come be like I told you.\"Lacob might not realize the \"I told you\" moment is coming, but it is. Only because Curry is so great were the Warriors able to add that accidental 2022 championship banner to the rafters. By that point, Lacob figured it would be Wiseman and Kuminga starring in his show. Meanwhile, it's still Curry. It's always been Curry. And Lacob's desire for recognition notwithstanding, it will always be Curry until he's officially done, at which point Lacob will long for these moments he should've been more focused on maximizing. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Hater Report: Stephen Curry is suffering from the ego of a sequel-obsessed owner - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/8121eea6-2b80-4396-92b3-533225c1c396/thumbnail/1200x675/d6b8f0cccc3b55b17c7fda0a15aa3a9a/lacob-curry-imagn.png"
      ],
      "datePublished": "2026-01-26T21:53:25.000Z",
      "dateModified": "2026-01-26T21:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl 60: Patriots vs. Seahawks game preview, odds, picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/super-bowl-60-betting-preview-seahawks-vs-patriots-odds-picks-best-bets-for-feb-8-title-showdown/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/31df5267-21c9-4d3e-921b-f0764c17fe68/thumbnail/1200x675/95e16137adb8315c3bf6df32a3d57b90/walker.jpg",
    "tag": "Sports",
    "date": "2026-01-26T19:44:11.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    Here's everything bettors need to know for Super Bowl 2026 between the Patriots and Seahawks in Santa Clara, Calif. on Feb. 8\n        \n                            \n    Jan 26, 2026\n                            \n                    at\n    2:44 pm ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \nIt will be a title game rematch 11 years in the making when the Seattle Seahawks and New England Patriots square off at Levi's Stadium on Feb. 8 in Super Bowl 60. The Patriots will be seeking their seventh Super Bowl title in their 12th trip to the big game, and Seattle is after its second victory in its fourth attempt. New England's fourth championship came at the expense of the Seahawks following the 2014 season when Malcolm Butler intercepted a Russell Wilson pass in the end zone with 20 seconds left to seal a 28-24 victory in Super Bowl 49. MVP candidate Drake Maye will lead the Patriots as they come off a 10-7 AFC Championship Game victory against the Denver Broncos in brutal winter conditions. Sam Darnold will guide the Seahawks, who won a 31-27 thriller over their division rivals, the Los Angeles Rams, in the NFC title game. Both defenses are in peak form but with the elements not expected to be a major factor, the offenses won't be taking a back seat in Super Bowl 60.Here's everything fans and bettors need to know for Super Bowl 60 between the Patriots and Seahawks, including the latest odds, model picks, injury reports and weather conditions. All odds are from DraftKings.Seahawks vs. Patriots (Feb. 8, 6:30 p.m. ET)Levi's Stadium; Santa Clara Calif.\nSpread: Seahawks -4.5Money line: Seahawks -230, Patriots +190Total: 46.5 (Over -105, Under -115)The Seahawks (16-3) are one of the best teams in the league on both sides of the ball. They also are battle tested, coming out of an NFC West that produced three of conference's final four teams in the playoffs. Seattle had to beat both of the others to get here, and the third showdown of the season with the Rams was no picnic. Darnold had one the best days of his eight-year career, throwing for 346 yards and three touchdowns, but  L.A. put up 479 yards and it was touch-and-go for Seattle until the end. A muffed punt by the Rams in the third quarter was a huge turning point. The Patriots have simply been winning, and when the storm blew in Sunday at Mile High, it seemed like anything could happen. But the defense held and the Patriots are back in the Super Bowl for the first time since Tom Brady and Bill Belichick led them to a sixth title after the 2018 season.Both teams have been excellent against the spread this season, with Seattle going 14-5 and covering in six of their past eight and the Patriots going 14-6. New England's three-point victory as a 3.5-point favorite snapped a five-game ATS cover streak. Both sides also have been strong to the Over, with Seattle 11-8 and New England 12-8 to the Over. However, the SportsLine Projection model has Under 46.5 hitting in 59% of its simulations. That get a \"B\" grade from the model, and so does New England on the money line, as they are winning in 39% of simulations, offering good value at those odds. Each team is covering in 50% of the model's simulations.  Bet on the Patriots to defeat the Seahawks in the Super Bowl for a strong plus-money payout at DraftKings, where new users can get $300 in bonus bets if their first bet of $5 or more wins:\nSunday's game in Denver turned ugly in a hurry and New England was fortunate to get out with the victory, as the kickers missed two field goals apiece in the slushy conditions. The Patriots' 206-yard total against the Broncos can be chalked up to the weather, but the offense wasn't moving much in the sunshine before halftime either. Maye and Co. haven't been terribly impressive in the playoffs overall. The quarterback threw for 268 yards against the Chargers, but the Pats scored just 16 points, and the 28-16 victory against the Texans was helped immensely by the defense forcing turnovers. Maye has had his own issues protecting the ball, and that won't fly against the Seahawks. They are plus-4 in turnover margin in these playoffs and haven't given the ball away once in the two games. The Patriots are plus-3 and have eight takeaways, including four interceptions against Houston. New England had the second-best scoring offense in the NFL in the regular season, averaging 28.8 points, and Seattle was third at 28.4. On the other side, the Seahawks allowed the fewest points in the NFL (17.2) and the Patriots were fourth (18.8).   Darnold was a surprise addition to the injury report before Seattle's 41-6 victory against 49ers with an oblique injury, but he played in that game and showed no ill effects on Sunday against the Rams. He has four touchdown passes and no interceptions and has been sacked five times over the two playoff games. Maye has been sacked five times in each of his team's postseason games. The Seahawks also lost touchdown machine Zach Charbonnet for the season when the running back tore an ACL against the 49ers. Kenneth Walker III has 256 total yards and four TDs over the two games, and George Holani had 27 receiving yards out of the backfield Sunday. The Seattle offensive line is getting healthier, with starting left tackle Charles Cross (foot) and backup Josh Jones (knee) returning for the Seahawks' victory in the NFC Championship Game. Reserve lineman Amari Kight (knee) was still out, but the time off will give injured players a chance to heal. The Seahawks also hope linebacker Drake Thomas will be back after he went down late Sunday with a shoulder injury and didn't return. The Patriots lost linebacker Robert Spillane to an ankle injury in Sunday's game, but he said he expects to be ready for the Super Bowl. Jack Gibbens, who had 81 tackles and played in all 17 games this season, took Spillane's place Sunday.                      The rest of the playoff teams could only dream of California, where the temperatures should be milder for Super Bowl 60 than we've see throughout these playoffs. The high temperatures in the Bay area in early February are in the mid- to high-60's and the lows are around 50 degrees. The forecast calls for temperatures in the low 50's at kickoff on Feb. 8, with partly cloudy skies and a chance of some light wind.   Bet on the Under in Super Bowl 60 between the Seahawks and Patriots at DraftKings:\n            \n    \n\n        \n    \n                                            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl 60: Patriots vs. Seahawks game preview, odds, picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/31df5267-21c9-4d3e-921b-f0764c17fe68/thumbnail/1200x675/95e16137adb8315c3bf6df32a3d57b90/walker.jpg"
      ],
      "datePublished": "2026-01-26T19:44:11.000Z",
      "dateModified": "2026-01-26T19:44:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Arizona-BYU, Louisville-Duke, NBA  and more on Monday, Jan. 26 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-no-1-arizona-at-byu-duke-hosts-louisville-nba-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/a6c3ee04-fa62-435c-a4ce-55b6932561ff/thumbnail/1200x675/fcd3cfc83720baa6535c0261284a401d/aj-dybantsa-byu-cougars.jpg",
    "tag": "Sports",
    "date": "2026-01-26T20:30:42.000Z",
    "description": "\nThe No. 1 team in the country faces the potential No. 1 overall pick in the NBA Draft.Few, if any, college basketball games this season will have the",
    "body": "\nThe No. 1 team in the country faces the potential No. 1 overall pick in the NBA Draft.Few, if any, college basketball games this season will have the intrigue of Monday night's showdown between the top-ranked Arizona Wildcats and the AJ Dybantsa-led BYU Cougars at the Marriott Center in Provo, Utah. The Wildcats (20-0) are one of three undefeated teams in the country and have five wins against Top 25 teams this season. Meanwhile, the athletic 6-foot-9 Dybantsa ranks second in the nation in scoring (23.6 points per game) and is coming off a 43-point mic drop effort in Saturday's 91-78 victory over Utah.In addition, the Cougars (17-2) will be looking for just the second win over a No. 1-ranked team in program history.Arizona is a slim 1.5-point favorite over BYU on Monday.While Wildcats vs. Cougars is the marquee attraction on Monday, there are other options on a sporting landscape that includes seven NBA games and a full college basketball schedule. Below is a snapshot of what to watch and bet for Monday, Jan. 26. All times Eastern.College basketball best bets, where to watchNo. 20 Louisville at No. 4 DukeTime: 7 p.m. | Location: Durham, N.C. | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Duke -8.5\nAs sensational as Dybantsa has been this season, the current favorite to earn the national Player of the Year award is Duke's Cameron Boozer, who is -475 at DraftKings to win the award to Dybantsa's +600. The son of Blue Devils legend Carlos Boozer leads the country in scoring (23.7 points per game), just ahead of Dybantsa, and ranks third in the ACC in rebounding (9.9 per game). When these teams last met on Jan. 6 Boozer had 27 points on 10-of-12 shooting, eight rebounds and four assists. The Blue Devils won that game 84-73 after trailing by nine points at halftime. The SportsLine Projection Model, which simulates every college basketball game 10,000 times, says Duke has a 52% chance to cover and assigns a \"C\" grade to Blue Devils -8.5.No. 1 Arizona at No. 13 BYUTime: 9 p.m. | Location: Provo, Utah | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: BYU +1.5\nThe Marriott Center doesn't get enough credit as one of the toughest road environments in college basketball. The Cougars have won 13 in a row at home, which includes 11 wins this season. Dybantsa, Richie Saunders (18.8 points per game) and Robert Wright III (18.0) give BYU arguably the best scoring trio in the country. They combine to account for 69.6% of the Cougars' points this season. The SportsLine Projection Model says BYU has a 63% chance to cover and gives a \"B\" grade to BYU +1.5.NBA best bets, where to watchMagic at CavaliersTime: 7 p.m. | Location: Cleveland | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Cavaliers -6.5\nCleveland may be starting to turn its season around. The No. 1 team in the Eastern Conference last season, the Cavaliers (27-20) have won five of their last six and are seven games over .500 for the first time this season. Just two nights ago Cleveland beat this same Magic team in Orlando, 119-105, despite the game being the second half of a back-to-back. One of the main reasons for the Cavaliers' turnaround is Donovan Mitchell, who has scored 69 points over the last two games, including 36 on Saturday. The SportsLine Projection Model says Cleveland has a 67% chance to cover and assigns a \"B\" grade to Cavaliers -6.5.Trail Blazers at CelticsTime: 8 p.m. | Location: Boston | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 224.5\nWhat team now has the No. 1 offense in the NBA? That would be the Boston Celtics (28-17), who average 121.2 points per 100 possessions, just ahead of the Nuggets (121.0). At home, the Celtics are slightly better, averaging 121.8 points per 100. On Monday, Boston has a favorable matchup against a struggling Portland defense. The Trail Blazers (23-23) are giving up 115.1 points per 100, which ranks 18th in the league. The SportsLine Projection Model says there's a 60.1% chance the teams combine for 225 points or more and gives a \"B\" grade to Over 224.5. Note Portland star Deni Avdija is questionable to play on Monday and his status is worth tracking prior to the game.Warriors at TimberwolvesTime: 9:30 p.m. | Location: Minneapolis | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Warriors +224 | Expert: Timberwolves -7.5 (Bruce Marshall)\nThe Warriors and Timberwolves face each other for the second night in a row at the Target Center. On Sunday, Stephen Curry scored a team-high 26-points as the Jimmy Butler-less Warriors (26-21) blew out the Timberwolves 111-85. Minnesota (27-19) has now lost five straight games. Marshall notes, however, that the team that loses the first game of these baseball-type series usually has the advantage in the second game. \"And the Warriors are unlikely to reprise their Sunday effort without Jimmy Butler and almost assuredly minus Jonathan Kuminga on Monday,\" he says. The SportsLine Projection Model disagrees. It says Golden State has a 44% chance to win and assigns a \"B\" grade to the Warriors money line (+224).\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Arizona-BYU, Louisville-Duke, NBA  and more on Monday, Jan. 26 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/a6c3ee04-fa62-435c-a4ce-55b6932561ff/thumbnail/1200x675/fcd3cfc83720baa6535c0261284a401d/aj-dybantsa-byu-cougars.jpg"
      ],
      "datePublished": "2026-01-26T20:30:42.000Z",
      "dateModified": "2026-01-26T20:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology: Michigan vs. Nebraska is rare battle between No. 1 seeds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-ncaa-tournament-bracket-field-of-68-predictions-michigan-nebraska-duke-arizona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/e12bc447-a78a-4b26-9e59-e6e810399f67/thumbnail/1200x675/90dca819fd4f2fb9bbaab69b2c298cb0/michigan-nebraska-bracketology.jpg",
    "tag": "Sports",
    "date": "2026-01-26T20:47:02.000Z",
    "description": "\n        Each of the No. 1 seeds in the latest run of the CBS Sports Bracketology model will be in action against formidable conference opposition ear",
    "body": "\n        Each of the No. 1 seeds in the latest run of the CBS Sports Bracketology model will be in action against formidable conference opposition early this week, and at least one of them is guaranteed to lose. That's because of two of them will be playing each other on Tuesday night, when Michigan hosts Nebraska in a seismic Big Ten clash.Nebraska is holding on to the final No. 1 seed as it heads to Ann Arbor to put its undefeated record on the line against the Wolverines. The Cornhuskers are 10.5-point underdogs, which reflects an analytics profile that is lagging behind its resume. With the nation's No. 2 strength of record and as one of two unbeaten high-major teams left along with Arizona, Nebraska's body of work is strongHowever, it still is not a top-10 team in any of the analytics-oriented metrics that appear on its NCAA team sheet. In fact, the Cornhuskers rate a paltry 17th in the BPI. Upsetting Michigan on the road would help narrow the disparity between Nebraska's record and its ratings.But even if Nebraska loses, the CBS Sports Bracketology model projects that it could still remain a No. 1 seed. Taking a road loss against a team as strong as Michigan wouldn't leave much of a mark on the Cornhuskers' resume.  Bracketology top seeds       \t \t \t \t \tSeedWestEastMidwestSouthNo. 1                                                     \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Nebraska\n                    \n    \n    No. 2                                                     \n                            \n    \n                                                \n                    \n    \n        \n                            Purdue\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Illinois\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            UConn\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    Check out the full field of 68 at the CBS Sports Bracketology hub.\nConference breakdownWhen it comes to heft at the top of the field, the Big Ten and Big 12 are clearly the top dogs. Those two conferences account for eight of the top 12 spots in the bracket entering Monday night's action.However, the SEC reclaimed the lead in total number of bids over the weekend as bubble teams Missouri and Texas both picked up conference victories to nudge the conference's tally back to 11. Also on the rise was the Big 12, which went from seven bids to eight after TCU's road victory over Baylor elevated the Horned Frogs into the field. Falling from 10 bids to nine was the ACC, as Stanford dropped out of the field following a 12-point home loss to Cal. The Big East dropped from four bids to three as Seton Hall fell into \"First Four Out\" territory following its fourth straight loss.A Bracketology breakdown by conference as of Jan. 26, 2026. \n                                                                    CBS Sports\n                                                            Rematch rulesAmid conference consolidation and the proliferation of nonconference matchups between high-major schools, the NCAA Tournament selection committee faces challenges when it comes to avoiding regular season rematches. The 2025 NCAA Tournament bracket featured three potential second-round games between conference teams, although none of them came to fruition. The committee will still seek to minimize conference meetings and nonconference rematches, and our model is coded to do the same. However, NCAA bracketing principles permit games between conference teams in the second round, so long as the teams in question played each other just once before the NCAA Tournament. For conference teams that met twice prior to the NCAA Tournament, principles state they should not meet prior to the Sweet 16. If the teams played three times, NCAA bracketing principles state they should not play before the Elite Eight.\nWith regard to rematches of nonconference games, NCAA bracketing principles state that they should be avoided \"in the First Four and first round.\" The committee will also \"attempt to avoid\" nonconference rematches in the second round. But the committee has historically prioritized keeping teams on their natural seed line over changing their seed line for the sake of avoiding a rematch. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology: Michigan vs. Nebraska is rare battle between No. 1 seeds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/e12bc447-a78a-4b26-9e59-e6e810399f67/thumbnail/1200x675/90dca819fd4f2fb9bbaab69b2c298cb0/michigan-nebraska-bracketology.jpg"
      ],
      "datePublished": "2026-01-26T20:47:02.000Z",
      "dateModified": "2026-01-26T20:47:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]