[
  {
    "title": "Computer model locks in Chiefs vs. Raiders picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-raiders-where-to-watch-nfl-week-18-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/20/d4b8a8fe-14a8-4837-9a25-95e15a471e69/thumbnail/1200x675/25cfc25938069221d3a88ba433506271/travis-kelce-kansas-city-chiefs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:26:55.000Z",
    "description": "\nTwo longtime AFC West rivals face off with little on the line on Sunday when the Las Vegas Raiders host the Kansas City Chiefs in an NFL Week 18 matc",
    "body": "\nTwo longtime AFC West rivals face off with little on the line on Sunday when the Las Vegas Raiders host the Kansas City Chiefs in an NFL Week 18 matchup. The Raiders (2-14) are the favorites to win the top pick in the NFL Draft as they haven't won since Week 6. A 34-10 loss to the nearly as inept Giants last week was their 10th in a row. The Chiefs were eliminated from the playoffs in Week 15, and star quarterback Patrick Mahomes was lost with a torn ACL in that loss to the Chargers. The Raiders have won just three meetings between the teams since 2013, and Kansas City has won nine of the past 10 matchups.    Kickoff from Allegiant Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Chiefs are 4.5-point road favorites in the latest Chiefs vs. Raiders odds at DraftKings, and the over/under for total points scored is 36.5. Before you lock in your Raiders vs. Chiefs picks, you have to check out the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Chiefs vs. Raiders on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppChiefs vs. Raiders betting previewOdds: Chiefs -4.5, over/under 36.5Both teams are 6-10 against the spread this season, but the Raiders have failed to cover in five of their past seven, including twice as double-digit underdogs. Kansas City is 1-7 SU and ATS in its past eight games, losing outright six times as a favorite and covering last week as a 13.5-point underdog against the Broncos. The Chiefs have failed to cover in their past five road games, but Las Vegas has lost its past five outright at Allegiant Stadium.Chiefs vs. Raiders SGPRaiders +4.5Under 36.5Chris Oladokun Under 26.5 pass attemptsBet it at DraftKings:\nModel's Chiefs vs. Raiders score prediction, picksThe model is giving a 'B' grade on the Raiders to win outright as +215 underdogs. They are winning in 39% of simulations and covering the spread 54% of the time. The Under is also hitting at a high rate, with 58% of simulations going Under and the projected total at 34 points. Chiefs games have gone Under the total in 10 of the past 11 games, and the Raiders have scored more than 17 points once during their 10-game skid. They have been shut out twice over that span, with one of those a 31-0 loss in Kansas City in Week 7. The SportsLine model rates Oladokun Under 26.5 pass attempts as a 4.5-star pick.Chiefs vs. Raiders score prediction: Chiefs 19, Raiders 15\nWant more Week 18 NFL picks?You've seen the model's best bets for Kansas City Chiefs vs. Las Vegas Raiders. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Chiefs vs. Raiders picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/20/d4b8a8fe-14a8-4837-9a25-95e15a471e69/thumbnail/1200x675/25cfc25938069221d3a88ba433506271/travis-kelce-kansas-city-chiefs-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T15:26:55.000Z",
      "dateModified": "2026-01-04T15:26:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets today: This Week 18 parlay returns around 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-18-nfl-picks-top-predictions-football-parlay-odds-spreads-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/31/09af1937-fbc8-47ce-a18e-625defd7d7dc/thumbnail/1200x675/e574c231e9e3c718f60f5a61a772aa6c/eagles.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:28:17.000Z",
    "description": "\nThe NFL playoff picture will finalize after the NFL Week 18 schedule. The top seed in the AFC is still at stake, as is who is going to take the AFC N",
    "body": "\nThe NFL playoff picture will finalize after the NFL Week 18 schedule. The top seed in the AFC is still at stake, as is who is going to take the AFC North title and the playoff spot that comes with it. Denver is one win away from being the top seed in the AFC, but if the Broncos falter against the Los Angeles Chargers, New England can take top honors with a win over Miami.    There are a number of important matchups on the Week 18 NFL schedule, including Colts vs. Texans (-10.5), Packers vs. Vikings (-10), Lions vs. Bears (-3), Chargers vs. Broncos (-13.5), Dolphins vs. Patriots (-11.5) and Commanders vs. Eagles (-4). The Ravens (-3.5) face the Steelers on 'Sunday Night Football' in Pittsburgh with the AFC North on the line.Before locking in any Week 18 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 18 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of over 25-1. You can only see the model's Week 18 NFL picks at SportsLine.Top Week 18 NFL picksAfter simulating every game 10,000 times, the model is high on the Philadelphia Eagles (-4, 39) to cover against the Commanders on Sunday at 4:25 p.m. ET. Bet our Eagles vs. Commanders SGP at DraftKings below, and see our 25-1 Week 18 NFL parlay at SportsLine.\nThe Eagles plan to sit some starters as they look to rest for the playoffs. Despite that, they are still incentivized to win the gaame. A win could get them as high as the No. 2 seed, giving them a chance at more possible home games in the postseason. Tanner McKee is a capable backup at quarterback if the Eagles sit Jalen Hurts for some or all of the game, and Philly is still well-equipped to win at home against a Washington team that has been decimated by injuries. The model has Philadelphia winning by double digits as the Eagles cover more than 60% of the time. See which other NFL parlay picks to make here.How to make Week 18 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 18 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 18 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 18 NFL best bets from a model on a 53-37 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets today: This Week 18 parlay returns around 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/31/09af1937-fbc8-47ce-a18e-625defd7d7dc/thumbnail/1200x675/e574c231e9e3c718f60f5a61a772aa6c/eagles.jpg"
      ],
      "datePublished": "2026-01-04T15:28:17.000Z",
      "dateModified": "2026-01-04T15:28:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Chargers vs. Broncos picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chargers-broncos-where-to-watch-nfl-week-18-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/07ec2440-b951-4834-910a-e5b20b48219f/thumbnail/1200x675/35964e592d05d84c19177a709bc1c2da/usatsi-27426083-bo-nix-broncos-qb-1q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:18:15.000Z",
    "description": "\nThe Denver Broncos will be attempting to secure the No. 1 seed in the AFC when they host the Los Angeles Chargers in Week 18 of the 2025 NFL season. ",
    "body": "\nThe Denver Broncos will be attempting to secure the No. 1 seed in the AFC when they host the Los Angeles Chargers in Week 18 of the 2025 NFL season. The Chargers don't have much to play for beyond seeding in the playoffs, and they're planning on resting Justin Herbert and other key starters as a result. If Denver wins this game, the Broncos will secure the top seed and get a bye in the first round of the playoffs.Kickoff from Empower Stadium at Mile High is set for 4:25 p.m. ET on CBS and Paramount+. The Broncos are 14-point favorites in the latest Chargers vs. Broncos odds at DraftKings, and the over/under for total points scored is 37.5. Before making any Broncos vs. Chargers picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Chargers vs. Broncos on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppChargers vs. Broncos betting previewOdds: Broncos -14, over/under 37.5Despite its stellar record, Denver is only 6-9-1 against the spread. Los Angeles is 8-7-1 ATS but had four straight covers before losing to the Texans at home in Week 17. The Chargers are 6-9-1 to the Over while the Broncos are 7-9 to the Over.Chargers vs. Broncos SGPChargers +14Over 37.5RJ Harvey anytime touchdown scorerBet it at DraftKings:\nModel's Chargers vs. Broncos score prediction, picksThe Chargers cover the spread in 58% of model simulations and win in 27%, bringing value as +575 underdogs. The Over hits in 51% of simulations.Chargers vs. Broncos score prediction: Broncos 25, Chargers 15\nWant more Week 18 NFL picks?You've seen the model's best bets for Los Angeles Chargers vs. Denver Broncos. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Chargers vs. Broncos picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/07ec2440-b951-4834-910a-e5b20b48219f/thumbnail/1200x675/35964e592d05d84c19177a709bc1c2da/usatsi-27426083-bo-nix-broncos-qb-1q-2025-1920.jpg"
      ],
      "datePublished": "2026-01-04T15:18:15.000Z",
      "dateModified": "2026-01-04T15:18:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Titans vs. Jaguars picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/titans-jaguars-where-to-watch-nfl-week-18-score-prediction-sportsbook-promos-betting-odds-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/7e85d9e5-4ea6-4e20-9879-8a0910b58c2e/thumbnail/1200x675/19d89ab5b15e73f755e4038fc6d7ba56/trevor-lawrence-jaguars.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:00:27.000Z",
    "description": "\nThe Jacksonville Jaguars will try to clinch the AFC South on Sunday when they host the division-rival Tennessee Titans in an NFL Week 18 matchup. The",
    "body": "\nThe Jacksonville Jaguars will try to clinch the AFC South on Sunday when they host the division-rival Tennessee Titans in an NFL Week 18 matchup. The Jaguars (12-4) simply need a victory, but while the Titans are just 3-13, they won't be doing Jacksonville any favors on Sunday. The Titans lost 25-3 at home against the Jags in Week 13, but the Titans have come to life recently, getting two of their victories in the past four weeks. Rookie quarterback Cam Ward, the No. 1 overall pick, is showing signs of progress, throwing eight touchdown passes and just one interception in his past five starts. Trevor Lawrence is thriving as the Jaguars' signal-caller and will be facing a Titans defense that has struggled.Kickoff from EverBank Stadium is set for 1 p.m. ET. The Jaguars are 13.5-point favorites in the latest Titans vs. Jaguars odds from DraftKings, while the over/under for total points scored is 47.5. The Jags are -833 money line favorites (wager $833 to win $100), while Tennessee is a +568 underdog. Before you lock in your own Jaguars vs. Titans picks, make sure you see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Titans vs. Jaguars on SundayWhen: Sunday, Jan. 4Time: 1 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppTitans vs. Jaguars betting previewOdds: Jaguars -13.5, Over/Under 47.5Despite their dismal record, the Titans are 7-9 against the spread, and the Jaguars are 11-5, covering the spread in every victory except for a 30-29 win against the Raiders as a 1.5-point favorite. They have covered in seven straight, winning as underdogs three times. Both teams tend to go Over on the total, with Tennessee 10-6 and the Jags 9-7, with both going Over in four of their past six. But the total has gone Under in 11 of the past 15 games between these teams in Jacksonville. The Jags have beaten the Titans in six of the past seven meetings at EverBank Stadium.Titans vs. Jaguars SGPOver 47.5Cam Ward Under 192.5 passing yardsTrevor Lawrence Under 1.5 TD passesBet it at DraftKings:\nModel's Titans vs. Jaguars score prediction, picksAs mentioned, both of these teams tend to go Over, and that's what the SportsLine Projection Model expects here. The model has the Over hitting in 61% of its simulations, with the pick earning a 'B' grade. Ward threw for 141 yards in the first meeting between these teams on Nov. 30, and while he has progressed the past few weeks, the model targets him for 177 yards. Lawrence has at least two passing touchdowns in five of his past six starts, but he had none last week and only had more than one twice in the first 10 games. He had two in the first matchup with Tennessee, but the model has Lawrence Under 1.5 passing touchdowns this week as a four-star pick. Titans vs. Jaguars score prediction: Jaguars 32, Titans 20\nWant more Week 18 NFL picks?You've seen the model's best bets for Tennessee Titans vs. Jacksonville Jaguars. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Titans vs. Jaguars picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/7e85d9e5-4ea6-4e20-9879-8a0910b58c2e/thumbnail/1200x675/19d89ab5b15e73f755e4038fc6d7ba56/trevor-lawrence-jaguars.jpg"
      ],
      "datePublished": "2026-01-04T15:00:27.000Z",
      "dateModified": "2026-01-04T15:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 College Football Playoff semifinal odds, lines: Picks, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-semifinals-2026-odds-picks-cfp-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/21/36bbfb82-fc72-4153-b4d4-007af0b0d80c/thumbnail/1200x675/8258fa68e8b9983744386a9482450a79/dante-moore-oregon-ducks-3.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:35:29.000Z",
    "description": "\n        The 2025-26 college football bowl schedule saw its final standard bowl games on Friday, Jan. 2, but the season extends well into January as t",
    "body": "\n        The 2025-26 college football bowl schedule saw its final standard bowl games on Friday, Jan. 2, but the season extends well into January as the 2026 College Football Playoff semifinals are up next. Ole Miss vs. Miami in the Fiesta Bowl is up first on Thursday, Jan. 8, while Oregon vs. Indiana in the Peach Bowl is the following day. The national championship game will then take place on Monday, Jan. 19.The latest college football odds lists Miami at -3.5 with the over/under at 51.5 in the first semifinal matchup. Indiana is -4 with the over/under at 46.5 in the second CFP semifinal. Before locking in any college football picks for those games, be sure to see the latest College Football Playoff picks and predictions from SportsLine's proven model. The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for the CFP semifinals One of the college football picks the model is high on during the semifinal round of the College Football Playoffs: The Over (47.5) hits in the rematch between Oregon and Indiana on Friday at 7:30 p.m. ET at Mercedes-Benz Stadium in Atlanta. These teams met in Eugene on Oct. 11 and combined for 50 points. Both squads have elite defenses, but they can both score at a high rate as well as they're led by the possible top-two picks in the 2026 NFL Draft -- Indiana quarterback and Heisman winner Fernando Mendoza and Oregon quarterback Dante Moore. Indiana just put 38 points on Alabama, while Oregon is averaging 37 points per game through two playoff matchups. SportsLine's model is projecting 49 points this time around as the Over hits in 54% of simulations. See the rest of the model's picks here, and bet the Over right here:\nHow to make College Football Playoff picks The model has also made the call on who wins and covers in both CFP games, including backing one of the underdogs to win outright. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which underdog is projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has simulated every game 10,000 times, and find out.2026 College Football Playoff semifinals odds See full CFP picks, odds, predictions here(odds subject to change)Thursday, Jan. 8Fiesta Bowl/CFP semifinal: Miami vs. Ole Miss (+3.5, 51.5)Friday, Jan. 9 Peach Bowl/CFP semifinal: Oregon vs. Indiana (-4, 46.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football Playoff semifinal odds, lines: Picks, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/21/36bbfb82-fc72-4153-b4d4-007af0b0d80c/thumbnail/1200x675/8258fa68e8b9983744386a9482450a79/dante-moore-oregon-ducks-3.jpg"
      ],
      "datePublished": "2026-01-04T15:35:29.000Z",
      "dateModified": "2026-01-04T15:35:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks for Week 18, AI-generated score predictions, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-18-picks-ai-score-predictions-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/29/b7dd8b0f-15d3-47b5-9e8e-6700a283aab8/thumbnail/1200x675/0ffcf2a42b01103254058bb347f40340/stafford-corum.jpg",
    "tag": "Sports",
    "date": "2026-01-04T13:45:30.000Z",
    "description": "\nThe NFL Week 18 schedule features 14 games on Sunday, including an 'SNF' matchup between the Baltimore Ravens and Pittsburgh Steelers. The AFC North ",
    "body": "\nThe NFL Week 18 schedule features 14 games on Sunday, including an 'SNF' matchup between the Baltimore Ravens and Pittsburgh Steelers. The AFC North title and a playoff spot will be on the line when Derrick Henry and the Ravens battle Aaron Rodgers and the Pittsburgh Steelers. The Ravens are favored by 3.5 points at DraftKings Sportsbook, as Lamar Jackson (back) will be back under center for Baltimore.Sunday's largest spreads include Titans vs. Jaguars (-13.5), Broncos vs. Chargers (+14) and Dolphins vs. Patriots (-11.5). The smallest spreads in Week 18 include Saints vs. Falcons (-3.5) and Lions vs. Bears (-3). Denver has a scenario where if it wins, then it claims the AFC's top overall seed.Before making any Week 18 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 18 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 16 games. You can only see the AI predictions for the Week 18 NFL schedule here.Top Week 18 NFL AI picksAfter analyzing every game in Week 18, the AI says the Rams (-8.5, 46.5), who have already clinched a postseason berth, cover comfortably against the Cardinals. \nThe Cardinals have gone over in five of their last eight games, while the over has hit in three of the last four head-to-head meetings. Bet the Over 47.5 in the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nLos Angeles has won seven of the last 10 meetings with Arizona and is expected to win comfortably once again. A win would be their third in a row over the Cardinals. Los Angeles earned a 45-17 win in the Dec. 7 meeting at Arizona. SportsLine AI rates the Steelers as a B spread pick and also predicts a 31-20 win on average. See its other Week 18 football predictions and football picks at SportsLine, and bet the Rams at DraftKings here:\nHow to make Week 18 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 18. You need to see the AI's NFL picks before making any Week 18 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 18 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 18, AI-generated score predictions, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/29/b7dd8b0f-15d3-47b5-9e8e-6700a283aab8/thumbnail/1200x675/0ffcf2a42b01103254058bb347f40340/stafford-corum.jpg"
      ],
      "datePublished": "2026-01-04T13:45:30.000Z",
      "dateModified": "2026-01-04T13:45:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-bills-where-to-watch-nfl-week-18-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/e4c4a157-624d-4c82-bd8a-86c283b82374/thumbnail/1200x675/e5e4cd51494ed1ad1d011c2e337776a1/josh-allen-james-cook-buffalo-bills.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:11:41.000Z",
    "description": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jet",
    "body": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jets and have results go their way elsewhere in Week 18. Yet given the foot injury star quarterback Josh Allen is currently nursing, Buffalo may not want to risk its most important player with a postseason berth already secured. Allen does not have an injury designation on the injury report, but it's unclear whether he will play the full game. The Jets, meanwhile, are playing out the string for another lost season. Coach Aaron Glenn may be coaching for his job.Kickoff from Highmark Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Bills are 7.5-point favorites in the latest Bills vs. Jets odds at DraftKings and the total is set at 37.5. The Bills are -420 money line favorites (risk $420 to win $100), while the Jets are +328 underdogs. Before making any Jets vs. Bills picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Bills vs. Jets on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppBills vs. Jets betting previewOdds: Bills -7.5, over/under 37.5These lines could fluctuate as kickoff draws closer and it becomes clearer just how the Bills will handle their starters. Both teams are 7-9 against the spread. Buffalo is 8-8 to the Over, while New York is 10-6. The Bills have only covered in one of their last four games, while the Jets haven't covered once in that span.Bills vs. Jets SGPBills -7.5Over 37.5Bills -410Bet it at DraftKings:\nModel's Bills vs. Jets score prediction, picksThe Bills cover in 56% of the model's simulations and win outright in 74%. The Over hits 69% of the time. These rates may change as player availability news emerges. Bills vs. Jets score prediction: Bills 28, Jets 18\nWant more Week 18 NFL picks?You've seen the model's best bets for Buffalo Bills vs. New York Jets. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/e4c4a157-624d-4c82-bd8a-86c283b82374/thumbnail/1200x675/e5e4cd51494ed1ad1d011c2e337776a1/josh-allen-james-cook-buffalo-bills.jpg"
      ],
      "datePublished": "2026-01-04T15:11:41.000Z",
      "dateModified": "2026-01-04T15:11:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Colts vs. Texans picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-texans-where-to-watch-nfl-week-18-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/d65b3849-e43b-44e8-be5b-e67f86cafda0/thumbnail/1200x675/30600b44ac35f390679d73cca9d1a442/cj-stroud-houston-texans.jpg",
    "tag": "Sports",
    "date": "2026-01-04T14:46:16.000Z",
    "description": "\nAFC South rivals meet in Week 18 of the 2025 NFL season when the Indianapolis Colts face the Houston Texans, with Houston looking to potentially win ",
    "body": "\nAFC South rivals meet in Week 18 of the 2025 NFL season when the Indianapolis Colts face the Houston Texans, with Houston looking to potentially win the division. The Texans have won eight games in a row and defeated the Colts as part of that winning streak. Indianapolis will give Riley Leonard the start after trying to make a playoff push of their own by bringing Philip Rivers out of retirement when Daniel Jones suffered a season-ending Achilles injury. The Colts will try to play spoiler, as Houston needs a win and a Jacksonville loss to win the division and get a home playoff game.Kickoff from NRG Stadium is set for 1 p.m. ET on CBS and Paramount+. The Texans are 10.5-point favorites in the latest Colts vs. Texans odds at DraftKings, and the total is 38.5. The Texans are -613 money line favorites (risk $613 to win $100), while the Colts are +447 underdogs. Before making any Texans vs. Colts picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Colts vs. Texans on SundayWhen: Sunday, Jan. 4Time: 1 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppColts vs. Texans betting previewOdds: Texans -10.5, over/under 38.5The Texans are 9-7 against the spread on the season despite being 11-5 overall, while the Colts are 7-7-2 ATS after starting out hot and fading down the stretch. Indianapolis is 8-8 to the Over on the season but Houston is 5-10-1 thanks to a phenomenal defense.Colts vs. Texans SGPOver 38.5Woody Marks anytime touchdown scorerC.J. Stroud Over 218.5 passing yardsBet it at DraftKings:\nModel's Colts vs. Texans score prediction, picksThe SportsLine Projection Model is high on the road team. It has the Colts covering the spread in 57% of simulations and winning outright in 34% to bring value as +455 underdogs. The model has the Over hitting in 65% of simulations.Colts vs. Texans score prediction: Texans 28, Colts 20\nWant more Week 18 NFL picks?You've seen the model's best bets for Indianapolis Colts vs. Houston Texans. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Colts vs. Texans picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/d65b3849-e43b-44e8-be5b-e67f86cafda0/thumbnail/1200x675/30600b44ac35f390679d73cca9d1a442/cj-stroud-houston-texans.jpg"
      ],
      "datePublished": "2026-01-04T14:46:16.000Z",
      "dateModified": "2026-01-04T14:46:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-spread-time-ravens-steelers-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/685349bc-30e7-4676-a79f-03790ffe7383/thumbnail/1200x675/98a3316856e142cd42c829424a2122ef/derrick-henry-baltimore-ravens-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-04T16:09:33.000Z",
    "description": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday ",
    "body": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday Night Football.' Baltimore is coming off a 41-24 thumping of the Green Bay Packers in Week 17, while Pittsburgh dropped a 13-6 decision to the Cleveland Browns. The Ravens (8-8), who have won the past two division championships, would hold the tiebreaker with Pittsburgh if they finish with the same record. The Steelers (9-7), who are looking for their first AFC North crown since 2020, are 5-3 on their home field this season. Lamar Jackson (back) will start at quarterback for the Ravens. Pittsburgh will again be without receiver DK Metcalf (suspension).Kickoff from Acrisure Stadium in Pittsburgh is set for 8:20 p.m. ET. The Steelers lead the all-time series 37-27, including a 27-22 win in Baltimore on Dec. 7. Baltimore is a 3.5-point favorite in the latest Ravens vs. Steelers odds from DraftKings Sportsbook, while the over/under for total points scored is 41. Before locking in any Steelers vs. Ravens picks, make sure to check out the 'Sunday Night Football' predictions from SportsLine NFL expert Mike Tierney.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nA veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. Mike is 235-189-13 in the NFL the past three seasons, returning $2,505 to $100 players. In addition, he is an amazing 31-14-1 on his last 46 picks in games involving the Baltimore Ravens, returning $1,527. Anyone who has followed him could be way up. Now, Tierney has set his sights on Ravens vs. Steelers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Ravens vs. Steelers: Ravens vs. Steelers                                         spreadBaltimore -3.5 at DraftKings SportsbookRavens vs. Steelers                                                 over/under41.5 pointsRavens vs. Steelers                                                 money line Baltimore -190, Pittsburgh +159Ravens vs. Steelers                                             picksSee picks at SportsLineRavens vs. Steelers                                                 streaming Fubo (Try for free)  \nWhy the Ravens can winVeteran running back Derrick Henry can put the offense on his back, as he did in last week's win over the Packers. Henry rushed 36 times for 216 yards and four touchdowns at Green Bay. For the season, he has carried 287 times for 1,469 yards and 16 touchdowns. He has 15 explosive plays of 20 yards or more, including a long of 59, with 74 first-down conversions. He has also caught 20 passes for 150 yards. Wide receiver Zay Flowers has been solid in the passing game. In 16 games, Flowers has 82 receptions for 1,073 yards and three touchdowns. He also has 17 big plays of 20 yards or more, including a long of 56, with 400 yards after the catch and 45 first-down conversions. Against the Packers, he caught four passes for 30 yards and a score. See which team to back at SportsLine. Bet Lamar Jackson to go Over 214.5 passing yards at DraftKings:\nWhy the Steelers can winVeteran quarterback Aaron Rodgers, who is in his 21st season in the league, powers the Pittsburgh offense. In 15 games, he has completed 65.6% of his passes for 3,028 yards and 23 touchdowns with seven interceptions and a 95.3 rating. Rodgers has also rushed for one score. In the win over the Ravens in December, he completed 23 of 34 passes for 284 yards and one touchdown. He also rushed for one score.Four-year veteran running back Jaylen Warren helps lead the Steelers' ground attack. In 15 games, he has carried 197 times for 892 yards (4.5 average) and six touchdowns. He has six explosive plays of 20 or more yards, including a long of 45. He has converted 48 first downs. In a 29-24 win at Detroit on Dec. 21, he carried 14 times for 143 yards and two touchdowns. See which team to back at SportsLine.Bet Jonnu Smith to go Over 16.5 total receiving yards at DraftKings:\nHow to make Ravens vs. Steelers  picksTierney has analyzed Ravens vs. Steelers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Steelers vs. Ravens, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Ravens vs. Steelers spread you need to jump on, all from the expert that is 31-14-1 on his last 46 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/685349bc-30e7-4676-a79f-03790ffe7383/thumbnail/1200x675/98a3316856e142cd42c829424a2122ef/derrick-henry-baltimore-ravens-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-04T16:09:33.000Z",
      "dateModified": "2026-01-04T16:09:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Lions, Texans, Steelers for NFL Week 18 betting - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-lions-texans-steelers-nfl-week-18-betting/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:12:20.000Z",
    "description": "\n        The latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The 2025 NFL regular season concludes w",
    "body": "\n        The latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The 2025 NFL regular season concludes with a winner-take-all and loser-goes-home matchup for the AFC North title. The Pittsburgh Steelers will host the Baltimore Ravens on Sunday Night Football, and rather than picking the winner, SportsLine's advanced computer model finds the best value in the Steelers covering as 4.5-point underdogs as one of its Sunday NFL best bets at DraftKings Sportsbook. The over-under is 40.5.SportsLine's team of experts has also locked in their Sunday NFL best bets for Week 18, including one expert backing the Texans to cover as 10.5-point favorites against the Colts, with another backing the Lions to cover as 3.5-point underdogs against the Bears. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 18 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Sunday best bets at DraftKings SportsbookTexans (-10.5) vs. ColtsLions (+3) vs. BearsSteelers (+3.5) vs. RavensCombining the model's three picks into a Sunday parlay at DraftKings would result in a payout of +652 (risk $100 to win $652, odds subject to change). Bet it at DraftKings here:Texans (-10.5) vs. Colts (-108)\n\"The proud Houston defense must have looked forward to sending Indy QB Philip Rivers into his second retirement,\" SportsLine expert Mike Tierney said. \"Alas, it may not get the chance. The Colts are leaning to starting QB Riley Leonard, a rookie drafted in the sixth round. That could be considered cruel punishment, sending him out for start No. 1 against the league's nastiest defense. The Texans have plenty to play for. A division title, though remote, remains possible. Short of it, they could secure a fifth seed in the AFC bracket. Most of the wins in their current eight-game straight-up streak are by one score, but they have yet to feast on a QB this green.\" Back the Texans at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Lions (+3) vs. Bears (-105)\"There are quite a few unknowns in Week 18, but I believe we do know that even with the season essentially finished, Dan Campbell will still come with everything he has,\" SportsLine expert Brady Kannon said. \"Unfortunately, everything he has is not a lot with all of the injuries, but still, I believe this will be 100% effort out of Campbell's squad. Just by the numbers, the Lions are the better team. Again, it is about health and if they have enough to overcome the holes on defense. All the pressure is on Chicago - to win and secure the No. 2 seed. Meanwhile, Detroit can let it fly with no pressure whatsoever. If the Lions don't turn the ball over, they'll keep it close and possibly win it outright.\" Back the Lions at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Steelers (+3.5) vs. Ravens (+100)The Steelers (9-7) have secured Mike Tomlin's 19th straight winning season, but that won't be enough to satisfy what could be Aaron Rodgers' final game. Ravens quarterback Lamar Jackson will play, but after missing a potential elimination game last week with a back injury, he's likely playing at less than 100%. The Steelers are 5-3 at home this season, and 3-1 in their last four games overall. The model projects the Steelers to cover in 54% of simulations. Back the Steelers at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more NFL picks on Sunday?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Lions, Texans, Steelers for NFL Week 18 betting - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-04T15:12:20.000Z",
      "dateModified": "2026-01-04T15:12:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Phillies in on Bichette, Red Sox make 'aggressive' offer for Bregman - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-bo-bichette-phillies-alex-bregman-red-sox-blue-jays/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/005911c5-3f0d-4fec-9584-876efdcc579d/thumbnail/1200x675/c98c98b8cb9554a2b89d26ac0a30e573/bichette-getty.png",
    "tag": "Sports",
    "date": "2026-01-04T15:47:44.000Z",
    "description": "\n        The 2025-26 Major League Baseball offseason is ongoing, and with the new year having come and gone we're working our way deeper into the spor",
    "body": "\n        The 2025-26 Major League Baseball offseason is ongoing, and with the new year having come and gone we're working our way deeper into the sport's offseason calendar. With plenty of name free agents and trade candidates still on the board, there's a daily supply of rumors and reporting regarding them. Speaking of which, you can find Sunday's roundup just below. Phillies among big-name teams in on Bichette\nShortstop Bo Bichette, who might also make sense at third or second for some teams, is among the most coveted free agents on the market. Not surprisingly, a number of high-profile teams have interest in the 27-year-old Bichette, who boasts a career OPS+ of 121 and is coming off an impressive bounce-back campaign in 2025. The Phillies, Yankees, Cubs, Dodgers, and incumbent Blue Jays are among the teams with varying levels of interest in Bichette, Jon Heyman of the New York Post reports. Earlier in the offseason, CBS Sports ranked Bichette as the No. 3 available free agent in the current class. Red Sox favorites to retain Bregman\nVeteran infielder Alex Bregman is back on the market after an \"excellent when healthy\" 2025 season with the Red Sox. He also happens to be our second-ranked free agent of the winter. Here's part of R.J. Anderson's write-up of Bregman from earlier in the offseason: \"Bregman, one of the last notable free agents to sign last winter, showed no ill effects of being left in the cold. He kept alive his streak of having never finished worse than 15% above the league-average hitter, and for the first time in his career, he joined the 90-90 club -- that is, a 90% in-zone contact rate and a 90 mph average exit velocity. Bregman can still pick it at third base, too. It's fair to wonder how his pull-happy slugging would play in a less favorable home offensive environment than the ones he's haunted to date, but he's a good player who ought to land a better contract than three years and $120 million this go around.\"His market, like that of many other premium free agents, has been a bit slow to develop, but things may be starting to crystallize. Speaking of which, the Red Sox have made an \"aggressive\" offer to bring Bregman back, and there's a strong chance he returns to Boston, ESPN's Buster Olney reports. The Red Sox, coming off a return to postseason play last year, have been one of the most aggressive teams of the winter and re-upping with Bregman could be the capstone on their offseason. \nWhat's next for Blue JaysSpeaking of AL East teams that have been aggressive this offseason, the Blue Jays are fresh off adding slugger Kazuma Okamaoto out of Japan on a four-year free-agent contract. Okamoto is expected to log plenty of time at third base for Toronto in the season to come, and that means they're probably out on the aforementioned Alex Bregman, the Athletic reports. However, that does not necessarily rule out the Jays when it comes to bringing back shortstop Bo Bichette, as noted above. Likewise, they may still have some level of interest in outfielder Kyle Tucker, the top free agent of this winter's class. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Phillies in on Bichette, Red Sox make 'aggressive' offer for Bregman - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/005911c5-3f0d-4fec-9584-876efdcc579d/thumbnail/1200x675/c98c98b8cb9554a2b89d26ac0a30e573/bichette-getty.png"
      ],
      "datePublished": "2026-01-04T15:47:44.000Z",
      "dateModified": "2026-01-04T15:47:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Dolphins where to watch, TV, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-vs-patriots-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/e5d35f3a-7aa1-48a0-8394-92216756bf35/thumbnail/1200x675/5bb6234210683a1cdfd82ea50bdc9a27/drake.jpg",
    "tag": "Sports",
    "date": "2026-01-04T12:01:14.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    New England hopes to clinch the No. 1 seed in the AFC this week\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 4, 2026\n                            \n                    at\n    7:01 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The New England Patriots wrap up the 2025 regular season against the rival Miami Dolphins on Sunday. Mike Vrabel's squad clinched the AFC East last week, but their work is not complete. The Patriots can clinch the No. 1 seed in the AFC and the invaluable first-round bye with a win on Sunday paired with a Denver Broncos loss to the Los Angeles Chargers. The Patriots are coming off a dominant 42-10 win over the New York Jets last week. New England scored touchdowns on six straight drives to begin the game, while Drake Maye became the first player to ever complete 90% of his passes and throw for 250 yards and five touchdowns. As for the Dolphins, they upset Baker Mayfield and the Tampa Bay Buccaneers in Week 17, 20-17. Rookie quarterback Quinn Ewers earned his first NFL victory, and flashed some of his potential as well. Let's break down this divisional matchup. But first, here's how you can watch the game\nWhere to watch Dolphins vs. Patriots liveDate: Sunday, Jan. 4 | Time: 4:25 p.m. ETLocation: Gillette Stadium - Foxborough, MassachusettsTV: Fox | Stream: Fubo (Try for free)Follow: CBS Sports AppOdds: Patriots -10.5; O/U 45.5 (via DraftKings)Dolphins vs. Patriots: Need to knowStefon Diggs situation: The Patriots were in the headlines for the wrong reasons this week. Wide receiver Stefon Diggs faces charges of felony strangulation or suffocation and misdemeanor assault and battery following an incident in his home earlier this month, according to CBS Boston's review of paperwork filed in Dedham District Court. While the NFL is looking into the matter, Diggs is expected to play Sunday. Drake Maye's MVP case: The Patriots' second-year signal-caller registered just four incompletions compared to three total touchdowns last week against the Jets, and is now a relatively heavy favorite to win NFL MVP. He is listed at -295 at DraftKings, while Los Angeles Rams quarterback Matthew Stafford is now +225 following his three-interception performance in Week 17. Maye leads the NFL in completion percentage (71.7%), yards per attempt (8.9) and passer rating (112.9).Containing De'Von Achane: A key to victory for New England is containing the explosive Dolphins running back. De'Von Achane ranks fifth in the NFL in scrimmage yards (1,838) and leads the league with 40 rushes for 10 or more yards. He's crossed 100 scrimmage yards in 10 games this season, including a 225-yard explosion against the Buffalo Bills in Week 10. Quinn Ewers gets another start: The Dolphins ended the Tua Tagovailoa era in Week 16, and gave the keys to the offense to the rookie Ewers. In two starts, he's thrown for 432 yards, two touchdowns and two interceptions. The former Texas star would really turn some heads if he were able to upset the Patriots on Sunday. Dolphins vs. Patriots prediction, pick\nThe Patriots are 13-3 against the spread in their last 16 games when favored by double digits, and are an impressive 11-5 against the spread this season. While the Patriots destroyed the Jets by 32 points last week, I don't see this game being as lopsided. Miami has won five of its last seven games after starting the season 2-7, and is 9-1 against the spread in its last 10 games against the Patriots. New England wins this game, but the Dolphins cover the big number. Pick: Dolphins +10.5, Under 45.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Dolphins where to watch, TV, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/e5d35f3a-7aa1-48a0-8394-92216756bf35/thumbnail/1200x675/5bb6234210683a1cdfd82ea50bdc9a27/drake.jpg"
      ],
      "datePublished": "2026-01-04T12:01:14.000Z",
      "dateModified": "2026-01-04T12:01:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaguars vs. Titans where to watch, TV, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jaguars-vs-titans-where-to-watch-odds-pick-prediction-week-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/9f5dd5ac-458f-42a2-9e7f-20ab2c09a0ed/thumbnail/1200x675/226ee46de26e5a33271dda521a51b283/usatsi-27712191-2.jpg",
    "tag": "Sports",
    "date": "2026-01-04T12:00:58.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Jaguars fight to lock down an AFC South title\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 4, 2026\n                            \n                    at\n    7:00 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        There is a lot on the line, at least for one side, in this matchup of AFC South rivals. The Jacksonville Jaguars clinch the division with a win over the Tennessee Titans, but this matchup may not be as lopsided as the records suggest.The Jaguars look like a very dangerous team heading into the playoffs. They are riding a seven-game winning streak and can make it eight with a win over the Titans. Trevor Lawrence and the Jaguars offense have momentum under first-year coach Liam Coen. On defense, Jacksonville is elite against the run, and that unit allows just 20.6 points per game. The Jags seek their second consecutive season sweep of the Titans.Tennessee has been more competitive in recent weeks, and rookie quarterback Cam Ward is progressing nicely. He has displayed a level of consistency he didn't have earlier in the season, and the entire Titans offense is better for it. The Tennessee defense still has its share of issues, and a lackluster secondary is at risk of being exposed by the red-hot Jaguars.Here is everything you need to know about this AFC South matchup.\nWhere to watch Jaguars vs. Titans liveDate: Sunday, Jan. 4 | Time: 1 p.m. ETLocation: EverBank Stadium -- Jacksonville, FloridaTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Jaguars -12.5, O/U 47.5 (via DraftKings)Jaguars vs. Titans: Need to knowHistoric turnaround in Jacksonville: What a difference a year makes. Last season, the Jaguars went 4-13 and fired coach Doug Pederson. Now, they are knocking on the door of 13 wins and a division title. Only two teams in NFL history have gone from 13-plus losses one season to 13-plus wins in the next. One of those teams, the 2025 New England Patriots, pulled off that feat just last week.Ward catching fire: Critical mistakes and inconsistency plagued the early portion of Ward's rookie season. Lately, however, Ward seems to have adjusted to NFL defenses. The No. 1 pick now has two or more touchdown passes in four straight games, and the Titans haven't had a quarterback put together a streak like that since Ryan Tannehill in 2020.Lawrence fulfilling his potential: The No. 1 overall pick in 2021, Lawrence was considered a generational prospect at the quarterback position. It's taken him a while to approach that potential in the NFL, but it sure looks like he's getting there now. Lawrence has 26 passing touchdowns and nine rushing touchdowns this season, and he's just the fourth quarterback ever to put up those kind of dual-threat numbers, joining Kyler Murray, Cam Newton and Josh Allen.Jaguars vs. Titans prediction, pick\nThe Jaguars have a lot to play for, including the No. 1 seed in the AFC, even if that is a bit of a longshot. That makes it tempting to pick Jacksonville, despite the large 12.5-point spread. However, the Titans have shown a lot of fight over the last month or so. I don't think Tennessee will just roll over in this one. It will make Jacksonville earn that AFC South crown. Pick: Titans +12.5, Over 47.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaguars vs. Titans where to watch, TV, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/9f5dd5ac-458f-42a2-9e7f-20ab2c09a0ed/thumbnail/1200x675/226ee46de26e5a33271dda521a51b283/usatsi-27712191-2.jpg"
      ],
      "datePublished": "2026-01-04T12:00:58.000Z",
      "dateModified": "2026-01-04T12:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Phillip Rivers return: NFL coaching searches could target Colts quarterback - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/phillip-rivers-return-nfl-head-coach-search-colts-quarterback/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/a0d23269-dcd9-4f60-9394-00cdc17fb39b/thumbnail/1200x675/07ad9b3d3b8277227a90871e08249659/rivers.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:16:18.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the best stories to come from the 2025 NFL ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        One of the best stories to come from the 2025 NFL season was the return of quarterback Philip Rivers. When Daniel Jones tore his Achilles in Week 14, the Indianapolis Colts turned to the 44-year-old grandfather, who led the franchise to the playoffs back in 2020. Not many expect Rivers to return as a quarterback in 2026, but he could return as a head coach.Rivers could be a head coaching candidate this offseason, according to NFL.com. Several teams are doing research on Rivers. It's believed Rivers could get at least one interview request. The New York Giants and the Tennessee Titans are the two vacancies before more likely open this week. Several franchises did research on Rivers as a coach last year, but the quarterback reportedly did not show much interest in the opportunity.Rivers has been coaching for years, but at the high school level. In Alabama, Rivers is the lead man at St. Michael Catholic, and is coaching his son, Gunner, who is a four-star quarterback in the 2027 class, according to 247Sports. While he has familiarity and emotional ties to St. Michael Catholic, NFL.com points out that Rivers' return to the league this year introduced him to a new generation of players and reestablished some of those NFL connections. Could he now be more interested in a head coaching gig?Rivers threw for 544 yards, four touchdowns and three interceptions in his three-game stint with the Colts this season. While Indy did go 0-3 during this stretch, there's no doubt that Rivers played better than most expected him to after nearly five years away from the game. The eight-time Pro Bowler was actually named a semifinalist for the Pro Football Hall of Fame in November, but reset his Canton clock for another chance to play. Currently, Rivers ranks No. 8 on the all-time passing list with 63,984 yards, and No. 6 on the all-time passing touchdowns list with 425. \nThere are plenty of former NFL players that became head coaches in the league, such as Dan Campbell, Jim Harbaugh, Mike Vrabel and DeMeco Ryans. Perhaps Rivers is next. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Phillip Rivers return: NFL coaching searches could target Colts quarterback - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/a0d23269-dcd9-4f60-9394-00cdc17fb39b/thumbnail/1200x675/07ad9b3d3b8277227a90871e08249659/rivers.jpg"
      ],
      "datePublished": "2026-01-04T15:16:18.000Z",
      "dateModified": "2026-01-04T15:16:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chargers-Broncos, Jets-Bills among Week 18 games with biggest line movement - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-line-movement-for-week-18-chargers-broncos-jets-bills-among-games-with-biggest-shifts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/95f0440e-5965-450c-900c-485758fd3de6/thumbnail/1200x675/d1b21d089392e95b481220cbde448cf1/nix.jpg",
    "tag": "Sports",
    "date": "2026-01-04T15:31:28.000Z",
    "description": "\nKeeping an eye on the news is always critical when wagering on sports, but it's rarely more necessary than entering NFL Week 18. With many games lack",
    "body": "\nKeeping an eye on the news is always critical when wagering on sports, but it's rarely more necessary than entering NFL Week 18. With many games lacking real importance -- whether teams are eliminated from playoff contention or potentially getting players healthy for the postseason -- bettors need to be aware of what is motivating teams in NFL Week 18.The Denver Broncos will try to lock up the AFC's top seed in Chargers vs. Broncos, and some other teams are ready to capitalize if they slip up. That matchup is one of the games where motivation has vastly affected the betting lines, as the Chargers will sit quarterback Justin Herbert and some other starters with their playoff spot secure. Bills vs. Jets also is expected to be much different than the teams' Week 2 matchup, with Buffalo also likely to sit starters, including quarterback Josh Allen after he aggravated a foot injury last week.Ravens vs. Steelers on Sunday Night Football also has high stakes, with the winner taking the AFC North title and the loser going home to watch the playoffs. Ravens two-time league MVP quarterback Lamar Jackson says he will return from a back injury that kept him out last week, and the Ravens are 3.5-point favorites at DraftKings.    \nHere, we will break down the games that have seen the biggest shifts for NFL Week 18 since lines first opened, with all odds courtesy of DraftKings Sportsbook. Chargers vs. Broncos (Sunday, 4:25 p.m. ET)\nOpen: Broncos -7.5, O/U 39.5Now: Broncos -14, O/U 37.5\nThis line was as low as -3 at some books, but the Chargers are using Week 18 to get healthy. Quarterback Justin Herbert, who had surgery on his non-throwing hand several weeks ago, is among those who will sit out. The Chargers will be shorthanded, but this is a lot of points, and if Denver gets a decent lead, it could rest some starters of its own. The model has the Chargers covering in 60% of the time in its simulations.Jets vs. Bills (Sunday, 4:25 p.m. ET)\nOpen: Bills -12.5, O/U 40.5Now: Bills -10, O/U 37.5\nThe Bills are likely to be the fifth or sixth seed in the AFC after their comeback against the Eagles came up short and their slim chance at the AFC East title evaporated. That means Buffalo will try to get healthy as they face the 3-13 Jets. Quarterback Josh Allen was hobbling on a bad foot late against the Eagles, but he will start and play in Week 18. The Bills are planning to rest some notable players on defense, however, which is part of why this line dropped. But the model still likes the Bills, and they are covering in 54% of its simulations.     Commanders vs. Eagles (Sunday, 4:25 p.m. ET)\nOpen: Eagles -7.5, O/U 42.5Now: Eagles -3.5, O/U 38.5 \nThere probably won't be many fireworks in this one, as the Eagles will be content to let the backups play against the 4-12 Commanders. It will likely be a clash of Eagles backup quarterback Tanner McKee against Commanders third-string journeyman Josh Johnson. The Eagles (11-5) can earn the NFC's No. 2 seed, so they'll go for the victory, but Washington might not put up too much fight. The SportsLine model is projecting the Eagles winning by 10 points and covering the spread in 62% of simulations.    Titans vs. Jaguars (Sunday, 1 p.m. ET)\nOpen: Jaguars -10.5, O/U 43.5Now: Jaguars -13.5, O/U 46.5\nThe Jaguars still have a lot to play for, with the AFC South title not yet secured and the chance at the conference's top seed slim but a possibility nonetheless. The Titans and rookie quarterback Cam Ward have been playing well lately, winning two of their past four games. The model has Jacksonville winning comfortably but the Titans covering the spread in 55% of simulationsPackers vs. Vikings (Sunday, 1 p.m. ET)\nOpen: Vikings -6, O/U 37.5Now: Vikings -12.5, O/U 37.5\nBoth teams are really banged up and don't have a lot to play for Sunday, with Green Bay locked into the seventh seed in the NFC playoffs and the Vikings ready for the offseason. The Packers are likely to go with third-string quarterback Clayton Tune with Jordan Love and Malik Willis recovering from injuries. The defense also will consist of a lot of backups, but Minnesota doesn't have much incentive and it is a rivalry game, so the model has the Packers covering in 63% of simulations.    Lions vs. Bears (Sunday, 4:25 p.m. ET)\nOpen: Bears -1.5, O/U 49.5Now: Bears -3.5, O/U 50.5\nIt's another NFC North rivalry matchup that both teams will be wanting to win regardless of the stakes. The Bears are trying to secure the No. 2 seed in the NFC, while Detroit wants to finish its disappointing season on a high note. Unsurprisingly, it's going to be a cold one in the Windy City. The line shifted a bit based on Detroit's dismal performance last week, but the Lions are covering in 51% of the model's simuations. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chargers-Broncos, Jets-Bills among Week 18 games with biggest line movement - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/95f0440e-5965-450c-900c-485758fd3de6/thumbnail/1200x675/d1b21d089392e95b481220cbde448cf1/nix.jpg"
      ],
      "datePublished": "2026-01-04T15:31:28.000Z",
      "dateModified": "2026-01-04T15:31:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]