[
  {
    "title": "Thursday Night Football SGP best bets: Cowboys vs. Lions same-game parlay picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-lions-sgp-thursday-night-football-same-game-parlay-picks-bets-props-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/82e0526b-954e-4200-9d12-021e8fe07528/thumbnail/1200x675/a861271c1e09d1ebe24947ec57891a61/dak-prescott-dallas-cowboys-4.jpg",
    "tag": "Sports",
    "date": "2025-12-05T00:13:19.000Z",
    "description": "\n        Two potent offenses will kick off NFL Week 14 as the Dallas Cowboys visit the Detroit Lions on 'Thursday Night Football'. Both rank in the to",
    "body": "\n        Two potent offenses will kick off NFL Week 14 as the Dallas Cowboys visit the Detroit Lions on 'Thursday Night Football'. Both rank in the top three in both points and yards, so you can be assured that a TNF same-game parlay will heavily involve NFL player props. From Dak Prescott and CeeDee Lamb to Jahmyr Gibbs and David Montgomery, there are several prop lines to seek out, but one also shouldn't dismiss NFL picks on the money line based on recent history. Dallas has won six of the last seven matchups, though the Lions are 3.5-point favorites per the latest NFL odds. Meanwhile, Lions wideout Amon-Ra St. Brown (ankle) is active for TNF.The Cowboys have covered in their last three games, while the Lions have failed to cover in each of their last three. Those betting trends may have many including Dallas (+3.5) within a Lions vs. Cowboys SGP, but what other NFL bets deserve consideration? Before locking in any Cowboys vs. Lions picks for your 'Thursday Night Football' SGP, be sure to see the Lions vs. Cowboys prop predictions powered by SportsLine's Machine Learning AI.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. Now, the model has analyzed Cowboys vs. Lions on 'Thursday Night Football' and locked in three confident best bets for an NFL SGP. If you successfully parlay its picks, you'd be looking at a payout of over 7-1. You can only see the Machine Learning Model player prop predictions for Dallas vs. Detroit here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top 'Thursday Night Football' SGP picksAfter simulating Lions vs. Cowboys, SportsLine's Machine Learning Model says Cowboys quarterback Dak Prescott goes Under 1.5 passing touchdowns (+136 at FanDuel). When Prescott last faced Detroit in 2024, he had zero touchdown passes and two interceptions. The Lions defense confused him throughout as Prescott's 42.4 passer rating in that game is the second-lowest across his 141 regular plus postseason games.Three of the four games this season in which Prescott went Under 1.5 passing touchdowns were road games, as the hostile environment Ford Field will provide can't be discounted. Also, Detroit's defense won't make it easy for Prescott and the passing game as the Lions allow the fifth-lowest completion percentage, and Detroit ranks among the top 10 in sack percentage. The AI model projects Prescott to have 1.3 passing touchdowns. This plus-money NFL prop is rated 4.5 stars and could be a part of a winning Thursday Night Football SGP. See which other TNF same-game parlay picks to make here,How to make Cowboys vs. Lions SGP picksIn addition, the SportsLine Machine Learning Model has three other NFL props that are rated 4 stars or better that could be a part of your Lions vs. Cowboys SGP picks. You can only see the Machine Learning Model's Thursday Night Football NFL parlay at SportsLine.What are the model's top TNF same-game parlay picks you should target with your Cowboys vs. Lions predictions? Visit SportsLine now to see the Thursday Night Football SGP from the SportsLine Machine Learning Model and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thursday Night Football SGP best bets: Cowboys vs. Lions same-game parlay picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/82e0526b-954e-4200-9d12-021e8fe07528/thumbnail/1200x675/a861271c1e09d1ebe24947ec57891a61/dak-prescott-dallas-cowboys-4.jpg"
      ],
      "datePublished": "2025-12-05T00:13:19.000Z",
      "dateModified": "2025-12-05T00:13:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-championship-games-2025-picks-odds-lines-spreads-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:40:40.000Z",
    "description": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC champ",
    "body": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC championship, coming on Saturday. The Power Four title games take place on Saturday, and all of them will impact either who makes the College Football Playoff field and/or where they are seeded. The latest conference championship college football odds list Texas Tech at -12.5 vs. BYU in the Big 12 as BYU head coach Kalani Sitake is remaining with the Cougars instead of going to Penn State. Georgia is at -2.5 vs. Alabama in the SEC as the Dawgs look to avenge their lone defeat, Ohio State is at -4 vs. Indiana in the Big Ten in a No. 1 versus No. 2 matchup, and Virginia is at -4.5 against Duke in the ACC after UVA both beat and covered versus the Blue Devils on Nov. 15. Before locking in any college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 43-36 run on his official SportsLine college football picks as well. Anyone following could have seen huge returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for conference championship week and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for championship weekOne of the top college football picks Marshall is recommending for the conference title games: He's backing Virginia (-3.5) against Duke in the ACC Championship Game. He's also likes the Under (57.5) to hit in the 8 p.m. ET nightcap on Saturday. These teams met in Durham on Nov. 15 and Virginia won 34-17 despite being a 5-point road underdog. That game also hit the Under (60.5) with some room to spare. Marshall sees more of the same at a neutral site in Charlotte.\"UVA is 7-3 vs. the spread in last 10 this season and the Cavaliers also enter Charlotte on 7-0 Under run,\" Marshall told SportsLine. \"The Blue Devils are only 3-3 straight-up and vs. spread down stretch this season.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football conference championship picksMarshall has evaluated every other matchup, and he's backing a team on a huge 14-2 spread run dating back to last year. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 43-36 run on college football picks this season, and find out.College football odds for championship weekSee full conference championship game college football picks, odds, predictions here(odds subject to change)Friday, Dec. 5Conference USA Championship Game: Kennesaw State vs. Jacksonville State (-2.5, 60.5)Sun Belt Championship Game: James Madison vs. Troy (+23.5, 47.5)AAC Championship Game: North Texas vs. Tulane (+2.5, 67.5)Mountain West Championship Game: Boise State vs. UNLV (+4.5, 58.5)Saturday, Dec. 6Big 12 Championship Game: BYU vs. Texas Tech (-12.5, 49.5)MAC Championship Game: Miami (OH) vs. Western Michigan (-2.5, 43.5)SEC Championship Game: Georgia vs. Alabama (+2.5, 47.5)Big Ten Championship Game: Indiana vs. Ohio State (-4, 47.5)ACC Championship Game: Duke vs. Virginia (-4.5, 57.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg"
      ],
      "datePublished": "2025-12-04T23:40:40.000Z",
      "dateModified": "2025-12-04T23:40:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-line-start-time-lions-cowboys-nfl-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-12-05T00:09:04.000Z",
    "description": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lio",
    "body": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lions. Dallas (6-5-1) defeated Kansas City on Thanksgiving, 31-28, for its third straight victory. Detroit (7-5) fell to Green Bay on the holiday, 31-24, as the Lions have alternated wins and losses over their last eight games. However, the Lions won the last meeting between the teams, 47-9 in 2024, which is Dallas' largest margin of defeat since 1988. CB Trevon Diggs (knee), OL Tyler Guyton (ankle) and Jadeveon Clowney (hamstring) have been ruled for for Dallas, while Amon-Ra St. Brown (ankle) is active for Detroit.Kickoff is at 8:15 p.m. ET from Ford Field in Detroit. The Lions' victory in their 2024 matchup ended a six-game win streak by Dallas in the head-to-head series. Detroit is a 3.5-point favorite in the latest Lions vs. Cowboys odds. Meanwhile, the over/under for total points is 55.5. Detroit is at -181 on the money line (risk $181 to win $100). Before making any Cowboys vs. Lions picks, make sure to check out the 'Thursday Night Football' predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks. He's SportsLine's No. 1 NFL expert this year with a 133-110 (+1724) run on all NFL picks and is an outstanding 34-22-2 (+1064) run over his last 58 NFL picks in Lions games. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Lions vs. Cowboys and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Cowboys vs. Lions:Lions vs. Cowboys                 spreadDetroit -3.5 at DraftKings SportsbookLions vs. Cowboys                       over/under55.5 pointsLions vs. Cowboys                       money line Detroit -181, Dallas +151Lions vs. Cowboys                   picksSee picks at SportsLineLions vs. Cowboys                       streaming Amazon PrimeWhy the Cowboys can coverDallas is 5-1 ATS as an underdog and has both won and covered in three straight games overall, including the last two coming versus last year's Super Bowl participants in the Chiefs and Eagles. Meanwhile, Detroit has lost three straight versus the spread, and it lost one of its best playmakers in Sam LaPorta (back). While Detroit still has its backfield of Jahmyr Gibbs and David Montgomery to lean on, the run defense has been the biggest improvement for Dallas recently. Since acquiring Quinnen Williams from the Jets, Dallas has allowed just 69.7 rushing yards, which is less than half of the 143 yards per game it allowed in nine games prior to his arrival. See which team to back at SportsLine. Why the Lions can coverThese teams met in October 2024 -- in Dallas -- in which the Lions' 38-point victory was their third-largest road win, ever, while the game also marked Dallas' fourth-largest home loss in franchise history. So, Detroit should feel very confident it can take care of business at home, as the Cowboys average 6.9 fewer points on the road than in Dallas. Dan Campbell also knows how to get the best out of his team after a defeat, as the Lions have remarkable resiliency in terms of spread success. Since the start of the 2023 season, the Lions are 10-1 ATS (90.9%) following a straight-up defeat, while Dallas is just 11-13 ATS (45.8%) after a win over that same time frame. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Cowboys vs. Lions  picksWhite has analyzed Lions vs. Cowboys from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Cowboys vs. Lions, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Lions vs. Cowboys spread you need to jump on, all from the expert that is 34-22-2 on his last 58 Detroit picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg"
      ],
      "datePublished": "2025-12-05T00:09:04.000Z",
      "dateModified": "2025-12-05T00:09:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Projection model says Ravens-Steelers matchups will determine AFC North title - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-ravens-steelers-matchups-will-determine-afc-north-champ-according-to-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/26/a5f5fc57-e181-493b-9f72-0f434064cfdb/thumbnail/1200x675/c926561d8f4b1069e5865b4f4da14f58/aaron-rodgers-steelers-bengals-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-04T21:09:04.000Z",
    "description": "\nIn nine seasons in the NFL, Baltimore Ravens defensive back Marlon Humphrey has earned first-team All-Pro honors twice, reached the Pro Bowl four tim",
    "body": "\nIn nine seasons in the NFL, Baltimore Ravens defensive back Marlon Humphrey has earned first-team All-Pro honors twice, reached the Pro Bowl four times and was named the team MVP once. So when he speaks up, the message just means more.And earlier this week, Humphrey didn't mince any words when talking about the importance of Sunday's showdown against the rival Pittsburgh Steelers. \"If you can't get up for this one, I think that shows something about your character,\" he said. \"I think that shows something about your will. And honestly I think that just shows if you are a Raven or if you're not a Raven. And I think how we come out [of] this game, how we prepare this week, will kind of do echoes not only for this game, but for the rest of the season because we're basically in playoff football right now.\"They say there's no game that's a must-win game. [But] this is definitely a must-win game.\"The SportsLine Inside the Lines team and Projection Model agree with Humphrey that much will be on the line on Sunday at M&T Bank Stadium. With just five weeks remaining in the regular season, the teams enter Week 14 tied for the lead in the AFC North at 6-6. (Baltimore technically holds the tiebreaker over Pittsburgh by virtue of a better winning percentage in common games.) They are two games clear of the third-place Bengals and four games ahead of the last-place Browns. According to the Projection Model, which simulates every NFL game 10,000 times, the division title will essentially come down to the two games the Ravens and Steelers have to play this season: Sunday's and the regular season finale at Pittsburgh in Week 18. Both teams have roughly the same chance to win the AFC North entering Week 14 (48.9% for Baltimore and 44.9% for Pittsburgh). Both would have greater than a 90.0% chance to win the division with a sweep of the other, and both would be nearly eliminated by being swept by the other.Ravens' chance to win AFC NorthCurrent48.9%0-2 vs. Steelers1.0%1-1 vs. Steelers45.0%2-0 vs. Steelers92.0%Steelers' chance to win AFC NorthCurrent44.9%0-2 vs. Ravens1.5%1-1 vs. Ravens47.6%2-0 vs. Ravens96.8%The most interesting scenario is if the teams split the two matchups. If that happens, the Steelers would have a slight edge, according to the model. Why? They have a slightly easier schedule. Pittsburgh's other three games are against the Dolphins (5-7), at the Lions (7-5) and at the Browns (3-9), while Baltimore's other games are at the Bengals (4-8), against the Patriots (11-2) and at the Packers (8-3-1). The Ravens' remaining strength of schedule (55.9%) ranks as the third-most difficult in the league, behind only the Chargers and Bears.Add in the fact that Sunday's game is at Baltimore, and the conclusion is obvious: Sunday's game means more to the Ravens than the Steelers. Baltimore is a 5.5-point favorite against Pittsburgh.\nSunday's game is set to be the first between Lamar Jackson and Aaron Rodgers, who have combined for six MVP awards. But neither is playing his best football, and both are nursing injuries. Jackson has just 98 rushing yards in five games since returning from a hamstring ailment, the worst in a five-start stretch in his career. Also, over his last three games he has completed just 44 of 80 passes for 592 yards, zero touchdowns and three interceptions. He did not practice on Thursday because of an ankle injury.Meanwhile, Rodgers has passed for 161 yards or fewer in his last three starts. This is the first time the future Hall of Famer has passed for 175 yards or fewer in three straight starts in his career. Rodgers, who has been dealing with a fractured left wrist since Week 11, returned to practice on Thursday.Rodgers and the Steelers are just 2-5 in their last seven games. \"We still control our own destiny,\" Pittsburgh linebacker Payton Wilson said earlier this week. He added, \"We still have a chance to have home playoff games, win this division, and that's kind of what's on our mind. This Sunday is obviously one of the biggest tests for that.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Projection model says Ravens-Steelers matchups will determine AFC North title - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/26/a5f5fc57-e181-493b-9f72-0f434064cfdb/thumbnail/1200x675/c926561d8f4b1069e5865b4f4da14f58/aaron-rodgers-steelers-bengals-cbs-imagn.jpg"
      ],
      "datePublished": "2025-12-04T21:09:04.000Z",
      "dateModified": "2025-12-04T21:09:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions vs. Cowboys updates: Dak Prescott says he's ready to light up Detroit defense - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-vs-cowboys-updates-dak-prescott-detroit-defense/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/cad10235-03db-45ce-8a22-b221bac2b8aa/thumbnail/1200x675/82b728888eff5c9e21c7904e57b35a04/dak.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:29:09.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Dallas Cowboys look to make it four straight w",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Dallas Cowboys look to make it four straight wins on Thursday night, as \"America's Team\" kicks off Week 14 against the Detroit Lions. Quarterback Dak Prescott ranks top two in the NFL in passing yards (3,261) and passing touchdowns (25) this season, and he expects another massive performance. When Prescott arrived at Ford Field Thursday afternoon, NFL Media's Jane Slater asked him what he remembers from his last game in Detroit. \"That we lit them up,\" Prescott said. \"Lot of passing yards. About to do it again.\"When Slater asked Prescott if she could quote him on that, he replied with a confident, \"sure.\"\nThe last time the Cowboys played in Detroit was in November 2019. In a 35-27 Cowboys victory, in which the Dallas offense racked up 509 yards of total offense, Prescott completed 29 of 46 passes for a whopping 444 yards and three touchdowns. Michael Gallup caught nine passes for 148 yards, while Randall Cobb caught four passes for 115 yards and a touchdown. The Lions were in an entirely different era, as Jeff Driskel started at quarterback, while Bo Scarbrough was Detroit's leading rusher.However, the last time the Lions and Cowboys met, it was not very pretty. Detroit eviscerated Dallas at AT&T Stadium last year, 47-9. It marked the largest home loss under Jerry Jones. \nPrescott cleared 300 yards passing in each of the last two games, and threw multiple touchdowns in both matchups as well. According to FanDuel Sportsbook, Prescott's passing yards Over/Under is set at 275.5. He averages 271.8 passing yards through 12 games this season. The Cowboys are 3.5-point underdogs. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions vs. Cowboys updates: Dak Prescott says he's ready to light up Detroit defense - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/cad10235-03db-45ce-8a22-b221bac2b8aa/thumbnail/1200x675/82b728888eff5c9e21c7904e57b35a04/dak.jpg"
      ],
      "datePublished": "2025-12-04T22:29:09.000Z",
      "dateModified": "2025-12-04T22:29:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Madison hires Billy Napier as ex-Florida coach returns to Sun Belt - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/james-madison-billy-napier-head-coach-florida/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/5df8cc93-c381-45a0-bef0-e2323e06ec05/thumbnail/1200x675/50a3ce712c5ad03a9b06f6b1598dfda3/billy-napier.png",
    "tag": "Sports",
    "date": "2025-12-04T22:25:17.000Z",
    "description": "\n        Billy Napier is set to make his return to the Sun Belt Conference. James Madison is hiring Napier to fill the coaching vacancy left by Bob Ch",
    "body": "\n        Billy Napier is set to make his return to the Sun Belt Conference. James Madison is hiring Napier to fill the coaching vacancy left by Bob Chesney, sources confirmed to CBS Sports' Matt Zenitz. Chesney will depart James Madison for UCLA whenever the Dukes' postseason run ends. James Madison is set to face off against Troy in the Sun Belt Championship Game on Friday, and the Dukes are also in College Football Playoff contention after they landed at No. 25 in that latest set of rankings. It didn't take long for Napier to land another job after he was fired by Florida in October amid a 3-4 start to the 2025 season. Napier's Gators entered the year at No. 15 in the AP Top 25 poll, and the expectation was that they would compete for a spot in the College Football Playoff after a solid close to the 2024 campaign and the return of several key contributors, including quarterback DJ Lagway and top offensive lineman Jake Slaughter. But an early upset loss to South Florida knocked Florida out of the rankings entirely and precipitated an early three-game losing skid for the Gators. A stunning win against No. 9 Texas wasn't enough to save Napier, who left Gainesville after four seasons and a 22-23 overall record. \nHe won just one bowl game with the Gators and never finished above .500 in conference play. Prior to his hiring at Florida, Napier spent four seasons as the coach at Louisiana from 2018-21. He's also served as an assistant at Clemson (2006-10), Colorado State (2012), Alabama (2013-16) and Arizona State (2017). Napier is proven in Sun Belt After taking huge swings on upside in each of its last two hiring cycles, James Madison is turning to a proven name to take it into its next era. No coach on the market comes with more high-level Sun Belt experience than Napier. \nHe was one of the Sun Belt's top coaches during his tenure at Louisiana. He led the Ragin' Cajuns to four-straight Sun Belt West division titles and won the conference two years in a row from 2020-21. Louisiana also finished ranked inside the top-20 of the AP poll in each of those seasons. He won at least 10 games from 2019-21 and boasted a 22-2 Sun Belt record in that same span. The Ragin' Cajuns also made a bowl in each of his four years with the program. He was the first coach since 2011-14 to lead Louisiana to four consecutive bowl games. Can Napier maintain James Madison's success?James Madison has emerged as one of the Group of Five's premier programs since its move from the FCS to the FBS level in 2022. Though he was never able to compete for a Sun Belt title due to the NCAA's regulations for schools in a transitional period, former coach Curt Cignetti was crucial for establishing James Madison's run of dominance. \nHe guided the Dukes to an 8-3 record in their first year as an FBS institution and followed that up with an 11-1 showing in 2023. James Madison finished atop the Sun Belt East division and earned a bid to the Armed Forces Bowl since there weren't enough eligible teams that qualified for a bowl. Cignetti parlayed that success into an opportunity at Indiana, where he has a 23-2 record over two seasons. The Hoosiers currently sit at No. 2 in the College Football Playoff Rankings and they're gearing up for a program-first appearance in the Big Ten Championship Game. James Madison hired Chesney, a former coach at FCS Holy Cross, to replace Cignetti. Chesney followed a solid 9-4 effort from 2024 with his 11-1 record this season, including a sterling 8-0 showing in Sun Belt play. Like Cignetti, Chesney used his success at JMU to earn a shot at UCLA. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Madison hires Billy Napier as ex-Florida coach returns to Sun Belt - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/5df8cc93-c381-45a0-bef0-e2323e06ec05/thumbnail/1200x675/50a3ce712c5ad03a9b06f6b1598dfda3/billy-napier.png"
      ],
      "datePublished": "2025-12-04T22:25:17.000Z",
      "dateModified": "2025-12-04T22:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Cowboys vs. Lions: Live stream, kickoff time, TV channel, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-vs-lions-where-to-watch-pick-odds-prediction-tnf-week-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/e1559539-9a88-431d-9b19-620ebb300f9c/thumbnail/1200x675/9d57884d824baaf3c6f6dd1fc2444006/prescott-goff.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:00:44.000Z",
    "description": "\n        FRISCO, Texas -- The official start of the 2025 NFL postseason is still about a month away, but for the Dallas Cowboys (6-5-1) and Detroit Li",
    "body": "\n        FRISCO, Texas -- The official start of the 2025 NFL postseason is still about a month away, but for the Dallas Cowboys (6-5-1) and Detroit Lions (7-5), it's pedal to the metal right now. With both teams sitting just outside the NFC playoff picture as the eight (Lions) and nine (Cowboys) seeds, they know it's essentially do or die on \"Thursday Night Football.\"Even Dallas quarterback Dak Prescott has begun to peek at the playoff standings, something he usually refrains from doing.Bet Lions vs. Cowboys at Bet365 Sportsbook, where new users get $150 in bonus bets using the bonus code CBSBET365:\"I did the other day. It was just more -- I wouldn't say by accident, but I was just watching TV, right? It came up there showing the AFC, so I'm thinking, 'What's the NFC look like?' I went and checked it out,\" Prescott said Monday. \"And I guess nothing different than what I've said, right? It's about us controlling what we control, winning the games in front of us. I don't think we're in a position where we can truly count wins and losses from other teams. I think if we just win and handle our business, we'll put ourselves in a great spot.\"\nSo what does controlling what they can control mean to Prescott? The need to win out with no margin for error.\"I said it three weeks ago, just being honest with you, and nothing's changed,\" Prescott said of Dallas' season being in a place where it's win or bust. \"As I said then, and we say it now, you can't even think of it as one game at a time. We just have to do our absolute best every day and take advantage of it. Be good with the results we go out there and put.\"Despite being on a three-game winning streak that includes wins over the last two Super Bowl champions -- the Philadelphia Eagles and Kansas City Chiefs, the Super Bowl LIX participants -- the Cowboys are still walking a tightrope in terms of their playoff chances. The same goes for the Lions, a team that has alternated wins and losses across their last eight games. \nCBS Sports' SportsLine model puts both squads at nearly a 50% chance to reach the postseason with a victory Thursday night in Detroit, while the loser's playoff hopes will be all but cooked.Playoff chances by Week 14 resultCowboysLionsWin 42%53%Loss10%19%Here's everything you need to know to catch the Cowboys-Lions showdown, including key matchups and our prediction:Where to watch Cowboys vs. LionsDate: Thursday, Dec. 4 | Time: 8:15 p.m. ETLocation: Ford Field (Detroit)Stream: Amazon PrimeFollow: CBS Sports AppOdds: Lions -3, O/U 54.5 (via DraftKings Sportsbook)Bet Cowboys vs. Lions and other NFL Week 14 games at DraftKings Sportsbook, where new users get $200 in bonus bets if their first bet of at least $5 wins.Cowboys vs. Lions: Need to knowCowboys' George Pickens nearly unstoppable on slants\nExplosive Dallas wide receiver George Pickens is having a season for the ages in Year 1 as a Cowboy. His 1,142 receiving yards rank second in the league, and with just 39 yards on Thursday, he'll break Dallas' all-time record for the most receiving yards in a player's first season with the Cowboys. Pro Football Hall of Famer Terrell Owens currently holds that mark with 1,180 yards back in 2006.Why has Pickens been so successful playing alongside Prescott and All-Pro wide receiver CeeDee Lamb? For one, he's been the most elusive player in the NFL after the catch: Pickens' 19 forced missed tackles are the most in the league, according to Pro Football Focus. He's also been dominant over the middle, with the second most catches (33) and receiving yards (576) on in-breaking routes in 2025. Only the NFL's overall receiving yards leader, the Seahawks' Jaxon Smith-Njigba (1,336), has been better on those routes with 36 catches for 586 yards.\"Just certain leverage, just getting open. I've kind of beat both of them [inside or outside leverage], so like sometimes I don't even have the leverage. I still catch it. I feel like a slant is not too much. It's a short route, so everything is just pretty much me. If he guards me and I make a contestant catch, or I just cook him off the line,\" Pickens said Monday. \"I got just a quick twitch. Whether he's inside, I can do a certain move to make him get outside. If he's outside, I can leave him there. It's a lot of stuff.\"\n        \n            \n                Early predictions for top 2026 NFL free agents: Potential landing spots for Aaron Rodgers, George Pickens\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \nIn Pickens' mind, there's nothing a defender can do to slow him down when he wants to get open on a slant. Should a cornerback play tight, press man coverage, he's more than happy to run a vertical, deep route -- a \"go ball.\" Pickens' 15.6 yards per reception this season is the sixth-best in the league, and only Smith-Njigba (21) has more catches of 20-plus yards than his 18.In Pickens' mind, there's nothing a defender can do to slow him down when he wants to get open on a slant. Should an opposing cornerback play tight, press man coverage, he's more than happy to run a vertical, deep route aka a \"go ball.\" Pickens' 15.6 yards per reception this season is the sixth-best in the league, and only Smith-Njigba (21) has more catches for 20-plus yards than his 18. \"It's kind of inevitable. It's going to happen regardless. Because I can beat it against two-man, man, three, four. It's a window thing. … There's nothing they can do to win,\" Pickens said Monday. \"I got the go ball. I got the stop route, slant. Now they're kind of focusing on the slant, and I still got the go ball. There's a lot of stuff.\"\nThe Steelers utilized Pickens as a pure deep threat in his last two seasons there (2023 and 2024) before he was traded to Dallas. Here's his route heat map from TruMedia, with the brightest yellow areas along the sidelines.\n                                                                    TruMedia\n                                                            However, as a Cowboy this season, Dallas has added more variety to his route tree, using him much more over the middle of the field while still giving him deep-shot opportunities with Prescott. Pickens said that variance is one of the biggest reasons for his breakout this season.\"It's been great. That's one of the things that I'm glad you talk about because that's one of the things that I remember me saying earlier in the year,\" Pickens said. \"That if you see me with a more versatile route tree, then you can kind of see what I can do.\"\n\n                                                                    TruMedia\n                                                            \nWhat will Amon-Ra St. Brown's impact be? Detroit may or may not have the services of their No. 1, All-Pro wide receiver Amon-Ra St. Brown on Thursday night. He suffered a low ankle sprain on Thanksgiving against the Packers that knocked him out of that game and has him officially listed as questionable for Week 14. His presence -- or absence -- will be a major factor for the Lions. St. Brown's 505 career receptions have him just six catches away from breaking Michael Thomas' record (510) for the most through five seasons in NFL history. Detroit also ranks first in the NFL in yards per play (6.1) across the last five seasons with St. Brown on the field; without him, that figure drops to 25th (5.0).\nIf he's not out there, the Lions will be in uncharted territory without both St. Brown and Pro Bowl tight end Sam LaPorta, who is currently on injured reserve with a back injury. Detroit has played just 5% of its offensive snaps since drafting LaPorta in 2023 without both him and St. Brown on the field. Four offensive line starters -- All-Pro right tackle Penei Sewell (shoulder), Pro Bowl left tackle Taylor Decker (shoulder/rest), center Graham Glasgow (knee) and left guard Kayode Awosika (foot) -- are also questionable.\nLions NFL ranks with Amon-Ra St. Brown on/off field (since 2021)OnOffOffensive efficiency 2nd16thYards per play1st25thCan Cowboys' new-look defense contain Jahmyr Gibbs and Co.?\nThe Cowboys' defense transformed from one of the worst in football through the first nine weeks of the season to one of the NFL's best at stopping the run and rushing the passer -- all while becoming a league-average scoring defense. The trade-deadline acquisition of Jets All-Pro defensive tackle Quinnen Williams has been transformative. His 21 quarterback pressures are the third most in the league since he made his Dallas debut in Week 11, and they're already more than the 19 he had in eight games as a Jet this season.\"Yeah, it's really everybody. Everybody's all 11, all together all the time. That's been the biggest improvement, but when you add a very talented All-Pro player in the middle, you get middle pressure,\" Cowboys defensive coordinator Matt Eberflus said Monday. \"When you have the threat of middle pressure, that creates a lot of one-on-ones for somebody else. That's the biggest thing, like for the [defensive tackles] Osa [Odighizuwa] or KC [Kenny Clark] or whoever might be in there. That's what that [an All-Pro DT in Williams] creates because you've got to move people to him. That creates opportunities for somebody else.\"Cowboys With/without Quinnen Williams This Season (NFL ranks)Without (Weeks 1-9)With (Weeks 11-13)W-L3-5-1 (19th)3-0  (T-1st)PPG allowed30.8  (31st)21.7 (16th)Total YPG allowed397.4  (31st)312.3  (14th)Rush YPG allowed143.0  (29th)69.7 (2nd)QB pressures135 (3rd)55 (2nd)QB pressure rate39.8% (9th)41.7% (3rd)Sacks20 (T-17th)8 (T-6th)Takeaways7 (T-23rd)3 (T-18th)* On bye week in Week 10\nThe improvement Dallas has made -- from being a bottom-five run defense to the second-best in the NFL (69.7 rushing yards per game allowed) since Week 11 -- will be tested by the Lions' two-headed monster of Jahmyr Gibbs and David Montgomery. Since they became a tandem in 2023, Gibbs (36 rushing touchdowns, second most among running backs) and Montgomery (31 rushing touchdowns, sixth most) have become the first running back duo in the Super Bowl era (since 1966) to each run for more than 30 touchdowns in a three-season span.\"Yeah, D-Mo is a real pro, very serious, very intense. He's a damn good runner, and he's done a good job for those guys. The 1-2 punch that they have is something that you don't have in the NFL, and they have it,\" Eberflus said. \"Gibbs is just one of the best in the league in terms of his burst, in terms of his ability to capture edges in the run game and then in space. When he's in space, he's electric. So, we got our hands full with them.\"\nCowboys vs. Lions prediction, pick\nThe Cowboys are the healthier team at this point in the season. Detroit's banged up offensive line won't be able to hold up for all 60 minutes against Dallas' three-headed monster at defensive tackle of All-Pro Quinnen Williams, three-time Pro Bowler Kenny Clark and Osa Odighizuwa. \nPick: Cowboys 35, Lions 31 | (Dallas +3, Over 54.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Cowboys vs. Lions: Live stream, kickoff time, TV channel, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/e1559539-9a88-431d-9b19-620ebb300f9c/thumbnail/1200x675/9d57884d824baaf3c6f6dd1fc2444006/prescott-goff.jpg"
      ],
      "datePublished": "2025-12-04T22:00:44.000Z",
      "dateModified": "2025-12-04T22:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-lions-prediction-odds-line-spread-time-week-14-thursday-night-football-nfl-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png",
    "tag": "Sports",
    "date": "2025-12-05T00:03:30.000Z",
    "description": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dall",
    "body": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dallas is coming off a 31-28 win over the Kansas City Chiefs, while Detroit dropped a 31-24 decision to the Green Bay Packers on Thanksgiving Day. The Cowboys (6-5-1), who have won three in a row, are just 1.5 games behind Philadelphia for the NFC East lead. The Lions (7-5), who have lost three of five, have fallen two games behind Chicago in the NFC North. Lions receiver Amon-Ra St. Brown (ankle) is active, while safety Kerby Joseph (knee) is inactive.Kickoff from Ford Field in Detroit is set for 8:15 p.m. ET. The Cowboys lead the all-time series 19-13, but the Lions won last year's meeting 47-9. The Lions are 3.5-point favorites in the latest Cowboys vs. Lions odds, while the over/under for total points scored is 55.5 via SportsLine consensus. Detroit is at -181 on the money line (risk $181 to win $100), while Dallas is at +151 (risk $100 to win $151). Before making any Cowboys vs. Lions picks, check out the NFL predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Cowboys vs. Lions. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Lions vs. Cowboys:Cowboys vs. Lions                                                             spreadDetroit -3.5 at DraftKings SportsbookCowboys vs. Lions         over/under55.5 pointsCowboys vs. Lions                                                                                                                                                                         money line Detroit -181, Dallas +151Cowboys vs. Lions                                                                                                                                                                 picksSee picks at SportsLineCowboys vs. Lions                                                                                                                                                                   streaming Prime VideoWhy the Lions can coverVeteran quarterback Jared Goff helps power the Detroit offense. In 12 games this season, he has completed 69.8% of his passes for 3,025 yards and 25 touchdowns with five interceptions and a 110.2 rating. In last week's loss to the Packers, he completed 20 of 26 passes for 256 yards and two touchdowns. He also carried once for 24 yards. In a 34-27 overtime win over the New York Giants on Nov. 23, he completed 28 of 42 passes for 279 yards and two touchdowns with one interception.Another weapon on offense is running back Jahmyr Gibbs. In 12 games, he has carried 175 times for 1,019 yards (5.8 average) and 10 touchdowns. He has had 10 explosive plays of 20 yards or more, including a long of 78, with 46 first-down conversions. In the win over the Giants, he carried 15 times for 219 yards (14.6 average) and two touchdowns. He also caught 11 passes for 45 yards and a score. See which team to back at SportsLine. Why the Cowboys can coverTen-year veteran quarterback Dak Prescott leads the Dallas offense. In 12 starts, he has completed 69.3% of his passes for 3,261 yards and 25 touchdowns with eight interceptions and a 102.4 rating. He has also rushed 41 times for 124 yards and two touchdowns. In the win over Kansas   City, he completed 27 of 39 passes (69.2%) for 320 yards and two touchdowns with one interception. His top target is fourth-year veteran wide receiver George Pickens. In 12 games, he has 73 receptions for 1,142 yards and eight touchdowns. In the win over the Chiefs, he caught six passes for 88 yards. He caught nine passes for 146 yards and one touchdown in a 24-21 win over the Philadelphia Eagles on Nov. 23. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Cowboys vs. Lions picksSportsLine's model is going Over on the total, projecting 56 combined points. It also says one side of the spread hits in well over 50% of simulations.         You can only get the pick at SportsLine. So who wins Cowboys vs. Lions, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Cowboys vs. Lions spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png"
      ],
      "datePublished": "2025-12-05T00:03:30.000Z",
      "dateModified": "2025-12-05T00:03:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Cowboys-Lions TNF, Warriors-76ers and NHL on Thursday, Dec. 4 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-cowboys-lions-tnf-warriors-76ers-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/c22518c8-65e7-4a53-9194-f4ed84717786/thumbnail/1200x675/d2f128a5fc3ea370a553ae5eee493ab8/jared-goff-jahmyr-gibbs.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:30:40.000Z",
    "description": "\nAs we head into the final stretch of the 2025 NFL season, the Dallas Cowboys and Detroit Lions are fighting for their playoff lives with five games r",
    "body": "\nAs we head into the final stretch of the 2025 NFL season, the Dallas Cowboys and Detroit Lions are fighting for their playoff lives with five games remaining. Postseason hopes could be crushed for one team as Week 14 begins when the Cowboys visit the Lions at 8:15 p.m. ET on Thursday Night Football.Dallas (6-5-1) shockingly has gotten itself in the playoff picture by posting three consecutive victories, including a 31-28 triumph over the Kansas City Chiefs last week. The Cowboys are 1 1/2 games behind the defending Super Bowl champion Philadelphia Eagles in the NFC East and remain in the hunt for the third wild card spot in the conference, which currently is occupied by the 9-4 San Francisco 49ers.The Lions (7-5) have lost three of their last five contests and trail the first-place Chicago Bears (9-3) in the NFC North by two games. They also are 1 1/2 games behind the 49ers in the wild card race. A loss on Thursday would severely damage both Detroit and Dallas' postseason chances.Five games are on Thursday's NBA schedule, including a matchup between the Golden State Warriors (11-11) and Philadelphia 76ers (11-9) at 7 p.m. ET at Xfinity Mobile Arena. The Warriors are kicking off a three-game road trip after a 2-3 homestand, while the 76ers are wrapping up a three-game stretch at home.The NHL has 10 contests on its slate, one of which has the league-best Colorado Avalanche (19-1-6) looking to extend their point streak to 18 games when they visit the New York Islanders (14-10-3) at 7 p.m. ET. Colorado has gone 14-0-3 since suffering its lone regulation loss of the season, a 3-2 setback against the Boston Bruins on Oct. 25.The Lions are 3-point favorites against the Cowboys in the latest consensus NFL odds. Meanwhile, the 76ers are 3.5-point favorites against the Warriors and the Avalanche are -194 favorites on the money line against the Islanders.Below is a snapshot of what to watch and bet for Thursday, Dec. 4. All times EasternNFL best bets, where to watchCowboys at LionsTime: 8:15 p.m. | Location: Detroit | TV: Prime Video | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Cowboys +3 (-109) | Expert: Jake Ferguson Under 5.5 receptions (Alex Selesnick)The Cowboys have looked like a different team since returning from their Week 10 bye as they rolled past the Las Vegas Raiders and rallied from 21 points down to knock off the Eagles 24-21 before edging the Chiefs last week. Detroit has sandwiched losses to Philadelphia and the Green Bay Packers around an overtime triumph over the New York Giants in which it needed to overcome a 10-point deficit in the fourth quarter. The SportsLine Projection Model likes Dallas to cover the spread on Thursday Night Football, as it is calling for a 29-27 victory by Detroit. SportsLine props expert Alex Selesnick (+1090 on his last 74 NFL player prop picks) doesn't see Cowboys tight end Jake Ferguson making a ton of catches, as six receptions is a tall order for any player and Ferguson hasn't hauled in more than five passes in any of his last five outings.NBA best bets, where to watchWarriors at 76ersTime: 7 p.m. | Location: Philadelphia | TV: NBA TV | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Warriors +3.5 (-114) | Expert: 76ers -162 (Matt Severance)Golden State is just 4-8 away from home this season but went 3-3 on its last road trip, during which it reeled off three consecutive victories - including a pair at San Antonio. Meanwhile, Philadelphia is only 6-6 at home and lost four straight on its own court before defeating the Washington Wizards on Tuesday. Even though Stephen Curry (quadriceps) is out and Jimmy Butler (knee) is questionable, the SportsLine Projection Model expects a close game as the Warriors cover the spread in 67% of its simulations. However, SportsLine expert Matt Severance (+262.5 on his last 32 NBA money-line picks) believes Philadelphia will come away with the victory despite feeling that any player could opt out of the lineup at the last minute for any reason whatsoever.NHL best bets, where to watchAvalanche at IslandersTime: 7 p.m. | Location: Elmont, N.Y. | TV: ESPN+ | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Avalanche -194 | Expert: Islanders +1.5 (-143, Matt Severance)The Avalanche just don't lose in regulation. They have won 12 of their last 13 games, with their only setback during that stretch coming in a shootout, and their lone 60-minute defeat of the season occurred more than a month ago. The Islanders have won only two of their last six contests, and they failed to score a goal in one of the victories as they defeated the Seattle Kraken 1-0 in a shootout. The SportsLine Projection Model doesn't see New York beating Colorado, as its simulations say the Avalanche win 65% of the time. But SportsLine expert Matt Severance feels the Islanders will cover the puck line as they will be going against backup goaltender Mackenzie Blackwood instead of No. 1 netminder Scott Wedgewood, who is dealing with a back injury.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Cowboys-Lions TNF, Warriors-76ers and NHL on Thursday, Dec. 4 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/c22518c8-65e7-4a53-9194-f4ed84717786/thumbnail/1200x675/d2f128a5fc3ea370a553ae5eee493ab8/jared-goff-jahmyr-gibbs.jpg"
      ],
      "datePublished": "2025-12-04T20:30:40.000Z",
      "dateModified": "2025-12-04T20:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/\n                    ",
    "image": "https://sportsfly.cbsistatic.com/fly-359/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "tag": "Sports",
    "date": "2025-12-04T23:23:45.000Z",
    "description": "\n                \n                    Analysis\n                \n                \n                                            What could wind up as the",
    "body": "\n                \n                    Analysis\n                \n                \n                                            What could wind up as the highest total of the NFL season is, well, too high. Dallas' defense has improved dramatically over the past three weeks, and it squares off against an offense missing TE Sam Laporta, (probably) WR Amon-Ra St. Brown and scattered linemen. The Cowboys could take the field without OT Tyler Guyton, idled on Thanksgiving Day, and the Lions' defense is better than widely perceived, ranking 13th in yards allowed. All analysis aside, with a number this huge, the way to go is low.  \n                                    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
      "image": [
        "https://sportsfly.cbsistatic.com/fly-359/bundles/sportsmediacss/images/fantasy/default-article-image-large.png"
      ],
      "datePublished": "2025-12-04T23:23:45.000Z",
      "dateModified": "2025-12-04T23:23:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama vs. Georgia prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/alabama-georgia-prediction-pick-odds-spread-where-to-watch-live-sec-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/0192f135-64bc-4d48-aa8a-bac7630f524c/thumbnail/1200x675/8c758ed9f20cb8b0071ddb24b2b7b431/bama-vs-georgia.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:50:11.000Z",
    "description": "\n        One of college football's great modern rivalries will take center stage on Saturday afternoon as No. 3 Georgia squares off against No. 9 Alab",
    "body": "\n        One of college football's great modern rivalries will take center stage on Saturday afternoon as No. 3 Georgia squares off against No. 9 Alabama in the SEC Championship Game. This will be the fifth time the Bulldogs and Crimson Tide have met in the SEC Championship Game (2012, 2018, 2021, 2023, 2025), and also the third time these two have played since the start of the 2024 season. Heading into the matchup, Alabama is 4-0 against Georgia in SEC Championship Games and 7-1 overall against the Bulldogs since Kirby Smart left Nick Saban's staff to take over as the new head coach in Athens.Kalen DeBoer has already notched two victories against Georgia in his short time as Alabama's coach, winning a 41-34 thriller last season in Tuscaloosa and then backing it up with a hot start in a 24-21 win in Athens back in September. Alabama won a 27-20 nail-biter in the Iron Bowl on Saturday to clinch its spot in the SEC Championship Game, emerging along with Georgia from a four-way tie for first place that also included Ole Miss and Texas A&M. The Bulldogs concluded their conference schedule with an emphatic 35-10 win against Texas back on Nov. 15, then closed the regular season with wins against Charlotte and Georgia Tech. Getting this matchup for the third time in five seasons does not lessen the passion at play between two proud programs who still value holding the crown in one of college football's toughest conferences. Let's get into some of the things to know about this top-10 bout and what to expect on Saturday in Atlanta.    Alabama vs. Georgia: Need to know  Comeback kings: Georgia trailed in seven of its eight SEC games this season yet finished with a 7-1 record thanks to clutch play and great second-half adjustments. The Bulldogs were down on the road in wins at Tennessee and Auburn, and threw haymakers back and forth with Ole Miss in a 43-35 win in Athens. Even the one SEC loss this season, against Alabama in September, included a second-half shutout by the Georgia defense and multiple possessions where the Bulldogs had a chance to tie or take the lead. The only SEC game where Georgia went wire-to-wire was a 35-14 home win against Kentucky. Kalen DeBoer shines against the best: Alabama coach Kalen DeBoer is 19-4 in 23 games against AP Top 25 teams as a head coach, including a 6-1 record against top-10 opponents. Since arriving at Alabama, DeBoer is 7-1 against top 25 teams with the lone loss being the 23-21 defeat against Oklahoma on Nov. 8. At one point during his tenures at Fresno State and Washington, DeBoer had a 12-game winning streak against ranked opponents that only came to an end in the national championship game against Michigan. \nNew starters have succeeded at QB: Alabama and Georgia both started 2025 with new full-time starters at quarterback, and since both have arrived here in the SEC Championship Game with top-10 rankings and national title aspirations it's fair to say both campaigns have been a success. Alabama quarterback Ty Simpson has the best touchdown-to-interception ratio in the SEC with 25 touchdowns and just four interceptions, while also ranking third in the conference with 3,056 passing yards on the season. Gunner Stockton has been effective for Georgia as well, though in different ways. Heading into the SEC Championship Game, Stockton ranks second only to Diego Pavia in the SEC for completion percentage (70.2%) and has racked up 28 total touchdowns (20 passing, eight rushing) on the season.  Where to watch Alabama vs. Georgia live  Date: Saturday, Dec. 6 | Time: 4 p.m. ET  Location: Mercedes-Benz Stadium -- Atlanta, Georgia  TV: ABC | Live stream: Fubo (Try for free)  Alabama vs. Georgia prediction, picks  \nAlabama's offensive form has taken a step back since mid-October, with the Crimson Tide failing to score 30 points in their last four games against FBS opponents. That lack of rhythm could make it tougher for the hot start that Kalen DeBoer has been able to defend in both of his wins against Georgia, and thus create a different matchup when Kirby Smart and the Bulldogs ultimately make their adjustment. Pick: Georgia -2.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            UGA -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama vs. Georgia prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/0192f135-64bc-4d48-aa8a-bac7630f524c/thumbnail/1200x675/8c758ed9f20cb8b0071ddb24b2b7b431/bama-vs-georgia.jpg"
      ],
      "datePublished": "2025-12-04T20:50:11.000Z",
      "dateModified": "2025-12-04T20:50:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami (OH) vs. Western Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-oh-western-michigan-prediction-pick-odds-spread-where-to-watch-live-mac-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/eeeb22b8-4dfc-46b1-804a-88d9de9eb036/thumbnail/1200x675/010cf482236c9bae7059e041e9e3e883/adobe-express-file-2025-12-02t125423-932.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:48:20.000Z",
    "description": "\n        Miami (Ohio) and Western Michigan are set to meet for the second time this season in Saturday afternoon's MAC Championship Game. The RedHawks",
    "body": "\n        Miami (Ohio) and Western Michigan are set to meet for the second time this season in Saturday afternoon's MAC Championship Game. The RedHawks won the first matchup 26-17 on Oct. 25, improving their all-time edge in the series to 39-24-1 across 64 meetings. The MAC title game is familiar territory for Miami. This marks the RedHawks' third straight appearance, after losing to Ohio in 2024 and beating Toledo in 2023. They're the first MAC program to reach three consecutive championship games since Northern Illinois made five straight from 2010-15. Miami's four MAC Championship Game wins are tied for the second most in league history. Western Michigan, meanwhile, is chasing the fourth MAC title in program history and its first since 2016, which was also the Broncos' most recent trip to the conference championship. They enter as one of the league's hottest teams after winning four straight to surge into the postseason and finish with a MAC-best 7-1 conference record, tied for the second-most league wins in program history.  Miami (OH) vs. Western Michigan: Need to know What's going on with Miami's quarterbacks? Miami ran into a bind in November when starting quarterback DeQuann Finn left the program following a loss to Toledo, his former school. Finn did not play against the Rockets due to illness. The RedHawks initially turned to Henry Hesson, but he threw three interceptions against Toledo and was benched in Week 13 against Buffalo in favor of Thomas Gotkowski. Gotkowski led Miami to a win over Buffalo and closed the regular season with 226 yards and three touchdowns passing in a 21-point triumph over Ball State. Star pass rushers on display: Both Western Michigan and Miami (OH) feature standout edge rushers. Broncos defensive end Nadame Tucker leads the MAC and is tied for second nationally with 12 sacks, the most by a WMU player since Ameer Ismail in 2006. He has also forced four fumbles and recorded 18.5 tackles for loss. Miami (OH) defensive lineman Adam Trick has 63 pressures, tied for second-most among FBS defenders, and 8.5 sacks, not far behind Tucker. \nWMU quarterback Broc Lowry a versatile threat: Western Michigan quarterback Broc Lowry has been one of the MAC's most dynamic playmakers this season. He has 1,572 passing yards, 875 rushing yards, and 21 total touchdowns, making him one of just four FBS quarterbacks with at least 1,500 passing yards and 800 rushing yards this season. His 875 rushing yards rank fifth in the conference.  Where to watch Miami (OH) vs. Western Michigan live Date: Saturday, Dec. 6 | Time: 12 p.m. ET Location: Ford Field -- Detroit, Michigan TV: ESPN | Stream: Fubo (Try for free)    Miami (OH) vs. Western Michigan prediction, pick  \nThis is a different Miami (OH) team than the one that beat Western Michigan in the regular season. The RedHawks have looked a lot different without Finn. These two teams are also headed in entirely different directions. WMU won four in a row following its loss to Miami, while Miami is 2-2 over the last month -- including that 21-point loss to Toledo. Momentum will carry the Broncos to a bit of revenge. Prediction: Western Michigan -1.5 (-118) \n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            WMU -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami (OH) vs. Western Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/eeeb22b8-4dfc-46b1-804a-88d9de9eb036/thumbnail/1200x675/010cf482236c9bae7059e041e9e3e883/adobe-express-file-2025-12-02t125423-932.jpg"
      ],
      "datePublished": "2025-12-04T20:48:20.000Z",
      "dateModified": "2025-12-04T20:48:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-cowboys-lions-daily-fantasy-picks-lineups-advice-stacks-thursday-night-football-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:25:39.000Z",
    "description": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys ",
    "body": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys vs. Detroit Lions matchup at 8:15 p.m. ET. Detroit is a 3-point home favorite, while the over/under is 54.5, the highest on the board in Week 14. Dak Prescott, Jared Goff, Jahmyr Gibbs and CeeDee Lamb are names known to casual football fans and names very familiar with being included in NFL DFS lineups. However, Detroit could be shorthanded with Sam LaPorta on the IR and Amon-Ra St. Brown (ankle) a game-time decision after not practicing this week. George Pickens (calf/knee) doesn't carry an injury designation for TNF.Wideout Isaac TeSlaa played 92% of snaps in Detroit's last game and scored his third touchdown of the year. Daily Fantasy football lineups need economical options like TeSlaa to balance out the highly-priced stars. The Cowboys also have NFL daily Fantasy sleepers who could provide a great return on investment on TNF. Before making any Lions vs. Cowboys NFL DFS picks for 'Thursday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Thursday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Cowboys vs. LionsOne of McClure's top NFL DFS picks for 'Thursday Night Football' is Cowboys receiver CeeDee Lamb. The wideout is coming off a 7-112-1 stat line on Thanksgiving versus Kansas City, with the 112 yards matching a season high. Lamb is averaging 82.7 receiving yards per game in 2025, which ranks sixth-best in the NFL, and his career high of 227 yards came versus Detroit in 2023. This year's Lions team has allowed the third-most touchdowns to opposing wideouts, and now it will be without starting cornerback, Terrion Arnold (shoulder), who was placed on injured reserve on Monday. Detroit also allowed four touchdowns to wideouts in last week's loss to Green Bay. See who else to roster at SportsLine.McClure is also rostering Lions running back Jahmyr Gibbs, who has been a one-man show over the last half-dozen games. Gibbs is averaging 152.3 scrimmage yards with eight total touchdowns over his last six contests, compared to 83.7 yards and five scores over his first six games. The two-time Pro Bowler is on pace for career highs in rushing yards, rushing average, receptions and receiving yards, with his 2025 production coming versus defenses much more stout than what Dallas possesses. The Cowboys have allowed the second-most points and the fourth-most yards this season, in addition to giving up the third-most receiving yards to running backs, which increases the value of a pass-catching RB like Gibbs. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set Lions vs. Cowboys NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Thursday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Thursday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg"
      ],
      "datePublished": "2025-12-04T23:25:39.000Z",
      "dateModified": "2025-12-04T23:25:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 14 Non-PPR Cheat Sheet: Start/Sit Guide - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-2025-week-14-non-ppr-cheat-sheet/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/d6183ffa-e9d2-4f82-9900-d05c84f86003/thumbnail/1200x675/d3dbf9d8c45a6ba3051e909e67853229/devon-achane-getty.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:59:29.000Z",
    "description": "\n\n\n    \n                                    Matchup ratings for every player in Week 14 for Non-PPR leagues\n        \n                                 ",
    "body": "\n\n\n    \n                                    Matchup ratings for every player in Week 14 for Non-PPR leagues\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 4, 2025\n                            \n                    at\n    6:59 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Icon Sportswire\n            \n            \n    \n        The Lineup Cheat Sheet was created so that you could get quick answers to your Fantasy start/sit questions with the analysis already built in. For detailed rationale, check out my latest content, including my weekly Lineup Decisions column.             What do the numbers mean?            \nAll of my analyses from the week, from data points to matchup outlooks to game-flow predictions, are basically represented by a number on a confidence scale from 1-10. The higher the number next to a player's name, the more confident I am that you should start him. The numbers are not a projection, just a confidence score to help you pick who to start. Every relevant player for this week is here, so if a player isn't listed, don't start him.                        To find a specific player, use your search function -- CTRL-F on PCs and Command-F on Macs. If neither of those are options, or if you're on a mobile device, you can scroll by game. If you're still unsure, just send a note on X.com (@daverichard), and I'll give it a look, time permitting. Remember to use the #AskFFT hashtag!                        If you're reading this on Sunday, please refer to our weekly rankings, which are updated in real time.                    Ready to get off on the right foot? Here's how to approach every play for this week in PPR leagues, and you can find our Non-PPR cheat sheet. \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nCowboysRTG (MAX 10)LionsRTG (MAX 10)\t\t\t\tDak Prescott9.5\t\t\t\tJared Goff8.6\t\t\t\tJavonte Williams7.38\t\t\t\tJahmyr Gibbs8.7\t\t\t\tGeorge Pickens8.35\t\t\t\tDavid Montgomery4.58\t\t\t\tCeeDee Lamb8.25\t\t\t\tJameson Williams7.09\t\t\t\tJake Ferguson5.5\t\t\t\tIsaac TeSlaa2.3Cowboys DST 4.3\t\t\t\tAmon-Ra St. Brown7.48\t\t\t\t \t\t\t\t \t\t\t\tRoss Dwelley3.4\t\t\t\t \t\t\t\t Lions DST 4.1\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nSeahawksRTG (MAX 10)FalconsRTG (MAX 10)\t\t\t\tSam Darnold5.7\t\t\t\tKirk Cousins2.7\t\t\t\tKenneth Walker III6.38\t\t\t\tBijan Robinson8.3\t\t\t\tZach Charbonnet4.72\t\t\t\tTyler Allgeier3.75\t\t\t\tJaxon Smith-Njigba8.8\t\t\t\tDarnell Mooney4.32\t\t\t\tRashid Shaheed2.45\t\t\t\tDavid Sills3.78\t\t\t\tCooper Kupp2.35\t\t\t\tKyle Pitts5.38\t\t\t\tAJ Barner3.38Falcons DST 5.9Seahawks DST 9.4\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nSteelersRTG (MAX 10)RavensRTG (MAX 10)\t\t\t\tAaron Rodgers2.8\t\t\t\tLamar Jackson6.4\t\t\t\tJaylen Warren5.98\t\t\t\tDerrick Henry9.2\t\t\t\tKenneth Gainwell3.82\t\t\t\tKeaton Mitchell2.32\t\t\t\tDK Metcalf5.45\t\t\t\tZay Flowers6.28Steelers DST 7.5\t\t\t\tRashod Bateman3.1\t\t\t\t \t\t\t\t \t\t\t\tMark Andrews5.6\t\t\t\t \t\t\t\t \t\t\t\tIsaiah Likely3.95\t\t\t\t \t\t\t\t Ravens DST 7.8\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nBengalsRTG (MAX 10)BillsRTG (MAX 10)\t\t\t\tJoe Burrow8.4\t\t\t\tJosh Allen9.6\t\t\t\tChase Brown7.92\t\t\t\tJames Cook9\t\t\t\tJa'Marr Chase8.9\t\t\t\tKhalil Shakir6.2Tee Higgins7.1\t\t\t\tKeon Coleman3.85Andrei Iosivas3.62\t\t\t\tDawson Knox1.4Bengals DST 1.7Bills DST 5.8\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \n\t\t\t\tTitansRTG (MAX 10)\t\t\t\tBrownsRTG (MAX 10)\t\t\t\tCam Ward2.9\t\t\t\tShedeur Sanders1.7\t\t\t\tTyjae Spears4.05\t\t\t\tQuinshon Judkins6.48\t\t\t\tTony Pollard3.98\t\t\t\tJerry Jeudy4.8\t\t\t\tChimere Dike4.22\t\t\t\tHarold Fannin Jr.5.72\t\t\t\tChigoziem Okonkwo3.6Browns DST 8.5\t\t\t\tGunnar Helm2.98\t\t\t\t \t\t\t\t Titans DST 3.8\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nColtsRTG (MAX 10)JaguarsRTG (MAX 10)\t\t\t\tDaniel Jones6.8\t\t\t\tTrevor Lawrence6.3\t\t\t\tJonathan Taylor9.1\t\t\t\tTravis Etienne7.18\t\t\t\tAlec Pierce6.68\t\t\t\tBhayshul Tuten4.38\t\t\t\tMichael Pittman6.4\t\t\t\tJakobi Meyers6.35\t\t\t\tJosh Downs4.95\t\t\t\tBrian Thomas Jr.5.9\t\t\t\tTyler Warren6.42\t\t\t\tBrenton Strange5.88Colts DST 5.6Jaguars DST 7.6\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nCommandersRTG (MAX 10)VikingsRTG (MAX 10)\t\t\t\tJayden Daniels7.2\t\t\t\tJ.J. McCarthy3.1\t\t\t\tChris Rodriguez Jr.5.8\t\t\t\tJordan Mason6.05\t\t\t\tTerry McLaurin7.28\t\t\t\tJustin Jefferson6.45\t\t\t\tDeebo Samuel6.18\t\t\t\tJordan Addison5.22\t\t\t\tTreylon Burks3\t\t\t\tT.J. Hockenson3.88\t\t\t\tZach Ertz5.35Vikings DST 5.4Commanders DST 5.1\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nDolphinsRTG (MAX 10)JetsRTG (MAX 10)\t\t\t\tTua Tagovailoa4.8\t\t\t\tTyrod Taylor5.6\t\t\t\tDe'Von Achane9.4\t\t\t\tBreece Hall7.4\t\t\t\tJaylen Waddle7.35\t\t\t\tAdonai Mitchell6.22\t\t\t\tMalik Washington3.8\t\t\t\tJohn Metchie III4.75\t\t\t\tDarren Waller5.08\t\t\t\tMason Taylor2.4Dolphins DST 6.8Jets DST 3.9\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nSaintsRTG (MAX 10)BuccaneersRTG (MAX 10)\t\t\t\tTyler Shough5.4\t\t\t\tBaker Mayfield7.0\t\t\t\tDevin Neal4.6\t\t\t\tBucky Irving8.2\t\t\t\tChris Olave7.22\t\t\t\tRachaad White3.55\t\t\t\tDevaughn Vele4.48\t\t\t\tEmeka Egbuka6.65\t\t\t\tJuwan Johnson5.76\t\t\t\tChris Godwin5.78Saints DST 4.8\t\t\t\tTez Johnson4.3\t\t\t\t \t\t\t\t \t\t\t\tCade Otton5.05\t\t\t\t \t\t\t\t Buccaneers DST 7.2\n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \n\t\t\t\tBroncosRTG (MAX 10)\t\t\t\tRaidersRTG (MAX 10)\t\t\t\tBo Nix6.6\t\t\t\tGeno Smith1.5\t\t\t\tRJ Harvey7.2\t\t\t\tAshton Jeanty7.0\t\t\t\tCourtland Sutton7.15\t\t\t\tTre Tucker4.7\t\t\t\tTroy Franklin6.0\t\t\t\tBrock Bowers7.25\t\t\t\tPat Bryant3.9Raiders DST 1.9\t\t\t\tEvan Engram4.28\t\t\t\t \t\t\t\t Broncos DST 9.3\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nRamsRTG (MAX 10)CardinalsRTG (MAX 10)\t\t\t\tMatthew Stafford9.0\t\t\t\tJacoby Brissett8.0\t\t\t\tKyren Williams7.8\t\t\t\tZonovan Knight6.02\t\t\t\tBlake Corum4.4\t\t\t\tMichael Carter4.45\t\t\t\tDavante Adams8.1\t\t\t\tMichael Wilson7.02\t\t\t\tPuka Nacua7.9\t\t\t\tGreg Dortch6.25\t\t\t\tXavier  Smith2.5\t\t\t\tTrey McBride7.95\t\t\t\tColby Parkinson5.02Cardinals DST 2.3Rams DST 7.7\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nBearsRTG (MAX 10)PackersRTG (MAX 10)\t\t\t\tCaleb Williams6.7\t\t\t\tJordan Love7.3\t\t\t\tD'Andre Swift6.7\t\t\t\tJosh Jacobs7.6\t\t\t\tKyle Monangai5.82\t\t\t\tChristian Watson6.62\t\t\t\tRome Odunze6.3\t\t\t\tDontayvion Wicks5.52\t\t\t\tDJ Moore4.9\t\t\t\tRomeo Doubs5.4\t\t\t\tLuther Burden III4.02Packers DST 7.1\t\t\t\tColston Loveland3.92\t\t\t\t \t\t\t\t Bears DST 5.5\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nTexansRTG (MAX 10)ChiefsRTG (MAX 10)\t\t\t\tC.J. Stroud5.5\t\t\t\tPatrick Mahomes7.4\t\t\t\tWoody Marks4.62\t\t\t\tKareem Hunt4.78\t\t\t\tNick Chubb2.5\t\t\t\tIsiah Pacheco3.65\t\t\t\tNico Collins7.88\t\t\t\tRashee Rice8.15\t\t\t\tJayden Higgins5.92\t\t\t\tXavier Worthy5.55\t\t\t\tXavier Hutchinson3.6\t\t\t\tMarquise Brown4.92\t\t\t\tChristian Kirk3.02\t\t\t\tTravis Kelce7.12\t\t\t\tDalton Schultz5.75Chiefs DST 6.5Texans DST 7.0\t\t\t\t \t\t\t\t \n                    \n                Start 'em\n            \n                \n            \n                10.0-7.00\n            \n        \n        \n            \n                6.99 - 5.01\n            \n        \n        \n            \n                5.00 - 0\n            \n        \n                    \n                Sit 'em\n            \n            \nEaglesRTG (MAX 10)ChargersRTG (MAX 10)\t\t\t\tJalen Hurts7.8\t\t\t\tJustin Herbert5.8\t\t\t\tSaquon Barkley7.3\t\t\t\tKimani Vidal6.15\t\t\t\tA.J. Brown7.45\t\t\t\tJaret Patterson1.8\t\t\t\tDeVonta Smith7.05\t\t\t\tLadd McConkey7.08\t\t\t\tDallas Goedert4.35\t\t\t\tQuentin Johnston5.95Eagles DST 7.4\t\t\t\tKeenan Allen4.55\t\t\t\t \t\t\t\t \t\t\t\tOronde Gadsden II5.28\t\t\t\t \t\t\t\t Chargers DST 7.3\n            \n    \n\n        \n\n    \n            \n    \n            \n\n                    \n         Now Playing \n                    \n    \n                                        \n            \n                        \n                                                            \n                                    \n    \n                                                                                                    \n                                    \n                                                                                    \n                                                                                                    Week 14 Non-PPR Cheat Sheet \n                                                                                            \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     3 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 lineup decisions\n                                                                                                                                                \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     14 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 PPR Cheat Sheet\n                                                                                                                                                \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     3 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 14 Start 'Em & Sit 'Em\n                                                                                                                                                \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                                                \n                    \n            \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 14 Non-PPR Cheat Sheet: Start/Sit Guide - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/d6183ffa-e9d2-4f82-9900-d05c84f86003/thumbnail/1200x675/d3dbf9d8c45a6ba3051e909e67853229/devon-achane-getty.jpg"
      ],
      "datePublished": "2025-12-04T23:59:29.000Z",
      "dateModified": "2025-12-04T23:59:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals conference championship college football picks, best bets for Dec. 5 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-college-football-free-picks-betting-odds-models-best-bets-conference-championship-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/cb8ffda8-680b-4b64-9705-87c54fe01896/thumbnail/1200x675/4c9b2bf26fc7251af9f44cbac5e83c29/drew-mestemaker-north-texas.jpg",
    "tag": "Sports",
    "date": "2025-12-04T21:17:01.000Z",
    "description": "\n        Conference Championship week begins on Friday with four Group of Five contests, with at least one of these four conference champions guarante",
    "body": "\n        Conference Championship week begins on Friday with four Group of Five contests, with at least one of these four conference champions guaranteed a spot in the College Football Playoff. The current College Football Playoff rankings would indicate that team is most likely the winner of the American Athletic Championship between No. 24 North Texas and No. 20 Tulane, as the two highest-ranked teams playing on Friday from the CFP polls. North Texas is a 2.5-point favorite in the latest college football odds despite being the lower-ranked team in the CFP polls. The other Friday conference championship games feature Kennesaw State (-2.5) vs. Jacksonville State in the Conference USA Championship on CBS Sports Network at 7 p.m. ET, Troy vs. No. 25 James Madison (-23.5) in the Sun Belt, and UNLV vs. Boise State (-3.5) in the Mountain West.The SportLine Projection Model has found values in all four of these conference championship games. Rather than backing a side for the AAC Championship showdown between Tulane and North Texas, the model finds the best value in playing Over 66.5 total points scored. The model is also backing Over 58.5 points in Boise State vs. UNLV, while projecting value a pair of underdogs in Jacksonville State (+2.5) and Troy (+23.5) for Friday's conference championship best bets. Before locking in your college football picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also utilize the latest BetMGM bonus code, which gives new users up to $1,500 back in bonus bets if your first bet loses:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line and over/under picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the FanDuel promo code, which offers $150 in free bets if your first $5 bet wins:Friday conference championship best bets for Friday, Dec. 5 (odds subject to change): Jacksonville State (+2.5) vs. Kennesaw StateTroy (+23.5) vs. James MadisonNorth Texas vs. Tulane: Over 66.5 pointsUNLV vs. Boise State: Over 58.5 pointsCombining the model's three picks into a Friday conference championship parlay would result in a payout of +1202 (risk $100 to win $1202). Bet it now at Caesars Sportsbook: Jacksonville State (+2.5) vs. Kennesaw State (-110)Jacksonville State, the defending Conference USA champions, won this regular-season matchup, 35-26, on its home turf, which is where the Conference USA Championship Game will be played. The Gamecocks went 5-0 at home this season, and they'll have homefield advantage for the biggest game of the season. Kennesaw State went 9-3 overall and 7-1 in the conference, with its only loss coming to Jacksonville State, which also went 7-1 in Conference USA. Jacksonville State has the nation's leading rusher in Cam Cook, who has 1,588 rushing yards on 45.7 yards per carry this season. Cook rushed for 132 yards and a touchdown, and dual-threat quarterback Caden Creel threw for 137 yards and rushed for 127 yards and two touchdowns in their regular-season matchup. The model projects Jacksonville State to cover in 70% of simulations on Friday.Troy (+23.5) vs. James Madison (-105)Troy, the West Division champions, meets James Madison, the top team on the East side, in the Sun Belt Championship Game. Troy has won two of the last three Sun Belt championships, but James Madison joining the conference brings a strong, growing program into the Sun Belt Championship picture. These two teams didn't meet during the regular season, where Troy went 8-4 (6-2), and James Madison went 11-1 (8-0). Troy has only lost one game by more than 23 points this season, and it played Clemson tough in a 27-16 non-conference matchup, so it has been tested against stronger programs as well. The model projects Troy to cover in 61% of simulations.North Texas vs. Tulane: Over 66.5 points (-110)North Texas has the No. 1 scoring offense in the nation, averaging 46.4 points per game. The Mean Green are second in the nation in passing yards per game (324.5) behind freshman quarterback Drew Mestemaker. He has 3,835 passing yards with 29 touchdowns and four interceptions this season as the Mean Green have scored more than 50 points in three straight games and five of their last six contests. Meanwhile, Tulane can score as well, posting at least 26 points in five straight games. The model projects the Over to hit in 55% of simulations.UNLV vs. Boise State: Over 58.5 points (-108)These two teams went significantly Over this total during their regular-season meeting, which resulted in a 56-31 win for Boise State. They combined for 1,034 yards and 12 touchdowns, and the model expects the offenses to outshine the defenses again in the Mountain West Championship Game. Maddux Madsen threw for 253 yards and four touchdowns for Boise State, and he'll return after missing the last month with a leg injury. Dylan Riley rushed for 201 yards on 13.4 yards per rush for the Broncos in that contest. Anthony Colandrea, who has thrown for more than 3,000 yards this season, passed for 215 yards, rushed for 87 yards, and had three total touchdowns for UNLV against Boise State. The model projects the Over to hit in 63% of simulations.Want more college football picks?You've seen the model's college football best bets for Friday. Now, get against the spread, total and money line picks for every Conference Championship Game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals conference championship college football picks, best bets for Dec. 5 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/cb8ffda8-680b-4b64-9705-87c54fe01896/thumbnail/1200x675/4c9b2bf26fc7251af9f44cbac5e83c29/drew-mestemaker-north-texas.jpg"
      ],
      "datePublished": "2025-12-04T21:17:01.000Z",
      "dateModified": "2025-12-04T21:17:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]