[
  {
    "title": "NFL Week 14 grades: Steelers earn 'B' for wild win over Ravens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-14-grades-steelers-earn-b-for-wild-win-over-ravens-josh-allen-carries-bills-to-b/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/b7b82c9f-cd65-40d2-b384-ef409beadd16/thumbnail/1200x675/5f13665c11daa120c2a7856fa8bf18d2/gettyimages-2250588730.jpg",
    "tag": "Sports",
    "date": "2025-12-08T04:58:52.000Z",
    "description": "\n\n\n    \n                                    Here are the grades for every team that has played in Week 14\n        \n                                   ",
    "body": "\n\n\n    \n                                    Here are the grades for every team that has played in Week 14\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 7, 2025\n                            \n                    at\n    11:59 pm ET\n                        \n                •\n            \n            19 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Welcome to the Week 14 grades!When the Colts and Jaguars play, it's not usually a game that you circle on your calendar, but it was this week, because first place in the AFC South was on the line. The game in Jacksonville was one of three on the day that saw the first-place and second-place teams in a division facing off. Here's a quick look at those three games: AFC South: The Jaguars made a statement with their 36-19 win over a Colts team that's suddenly reeling. At 9-4, it feels like the Jags are now in total control of the division, especially since the Colts just lost Daniel Jones to a season-ending Achilles injury. AFC North: Just when you thought Mike Tomlin might be on the hot seat, he goes out and leads his team to its biggest win of the season. Tomlin's Steelers took control of the division by taking out the Baltimore Ravens in a 27-22 win. NFC North: The Packers moved to the top of the division with a 28-21 win over the Bears in Green Bay. With the loss, the Bears dropped all the way down from the No. 1 seed in the NFC to the seventh seed, just one spot ahead of the Lions, which could certainly add some drama to the NFC North race down the stretch. There was also a big game on Sunday night with the Houston Texans going into Kansas City and knocking off the Chiefs, 20-10. The Chiefs' playoff hopes aren't officially dead yet, but they're certainly on life support following the loss. \nWe're not here to talk about the playoffs though, we're here to talk about grades, so let's get to them, starting with the Steelers' big win over the Ravens. Houston 20-10 over Kansas CityPittsburgh 27-22 over BaltimoreGreen Bay 28-21 over ChicagoDenver 24-17 over Las VegasL.A. Rams 45-17 over ArizonaJacksonville 36-19 over IndianapolisBuffalo 39-34 over CincinnatiSeattle 37-9 over AtlantaMinnesota 31-0 over WashingtonMiami 34-10 over N.Y. JetsNew Orleans 24-20 over Tampa BayTennessee 31-29 over ClevelandDetroit 44-30 over Dallas (Thursday)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 14 grades: Steelers earn 'B' for wild win over Ravens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/b7b82c9f-cd65-40d2-b384-ef409beadd16/thumbnail/1200x675/5f13665c11daa120c2a7856fa8bf18d2/gettyimages-2250588730.jpg"
      ],
      "datePublished": "2025-12-08T04:58:52.000Z",
      "dateModified": "2025-12-08T04:58:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 14 overreactions: Is Colts' season over? Will Ravens miss playoffs? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-14-overreactions-colts-jones-injury-ravens-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/dbb76903-c92b-40f6-a16e-47e863c6e4a0/thumbnail/1200x675/a49bf35c2a5632b13e18fbc44032de2b/daniel-jones-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-08T04:37:13.000Z",
    "description": "\n        Week 14 may be the defining moment of the 2025 regular season. Wherever you looked, it seemed as if playoff jockeying was on the line, and no",
    "body": "\n        Week 14 may be the defining moment of the 2025 regular season. Wherever you looked, it seemed as if playoff jockeying was on the line, and now the NFL landscape is remarkably different from what it was entering Sunday. Most notably, the AFC South has been turned on its head with the Jacksonville Jaguars maintaining their standing atop the division with a win over the Indianapolis Colts. Meanwhile, Indy has far greater concerns than the result of Sunday's matchup, as Daniel Jones suffered an Achilles injury. Outside of that matchup, Buffalo handled the Bengals in a key AFC contest, while the Steelers took back control of the AFC North with a win over Baltimore. There were also a number of upsets, namely the Titans notching their second win of the year on the road in Cleveland and the Saints heading into Tampa and defeating the Bucs. It was your standard mayhem that unfolded in the NFL on Sunday, and of course, there will be plenty of takeaways from the slate. But which are concrete and which are baseless? Below, we'll determine just that by examining some of the top storylines from Week 14 and figure out which we need to take seriously and which we can cast aside as overreactions. \nColts season is over after Daniel Jones' Achilles injuryOverreactions or reality: Reality\nThe Colts are in a bad way. They are now 8-5 on the season, falling further behind the Jaguars in the division after a 36-19 loss in Jacksonville. Beyond losing ground in the AFC South, Indy now may need to go the rest of the season without Daniel Jones. The veteran quarterback suffered an Achilles injury during the contest, and it doesn't look promising as he was in noticeable pain following the non-contact injury. If he's done for the year, the injury could bring the Colts down with it.Indianapolis had rookie Riley Leonard as the backup quarterback on Sunday, and it'd be a tall task to ask him to win out down the stretch against teams like the Seahawks (Week 15), 49ers (Week 16), Jaguars (Week 17), and Texans (Week 18). The Colts are now at legitimate risk of falling out of the playoffs entirely. Even if they squeak in, they won't make much noise. \nJ.J. McCarthy reestablished himself as Vikings franchise QBOverreactions or reality: Overreaction\nMcCarthy was lights out in Sunday's 31-0 win over the Commanders. The second-year quarterback completed 16 of his 23 throws for 163 yards and three touchdowns. Naturally, some will look at this as McCarthy planting his flag against anyone who feared he may not be Minnesota's franchise quarterback. While it was an encouraging step for McCarthy, we're not ready to go so far as to say he's fully reestablished himself as the Vikings' cornerstone under center. Washington's defense is among the worst in the NFL, so McCarthy wasn't facing the toughest resistance when he dropped back to pass. If he starts to stack outings like this together over the final four games, it'll calm the nerves of many around the franchise. \nBengals' fourth-quarter collapse dashes playoff hopesOverreactions or reality: RealityAfter falling to the Bills on Sunday, Cincinnati is 4-9 on the season and very much on the outside looking in at the playoffs. This defeat was a heartbreaker for the Bengals, who held a 28-18 lead in the fourth quarter. However, back-to-back interceptions by Joe Burrow (including a pick-six) gave Buffalo the lead and paved the way to a win. \nThis loss now puts the Bengals three games behind the Steelers for first place in the AFC North, and they are even further behind in the wild-card race. Losing to Buffalo also gives the Bills the head-to-head tiebreaker, so while Cincinnati is not officially eliminated from the playoffs at this moment, they may as well be.  \nSaints should build around Tyler Shough going forwardOverreactions or reality: Overreaction\nTyler Shough led the Saints to one of the biggest upsets of the season after New Orleans went into Raymond James Stadium and took down the Buccaneers, 24-20.The rookie quarterback completed 13 of his 20 passes for 144 yards and an interception, but did the bulk of his damage on the ground. Shough rushed seven times for 55 yards and two touchdowns in the win. \nThis is yet another strong showing from Shough, who is trying to play well enough that the Saints decide to build around him going forward instead of dipping their toes back into the NFL Draft this spring. \nWhile Shough is doing his best to change that, I don't think we're there yet. The Saints should continue to evaluate their young quarterback over this final stretch, but also leave the door open to take a quarterback in the first round of the 2026 NFL Draft if one falls to them. Ravens are going to miss the playoffsOverreactions or reality: Reality\nBaltimore was unable to hold serve at home against the Steelers, falling to its division rival 27-22. The loss now puts Pittsburgh back atop the AFC North and drops the Ravens out of the playoff picture entirely. While these two teams still have one more matchup in Week 18, Baltimore is at real risk of missing the postseason despite their previous surge back into the conversation. The club has now lost two in a row and has a daunting final four games: at Bengals (Week 15), vs. Patriots (Week 16), at Packers (Week 17), and at Steelers (Week 18).\nThat's much tougher than Pittsburgh's final slate, so this division could be wrapped up before we get to that regular-season finale. Outside of the division race, the Ravens are on the wrong side of several key head-to-head tiebreakers (Buffalo, Houston, and Chiefs), so that avenue to the playoffs as a wild card entry is arguably even more difficult. Packers are going to run away with the NFC NorthOverreactions or reality: Overreaction\nYes, Green Bay is back atop the division after Sunday's win over Chicago, but it still feels like there is a lot to be determined in the NFC North. There is still one more game between the Packers and the Bears in Week 16, so this was merely Part 1 of this division rivalry. Before that game, the Packers will have to travel to Denver to face the Broncos in Week 15, while the Bears will face the Browns at home. If Green Bay were to lose next week and the Bears beat Cleveland, we're looking at another high-stakes matchup, only this time at Soldier Field. Meanwhile, the Detroit Lions are still a factor at 8-5, so there is still plenty that needs to be sorted out before we start handing out NFC North champion T-shirts and hats.  Chiefs are going to miss the playoffsOverreactions or reality: RealityThis is a remarkable turn of events, but the reality is that the Kansas City Chiefs are likely going to miss the playoffs in 2025. While not mathematically eliminated, their chances of reaching the postseason took a monstrous hit with the loss to the Texans on Sunday night. \nKansas City is officially out of range to win the AFC West and now needs to win out and see several teams lose multiple games just to sneak in as a wild card team. It's hard to imagine all of those pieces falling into place. So, we'll soon be looking at a road to the Super Bowl that will not have Patrick Mahomes in the conversation whatsoever, which is downright shocking.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 14 overreactions: Is Colts' season over? Will Ravens miss playoffs? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/dbb76903-c92b-40f6-a16e-47e863c6e4a0/thumbnail/1200x675/a49bf35c2a5632b13e18fbc44032de2b/daniel-jones-imagn.jpg"
      ],
      "datePublished": "2025-12-08T04:37:13.000Z",
      "dateModified": "2025-12-08T04:37:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff picture Week 14: Updated standings, tiebreakers and playoff race - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-playoff-picture-standings-week-14-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/f325af57-46aa-46f4-bfe5-0ec8890ea512/thumbnail/1200x675/c726b0fbf6e934560c2268a02bf3191b/imagn-matthew-stafford-blake-corum-rams.jpg",
    "tag": "Sports",
    "date": "2025-12-08T05:10:52.000Z",
    "description": "\n        When we look back at the 2025 regular season, we may be pointing to Week 14 as the pivotal moment that sculpted the playoff picture. Coming i",
    "body": "\n        When we look back at the 2025 regular season, we may be pointing to Week 14 as the pivotal moment that sculpted the playoff picture. Coming into the weekend, the slate had the promise of being an inflection point with multiple divisional matchups on deck between clubs in the thick of the playoff race. That included Steelers-Ravens duking it out for first place in the AFC North, along with Bears-Packers squaring off at Lambeau Field in an NFC North duel, and Colts-Jaguars jockeying for position atop the AFC South. And those games did not disappoint.Pittsburgh and Green Bay both pulled off wins to jump back into first place in their respective division. Meanwhile, Jacksonville held its spot atop the AFC South after taking down Indy, but the headline from that contest was Daniel Jones leaving the game due to an Achilles injury. That further shakes up the playoff picture in the AFC. As the dust settles on Sunday's Week 14 action, let's take a look at this latest snapshot and see who would be in and out of the playoffs. On top of the standings, we'll also run through the entire playoff picture, including the remaining schedules for each primary contender. \n\n        \n            \n                NFL Week 14 grades: Chiefs get 'C-' for ugly loss to Texans, Josh Allen carries Bills to 'B-,' Rams earn 'A+'\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nComplete playoff pictureThis is the NFL playoff picture as it stands, with the following teams tabbed for postseason spots:AFC standingsDenver Broncos (11-2)New England Patriots (11-2)Jacksonville Jaguars (9-4)Pittsburgh Steelers (7-6)Buffalo Bills (9-4)Los Angeles Chargers (8-4)Houston Texans (8-5)\n                            \n    \n                                                \n                    \n    1. Denver Broncos (11-2)Remaining schedule: vs. Packers, vs. Jaguars, at Chiefs, vs. ChargersAfter winning their 10th straight game, the Broncos are back atop the AFC as the No. 1 seed. They currently get the edge over New England thanks to a superior conference record (7-2 vs. 6-2). While the conversation is currently about whether or not the Broncos can secure the No. 1 seed, it shouldn't be overlooked that they have a solid cushion in the AFC West and are primed to win it for the first time since 2015. \n                            \n    \n                                                \n                    \n    2. New England Patriots (11-2)Remaining schedule: vs. Bills, at Ravens, at Jets, vs. DolphinsThe Patriots were on the bye in Week 14 and have a massive contest against the Buffalo Bills at Gillette Stadium next Sunday. While that game won't flip the standings in the AFC East in the event that New England loses, a win could effectively lock it up for Mike Vrabel's club. Beyond fending off Buffalo, a win next week would also keep pace with Denver for the No. 1 seed. \n\n                            \n    \n                                                \n                    \n    3. Jacksonville Jaguars (9-4)Remaining schedule: vs. Jets, at Broncos, at Colts, vs. TitansThe Jaguars created some wiggle room for themselves in the AFC South with a win over the Colts on Sunday. That's the fourth straight win for Jacksonville, which is now set to host the Jets in Week 15. With Daniel Jones now out for the year with an Achilles injury, the division is a two-team race between them and the Houston Texans. \n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (7-6)Remaining schedule: vs. Dolphins, at Lions, at Browns, vs. RavensPittsburgh is back in first place in the AFC North after defeating the Ravens; however, there is still a lot to be determined in this division. The Steelers and Ravens are still only separated by a game and have one more head-to-head matchup in Week 18. Before then, Pittsburgh has some tricky games ahead of it. The Dolphins have been spunky in recent weeks, and then they will have to go on the road in Week 16 and Week 17 against the Lions and Browns. \n                            \n    \n                                                \n                    \n    5. Buffalo Bills (9-4)Remaining schedule: at Patriots, at Browns, vs. Eagles, vs. JetsIt cannot be overstated how important Buffalo's comeback win over the Bengals was. After erasing the double-digit, fourth-quarter deficit, the Bills improved to 9-4, which keeps them within range of the Patriots in the AFC East, leading up to their showdown in Foxborough next Sunday. The victory also has them with a solid hold on the top wild card spot.  \n\n                            \n    \n                                                \n                    \n    6. Los Angeles Chargers (8-4)Remaining schedule: vs. Eagles, at Chiefs, at Cowboys, vs. Texans, at BroncosLos Angeles still has its Week 14 matchup with Philadelphia on Monday night, but comes out of Sunday holding the No. 6 seed in the AFC. That said, they'll need to win on Monday or else fall out of the playoff picture due to a head-to-head tiebreaker working against them with the Colts, thanks to a loss in Week 7. \n                            \n    \n                                                \n                    \n    7. Houston Texans (8-5)Remaining schedule: vs. Cardinals, vs. Raiders, at Chargers, vs. ColtsAfter starting the year 0-3, the Texans have clawed back into the playoff picture as the No. 7 seed thanks to an impressive win over the Chiefs. Houston is just a game behind the Jaguars for first place in the AFC South, so there is room for this climb to go even higher.In the huntThe Colts (8-5) are mathematically still in the hunt, but after losing Daniel Jones for the season due to a torn Achilles, it's hard to envision them finishing well enough to get into the playoffs. The clock may have struck midnight for the Chiefs (6-7) after falling to the Texans on Sunday night. They continue to be out of the playoff picture, are now under .500 again, and are on the wrong side of a number of key tiebreakers. The team that may have the best chance of this group to make the postseason is the Ravens (6-7). Even after losing to the Steelers, they still have a lane to leapfrog them for first place in the AFC North and still have one more matchup against them in Pittsburgh in Week 18. Surprisingly, the Dolphins (6-7) are still lurking on the outskirts after winning four straight games, but a lot needs to go right. On top of likely needing to win out, Miami would need some wild card contenders to collapse, as they currently lose head-to-head tiebreakers to the Colts, Chargers and Ravens. \nNFC standingsLos Angeles Rams (10-3)Green Bay Packers (9-3-1)Philadelphia Eagles (8-4)Tampa Bay Buccaneers (7-6)Seattle Seahawks (10-3)San Francisco 49ers (9-4)Chicago Bears (9-4)\n                            \n    \n                                                \n                    \n    1. Los Angeles Rams (10-3)Remaining schedule: vs. Lions, at Seahawks, at Falcons, vs. CardinalsThe Rams bounced back nicely after their upset loss to the Panthers in Week 13 by blowing out the Cardinals, 45-17. Matthew Stafford looked more like his MVP self as well, throwing for three touchdowns. That win helped push them atop the NFC as the No. 1 seed, but they'll need to finish strong to hold onto this spot. Specifically, these next two weeks against Detroit and then at Seattle will give us further clarity on where L.A. will ultimately end up.\n                            \n    \n                                                \n                    \n    2. Green Bay Packers (9-3-1)Remaining schedule: at Broncos, at Bears, vs. Ravens, at VikingsGreen Bay is back atop the NFC North after taking down the Chicago Bears at home. The Packers offense came through in the clutch, particularly some hard running by Josh Jacobs late. While the Packers may have recaptured the top spot in the division, things are still very much up in the air in the NFC North, especially if they fall to the Broncos in Denver next week before taking on the Bears again in Week 16.  \n                            \n    \n                                                \n                    \n    3. Philadelphia Eagles (8-4)Remaining schedule: at Chargers, vs. Raiders, at Commanders, at Bills, vs. Commanders\nPhiladelphia still has its Week 14 matchup to play on Monday night against the Chargers, but it stands on solid footing at the moment. The Cowboys losing to the Lions on Thursday and dropping to 6-6-1 took a lot of wind out of their sails in their pursuit to catch the Eagles in the NFC East. If Philly pulls off the win on Monday, that creates even more breathing room. \n                            \n    \n                                                \n                    \n    4. Tampa Bay Buccaneers (7-6)Remaining schedule: vs. Falcons, at Panthers, at Dolphins, vs. PanthersThe Bucs were on the wrong end of arguably the biggest upset of Week 14, losing at home to the New Orleans Saints. While they are still atop the NFC South at the moment, Tampa Bay is now knotted with the Carolina Panthers -- who were on the bye in Week 14 -- for first place. The Bucs have the momentary edge, but they've yet to play any of their two matchups against Carolina, so this division is very much still up for grabs. \n                            \n    \n                                                \n                    \n    5. Seattle Seahawks (10-3)Remaining schedule: vs. Colts, vs. Rams, at Panthers, at 49ersSeattle is in a pretty comfortable position coming out of Week 14. The Seahaws are just one of two teams in the entire conference with double-digit wins. However, the problem is that the only other team with 10 wins is the Los Angeles Rams, who beat them out at the moment due to the head-to-head tiebreaker. That said, they still have one more game against L.A. in Seattle, and have a healthy position as a wild card entry if they cannot unseat them for the NFC West crown. They also catch a break in Week 15, facing an Indianapolis Colts team that just lost Daniel Jones (Achilles) for the year. \n\n                            \n    \n                                                \n                    \n    6. San Francisco 49ers (9-4)Remaining schedule: vs. Titans, at Colts, vs. Bears, vs. SeahawksThe Niners were on the bye in Week 14, so they'll be well-rested for the final four games. Out of the gate, it's pretty favorable for San Francisco, hosting a 2-11 Tennessee Titans team before visiting the Colts, who will be without Jones. That creates a strong path to securing a wild card spot, but there is room for this team to go even higher if the pieces fall into place. The 49ers split the head-to-head series with the Rams and currently have a better division record, so they'd leapfrog them if they find themselves with the same record. Meanwhile, the club also owns the head-to-head tiebreaker over Seattle thanks to a Week 1 win before they square off in the regular-season finale. So, there is a path for the 49ers to win the NFC West and possibly end up as the No. 1 seed. \n                            \n    \n                                                \n                    \n    7. Chicago Bears (9-4)Remaining schedule: vs. Browns, vs. Packers, at 49ers, vs. LionsWhat a difference a week can make, right? Chicago entered Week 14 as the No. 1 seed in the conference and is now clinging to the No. 7 seed after falling to the Packers at Lambeau Field. While that is quite the fall from grace, all isn't lost. If Chicago takes care of business next week against the Browns and gets some help from the Broncos, who host the Packers, we could be looking at another massive NFC North duel between the Bears and Green Bay in Week 16. If they aren't careful, however, they do run the risk of falling even further, especially with the Lions looming.In the huntThe Lions (8-5) pulled off a key victory over the Cowboys on Thursday, which slots them in as the No. 8 seed. They have a high-octane offense that could help propel them back into the playoff picture, but they have a tall task next week, visiting the Rams. Carolina (7-6) may have the best chance at making the playoffs, despite being the No. 9 seed after Week 14. They are tied with the Bucs for first place in the division and still have both matchups on the horizon. The Cowboys (6-6-1) may have been handed a critical hit with their loss to Detroit. They now likely need to win out and get a lot of help to squeak in either via the NFC East or as a wild card team. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff picture Week 14: Updated standings, tiebreakers and playoff race - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/f325af57-46aa-46f4-bfe5-0ec8890ea512/thumbnail/1200x675/c726b0fbf6e934560c2268a02bf3191b/imagn-matthew-stafford-blake-corum-rams.jpg"
      ],
      "datePublished": "2025-12-08T05:10:52.000Z",
      "dateModified": "2025-12-08T05:10:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft order after Week 14: New No. 1 emerges after Titans beat Browns - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/2026-nfl-draft-order-updated-top-picks-team-needs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/bcaea077-15d1-45e6-b4d3-c1ab55e93b4d/thumbnail/1200x675/6f48a24f5aa6b9898572d305902b1d81/usatsi-27718762-1.jpg",
    "tag": "Sports",
    "date": "2025-12-08T04:40:21.000Z",
    "description": "\n        There is a new No. 1 overall as the Giants claimed the top spot while on a bye. The Saints and Titans were victorious this week, which led to",
    "body": "\n        There is a new No. 1 overall as the Giants claimed the top spot while on a bye. The Saints and Titans were victorious this week, which led to them slipping down the draft order. The Browns were a direct beneficiary in the loss to Tennessee. Eight teams have three wins or fewer on the year. Looking forward to Week 15, Commanders at Giants is the game expected to have the greatest impact on the 2026 NFL Draft order.As a reminder, there are four teams -- Atlanta, Green Bay, Indianapolis and Jacksonville -- without a first-round pick in 2026 as a result of draft-day trades and the Micah Parsons and Sauce Gardner deals. Here is the current 2026 NFL Draft order (via Tankathon) as well as potential team needs:\n1. New York Giants (2-11)Projected needs: WR, CB, IOL, LB, OTNew York is on a Bye this week, so there were not any NFL Draft stakes on the line. 2. Las Vegas Raiders (2-11)Projected needs: CB, LB, S, DL, OTLas Vegas kept it close in the first half, but slowly bled out over the course of the evening. 3. Tennessee Titans (2-11)Projected needs: OT, IOL, WR, DL, EDGEIn a battle of top-5 overall projected teams, Tennessee emerged victorious over Cleveland with the snow falling. \n4. Cleveland Browns (3-10)Projected needs: OT, WR, QB, CB, IOLCleveland made a valiant effort at a comeback down two scores to the Titans, but poorly executed a two-point conversion. 5. New Orleans Saints (3-10)Projected needs: CB, S, DL, RB, WRTyler Shough was far from perfect as a passer, but showed a lot of toughness and determination on his two rushing touchdowns. The rookie has given New Orleans some reason for optimism. 6. Washington Commanders (3-10)Projected needs: EDGE, LB, CB, TE, WRWashington went down without as much as a whimper Sunday versus the struggling Vikings. Jayden Daniels returned to the lineup, but did not solve the team's offensive issues. \n7. New York Jets (3-10)Projected needs: QB, WR, DL, CB, TEThe Jets lost seven straight games to open the season, but have shown some life over the past five games. The team was on life support Sunday, however, as the game against Miami was never really competitive. 8. Arizona Cardinals (3-10)Projected needs: OT, IOL, LB, DL, RBThe Cardinals are limping to the finish line with Jacoby Brissett at quarterback. Arizona has a decision to make at quarterback this offseason. 9. Los Angeles Rams via Atlanta Falcons (4-9)Projected needs: CB, OT, LB, S, IOLAtlanta's first-round pick continues to climb, which only benefits the Rams. Los Angeles is looking at a situation where they could theoretically make a play for the heir apparent to Matthew Stafford while simultaneously contending for the NFC. \n10. Cincinnati Bengals (4-9)Projected needs: IOL, CB, S, TE, EDGEJoe Burrow returned from injury in hopes of keeping the team's playoff chances alive, but the dream may be dead with this week's loss to Buffalo. 11. Minnesota Vikings (5-8)Projected needs: LB, CB, S, DL, RBJ.J. McCarthy managed the game just as he had done at Michigan. He was not the driving force on offense, but he avoided the critical errors that he had been accumulating in recent weeks. Minnesota put an end to a four-game losing streak. 12. Miami Dolphins (6-7)Projected needs: CB, WR, TE, IOL, SMiami's rebound has been one of the most improbable stories of the season. The Dolphins have won five of their past six games to force their way back into the AFC Playoff picture. \n13. Baltimore Ravens (6-7)Projected needs: EDGE, DL, IOL, TE, CBThe AFC North is typically a competitive division with multiple playoff representatives. In 2025, it is trending toward only the division winner emerging.14. Kansas City Chiefs (6-7)Projected needs: DL, RB, CB, LB, TEKansas City's playoff hopes took a massive hit with their home loss to the surging Texans. 15. Dallas Cowboys (6-6-1)Projected needs: S, LB, EDGE, RB, CBDallas' three-game win streak came to an abrupt end Thursday night against a desperate Lions team. The Cowboys are exactly .500 with four games to play.\n16. Carolina Panthers (7-6)Projected needs: CB, S, IOL, WR, DLCarolina is tied atop the NFC South after the Buccaneers' loss to the Saints. The two teams play each other twice over the final four weeks.17. Detroit Lions (8-5)Projected needs: EDGE, DL, LB, CB, OTDetroit knocked off Dallas on Thursday night to keep its NFC North chances alive. \\18. New York Jets via Indianapolis Colts (8-5)Projected needs: LB, CB, EDGE, IOL, DLJacksonville took a commanding lead in the division as the Colts continue reeling from Daniel Jones' injury. The real winner is the Jets, who acquired Indianapolis' first-round pick as part of the Sauce Gardner deal. \n19. Pittsburgh Steelers (7-6)Projected needs: QB, DL, WR, CB, IOLPittsburgh has taken over sole possession of first place in the AFC North after hanging on to beat the Ravens on Sunday.20. Tampa Bay Buccaneers (7-6)Projected needs: LB, DL, EDGE, IOL, TEThe Buccaneers continue on their downward spiral, as the team has now lost four of their past five games. The division is very much attainable with three games remaining against the Falcons and Panthers. 21. Houston Texans (8-5)Projected needs: IOL, OT, TE, DL, SThe red-hot Texans traveled to Kansas City and knocked off Patrick Mahomes and the Chiefs.\n22. Los Angeles Chargers (8-4)Projected needs: IOL, EDGE, CB, TE, DLThe Chargers host Philadelphia on \"Sunday Night Football.\"23. Philadelphia Eagles (8-4)Projected needs: TE, CB, EDGE, S, IOLPhiladelphia won four games to open the season, then lost two games, then won four straight, and is now on a two-game losing streak. Will a new win streak begin against the Chargers on \"Monday Night Football\"?24. Chicago Bears (9-4)Projected needs: DL, S, IOL, RB, OTChicago battled back from a two-score deficit against Green Bay, but it was too little, too late in the end. 25. Buffalo Bills (9-4)Projected needs: S, LB, EDGE, CB, WRIt was a classic Joe-Burrow vs. Josh Allen showdown Sunday in Buffalo. The Bills keep pace in the AFC East. \n26. San Francisco 49ers (9-4)Projected needs: OT, IOL, DL, WR, TESan Francisco rides a three-game win streak into its bye before returning in Week 15 against the Titans.27. Cleveland Browns via Jacksonville Jaguars (9-4)Projected needs: OT, WR, QB, CB, IOLCleveland is not going to get a top-half-of-the-round pick from Jacksonville. The Jaguars have a firm grip on the divisional lead; the Browns will have to wait to learn where they will be picking.28. Dallas Cowboys via Green Bay Packers (9-3-1)Projected needs: S, LB, EDGE, RB, CBGreen Bay was able to fend off Chicago not only in Sunday's game, but also the NFC North divisional race. The two teams will meet again before the end of the season. 29. Seattle Seahawks (10-3)Projected needs: CB, DL, IOL, S, WRAtlanta served as a thorn in the side of Seattle in the first half, but the Seahawks pulled away for a decisive win.30. New England Patriots (11-2)Projected needs: OT, TE, WR, LB, EDGEDrake Maye has yet to throw for 300 yards in a game, but the Patriots will carry the league's best record for at least one more week.31. Los Angeles Rams (10-3)Projected needs: CB, OT, LB, S, IOLSeattle and Los Angeles are deadlocked in the NFL's most competitive division. Three of four NFC West teams have at least nine wins.32. Denver Broncos (11-2)Projected needs: LB, TE, S, WR, OTSunday was just the third time this season in which a Broncos outcome was decided by one score or less. Yet they have the league's best record.The 2026 NFL Draft will take place from April 23-25 in Pittsburgh. More draft coverage can be found at CBSSports.com, including the weekly mock drafts and regular looks at the eligible prospects. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft order after Week 14: New No. 1 emerges after Titans beat Browns - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/bcaea077-15d1-45e6-b4d3-c1ab55e93b4d/thumbnail/1200x675/6f48a24f5aa6b9898572d305902b1d81/usatsi-27718762-1.jpg"
      ],
      "datePublished": "2025-12-08T04:40:21.000Z",
      "dateModified": "2025-12-08T04:40:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Rams vs. Cardinals picks, score prediction, SGP for NFL Week 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-cardinals-where-to-watch-nfl-week-14-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/45410291-c4e6-4018-a5a5-d225a790eb91/thumbnail/1200x675/fe64f735d2076497b57db64dfb57c9e9/davante-adams-rams.jpg",
    "tag": "Sports",
    "date": "2025-12-07T19:52:24.000Z",
    "description": "\n        Teams at the opposite end of the NFC West standings meet in Week 14 when the last-place Arizona Cardinals host the first-place Los Angeles Ra",
    "body": "\n        Teams at the opposite end of the NFC West standings meet in Week 14 when the last-place Arizona Cardinals host the first-place Los Angeles Rams. Los Angeles is 9-3 after falling to Carolina last week, while Arizona is 3-9 and has lost four games in a row. The Rams are tied with Seattle atop the NFC West entering Week 14 and will look to get back in the win column and hand the Cardinals their fifth consecutive defeat.Kickoff from State Farm Stadium is set for 4:25 p.m. ET. The Rams are 9.5-point favorites on the road, according to the latest Rams vs. Cardinals odds. The over/under for total points scored is 49. The Rams are -505 money line favorites (risk $505 to win $100), while the Cardinals are +384 underdogs. Check out the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times, before placing any NFL bets of your own.Click here to bet Rams vs. Cardinals at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Rams vs. CardinalsBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet winsJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Rams vs. Cardinals on SundayWhen: Sunday, Dec. 7Time: 4:25 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppRams vs. Cardinals betting previewOdds: Rams -9.5, over/under 49The Rams have been winning at a rapid rate all year long, and they've also been great against the spread with an 8-4 mark that's just a hair worse than their 9-3 straight-up record. The Cardinals are a mess right now at 3-9, and we likely will see some major shakeup in the desert this offseason. Arizona is, however, 6-6 ATS. The Cardinals are also 7-5 to the Over while the Rams are 5-7. Click here to bet Rams vs. Cardinals at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Rams vs. Cardinals SGPRams -9.5 (-115, DraftKings)Under 49 (-115, DraftKings)Trey McBride anytime touchdown scorer (+135, DraftKings)Final odds: +721 at DraftKings (wager $100 to win $721)Model's Rams vs. Cardinals score prediction, picksThe Rams are big favorites, even on the road, as the Cardinals are one of a handful of teams in contention to have the first overall pick in April's draft. Los Angeles wins in nearly 70% of model simulations, and it covers roughly half of the time, as well. The Under hits in 54% of model sims.Rams vs. Cardinals score prediction: Rams 29, Cardinals 19Want more Week 14 NFL picks?You've seen the model's best bets for Los Angeles Rams vs. Arizona Cardinals. Now, get against the spread, total and money-line picks for every Week 14 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Rams vs. Cardinals picks, score prediction, SGP for NFL Week 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/45410291-c4e6-4018-a5a5-d225a790eb91/thumbnail/1200x675/fe64f735d2076497b57db64dfb57c9e9/davante-adams-rams.jpg"
      ],
      "datePublished": "2025-12-07T19:52:24.000Z",
      "dateModified": "2025-12-07T19:52:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs vs. Texans odds, line, spread: 'Sunday Night Football' picks from 10,000 sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-texans-prediction-odds-time-line-nfl-week-14-sunday-night-football-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe53de07-0fe6-4165-b0a6-f027d61c1fca/thumbnail/1200x675/19d98a89a22f04f6b6a6a2282b8110df/travis-kelce.jpg",
    "tag": "Sports",
    "date": "2025-12-08T00:01:32.000Z",
    "description": "\n        AFC playoff hopefuls will look to improve their postseason chances on 'Sunday Night Football' when the Houston Texans visit the Kansas City C",
    "body": "\n        AFC playoff hopefuls will look to improve their postseason chances on 'Sunday Night Football' when the Houston Texans visit the Kansas City Chiefs. Entering NFL Week 14, Kansas City (6-6) is the 10th seed in the conference after losing three of its last four, including a Thanksgiving Day defeat to Dallas, 31-28. Houston (7-5) is the No. 8 seed but has won four in a row, including a 20-16 victory over Indianapolis last Sunday. This will be the first Chiefs game since Missouri sports betting launched on Dec. 1, and there are a number of Missouri sportsbook promos available to residents of the state.Kickoff is at 8:20 p.m. ET from Arrowhead Stadium in Kansas City, Mo. The Chiefs have won each of the last five meetings, including a Jan. 2025 playoff victory. The latest Texans vs. Chiefs odds have Kansas City as 4-point favorites, while the over/under for total points scored is 41.5 via SportsLine consensus. Kansas City is at -213 on the money line (risk $213 to win $100), with Houston at +177 (risk $100 to win $177). The Under is a combined 17-7 for the two teams. Before making any Chiefs vs. Texans picks, check out the NFL predictions from the SportsLine Projection Model. Missouri sports betting is now live. New users in Missouri can target the DraftKings Missouri promo code, which offers $300 in bonus bets after an initial $5 wager. If you're in Missouri, click here to claim your bonus:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Texans vs. Chiefs. You can visit SportsLine now to see the picks. Here are the football odds and trends for Chiefs vs. Texans:Texans vs. Chiefs spreadChiefs -4 at DraftKings SportsbookTexans vs. Chiefs over/under41.5 pointsTexans vs. Chiefs money line                                                                                 Chiefs -213, Texans +177Texans vs. Chiefs picks                                                                                         See picks at SportsLineTexans vs. Chiefs streaming Fubo (Try for free)Why the Texans can coverThese teams are going in opposite directions as Houston has won four straight, while Kansas City has lost three of four outright, while losing all four of those versus the spread. Three of the teams that Houston defeated during its win streak are current AFC playoff squads in Jacksonville, Buffalo and Indianapolis. Meanwhile, the single best unit on the field come Sunday, and arguably in all of the NFL, is Houston's defense. It has allowed both the fewest points and fewest yards, and the Texans are the only NFL team which hasn't allowed more touchdown passes than it has defensive interceptions. Just five teams have more sacks than Houston (34), and it gets to face a Chiefs squad that's allowed three-plus sacks in five straight games. See which team to back at SportsLine.Why the Chiefs can coverOne can't ignore Kansas City's five straight wins over Houston, with the four of those at home all coming by at least eight points. This year's Chiefs have balance, as one of six teams to rank in the top 10 in both scoring offense and scoring defense, while Houston has the No. 21 scoring offense. Kansas City is also extremely efficient, as it's committed the second-fewest turnovers, and Patrick Mahomes is having one of his finest seasons. He ranks second in the league in QBR, third in passing yards and fifth in passing touchdowns. Mahomes has also carved up the Texans like no other over his career as across six games versus Houston, the two-time MVP owns a 15:1 touchdown-to-interception ratio. See which team to back at SportsLine.Missouri sports betting is now live. New users in Missouri can check out the latest FanDuel Missouri promo code and get $300 in bonus bets after making a $5 wager. Click here to claim your FanDuel bonus:How to make Chiefs vs. Texans   picksSportsLine's model has simulated Texans vs. Chiefs 10,000 times and is going Under on the total, projecting 41 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Chiefs vs. Texans, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Texans vs. Chiefs spread to jump on, all from the advanced model that finished up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs vs. Texans odds, line, spread: 'Sunday Night Football' picks from 10,000 sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe53de07-0fe6-4165-b0a6-f027d61c1fca/thumbnail/1200x675/19d98a89a22f04f6b6a6a2282b8110df/travis-kelce.jpg"
      ],
      "datePublished": "2025-12-08T00:01:32.000Z",
      "dateModified": "2025-12-08T00:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bears vs. Packers picks, prediction for NFL Week 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-bears-where-to-watch-nfl-week-14-betting-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/db41aad4-3d9a-4268-8cce-c58398a592fc/thumbnail/1200x675/292db4edc268d87884fbda4c55376b7a/caleb-williams-chicago-bears-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-07T20:02:14.000Z",
    "description": "\n        Perhaps the most consequential game of Week 14 of the 2025 NFL season will be in the 4:25 p.m. ET window as the Chicago Bears visit the Green",
    "body": "\n        Perhaps the most consequential game of Week 14 of the 2025 NFL season will be in the 4:25 p.m. ET window as the Chicago Bears visit the Green Bay Packers in a massive NFC North showdown. The Bears hold a half-game edge over the Packers thanks to Green Bay's tie, but this is the first of two head-to-head meetings between the teams, and a lot can change in the standings. Chicago has won five in a row and nine of its last 10, while Green Bay is on a three-game winning streak.Kickoff from Lambeau Field in Green Bay is set for 4:25 p.m. ET. The Packers are 6.5-point favorites in the latest Bears vs. Packers odds, while the over/under for total points scored is 44. The Packers are -309 money line favorites (risk $309 to win $100), while the Bears are +248 underdogs. You can find the latest Bears vs. Packers game forecast, expert picks, and NFL player prop projections at SportsLine.Click here to bet Bears vs. Packers at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Bears vs. PackersBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet winsJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Bears vs. Packers on SundayWhen: Sunday, Dec. 7Time: 4:25 p.m. ETTV: FOXFollow along: CBS Sports AppBears vs. Packers betting previewOdds: Packers -6.5, over/under 44The Bears have been one of the best scoring teams in the NFL under first-year head coach Ben Johnson. They are 8-4 ATS overall and 5-2 ATS as underdogs. Chicago is 6-5-1 to the Over. The Packers are 5-7 ATS thanks to their tendency to play down to the competition. Green Bay is 6-6 to the Over on the season but just 1-4 to the Over at home.Click here to bet Bears vs. Packers at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Bears vs. Packers SGPPackers -6.5 (-115)Under 44 (-110)Christian Watson anytime touchdown scorer (+165)Final odds: +950 at DraftKings (wager $100 to win $950)Model's Bears vs. Packers score prediction, picksThe SportsLine Projection Model is leaning towards the home team on the spread, as the Packers cover the 6.5-point number in 53% of simulations. However, the model sees value on Bears money line as Chicago wins in 32% of simulations to bring value at +251 odds. The Over hits on 44.5 in 56% of simulations.Bears vs. Packers score prediction: Packers 28, Bears 20Want more Week 14 NFL picks?You've seen the model's best bets for Chicago Bears vs. Green Bay Packers. Now, get against the spread, total and money-line picks for every Week 14 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bears vs. Packers picks, prediction for NFL Week 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/db41aad4-3d9a-4268-8cce-c58398a592fc/thumbnail/1200x675/292db4edc268d87884fbda4c55376b7a/caleb-williams-chicago-bears-imagn-images.jpg"
      ],
      "datePublished": "2025-12-07T20:02:14.000Z",
      "dateModified": "2025-12-07T20:02:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. Chargers prediction, odds: Monday Night Football picks from top model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-chargers-prediction-odds-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/496af9a3-fd11-4475-8d01-7ea85a259fe0/thumbnail/1200x675/ff253becd73a8fb42c3d43585bcae24b/saquon-barkley-eagles.jpg",
    "tag": "Sports",
    "date": "2025-12-07T19:43:19.000Z",
    "description": "\n        A pair of 8-4 teams will meet on 'Monday Night Football' to wrap up NFL Week 14 as the Philadelphia Eagles visit the Los Angeles Chargers. Ph",
    "body": "\n        A pair of 8-4 teams will meet on 'Monday Night Football' to wrap up NFL Week 14 as the Philadelphia Eagles visit the Los Angeles Chargers. Philly is coming off back-to-back losses, most recently falling to Chicago, 24-15, on Black Friday. L.A. has won four of its last five and defeated Las Vegas, 31-14, last Sunday. The Chargers lead the all-time series 8-5. Quarterback Justin Herbert (hand) is questionable after having surgery last Monday.Kickoff is at 8:15 p.m. ET from SoFi Stadium in Inglewood, Calif. The Chargers won the last meeting in 2021. Philadelphia is the 1.5-point favorite in the latest Chargers vs. Eagles odds, while the over/under for total points scored is 41.5. Before making any Eagles vs. Chargers   picks, be sure to see the NFL predictions from SportsLine's projection model.New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your $5 bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Los Angeles vs. Philadelphia. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Eagles vs. Chargers:Chargers vs. Eagles          spreadEagles -1.5 at DraftKings SportsbookChargers vs. Eagles               over/under41.5 pointsChargers vs. Eagles               money line Eagles -134, Chargers +113Chargers vs. Eagles               picksSee picks at SportsLineChargers vs. Eagles      streaming Fubo (Try for free)Why the Eagles can coverThe Eagles play their best against the best as they are 5-1 versus the spread against teams that win 55% or more of their games. Philly also protects the ball like few others as it has the second-fewest turnovers and owns a plus-five turnover differential. Meanwhile, the Chargers have a negative turnover differential, and Los Angeles is 0-4 versus the spread over its last four games in which it lost the turnover battle. Quarterback Jalen Hurts ranks sixth in the NFL with eight rushing scores as he's essential to Philadelphia leading the league in redzone scoring, and just two teams have allowed more QB rushing touchdowns than Los Angeles. See which team to back at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states:Why the Chargers can coverL.A. is facing a Philly team that's 0-2 both straight-up and against the spread over the last two weeks, but the Eagles' offense has all but dried up over the last month. It's averaged just 15.5 points over the last four games and now has to deal with a Chargers defense which can make a team one-dimensional. L.A. has allowed both the second-fewest rushing yards and rushing touchdowns, in addition to the team ranking third in total defense and fourth in third-down defense. On the other side of the ball, the Chargers are coming off 192 yards on the ground and a season-high of two rushing touchdowns last week, as they'll get to face a Philly defense that ranks in the bottom 10 in both rushing yards allowed and rushing average given up. See which team to back at SportsLine. Check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make Eagles vs. Chargers       picksFor Chargers vs. Eagles  on 'Monday Night Football,' the model is leaning Over the total, projecting 43 combined points. It also says one side of the spread hits well over 50% of the time in an A-rated pick. See what it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.Who wins Eagles vs. Chargers, and which side of the spread hits in well over 50% of simulations in an A-rated pick? Visit SportsLine now to see which side of the Chargers vs. Eagles spread you need to jump, all from the model that is 49-33 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. Chargers prediction, odds: Monday Night Football picks from top model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/496af9a3-fd11-4475-8d01-7ea85a259fe0/thumbnail/1200x675/ff253becd73a8fb42c3d43585bcae24b/saquon-barkley-eagles.jpg"
      ],
      "datePublished": "2025-12-07T19:43:19.000Z",
      "dateModified": "2025-12-07T19:43:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texans vs. Chiefs props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-texans-nfl-player-props-sunday-night-football-sgp-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/b4a13d60-f2ae-4ae6-9371-b0402a41a55b/thumbnail/1200x675/6b93ae20852564144b0b76be364a068b/mahomes-chiefs.jpg",
    "tag": "Sports",
    "date": "2025-12-07T23:58:30.000Z",
    "description": "\n        Teams battling for a playoff spot in the AFC meet when the Houston Texans face the defending AFC champion Kansas City Chiefs in Week 14 'Sund",
    "body": "\n        Teams battling for a playoff spot in the AFC meet when the Houston Texans face the defending AFC champion Kansas City Chiefs in Week 14 'Sunday Night Football' at 8:20 p.m. ET from GEHA Field at Arrowhead Stadium in Kansas City, Mo. The Texans (7-5) entered the weekend just one game behind Jacksonville and Indianapolis in the AFC North, while the Chiefs (6-6) are third in the AFC West. The game will feature C.J. Stroud and Patrick Mahomes, both of whom should figure into several NFL player props or a Sunday Night Football SGP. This will be the first Chiefs game since Missouri sports betting launched on Dec. 1, and there are a number of Missouri sportsbook promos available to residents of the state.There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Woody Marks Dalton Schultz and Nico Collins of the Texans or Travis Kelce, Kareem Hunt and Hollywood Brown of the Chiefs. Before betting any Texans vs. Chiefs props for 'Sunday Night Football,' you need to see the Texans vs. Chiefs prop predictions powered by SportsLine's Machine Learning Model AI. Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Texans vs. Chiefs NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Texans vs. Chiefs prop picks. You can only see the Machine Learning Model player prop predictions for Texans vs. Chiefs here.Chiefs fans, here are the best sportsbook promos in Missouri With Missouri sports betting officially live, new users can take advantage of all the available sportsbook promos in the state. The top betting apps are all looking to acquire new customers, which means this is the time when they give the most enticing offers. Some of the promos require a winning wager, while others simply need you to deposit and place a first bet. BrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets instantlyJust click hereBetMGMGet up to $1,500 paid back in bonus bets if you don't win your first betCBSSPORTSFanDuelBet $5, get $300 in bonus betsJust click hereFanaticsBet $30 and get $300 in FanCashCBSFANbet365Bet $10, get $365 in bonus bets instantlyCBSBET365CaesarsBet $5, get $150 in bonus bets if your first bet winsCBSMOTop NFL player prop bets for Texans vs. ChiefsAfter analyzing the Texans vs. Chiefs props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Chiefs quarterback Patrick Mahomes goes over 239.5 yards passing (-114). Mahomes has gone over his passing yards line in four of his last five home games, with an average of 292.8 passing yards per game. He is coming off a 23-for-34 passing performance, throwing for 261 yards and four touchdowns in a 31-28 loss to the Dallas Cowboys on Thanksgiving Day.Mahomes has been red hot. In a 23-20 overtime win over the Indianapolis Colts on Nov. 23, he completed 29 of 46 passes for 352 yards with one interception. He threw for 299 yards and three touchdowns and two picks in a 28-7 win over the Washington Commanders on Oct. 27. The SportsLine Machine Learning Model projects Mahomes to have 287.4 passing yards and gives this prop a 5 out of 5-star prop rating. See more NFL props here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make NFL player prop bets for Texans vs. ChiefsIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has 10 additional NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Texans vs. Chiefs prop bets for Sunday Night Football.Which Texans vs. Chiefs prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Texans vs. Chiefs props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans vs. Chiefs props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/b4a13d60-f2ae-4ae6-9371-b0402a41a55b/thumbnail/1200x675/6b93ae20852564144b0b76be364a068b/mahomes-chiefs.jpg"
      ],
      "datePublished": "2025-12-07T23:58:30.000Z",
      "dateModified": "2025-12-07T23:58:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice for Chiefs vs. Texans on 'Sunday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-chiefs-texans-daily-fantasy-picks-lineups-advice-stacks-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/15/b58da927-7d85-4c02-9847-4cd6d3e6124a/thumbnail/1200x675/78176aa73ebec59dba7091ca2f027d3c/mahomes.jpg",
    "tag": "Sports",
    "date": "2025-12-08T00:07:09.000Z",
    "description": "\n        AFC playoff hopefuls clash in the penultimate game on the Week 14 NFL schedule as the Kansas City Chiefs and Houston Texans play on 'Sunday N",
    "body": "\n        AFC playoff hopefuls clash in the penultimate game on the Week 14 NFL schedule as the Kansas City Chiefs and Houston Texans play on 'Sunday Night Football' at 8:20 p.m. ET. This matchup features Kansas City's top-10 scoring offense against the top-ranked Houston scoring defense. Big names like Patrick Mahomes, Travis Kelce, C.J. Stroud and Nico Collins highlight the NFL DFS player pool.How should the matchups impact your NFL DFS picks for 'Sunday Night Football,' and which sleepers, such as possibly Jayden Higgins, Hollywood Brown or Xavier Worthy, should you insert into your NFL DFS lineup? Houston has the league's No. 1 defense, so which Chiefs should you choose for your lineups, and which should you avoid? Before making any Chiefs vs. Texans NFL DFS picks on sites like FanDuel or DraftKings for 'Sunday Night Football', be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Sunday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Texans vs. ChiefsOne of McClure's top NFL DFS picks for 'Sunday Night Football' is Chiefs quarterback Patrick Mahomes. After a couple mediocre years from a Fantasy perspective, Mahomes enters Week 14 leading the NFL in Fantasy points per game among quarterbacks. It's undoubtedly a tough matchup, but the Texans are dealing with several injuries on the defensive side, including missing defensive tackle Tim Settle Jr. and safety Jaylen Reed, setting the table for Mahomes to return value in a must-win primetime spot. He's also had, essentially, nothing but success versus Houston with a 15:1 TD:INT, all-time, versus the Texans. See who else to roster at SportsLine.McClure is also building his 'Sunday Night Football' NFL DFS strategy around Houston tight end Dalton Schultz. He had no more than six targets in any game through Week 6, but he's been a bigger part of the offense since that point. He's been targeted 43 times and has 39 catches for 366 yards over the past seven weeks, drawing at least eight targets in four of his last five games. Kansas City has solid numbers overall against opposing tight ends, but has allowed 289 yards and two scores against the position over the past four weeks. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set 'Sunday Night Football' NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Chiefs vs. Texans on 'Sunday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/15/b58da927-7d85-4c02-9847-4cd6d3e6124a/thumbnail/1200x675/78176aa73ebec59dba7091ca2f027d3c/mahomes.jpg"
      ],
      "datePublished": "2025-12-08T00:07:09.000Z",
      "dateModified": "2025-12-08T00:07:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn retires Sue Bird's No. 10 jersey in emotional ceremony at Gampel Pavilion - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/this-is-home-uconn-retires-sue-birds-no-10-jersey-gampel-pavilion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/4c5ab9b7-cb5c-4e82-a365-7afb081e8d7b/thumbnail/1200x675/e6c323bdfd0ea9d4b700ac7546fb9b21/sue-bird-jersey-retirement-uconn.png",
    "tag": "Sports",
    "date": "2025-12-08T03:43:55.000Z",
    "description": "\n        Sue Bird received a standing ovation at Gampel Pavilion as her No. 10 jersey was officially retired by UConn. Geno Auriemma stood by her side",
    "body": "\n        Sue Bird received a standing ovation at Gampel Pavilion as her No. 10 jersey was officially retired by UConn. Geno Auriemma stood by her side while calling her \"the greatest point guard to play basketball, man or woman.\" Once she got the microphone from him, Bird joked that he had never said that in front of her.She has often said that UConn feels like family. This weekend, more than all the championships and personal accomplishments, she highlighted that Storrs, Conn. helped shape her as a player and as a person. `This is home,\" she said. \"This is where it started. So to see what we are about to see, my number up in the rafters, the rafters next to these other legends, it's an incredible, incredible honor. Hard to put into words.\"\nBird joined Rebecca Lobo and Swin Cash as the only two other players from the program to get that honor so far. Maya Moore will be next, but it has to happen after her induction into the Naismith Basketball Hall of Fame because that is a requirement for jersey retirements at UConn.\n\"I think it represents how in a list of some incredible people, how unique some really were for a lot of different reasons,\" said Auriemma, who has coached UConn to 12 national championships. \"The amazing thing about these three, and Maya, the fourth, was the incredible amount of success they had after they left here. That as great as their accomplishments were here, what they've done since they left has been nothing short of incredible.\"Bird earned two national championships during her time with UConn while amassing an impressive 114-4 record. She became the program's first ever No. 1 overall WNBA Draft pick in 2002, and then went on to win four WNBA championships with the Seattle Storm, as well as five Olympic gold medals with Team USA. Bird officially retired in 2022, but her impact is still being felt at UConn and elsewhere.\nBird got video messages from former teammates and other UConn greats, which were played at the arena throughout the game. These included videos from Lobo, Cash, Breanna Stewart and Diana Taurasi. \n\"That No. 10 is one of the big reasons why I went to Connecticut,\" Taurasi said. \"I'm proud to call you a teammate, sister and a fan for life. We all love you. Congratulations.\"The current Huskies were also excited to celebrate Bird. They wore the c-ball throwback uniform, the same one Bird used to wear, on Sunday during their 102-35 win against DePaul. Earlier this week, UConn shared clips of players thanking Bird for her impact on women's basketball.\"If you are playing basketball and you want to play the right way, you want to play like Sue Bird,\" Azzi Fudd said. \"You want to be a leader like her. You want to be a floor general like her. You want to have that kind of IQ. \n\"To see what she was able to accomplish here, the adversity that she faced here, in the W, and what she's been able to do, I think players now have to give her so much credit and thank her. Give her all her flowers because she really helped pave the way to make things possible. So thank you Sue for making UConn what is is now, helping build the W, and helping grow my love for basketball.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn retires Sue Bird's No. 10 jersey in emotional ceremony at Gampel Pavilion - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/4c5ab9b7-cb5c-4e82-a365-7afb081e8d7b/thumbnail/1200x675/e6c323bdfd0ea9d4b700ac7546fb9b21/sue-bird-jersey-retirement-uconn.png"
      ],
      "datePublished": "2025-12-08T03:43:55.000Z",
      "dateModified": "2025-12-08T03:43:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Darryn Peterson injury update: Top NBA prospect leads Kansas over Missouri - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/darryn-peterson-injury-kansas-jayhawks-freshman-nba-draft/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/08/aaa9f7cd-015d-4b02-9428-adf80ac17453/thumbnail/1200x675/484d28d328a3263a3d534930d4168e2e/untitled-design-116.png",
    "tag": "Sports",
    "date": "2025-12-08T02:45:03.000Z",
    "description": "\n        Kansas freshman guard Darryn Peterson, the possible No. 1 pick in June's 2026 NBA Draft, returned to the lineup for the first time after miss",
    "body": "\n        Kansas freshman guard Darryn Peterson, the possible No. 1 pick in June's 2026 NBA Draft, returned to the lineup for the first time after missing his team's last seven games due to a hamstring injury. Peterson logged 23 minutes and recorded 17 points, three rebounds and an assist in an 80-60 win over Missouri on Sunday.\"I thought he did fine,\" Kansas coach Bill Self told reporters after the win. \"I didn't think he pushed it. That's not because of his (hamstring), that's because he's sick. I was nervous he wasn't going to play. ... I thought he did fine, but I didn't plan on playing him 17 and a half minutes the first half. I wanted to play about 14, and then when he got however many he got to start the second half, he was gassed. If it had been a close game, it may have been different, but I wasn't going to try to play him over 27 anyway.\"\nPeterson, one of the most highly touted guard prospects to come out of the high school ranks in years, made his collegiate debut against Green Bay last month, finishing with 21 points, four rebounds and three assists. Against North Carolina on the road, Peterson scored 22 points in a 87-74 loss.Self told reporters last month that Peterson's hamstring issue had been lingering for \"weeks,\" but he played through it in the early part of the season. Notably, Peterson didn't finish an exhibition game against Louisville due to a cramping issue and also exited the second half against Green Bay due to cramps.\n        \n            \n                Tomorrow's Top 25 Today: Michigan expected to be No. 1 in college basketball rankings; Arizona, Duke make case\n                \n                    Kyle Boone                \n            \n                            \n    \n                \n                    \n    \nWhat makes Darryn Peterson an elite NBA prospect?Peterson started to create some separation among his peers to become the NBA's No. 1 overall pick in the summer. However, if you ask 10 people who follow the draft closely to predict the first three picks in the draft, you might get 10 different answers. While the top pick has been dominated by forwards, wings and bigs in recent years, Peterson has a chance to become the exception.\nIn CBS Sports' NBA Draft prospect rankings by Adam Finkelstein, Peterson was ranked No. 1, ahead of BYU's AJ Dybantsa and Duke's Cameron Boozer -- both of whom are wings/forwards at the NBA level.He finished as the top-ranked prospect in last year's recruiting class and begins this draft cycle in the same place. Peterson is a big, playmaking guard who continues to improve each year. His overlap of positional size, length, strength and shot creation is unmatched in this class. In fact, he may be the best domestic guard we've seen in several draft cycles. If the shot-making we've seen early on at Kansas proves sustainable, he could be even better than expected. The last guard taken with the No. 1 pick was Cade Cunningham in 2021. Since 2010, only six prospects who have gone No. 1 have been classified as a guard. Although Cooper Flagg has been utilized as a point guard through the first few weeks his NBA career by the Dallas Mavericks, he is a traditional wing at the NBA level.Part of the intrigue around Peterson is his potential to be a volume scorer at the NBA level. Peterson is also a talented defensive prospect who can defend at a high level because of his size and athleticism. But what stands out the most -- and why he may ultimately go No. 1 -- is his shot making that is second to none in this class. \nPeterson has all the makings to be an elite scorer at the next level.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Darryn Peterson injury update: Top NBA prospect leads Kansas over Missouri - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/08/aaa9f7cd-015d-4b02-9428-adf80ac17453/thumbnail/1200x675/484d28d328a3263a3d534930d4168e2e/untitled-design-116.png"
      ],
      "datePublished": "2025-12-08T02:45:03.000Z",
      "dateModified": "2025-12-08T02:45:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 14 breakouts: Early waiver wire stashes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-14-breakouts-shedeur-sanders-shines-with-breakout-fantasy-performance/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/e54f2812-d41c-48ca-a78b-4004bbb3d064/thumbnail/1200x675/a7fb69352bdb79fecdea7cfd4477e3ab/getty-shedeur-sanders-browns.jpg",
    "tag": "Sports",
    "date": "2025-12-08T00:40:41.000Z",
    "description": "\n        In Week 14, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and",
    "body": "\n        In Week 14, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 15 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Shedeur Sanders, QB, BrownsSanders has found his way onto the NFL radar and more importantly the Fantasy radar with an explosive Week 14 performance against the Titans. Only Josh Allen scored more Fantasy points than Sanders in Week 14. The rookie Browns quarterback nearly racked up 40 Fantasy points (38) with 364 yards passing and three touchdowns. He added a fourth touchdown on the ground where he also added 29 yards. If Sanders continues to find success in the screen game, on vertical passes and as a scrambler in the red zone, he could make his way onto the Fantasy radar this playoffs. Tony Pollard, RB, TitansThe Titans may have found something on the offensive side of the ball by leaning on Pollard in the run game. Against a stingy Browns run defense that has stopped almost every back it's faced, Pollard ripped off 161 yards rushing and two touchdowns. Perhaps more importantly, he obliterated any timeshare with Tyjae Spears on route to 25 carries. Pollard is worth scooping back up off the waiver wire for the stretch run.\nRyan Flournoy, WR, CowboysFlournoy put up big Fantasy numbers earlier this year when CeeDee Lamb was hurt and that was the case again in Week 14 after Lamb left with a concussion. Flournoy racked up 113 receiving yards on nine receptions and a touchdown. He also saw a whopping 13 targets despite not starting the game. Flournoy could continue to be a surprising factor if Lamb is forced to miss time with a concussion. He may be worth firing up as your Flex in Week 15 if Lamb is out. Harold Fannin Jr., TE, BrownsIf Fannin is still on your waiver wire, and he remains there in many leagues, it's time to scoop him up. Fannin is a favorite for Sanders and the Browns pass game is starting to heat up a bit. He racked up 114 yards and a touchdown on 11 targets via eight receptions in Week 14. He's worth starting as an every-week TE. \nTim Patrick, WR, JaguarsTrevor Lawrence continues to make major strides in Liam Coen's passing game over the last three games and that's good news for Jaguars receivers. With Brian Thomas Jr. failing to take hold of the role he earned in his rookie season -- albeit mostly with Mac Jones at quarterback and in an entirely different scheme -- Patrick was able to stand out in Week 14. Patrick finished with 78 yards on five catches and a touchdown. Given the injury situation with the Jaguars receivers this year and the steady improvement in the pass game, he's worth a speculative stash and add in deep leagues. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 14 breakouts: Early waiver wire stashes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/e54f2812-d41c-48ca-a78b-4004bbb3d064/thumbnail/1200x675/a7fb69352bdb79fecdea7cfd4477e3ab/getty-shedeur-sanders-browns.jpg"
      ],
      "datePublished": "2025-12-08T00:40:41.000Z",
      "dateModified": "2025-12-08T00:40:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spalletti's first Juve loss highlights issues preventing Old Lady from contending - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/luciano-spallettis-first-juventus-loss-issues-ucl-serie-a/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/e29d73d7-3d10-43b8-ae46-38501758d727/thumbnail/1200x675/7d245972ab0e35dcfbff468a6877aeb5/juventus.jpg",
    "tag": "Sports",
    "date": "2025-12-07T22:54:20.000Z",
    "description": "\n        Juventus lost 2-1 on Sunday at the Stadio Diego Armando Maradona against Napoli and showed that the work of the coach, Luciano Spalletti, nee",
    "body": "\n        Juventus lost 2-1 on Sunday at the Stadio Diego Armando Maradona against Napoli and showed that the work of the coach, Luciano Spalletti, needs more time. The Azzurri won thanks to the brace of former Manchester United striker Rasmus Hojlund, who joined Napoli in the summer of 2025, and proved that Antonio Conte's side are back on track and now leading the Serie A standings with a one-point margin on Inter. On the other hand, Juventus showed that they are still struggling to create chances and suffered, despite scoring one goal in the second half with Kenan Yildiz, well assisted by USMNT midfielder Weston McKennie. The team coached by Spalletti probably played their worst match of the season, and some numbers showed all the concerns of the fanbase and the manager.\"We didn't produce as much as we could, but we need to sit down and talk because we still showed the same issues. In my opinion, we can do better than today, we gave them an incredible number of chances. If you don't lead it yourself, you end up being a passenger to others who make decisions and you have to adapt. Every time they get a set piece, they make a block, we couldn't find countermeasures. Maybe we allowed them to get too comfortable, but these are all decisions that have to be taken on the spot and the result depends on the decision you make\", he said during the post-match press conference. The injury of Dusan Vlahovic, who will be out for several weeks after undergoing surgery, underlined the poor impact of Jonathan David this season, who struggled and failed to create chances to score in the second half. With his contract expiring in the summer of 2026, Vlahovic must soon clarify his future, as Juventus need to know whether they can count on him moving forward and given his performances and impact this season, it's clear they desperately do.\nThe Napoli match was more than disappointing for Spalletti, who lost his first game since he was hired to replace Igor Tudor on Oct. 30. Since then, Juventus won four matches and drew three in all competitions before losing to Napoli on Sunday, a match that showed they still need much more work. It was clear how much they struggled in the attacking phase: their 0.24 xG against Napoli was their lowest of the season, matched by season-worst totals in touches inside the box (eight) and shots (five). Juventus posted their poorest attacking numbers of the campaign against Conte's side, showing they are still firmly a work in progess. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spalletti's first Juve loss highlights issues preventing Old Lady from contending - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/e29d73d7-3d10-43b8-ae46-38501758d727/thumbnail/1200x675/7d245972ab0e35dcfbff468a6877aeb5/juventus.jpg"
      ],
      "datePublished": "2025-12-07T22:54:20.000Z",
      "dateModified": "2025-12-07T22:54:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff bracket 2025: Full 12-team field and CFP schedule - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-bracket-scores-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/2bfcc0a2-87ff-4298-bb4f-a00202d849a6/thumbnail/1200x675/45c03a5a5d1073f9377c33947ea5b54e/cfp-pylon-logo.png",
    "tag": "Sports",
    "date": "2025-12-07T20:56:26.000Z",
    "description": "\n\n\n    \n                                    How the 11 games of the 12-team College Football Playoff are set up as the postseason begins\n        \n    ",
    "body": "\n\n\n    \n                                    How the 11 games of the 12-team College Football Playoff are set up as the postseason begins\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 7, 2025\n                            \n                    at\n    3:56 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2025-26 College Football Playoff bracket is officially set, giving teams a clear roadmap toward the national championship. Following a regular season filled with drama and intense conference championship battles, the top programs now shift their attention to the CFP, aiming for a shot at college football's ultimate prize.After Indiana's incredible Big Ten title victory over Ohio State, the Hoosiers enter this year's playoff as the No. 1 seed. Despite the loss, however, the Buckeyes did not fall very far from the top spot they previously held, as Ryan Day's team came in at No. 2. SEC champion Georgia enters as the third seed, while Big 12 champion Texas Tech rounds out the top of the field as the No. 4 seed. Those teams all earned first-round byes, but we have some tantalizing matchups coming in the first round. The playoff opens with four first-round games on Friday, Dec. 19, and Saturday, Dec. 20, before advancing to the quarterfinals at some of college football's most iconic bowl venues. Quarterfinal winners will move on to the semifinals Jan. 8 and 9, leading up to the College Football Playoff National Championship Monday, Jan. 20, at Hard Rock Stadium in Miami Gardens, Florida.Below, you'll find all the viewing information for every game, from the four first-round games played on campus to the CFP National Championship. \n                                                                    CBS Sports Graphic\n                                                            2025-26 College Football Playoff bracketAll times EasternFirst roundFriday, Dec. 19(9) Alabama at (8) Oklahoma: 8 p.m. | ABC/ESPNGaylord Family Oklahoma Memorial Stadium -- Norman, Oklahoma Saturday, Dec. 20(10) Miami at (7) Texas A&M: Noon | ABC/ESPNKyle Field -- College Station, Texas(11) Tulane at (6) Ole Miss: 3:30 p.m. | TNT/truTVVaught-Hemingway Stadium -- Oxford, Mississippi (12) James Madison at (5) Oregon: 7:30 p.m. | TNT/truTVAutzen Stadium -- Eugene, Oregon QuarterfinalsWednesday, Dec. 31Cotton Bowl -- (2) Ohio State vs. (7/10) Winner: 7:30 p.m. | ESPNAT&T Stadium -- Arlington, TexasThursday, Jan. 1Orange Bowl -- (4) Texas Tech vs. (5/12) winner: Noon | ESPNHard Rock Stadium -- Miami Gardens, Fla. Rose Bowl -- (1) Indiana vs. (8/9) Winner: 4 p.m. | ESPNRose Bowl -- Pasadena, Calif.Sugar Bowl -- (3) Georgia vs. (6/11) Winner: 8 p.m. | ESPNCaesars Superdome -- New OrleansSemifinalsThursday, Jan. 8Fiesta Bowl: 7:30 p.m. | ESPNState Farm Stadium -- Glendale, Ariz. Friday, Jan. 9\nPeach Bowl: 7:30 p.m. | ESPNMercedes-Benz Stadium -- AtlantaCollege Football Playoff National ChampionshipMonday, Jan. 207:30 p.m. | ESPNHard Rock Stadium -- Miami Gardens, Fla. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff bracket 2025: Full 12-team field and CFP schedule - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/2bfcc0a2-87ff-4298-bb4f-a00202d849a6/thumbnail/1200x675/45c03a5a5d1073f9377c33947ea5b54e/cfp-pylon-logo.png"
      ],
      "datePublished": "2025-12-07T20:56:26.000Z",
      "dateModified": "2025-12-07T20:56:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]