[
  {
    "title": "Toledo vs. Louisville prediction, odds, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/louisville-toledo-prediction-odds-time-2025-boca-raton-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/a174f078-2aee-456e-aca6-48b8a64d1909/thumbnail/1200x675/b9d5305f87a88f83036aad3e3eac1081/miller-moss-jeff-brohm-louisville-cardinals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T19:32:25.000Z",
    "description": "\n        The Toledo Rockets will take on the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed out the regular seas",
    "body": "\n        The Toledo Rockets will take on the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed out the regular season with a 21-3 win at Central Michigan on Nov. 29, while Louisville downed Kentucky 41-0 that same day. The Rockets (8-4), who tied for second in the MAC at 6-2, have won four in a row. They'll be led by interim head coach Robert Weiner after Jason Candle left for UConn. The Cardinals (8-4), who tied for seventh in the ACC, have lost three of four. Toledo quarterback Tucker Gleason is not expected to play after being injured in the regular-season finale. Louisville defensive linemen Rene Konga and Wesley Bailey have both opted out of this game, while leading receiver Chris Bell is out with an injury. Kickoff from Flagler Credit Union Stadium in Boca Raton, Fla., is at 2 p.m. ET. Louisville leads the all-time series 5-3. The Cardinals are 7.5-point favorites in the latest Louisville vs. Toledo odds, while the over/under for total points scored is 43.5 via SportsLine consensus. Before making any Toledo vs. Louisville picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Toledo vs. Louisville. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Louisville vs. Toledo:Toledo vs. Louisville                                                                                                                                         spreadLouisville -7.5 at DraftKings SportsbookToledo vs. Louisville                                                                                                                                     over/under43.5 pointsToledo vs. Louisville                                                                                                                                                                                                                                                     money line Louisville -314, Toledo +251Toledo vs. Louisville                                                                                                                                                                                                                                             picksSee picks at SportsLineToledo vs. Louisville                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Toledo vs. Louisville picksSportsLine's model is going Over (44.5) on the total. The Over has hit in four of Toledo's last seven games, and in four of Louisville's last 10. The Rockets are 7-3 against the spread in their last 10 games, while the Cardinals are 4-6 ATS in their last 10.The model has Toledo running backs Chip Trayanum and Connor Walendzak combining to rush for more than 110 yards and one touchdown, while Louisville quarterback Miller Moss will throw for more than 250 yards and two touchdowns. The teams are projected to combine for 51 points as the Over clears in more than 60% of simulations.The model also also says one side of the spread hits nearly 60% of the time. You can see the model's pick at SportsLine.  So who wins Louisville vs. Toledo, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the Toledo vs. Louisville spread to jump on, all from the advanced model that's up on its top-ranked money-line and total picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Toledo vs. Louisville prediction, odds, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/a174f078-2aee-456e-aca6-48b8a64d1909/thumbnail/1200x675/b9d5305f87a88f83036aad3e3eac1081/miller-moss-jeff-brohm-louisville-cardinals-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T19:32:25.000Z",
      "dateModified": "2025-12-22T19:32:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, picks, predictions, best bets: This Monday parlay returns over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-parlay-monday-december-22/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/22/2336c768-0a7b-4b48-91a7-3932d4f690cc/thumbnail/1200x675/fdb1dad0cf9eeee5c8c7af07f99fad50/jokic.jpg",
    "tag": "Sports",
    "date": "2025-12-22T17:58:38.000Z",
    "description": "\n        A seven-game NBA schedule is on set for Monday, leading into a big holiday week. Among the notable NBA odds include Hornets vs. Cavaliers (-9",
    "body": "\n        A seven-game NBA schedule is on set for Monday, leading into a big holiday week. Among the notable NBA odds include Hornets vs. Cavaliers (-9), Pacers vs. Celtics (-10.5), Mavericks (-1.5) vs. Pelicans, Magic vs. Warriors (-5.5) and Pistons (-5.5) vs. Trail Blazers. New Orleans will look to extend their winning streak to five games, while Indiana looks to snap a four-game losing skid.  What are the NBA best bets for Monday, and which combination of picks should you target in a Monday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight seasons. The model enters Week 9 of the 2025-26 NBA season on a sizzling 29-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $250 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Monday, Dec. 22After simulating every game 10,000 times, the model is backing the Nuggets (-13.5) to cover the spread against the Jazz in Denver at 9 p.m. ET. The Nuggets have won the last six meetings with the Jazz, all by double digits, including all four last season. Utah is 6-4 against the spread in their last 10 games, while Denver is 5-5 ATS in their last 10. The Nuggets have also won each of the last six games against the Jazz played in Denver.Power forward Georges Niang (foot) is not expected to play for Utah, while Denver will be without power forward Aaron Gordon (hamstring). The Nuggets (20-7) are second in the Northwest Division, trailing first-place Oklahoma City by 4.5 games, and have won seven of the past 10 games. The Jazz (10-17), who are fifth in the Northwest, are 5-5 in their last 10 games.The model is projecting four Jazz players to score 11.1 or more points, led by Keonte George, who is projected to score 18.9 points. The model also says five Nuggets players will score 11.2 points or more, led by Nikola Jokic's 30.4 points. The model is also projecting that this game will be decided by double digits as Denver covers in well over 60% of simulations. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Monday, Dec. 22The model also has locked in two more picks, including another bet that hits over 60% of the time. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Monday, and which best bets should you target for a chance at a payout of over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, picks, predictions, best bets: This Monday parlay returns over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/22/2336c768-0a7b-4b48-91a7-3932d4f690cc/thumbnail/1200x675/fdb1dad0cf9eeee5c8c7af07f99fad50/jokic.jpg"
      ],
      "datePublished": "2025-12-22T17:58:38.000Z",
      "dateModified": "2025-12-22T17:58:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, 49ers vs. Colts: Daily Fantasy lineup advice for 'Monday Night Football' on FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-49ers-colts-daily-fantasy-football-picks-fanduel-draftkings-lineup-advice-monday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/200718f6-303d-4afd-8efb-88bcad28777e/thumbnail/1200x675/6e35110872d6d3738016468283dd94d9/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T18:23:13.000Z",
    "description": "\nThe 'Monday Night Football' matchup between the Colts and 49ers at 8:15 p.m. ET features the top two Fantasy running backs in the NFL DFS player pool",
    "body": "\nThe 'Monday Night Football' matchup between the Colts and 49ers at 8:15 p.m. ET features the top two Fantasy running backs in the NFL DFS player pool. Jonathan Taylor and Christian McCaffrey rank first and second, respectively, in positional Fantasy points as they'll be the first names that come to mind when making NFL DFS picks. Both teams have stud tight ends as well in Tyler Warren and George Kittle, but the differing abilities of their respective quarterbacks shouldn't be overlooked when crafting a MNF DFS strategy.Brock Purdy boosts the value of wideouts like Jauan Jennings, while one can't necessarily say that of Philip Rivers with Colts receivers. The limitations of the 44-year-old should make you give a little extra thought to if the likes of Alec Pierce or Michael Pittman Jr. should find their way into your NFL DFS lineups. Before making any 49ers vs. Colts NFL DFS picks on sites like FanDuel or DraftKings for 'Monday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Monday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for 49ers vs. ColtsOne of McClure's top NFL DFS picks for 'Monday Night Football' is Niners running back Christian McCaffrey, who has an over/under of 62.5 rushing yards. The three-time Pro Bowler is as consistent a Fantasy player there is, and he's coming off a game with 87 scrimmage yards and a touchdown. He has at least 96 total yards or a touchdown in all but one game this season as both his running and receiving ability give him an extremely high Fantasy floor. McCaffrey is averaging a touchdown per game this year and is on pace for 2,115 scrimmage yards, which would be the sixth-most by any player over the last decade. See who else to roster at SportsLine. Bet McCaffrey to go Over 62.5 rushing yards at DraftKings, where new users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is also rostering Colts tight end Tyler Warren, who ranks fourth amongst tight ends in receiving yards (718) and is sixth in positional Fantasy points as a rookie. He's been targeted six times in each of the last two weeks, so he's remained a big part of Indy's offensive game plan even after Daniel Jones' injury. That should especially be the case on Monday as San Francisco has had no answer for tight ends in the red zone recently. The Niners have allowed six touchdowns to tight ends over their last six games as one can expect Indy to target that defensive weakness. See who else to roster at SportsLine. Bet Warren to go Over 34.5 receiving yards at DraftKings:\nHow to set 49ers vs. Colts NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Monday Night Football.' This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Monday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, 49ers vs. Colts: Daily Fantasy lineup advice for 'Monday Night Football' on FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/200718f6-303d-4afd-8efb-88bcad28777e/thumbnail/1200x675/6e35110872d6d3738016468283dd94d9/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T18:23:13.000Z",
      "dateModified": "2025-12-22T18:23:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' prediction, odds, time: 49ers vs. Colts picks from Niners expert who's 18-4 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-spread-time-49ers-colts-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/2261e011-5e7e-4db6-87a6-655de191cb71/thumbnail/1200x675/a129fdaf2f43e66abc3edde64bb494e7/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T17:55:34.000Z",
    "description": "\nThe Indianapolis Colts will look to snap a four-game losing streak when they battle the San Francisco 49ers on Monday Night Football. San  Francisco ",
    "body": "\nThe Indianapolis Colts will look to snap a four-game losing streak when they battle the San Francisco 49ers on Monday Night Football. San  Francisco is coming off a 37-24 win over the Tennessee Titans on Sunday, while Indianapolis dropped an 18-16 decision at Seattle. The 49ers (10-4), who are third in the NFC West, are 6-2 on the road this year. The Colts (8-6), who are third in the AFC South, are 6-1 on their home field. Indianapolis will start 44-year-old Philip Rivers for a second week in a row.Kickoff from Lucas Oil Stadium in Indianapolis is set for 8:15 p.m. ET. The Colts lead the all-time series 27-19, including wins in each of the last five meetings. San Francisco is a 5.5-point favorite in the latest 49ers vs. Colts odds, while the over/under for total points scored is 46.5 at DraftKings Sportsbook. Before making any Colts vs. 49ers picks, make sure to check out the 'Monday Night Football' predictions from SportsLine NFL expert Micah Roberts.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Christian McCaffrey anytime TD scorer:\nRoberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. Most importantly, Roberts has a read on the pulse of the 49ers. He is 18-4 (+1360) on his last 22 against-the-spread picks in games involving San Francisco. Anyone following could have seen huge returns. Now, Roberts has set his sights on 49ers vs. Colts and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Colts vs. 49ers: 49ers vs. Colts                                     spreadSan Francisco -5.5 at DraftKings Sportsbook49ers vs. Colts                                           over/under46 points49ers vs. Colts                                           money line San  Francisco -250, Indianapolis +20449ers vs. Colts                                       picksSee picks at SportsLine49ers vs. Colts                                           streaming Fubo (Try for free)  \nWhy the 49ers can winQuarterback Brock Purdy has played in six games this season. He has completed 67.9% of his passes for 1,442 yards and 12 touchdowns with seven interceptions and a 96.0 rating. In the win over Tennessee, he completed 23 of 30 passes for 295 yards and three touchdowns. He completed 22 of 38 passes for 309 yards and two touchdowns with two interceptions in a 26-21 loss to Jacksonville on Sept. 28.Running back Christian McCaffrey continues to post huge numbers. He leads the 49ers in both rushing and receiving. In 14 games, he has rushed 259 times for 922 yards (3.6 average) and nine touchdowns. He also has 86 receptions for 820 yards (9.5 average) and five touchdowns. In a 41-22 win over Arizona on Nov. 16, he carried 13 times for 81 yards and two touchdowns, while catching five passes for 40 yards and a score. See which team to back at SportsLine. Bet Brock Purdy to go Over 247.5 passing yards at DraftKings:\nWhy the Colts can winRunning back Jonathan Taylor has been dominant and leads the Indianapolis offense. In 14 games, he has carried 272 times for 1,443 yards (5.3 average) and 16 touchdowns. He also has 38 receptions for 318 yards and two touchdowns. In a 31-25 overtime win over the Atlanta Falcons on Nov. 9, he carried 32 times for 244 yards and three touchdowns.Wide receiver Michael Pittman Jr. is among Indianapolis' top pass catchers. In 14 games, he has 72 receptions for 725 yards (10.1 average) and seven touchdowns. He has five explosive plays of 20 yards or more, including a long of 27, with 245 yards after the catch and 44 first-down conversions. In a 36-19 loss at Jacksonville, he caught nine passes for 79 yards, including a long of 24. See which team to back at SportsLine.Bet Jonathan Taylor to go Over 16.5 for longest rush at DraftKings:\nHow to make 49ers vs. Colts  picksRoberts has analyzed 49ers vs. Colts from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins 49ers vs. Colts, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the 49ers vs. Colts spread you need to jump on, all from the expert that is 18-4 on his last 22 San Francisco 49ers picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' prediction, odds, time: 49ers vs. Colts picks from Niners expert who's 18-4 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/2261e011-5e7e-4db6-87a6-655de191cb71/thumbnail/1200x675/a129fdaf2f43e66abc3edde64bb494e7/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T17:55:34.000Z",
      "dateModified": "2025-12-22T17:55:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts vs. 49ers prediction, odds, spread: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-49ers-prediction-odds-line-time-spread-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/141966cf-5582-43c4-aa22-f76e2c023a28/thumbnail/1200x675/37d8dfa26cfc90f1029a8d711d223cf9/philip-rivers-indianapolis-colts-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T17:42:11.000Z",
    "description": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4",
    "body": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4) have won four straight, all of them coming by multiple scores, including a 37-24 win over Tennessee in Week 15. The Colts (8-6), meanwhile, are riding a four-game losing streak and fell to Seattle, 18-16, last week. Quarterback Philip Rivers, who came out of retirement last week following Daniel Jones' Achilles injury, will start again for the Colts with rookie Riley Leonard backing him up. Cornerback Sauce Gardner (calf) is out for Indianapolis. Ricky Pearsall (knee, ankle) is out for the Niners. Kickoff is at 8:15 p.m. ET from Lucas Oil Stadium in Indianapolis. The latest 49ers vs. Colts odds from DraftKings Sportsbook have San Francisco as the 5.5-point road favorite, while the over/under for total points scored is 46. Before making any Colts vs. 49ers     picks, be sure to see the NFL predictions from SportsLine's projection model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on San Francisco vs. Indianapolis. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Colts vs. 49ers:49ers vs. Colts              spread49ers -5.5 at DraftKings Sportsbook49ers vs. Colts                  over/under46 points49ers vs. Colts                  money line 49ers -252, Colts +20549ers vs. Colts                  picksSee picks at SportsLine49ers vs. Colts          streaming Fubo (Try for free)\nWhy the 49ers can coverThe Niners have covered in each contest of their four-game win streak, while Brock Purdy is 5-1 ATS this season. San Fran also has a huge primetime advantage when it comes to the spread, as it has covered in all three such games this year, while Indy is 0-5 ATS over its last five under the bright lights of primetime. Despite batting major injuries all year, the Niners still rank among the top four in both third-down offense and passing offense. The Colts' offense should have difficulty keeping up with the 49ers as Indianapolis has scored 20 or fewer points in four straight games. See which team to back at SportsLine.Why the Colts can coverThe Colts have owned this series recently, winning five straight overall matchups and going 9-3 over the last dozen home meetings. Indy controls the trenches, leading the NFL in rushing touchdowns while ranking second by allowing just 3.7 yards per rush. The ground game is already a struggle for the 49ers, who rank 31st with 3.5 yards per carry, and Rivers should find more success in his second week back. He's had a full week in the practice facility, is at home instead of a hostile environment like Seattle, and the Niners rank dead last in the NFL in defensive sacks. See which team to back at SportsLine. How to make Colts vs. 49ers           picksFor 49ers vs. Colts   on 'Monday Night Football,' the model is leaning Over the total, projecting 52 combined points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine.Who wins Colts vs. 49ers, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the 49ers vs. Colts spread you need to jump, all from the model that is 52-37 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts vs. 49ers prediction, odds, spread: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/141966cf-5582-43c4-aa22-f76e2c023a28/thumbnail/1200x675/37d8dfa26cfc90f1029a8d711d223cf9/philip-rivers-indianapolis-colts-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T17:42:11.000Z",
      "dateModified": "2025-12-22T17:42:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 10 Start/Sit: Spencer emerges as a must-start - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-10-startsit/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/93384fb1-9eee-4174-84f8-5e84e7f12171/thumbnail/1200x675/1cec7cd4c5cb1535c2b1e4c1ddeebdc2/cam-spencer-memphis-grizzlies.jpg",
    "tag": "Sports",
    "date": "2025-12-22T18:54:36.000Z",
    "description": "\n        'Tis the season to be jolly, or so they say. With Christmas upon us, we enter what is basically a six-day week. However, surprisingly, the sc",
    "body": "\n        'Tis the season to be jolly, or so they say. With Christmas upon us, we enter what is basically a six-day week. However, surprisingly, the schedule is relatively 'normal', with only one team playing twice, that being the Brooklyn Nets. We have 18 teams suiting up three times, while the remaining 11 teams will take to the court on three occasions each. Sitting players who only go two or three times has its advantages, but fantasy managers still have to make smart decisions when figuring out whom to play, regardless of game count. Being aware of back-to-back sets is also a key factor, especially with so many teams now sitting players due to injury management.Four Games: CLE, DAL, DEN, DET, IND, MEM, NOP, OKC, ORL, POR, UTAThree Games: ATL, BOS, CHA, CHI, GSW, HOU, LAC, LAL, MIA, MIL, MIN, NYK, PHI, PHO, SAC, SAS, TOR, WASTwo Games: BKNHere are four potential starts and four potential sits entering the tenth week of the NBA season. Just keep in mind that this is based on games played for the week. If you play in a rotisserie league, the number of games played each week may not matter in your format.\nGuardsConsider starting: Cam Spencer, MEMOpponents: @OKC, @UTA, MIL, @WASWith injuries continuing to plague the Grizzlies, Spencer has emerged as a must-roster player, even in standard leagues. While the eventual return of both Ty Jerome and Scottie Pippen will complicate things, Spencer simply needs to be prioritized, at least for the foreseeable future. Many might argue that Spencer has been a better option than Ja Morant this season, which has some statistical evidence. In 11 games over the past month, Spencer has averaged 17.1 points, 5.7 assists, 0.9 steals, and 3.5 three-pointers, shooting 59.6 percent from the floor and 100 percent from the line. With four games tabled for week 10, as well as continued injury risk attached to Morant, Spencer is a no-brainer when it comes to selecting your starting lineup.Consider starting: Ryan Nembhard, DALOpponents: @NOP, DEN, @GSW, @SACThe sit-start decision is a little trickier when it comes to Nembhard, despite the fact that he seems locked in as the starting point guard. Head coach Jason Kidd is no stranger when it comes to weird rotations, and that certainly goes for Nembhard. While he has started in 10 straight games, his playing time has fluctuated on a nightly basis, ranging from 21 to 38 minutes. With that said, his assist numbers have been relatively consistent, while those behind him in the rotation have done very little to further their case for more playing time. There could certainly be a dud on the horizon. However, with four games in the next seven days, there should be enough meat on the bone for managers to shift Nembhard in their starting lineups.Consider sitting: Ryan Rollins, MILOpponents: @IND, @MEM, @CHISpeaking of coaches who are known for curious decision-making, Doc Rivers absolutely falls into that category. While the return of Kevin Porter was always going to impact Ryan Rollins, managers may have underestimated the impact Rivers' mindset would have. Rollins has now come off the bench in two consecutive games and has played fewer than 30 minutes in five straight contests. His production has remained viable despite the reduced role, so he is definitely not someone managers will want to drop. However, with limited opportunities, there is a chance that limited production could follow. Rollins played just six minutes in the first half during Sunday's loss to the Timberwolves, a worrying sign despite his 16 minutes in the second half. Moving him to the bench might be a safe option, at least until some sort of sanity returns to Milwaukee.\nForwardsConsider starting: Naji Marshall, DALOpponents: @NOP, DEN, @GSW, @SACA depleted frontcourt has resulted in Marshall playing a lot of minutes and subsequently putting up solid production. In 13 games over the past month, Marshall has been a borderline top 70 player in standard leagues, averaging 14.8 points, 4.8 rebounds, 2.9 assists, 1.1 steals, and 0.9 three-pointers in 30.4 minutes per game. He has started in nine straight games, despite the return of Anthony Davis, and given the team's recent success, he could remain a starter for the foreseeable future. Another player with four games coming up, Marshall is worth slotting into your starting lineup, with the understanding that his overall upside is somewhat limited.Consider sitting: Jordan Walsh, BOSOpponents: IND, @IND, @PORIs the fairytale over for Walsh? While we probably don't need to go that far, his recent slump has provided managers with a sense of reality. He has scored single digits in four of the past five games, the most recent of which he failed to score a single point. During that stretch, he has averaged 8.6 points, 6.2 rebounds, 1.0 three-pointers, and 2.2 combined steals and blocks, well below what fantasy managers have come to expect. Although his spot in the starting lineup feels relatively secure, it is clear that his playing time is not. A low-volume player with only three games is definitely worth moving to the bench, in the hope that he can regain some momentum heading into the following week.Consider sitting: Noah Clowney, BKNOpponents: @PHI, @MINSomehow, Brooklyn has won five of its past eight games, with Clowney continuing to play a sizeable role. Unlike previous seasons, Clowney has been given the freedom to make mistakes without the fear of being subbed out of the game. This has resulted in his best season to date, averaging 17.3 points, 4.4 rebounds, 1.3 blocks, and 2.8 three-pointers in 13 appearances over the past month. However, the dreaded two-game week may be just enough to sink him, at least for the next seven days. Unless you are in desperate need of points and threes, you are likely going to have other options available to you in terms of games played.\nCentersConsider starting: Isaiah Stewart, DETOpponents: @POR, @SAC, @UTA, @LACStewart's offensive production has been relatively underwhelming of late, averaging just 9.5 points per game in 13 appearances over the past month. However, during that time, he has also averaged 6.0 rebounds and 1.8 blocks, keeping him firmly on the standard league radar. With four games coming up, anyone who could possibly give you 30 rebounds and 10 blocks is worth considering as a starting option. A perfect example of where Stewart could have value is if you also have Nic Claxton. Simple math would tell you that four games of Stewart likely beats out two games of Claxton.Consider sitting: Nic Claxton, BKNOpponents: @PHI, @MINAs for Claxton, he is another player who is putting together a relatively strong season, much like his teammate from earlier in the piece. Known for his ability to deliver typical big man stats, Claxton has quietly added another element to his game, tallying double-digit assists on two separate occasions thus far. Despite his encouraging play, two games are simply not enough, especially considering that Brooklyn is the only team with two games. In most situations, giving him the week off makes a lot of sense.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 10 Start/Sit: Spencer emerges as a must-start - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/93384fb1-9eee-4174-84f8-5e84e7f12171/thumbnail/1200x675/1cec7cd4c5cb1535c2b1e4c1ddeebdc2/cam-spencer-memphis-grizzlies.jpg"
      ],
      "datePublished": "2025-12-22T18:54:36.000Z",
      "dateModified": "2025-12-22T18:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/\n                    ",
    "image": "https://sportsfly.cbsistatic.com/fly-373/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "tag": "Sports",
    "date": "2025-12-22T17:49:00.000Z",
    "description": "\n                    \n\n                            \n            Today's Top Free Expert Picks\n        \n            \n    \n        Content on this page ",
    "body": "\n                    \n\n                            \n            Today's Top Free Expert Picks\n        \n            \n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n                    \n                                                \n\n    \n            \n            \n            \n                Mike Tierney\n            \n            \n                                    \n        \n            +255\n        \n        \n            (62%)\n        \n    \n                \n                                            8-5 in Last 13 NCAAF Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAF\n                                                WASHST @ UTAHST • Mon 2:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                UTAHST -1\n                            \n                            \n                                +104\n                            \n                        \n                                                    \n                                Spread\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 21 @ 9:30pm\n                \n                    \n                \n                    Analysis\n                \n                \n                                            Washington State is without its head coach (Jimmy Rogers, who accepted a new gig) and as many as nine players who have dived into the transfer portal. Stabliity is on the side of Utah State. The Aggies have suffered minimally on the transfer front and have retained Bronco Mendenhall, a bowl veteran as coach. He has split 14 of the games SU, many in which his team was an underdog. The Aggies have been a bettor's best friend this season, going 10-2 ATS. They closed the season with two easy wins and the narrowest of losses to UNLV and Bose State, the Mountain West's top two teams. \n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Micah Roberts\n            \n            \n                                    \n        \n            +54\n        \n        \n            (54%)\n        \n    \n                \n                                            13-11-1 in Last 25 NCAAF ATS Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAF\n                                                WASHST @ UTAHST • Mon 2:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                UTAHST -1\n                            \n                            \n                                +104\n                            \n                        \n                                                    \n                                Spread\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 21 @ 9:38pm\n                \n                    \n                \n                    Analysis\n                \n                \n                                            Utah State and Washington State both finished 6-6 on the year, but head coach Jimmy Rogers left the Washington State crew after the regular season ended. Defensive coordinator Jesse Bobbitt is going to serve as an interim coach for the bowl game and then depart to become Rogers' defensive coordinator at Iowa State. Coach Bronco Mendenhall is still there for Utah State, and probably the most exciting thing I have to say about Utah State is that they were 10-2 against the spread. That's third best in the nation behind Ohio State and Texas Tech, which was a season's best 12-1 ATS. Quarterback Bryson Barnes started for Utah State all season, and he's playing this game. Give me Utah State to win.\n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Bruce Marshall\n            \n            \n                                    \n        \n            +335\n        \n        \n            (54%)\n        \n    \n                \n                                            49-41-3 in Last 93 NCAAF Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAF\n                                                WASHST @ UTAHST • Mon 2:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                WASHST +1.5\n                            \n                            \n                                -115\n                            \n                        \n                                                    \n                                Spread\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 22 @ 4:03am\n                \n                    \n                \n                    Analysis\n                \n                \n                                            Here we go again for WSU, as like last year when Jake Dickert left for Wake Forest before the Holiday Bowl, now it's Jimmy Rogers off to Iowa State with Mizzou OC Kirby Moore to take over the HC spot in Pullman after the bowls.  Though aside from RB Kirby Voorhees, portal defections look minimal for the Cougs, and note Wazzu traded punches with several heavyweights before landing 6-6. The Utags covered 10 of 12 for new HC Bronco Mendenhall, but were only 6-6 outright, and this minimal spread suggests it's simply pick-the-winner in Boise.  The Cougs won this matchup 49-28 last year pre-Mendenhall, and suspect WSU still has some of the spark it displayed later in the season.  Play WSU (Potato Bowl at Boise) \n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Bruce Marshall\n            \n            \n                                    \n                    \n                                        \n        #4\n    \n                                    \n        \n            +372\n        \n        \n            (70%)\n        \n    \n                \n                                            7-3 in Last 10 NCAAB O/U Picks\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAB\n                                                WESTGA @ UGA • Mon 2:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                Over 162\n                            \n                            \n                                -110\n                            \n                        \n                                                    \n                                Over/Under\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 22 @ 4:17am\n                \n                    \n                \n                    Analysis\n                \n                \n                                            This could be quite a wake-up call in this Monday matinee for West Georgia. Though the Wolves are excited at this rare shot against in-state SEC big boy UGa, keep in mind that UWG has already allowed 86 points vs. Nebraska, 83 vs. UCLA, 92 vs. The Citadel, 82 vs. Georgia Tech, and 91 vs. Georgia Southern.  What, then, might happen vs. the Bulldogs, entering the week as the nation's highest scoring team at 99.5 ppg? Mike White is advising his team to shoot often and why not, hitting almost 50% from the floor, and sorts like Cal transfer G Jeremiah Wilkinson scoring at a 17.9 pg clip while playing roughly 22 minutes per contest? Georgia scores points in its sleep! Play UWG-Georgia Over\n                                    \n            \n    \n\n                    \n                                                                \n\n    \n            \n            \n            \n                Bruce Marshall\n            \n            \n                \n                                            Gold Standard\n                                    \n            \n            \n                \n                    \n                                        \n                    \n                                                    NCAAB\n                                                DENVER @ TULSA • Mon 3:00pm\n                    \n                \n                \n                    \n                    \n    \n                                                \n                    \n                                            \n                    \n                        \n                            \n                                TULSA -18\n                            \n                            \n                                -110\n                            \n                        \n                                                    \n                                Spread\n                            \n                                            \n                \n            \n                            \n                    Picked: Dec 22 @ 4:22am\n                \n                    \n                \n                    Analysis\n                \n                \n                                            A bit surprised by Denver's weekend win at Northern Colorado, considering most of the Pioneers' recent successes have come vs. lower-tier opposition. An earlier win over Colorado State, however, should keep host Tulsa on its toes, not that the Golden Hurricane wouldn't be wary after needing a last-second triple by Miles Barnstable to beat WKU by an 82-81 count on Friday. That was a legitimate scare, but all else looks good for the 11-1 Golden Hurricane.\nFeeling some heat, HC Eric Konkol might have hit a couple of jackpots in the portal,  as Barnstable (via St Thomas), G Tylen Riley (Cal Baptist) and F David Green (Rhode Island) are all scoring between 13-15 ppg.  with Tulsa scoring nearly 90 ppg. Play Tulsa\n                                    \n            \n    \n\n                    \n                                        \n            \n        \n        \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
      "image": [
        "https://sportsfly.cbsistatic.com/fly-373/bundles/sportsmediacss/images/fantasy/default-article-image-large.png"
      ],
      "datePublished": "2025-12-22T17:49:00.000Z",
      "dateModified": "2025-12-22T17:49:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football bowl and CFP picks, predictions: Legendary Vegas expert reveals best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-game-odds-picks-predictions-lines-spread-playoff-quarterfinals-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/4f039319-a5af-42ea-84e6-90f2cc5e8670/thumbnail/1200x675/d9cc699f6c3cd324d83f499f3423d7c1/chip-trayanum-toledo-rockets-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T19:24:14.000Z",
    "description": "\n        Several bowl games are already in the books, including the CFP first round, with the College Football Playoff quarterfinals then starting on ",
    "body": "\n        Several bowl games are already in the books, including the CFP first round, with the College Football Playoff quarterfinals then starting on Dec. 31. In the meantime, there is still plenty of other college football bowl action, especially on Saturday, Dec. 27. Contests that day include Penn State vs. Clemson (-3), BYU vs. Georgia Tech (+4.5), Missouri vs. Virginia (+4) and LSU vs. Houston (-3).The final college football bowl game of the year will head to the Cotton Bowl and Ohio State vs. Miami. The Dec. 31 CFP quarterfinal matchup has the reigning champion Buckeyes favored by 9.5 points, per the latest college football bowl odds. Before locking in any college football picks on those games or any others during bowl season, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 9-3 run on his official SportsLine college football over/under picks as well. Anyone following could have seen strong returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for every bowl and CFP game and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football bowl predictionsOne of the top college football picks Marshall is recommending for the remaining 2025-26 bowl schedule: He is backing Toledo (+7.5) to cover against Louisville in the Boca Raton Bowl on Tuesday, Dec. 23.The Rockets won their last four in the regular season, all by at least 18 points. Louisville, meanwhile, struggled down the stretch, losing three of its last four. \"The Rockets are on a 10-3 spread uptick (2-0 as an underdog in that span) since late last season,\" Marshall told SportsLine. \"Louisville's Jeff Brohm is 4-3 straight-up and vs. the spread in bowls. The Cardinals dropped three of the last four both straight up and vs. the line this season, though Louisville did thump Kentucky 41-0 in finale, as Louisville was just 4-8 vs. spread in 2025.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:\nHow to make college football conference championship picksMarshall has evaluated every other matchup, and he's backing a coach on an 7-1-1 spread run in bowl games dating back to his former school. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles, and find out.2025-26 college football bowl odds (through 12/27)See full college football bowl picks, odds, predictions here(odds subject to change)Monday, Dec. 22Potato Bowl: Washington State vs. Utah State (-1.5, 49.5)Tuesday, Dec. 23Boca Raton Bowl: Toledo vs. Louisville (-7, 44.5)New Orleans Bowl: Western Kentucky vs. Southern Miss (+1.5, 58.5)Frisco Bowl: UNLV vs. Ohio (+6.5, 62.5)Wednesday, Dec. 24Hawaii Bowl: Cal vs. Hawaii (-1.5, 52.5)Friday, Dec. 26GameAbove Sports Bowl: Central Michigan vs. Northwestern (-10.5, 43.5)Rate Bowl: New Mexico vs. Minnesota (-2.5, 44.5)First Responder Bowl: FIU vs. UTSA (-5.5, 59.5)Saturday, Dec. 27Military Bowl: Pittsburgh vs. East Carolina (+9.5, 56.5)Pinstripe Bowl: Clemson vs. Penn State (+3, 48.5)Fenway Bowl: Army vs. UConn (+8.5, 43.5)Pop-Tarts Bowl: Georgia Tech vs. BYU (-4.5, 56.5)Arizona Bowl: Miami (OH) vs. Fresno State (-6, 42.5)New Mexico Bowl: North Texas vs. San Diego State (+3, 54.5)Gator Bowl: Virginia vs. Missouri (-4.5, 44.5)Texas Bowl: LSU vs. Houston (-3, 41.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football bowl and CFP picks, predictions: Legendary Vegas expert reveals best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/4f039319-a5af-42ea-84e6-90f2cc5e8670/thumbnail/1200x675/d9cc699f6c3cd324d83f499f3423d7c1/chip-trayanum-toledo-rockets-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T19:24:14.000Z",
      "dateModified": "2025-12-22T19:24:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DK Metcalf previously reported Lions fan he had confrontation with to security, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-dk-metcalf-lions-fan-confrontation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/e06297ae-e808-4d40-bee7-72a0edfc7f37/thumbnail/1200x675/c2f20561a40c679c6f42cd3c83e1e0d7/dk.jpg",
    "tag": "Sports",
    "date": "2025-12-22T19:27:08.000Z",
    "description": "\n        Pittsburgh Steelers wideout DK Metcalf is awaiting potential discipline from the NFL after he had an altercation with a fan in the first half",
    "body": "\n        Pittsburgh Steelers wideout DK Metcalf is awaiting potential discipline from the NFL after he had an altercation with a fan in the first half of Pittsburgh's 29-24 victory over the Detroit Lions on Sunday.Metcalf was captured by CBS cameras walking over to a Detroit fan in the first row, grabbing his shirt and then appearing to throw a punch. According to NFL Media, Metcalf actually has a history with this fan, and reported the same fan to security last year when he was a member of the Seattle Seahawks and they were playing the Lions in Detroit.\nThe Detroit Free Press spoke to the fan, who identified himself as Ryan Kennedy from Pinckney, Michigan. The fan said he called Metcalf by his full name, DeKaylin Zecharius Metcalf, leading to the altercation.\"He doesn't like his government name,\" Kennedy told the Free Press. \"I called him that and then he grabbed me and ripped my shirt. I'm a little shocked. Like everyone's talking to me. I'm a little rattled, but I just want the Lions to win, baby.\"Metcalf has a different version of events claiming multiple derogatory words were used, per NFL Media. Kennedy denied using any slurs in a statement released Monday through an attorney.\nMetcalf was not penalized for his interaction, as the incident took place off the field. The fan was not ejected from the game, per the Free Press. Steelers coach Mike Tomlin did not pull Metcalf from the game either, and he finished with 42 yards receiving on four catches.\"I heard about it, but I hadn't seen it and I hadn't had an opportunity to talk to DK and so I have no comment,\" Tomlin said after the game.CBS rules analyst Gene Steratore explained during the game that it wasn't expected the officials would flag Metcalf for this altercation, but that the league would definitely look into it. \n\"Because the officials did not see this -- and you wouldn't expect them to from where DK Metcalf was, it's not something they can weigh in to from an officiating standpoint. I have been notified, though, that will be delivered to compliance with the NFL, and they'll address it at that point,\" Steratore said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DK Metcalf previously reported Lions fan he had confrontation with to security, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/e06297ae-e808-4d40-bee7-72a0edfc7f37/thumbnail/1200x675/c2f20561a40c679c6f42cd3c83e1e0d7/dk.jpg"
      ],
      "datePublished": "2025-12-22T19:27:08.000Z",
      "dateModified": "2025-12-22T19:27:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan coaching search: Biff Poggi calls out 'malfunctioning organization' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-coaching-search-biff-poggi-sherrone-moore-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/807f0f4e-68a9-4992-a5fa-1703e00129ef/thumbnail/1200x675/2b0753badda2e640811be29e66de2a45/usatsi-27072261-1.jpg",
    "tag": "Sports",
    "date": "2025-12-22T19:24:43.000Z",
    "description": "\n        Sherrone Moore's firing at Michigan in the wake of an \"inappropriate relationship\" with a staff member was the latest in a string of scandals",
    "body": "\n        Sherrone Moore's firing at Michigan in the wake of an \"inappropriate relationship\" with a staff member was the latest in a string of scandals to shake the Wolverines football program. Interim coach Biff Poggi did not shy away from calling out Michigan for its lengthy list of recent issues, calling it a \"malfunctioning organization\" when meeting with reporters Monday.The latest troubles from inside Schembechler Hall came after Michigan fell under the NCAA's watchful eye for recruiting violations and the sign-stealing operation that occurred under former coach Jim Harbaugh. While Moore's scandal was an individual case rather than a systemic bending of the rules, it added to the already tarnished reputation of a program that has been in the news for all the wrong reasons since its 2023 national championship.\"It has been five years of -- let's just call it what it is -- a malfunctioning organization where there's something every year,\" Poggi said. \"The athletic director has made it very clear he doesn't want any more of that. If I am named the coach, which I don't know if I am, there will be a massive self-examination of what's happened in this building. And you can expect a lot of changes.\"Michigan authorized an investigation into its athletic department's handling of the Moore situation. Chicago-based law firm Jenner & Block will conduct a comprehensive review of the entire department, and CBS Sports' Brandon Marcello reports that the investigation is \"open-ended\" to the point that Michigan is unsure what it might uncover.\nInterim university president Domenico Grasso said Michigan is willing to \"act swiftly\" if findings from the investigation warrant more terminations.\"We will take whatever steps are necessary to ensure that conduct like this does not happen again,\" Grasso said. \"Make no mistake. We will leave no stone unturned, and any further action we take will be based on credible evidence and findings, developed through a rigorous investigation.\"Not only did Moore's two-year tenure come to a close because of his impermissible conduct with a staffer, but he also faces an active show-cause penalty for his involvement in the Wolverines' sign-stealing operation. A separate case implicated former co-offensive coordinator Matt Weiss for illegally accessing private information on campus. Another involved Harbaugh, who was investigated for making contact with recruits during a dead period amid the COVID-19 pandemic.\n\"Everything that happens in this building has to be reevaluated, quite frankly, because it is not up to standard,\" Poggi said. \"The staff has to be reevaluated. I mean the coaches, I mean the analysts, I mean everybody in the building has to be evaluated.\"Biff Poggi seeks full-time job, vows to make changesThe Wolverines are in the midst of a coaching search, and one of the factors they will undoubtedly consider in identifying a new leader is his ability to stabilize a program that has been in hot water for the better part of this decade. Poggi made his case for the full-time job and emphasized his desire to do just that.\"This place is magical,\" Poggi said. \"The program means a lot to me. It's one of the things I want to fix before I go smoke myself to death with cigars. It's one of the things I want to fix. I want to fix this program.\"\n\n        \n            \n                Biff Poggi emerges as realistic -- but risky -- option for Michigan as administration appears in flux\n                \n                    Richard Johnson                \n            \n                            \n    \n                \n                    \n    \nPoggi last held a head coaching role at Charlotte during the 2023 and 2024 seasons. In his lone tenure as an FBS headman, he went 6-16 with the 49ers and never won more than three games in a campaign. He did fare better this year when he handled the duties during Moore's two-game suspension, though, and received credit for the Wolverines' victories over Central Michigan and Nebraska.Serving as Michigan's leader in an interim capacity sparked Poggi's interest in manning the duties in a permanent capacity. That interest appears to be mutual.\"I'm being considered,\" Poggi said. \"I've had multiple interviews, multiple conversations. Nobody knows what's going to happen. I don't know what's going to happen. I just appreciate being considered, and we'll see what happens.\"\nPoggi will coach Michigan against Texas in the Citrus Bowl on Dec. 31. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan coaching search: Biff Poggi calls out 'malfunctioning organization' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/807f0f4e-68a9-4992-a5fa-1703e00129ef/thumbnail/1200x675/2b0753badda2e640811be29e66de2a45/usatsi-27072261-1.jpg"
      ],
      "datePublished": "2025-12-22T19:24:43.000Z",
      "dateModified": "2025-12-22T19:24:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25: Duke drops after first loss in updated college basketball rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ap-top-25-college-basketball-rankings-duke-texas-tech-arizona-michigan/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/821608e1-9b44-44a4-bd33-134037f9aa68/thumbnail/1200x675/c62f770cb519abc9b2872cb4a5f5c527/duke-ttu-getty.png",
    "tag": "Sports",
    "date": "2025-12-22T18:31:55.000Z",
    "description": "\n        For the first time in a few weeks, there was movement among the highest-ranked teams in the AP Top 25 college basketball poll. Arizona and Mi",
    "body": "\n        For the first time in a few weeks, there was movement among the highest-ranked teams in the AP Top 25 college basketball poll. Arizona and Michigan stayed ranked No. 1 and No. 2, respectively, but Duke dropped after suffering its first loss of the season to Texas Tech.The Blue Devils dropped three spots to No. 6 following the 82-81 loss. Duke led by as many as 17 points before Texas Tech stormed back in the second half to record one of the most impressive wins of any team so far this season. After the win, the Red Raiders jumped four spots to No. 15.\n        \n            \n                College basketball rankings: Undefeated Michigan holds onto No. 1 spot in Top 25 And 1\n                \n                    Gary Parrish                \n            \n                            \n    \n                \n                    \n    \nArizona, now 11-0, remained at No. 1 for the third consecutive week but No. 2 Michigan is inching closer. Arizona received 38 first-place votes, ahead of Michigan's 19, but the Wildcats were just 20 points ahead -- 1428 to 1408 -- of the Wolverines in this week's poll. Another undefeated team, 12-0 Iowa State, was next at No. 3 with No. 4 UConn and No. 5 Purdue rounding out the top five. Those three teams all moved up a spot with Duke dropping to No. 6. \nAP Top 251. Arizona (38)2. Michigan (19)3. Iowa State (1)4. UConn5. Purdue6. Duke7. Gonzaga8. Houston9. Michigan State10. BYU11. Vanderbilt12. North Carolina13. Nebraska14. Alabama15. Texas Tech16. Louisville17. Kansas18. Arkansas19. Tennessee20. Illinois21. Virginia22. Florida23. Georgia24. USC25. IowaOthers receiving votes: Kentucky 78, Seton Hall 49, Auburn 39, St. John's 23, California 19, LSU 17, UCLA 13, Clemson 9, Miami (Ohio) 6, Utah State 5, Arizona State 5, Indiana 4, Miami 4, Saint Louis 3, Belmont 2, Baylor 1, Oklahoma State 1, UCF 1, NC State 1.Michigan gets a boost after Duke's lossMichigan remained at No. 2 this week in the poll, but the gap between the Wolverines and top-ranked Arizona is shrinking. The Wolverines received 15 first-place votes last week and got 19 this week. Michigan, Arizona and Iowa State were the lone teams to receive a first-place vote.\nDuke received three first-place votes last week but didn't get one this week after the loss to Texas Tech. It appears that Arizona will not get jumped in the poll by No. 1 by Michigan, Iowa State, or another team until it suffers a loss. The Wildcats had an early scare against San Diego State last weekend, but pulled away down the stretch.North Carolina doesn't move up despite win over Ohio StateOne of the best stories of the season that may be flying under the radar is the play of North Carolina. The Tar Heels stayed at No. 12 despite recording a dramatic win over Ohio State in the CBS Sports Classic. UNC big man Henri Veesaar scored a go-ahead bucket with 7.2 seconds remaining, and his team was able to get a stop on the defensive end to preserve a 71-70 win. North Carolina won its third game this season against a Quad 1 opponent after going 1-13 against those teams last season.Although North Carolina didn't move up this week, there will be ample opportunities to do so once conference play gets going around the country.\nAuburn drops out of the pollSince Jan. 1, 2024, Auburn has been a staple in the AP Top 25 ... until now. The Tigers dropped out of the poll for the first time in nearly two years after suffering a blowout loss to Purdue last weekend. Last season's No. 1 overall seed in the NCAA Tournament is 8-4 with losses to Purdue, Houston, Michigan and Arizona.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25: Duke drops after first loss in updated college basketball rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/821608e1-9b44-44a4-bd33-134037f9aa68/thumbnail/1200x675/c62f770cb519abc9b2872cb4a5f5c527/duke-ttu-getty.png"
      ],
      "datePublished": "2025-12-22T18:31:55.000Z",
      "dateModified": "2025-12-22T18:31:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football bowl game odds, 2025-26 CFP picks, best bets, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-playoffs-cfp-quarterfinals-2025-odds-lines-spread-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/6d61e9ba-b7c2-4bc0-94c7-6fb279843011/thumbnail/1200x675/f0f02da87c366aad2897aace4655f073/ethan-grunkemeyer-penn-state-nittany-lions-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T17:30:06.000Z",
    "description": "\n        The 2025-26 college football bowl schedule has seen the CFP first round completed, and now the action resumes on Monday with Washington State",
    "body": "\n        The 2025-26 college football bowl schedule has seen the CFP first round completed, and now the action resumes on Monday with Washington State vs. Utah State (-1.5) in the Famous Idaho Potato Bowl. This is also a matchup of future Pac-12 teams as they'll both be in the revamped conference next season. Other college football bowl lines include Cal vs. Hawaii (-1.5) on Wednesday, New Mexico vs. Minnesota (-2.5) on Friday, and Penn State vs. Clemson (-3) on Saturday. The CFP quarterfinals then begin on New Year's Eve, with the No. 2 Ohio State Buckeyes favored by 9.5 points over the No. 10 Miami Hurricanes in the Cotton Bowl. Before locking in any college football bowl picks for those games or others, be sure to see the latest bowl and playoff college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting lines on the spread, money line and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for bowl seasonOne of the college football picks the model is high on during the 2025-26 college football bowl schedule: Penn State (+3, 48.5) covers against Clemson in the Pinstripe Bowl on Saturday, Dec. 27 at noon ET. Both schools vastly underperformed this year but had strong finishes, with each finishing the season 3-1 ATS. However, Dabo Swinney has lost four of his last six bowl games, with each defeat coming by at least 14 points. This year, his Tigers are averaging 28.7 points, which ranks 61st in the nation, while Penn State, despite playing in the much tougher Big Ten, ranks 37th nationally in scoring. Also, the location of this game in New York City favors a northeastern university like Penn State over Clemson from South Carolina. The Nittany Lions cover well over 60% of the time, while the model also says the Under hits in almost 60% of simulations. See which other picks the model likes here.\nAnother prediction: Missouri (-4.5, 44.5) covers versus No. 20 Virginia in the Gator Bowl on Dec. 27 in almost 60% of simulations. UVA is coming off an ACC Title Game loss to Duke, in which the Cavaliers would have made the CFP if they had won. Thus, you have to wonder about motivation now that they have to settle for a lesser bowl game, and Virginia has struggled in bowls to begin with, going 1-4 over the last 19 years. Mizzou has won back-to-back bowls under Eli Drinkwitz, and the Tigers' only losses this season came versus teams ranked in the top 10 of the AP Poll at the time. Missouri is 4-1 ATS at neutral sites since Drinkwitz took over in 2020, and the Tigers are 12-4 ATS as favorites since the start of last season. See the rest of the model's picks here.How to make college football picks for bowl seasonThe model has also made the call on who wins and covers in every 2025-26 college football bowl game, and it's calling for five underdogs to outright win in bowl matchups of power conference teams. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which five underdogs are projected to win outright? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.2025-26 college football bowl odds (through 12/27)See full college football bowl picks, odds, predictions here(odds subject to change)Monday, Dec. 22Potato Bowl: Washington State vs. Utah State (-1.5, 49.5)Tuesday, Dec. 23Boca Raton Bowl: Toledo vs. Louisville (-7, 44.5)New Orleans Bowl: Western Kentucky vs. Southern Miss (+1.5, 58.5)Frisco Bowl: UNLV vs. Ohio (+6.5, 62.5)Wednesday, Dec. 24Hawaii Bowl: Cal vs. Hawaii (-1.5, 52.5)Friday, Dec. 26GameAbove Sports Bowl: Central Michigan vs. Northwestern (-10.5, 43.5)Rate Bowl: New Mexico vs. Minnesota (-2.5, 44.5)First Responder Bowl: FIU vs. UTSA (-5.5, 59.5)Saturday, Dec. 27Military Bowl: Pittsburgh vs. East Carolina (+9.5, 56.5)Pinstripe Bowl: Clemson vs. Penn State (+3, 48.5)Fenway Bowl: Army vs. UConn (+8.5, 43.5)Pop-Tarts Bowl: Georgia Tech vs. BYU (-4.5, 56.5)Arizona Bowl: Miami (OH) vs. Fresno State (-6, 42.5)New Mexico Bowl: North Texas vs. San Diego State (+3, 54.5)Gator Bowl: Virginia vs. Missouri (-4.5, 44.5)Texas Bowl: LSU vs. Houston (-3, 41.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football bowl game odds, 2025-26 CFP picks, best bets, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/6d61e9ba-b7c2-4bc0-94c7-6fb279843011/thumbnail/1200x675/f0f02da87c366aad2897aace4655f073/ethan-grunkemeyer-penn-state-nittany-lions-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T17:30:06.000Z",
      "dateModified": "2025-12-22T17:30:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Willson Contreras traded to Red Sox as Cardinals continue rebuild - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/willson-contreras-trade-red-sox-cardinals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/16/6e37854c-b251-44ec-99c9-434bf27202e3/thumbnail/1200x675/080c3a67250e92f6f2c1566e831be516/contreras-getty.png",
    "tag": "Sports",
    "date": "2025-12-22T19:50:37.000Z",
    "description": "\n        The Boston Red Sox have acquired veteran slugger Willson Contreras in a trade with the St. Louis Cardinals, the team announced Monday. The Ca",
    "body": "\n        The Boston Red Sox have acquired veteran slugger Willson Contreras in a trade with the St. Louis Cardinals, the team announced Monday. The Cardinals will receive righty Hunter Dobbins and minor-league pitchers Yhoiker Fajardo and Blake Aita in return. This is the second significant Cardinals/Red Sox trade this offseason; Boston sent two young pitchers to St. Louis for Sonny Gray last month.Similar to Gray, Contreras will receive an additional $1 million in guaranteed money in exchange for waiving his no-trade clause, according to the Boston Globe. He is signed through 2027 with a club option for 2028, and now has $42.5 million coming his way. The Cardinals will pay $8 million of the $42.5 million, reports MassLive. While Contreras initially showed no interest in leaving St. Louis, even in the face of the ongoing rebuild, he eventually reconsidered and waived it to approve the deal to a Red Sox club that, unlike the Cardinals, figures to contend in 2026.\n        \n            \n                Willson Contreras trade grades: Red Sox finally get their big bat, Cardinals continue clearing out veterans\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nThe trade pushes Boston's payroll into the same range as last year, meaning the the Red Sox will either have to raise payroll or shed a contract(s) to bring back third baseman Alex Bregman.Contreras, who's going into his age-34 season, is a former catcher who will likely man first base and DH for the Red Sox, as he did for the Cardinals in 2025. He gives Boston a needed middle-of-the-order righty bat and fits Fenway Park well given his above-average pulled fly ball rate. Contreras is coming off another productive season: \nThose 2025 outputs were good for a 123 OPS+ and a 2.5 WAR in 135 games. Contreras continues to back up his strong offensive production with similarly imposing batted-ball indicators. All of that suggests he's likely to continue producing at a high level for the time being. For his career, the three-time All-Star has an OPS+ of 118 and a WAR of 29.2 across parts of 10 MLB seasons. Over that same span, he's averaged 26 home runs and 31 doubles per 162 games played. Defensively, Contreras put up strong numbers last season, his first as a primary first baseman.Dobbins, 26, had a 4.13 ERA with 45 strikeouts in 61 innings in 2025, his first season in the majors. A knee injury ended his season in July, though he is expected to be ready in time for spring training. MLB Pipeline ranked Fajardo as the No. 23 prospect in Boston's system, calling him a \"potential mid-rotation starter.\" Aita was unranked. He and Fajardo both pitched in Single-A in 2025.\nBoston went 87-73 in 2025 and reached the postseason for the first time since 2021. They were eliminated by the rival New York Yankees in the Wild Card Series.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Willson Contreras traded to Red Sox as Cardinals continue rebuild - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/16/6e37854c-b251-44ec-99c9-434bf27202e3/thumbnail/1200x675/080c3a67250e92f6f2c1566e831be516/contreras-getty.png"
      ],
      "datePublished": "2025-12-22T19:50:37.000Z",
      "dateModified": "2025-12-22T19:50:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Byrum Brown to enter transfer portal: Reunion at Auburn with Alex Golesh in the cards? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/byrum-brown-south-florida-qb-transfer-portal-alex-golesh-auburn/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/6bb57b26-c8d6-43ca-a6b7-b695188b00ad/thumbnail/1200x675/f75c603decd24654ea7aacaef5c32384/byrum-brown.jpg",
    "tag": "Sports",
    "date": "2025-12-22T18:20:41.000Z",
    "description": "\n        South Florida quarterback Byrum Brown is set to enter the transfer portal when the window officialy opens Jan. 2, sources told CBS Sports Mat",
    "body": "\n        South Florida quarterback Byrum Brown is set to enter the transfer portal when the window officialy opens Jan. 2, sources told CBS Sports Matt Zenitz. To little surprise, Auburn is expected to be a school to watch once his name officially hits the market, according to CBS Sports' Chris Hummer.Brown informed USF of his decision this morning, Hummer reported. The Bulls made a significant push to try and keep Brown, who leaves the program as one of the most accomplished players in school history with 15 combined individual records.Brown's potential move would reunite him with Alex Golesh, who was hired as Auburn's new coach on Nov. 30 after three seasons at USF. Golesh built his offense around the dual-threat quarterback, who developed into one of the most productive and dynamic players in the country.Auburn's interest is unsurprising given the program's ongoing search for stability at quarterback. The position has been a recurring pressure point since the start of Hugh Freeze's tenure in 2023, marked by portal additions that failed to deliver sustained success. Payton Thorne, a transfer from Michigan State, brought experience but struggled with consistency and production, while Jackson Arnold's brief stint in 2025 reflected difficulty Auburn has had finding the right fit under center. The result has been a revolving door, leaving the Tigers searching for an answer.\nBrown burst onto the scene in 2023, throwing for more than 3,292 yards while accounting for 37 total touchdowns, showcasing a blend of arm talent and mobility that fit seamlessly in Golesh's uptempo, quarterback-friendly system. Even amid injuries -- missing seven games in 2024 with a lower leg injury -- and roster turnover, Brown remained the centerpiece of the Bulls' offense, helping the program to its first nine-win season in eight years. He threw for 3,158 yards and 28 touchdowns, while rushing for 1,008 yards -- fourth-most by an FBS quarterback this season -- with 14 rushing scores.In 35 career games played at USF, Brown racked up 7,690 yards passing with 61 touchdowns and 19 interceptions while completing 65% of his passes. He also totaled 2,265 yards rushing with 31 touchdowns on 477 carries, averaging 4.7 yards per attempt.Brown has one year of eligibility remaining.\nHis familiarity with Golesh's playbook and terminology would ease a transition to the SEC as Auburn looks to finally solidify the quarterback position.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Byrum Brown to enter transfer portal: Reunion at Auburn with Alex Golesh in the cards? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/6bb57b26-c8d6-43ca-a6b7-b695188b00ad/thumbnail/1200x675/f75c603decd24654ea7aacaef5c32384/byrum-brown.jpg"
      ],
      "datePublished": "2025-12-22T18:20:41.000Z",
      "dateModified": "2025-12-22T18:20:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Notre Dame vs. USC rivalry to go on hiatus as two sides fail to reach extension - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/notre-dame-vs-usc-rivalry-hiatus-big-ten/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/c9c8fd27-6a57-4bd4-a103-854e4feed67a/thumbnail/1200x675/dde7c24ef49b2ab9e7c0ef6a9eb65a76/gettyimages-2242427206-1.jpg",
    "tag": "Sports",
    "date": "2025-12-22T18:01:13.000Z",
    "description": "\n        USC and Notre Dame failed to reach an agreement on playing one another during the 2026 season, placing the future of their annual rivalry gam",
    "body": "\n        USC and Notre Dame failed to reach an agreement on playing one another during the 2026 season, placing the future of their annual rivalry game in jeopardy, according to Yahoo Sports. USC is seeking a replacement opponent while Notre Dame announced a home-and-home series with BYU to take place in 2026 and 2027. Notre Dame's trip to Provo will round out its 2026 schedule. USC and Notre Dame are still working to restart the series as soon as 2030, Yahoo reports, though scheduling complications and College Football Playoff considerations put one of college football's most storied rivalries on hiatus. \"USC and Notre Dame recognize how special our rivalry is to our fans, our teams, and college football, and our institutions will continue working towards bringing back The Battle for the Jeweled Shillelagh,\" Notre Dame and USC said in a joint statement. \"The rivalry between our two schools is one of the best in all of sport, and we look forward to meeting again in the future.\" The Fighting Irish and the Trojans have played yearly since 1946 other than a brief pause in 2020 due to the COVID-19 pandemic. \n\"I think Southern Cal and Notre Dame should play every year for as long as college football is played, and SC knows that's how we feel,\" Notre Dame athletic director Pete Bevacqua told Sports Illustrated in May. USC coach Lincoln Riley, meanwhile, cast doubt on the future of the game. \"There (have) been a lot of teams that sacrifice rivalry games,\" Riley told reporters at 2024 Big Ten Media Days. \"I'm not saying that's what's going to happen, but as we get into this playoff structure and if it changes or not, we get into this new conference, we're going to learn some about this as we go and what the right and best track is to winning a national championship.\"Notre Dame and USC were on the verge of finalizing a two-year extension in November, Yahoo reports, though USC officials backed out after determining that the timing of the proposed game was not ideal given the CFP selection committee's tendency to punish late-season losses. \nUSC also has to deal with the rigors of a Big Ten schedule that sees it play nine conference games on a yearly basis. The Trojans faced three ranked opponents during their 2025 Big Ten slate, while Notre Dame has the flexibility of scheduling as an independent outside of its agreement with the ACC. Notre Dame has won three consecutive games, and seven of its last eight, against USC. The Fighting Irish also hold an all-time series record of 51-37-5.Notre Dame opened the 2025 season with losses to Miami and Texas A&M before rattling off 10 consecutive victories to finish 10-2. However, the Irish were left out of the College Football Playoff field. Next season, Notre Dame will open its season against Wisconsin at Lambeau Field and will face Rice, Michigan State, Miami, Boston College, SMU and Stanford at home and Purdue, North Carolina, Syracuse and BYU on the road with a neutral-site game against Navy in Foxborough, Massachusetts. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Notre Dame vs. USC rivalry to go on hiatus as two sides fail to reach extension - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/c9c8fd27-6a57-4bd4-a103-854e4feed67a/thumbnail/1200x675/dde7c24ef49b2ab9e7c0ef6a9eb65a76/gettyimages-2242427206-1.jpg"
      ],
      "datePublished": "2025-12-22T18:01:13.000Z",
      "dateModified": "2025-12-22T18:01:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]