[
  {
    "title": "Patriots vs. Seahawks prediction, odds, game date, betting line: 2026 Super Bowl picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-seahawks-prediction-odds-line-spread-game-date-2026-super-bowl-60-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/84af6dbc-41fc-4de8-8c55-3948d0f09222/thumbnail/1200x675/68f0a661788425b6060469006f437de2/drake-maye-mike-vrabel.jpg",
    "tag": "Sports",
    "date": "2026-02-01T17:30:37.000Z",
    "description": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks on Sunday, Feb. 8. For the first time in the histo",
    "body": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks on Sunday, Feb. 8. For the first time in the history of The Big Game, each team ranks in the top four in both scoring offense and scoring defense, providing a balanced Super Bowl 60 matchup. New England (14-3) went on the road to defeat Denver, 10-7, in the AFC Championship Game, while Seattle (14-3) held off the Rams, 31-27, to claim the NFC Title Game. The 2026 Super Bowl is a rematch from 11 years ago when the Pats prevailed 28-24 to win Super Bowl XLIX. New England quarterback Drake Maye didn't practice on Friday due to an illness. Kickoff is at 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. The Seahawks are 11-9 all-time versus New England. Seattle is the 4.5-point favorite in the latest Seahawks vs. Patriots   odds from DraftKings Sportsbook, while the over/under for total points is 45.5, with the Over slightly favored at -112 and the Under a -108. Seattle is at -229 on the money line (risk $229 to win $100). Before making any Patriots vs. Seahawks picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Seahawks vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Patriots vs. Seahawks:\nSeahawks vs. Patriots spreadSeattle -4.5 (-115) at DraftKings SportsbookSeahawks vs. Patriots                 over/under45.5 pointsSeahawks vs. Patriots                                                                                                                                                                                  money line Seahawks -230, Patriots +190Seahawks vs. Patriots                                                                                                                                                                         picksSee picks at SportsLineSeahawks vs. Patriots                                                                                                                                                                            streaming Fubo (try for free)Why the Patriots can coverThe Pats shook off talk about their weak strength of schedule by defeating three playoff teams that had 11-plus wins in the regular season. They enter Super Bowl LX with a 16-1 record over their last 17 games, which is not a record that even Seattle can measure up to. New England has incredible balance, ranking second in points scored and fourth in points allowed, with the offense specifically standing out. Drake Maye combines both efficiency with a big-play ability as he leads the league in both completion percentage and yards per pass attempt. Meanwhile, the defense is playing its best entering Super Bowl Sunday as New England has given up one or fewer touchdowns in each of its last five games. See which team to back at SportsLine. Why the Seahawks can coverIt's hard to find any holes with Seattle, including in regard to the spread, as it has both the most covers and the best cover percentage of the regular plus postseason. The Seahawks are the only NFL team to rank in the top three in both scoring offense and scoring defense, and just five teams had more takeaways in the regular season. Mike Macdonald's crew also boasts top-10 rankings on both the ground and thru the air, but the defense is the star of this team. Seattle leads the NFL in points allowed, third-down defense, yards per rush allowed and yards per pass attempt allowed while ranking second in yards per play given up and rushing touchdowns allowed. No. 1 scoring defenses, like what Seattle has, also have a great history in this game, with a 14-4 all-time Super Bowl record. See which team to back at SportsLine.How to make Seahawks vs. Patriots picksSportsLine's model has simulated Patriots vs. Seahawks 10,000 times and is going Under on the total, projecting 44 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Seahawks vs. Patriots, and which side of the Super Bowl spread is the better value? Visit SportsLine now to see which side of the Patriots vs. Seahawks spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks prediction, odds, game date, betting line: 2026 Super Bowl picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/84af6dbc-41fc-4de8-8c55-3948d0f09222/thumbnail/1200x675/68f0a661788425b6060469006f437de2/drake-maye-mike-vrabel.jpg"
      ],
      "datePublished": "2026-02-01T17:30:37.000Z",
      "dateModified": "2026-02-01T17:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Super Bowl longshot parlay, SGP picks, player prop bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-super-bowl-sgp-player-props-seahawks-patriots-parlay-picks-odds-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/db702f00-98e3-425e-9a95-2de0bd25ae37/thumbnail/1200x675/9106bf135ebdb043d21ba3d0b8eb143c/usatsi-23950732.jpg",
    "tag": "Sports",
    "date": "2026-02-01T17:47:25.000Z",
    "description": "\nFrom NFL player props to Patriots vs. Seahawks (-4.5) picks against the spread, to over/under picks (45.5), to money-line picks (Seahawks -230, Patri",
    "body": "\nFrom NFL player props to Patriots vs. Seahawks (-4.5) picks against the spread, to over/under picks (45.5), to money-line picks (Seahawks -230, Patriots +190), your 2026 Super Bowl parlay can go in a number of different directions. Another option is guessing the margin of victory of the game, and there's an NFL betting trend that could help in that regard. Entering Super Bowl LX, three of the last four editions of The Big Game have been decided by exactly 3 points. So, you could back the game's winning margin to be exactly 3 points in a 2026 Super Bowl SGP, which would return +475.Seattle winning by 3 points has +950 NFL prop odds, while New England doing the same carries +1100 odds. You could also make NFL bets on winning bands, with Seattle prevailing by 1-6 points at +275. But if you want to increase your potential winnings exponentially, then you could string one of these wagers with others into a lucrative Super Bowl same-game parlay. There are countless 2026 Super Bowl picks with plus-money payouts you can target, from alternate lines to anytime TD scorers to exact score predictions. Before making any Super Bowl 60 picks and NFL parlays, you need to see the epic Super Bowl LX same game parlay from SportsLine's proven model that pays out $15,000 on just a $10 bet.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Super Bowl 60 NFL odds, it's locked in its betting picks to form a longshot NFL parlay that could pay out $15,000 for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.\nTop 2026 Super Bowl parlay picksFor Super Bowl LX, one of the picks featured in the longshot parlay is Patriots receiver Kayshon Boutte as an anytime TD scorer (+310). Despite ranking 68th amongst wideouts in catches (33) in the regular season, Boutte was 18th in positional receiving touchdowns (6). He added another score in the Divisional Round and then got a redzone target in the AFC Title Game. While Seattle has an elite defense, through the air is where to exploit that unit. Eight of the last 10 touchdowns the Seahawks have allowed have been via the pass, including all three they gave up in the NFC Title Game.Boutte has more touchdowns this season than the Pats leading receiver, Stefon Diggs, despite the latter having twice as many targets and receptions. The model projects Boutte to score 0.31 touchdowns, which is the highest amongst all Patriots and brings great value to these plus-money odds as one leg of a Super Bowl SGP. See the rest of the picks in the Super Bowl LX same game parlay here, and you can bet Boutte as an anytime TD scorer using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make NFL parlay picks for a payout of $15,000The parlay also includes three additional Super Bowl picks from SportsLine's NFL model, including a must-see first NFL touchdown-scorer prop that pays out 25-1. You can only see the Seahawks vs. Patriots picks and the full parlay at SportsLine.What are the top NFL picks for Super Bowl LX that can be combined into an NFL SGP that returns $15,000 on just a $10 bet, and which optimal first touchdown scorer prop pays out 25-1? Visit SportsLine now to see the top Patriots vs. Seahawks picks from SportsLine's proven model that can be combined for a parlay that pays $15,000, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Super Bowl longshot parlay, SGP picks, player prop bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/db702f00-98e3-425e-9a95-2de0bd25ae37/thumbnail/1200x675/9106bf135ebdb043d21ba3d0b8eb143c/usatsi-23950732.jpg"
      ],
      "datePublished": "2026-02-01T17:47:25.000Z",
      "dateModified": "2026-02-01T17:47:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus by targeting Spurs-Magic, Suns-Clippers, Oregon-Iowa on Sunday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/draftkings-promo-code-bonus-bets-spurs-magic-suns-clippers-oregon-iowa-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-02-01T15:29:36.000Z",
    "description": "\n        Sunday offers plenty of opportunities to take advantage of the latest DraftKings promo code, which offers new users $300 in bonus bets if the",
    "body": "\n        Sunday offers plenty of opportunities to take advantage of the latest DraftKings promo code, which offers new users $300 in bonus bets if their first $5 wager wins. There are 10 games in the NBA today and 25 in college basketball. The San Antonio Spurs will host the Orlando Magic at 7 p.m. ET in an important battle between two teams jockeying for playoff positioning. The Spurs are favored by 5.5 and the SportsLine Projection Model is predicting that San Antonio covers the spread comfortably, listing it as an A-rated pick.It's also recommending Over 212.5 points in Suns vs. Clippers at 8 p.m. ET. College basketball expert Bruce Marshall is going Under 133.5 points in Oregon vs. Iowa at 8 p.m. ET as well. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Sunday best bets at DraftKings SportsbookSpurs -5.5 vs. Magic (-118)Over 212.5 points in Suns vs. Clippers (-110)Under 133.5 points in Oregon vs. Iowa (-115)Combining the three picks into a Saturday parlay at DraftKings would result in a payout of +559 (risk $100 to win $559). Bet it at DraftKings here: (Odds subject to change)\nSpurs -5.5 vs. Magic (-118)Victor Wembanyama and the San Antonio Spurs are off to a 32-16 start this season and currently sit third in the West. They're also 16-6 at home this season while the Orlando Magic have struggled on the road (10-12). The Magic are 25-22 overall this season and are seventh in the East, with 1.5 games of ground to make up on the 76ers to avoid the NBA play-in tournament. With Franz Wagner (ankle) ruled out as Orlando attempts to manage his injury, the model predicts that the Spurs cover the spread in 68% of simulations. Bet San Antonio to cover at DraftKings here:\nOver 212.5 points in Suns vs. Clippers (-110)Devin Booker (ankle) will not play and Jalen Green (hip/hamstring) is questionable, which is likely driving this total down. However, the Suns have still managed three wins in a row and even scored a high-scoring 126-113 win over the Cavaliers on Friday. Meanwhile, there have been a minimum of 217 points scored in each of the last nine Clippers games. The model predicts that the Over hits in 63% of simulations. Bet the Over at DraftKings here:\nUnder 133.5 points in Oregon vs. Iowa (-115)\"These days, the Ducks are having enough trouble scoring points vs. teams that like to push the pace, never mind those wishing to slow the tempo. Iowa fits the latter description as the Hawkeyes don't play in a hurry and lock down on the stop end, all characteristics of Ben McCollum teams,\" Marshall told SportsLine. \"The Hawkeyes rank fifth nationally in scoring defense at 62.8 ppg. Still, we can't kid anybody, the main attraction is taking advantage of Oregon's myriad current issues, especially as it has been without top two scorers Nate Bittle and Jackson Shelstad, and can't seem to gain an inch in the Big Ten, and not beyond 57 points the past three games. Getting this scoreline past 130 looks a real chore.\" Bet the Under at DraftKings here:\nWant more NBA and college basketball on Sunday?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus by targeting Spurs-Magic, Suns-Clippers, Oregon-Iowa on Sunday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-02-01T15:29:36.000Z",
      "dateModified": "2026-02-01T15:29:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duquesne vs. Rhode Island prediction, odds, time, spread: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/rhode-island-duquesne-odds-prediction-time-2026-college-basketball-picks-sunday-february-1/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/21728f0c-b40c-45ad-8e13-261cd495046b/thumbnail/1200x675/9f884c32a0698302ecc8fcd8b5df19e0/jonah-hinton-rhode-island-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-01T13:30:40.000Z",
    "description": "\n        Atlantic-10 action helps get the Sunday college basketball action underway as the Rhode Island Rams travel to take on the Duquesne Dukes. Rho",
    "body": "\n        Atlantic-10 action helps get the Sunday college basketball action underway as the Rhode Island Rams travel to take on the Duquesne Dukes. Rhode Island is 13-8 (4-4 A-10) and is coming off an 81-76 overtime win over Dayton. Duquesne is 11-10 (3-5 A-10) and suffered an 87-79 defeat to St. Bonaventure in its last contest. It'll be a fascinating stylistic matchup as Duquesne plays with tempo and averages 83.2 points per game, while Rhode Island specializes in defense and gives up just 67.3 points per game. Tipoff from UPMC Cooper Fieldhouse in Pittsburgh is set for noon ET. The Dukes have won each of the last three matchups. Duquesne is a 2.5-point favorite in the latest Duquesne vs. Rhode Island odds, while the over/under is 144.5. Before making any Rhode Island vs. Duquesne picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 13 on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and it is on a 6-0 roll on college basketball side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Duquesne vs. Rhode Island 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Rhode Island vs. Duquesne:Duquesne vs. Rhode Island spread:    Duquesne -2.5 at DraftKingsDuquesne vs. Rhode Island over/under:    144.5 pointsDuquesne vs. Rhode Island money line:    Duquesne -138, Rhode Island +115Duquesne vs. Rhode Island picks:    See picks at SportsLineDuquesne vs. Rhode Island streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Duquesne vs. Rhode Island picksAfter 10,000 simulations of Rhode Island vs. Duquesne, SportsLine's model is going Over on the total (144.5 points). Rhode Island has seen its last two games, and three of its last four, go Over, while the Dukes have lived in the Over nearly all season. Duquesne has seen the Over hit in 68% of games (13-6), with an even higher mark of 72% of its home games.The Dukes' 83.2 ppg rank among the top 15% in all of college basketball, but they are giving on the other end of the court. They are just 282nd in the nation in points allowed per game. Five Rams are projected to score more than 9 points, while three Dukes are forecasted to score more than a dozen points. The teams combine for 150 points, per 10,000 simulations, with the Over hitting well over 60% of the time.The model also says one side of the spread hits 70% of the time in an A-rated pick. You can only see that pick at SportsLine.So who wins Rhode Island vs. Duquesne, and which side of the spread hits 70% of the time in an A-rated pick? Visit SportsLine now to see which side of the spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duquesne vs. Rhode Island prediction, odds, time, spread: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/21728f0c-b40c-45ad-8e13-261cd495046b/thumbnail/1200x675/9f884c32a0698302ecc8fcd8b5df19e0/jonah-hinton-rhode-island-rams-imagn-images.jpg"
      ],
      "datePublished": "2026-02-01T13:30:40.000Z",
      "dateModified": "2026-02-01T13:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Raiders aim to hire Klint Kubiak: Seahawks OC expected to take Las Vegas job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/raiders-coach-klint-kubiak-seahawks-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/30/131eab85-198a-41d2-b91c-f1e8e4310018/thumbnail/1200x675/693bf7ed75f8608bfb18449f543f67ad/klint-kubiak-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-02-01T18:37:59.000Z",
    "description": "\n        The Las Vegas Raiders aim to hire Seattle Seahawks offensive coordinator Klint Kubiak as coach, NFL Media reports. The deal cannot become off",
    "body": "\n        The Las Vegas Raiders aim to hire Seattle Seahawks offensive coordinator Klint Kubiak as coach, NFL Media reports. The deal cannot become official until after Super Bowl LX, when Kubiak and the Seahawks take on the New England Patriots.Kubiak, 38, directs one of the NFL's top offenses with Sam Darnold at the helm. Prior to his year in Seattle, Kubiak was the New Orleans Saints' offensive coordinator in 2024, and before that, he worked as the San Francisco 49ers' pass game coordinator under Kyle Shanahan. He also worked under his own father, Gary Kubiak, as well as Kevin Stefanski with the Minnesota Vikings. Several aspects of his father's offense as well as the Shanahan and Stefanski offenses are seen in his offenses. Seattle ranked second this season in under-center rate and seventh in play-action dropback rate. The Seahawks led the NFL in yards per attempt on play action passes, too.Overall, the Seahawks' offense was eighth in points per game and yards per game, sixth in yards per play and second in net yards per pass attempt. Darnold and Jaxon Smith-Njigba (NFL-leading 1,793 receiving yards) both made the Pro Bowl.With Klint in line to become coach, he and Gary Kubiak will be the 10th father-son head-coaching duo in NFL history, joining ...Brian and Marty SchottenheimerKyle and Mike ShanahanBrian and Bill CallahanDave and Don ShulaRex and Buddy RyanWade and Bum PhillipsMike and Dick NolanJim Mora Jr. and Jim MoraJohn and Jim FasselSan Francisco 49ers offensive coordinator Klay Kubiak -- Klint's brother -- also received some head-coaching interest this hiring cycle.\nKlint Kubiak, who also interviewed with the Arizona Cardinals, will have his work cut out for him in Las Vegas. The Raiders come off a dismal 3-14 campaign under Pete Carroll, who got fired after one season. On the bright side, the Raiders own the No. 1 pick in the NFL Draft and are widely expected to select Heisman Trophy- and national championship-winning Indiana quarterback Fernando Mendoza. The Raiders have several holes to fill, though, and the offensive line will be the biggest question mark. Pro Football Focus graded Las Vegas as the 28th-best pass-blocking unit and the 30th-best run-blocking unit.There is some young talent, though, led by tight end Brock Bowers and running Ashton Jeanty. Bowers caught 112 passes for 1,194 yards as a rookie in 2024 before an injury-impacted 2024. Jeanty, meanwhile, finished with 1,321 yards from scrimmage and 10 touchdowns even with underwhelming surroundings. He recorded 188 yards from scrimmage and two touchdowns in Week 16 against the Houston Texans, one of the league's premier defenses.\nOn defense, one of Kubiak's first tasks will be dealing with the Maxx Crosby situation. Crosby was shelved for the season late due to a knee injury, a decision with which Crosby vehemently disagreed and left him pondering his future. Kubiak could aim to bring some Seattle defensive coaches with him to Las Vegas as he builds his staff.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Raiders aim to hire Klint Kubiak: Seahawks OC expected to take Las Vegas job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/30/131eab85-198a-41d2-b91c-f1e8e4310018/thumbnail/1200x675/693bf7ed75f8608bfb18449f543f67ad/klint-kubiak-seahawks.jpg"
      ],
      "datePublished": "2026-02-01T18:37:59.000Z",
      "dateModified": "2026-02-01T18:37:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas City hires former Maryland, Texas A&M coach Mark Turgeon - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/mark-turgeon-kansas-city-coach-maryland-texas-a-m/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/c05599df-3afd-40ae-be83-219dacd7f0a0/thumbnail/1200x675/2133c75898f83110a85706c7b55a9b24/usatsi-17184049-1.jpg",
    "tag": "Sports",
    "date": "2026-02-01T18:47:06.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first vacancy of the 2026 coaching carousel ha",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first vacancy of the 2026 coaching carousel has filled, and it's a big get for a small school: Former Maryland coach Mark Turgeon has agreed to a five-year contract to be the next man in charge at Kansas City. The Roos are playing out the string this season under departing coach Marvin Menzies; the school announced in January that it was moving on from Menzies' four-year run at season's end. Kansas City, which is 4-18 and ranks near the bottom of Division I this season, made the move official and announced Turgeon's hiring Sunday afternoon.Turgeon, who turns 61 on Feb. 5, has a 479-275 record across 23 and a half seasons. He began his career at Jacksonville State, then Turgeon upped his profile in a seven-year stint at Wichita State, including a 2006 Sweet 16 appearance. From 2007-11, Turgeon ran Texas A&M's program and took the Aggies to four straight NCAA Tournaments. That landed him his biggest job: Maryland. Turgeon had an NCAA Tournament-level team in six of his nine full seasons in College Park, though he only took the Terrapins to the Big Dance five times due to his 24-7 team not getting a chance to play in the canceled 2020 NCAA Tournament. He took over the Terps in 2011, lasting a little more than a decade. Turgeon resigned from his post at Maryland on Dec. 3, 2021, amid a rocky start and toxic situation with the fan base.\nA little more than four years removed from roaming the sidelines, Turgeon is hopping back into the profession. He does so in surprising fashion by heading to the Summit League level; it's conceivable Turgeon could have landed a bigger job in March, when dozens more will inevitably come available. Turgeon has ties to the area: He played at Kansas in the 1980s and grew up in Topeka, Kansas. A source said that Turgeon will bring his son, Will, on staff as well.Kansas City AD Brandon Martin made a significant push on Turgeon in the past two weeks (and a source said it's not the first time he tried to court a former power-conference coach). Martin ultimately swayed Turgeon, and in doing so, the Roos will boast one of the most accomplished coaches at the mid-major level.\nKansas City (formerly UMKC) has been in Division I since the late 1980s but never made the NCAA Tournament. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas City hires former Maryland, Texas A&M coach Mark Turgeon - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/c05599df-3afd-40ae-be83-219dacd7f0a0/thumbnail/1200x675/2133c75898f83110a85706c7b55a9b24/usatsi-17184049-1.jpg"
      ],
      "datePublished": "2026-02-01T18:47:06.000Z",
      "dateModified": "2026-02-01T18:47:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavericks' Jason Kidd gives expletive-laden reaction to Cooper Flagg question - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/mavericks-jason-kidd-cooper-flagg-question/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/7512238b-637c-4c92-811d-af05d86cb1ff/thumbnail/1200x675/139304819405515010dc98dee60e11d1/flagg.jpg",
    "tag": "Sports",
    "date": "2026-02-01T17:03:41.000Z",
    "description": "\n        The Dallas Mavericks may have lost their last four games, but it's clear they drafted a superstar in No. 1 overall pick Cooper Flagg.The Duke",
    "body": "\n        The Dallas Mavericks may have lost their last four games, but it's clear they drafted a superstar in No. 1 overall pick Cooper Flagg.The Duke product scored 34 points and grabbed 12 rebounds in the 111-107 loss to the Houston Rockets, and delivered a 49-point explosion on 20 of 29 shooting in the 123-121 loss Thursday to the Charlotte Hornets. It marked the most points scored by a teenager in NBA history, and Flagg's second 40-point game. LeBron James and Anthony Edwards are the only other teens to drop 40 points in multiple NBA games.It took Flagg some time to get rolling at the next level, and part of that was because he was called upon to be a primary ball-handler. Following Dallas' loss to Houston, a reporter asked coach Jason Kidd about the criticism he took for that decision, and he went off on an epic rant.  \"I don't give a f--- about the criticism. Criticism? That's your opinion. You guys write that bullshit,\" Kidd said. \"That's not -- I've done this. I've played this game. I've played it at a very high level. I know what the f---   I'm doing.\n\"But I don't give a f---   what you guys write. Because you guys have never played the game. And so I build players. So I know what the f---   I'm doing. So to take criticism, it only makes me better. Because if I wasn't doing it right you guys wouldn't be poking holes in what I've done.\"In Flagg's first seven games at point guard, he averaged 13.6 points per contest, 6.3 rebounds, 2.9 assists and 2.1 turnovers while shooting 38.8% from the field. If one zooms out and examines his rookie season at large, Flagg averages 19.8 points, 6.6 rebounds and 4.1 assists per game while shooting 48.4% from the field. \"I think it's a lot of pressure and a lot of responsibility that comes with being a point guard, and I don't know if I was ready for that or if I was ready to handle that right off the bat,\" Flagg said in November, per ESPN. \"I tried my best, and I mean, that's not to say I can't go back to it and can't work on it and get better, but I think it's just worked out where it's been better to have somebody else helping out, relieving pressure. ... It wasn't perfect, but I think I learned a lot through that.\"\nFlagg will look to stay hot and get the Mavs back into the win column on Tuesday against the Boston Celtics.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavericks' Jason Kidd gives expletive-laden reaction to Cooper Flagg question - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/7512238b-637c-4c92-811d-af05d86cb1ff/thumbnail/1200x675/139304819405515010dc98dee60e11d1/flagg.jpg"
      ],
      "datePublished": "2026-02-01T17:03:41.000Z",
      "dateModified": "2026-02-01T17:03:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Puerto Rico is considering withdrawing from 2026 World Baseball Classic - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/puerto-rico-2026-world-baseball-classic-insurance-issues/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/cb13deb1-51d4-451b-97ee-e739b4a9475a/thumbnail/1200x675/b912e0a5ad18e97f8f066ef9660faac5/puerto-rico-lindor-getty.png",
    "tag": "Sports",
    "date": "2026-02-01T16:54:36.000Z",
    "description": "\n        Puerto Rico is considering withdrawing from the upcoming 2026 World Baseball Classic because insurance issues have struck at the heart of the",
    "body": "\n        Puerto Rico is considering withdrawing from the upcoming 2026 World Baseball Classic because insurance issues have struck at the heart of their proposed roster for the tournament. In all, at least eight players eligible to play for Puerto Rico -- including, most notably, Mets All-Star shortstop Francisco Lindor -- have not been approved to be insured for the WBC, which begins in March. In Lindor's case, the insurance provider for the WBC declined to cover his salary obligations because he's undergone a pair of elbow surgeries over the past three offseasons, the Athletic reports. Lindor, however, is expected to have a normal spring training with the Mets in advance of the 2026 Major League Baseball regular season, as the elbow procedure he underwent in October is considered to be minor. In addition to Lindor, Astros infielder Carlos Correa, Blue Jays right-hander José Berríos and Twins catcher Victor Caratini are among those not expected to be able to participate for Puerto Rico. As for the possibility of Puerto Rico withdrawing from the tournament, team operations manager Joey Sola said such a drastic step is \"on the table\" depending upon whether the team is able to find suitable roster replacements. Puerto Rico had been considered one of the favorites for the tournament, recently boasting the fourth-best odds (+1100 at DraftKings) behind the United States, Japan and the Dominican Republic.Here's more from Sola, via the Athletic: \n\"In some ways, I think it's a little bit unfair,\" Sola said. \"Especially when you are three days from submitting your final roster. Who in the world would think Lindor wasn't on the (eligible) list? You wait until the last weekend to get an answer on Lindor? C'mon.\"It took us by surprise. I know the WBC isn't in those decisions. It's the insurance companies. But you have guys on other teams, they have an injury history and then I got guys on my roster who will be playing at the Double-A level with no (major-league) guarantee, no MLB invitation (to spring training), and they get flagged. And guys on other teams who can play in the WBC are earning $30 million per year. It's kind of tough to understand it.\"Further complicating the issue is that Puerto Rico is scheduled to host pool play in San Juan's Hiram Bithorn Stadium from March 6 to March 11. WBC team rosters are set to be finalized by Tuesday. Former All-Star catcher Yadier Molina is set to manage Puerto Rico in the WBC. Insurance policies, which are provided by a league-approved insurer, cover a player's salary for multiple seasons in the event of an injury during the WBC. The underwriting process for those policies has become more exacting following the injuries suffered by Jose Altuve and Edwin Díaz during the most recent WBC in 2023, according to the Athletic. As well, such WBC policies are no longer being extended to players who are age 37 or older, ESPN reports. \nPuerto Rico has long been a baseball power on the international scene and finished as runner-up in the WBC in both 2017 and 2013. As for the 2026 tournament, the United States is widely regarded as the favorites going in with a roster that includes the likes of Aaron Judge, Bobby Witt Jr., Tarik Skubal, Paul Skenes, and others. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Puerto Rico is considering withdrawing from 2026 World Baseball Classic - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/cb13deb1-51d4-451b-97ee-e739b4a9475a/thumbnail/1200x675/b912e0a5ad18e97f8f066ef9660faac5/puerto-rico-lindor-getty.png"
      ],
      "datePublished": "2026-02-01T16:54:36.000Z",
      "dateModified": "2026-02-01T16:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Lakers-Knicks, Bruins-Lightning, more on Sunday, Feb. 1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-lakers-vs-knicks-bruins-vs-lightning-in-nhl-stadium-series/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/62f433f5-9105-4aa5-adc5-e76be880ff06/thumbnail/1200x675/e6244b543214665ded4ed284f629a09e/lebron-james-los-angeles-lakers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-01T18:58:15.000Z",
    "description": "\nLeBron James has had a number of memorable performances at Madison Square Garden during his illustrious career. He's hoping to come up with another i",
    "body": "\nLeBron James has had a number of memorable performances at Madison Square Garden during his illustrious career. He's hoping to come up with another in what could be his final visit to the historic arena.The 41-year-old James, who hasn't committed to returning for a 24th NBA season or retiring at the end of the 2025-26 campaign, makes potentially his last appearance at \"The World's Most Famous Arena\" when the Los Angeles Lakers (29-18) visit the streaking New York Knicks (30-18) at 7 p.m. ET on Sunday.James has played 33 games at Madison Square Garden while with the Cleveland Cavaliers, Miami Heat and Lakers, winning 24 of them while recording several 50-point efforts and triple-doubles along the way. The four-time NBA MVP has averaged 28.2 points while shooting 49.5% from the field and 38.1% from 3-point range at \"The Mecca.\"The Lakers improved to 4-2 on their eight-game road trip with Friday's 142-111 rout of the Washington Wizards. They now face a Knicks squad that has followed a 2-9 stretch with a five-game winning streak that includes a 127-97 triumph over the Portland Trail Blazers on Friday.Nine other games are on Sunday's NBA schedule, including a matchup between the Brooklyn Nets (13-34) and host Detroit Pistons (35-12) at 6 p.m. ET at Little Caesars Arena. The Nets, who are wrapping up a five-game road trip, ended a seven-game slide with a 109-99 victory over the Utah Jazz last time out and now hope to halt their four-game skid against the Eastern Conference-leading Pistons, who have won 10 of their last 13 overall and recorded a 125-107 win at Brooklyn earlier this season.The NHL's three-game slate features the latest installment in the NHL Stadium Series, which has the Boston Bruins (32-20-3) taking on the Eastern Conference-best Tampa Bay Lightning at Raymond James Stadium in Tampa at 6:30 p.m. ET. The Lightning, who won their only previous appearance in an outdoor game, have gone 16-1-1 over their last 18 contests while the Bruins are 4-1-0 all-time outdoors and 12-2-1 in their past 15 games this season.Sunday's college basketball schedule concludes at 8 p.m. ET with a Big Ten Conference clash between Iowa (15-5) and Oregon (8-13) at Matthew Knight Arena in Eugene. The Hawkeyes enter with a three-game winning streak while the Ducks have lost seven consecutive contests.The Knicks are 4.5-point favorites against the Lakers in the latest consensus NBA odds, while the Pistons are 12.5-point favorites versus the Nets. The Lightning are -217 on the money line against the Bruins and Iowa is a 10.5-point favorite versus Oregon.Below is a snapshot of what to watch and bet for Sunday, Feb. 1. All times EasternNBA best bets, where to watchNets at PistonsTime: 6 p.m. | Location: Detroit | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 215.5 (-111) | Expert: Duncan Robinson Over 2.5 3-pointers (+116, PropBetGuy)The Nets are last in the NBA in scoring with an average of just 107.7 points but have been much better defensively, ranking 12th with 114.4 points allowed per game. However, they recently had a stretch during which they gave up 120 points in five straight games, and the Pistons are coming off a 131-point performance against the Golden State Warriors, who are 10th in points allowed (114.0). The SportsLine Projection Model doesn't see Brooklyn keeping Detroit at bay as the Over hits in almost 57% of its simulations. Pistons forward Duncan Robinson made five 3-pointers against the Warriors and has hit at least three in 17 of his 23 home games this season, leading SportsLine props expert PropBetGuy (+752 on his last 120 NBA player prop picks) to believe he'll nail at least three against the Nets.Lakers at KnicksTime: 7 p.m. | Location: New York | TV: NBC | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Knicks -190 | Expert: Karl-Anthony Towns Over 18.5 points (-118, Alex Selesnick)The Knicks are one of the hottest teams in the league right now and have won their last three games with ease, defeating those opponents by 16 or more points. They are second in the NBA with 19 victories at home, where they have won their last three outings by an average of 33.3 points. The SportsLine Projection Model thinks they'll have a tougher time against the Lakers but ultimately will emerge victorious as its simulations have them winning 66% of the time. SportsLine props expert Alex Selesnick feels that New York's Karl-Anthony Towns will be productive offensively against a Los Angeles squad that has suspect interior defense and has been vulnerable against opposing centers.NHL best bets, where to watchBruins at LightningTime: 6:30 p.m. | Location: Tampa, Fla. | TV: ESPN | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Bruins +1.5 (-141) | Expert: Lightning -1 (-133, Matt Severance)The Bruins have won four of their last five contests, with the only defeat in that stretch coming in overtime. They've lost by multiple goals just twice in their last 16 outings (12-2-2). Meanwhile, the Lightning have won only two of their last four games by two or more tallies, and one of those was a 2-0 triumph over the Utah Mammoth in which they converted a power-play attempt in the final minute of the third period. Boston has won each of its last three outdoor contests, and the SportsLine Projection Model believes the Bruins with at least keep this one close as they cover the spread in 65% of its simulations. SportsLine expert Matt Severance (9-1, +662 on his last 10 spread picks involving Boston) disagrees since the Bruins will be without two of their top scorers in Pavel Zacha and Elias Lindholm (37 points apiece) due to upper-body injuries while defenseman Victor Hedman (elbow) is expected to return for the Lightning.CBB best bets, where to watchIowa at OregonTime: 8 p.m. | Location: Eugene, Ore. | TV: FS1 | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 133.5 (-108) | Expert: Under 133.5 (-105, Bruce Marshall)The Haweyes are first in the Big Ten and fourth in the nation with an average of just 62.9 points allowed, while the Ducks are 16th in the 18-team conference in scoring at 72.3 points per game. However, six of Iowa's last eight contests have gone Over the projected total for Sunday's showdown, and 15 of Oregon's 21 games this season have done the same. The SportsLine Projection Model thinks the trends will continue as its simulations have the Over hitting 68% of the time. SportsLine expert Bruce Marshall feels differently, as he likes the Under since the Ducks haven't exceeded 57 points in their last three outings and struggle against teams that like to slow the tempo.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Lakers-Knicks, Bruins-Lightning, more on Sunday, Feb. 1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/62f433f5-9105-4aa5-adc5-e76be880ff06/thumbnail/1200x675/e6244b543214665ded4ed284f629a09e/lebron-james-los-angeles-lakers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-01T18:58:15.000Z",
      "dateModified": "2026-02-01T18:58:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 fight fallout: Next options for Alexander Volkanovski, Benoit Saint Denis and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-fight-fights-to-make-alexander-volkanovski-benoit-saint-denis-mauricio-ruffy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/7719aa19-2dd6-4ee7-8ec8-b06de387a735/thumbnail/1200x675/0e961ef10d470f897ca866e957d2d883/alexander-volkanovski-325-belt-walk.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:30:37.000Z",
    "description": "\n        UFC 325 has come and gone. With it, new opportunities have arrived for its winners and losers. UFC featherweight champion Alexander Volkanovs",
    "body": "\n        UFC 325 has come and gone. With it, new opportunities have arrived for its winners and losers. UFC featherweight champion Alexander Volkanovski built his case as the all-time best featherweight. Beating Lopes consecutively wouldn't do much on its own, but the fact that he won by a bigger margin the second time helps. To grow that legend further, it's time to fight top featherweight contenders champing at the bit.Saturday's event also injected more life into a stacked, action-packed lightweight division. Benoit Saint Denis and Mauricio Ruffy scored major finishes as they start prowling towards the very best.In the aftermath of UFC 325, take a look at the best fights to make across the featherweight and lightweight divisions.\nFeatherweightAlexander Volkanovski vs. Movsar Evloev: Volkanovski floated the rumor of an impending title eliminator between Evloev and Murphy. Doing that leaves Volkanovski with no credible contender until the end of the year. Both men deserve a title shot, but Evloev moreso. Unfortunately, Evloev and Murphy aren't colorful characters, but meritocracy should still matter. UFC should book Volkanovski vs. Evloev next. In the meantime, Murphy can face Jean Silva in a title eliminator. It's a fight with high knockout potential that provides visibility and prestige to the winner.Diego Lopes vs. Steve Garcia: Lopes shouldn't have fought Volkanovski twice in 10 months, but he's becoming a better fighter for it. He's gone 50 minutes with arguably the best featherweight ever without taking significant damage. That will serve him. While Volkanovski is champion, Lopes shouldn't get tangled up with top featherweights. He'd only risk log-jamming the division by beating guys who could progress towards the title. Garcia (No. 9) is due for a big fight. The rising contender has finished 15 opponents, including six of his last seven in the UFC. Garcia doesn't have that standout win on his resume, something Lopes provides and opportunity for.LightweightBenoit Saint Denis vs. Max Holloway or Charles Oliveira: To effectively matchmake the lightweight elite, two questions must be answered. First, when will lightweight champion Ilia Topuria return? Second, how much more will the UFC brass punish Arman Tsarukyan? Saint Denis called out five fighters on Saturday: the two aforementioned, Max Holloway, Charles Oliveira and Justin Gaethje. Saint Denis and Tsarukyan shouldn't fight anytime soon. It will set back a rising contender in a division that's on the precipice of a generational turnover. A win over Hooker doesn't equate to an undisputed or interim title shot either. That leaves the winner of the BMF title fight between Holloway and Oliveira, which headlines UFC 326. Saint Denis is obviously cut from that BMF cloth. Having him face the winner makes sense. It's Topuria's absence that gives me pause. I wonder if there's a world where the BMF winner gets booked against interim champion Justin Gaethje. If that happens, Saint Denis must settle for the loser of the BMF title fight instead.\nDan Hooker vs. Paddy Pimblett: Hooker and Pimblett exchanged nasty barbs over social media and in separate interviews. We won't rehash the subject matter; it's in poor taste. But the energy between them is something you can bottle into a thrilling fight. The media cycle and the fight have explosive potential. It's also an important crossroads fight for them. Pimblett must prove he can make the adjustments demanded of an elite lightweight. Hooker can show that there's life for him as a top fighter.Mauricio Ruffy vs. Mateusz Gamrot: Ruffy will find himself in the lightweight top 10 after a beautiful second-round KO against Fiziev. The composure he showed after training with featherweight champion Volkanovski will do wonders for his highlight reel finishing ability. The top of the division is quite crowded, and I wouldn't want to see his potential stifled by someone like Tsarukyan. Gamrot is a credible lightweight who's a half-step behind the very best. It risks seeing Ruffy get smothered by a superior grappler, but it's the kind of test Ruffy must pass to make a real run at the title.Rafael Fiziev vs. Manuel Torres: What's not to love about this fight? Both men are terrific finishers. For Fiziev, it's similar to his fight with Igancio Bahamondes. It's a chance to revitalize himself against a surging contender. For Torres, who has consecutive TKO wins, it's the right test at the right time. He fell short to Bahamondes in 2024, so beating Fiziev puts him on the right track in a deep division. \nQuillan Salkilld vs. Jalin Turner: Salkilld looked phenomenal, tearing through short-notice replacement Jamie Mullarkey. The rising prospect is at a crucial crossroads. Salkilld, 26, has his best years ahead of him. Giving him time to mature is in his best interest. However, a growing profile and ambition will likely expedite the process. Salkilld called for a top 15 lightweight. That's ambitious after beating an inconsistent veteran on short notice, but we can meet him halfway. Former ranked lightweight Turner is coming off a first-round knockout against Edson Barboza. It was a reformation for Turner, who briefly retired after a 1-4 skid. It's a solid fight between comparable names who are on the right track to a ranking.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 fight fallout: Next options for Alexander Volkanovski, Benoit Saint Denis and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/7719aa19-2dd6-4ee7-8ec8-b06de387a735/thumbnail/1200x675/0e961ef10d470f897ca866e957d2d883/alexander-volkanovski-325-belt-walk.jpg"
      ],
      "datePublished": "2026-02-01T14:30:37.000Z",
      "dateModified": "2026-02-01T14:30:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Jefferson comments on how Sam Darnold departure affected Vikings production - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/justin-jefferson-sam-darnold-vikings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/445740bc-5323-412a-bf82-bbe43104a8ff/thumbnail/1200x675/cce02eace2ac73adbb947944411d64d8/justin-jefferson-sam-darnold.jpg",
    "tag": "Sports",
    "date": "2026-02-01T16:12:05.000Z",
    "description": "\n        Justin Jefferson did not hesitate when asked the quiet part out loud when it relates to the Minnesota Vikings and their quarterbacks. Could t",
    "body": "\n        Justin Jefferson did not hesitate when asked the quiet part out loud when it relates to the Minnesota Vikings and their quarterbacks. Could this have been the Vikings in the Super Bowl if Sam Darnold stayed?\"Yeah, for sure. Definitely,\" Jefferson said in a recent interview with USA Today.It was an honest answer, and one that now lands differently in Minnesota, where the Vikings are coming off a 9-8 season, missed the playoffs and the stunning firing of general manager Kwesi Adofo-Mensah, just months after a contract extension.Darnold, meanwhile, is preparing to play in Super Bowl LX in his first season with the Seattle Seahawks.\nJefferson's comments were not necessarily a shot at Minnesota's current quarterback room. Instead, they reflected the reality of a season that unraveled after the Vikings chose not to re-sign the quarterback who had helped guide them to a 14-3 record in 2024.Darnold arrived in Minnesota as a temporary solution while the organization waited on first-round pick J.J. McCarthy's recovery from a knee injury. When McCarthy went down for the year, Darnold delivered the best season of his career, throwing for more than 4,300 yards and 35 touchdowns and leading one of the most productive offenses in the league.The long-term plan, however, never changed. Minnesota turned the offense over to McCarthy in 2025, and the results were uneven. McCarthy's injuries and inconsistency pressed veteran Carson Wentz and rookie Max Brosmer into action, and the Vikings' offense fell from ninth in scoring to 26th. Minnesota ended the regular season on a five-game win streak, but narrowly missed out on the playoffs.\nSeattle took the opposite path. The Seahawks signed Darnold to a three-year deal, watched him earn another Pro Bowl nod and rode a balanced roster to a franchise-record 14 wins and a Super Bowl berth.For Jefferson, the difference was familiarity and stability -- something the Vikings rarely had under center in 2025.\"Everyone knows the difficulty of the quarterback position this year, of how we were dealt it,\" Jefferson said. \"But having a quarterback that already had a season under his belt with us, knew the plays, knew the playbook, knew the players -- throwing to me, Jordan Addison, T.J. Hockenson, all these guys -- I definitely feel like we would have done better. But it is what it is. It's on to new and better things, but I'm definitely happy and proud for him that he was able to reach it this year.\"\nWatching Darnold reach the Super Bowl has stirred conflicting emotions for Jefferson, who admitted it hasn't been easy seeing another team enjoy the success Minnesota hoped to chase.\"It's definitely tough. It's tough to watch,\" Jefferson said. \"I love that he's in the Super Bowl. I'm happy for him, I want nothing but the best for him, especially the way his journey was at first, people doubting him and people not giving him the respect. Now they're giving him the respect. Now they're seeing that he's a top-tier quarterback in this league. Of course, selfishly I wish he had done that for us last year, but to see him blossom and bounce back right after last year and make it this year, I'm happy for him and I hope he wins.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Jefferson comments on how Sam Darnold departure affected Vikings production - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/445740bc-5323-412a-bf82-bbe43104a8ff/thumbnail/1200x675/cce02eace2ac73adbb947944411d64d8/justin-jefferson-sam-darnold.jpg"
      ],
      "datePublished": "2026-02-01T16:12:05.000Z",
      "dateModified": "2026-02-01T16:12:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 325 takeaways: Alexander Volkanovski aging gracefully; lightweight heating up - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-325-takeaways-alexander-volkanovski-diego-lopes-benoit-saint-denis/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/e77100b3-2013-47a3-9f76-67693155cfc3/thumbnail/1200x675/04ffad72c408c5fdb94cabba619b7d63/alexander-volkanovski-dc-325.jpg",
    "tag": "Sports",
    "date": "2026-02-01T06:36:01.000Z",
    "description": "\n        The second numbered event in as many weeks for the UFC took place in Australia on Saturday as featherweight champion Alexander Volkanovski fo",
    "body": "\n        The second numbered event in as many weeks for the UFC took place in Australia on Saturday as featherweight champion Alexander Volkanovski fought in front of his home fans in Sydney for the first time since 2017. Volkanovski scored a second straight win over Diego Lopes in the main event, recording a clear unanimous decision to equal Jose Aldo's UFC record of eight wins in title bouts at 145 pounds. In the co-main event, Benoit Saint-Denis put a hurting on veteran Dan Hooker in a second-round stoppage before calling out the elite of the division. Here's a look at the biggest takeaways from an exciting night of action inside Qudos Bank Arena at UFC 325. 1. Death, taxes and Alexander Volkanovski on top of the featherweight divisionEven though the 37-year-old Volkanovski wouldn't cop to it himself during fight week out of respect for Aldo, whom he defeated in 2019, we can all say it for him: \"Alexander the Great\" is the best featherweight in MMA history. Volkanovski is 18-1 at 145 pounds throughout his 14-year pro career (including a mark of 13-1 in the UFC), with his only blemish being a second-round knockout loss to current lightweight champion Ilia Topuria in 2024. And not only did Volkanovski regain the vacant UFC title following the setback, he defended once more in his rematch with Lopes on Saturday that somehow looked even easier than the five-round decision he claimed nine months ago. Volkanovski took a knee on a flash knockdown in Round 3 but outside of that, it was lights out as the Australian met Lopes' pressure with clean boxing, a stiff jab and constant footwork patterns that never allowed his Brazilian foe to get into a rhythm. The fact that Volkanovski still appears to be at the top of his game this far into his 30s in a smaller weight division in which speed is prioritized is remarkable. A true living legend of the Octagon, who owns three career wins over Max Holloway, it wouldn't be out of bounds to suggest that Volkanovski is a top 15 fighter in the history of the sport. And even though some difficult style matchups remain should he choose to stay active and continue his title, it would be hard to imagine Volkanovski not being favored from a betting standpoint against the likes of Movsar Evloev, Lerone Murphy, Jean Silva or Aljamain Sterling.\n2. The lightweight division is reshuffling the deck at a rapid rateEven with 37-year-old Justin Gaethje turning back time last Saturday at UFC 324 to claim the interim title for the second time in an exciting win over Paddy Pimblett, the lightweight division has seen many of its all-action heroes retire or enter their twilight in recent years, from Dustin Poirier and Michael Chandler to Charles Oliveira and even Conor McGregor. But a new breed of 155-pound fighters are on the rise, as evidenced by Ilia Topuria's championship win last year and the rise of top contender Arman Tsarukyan. Three more lightweights scored breakthrough wins on Saturday's main card to move closer to title contention; Benoit Saint Denis, Mauricio Ruffy and newcomer Quillan Sallkilld. Saint Denis improved to 4-0 with four stoppage wins since he suffered a pair of devastating losses in 2024 and suddenly looks like a legit title contender following a violent second-round TKO win over a brave Dan Hooker. BSD took some damage at times but was able to take the fight to the ground and suffocate Hooker when it mattered most. Ruffy, meanwhile, bounced back from a humbling submission loss to Saint Denis last September by switching camps and continents to deliver an impressive second-round stoppage of Rafael Fiziev to likely catapult himself back into the top 10. But it was Sallkilld who very much looked like the long-term future of the division when the 26-year-old improved to 4-0 in the UFC since making his debut one year ago by submitting Jamie Mullarkey with relative ease.\n3. There are no excuses left for Tai TuivasaEntering the fight riding a five-fight losing streak (including four by stoppage) and an 18-month layoff to heal himself mentally and physically, Tuivasa's Sydney homecoming turned out to be an absolute disaster. Even though he nearly rallied for a dramatic stoppage win in Round 3 against an opponent, Tallison Teixeira, who had never fought past the first round in 12 career pro fights, Tuivasa's lack of cardio after so much time away was embarrassing. Claiming he undertook the layoff to heal himself both mentally and physically, Tuivasa somehow looked in worse physical shape than he did amid the losing skid and clearly hadn't improved on his lack of a ground game as the 6-foot-8 Teixeira, who isn't known as a ground specialist, largely relied on takedowns and top pressure to win the first two rounds. The only fighters in UFC history to stay employed following losing skids of at least six consecutive fights are BJ Penn, Tony Ferguson and Sam Alvey. Given that Tuivasa is a fan favorite who competes in an exciting style and is still just 32 in a division that ages slower than the rest, he just might get another opportunity inside the Octagon. The real question is, however, how much pride does Tuivasa have left to try and save his career? It's now or never. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 325 takeaways: Alexander Volkanovski aging gracefully; lightweight heating up - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/e77100b3-2013-47a3-9f76-67693155cfc3/thumbnail/1200x675/04ffad72c408c5fdb94cabba619b7d63/alexander-volkanovski-dc-325.jpg"
      ],
      "datePublished": "2026-02-01T06:36:01.000Z",
      "dateModified": "2026-02-01T06:36:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Super Bowl Opening Night 2026: Time, channel, streaming for Seahawks and Patriots - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-date-super-bowl-2026-opening-night/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/6b6b6af5-a659-4228-830e-afae88a5ab7a/thumbnail/1200x675/d9a4ede1d8be27e3f1247bbd4871d58f/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-02-01T14:00:50.000Z",
    "description": "\n    \n    \n                    \n                Photo by Aaron M. Sprecher/Getty Images\n            \n            \n    \n        And here we go! At long",
    "body": "\n    \n    \n                    \n                Photo by Aaron M. Sprecher/Getty Images\n            \n            \n    \n        And here we go! At long last, Super Bowl week has arrived, and it's pedal to the metal until we get to kickoff of Super Bowl LX between the Seattle Seahawks and New England Patriots. Before we get to that duel for a Lombardi Trophy at Levi's Stadium on Feb. 8, however, there's a plethora of events that will unfold in the Bay Area, beginning with Super Bowl Opening Night. This is one of the more lively events of Super Bowl week, as each team will take the stage to be introduced. Then, a large contingent of players and coaches will be made available at individual podiums. There, the questions will range from the nitty-gritty of the game itself to the wild and obscure pop-culture variety, making it truly a one-of-a-kind evening. Below, you can see how to watch the spectacle unfold. Super Bowl Opening Night where to watchDate: Monday, Feb. 2 | Time: 8 p.m. ETLocation: San Jose Convention Center (San Jose)TV: NFL Network | Stream: fubo (try for free)The AFC Champion Patriots will be made available first, followed by the NFC Champion Seahawks. Here's a quick breakdown of the timeline as highlighted by the NFL (all times ET):\n7 p.m.: Doors open to San Jose Convention Center7:30 p.m. to 9:30 p.m.: Session 1 for New England Patriots8 p.m.: New England Patriots introduction and media availability9 p.m. to 11 p.m.: Session 2 for Seattle Seahawks9:15 p.m.: Joint team appearance10 p.m.: Seattle Seahawks introduction and media availability11 p.m.: Event concludesFans can expect to see the likes of Drake Maye, Sam Darnold, Jaxon Smith-Njigba, Stefon Diggs, Mike Vrabel, and Mike Macdonald among the notable figures at various podiums. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Super Bowl Opening Night 2026: Time, channel, streaming for Seahawks and Patriots - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/6b6b6af5-a659-4228-830e-afae88a5ab7a/thumbnail/1200x675/d9a4ede1d8be27e3f1247bbd4871d58f/template-pic.jpg"
      ],
      "datePublished": "2026-02-01T14:00:50.000Z",
      "dateModified": "2026-02-01T14:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zuffa Boxing 02 -- Jose Valenzuela vs. Diego Torres: Fight preview, predictions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/zuffa-boxing-02-fight-card-odds-preview-where-to-watch-start-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/01/3dee6637-0088-432d-a3f2-aea01b2ade0c/thumbnail/1200x675/0da3fe86aad130916324ffd5af5a0b49/valenzuela-torres-zuffa.jpg",
    "tag": "Sports",
    "date": "2026-02-01T15:00:50.000Z",
    "description": "\n        The second edition of Zuffa Boxing takes place Sunday from the Meta APEX in Las Vegas. In the main event, former junior welterweight champion",
    "body": "\n        The second edition of Zuffa Boxing takes place Sunday from the Meta APEX in Las Vegas. In the main event, former junior welterweight champion Jose Valenzuela will take on Diego Torres.Valenzuela started his career 12-0 before running into Edwin De Los Santos in 2022. That night, Valenzuela suffered a third-round knockout for the first loss of his career. That loss was followed by a widely disputed decision loss to Chris Colbert. Valenzuela would get revenge against Colbert in an immediate rematch, scoring a sixth-round knockout with a devastating right hand.Sign up for Paramount+ and watch Zuffa Boxing 02 live on Sunday night for no additional fee. Plus, every UFC numbered event and UFC Fight Night is included with the price of your subscription! Plans start as low as $8.99/month or $89.99/year!The win over Colbert was enough to set Valenzuela up for the biggest fight of his career, a shot at Isaac \"Pitbull\" Cruz for the WBA junior welterweight title. Valenzuela made good on the opportunity with a measured performance to edge out a split decision in a major upset.\nValenzuela was unable to repeat that solid performance in his first title defense -- and most recent fight -- when he was nearly shut out by Gary Antuanne Russell to lose the belt.Valenzuela will now look to get back in the win column when he faces Torres, who has fought all but one of his career bouts in his native Mexico.\nThat lone fight in the United States was also Torres' lone professional loss, a 2023 TKO defeat against Raymond Muratalla. That loss has aged well as Muratalla has gone on to become the current IBF lightweight champion.\nTorres has rebounded from the Muratalla loss with four consecutive wins, including two by stoppage.The other two fights on the Zuffa Boxing 02 main card are very compelling with names that are familiar to boxing fans.At middleweight, Serhii Bohachuk will face Radzhab Butaev in a fight that could steal the show. Bohachuk nearly upended the career of rising star Vergil Ortiz in 2024, scoring a pair of knockdowns en route to a narrow majority decision loss. Bohachuk is coming off a loss to Brandon Adams in his most recent fight but remains a dangerous man on any given night. In Butaev, faces a similar slugger with 12 knockouts in 16 career victories.\nAlso, former light heavyweight world champion Oleksandr Gvozdyk will face Radivoje Kalajdzic in another fight with explosive potential.Let's take a look at the odds for each bout as well as how you can catch the action on Sunday before getting to a prediction and expert pick on the main event below.Zuffa Boxing 02 fight card, oddsOdds via DraftKings SportsbookJose Valenzuela -800 vs. Diego Torres +500, lightweightsSerhii Bohachuk -175 vs. Radzhab Butaev +140, middleweightsOleksandr Gvozdyk -550 vs. Radivoje Kalajdzic +380, light heavyweightsWhere to watch Zuffa Boxing 02Date: Feb. 1 | Location: Meta APEX -- Las VegasPrelims begin at 6 p.m. ETMain card begins at 9 p.m. ETWatch live: Paramount+ (subscribe now for just $8.99 per month)\nPredictionAs mentioned, Torres' lone career loss came against the best fighter he has fought and in the United States. The fight with Valenzuela is very similar for Torres. Like Muratalla, Valenzuela is considerably better than the rest of the fighters on Torres' resume. And Torres is having to come to America again to take on another big challenge. This should be a chance for Valenzuela to get off to a solid start in his Zuffa Boxing debut. Pick: Jose Valenzuela via TKO5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zuffa Boxing 02 -- Jose Valenzuela vs. Diego Torres: Fight preview, predictions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/01/3dee6637-0088-432d-a3f2-aea01b2ade0c/thumbnail/1200x675/0da3fe86aad130916324ffd5af5a0b49/valenzuela-torres-zuffa.jpg"
      ],
      "datePublished": "2026-02-01T15:00:50.000Z",
      "dateModified": "2026-02-01T15:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl Spotlight: Why Seahawks WR Jaxon Smith-Njigba is a nightmare for defenses - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/inside-the-3-traits-that-make-the-seattle-seahawks-jaxon-smith-njigba-a-nightmare-for-defenses/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/31/7be4a70d-5c25-41d0-a84d-60cb7133d035/thumbnail/1200x675/21fbcc9b31c706ba65bc58e0c236a720/jsn-1.png",
    "tag": "Sports",
    "date": "2026-02-01T14:34:28.000Z",
    "description": "\n        Ohio State and Penn State were tied, 17-17, early in the third quarter of the 2021 season when the play call came through: \"Henry.\" Buckeye s",
    "body": "\n        Ohio State and Penn State were tied, 17-17, early in the third quarter of the 2021 season when the play call came through: \"Henry.\" Buckeye sophomore wide receiver Jaxon Smith-Njigba figured the ball wouldn't come his way. It never did in practice.But Smith-Njigba isn't one to waste an opportunity to make a defensive back look silly.He lined up tight to the left tackle, squeezed into the formation with Penn State senior cornerback Tariq Castro-Fields pressed up against him. Smith-Njigba got free immediately, a little shimmy to his left before darting right. At that point, Smith-Njigba had the defender on his hip – right where he wanted him. Like SGA creating space for a step-back jumper, JSN planted his foot, stopped and left Castro-Fields two yards behind him to finish the route.Then, suddenly, quarterback C.J. Stroud put the ball in his chest. Castro-Fields probably tackles most wide receivers at that point. Not Smith-Njigba. He sensed Castro-Fields driving from behind and turned the opposite way to break for daylight.\nA six-yard hitch turned into a 58-yard gain.\"That's my favorite part of the route, getting open and using all the tools,\" Smith-Njigba told me in August of 2022.Smith-Njigba did that repeatedly in high school, becoming a five-star recruit, and in college at Ohio State, becoming a first-round pick. He's doing the same in the NFL, where he will be on the world's biggest stage Sunday in Super Bowl LX against the New England Patriots as arguably the best receiver in the entire league. The 23-year-old led the NFL with 1,793 receiving yards this season on the way to first-team All-Pro honors. \nHis frame doesn't suggest that sort of production should be possible. But dominance comes in many forms.Is Jaxon Smith-Njigba the best WR in the NFL? He made an argument in 2025.  \n                                                                    Getty Images\n                                                            Among the archetypes of the all-timers, there are physically imposing players like the 'Megatron' Calvin Johnson, someone who overpowers the game. Then are burners like the 'Cheetah' Tyreek Hill, who tilts the field with his mere presence. At 6-foot, 197 pounds, Smith-Njigba will never be confused for either game breaker. Rodney Webb, who coached Smith-Njigba at Rockwall High School in the suburbs of Dallas, used to make fun of the way Jaxon walked. It's an almost off-balance gait as if \"he's got blisters on his feet,\" Webb says. \n\"When Jaxon walks into the door, (he) is a fairly unremarkable kid,\" Webb said.He's not tall. He's not overly strong. He's not extremely fast (4.53 40-yard dash at Ohio State's Pro Day). So how do you explain what makes Smith-Njigba great?One Ohio State coach put it to me this way: \"Words don't do it justice; you have to see the tape.\"A few years ago, we spoke to several people who've had the full Smith-Njigba experience to get a sense of exactly how he embarrasses defensive backs week after week.\n\"He just has a knack for the game,\" Smith-Njigba's high school offensive coordinator Trey Brooks said. \"I've never seen anything like it.\"Early in Smith-Njigba's junior year, Rockwall High School traveled two hours east on I-20 to Longview, Texas. The Lobos in 2018 were atop the state's high school food chain. An East Texas power led by quarterback Haynes King, who was 10th in 2025 Heisman Trophy voting, Longview finished the season at 16-0 in Texas' highest classification.Rockwall lost by a possession. But Smith-Njigba never lost a route that day, finishing with 13 catches for 289 yards and two touchdowns. It's a performance that flummoxed even his dad.\n\"I was like, 'Oh my god. Who are you? What is this?'\" Maada Smith-Njigba said. Maada started training his son at age two. A high school teacher and former college football player, he'd take Jaxon and his older brother, Canaan, and run them through drills after work. A young divorcee, Maada didn't have much money at the time, so the training sessions served a double purpose: Healthy entertainment and a cheap way to exhaust his boys so they'd go home, eat dinner and fall asleep.That training seemed to work. By age three, Jaxon played up on Canaan's YMCA basketball team. Jaxon could hardly lift the ball above his head, but he'd always harass the opposing team's best player on defense. So Maada had a feeling Jaxon would be an athlete.But 289 yards against Longview? That felt different.It would become the norm. Jaxon finished his junior season with 1,828 yards and 20 touchdowns. He bested that as a senior with 2,094 yards and 35 scores, the third most in a single season in Texas high school football history. His 5,414 career receiving yards are also the third-most ever in Texas history.\nAll of that sounds obvious now. Yeah, the NFL's best wideout dominated his high school competition. But when Smith-Njigba went crazy against Longview, he was rated as a 3-star recruit. And the powers in and around Texas weren't paying him much more attention.The spring following Jaxon's junior year, then-Texas wide receivers coach Drew Mehringer popped into Webb's office on a recruiting visit. When the subject of JSN popped up, Mehringer preemptively said: \"I'm just here to check a box.\"Webb couldn't believe it. But schools always seemed caught up in the measurables.\nOhio State wide receivers coach Brian Hartline saw things differently. The Buckeyes made their eval and observed the way Smith-Njigba gained separation on his routes, the way he tracked the football and his production. Hartline offered two weeks before Smith-Njigba went off against Longview.Oklahoma and Texas A&M didn't offer until months later. It took Texas almost a year. Smith-Njigba finished the cycle as a five-star recruit and the No. 2 receiver prospect in the country.\"I really hate that Texas and Oklahoma and Arkansas really just ignored him,\" Maada said. \"That's why I give so much credit to (Ohio State). They were looking for real football players. Now I have to buy flights to Columbus every weekend. I could've been driving down to Austin the same day.\"\nWhat did Ohio State see? Three intangible traits make Smith-Njigba different from everyone else.SeparationThe couch cushions were lined up in Jami Smith's living room like out-of-bounds paint on a field. Canaan called out the routes and Jaxon ran them. A three-year-old Jaxon would make the catch, but Canaan made him run the play again and again. Jaxon couldn't just catch the ball. He needed to drag his toes in bounds for the play to count. Canaan used to bully Jaxon until he made the play. Jaxon would cry out of frustration at times. But he never stopped. The brothers were relentless.The training with dad and the imagination at mom's house helped birth an increasingly coordinated child. He was a toddler who had to be strapped to his stroller because he scored so many goals that it ruined his team's soccer games.\n\"He has a knack for anything that involves controlling movement,\" Jaxon's mother, Jami Smith, said. \"It was never awkward.\"Rockwall quarterback Jacob Clark used to marvel at Smith-Njigba's coordination. Clark, who played QB at Missouri State, was a year older than Jaxon. Before moving to Rockwall ahead of his junior season, Clark saw a freshman-age JSN return a punt and turned to his friend and said, \"Who the heck is this?\"Clark never played basketball with Jaxon, who skipped his sophomore year of varsity hoops, but he thinks Jaxon shares a lot of similarities to the way a great guard comes off a screen. Smith-Njigba is always setting up a defender to create leverage. He wants to make a defender think he's doing one thing before beating him to the spot he wants to go. Great pass rushers can bend off the edge. Jaxon, with his ability to cut in an instant and maneuver his body at full speed, does much of the same when running his routes.\"He makes cuts and contorts his body better than anyone I've ever seen,\" Clark said. \"He does that better than 95% of the NFL right now.\"Whether in a route or with the ball, separation has always been a defining strength of JSN's game.  \n                                                                    Getty Images\n                                                            That's only half of Smith-Njigba separation superpower. The other portion of it happens well before the ball is snapped. He is a maestro of choice routes. Rockwall ran them almost exclusively when he was in high school. Ohio State called many in Ryan Day's system.The premise is simple: Receivers have route options pre-snap depending on the way a defense is aligned.For example, if a receiver at Rockwall could beat the safety over the top, they were asked to stick their foot in the ground and run a go. If the receiver couldn't beat the safety, they were told to stick their other foot in the ground and cross the face of the cornerback for an underneath route.Two options and that's it, right? Not for JSN. More than once in his career, Smith-Njigba would upset the defensive back by starting the route like he'd run a go, before sticking it again to cross the defender's face for an easy completion. Rockwall didn't even bother teaching that to 99% of its players, because most of them can't do it.\"The types of questions he'd ask during video weren't normal,\" Brooks said. \"Most kids don't see things the way he sees it. … Sometimes he'd suggest things I couldn't even think about.\"Before every snap Smith-Njigba goes through a checklist of sorts. He attempts to figure out if a team is in man or zone. Man is easy. Usually, the defender is right in his face. He will likely be one on one. Zone is a bit more complicated. He is trying to read the defense to see where the holes are likely to be. Then he looks at the defender's leverage to fully form his plan of attack.\"I'm just trying to get all the details,\" he said.That's a scary thing for defenders. Smith-Njigba was targeted 112 times as a sophomore at Ohio State and caught 95 passes. That's an 85% success rate, the best in the FBS among any player targeted at least 65 times. Of the 52 FBS players targeted 100 times, Jaxon was the only player with a reception percentage above 80. In fact, his reception percentage is higher than any receiver who's been targeted 100 times in the history of PFF College, which dates to 2014.\"Jaxon is at his best when he has the ability to create,\" Webb said. \"When you give him that -- it's over. You can't cover him.\"\"You just know he's going to get open,\" Clark said.Ball-trackingJaxon's brother, Canaan, was a fourth-round Major League Baseball draft selection who played outfield for the Pittsburgh Pirates. He's used to tracking balls hit at high speeds and sometimes hundreds of feet in the air. Jaxon likes to think some of that rubs off on his game. The brothers talk frequently, and Canaan preaches patience and reading the ball in flight to effectively complete the catchThere's probably some of that mixed in with Jaxon's uncanny ability to find a ball in flight. But that doesn't fully explain the catch he made in the Rose Bowl. You know the one. Over his shoulder near the sideline of the end zone, head turned so far that it's horizontal. \nThat catch is iconic. It's been viewed millions of times, and Brooks can't help but laugh at that fact. It looked impossible, but he's seen JSN make similar catches on hundreds of occasions in practice.So where does that ability to track the football come from?\"That's God,\" Maada said. \"It's just like, 'Bro, how?' I'm serious. I don't know.\"HandsClark used to watch Smith-Njigba catch passes without looking.\"The refs were like, 'I don't think someone at this level can do that,'\" Clark said. \"So, they'd call it incomplete.\"Unlike his god-given tracking ability, Smith-Njigba's hands are a product of work. They aren't big. This isn't a Kawahi Leonard situation where his hands swallow the ball. It took grip strength training -- and lots of it. He started young. Maada used to have handshake competitions with his boys. They'd hold on and squeeze to see who'd cower first. They'd work both hands, too. Maada used to make Jaxon hold a football and he'd swipe at it over and over trying to knock it away. Ahead of Jaxon's varsity debut in ninth grade, Brooks remembers watching Smith-Njigba catch passes from the team's ball boys. Then, something odd happened. Smith-Njigba laid on his back and looked behind him. He then proceeded to catch pass after pass with one hand like it was the most normal thing in the world.\"His hands are one of a kind,\" Clark said.When he was in college, Smith-Njigba spoke about a new wave of football. He noticed the sport skewing toward creativity, an artistic expansion that allowed skill players to express themselves freely. Smith-Njigba looked at the way the Kansas City Chiefs operate at the height of the Mahomes-Hill-Travis Kelce connection. He said it takes special talents to pull it off, players who can thrive in the open field and consistently get open.\"I feel like that's what my game is,\" Smith-Njigba said.It started with those couch cushions. JSN saw football on TV and imagined a similar world in his living room. In high school, Jaxon gravitated to the quarterbacks he played with, developing strong relationships with them, constantly studying with them and asking to play catch. Jami said Jaxon has always been that way. Obsessed with football. So much so she never doubted Jaxon when he said he'd play in the NFL. It was conviction matched only by the labor that went toward the goal.\"He's not a very balanced person,\" Jami said. \"He's just so dedicated to football. … It's just been his way. I don't think there's a time he didn't think about defenses.\"Inundated with fables of JSN's football mind, I tried to get inside his head: What is he thinking about at the top of a route? So much work goes into getting to that point, where the separation is really about to happen, before the ball-tracking and then the hands. So what is that feeling like, when everything culminates and JSN knows he's about to break free of a defender?There is a pause for a few seconds. \"I don't know,\" Smith-Njigba says, with a look on his face that tells me we occupy two very different worlds of being, that whatever happen in JSN's moments of greatness are about being, not thinking. \"Sorry.\"Perhaps a story from high school can best attempt to explain the unexplainable.During a district game against North Mesquite High School, Smith-Njigba ran a route along the sideline but as he cut, his shoe came off. Jaxon caught the ball. Then, ever so casually, he scooped up his shoe in the other hand and scooted out of bounds before any of the several defenders barreling in his direction could touch him. \"The game moves at a different speed for that person than anyone else,\" Brooks said. \"That's Jaxon right there.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl Spotlight: Why Seahawks WR Jaxon Smith-Njigba is a nightmare for defenses - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/31/7be4a70d-5c25-41d0-a84d-60cb7133d035/thumbnail/1200x675/21fbcc9b31c706ba65bc58e0c236a720/jsn-1.png"
      ],
      "datePublished": "2026-02-01T14:34:28.000Z",
      "dateModified": "2026-02-01T14:34:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]