[
  {
    "title": "World Series sportsbook promos, boosts for Dodgers vs. Blue Jays - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/best-mlb-sportsbook-promos-dodgers-blue-jays-2025-world-series-game-2/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/ee9aaf78-b6c4-489c-b24d-619c4ec5fcca/thumbnail/1200x675/ea10fded560f300583361f88b6ca97c4/los-angeles-dodgers.jpg",
    "tag": "Sports",
    "date": "2025-10-25T13:49:22.000Z",
    "description": "\n        Game 2 of the 2025 World Series takes place on Saturday when the Toronto Blue Jays host the Los Angeles Dodgers. The Blue Jays recorded an 11",
    "body": "\n        Game 2 of the 2025 World Series takes place on Saturday when the Toronto Blue Jays host the Los Angeles Dodgers. The Blue Jays recorded an 11-4 victory on Friday, and they'll look to defend home field again on Saturday night. The Dodgers are expected to start right-hander Yoshinobu Yamamoto (2-1, 1.83 ERA), while Toronto will counter with Kevin Gausman (2-1, 2.00 ERA). According to the latest MLB odds, the Dodgers are -150 money line favorites (risk $150 to win $100), while the over/under for total runs scored is 7.5.First pitch is scheduled for 8 p.m. ET on Saturday, so be sure to check out some of the top online sportsbook promos before you place any World Series bets. Here are the best sportsbook promos you can get for the World SeriesDraftKings is offering new users $300 in bonus bets with an initial winning wager of $5 or more + three months of NBA League Pass, while FanDuel is providing new users $300 in bonus bets if their first bet of $5 or more wins. Claim those sportsbook promos or any of the other offers available before betting Dodgers vs. Blue Jays in the World Series.Where to bet on the 2025 World SeriesBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCashJust click hereFor more information on these sportsbook promos, check out our sportsbook promos page.DraftKings promotions for the World SeriesDraftKings customers have access to World Series promotions, including:25% SGP Profit Boost each gameUnlimited Home Run BoostsFanDuel promotions for the World SeriesFanDuel is offering these promotions for Blue Jays vs. Dodgers:30% Profit Boost for Dodgers vs. Blue Jaysbet365 promotions for the World Seriesbet365 is offering the following promos for Dodgers-Blue Jays:5 Run Early Payout (Get paid out early if your team goes up by 5)BetMGM promotions for the World SeriesBetMGM is offering the following promos for Los Angeles vs. Toronto:No Sweat SGP TokenCaesars promotions for the World SeriesCustomers at Caesars have access to these promos for Blue Jays-Dodgers:$575,000 Fastball Fortune: Win a share if a no-hitter is thrown by placing qualifying parlaysFanatics promotions for the World SeriesWith Fanatics, you can use promos for Toronto vs. Los Angeles betting, including:Claim up to $2,000 in bonuses ahead of the MLB World SeriesResponsible gamingGaming responsibly is important, and all the top sportsbooks have various tools and resources available on their apps and websites, including time and wager limits, plus voluntary self-exclusion options. Several are equipped with live 24/7 chat support, so if you or someone you know is dealing with a gambling problem, reach out to trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Series sportsbook promos, boosts for Dodgers vs. Blue Jays - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/ee9aaf78-b6c4-489c-b24d-619c4ec5fcca/thumbnail/1200x675/ea10fded560f300583361f88b6ca97c4/los-angeles-dodgers.jpg"
      ],
      "datePublished": "2025-10-25T13:49:22.000Z",
      "dateModified": "2025-10-25T13:49:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model locks in Dolphins vs. Falcons picks, score prediction for NFL Week 8 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-falcons-where-to-watch-nfl-week-8-betting-odds-score-prediction-michael-penix-jr-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/958ea7a5-9909-4534-9a6d-c25d404f3349/thumbnail/1200x675/1e44deda2f041dfb7b0559f9f0b2d4a5/bijan-robinson-atlanta-falcons-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T16:04:30.000Z",
    "description": "\n        The Miami Dolphins (1-6) and the Atlanta Falcons (3-3) will both look to get back into the win column when they face off in NFL Week 8 on Par",
    "body": "\n        The Miami Dolphins (1-6) and the Atlanta Falcons (3-3) will both look to get back into the win column when they face off in NFL Week 8 on Paramount+. The dysfunction continues for the Dolphins, who have lost three straight games following a 31-6 defeat at the hands of the Cleveland Browns. The Falcons were also put in the loss column in Week 7, falling 20-10 to the San Francisco 49ers on Sunday Night Football. Atlanta's starting quarterback Michael Penix Jr. (knee) is listed as questionable, and if he's unable to go on Sunday, veteran Kirk Cousins will be in line to start. Kickoff from Mercedes-Benz Stadium is set for 1 p.m. ET on CBS and Paramount+. Atlanta is a 7.5-point favorite in the latest Dolphins vs. Falcons odds from SportsLine consensus, while the over/under for total points scored is 44.5. Before making any Falcons vs. Dolphins picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Dolphins vs. Falcons at DraftKings Sportsbook, where new users get $300 in bonus bets if your initial $5 bet wins and three months of NBA League Pass free:Where to bet on Falcons vs. DolphinsBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  Just click hereWhere to watch Dolphins vs. Falcons on SundayWhen: Sunday, Oct. 26Time: 1 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppFalcons vs. Dolphins betting previewOdds: Falcons -7.5, over/under 44.5The off-field comments from Tua Tagovailoa and coach Mike McDaniel have garnered most of the attention, but what the Dolphins are doing on the field is the primary concern. Their solo victory this season was a six-point win against the 0-7 Jets. The passing game has shriveled up since Tyreek Hill's season-ending injury, and its only generating 186.6 yards per game while the run game can only muster up 92.4 yards per outing. Miami's defense is also giving up a league-high 159.3 rushing yards per game, so the Dolphins are expected to have a hard time containing Bijan Robinson.  The Falcons' running back was held to just 40 yards on 14 carries and no rushing touchdowns by San Francisco, but Sunday's home game against Miami sets the stage for him to have a revenge performance. The defense still allows the fewest passing yards in the NFL (141.2) and was firing on all cylinders when it held 49ers quarterback Mac Jones without a touchdown.Click here to bet Dolphins vs. Falcons at FanDuel Sportsbook, where new users get $300 in bonus bets if their first bet of at least $5 wins:Model's Dolphins vs. Falcons score prediction, picksBoth teams have covered the spread three times this season. The Falcons are 2-1-0 ATS at home compared to the Dolphins being 1-3-0 ATS as the road team. The overall series between these teams has featured close games, with the Falcons winning three of five. The Falcons should be hungry for a home win after being silenced on the Sunday night stage in Week 7. The SportsLine model projects Atlanta will cover the spread in 55% of simulations. Dolphins vs. Falcons score prediction: Falcons 32, Dolphins 22Want more Week 8 NFL picks?You've seen the model's best bets for Atlanta Falcons vs. Miami Dolphins. Now, get against the spread, total and money-line picks for every Week 8 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model locks in Dolphins vs. Falcons picks, score prediction for NFL Week 8 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/958ea7a5-9909-4534-9a6d-c25d404f3349/thumbnail/1200x675/1e44deda2f041dfb7b0559f9f0b2d4a5/bijan-robinson-atlanta-falcons-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T16:04:30.000Z",
      "dateModified": "2025-10-25T16:04:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals free NFL picks, best bets for Week 8 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-week-8-nfl-best-bets-free-picks-betting-odds-eagles-bears-sunday-october-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/496af9a3-fd11-4475-8d01-7ea85a259fe0/thumbnail/1200x675/ff253becd73a8fb42c3d43585bcae24b/saquon-barkley-eagles.jpg",
    "tag": "Sports",
    "date": "2025-10-25T15:47:22.000Z",
    "description": "\n        The Week 8 NFL schedule is packed with seven games in the 1 p.m. ET window, including an NFC East rivalry between the Philadelphia Eagles and",
    "body": "\n        The Week 8 NFL schedule is packed with seven games in the 1 p.m. ET window, including an NFC East rivalry between the Philadelphia Eagles and New York Giants. These two teams square off on Thursday, Oct. 9, with New York securing a 34-17 victory at home. This time around, the Eagles are favored by 7.5 points, according to the latest Week 8 NFL odds. The Eagles are 13-1 in their past 14 home games, and SportsLine's model is backing Philadelphia to record a convincing victory and cover the spread in 55% of simulations. The model is also backing the Bears (+6.5) to cover the spread on the road against the Ravens, while the Over (46) hits 63% of the time in Bills vs. Panthers. Before locking in your Week 8 NFL picks, be sure to check out the top NFL betting picks from SportsLine's advanced computer model. New users can also target the all-new DraftKings promo code, which offers $300 in bonus bets and three free months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 43-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns. New users can target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:Week 8 NFL best bets for Sunday, Oct. 26 (odds subject to change): Eagles (-7.5) vs. GiantsBears (+6.5) vs. RavensBills vs. Panthers: Over 46 points Combining the model's three picks into a Week 8 NFL parlay would result in a payout of +606 (risk $100 to win $606). Bet it now at Caesars Sportsbook: Eagles (-7.5) vs. GiantsThe Eagles have won 12 consecutive home games against the Giants, and New York has lost nine straight games on the road. The Giants gave up 33 points to the Denver Broncos in the fourth quarter last week, and Philadelphia's offense, which features Jalen Hurts and Saquon Barkley, will look to exploit those weaknesses on Sunday. The model is projecting the Eagles to record a double-digit victory on Sunday, helping Philadelphia cover the spread in 55% of simulations.Bears (+6.5) vs. RavensThe Baltimore Ravens have been without superstar quarterback Lamar Jackson during their past two games as he's dealt with a hamstring injury. Meanwhile, Chicago's offense seems to be clicking under new head coach Ben Johnson, with Chicago scoring 25 or more points in each of its four games, all victories. The Bears are 4-1 against the spread in their last five games and 5-2 ATS in their past seven games played in October. SportsLine's model is backing Chicago to cover the spread in 59% of simulations, targeting the Bears as one of its top Week 8 NFL picks. Bills vs. Panthers: Over 46 pointsIf history is any indicator, Sunday's matchup between the Bills and Panthers will clear this total. That's because the total has gone Over in 12 of Buffalo's last 18 games, and the Over has hit in eight of Carolina's past 11 contests. The Bills are averaging 27.8 points per game, which ranks fourth in the NFL, and now Josh Allen and Co. will take on a Carolina defense that gave up 42 points to the New England Patriots on Sept. 28. SportsLine's model is projecting these teams will combine for 54 points on Sunday, helping the Over hit in 63% of simulations.Want more Week 8 NFL picks?You've seen the model's Week 8 NFL best bets for Sunday. Now, get against the spread, total and money line picks for every Week NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals free NFL picks, best bets for Week 8 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/496af9a3-fd11-4475-8d01-7ea85a259fe0/thumbnail/1200x675/ff253becd73a8fb42c3d43585bcae24b/saquon-barkley-eagles.jpg"
      ],
      "datePublished": "2025-10-25T15:47:22.000Z",
      "dateModified": "2025-10-25T15:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by betting Texas, LSU-Texas A&M over, college football games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-betmgm-bonus-code-cbssports-get-150-bonus-betting-texas-lsu-texas-a-m-college-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-25T13:36:35.000Z",
    "description": "\n        The Week 9 college football schedule is action-packed once again, and Saturday is the perfect time to use the BetMGM bonus code CBSSPORTS to ",
    "body": "\n        The Week 9 college football schedule is action-packed once again, and Saturday is the perfect time to use the BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins. Arch Manning and Texas are back up to No. 22 in the AP Top 25 ahead of a 4:15 p.m. ET matchup with Mississippi State, and other high-profile matchups include No. 6 Oregon vs. Wisconsin and No. 20 LSU vs. No. 3 Texas A&M.Picks from all three of those games are among our college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every MLB game 10,000 times. It enters the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Saturday's best bets at BetMGMTexas -7.5 vs. Mississippi StateOver 45.5 points in Oregon vs. WisconsinOver 48.5 points in LSU vs. Texas A&MCombining these three picks into a Saturday CFB parlay at BetMGM would result in a payout of +644 (risk $100 to win $644). Bet it at BetMGM here:\nTexas -7.5 vs. Mississippi State Arch Manning's first full season as a starter hasn't been the coming out party that most expected, but Texas (5-2) finally earned its first true road win of the season last week against Kentucky in overtime. Meanwhile, Mississippi State (4-2) has doubled its win total from last season, but hasn't won an SEC game since Oct. 21, 2023 against Arkansas. The model predicts that the Longhorns cover the spread in 61% of simulations. Back Texas at BetMGM Sportsbook now:Over 45.5 points in Oregon vs. WisconsinForecasted thunderstorms and the fact that Wisconsin has been shut out two weeks in a row is fueling this low total, but the Ducks just put 56 points on Rutgers and there hasn't been an Oregon game this season where fewer than 48 combined points were scored. Dan Lanning's squad ran for 415 yards last week on the road and is averaging 241.9 yards per on the ground this season. That type of rushing attack helps weatherproof this offense and is a big reason why the model says that the Over hits in 67% of simulations. Back the Over at BetMGM Sportsbook now:Over 48.5 points in LSU vs. Texas A&M There have been at least 60 points scored in each of the last three times that these two programs have met and the Over is 7-3 over the last 10 matchups. Garrett Nussmeier struggled to move the ball efficiently early in the season, but the LSU passing attack has averaged at least 7.7 yards per pass attempt in four of its last five games. Meanwhile, Marcel Reed and the Aggies have scored 31 points or more in six of the seven games they've played. The model predicts that the Over hits in 66% of simulations. Back the Over at BetMGM Sportsbook now:\nWant more NFL picks for this week?You've seen some of the model's best bets for Saturday. Now, get against the spread, total and money-line picks for every NFL game on the schedule, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by betting Texas, LSU-Texas A&M over, college football games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-25T13:36:35.000Z",
      "dateModified": "2025-10-25T13:36:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting LSU, Michigan, college football games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-lsu-texas-a-m-michigan-michigan-state-college-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-25T13:34:41.000Z",
    "description": "\n        The Week 9 college football schedule continues with a loaded Saturday slate, and the latest bet365 bonus code CBSBET365 gives new users $200 ",
    "body": "\n        The Week 9 college football schedule continues with a loaded Saturday slate, and the latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more. One of the top games of the day is No. 20 LSU vs. No. 3 Texas A&M at 7:30 p.m. ET, as the Aggies try to remain unbeaten.  SportsLine's proven computer model thinks LSU pulls off the upset as a home underdog, and it has also revealed two more best bets for Saturday night's college football action. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. It is on a sizzling 43-28 run on top-rated picks dating back to 2024. Additionally, the model is up well over $10,000 for $100 players on top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. Anybody following its NBA betting picks and NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Saturday's top picks, best betsOver 44.5 points in Oregon vs. WisconsinLSU +2.5 vs. Texas A&MMichigan -14.5 vs. Michigan StateCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:\nOver 44.5 in Oregon vs. WisconsinThis is one of the lowest totals of the week in college football, which is largely due to Wisconsin's offense. The Badgers were shut out by Iowa and Ohio State in their last two games, but Oregon has not recorded a shutout this season and has allowed double digits in five of its first seven outings. SportsLine's model has Wisconsin scoring 12 points on Saturday night, which is enough to help the full game Over cash in 67% of simulations. Bet it at bet365 here:  LSU +2.5 vs. Texas A&MLSU desperately needs a win on Saturday night to keep its SEC title and College Football Playoff hopes alive, as the Tigers are coming off a 31-24 loss at Vanderbilt. They have not lost a home game so far this season, and Texas A&M has played its two closest games in its two road games. The Aggies escaped with a 1-point win at Notre Dame and a 3-point win at Arkansas, and this is their second week in a row on the road. LSU wins outright and is covering the spread 58% of the time, according to the model. Bet it at bet365 here:Michigan -14.5 vs. Michigan StateMichigan State is in a major rut right now, dropping its fourth straight game last week. The Spartans have lost their last two games by 25 points each, while Michigan has already beat Wisconsin and Washington by two-plus touchdowns. The model has Michigan cruising to another win in this rivalry game, as the Wolverines cover the spread in 66% of simulations. Bet it at bet365 here:\nLooking for Week 8 NFL picks?You've seen the model's best bets for Saturday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting LSU, Michigan, college football games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-25T13:34:41.000Z",
      "dateModified": "2025-10-25T13:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arik Gilbert arrested: Ex-5-star recruit, TE at Georgia and LSU, busted for shoplifting - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arik-gilbert-arrested-ex-five-star-recruit-lsu-nebraska-shoplifting-obstruction-charges/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/816e3fbf-5f3d-464c-a3bf-6a6c599371c2/thumbnail/1200x675/ef5ab704b7f235536e07e7c988e6043c/arik-gilbert.jpg",
    "tag": "Sports",
    "date": "2025-10-25T13:57:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Arik Gilbert, a former five-star recruit who spent",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Arik Gilbert, a former five-star recruit who spent time at LSU, Georgia and Nebraska, was arrested in Georgia on allegations of shoplifting and obstruction, according to Chatham County jail records. The bond for the current redshirt sophomore at Savannah State has been set at $3,500. The arrest marks the latest legal setback for Gilbert, whose once-promising football career has been overshadowed by repeated off-field issues and multiple transfers. The former Gatorade National Player of the Year was arrested in 2023 for alleged burglary of a liquor and vape shop while a member of the Cornhuskers, though a no-contest plea eventually reduced the charges to trespassing and criminal mischief. Weeks later, he was arrested again in Lumpkin County, Georgia, in connection with a separate smash-and-grab burglary and on suspicion of obstructing officers.Gilbert's college career began with significant promise at LSU, where he caught 35 passes for 368 yards and two touchdowns in eight games as a freshman. He initially announced a transfer to Florida in early 2021 before ultimately joining Georgia later that year. At Georgia, Gilbert did not appear during the 2021 season but returned in 2022, playing in three games and recording two receptions for 16 yards and a touchdown. He later transferred to Nebraska ahead of the 2023 season but never suited up for the Huskers.\nNebraska coach Matt Rhule said at the time of Gilbert's earlier arrests that he was \"really disappointed\" but \"really sad for him,\" noting the program's efforts to support the tight end through his personal struggles.Now at Savannah State, Gilbert has appeared in six games this season, recording 19 catches for 258 yards and a touchdown.\nGilbert rated as the No. 10 overall prospect and No. 1 tight end in the 2020 recruiting class coming out of Marietta (Georgia). \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arik Gilbert arrested: Ex-5-star recruit, TE at Georgia and LSU, busted for shoplifting - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/816e3fbf-5f3d-464c-a3bf-6a6c599371c2/thumbnail/1200x675/ef5ab704b7f235536e07e7c988e6043c/arik-gilbert.jpg"
      ],
      "datePublished": "2025-10-25T13:57:04.000Z",
      "dateModified": "2025-10-25T13:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons to start Kirk Cousins vs. Dolphins due to Michael Penix Jr. injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-expected-to-start-kirk-cousins-vs-dolphins-michael-penix-jr-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/0b431ac2-aaa0-472a-ae9c-f97b3137aafa/thumbnail/1200x675/7d2fa63a40c728d6e8bb3bb5e140b079/gettyimages-2238456306-2.jpg",
    "tag": "Sports",
    "date": "2025-10-25T14:19:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons are trending towards starting ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons are trending towards starting Kirk Cousins at quarterback in Week 8 vs. the Miami Dolphins, CBS Sports' Jonathan Jones confirms, while Michael Penix Jr. remains sidelined with a bone bruise in his knee. It would be the veteran signal-caller's first start in more than 10 months since his benching. Penix suffered the injury late in the Falcons' loss to the San Francisco 49ers in Week 7. Penix was able to finish the game, but he has been limited in practice throughout the week; Cousins has been taking all-the first-team reps in Atlanta, per Schefter. Cousins was benched in favor of Penix for the last three games of the 2024-25 season, and the only playing time he's seen since then came in the Falcons' Week 3 blowout of the Carolina Panthers. In mop-up duty, Cousins completed five of seven passes for 29 yards.\nPrior to his benching in 2024, Cousins completed 66.9% of his passes for 3,508 yards, 18 touchdowns and a league-leading 16 interceptions. That was Cousins' first season with the Falcons, and he lost the starting job just nine months after signing a four-year, $180 million contract in free agency.Rumors grew over the offseason that Cousins could be traded to another quarterback-needy team, but that never came to fruition. That's a plus for Atlanta in situations like this, because you won't find a more proven or capable backup anywhere else in the NFL. Throughout his 14 seasons, Cousins has thrown for 43,008 yards, 288 touchdowns and 126 interceptions.\nThis weekend, Cousins and the Falcons offense should have no problem moving the ball against the Miami defense. Even if Cousins needs to shake off the rust, Atlanta should get whatever it wants on the ground with Bijan Robinson. The Dolphins are dead last in rush defense, allowing an average of 159.3 yards per game.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons to start Kirk Cousins vs. Dolphins due to Michael Penix Jr. injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/0b431ac2-aaa0-472a-ae9c-f97b3137aafa/thumbnail/1200x675/7d2fa63a40c728d6e8bb3bb5e140b079/gettyimages-2238456306-2.jpg"
      ],
      "datePublished": "2025-10-25T14:19:28.000Z",
      "dateModified": "2025-10-25T14:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trey Hendrickson injury update: Bengals expect to get star pass rusher back vs. Jets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/trey-hendrickson-injury-update-bengals-expect-star-pass-rusher-back-vs-jets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/e2f91a8d-4ef8-45e2-982f-35692cd31397/thumbnail/1200x675/8d5b56c110d438663c1f1e26411dad82/gettyimages-2236783856-2.jpg",
    "tag": "Sports",
    "date": "2025-10-25T14:51:29.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As the Cincinnati Bengals try to keep pace with th",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As the Cincinnati Bengals try to keep pace with the Pittsburgh Steelers atop the AFC North, their defense will get a big boost against the New York Jets in Week 8 with the return of star pass rusher Trey Hendrickson, who is expected to play after missing last week's win over the Steelers with a hip injury, according to ESPN's Jeremy Fowler.Hendrickson was able to log some limited practices this week and was listed as questionable on the team's final injury report. That's great news for a Bengals defense that's struggled even with Hendrickson in the game, but his return will help the pass rush immensely. In his six starts this season, Hendrickson has tallied 4.0 sacks and three tackles for loss. Last season, Hendrickson led the NFL with 17.5 sacks, and he has 81 in 116 career games.The Bengals rank 27th in sacks with 11 through seven games. Outside of Hendrickson, Cincinnati has just seven sacks on the year, and Joseph Ossai is the only other player with at least two.\nThere's no doubt the Bengals will be able to get more pressure on the opposing quarterback with Hendrickson in the lineup, but who will that opposing quarterback be? Jets coach Aaron Glenn has yet to reveal whether Justin Fields or Tyrod Taylor will get the start on Sunday. In last week's loss to the Carolina Panthers, Fields was benched for the veteran Taylor.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trey Hendrickson injury update: Bengals expect to get star pass rusher back vs. Jets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/e2f91a8d-4ef8-45e2-982f-35692cd31397/thumbnail/1200x675/8d5b56c110d438663c1f1e26411dad82/gettyimages-2236783856-2.jpg"
      ],
      "datePublished": "2025-10-25T14:51:29.000Z",
      "dateModified": "2025-10-25T14:51:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ohio vs. Eastern Michigan live stream, where to watch online, CBS Sports Network channel finder, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ohio-vs-eastern-michigan-live-stream-where-to-watch-online-cbs-sports-network-channel-finder-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2019/11/13/ea3a435f-be84-407c-8e7a-d2db310a2ac1/thumbnail/1200x675/293dbd227bd315b93c5644cbf8e9d10b/usatsi-8949281-220956-lowres.jpg",
    "tag": "Sports",
    "date": "2025-10-25T16:08:06.000Z",
    "description": "\n        College football action heats up on CBS Sports Network this week, with six games across five days set to deliver crucial conference clashes a",
    "body": "\n        College football action heats up on CBS Sports Network this week, with six games across five days set to deliver crucial conference clashes and high-stakes matchups. The Week 9 slate opens Tuesday night in Ruston where Louisiana Tech hosts Western Kentucky in a pivotal Conference USA battle. Both teams are coming off losses, with the Bulldogs' top-ranked defense looking to contain a Hilltoppers offense.You can bet college football games this week at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager. Click here:Wednesday night, Missouri State makes its first-ever trip to New Mexico State, where the Aggies aim to remain undefeated at home for the first time in more than 20 years. The Bears are chasing back-to-back wins as an FBS program for the first time.\nFriday brings a Mountain West matchup as Boise State travels to Nevada. Broncos sophomore Dylan Riley, averaging nearly 100 rushing yards per game, will challenge a Wolf Pack defense still seeking its first FBS victory.Saturday opens with Ohio visiting Eastern Michigan in a MAC showdown. Later that afternoon, Navy, the last unbeaten in the Group of Six, hosts Florida Atlantic as the Midshipmen aim to extend their perfect start behind a dominant rushing attack. The week closes Saturday evening with Colorado State traveling to take on Wyoming in the Border War.CBS Sports Network will carry all six games, with full viewing info, betting lines and key storylines to follow as Week 9 unfolds.\nAll times Eastern | Odds via SportsLine consensusOhio vs. Eastern MichiganDate: Saturday, Oct. 25 | Time: 12 p.m.Location: Rynearson Stadium -- Ypsilanti, MichiganTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: Ohio -12.5 | Will the Bobcats cover? Check out SportsLine's Week 9 projections hereOne of the top scoring offenses in the MAC gets a chance to feast on one of the league's more vulnerable defenses to open Saturday's action when Ohio (4-3) visits Eastern Michigan (2-6). Led by quarterback Parker Navarro and running back Sieh Bangura, the Bobcats rank second in the conference in scoring (29.4 points per game) while averaging 6.28 yards per play. The Eagles are near the bottom defensively, allowing 6.62 yards per play -- the worst mark in the MAC.FAU vs. NavyDate: Saturday, Oct. 25 | Time: 2:30 p.m.Location: Navy - Marine Corps Memorial Stadium -- Annapolis, MarylandTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: Navy -15.5 | Will the Midshipmen cover? Check out SportsLine's Week 9 projections here\nNavy (6-0) -- the lone unbeaten left in the Group of Six -- looks to keep its perfect season alive Saturday against Florida Atlantic (3-4). The Midshipmen started 6-0 last year before consecutive losses ended their College Football Playoff hopes. Quarterback Blake Horvath leads the nation's top rushing offense, averaging 305 yards per game with three players topping 40 yards per contest on the ground.Colorado State vs. WyomingDate: Saturday, Oct. 25 | Time: 6:30 p.m.Location: War Memorial Stadium -- Laramie, WyomingTV: CBS Sports Network [Channel finder] Live stream: CBSSports.com | Mobile: CBS Sports AppSpread: Wyoming -6 | Will the Cowboys cover? Check out SportsLine's Week 9 projections hereColorado State (2-5) begins a new chapter under interim coach Tyson Summers after Jay Norvell was fired Sunday, matching the worst start of his four-year tenure. The Rams make the short trip north to Wyoming (3-4) in the Border War, with both teams looking to rebound after dropping four of their past five games. The Cowboys have won seven of the last nine meetings but are aiming to avoid back-to-back losses to Colorado State for the first time since 2015.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ohio vs. Eastern Michigan live stream, where to watch online, CBS Sports Network channel finder, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2019/11/13/ea3a435f-be84-407c-8e7a-d2db310a2ac1/thumbnail/1200x675/293dbd227bd315b93c5644cbf8e9d10b/usatsi-8949281-220956-lowres.jpg"
      ],
      "datePublished": "2025-10-25T16:08:06.000Z",
      "dateModified": "2025-10-25T16:08:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 8 NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-longshot-picks-week-8-odds-alternate-lines-player-props-parlay-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/14/1fb9c241-a01f-4d54-97b7-42ee91db7dff/thumbnail/1200x675/8a6e4b7798f3d43684d92f38b0df82ac/josh-allen-bills-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-25T14:09:17.000Z",
    "description": "\n        The Week 8 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the",
    "body": "\n        The Week 8 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the NFL playoff picture. The Buffalo Bills are 7-point favorites over the Carolina Panthers in what projects as a bounce-back opportunity for Josh Allen and company. In the NFC East, the Philadelphia Eagles host the New York Giants as 7.5-point favorites in a divisional clash that's expected to be physical and low-scoring. 'Sunday Night Football' features the Green Bay Packers and Pittsburgh Steelers in a near-even matchup packed with storylines on both sidelines. The week wraps up with the Kansas City Chiefs heavily favored (-11.5) over the Washington Commanders on 'Monday Night Football,' with Jayden Daniels (hamstring) ruled out.Effectively building NFL parlay picks can pay off big in your NFL betting strategy. NFL parlays come with a much greater risk than straight bets, but they also carry the potential of a much bigger reward. Before making any Week 8 NFL picks and parlays, you need to see the Week 8 NFL longshot parlay from SportsLine's proven computer simulation model that pays out well over $28,000 on a $10 bet. You can bet this NFL parlay using the latest DraftKings promo code, which offers $300 in bonus bets if your initial $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 43-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Week 8 NFL odds, it's locked in its betting picks to form a 5-leg NFL parlay that could pay out well over $28,000 for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 8 NFL parlay picksFor Week 8, one of the model's parlay picks is backing the Panthers and Bills to go Over the alternate point total of 53.5, a bet that returns +204. The standard over/under is 46.5 points, but the model has spotted an opportunity to go bigger here. The Bills and Panthers are projected to combine for 54 points with the standard over/under hitting in 68% of computer simulations, leaving room to play alternate lines. The Bills have one of the league's most explosive offenses behind reigning NFL MVP Josh Allen. The Panthers' young offense has been one of the biggest surprises of the NFL season thus far. The Bills rank fourth in the NFL, averaging 27.8 points per game this season. Josh Allen and James Cook lead the way for Buffalo, with wide receiver Keon Coleman in the midst of a breakout season. The Panthers will turn to veteran quarterback Andy Dalton with Bryce Young (ankle) already ruled out. Carolina has leaned on rookie wide receiver Tetairoa McMillan and running back Rico Dowdle in the early weeks of the season. See the rest of the picks in the Week 8 NFL parlay here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make NFL parlay picks for a payout of well over $28,000The parlay also includes four additional picks from SportsLine's computer model, including a first touchdown scorer prop bet that returns +900. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for Week 8 that can be combined into a parlay that returns well over $28,000 on just a $10 bet? And what optimal first touchdown scorer bet returns +1100? Visit SportsLine now to see the top Week 8 NFL picks from SportsLine's proven model that can be combined for a parlay that pays well over $28,000, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/14/1fb9c241-a01f-4d54-97b7-42ee91db7dff/thumbnail/1200x675/8a6e4b7798f3d43684d92f38b0df82ac/josh-allen-bills-imagn.jpg"
      ],
      "datePublished": "2025-10-25T14:09:17.000Z",
      "dateModified": "2025-10-25T14:09:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL survivor picks, knockout pool predictions, top Week 8 choices from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-survivor-knockout-pool-picks-advice-strategy-guide-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/22/c9b726ab-25d5-40eb-b8b3-be605fea5b55/thumbnail/1200x675/1ccfd3637204e5b70f6497c75dd3826b/derrick-henry-baltimore-ravens-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T15:26:23.000Z",
    "description": "\n        A number of survivor pool players have seen their hopes disappear, but for those few still alive, Week 8 of the NFL schedule leaves them with",
    "body": "\n        A number of survivor pool players have seen their hopes disappear, but for those few still alive, Week 8 of the NFL schedule leaves them with several solid options. Week 7 didn't feature as much carnage as previous weeks, as most of the favorites earned wins, including the Kansas City Chiefs with a 31-0 win over Las Vegas, and the New England Patriots with a 31-13 win over Tennessee. A slight hinderance to players is the fact that six teams will be on their bye in Week 8. Among the possible targets for NFL survivor players this week include Dolphins at Falcons (-7.5), Bears at Ravens (-3.5), Bills at Panthers (+7), Jets at Bengals (-6) and Browns at Patriots (-7).Meanwhile, the Indianapolis Colts look to cruise to the AFC South title. Indianapolis (6-1) has a two-game lead over second-place Jacksonville within the division. Indianapolis will look for the season sweep of Tennessee. The Colts rolled to a 41-20 win over the Titans in Week 3. Indianapolis enters as a 14.5-point favorite, the largest line of the week, so the Colts are among the many appealing options for those who can still use them. Before finalizing any Week 8 NFL survivor picks, see which team the red-hot SportsLine Projection Model just went all-in on.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 43-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns. The model can be used to crush the survivor pool format, which calls for picking one team to win each week but never using the same team twice.Now, it has turned its attention to the latest Week 8 NFL schedule and locked in its Week 8 survivor pool pick. You can only see who the model is backing this week at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top Week 8 NFL survivor pool predictions In Week 8 of the 2025 NFL season, the model is shying away from the Baltimore Ravens, who are at home against the Chicago Bears at 1 p.m. ET on Sunday. The Ravens are 3.5-point and -194 money-line favorites, making them one of eight teams favored by more than a touchdown this week. However, Chicago has defeated Baltimore in two of the last three matchups overall and four of seven in the all-time series.The Bears have been on a roll with four consecutive wins. Caleb Williams has completed 61.1% of his passes with 1,351 yards and nine touchdowns with three interceptions and a 92.9 rating, to lead the Chicago offense. Baltimore, meanwhile, lists quarterback Lamar Jackson (hamstring) as questionable, but appears to be trending towards missing the game.Overall, the Ravens have lost four in a row. SportsLine's model projects that this is a one-score game as the Ravens win 60% of the time. There are better values left on the board for many, making Baltimore a team to avoid in NFL survivor pool picks. See which team to pick instead here. You can also use the latest FanDuel promo code to get $300 in bonus bets instantly:How to make Week 8 NFL survivor pool picks Instead, the model is confidently backing a team many have not used in survivor pools to win outright in nearly 90% of simulations. The time to pick this team is now, and you can only see the play over at SportsLine.Which surprising team is a must-back in your Week 8 NFL survivor pool? Visit SportsLine now to see which team carries you to victory in Week 8, all from the advanced computer model that nails survivor picks and is up well over $7,000 since its inception.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL survivor picks, knockout pool predictions, top Week 8 choices from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/22/c9b726ab-25d5-40eb-b8b3-be605fea5b55/thumbnail/1200x675/1ccfd3637204e5b70f6497c75dd3826b/derrick-henry-baltimore-ravens-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T15:26:23.000Z",
      "dateModified": "2025-10-25T15:26:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-daily-fantasy-lineup-advice-fanduel-draftkings-optimizer-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/84ef3986-bf83-4794-9138-aefed302912b/thumbnail/1200x675/65f75c85249bd3221a9ed886f4bc8cff/courtland-sutton-denver-broncos-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-25T16:03:42.000Z",
    "description": "\n        Developing a successful NFL DFS strategy can take many forms, but one of the most common approaches is focusing on games with the highest pro",
    "body": "\n        Developing a successful NFL DFS strategy can take many forms, but one of the most common approaches is focusing on games with the highest projected point totals when identifying top NFL DFS picks and building NFL DFS stacks. The highest over/under in the Week 8 NFL odds for the Sunday main slate is 51 in the Cowboys vs. Broncos matchup. Other potential high-scoring matchups include Bears vs. Ravens (47.5), Titans vs. Colts (48), and Buccaneers vs. Saints (46.5). Thus, you can expect stars like Dak Prescott, Bo Nix, CeeDee Lamb, Derrick Henry and Jonathan Taylor to be among the core players in many NFL DFS lineups. Players of that caliber, however, will set back your NFL DFS salary cap, forcing you to search for more potential NFL DFS sleepers and NFL DFS values. Should players like Daniel Jones or Baker Mayfield find their way into your quarterback slot for Sunday's main slate? Will underperforming players like Saquon Barkley and Tua Tagovailoa finally live up to their price tags on NFL DFS sites? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, where they can pick at Underdog and get $100 in site credits after making a $5 wager:The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool for sports betting apps.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 8 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 8 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is Colts quarterback Daniel Jones ($6,100 on DraftKings and $7,700 on FanDuel), who has an over/under of 235.5 passing yard against a porous Tennessee defense. The former first-round pick out of Duke signed with the Indianapolis Colts in 2025 after a challenging 2024 season with the New York Giants. In 2024, he played in ten games and threw for 2,070 yards with eight touchdowns and seven interceptions, completing 63.3% of his passes with a 79.4 passer rating. Jones beat out Anthony Richardson for the Colts' starting job, and has gotten off to an outstanding start to the 2025 season. He's thrown for 1,790 passing yards, ten touchdowns, and just three interceptions through seven games, with a passer rating above 105 and 83 yards and four scores on the ground. Jones is averaging roughly 255 passing yards per game this season and has elevated the Colts' offense into one of the more efficient units in the AFC. See who else to pick here.The optimizer's NFL DFS strategy also includes rostering Broncos wide receiver Courtland Sutton ($6,200 on DraftKings and $7,700 on FanDuel) as he takes on the Cowboys. The former second-round pick out of SMU had a strong 2024 campaign with the Broncos, catching 81 passes for 1,081 yards and eight touchdowns while averaging 13.3 yards per reception. Entering the 2025 season, he's off to another solid start. Through seven games, Sutton has 33 receptions for 469 yards and three touchdowns with a 14.2-yard per catch average. Sutton's consistency and chemistry with quarterback Bo Nix have helped stabilize Denver's passing game, particularly in key third-down and red-zone situations. At 6-foot-4, Sutton remains one of the league's most reliable contested-catch receivers, using his size and strength to win battles downfield. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to build Sunday Week 8 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/84ef3986-bf83-4794-9138-aefed302912b/thumbnail/1200x675/65f75c85249bd3221a9ed886f4bc8cff/courtland-sutton-denver-broncos-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-25T16:03:42.000Z",
      "dateModified": "2025-10-25T16:03:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 8 Fantasy football rankings, lineup advice, start-sit picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-rankings-week-8-sleepers-streamers-cheat-sheets-start-sit-advice/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/458b165f-0d72-4285-9fd4-e8da5c85c6bf/thumbnail/1200x675/41b72d4215187952ee2127075d6019c4/tetairoa-mcmillan-carolina-panthers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T15:03:51.000Z",
    "description": "\n        Making Week 8 Fantasy football picks will be harder than any other week, thus far, with six teams on byes. Those players who've been riding t",
    "body": "\n        Making Week 8 Fantasy football picks will be harder than any other week, thus far, with six teams on byes. Those players who've been riding the bench all year on your team may finally see the light of day and get inserted into Week 8 Fantasy football lineups. Players like Chase Brown, Chris Olave, Romeo Doubs and Pat Freiermuth have been inconsistent this year but are coming off huge outings. Even Joe Flacco, with his 342-yard, 3-touchdown performance last Thursday, is now part of Fantasy football start/sit decisions for the week ahead.How should you handle Commanders skill players with Jayden Daniel (hamstring) ruled out, along with assorted injuries to Terry McLaurin (quad) and Deebo Samuel (heel)? And how should you handle players on the Ravens and Falcons with Lamar Jackson (hamstring) and Michael Penix Jr. (knee) both questionable? Before making your Week 8 Fantasy football picks, be sure to check out the Week 8 Fantasy football rankings from the proven computer model at SportsLine. Bet on every NFL Week 8 game at DraftKings Sportsbook, where new users can target the DraftKings promo code, which offers $300 in bonus bets if your $5 initial wager wins + 3 months of NBA League Pass:When it comes to ranking players, SportsLine's model beat human experts in Fantasy football for the past several seasons, especially when there were big differences in ranking. Over the course of a season, that could literally be the difference between winning your league or going home empty-handed.The same model has a proven track record providing Fantasy football tips, including being ahead of the curve on players like A.J. Brown, Jonathan Taylor, Derrick Henry, Christian McCaffrey, Alvin Kamara and Jahmyr Gibbs. Anybody who banked on players like those could have made a run at their league title.Now, the model, which simulates every NFL game 10,000 times, has revealed its Fantasy football rankings for Week 8 of the 2025 NFL season. Head to SportsLine now to see them. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. Top Week 8 Fantasy football picks One surprise in Week 8: The model is fading Cowboys quarterback Dak Prescott, who has an over/under of 22.5 completions. Prescott sits third amongst quarterbacks in Fantasy points, thanks to 13 touchdowns versus zero picks over the last four weeks. However, none of those defenses match up with the Broncos unit he will face on Sunday, as only Houston has allowed fewer Fantasy points to opposing quarterbacks than Denver.Denver ranks first in sacks, allows the lowest completion percentage and has allowed the second-fewest passing scores on the year. The one spot where it is vulnerable versus quarterbacks is the run game as mobile QBs like Daniel Jones and Jaxson Dart have rushing touchdowns versus Denver. However, a litany of injuries has made Prescott a stationary quarterback who ranks 25th at the position in rushing yards (56). Thus, Prescott may not warrant a spot in Week 8 Fantasy football lineups as he sits outside the top 12 in QB rankings.Another curveball: The model is high on Panthers receiver Tetairoa McMillan. The No. 8 overall pick has had an inconsistent rookie year as he had 100 yards in Week 2 and a two-touchdown outing in Week 6, but he has no other games with either a touchdown or more than 73 yards. McMillan enters Week 8 ranking 27th amongst wideouts in Fantasy points in both standard and PPR leagues.However, he and Carolina will face a Buffalo defense on Sunday which has fallen apart in recent weeks. The Bills gave up just 125.8 passing yards over their first four games but then allowed an average of 250 yards over their last two. Both Stefon Diggs and Drake London had 140-plus receiving yards over the last two weeks versus Buffalo, and six of the seven passing scores the team has allowed have been to wideouts. McMillan slots among the top 12 in positional Fantasy rankings for Week 8, making him a WR1 in 12-team leagues. For more start/sit Fantasy football advice, be sure to check out the rest of the Week 8 Fantasy football rankings.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2  in select states.How to set Week 8 Fantasy football rankingsThe model is also calling for a surprising quarterback you aren't even thinking about to finish in the top 10 of its Week 8 Fantasy football rankings. This pick could be the difference between winning big and going home with nothing. See the model's entire Week 8 Fantasy football rankings for PPR and standard leagues here.So who should you start and sit this week, and which surprising quarterback could lead you to victory? Visit SportsLine now to get Week 8 Fantasy football rankings for every position, plus see which quarterback is going to come out of nowhere to crack the top 10, all from the model that has outperformed experts big-time.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 Fantasy football rankings, lineup advice, start-sit picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/458b165f-0d72-4285-9fd4-e8da5c85c6bf/thumbnail/1200x675/41b72d4215187952ee2127075d6019c4/tetairoa-mcmillan-carolina-panthers-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T15:03:51.000Z",
      "dateModified": "2025-10-25T15:03:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 WNBA coaching tracker: Four teams hire new coaches - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/wnba-coaching-tracker-storm-tab-liberty-assistant-sonia-raman-wings-paige-bueckers-get-new-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/cb5b8d6f-2629-4c71-9d38-aeb8cbf1d4ff/thumbnail/1200x675/c7550e3654689847d183d60f59f98d38/sonia-raman-storm-g.jpg",
    "tag": "Sports",
    "date": "2025-10-25T13:54:57.000Z",
    "description": "\n        The WNBA coaching carousel continues to spin, and both expansion team jobs have now been filled. The Seattle Storm have hired Sonia Raman, pe",
    "body": "\n        The WNBA coaching carousel continues to spin, and both expansion team jobs have now been filled. The Seattle Storm have hired Sonia Raman, per reports, while the Portland Fire announced that they have hired Alex Sarama. In other moves, the Toronto Tempo have put Sandy Brondello at the helm and the Dallas Wings have gone back to college and hired Jose Fernandez away from the University of South Florida.Now that the Storm, Wings, Fire and Tempo have made their decisions, one opening remains: the New York Liberty. Earlier this offseason, the Liberty parted ways with Brondello and the Storm decided not to move forward with Noelle Quinn. \n        \n            \n                Tempo to hire Sandy Brondello: Former Liberty coach will lead Toronto's WNBA expansion franchise, per report\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nQuinn's departure was expected. The Storm won only one playoff series since she took over in 2021 and she was investigated last offseason for alleged bullying and harassment. Likewise, it was not all that surprising to see Koclanes relieved of his duties. He went 10-34 in his first season in charge of the Wings and did not seem cut out for the job. The Liberty's decision to part ways with Brondello just one year after she led the franchise to its first championship, on the other hand, came as a shock to many. It's unlikely we'll see any further coaching changes this winter. Seven teams changed coaches last offseason, and if you count Natalie Nakase with the expansion Golden State Valkyries, eight coaches started new jobs. One, Koclanes, has already been fired, and the only other one who could be in trouble is Tyler Marsh, who went 10-34 with the Chicago Sky. However, if the Sky were going to move on from Marsh, they likely would have done so by now. \n\n        \n            \n                Chicago Sky offseason outlook: What's next for Angel Reese and Co. after a disastrous 2025 campaign\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nOf the five teams that entered the 2025 season with established coaches, the Storm and Liberty have made changes. The Las Vegas Aces and Phoenix Mercury made it to the Finals, and Becky Hammon and Nate Tibbets have excellent job security. As does Cheryl Reeve, despite the Minnesota Lynx's early exit from the playoffs.  WNBA coaching tracker Team2024 recordPrevious coachNew coachDallas Wings10-34Chris KoclanesJose FernandezNew York Liberty \t\t\t\t27-17 \t\t\t\tSandy Brondello \t\t\t\tTBD \t\t\t\tPortland Fire \t\t\t\tN/A \t\t\t\tN/A \t\t\t\tAlex SaramaSeattle Storm \t\t\t\t23-21 \t\t\t\tNoelle Quinn \t\t\t\tSonia RamanToronto Tempo \t\t\t\tN/A \t\t\t\tN/A \t\t\t\tSandy BrondelloStormOut: Noelle QuinnQuinn, who won a championship with the Storm as a player, joined the Seattle coaching staff as an assistant in 2019 immediately upon her retirement. In 2021, she was elevated to head coach after Dan Hughes stepped down due to health reasons. While she led the Storm to four playoff appearances, they won only one series despite an abundance of talent and never finished higher than sixth in the league in offensive rating. Furthermore, Quinn was investigated for alleged bullying and harassment of players. A second consecutive first-round exit in 2025 was the final straw. In: Sonia RamanPrior to her lone season as an assistant with the Liberty this year, Raman served as an assistant with the NBA's Memphis Grizzlies from 2020 to 2024. Before making the jump to the professional ranks, she was the head coach of MIT women's basketball team for 12 years between 2008 and 2020. During her tenure, she led the team to its first two Division III conference championships and two NCAA Tournament appearances. Before that, she was the lead assistant at Wellesley College for six seasons and began her coaching career at her alma mater, Tufts University.WingsOut: Chris KloclanesAfter a number of years as an assistant at both the WNBA and collegiate levels -- largely working under Curt Miller, who is now the Wings' general manager -- Koclanes got a chance to run the show himself. His lone season with the Wings was a disaster. He never seemed comfortable in charge, and the Wings finished in last place at 10-34 and set the league's single-season losses record. By the end of the season, fans were chanting \"We want Nola!\" during games, asking for the team to replace Koclanes with assistant Nola Henry. The Wings will now search for their third coach in as many years. In: Jose FernandezUSF coach Jose Fernandez is making the leap from the college ranks to the WNBA after 25 years coaching the Bulls. After leading South Florida to 10 NCAA Tournaments, including in eight of the last 11 seasons, he'll take over the Wings and Rookie of the Year Paige Bueckers, coming off a 10-34 record in 2025. Liberty Out: Sandy Brondello Brondello had a very successful tenure in charge of the Liberty. Over her four seasons in charge, the team went 107-53, won a franchise-record 32 games in both 2023 and 2024, never missed the playoffs and made two Finals appearances. In 2024, she led the Liberty to the first championship in franchise history and in 2023 she helped capture the Commissioner's Cup title. Ultimately, those accomplishments were overshadowed by a disappointing 2025 campaign. The Liberty were beset by injuries, finished in fifth place and were bounced in the first round of the playoffs by the Mercury.  In: TBD \n        \n            \n                Liberty coaching search: Top potential candidates to replace Sandy Brondello after New York's stunning move\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nFireOut: N/AIn: Alex SaramaSarama, who was born in England, has a fascinating résumé. He's worked with Paris Basketball and the London Lions -- where he briefly overlapped with Fire general manager Vanja Černivec -- as well as the Rip City Remix, the Portland Trail Blazers' G League affiliate, and the Cleveland Cavaliers. He also founded Transforming Basketball in 2023, which is \"widely regarded as a globally-leading resource in basketball coach education,\" and is a leading proponent of Constraints Led Approach or CLA, an innovative training technique. He was very highly regarded with the Cavaliers, but whether he works out as a head coach remains to be seen. \n        \n            \n                Portland Fire coaching hire: WNBA expansion team to hire Alex Sarama from Cleveland Cavaliers, per report\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nTempoOut: N/AIn: Sandy BrondelloThe Liberty's decision to shake things up was a major win for the Tempo, who were able to hire Brondello as the first coach in franchise history. Brondello is one of the best coaches in league history. She's compiled a 269-181 lifetime record, is sixth on the all-time wins list and has won championships with two different franchises (Phoenix Mercury in 2014, Liberty in 2024). Brondello is highly regarded by her players and staff everywhere she goes, and will help set a winning culture in Toronto as the franchise begins its WNBA journey. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 WNBA coaching tracker: Four teams hire new coaches - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/cb5b8d6f-2629-4c71-9d38-aeb8cbf1d4ff/thumbnail/1200x675/c7550e3654689847d183d60f59f98d38/sonia-raman-storm-g.jpg"
      ],
      "datePublished": "2025-10-25T13:54:57.000Z",
      "dateModified": "2025-10-25T13:54:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks against the spread, money line and over/under for Week 8 from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-ai-spread-over-under-money-line-week-8-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/a56cbafb-36ce-426a-9a56-05d806e821c4/thumbnail/1200x675/15f7e80e1b9d001fdb38bfbf77b864a2/jonathan-taylor-indianapolis-colts-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T14:28:28.000Z",
    "description": "\n        Aaron Rodgers spent the first 18 years of his future Hall of Fame career with the Green Bay Packers. His career comes full circle in NFL Week",
    "body": "\n        Aaron Rodgers spent the first 18 years of his future Hall of Fame career with the Green Bay Packers. His career comes full circle in NFL Week 8 when his Pittsburgh Steelers take on the Packers in Pittsburgh. It will be the first time he has faced the team that drafted him in the first round of the 2005 NFL Draft. The Packers (4-1-1) lead the NFC North, while the Steelers (4-2) are on top of the AFC North. Green Bay enters as a 3-point favorite. Another matchup involving contenders sees the Buffalo Bills (4-2) visiting the Carolina Panthers (4-3). The Bills are 7-point favorites, one of five games with spreads of -7 or more. The largest spread is Tennessee at Indianapolis (-14.5), followed by Chiefs (-11.5) vs. Commanders, as Jayden Daniels (hamstring) has been ruled out.How should you handle those NFL games and optimize what to bet on NFL in Week 8? Before making any Week 8 NFL picks or Week 8 NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 8 NFL betting, the AI PickBot has evaluated the NFL odds and provided NFL betting picks for all 13 games. You can only see the AI predictions for the Week 8 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 8 NFL AI picksAfter analyzing every game in Week 8, the AI says the Colts (-14.5, 48) cover comfortably against the Titans. Daniel Jones has dominated in his first year with Indianapolis. In seven starts with the Colts, he has completed 152 of 214 passes (71%) for 1,790 yards and 10 touchdowns with just three interceptions. He has also rushed 29 times for 83 yards and four scores.Jones had spent his first six seasons with the New York Giants. He was released late last November and signed as a free agent with the Minnesota Vikings, but did not see the field. This offseason, he joined the Colts as a free agent. He has thrown for 225 or more yards in five of seven games. In a 29-28 win over the Denver Broncos on Sept. 14, he completed 23 of 34 passes for 316 yards and one touchdown. He also rushed for a score.SportsLine AI rates a Colts spread cover as an A-rated pick and also predicts a 36-18 win on average. See its other Week 8 football predictions and football picks at SportsLine.How to make Week 8 NFL picksIn addition, the AI PickBot has generated well over 20 highly-coveted A+ picks for Week 8. You need to see the AI's NFL picks before making any Week 8 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 8 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks against the spread, money line and over/under for Week 8 from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/a56cbafb-36ce-426a-9a56-05d806e821c4/thumbnail/1200x675/15f7e80e1b9d001fdb38bfbf77b864a2/jonathan-taylor-indianapolis-colts-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T14:28:28.000Z",
      "dateModified": "2025-10-25T14:28:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]