[
  {
    "title": "Week 9 college football odds, lines, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-odds-week-9-lines-spreads-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/10/25/8b95c192-7fb4-44a9-9dcb-4fad49f7ca95/thumbnail/1200x675/d2a4d73d16238fa5328696cb6283a7d7/deion-sanders-usatsi-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-25T11:05:18.000Z",
    "description": "\n        If looking for ranked contests to make Week 9 college football picks on, you'll have to look at the SEC, as the conference has all three such",
    "body": "\n        If looking for ranked contests to make Week 9 college football picks on, you'll have to look at the SEC, as the conference has all three such matchups. No. 3 Texas A&M vs. No. 20 LSU (+2.5), No. 8 Ole Miss vs. No. 13 Oklahoma (-5.5) and No. 10 Vanderbilt vs. No. 15 Missouri (+2.5) will help shape the conference's hierarchy, but there are intriguing matchups outside of the SEC. The latest Week 9 college football odds have No. 2 Indiana at -26.5 versus UCLA in the Big Ten, No. 9 Miami at -29.5 versus Stanford in the ACC and No. 11 BYU at +2.5 versus Iowa State in the Big 12.The Group of Five shouldn't be overlooked with any college football predictions either with South Florida of the American the highest-ranked team outside the Power Four. The 18th-ranked Bulls are favored by 6 points over a Memphis squad coming off its first defeat, according to the latest Week 9 college football spreads. Before locking in any Week 9 college football picks on those games or others, be sure to see the latest Week 9 college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and Week 9 college football betting lines on the spread, money line, and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Week 9One of the college football picks the model is high on during Week 9: Washington (-3.5, 54.5) covers versus No. 23 Illinois in a 3:30 p.m. ET Saturday kickoff. UW will host this contest, which is important to note as the Huskies have been one of the best home teams versus the spread under Jedd Fisch. Since he took over last year, Washington is 7-3 ATS at home and 6-2 versus the line as a home favorite. Illinois was embarrassed with a 53-point loss at Indiana earlier this year, and the Illini are coming off an 18-point loss -- and failing to cover -- at home versus Ohio State on Saturday. Add in that Washington has defeated Illinois in four straight meetings, and the model has the Huskies (-3.5) covering well over 50% of the time. See which other picks the model likes here.\nAnother prediction: Colorado (+13.5, 48.5) covers against Utah in well over 50% of simulations Saturday at 10:15 p.m. ET. The Buffs upset then-No. 22 Iowa State in Week 7 before their bye, and Colorado is 3-1 ATS following a bye under Deion Sanders. On the other hand, Utah is just 1-5 ATS with a rest disadvantage over the last four seasons, and the Utes lost their AP ranking with a defeat to BYU on Saturday. Utah's once vaunted defense has been exploited in recent weeks as it's allowed an average of 204 rushing yards, and forced zero turnovers, over the last three weeks. With the running ability of Colorado QB Kaidon Salter, who's averaging over 50 yards on the ground with three scores over his last four games, the Buffs have enough offense to stay within the line. The model also predicts the Under hits almost 60% of the time. See the rest of the model's picks here.\nHow to make college football picks for Week 9The model has also made the call on who wins and covers in every FBS matchup in Week 9, and it's calling for multiple upsets, including four underdogs winning straight up. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which four underdogs outright win? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.Week 9 college football odds for notable gamesSee full Week 9 college football picks, odds, predictions here(odds subject to change)Saturday, Oct. 25Ole Miss vs. Oklahoma (-5.5, 52.5)Syracuse vs. Georgia Tech (-17, 52.5)South Florida vs. Memphis (+6, 58.5)Illinois vs. Washington (-3.5, 54.5)Alabama vs. South Carolina (+11.5, 47.5)BYU vs. Iowa State (-2.5, 49.5)Missouri vs. Vanderbilt (-3, 52.5)Stanford vs. Miami (-29.5, 45.5)Texas A&M vs. LSU (+2.5, 49.5)Texas vs. Mississippi State (+7.5, 46.5)Michigan vs. Michigan State (+14, 47.5)Kentucky vs. Tennessee (-8.5, 54.5)Colorado vs. Utah (-13.5, 48.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 9 college football odds, lines, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/10/25/8b95c192-7fb4-44a9-9dcb-4fad49f7ca95/thumbnail/1200x675/d2a4d73d16238fa5328696cb6283a7d7/deion-sanders-usatsi-cbs.jpg"
      ],
      "datePublished": "2025-10-25T11:05:18.000Z",
      "dateModified": "2025-10-25T11:05:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colorado vs. Utah prediction, odds, props, Week 9 college football expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/colorado-utah-prediction-odds-spread-2025-college-football-week-9-picks-prop-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/747a6325-28e6-46d0-a78e-167805e51eca/thumbnail/1200x675/09ad3dc46c48ab2dedba62f7c1385359/deion-sanders-colorado-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-25T11:03:08.000Z",
    "description": "\n        The Colorado Buffaloes (3-4) travel to take on the Utah Utes (5-1) in a Big 12 showdown on Saturday. The Buffs are coming off what was arguab",
    "body": "\n        The Colorado Buffaloes (3-4) travel to take on the Utah Utes (5-1) in a Big 12 showdown on Saturday. The Buffs are coming off what was arguably the program's biggest win under head coach Deion Sanders, when they beat then-No. 22 Iowa State 24-17 on Oct. 11. The Utes are looking to rebound from a hard-fought 24-21 loss to in-state rival BYU in the 2025 'Holy War'. Utah is 5-2, while CU is 4-3 against the spread in 2025.Kickoff from Rice-Eccles Stadium in Salt Lake City is set for 10:15 p.m. ET. The Utes are 13.5-point favorites in the latest Utah vs. Colorado odds, while the over/under for total points scored is 49.5. Before making any Colorado vs. Utah picks, make sure you check out what SportsLine college football expert Jimmie Kaylor has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your initial $5 bet wins + 3 months of NBA League Pass:Kaylor is an NFL, college football and DFS expert for SportsLine, who has covered the NFL and college football for close to a decade as a member of the Pro Football Writers of America. His background as a former college football All-American and NFL player gives him a unique perspective when building his fantasy lineups and locking in his betting picks. He has his finger on the pulse of the college football landscape and has been cashing in big for the last two years. \nKaylor has destroyed the sportsbooks in college football the last two seasons, posting a 257-182-7 record since Week 1 of the 2023 season. His 2024 college football futures picks included Travis Hunter winning the Heisman at 40-1 odds, bringing his net profit up to a whopping 98.5 units ($9,850.50 for a $100 bettor) since joining SportsLine as an expert in 2023.All of his picks have been featured on his SportsLine expert page or in his weekly bylined articles. Anyone who followed his picks could be way up.Now, Kaylor has zoned in on Colorado vs. Utah and just locked in his picks and CFB predictions. You can head to SportsLine now to see his picks. Here are several college football odds and college football betting lines for Utah vs. CU:\nUtah vs. Colorado spreadUtah -13.5 Utah vs. Colorado over/under50.5 pointsUtah vs. Colorado money line Utah -595, Colorado +434Utah vs. Colorado picksSee picks at SportsLineUtah vs. Colorado streaming Fubo (Try for free)Why Utah can coverThe 2025 Utah football team is in the midst of a transitional season under veteran head coach Kyle Whittingham, now in his 21st year. Offensively, the Utes are led by junior quarterback Devon Dampier, who last season ranked 11th in FBS in total offense with 3,934 yards and rushed for 19 touchdowns, the third most among FBS quarterbacks. The Utes also feature sophomore running back Wayshawn Parker, who in 2024 posted 735 rushing yards (5.4 yards per carry). On defense, Utah remains anchored at linebacker with seniors Levani Damuni and Lander Barton providing a veteran core in a 4-2-5 scheme. The Utes are navigating a challenging Big 12 schedule in their second season in the conference, and their success will depend on the continued development of Dampier and the health of their defense. Utah has performed well against the spread this season, going 5-2 thus far. See which team to back at SportsLine. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Why Colorado can coverThe Buffs are also in a transition year under third-year head coach Deion Sanders. Quarterback Kaidon Salter has taken over the QB1 role, throwing for 1,156 yards and nine touchdowns so far this season. On the receiving end, junior wideout Omarion Miller leads the team with 371 receiving yards and four scores, while sophomore running back Micah Welch has picked up 277 ground yards providing a spark in the backfield. DDefensively, the Buffaloes have struggled to find consistency as a unit — the team averages about 361 yards per game on offense but sits near the bottom of several efficiency categories including third-down defense and turnover margin. While Colorado has not yet achieved the success of the 2024 campaign, the infusion of younger talent and the elevated profile of the program hint at better days ahead. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at Fanduel if your $5 bet wins:How to make Colorado vs. Utah picksFor Saturday's Utah vs. CU matchup, Kaylor is leaning Under on the point total, but he also says a critical X-factor makes one side of the spread a must-back. You can only see what it is, and which side to back, at SportsLine. Who covers in Colorado vs. Utah, and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the Utah vs. Colorado spread you need to jump, all from the expert who returned $9,850 to $100 players since the start of the 2023 season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colorado vs. Utah prediction, odds, props, Week 9 college football expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/747a6325-28e6-46d0-a78e-167805e51eca/thumbnail/1200x675/09ad3dc46c48ab2dedba62f7c1385359/deion-sanders-colorado-cbs.jpg"
      ],
      "datePublished": "2025-10-25T11:03:08.000Z",
      "dateModified": "2025-10-25T11:03:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 321 predictions, odds, best bets to consider for Aspinall vs. Gane - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-321-predictions-odds-best-bets-to-consider-for-aspinall-vs-gane/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/8154b77f-36c5-4976-92b9-c5e4da317bca/thumbnail/1200x675/7aa3ade3f2ed6b6887ad6a2b33e2829e/tom-aspinall-presser-title.jpg",
    "tag": "Sports",
    "date": "2025-10-25T01:58:29.000Z",
    "description": "\n        Tom Aspinall makes the first defense of his heavyweight championship in the main event of Saturday's UFC 321 card from Etihad Arena in Abu Dh",
    "body": "\n        Tom Aspinall makes the first defense of his heavyweight championship in the main event of Saturday's UFC 321 card from Etihad Arena in Abu Dhabi. Aspinall, who was promoted from interim to full champion when Jon Jones retired and vacated the title, will defend his title against two-time title challenger Ciryl Gane.Gane failed to capture the title when he lost a decision to Francis Ngannou in 2022 and again when he was quickly submitted by Jones in 2023. Those are the only losses in Gane's career, and he now looks to make good on his third opportunity at gold when he faces Aspinall.Bet UFC 321 at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass with a winning $5 wager:Aspinall has been a force of nature, with only one of his nine UFC fights reaching the end of the first round. His lone UFC loss came when he suffered a freak knee injury just 15 seconds into his 2022 bout with Curtis Blaydes.\n\n        \n            \n                Tom Aspinall over Jon Jones' drama as he preps for first undisputed title defense: 'I just wanted to fight'\n                \n                    Shakiel Mahjouri                \n            \n                            \n    \n                \n                    \n    \nAnother title will be on the line on Saturday when Virna Jandiroba and Mackenzie Dern meet in the co-main event with the vacant women's strawweight title on the line. The fight is a rematch of a 2020 clash that Dern won by decisionIn addition, Umar Nurmagomedov looks to get back to a title opportunity when he takes on streaking contender Mario Bautista. Nurmagomedov, cousin of Hall of Famer Khabib Nurmagomedov, lost his bout with Merab Dvalishvili for the title in January. But it's the lone blemish on an otherwise impeccable resume. UFC CEO Dana White said on Thursday that if Nurmagomedov -- or Bautista -- truly impresses, the winner will get the next shot at the champion, after Dvalishvili takes on Petr Yan in December..After a strong 4-1 night for our best bets for UFC 320 (including hitting on Youssef Zalal via submission at +450), our 2025 record sits at 24-19. We'll look to get our roll going again on Saturday, with our only rule remaining that all bets must be at odds of -250 or better. Let's take a look at this week's picks with odds via DraftKings Sportsbook.\nAleksandar Rakic vs.\tAzamat Murzakanov Aleksandar Rakic moneyline (-112)Rakic has far more experience than Murzakanov against high-level opposition. Of course, Rakic has lost to most of that high-level opposition. That includes a three-fight losing skid against Jan Błachowicz, Jiri Prochazka and Magomed Ankalaev. Ignoring experience under the brightest of lights, Rakic does have an undeniably massive size advantage at 6-foot-5 to Murzakanov's 5-foot-10. Being short for the light heavyweight division hasn't held back Murzakanov, as he has piled up a 15-0 record, with just three fights going to the scorecards. One of those wins was over Dustin Jacoby, who stands 6-foot-4. With the fight basically a pick 'em, we're looking for any edge for either man, and Rakic's ability to utilize his reach in most fights, combined with having a seven-inch reach advantage going into this fight, should be enough of an edge to side with him.Alexander Volkov\tvs.\tJailton AlmeidaAlexander Volkov moneyline (+164)It has to be very frustrating for Volkov to be fighting on the undercard while Gane fights for the title in the main event. After all, Volkov's UFC 310 loss to Gane was seen as an absurd miscarriage of justice by the cageside judges. Had Volkov gotten what is seen as a deserved victory, he would be fighting against Aspinall for UFC gold for the first time since joining the promotion in 2016. Instead of Aspinall, Volkov is set to face Almeida, a grappling specialist who uses a flurry of takedowns to overwhelm opponents before dominating positionally on the ground. The trouble for Almeida is that he'll have to navigate the 80-inch reach from a man who has finally locked in on how powerful a weapon his jab is in recent years. Volkov's wrestling is good, not great, but he should be able to punish Almeida as the Brazilian attempts to close distance and grind for takedowns. This is likely to be a tough fight for both men, but Volkov as an underdog feels like a good line.Umar Nurmagomedov\tvs.\tMario BautistaUmar Nurmagomedov via decision (-165)The line feels off in this fight. Bautista is a genuine pain to fight. In his last three, Bautista nullified Ricky Simon's wrestling, frustrated Jose Aldo on the feet, and ran circles around Patchy Mix. Nurmagomedov has a good deal of hype behind him, but he has shown some vulnerabilities that a fighter like Bautista could exploit. That said, this feels like a fight Nurmagomedov wins, just not one he runs away with. If Nurmagomedov scored a stoppage of Bautista, I'd argue that would be the most impressive accomplishment of his career. Instead, I figure this goes to the scorecards, where Nurmagomedov locks down another shot at Merab Dvalishvili and the bantamweight title in 2026.\nVirna Jandiroba\tvs.\tMackenzie DernFight to go the distance: Yes (-110)I'm a little shocked the fight going the distance is only -110. The two went to a decision in their 2020 battle, and there's not much reason to think either is set to finish the other. Both women are at their best when grappling and somewhat nullify each other in that space. Dern may be the slightly better striker, but she's not spectacular on the feet and sometimes falls in love with trying to be a kickboxer to her own detriment. This feels like a fight that's destined for five somewhat ugly rounds in a division where roughly two-thirds of fights hit the scorecards.Tom Aspinall vs.\tCiryl GaneUnder 1.5 rounds (-105)I don't have much interest in betting this fight beyond the Aspinall moneyline being a nice parlay addition at -345. That line is too high for our Best Bet rules, though, so we have to look elsewhere. Aspinall could win by knockout or submission, making for a tough pick there. I will eliminate Gane winning because I simply think this is a terrible fight for him. He's been outwrestled by Francis Ngannou and his striking, while solid, is not utilized in the same explosive nature as what Aspinall does. Looking for the right odds, we're going to lean with Aspinall continuing to do what he does and getting out of the Octagon quickly.Who will win UFC 321: Aspinall vs. Gane, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 321 predictions, odds, best bets to consider for Aspinall vs. Gane - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/8154b77f-36c5-4976-92b9-c5e4da317bca/thumbnail/1200x675/7aa3ade3f2ed6b6887ad6a2b33e2829e/tom-aspinall-presser-title.jpg"
      ],
      "datePublished": "2025-10-25T01:58:29.000Z",
      "dateModified": "2025-10-25T01:58:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama vs. South Carolina odds, picks, predictions, best bets from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/alabama-south-carolina-prediction-odds-line-time-2025-college-football-week-9-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/55697655-8651-4925-9576-e03af5fafc60/thumbnail/1200x675/c7931e2d5d7ea9c723888b334ed8e662/ty-simpson-alabama-crimson-tide-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-25T10:55:45.000Z",
    "description": "\n        The fourth-ranked Alabama Crimson Tide will look to stay unbeaten in SEC action when they take on the South Carolina Gamecocks on Saturday. A",
    "body": "\n        The fourth-ranked Alabama Crimson Tide will look to stay unbeaten in SEC action when they take on the South Carolina Gamecocks on Saturday. Alabama is coming off a 37-20 win over Tennessee in Week 8, while South Carolina was beaten 26-7 by Oklahoma. The Crimson Tide (6-1, 4-0 SEC), who have won six in a row, are 2-1 on the road this season. The Gamecocks (3-4, 1-4 SEC), who have lost two straight, are 2-2 on their home field in 2025.Kickoff from Williams-Brice Stadium in Columbia, S.C., is at 3:30 p.m. ET. The Crimson Tide are 11.5-point favorites in the latest Alabama vs. South Carolina odds, while the over/under for total points scored is 47.5 via SportsLine consensus. Before making any South Carolina vs. Alabama picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Alabama vs. South Carolina. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for South Carolina vs. Alabama:Alabama vs. South Carolina                                                                                         spreadAlabama -11.5 at DraftKings SportsbookAlabama vs. South Carolina  over/under47.5 pointsAlabama vs. South Carolina                                                                                                         money line Alabama -444, South Carolina +344Alabama vs. South Carolina                                                                                                 picksSee picks at SportsLineAlabama vs. South Carolina                                                                                                   streaming Fubo (Try for free)  Why Alabama can coverJunior Ty Simpson is one of college football's best quarterbacks. In seven games this season, he has completed 153 of 218 passes (70.2%) for 1,931 yards and 18 touchdowns with just one interception and a rating of 170.9. He has also rushed 45 times for 66 yards and two scores. In a 30-14 win over Vanderbilt on Oct. 4, he completed 23 of 31 passes for 340 yards and two touchdowns with one interception.Among his top targets is senior wide receiver Germie Bernard. In seven games, he has 33 receptions for 472 yards (14.3 average) and five touchdowns. In a 73-0 win over Louisiana-Monroe, he caught three passes for 67 yards and two scores. He caught five passes for 82 yards and one touchdown in the win over Vanderbilt. See which team to back at SportsLine. Why South Carolina can coverSophomore quarterback LaNorris Sellers helps power the Gamecocks' offense. For the season, he has completed 90 of 139 passes (64.7%) for 1,134 yards and five touchdowns and two interceptions with a rating of 142.3. He also has carried 84 times for 108 yards and one touchdown. In a 29-20 loss at Missouri on Sept. 20, he completed 18 of 28 passes for 302 yards and two touchdowns.Sophomore Vandrevius Jacobs is South Carolina's top receiver. He leads the Gamecocks with 21 receptions for 343 yards (16.3 average) and two touchdowns. In a 29-20 loss at Missouri on Sept. 20, he caught seven passes for 128 yards and one touchdown. He had five catches for 108 yards, including a long of 59, in a 35-13 win over Kentucky on Sept. 27. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Alabama vs. South Carolina picksSportsLine's model is going Under on the total, projecting 43 combined points. It also says one side of the spread hits in over 50% of simulations.     You can only get the pick at SportsLine. So who wins Alabama vs. South Carolina, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Alabama vs. South Carolina spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama vs. South Carolina odds, picks, predictions, best bets from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/55697655-8651-4925-9576-e03af5fafc60/thumbnail/1200x675/c7931e2d5d7ea9c723888b334ed8e662/ty-simpson-alabama-crimson-tide-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-25T10:55:45.000Z",
      "dateModified": "2025-10-25T10:55:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas A&M vs. LSU odds, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-a-m-lsu-prediction-odds-line-time-2025-college-football-week-9-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/368ffe49-fb85-4cad-909a-eaf88e14b416/thumbnail/1200x675/4a443d39fb4131d8e5bf563d64f65177/garrett-nussmeier-lsu-tigers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T10:58:21.000Z",
    "description": "\n        The third-ranked Texas A&M Aggies clash with the 20th-ranked LSU Tigers in a key SEC matchup on Saturday night. Texas A&M is coming off a 45-",
    "body": "\n        The third-ranked Texas A&M Aggies clash with the 20th-ranked LSU Tigers in a key SEC matchup on Saturday night. Texas A&M is coming off a 45-42 win at Arkansas in Week 8, while LSU will look to rebound from a 31-24 loss at Vanderbilt. The Aggies (7-0, 4-0 SEC), who are tied with Alabama for first in the conference, are 2-0 on the road this season. The Tigers (5-2, 2-2 SEC), who are 1-2 against ranked teams, are 4-0 on their home field in 2025.Kickoff from Tiger Stadium in Baton Rouge, La., is at 7:30 p.m. ET. LSU leads the all-time series 35-21-3. The Aggies are 2.5-point favorites in the latest Texas A&M vs. LSU odds, while the over/under for total points scored is 49.5 via SportsLine consensus. Before making any Texas A&M vs. LSU picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Texas A&M vs. LSU. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for LSU vs. Texas A&M:Texas A&M vs. LSU spreadTexas A&M -2.5 at DraftKings SportsbookTexas A&M vs. LSU  over/under49.5 pointsTexas A&M vs. LSU                                                                                                             money line Texas A&M -138, LSU +117Texas A&M vs. LSU                                                                                                     picksSee picks at SportsLineTexas A&M vs. LSU                                                                                                       streaming Fubo (Try for free)  Why Texas A&M can coverSophomore quarterback Marcel Reed helps lead the Aggies' offense. In seven games, he has completed 125 of 202 passes (61.9%) for 1,770 yards and 15 touchdowns with four interceptions and a rating of 156.0. He also has carried 51 times for 241 yards (4.7 average) and four touchdowns. In last week's win over Arkansas, he completed 23 of 32 passes for 280 yards and three touchdowns. He also carried six times for 55 yards and a score.Among A&M's top receivers is sophomore Mario Craver. In seven games, he has 36 receptions for 674 yards (18.7 average) and four touchdowns. He has also rushed four times for 46 yards (11.5 average) and one touchdown. In a 42-24 win over UTSA on Aug. 30, he caught eight passes for 122 yards and two touchdowns. See which team to back at SportsLine. Why LSU can coverThe Tigers' offense is powered by senior quarterback Garrett Nussmeier. He is in his fifth season at LSU, and has completed 154 of 232 passes (66.4%) for 1,638 yards and 11 touchdowns with five interceptions and a rating of 137.0. He has also rushed for one score. In last week's loss at Vanderbilt, he completed 19 of 28 passes for 225 yards and two touchdowns.One of his top targets is senior wide receiver Barion Brown. In seven games, he has 32 receptions for 301 yards (9.4 average) and one touchdown. In a 56-10 win over Southeast Louisiana on Sept. 20, he caught five passes for 54 yards (10.8 average) and one touchdown. He had eight catches for 94 yards, including a long of 19, in a 23-7 win over Louisiana Tech. He also carried once for 15 yards. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Texas A&M vs. LSU picksSportsLine's model is going Over on the total, projecting 58 combined points. It also says one side of the spread hits in nearly 60% of simulations.     You can only get the pick at SportsLine. So who wins LSU vs. Texas A&M, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the Texas A&M vs. LSU spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas A&M vs. LSU odds, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/368ffe49-fb85-4cad-909a-eaf88e14b416/thumbnail/1200x675/4a443d39fb4131d8e5bf563d64f65177/garrett-nussmeier-lsu-tigers-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T10:58:21.000Z",
      "dateModified": "2025-10-25T10:58:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 321 odds, props, predictions, fight card: Aspinall vs. Gane expert picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-321-odds-props-predictions-fight-card-aspinall-gane-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/0f4639a6-d823-424b-a107-2bcd60ff8e8b/thumbnail/1200x675/708e1fd7a5b944d44a2f26c873ae9e80/ciryl-gane-mma-ufc-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-24T22:10:52.000Z",
    "description": "\n        The UFC heavyweight championship will be on the line on Saturday when champion Tom Aspinall takes on No. 1 contender Ciryl Gane at UFC 321: A",
    "body": "\n        The UFC heavyweight championship will be on the line on Saturday when champion Tom Aspinall takes on No. 1 contender Ciryl Gane at UFC 321: Aspinall vs. Gane. Aspinall first won the interim UFC heavyweight championship with a knockout of Sergei Pavlovich at UFC 295 in November 2023, and defended the title with a knockout of Curtis Blaydes at UFC 304 in July 2024. He was promoted to undisputed champion on June 21, 2025. Gane is coming off a split decision win over Alexander Volkov at UFC 310 last December. The main card from Etihad Arena at Yas Island/Yas West, United Arab Emirates is set to begin at 2 p.m. ET.Aspinall enters as the favorite at -380 (risk $380 to win $100), while Gane is the underdog at +300 in the latest UFC 321: Aspinall vs. Gane odds at DraftKings Sportsbook. In the co-main event, Mackenzie Dern is the -165 favorite against Virna Jandiroba (+140) in a women's strawweight championship bout. Before locking in any UFC 321: Aspinall vs. Gane picks, make sure you see the MMA predictions and betting advice from SportsLine expert Daniel Vithlani.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Vithlani is a highly-analytical UFC bettor who has been a consistent winner for SportsLine members since making his debut in January 2023 with a 5-0 record for UFC 283. In fact, he's up over $1,500 on his UFC main-card sports betting picks.His other highlights include calling an upset for Sean O'Malley (+210) against Aljamain Sterling (-250) at UFC 292 as part of a 4-1 main card and his UFC 299 winners included underdog selections on Dustin Poirier (+190) against Benoit Saint Denis (-230) and Michael Page (+110) against Kevin Holland (-130). Anyone who has followed him at sportsbooks and on betting apps could be way up.Now, Vithlani has studied Tom Aspinall vs. Ciryl Gane     from every angle and revealed his top betting picks and best bets. Head to SportsLine to see them. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Aspinall vs. Gane preview Aspinall, 32, has been on a roll. He's won 11 of his last 12 bouts, including a redemption win over Blaydes, who had defeated Aspinall at UFC Fight Night: Blaydes vs. Aspinall in July 2022. He turned pro in December 2014 in Manchester, England, and made his UFC debut in July 2020. For his career, he is 15-3 overall with 12 wins by knockout and three by submission. Aspinall is a highly decorated fighter, earning Performance of the Night honors seven times, which is tied for the fourth-most in UFC history. He has the shortest average fight time in UFC history at 2:02, and has the second-most knockdowns per 15 minutes at 4.09. In 2020, he ranked ninth for UFC Newcomer of the Year, and was No. 3 for UFC Submission of the Year in 2022. In 2024, he earned two MMA awards – Breakthrough Fighter of the Year and Comeback of the Year. Check out SportsLine to see his picks and analysis.Gane, 35, who fights out of Paris, France, began his professional fight career in August 2018. He earned knockout wins in his first three bouts, catching the attention of UFC. He made his promotional debut in August 2019, earning a submission win over Raphael Pessoa at UFC Fight Night: Shevchenko vs. Carmouche 2. He went on to win his first 10 matches of his career, including a third-round knockout of Derrick Lewis to win the interim UFC heavyweight championship and Performance of the Night honors in August 2021.In 15 career matches, he has compiled a 13-2 mark. He has six wins by knockout, three by submission and four by decision. He was the UFC second-ranked Newcomer of the Year in 2019, and was the No. 3 Fighter of the Year in 2021. In 2022, he had the seventh-ranked Fight of the Year with a third-round knockout of Tai Tuivasa at UFC Fight Night: Gane vs. Tuivasa. You can only see his picks and analysis at SportsLine. UFC 321: Aspinall vs. Gane predictionsWe'll reveal one of Brasco's UFC 321: Aspinall vs. Gane selections here: Jose Delgado (-150) to defeat Nathaniel Wood (+125) in a featherweight matchup on the preliminary card.\"Delgado is a rising featherweight prospect who looks to be legit,\" Vithlani said. \"Training out of MMA Lab gym, Delgado is a rangy and explosive striker who throws nasty knees and elbows. In his last fight, Delgado knocked out a fighter with great durability in under 30 seconds. Standing 5-foot-11 with a 73-inch reach, Delgado is big for the weight class and will have a considerable size advantage. Wood is a tactical kickboxer with strong UFC experience, and he will provide a step-up in competition for Delgado. However, I don't think he'll be able to outpoint Delgado for three rounds. Delgado is the more dangerous and aggressive fighter, and he's never been finished in his young 10-1 pro career. I think Delgado's size and pressure will win him this fight.\" You can make this pick at FanDuel, where new users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. UFC 321: Aspinall vs. Gane main fight card, oddsVithlani has strong picks for Aspinall vs. Gane and other bouts on the UFC 321: Aspinall vs. Gane card. He's also backing a fighter who \"will use a physicality and wrestling edge\" to pull off a massive victory. He's sharing who it is only at SportsLine.Who wins UFC 321: Aspinall vs. Gane, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.UFC 321: Aspinall vs. Gane main fight card, odds See picks at SportsLine.(Odds subject to change)Tom Aspinall (-380) vs. Ciryl Gane (+300)Virna Jandiroba (+140) vs. Mackenzie Dern (-165)Umar Nurmagomedov (-550) vs. Mario Bautista (+410)Alexander Volkov (+190) vs. Jailton Almeida (-230)Aleksandar Rakic (+100) vs. Azamat Murzakanov (-120)                  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 321 odds, props, predictions, fight card: Aspinall vs. Gane expert picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/0f4639a6-d823-424b-a107-2bcd60ff8e8b/thumbnail/1200x675/708e1fd7a5b944d44a2f26c873ae9e80/ciryl-gane-mma-ufc-imagn-images.jpg"
      ],
      "datePublished": "2025-10-24T22:10:52.000Z",
      "dateModified": "2025-10-24T22:10:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minnesota vs. Iowa odds, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/minnesota-iowa-prediction-odds-spread-2025-week-9-college-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/3fd70c61-5e38-4076-bc89-8c3eccea2396/thumbnail/1200x675/4b428e9c26633c5594acdac8f69fa558/mark-gronowski-iowa-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-25T10:39:18.000Z",
    "description": "\n        The Minnesota Golden Gophers (5-2, 3-1) visit the Iowa Hawkeyes (5-2, 3-1) for a Big Ten showdown in college football Week 9 on Saturday. Bot",
    "body": "\n        The Minnesota Golden Gophers (5-2, 3-1) visit the Iowa Hawkeyes (5-2, 3-1) for a Big Ten showdown in college football Week 9 on Saturday. Both teams are riding two-game winning streaks after defeating in-conference competition. The Hawkeyes emerged from their Week 7 bye to shut out Wisconsin 37-0 and come from behind to beat Penn State 25-24. Meanwhile, the Gophers rallied to beat Purdue 27-20, then upset Nebraska in Week 8 24-6.Kickoff from Kinnick Stadium is set for 3:30 p.m. ET on CBS and Paramount+. The Hawkeyes are 8.5-point favorites in the latest Minnesota vs. Iowa odds, and the over/under for total points scored is 39.5. Before making any Iowa vs. Minneosta picks, be sure to see what the SportsLine projection model has to say. Be sure to watch this game on CBS or Paramount+, where new users can get a free one-week trial. Sign up here.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Iowa vs. Minnesota. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for Minnesota vs. Iowa in Week 9:Minnesota vs. Iowa spreadIowa -8.5 at DraftKings SportsbookMinnesota vs. Iowa over/under39.5 pointsMinnesota vs. Iowa money line Iowa -341, Minnesota +269Minnesota vs. Iowa picksSee picks at SportsLineMinnesota vs. Iowa streaming Paramount+ (Get 7 days free)Why Minnesota can coverThe Week 8 win against the Cornhuskers was easily the Gophers' best game of the season as the PJ Fleck's offensive line cleared the way for freshman quarterback Drake Lindsey to complete 80% of his passes and get into the end zone once. Minnesota's run defense is especially sturdy and is allowing just 97.7 yards on the ground per game. Running back Darius Taylor also scored a touchdown in that game after rushing for a season-high 148 yards, so he is expected to keep the Iowa defense busy. See which team to back at SportsLine. Why Iowa can coverThe Hawkeyes are 4-2-1 ATS this season and has covered the spread in seven of their last 13 games overall. They have also won nine of the last 10 in the head-to-head series. Defense will be key, and the Iowa defense has forced five takeaways overs its last two games. Quarterback Mark Gronowski hasn't thrown a touchdown pass since Week 3 but has run the ball into the end zone at least once in every game this season, and he could help pressure a Minnesota run defense that is only allowing 97.7 yards per game. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Iowa vs. Minnesota picksFor Minnesota vs. Iowa in Week 9, the model is leaning Over the total, and also says one side of the spread is the better value. See what it is at SportsLine.Who wins Minnesota vs. Iowa, and which side of the spread is the better value? Visit SportsLine now to see which side of the Iowa vs. Minnesota spread you need to jump, all from the model that is a combined 42-30 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota vs. Iowa odds, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/3fd70c61-5e38-4076-bc89-8c3eccea2396/thumbnail/1200x675/4b428e9c26633c5594acdac8f69fa558/mark-gronowski-iowa-imagn-cbs.jpg"
      ],
      "datePublished": "2025-10-25T10:39:18.000Z",
      "dateModified": "2025-10-25T10:39:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Vesia left off Dodgers' World Series roster as reliever deals with 'deeply personal family matter' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-world-series-roster-alex-vesia/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/5e5ca408-a146-4c86-9b18-989151d5ebf1/thumbnail/1200x675/603f820f516a65125b658256c29bd3d5/vesia-getty.png",
    "tag": "Sports",
    "date": "2025-10-24T22:23:48.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Dodgers reliever Alex Vesia is not on ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Dodgers reliever Alex Vesia is not on the club's World Series roster as he deals with what the team characterized Thursday as \"a deeply personal matter\" within his family. Manager Dave Roberts told reporters Friday ahead of Game 1 versus the Blue Jays that Vesia \"most likely\" won't participate in the series.\"I think that's probably the most likely,\" Roberts said. \"Unless something unforeseen happens, that's kind of what we're anticipating.\"Vesia is not on family medical emergency list, Dodgers president of baseball operations Andrew Friedman confirmed. If he were on the list, Vesia could be activated later in the World Series. As it is, he can be added only to replace an injured player.\"We just didn't want to have any potential for any kind of pressure,\" Friedman said Friday before Game 1. \"This is so much bigger than baseball. For us, it was doing whatever small part we could to just a hundred percent be supportive.Here is the club's Thursday statement in full: \"It's with a heavy heart that we share that Alex Vesia is away from the team as he and his wife Kayla navigate a deeply personal family matter. The entire Dodgers organization is sending our thoughts to the Vesia family, and we will provide an update at a later date.\"This year, the 29-year-old left-hander made 68 appearances for the Dodgers during the regular season with an ERA of 3.02 and 80 strikeouts and 19 unintentional walks in 59 ⅔ innings. During the team's current playoff run, Vesia has a 3.86 ERA in 4 ⅔ innings. Over that span, he's allowed a run in only one of his seven appearances. Vesia has been a reliable fixture in the Dodger bullpen since they acquired him from the Miami Marlins via trade in February of 2021. \nGame 1 of the World Series is scheduled for Friday in Toronto at 8 p.m. ET.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Vesia left off Dodgers' World Series roster as reliever deals with 'deeply personal family matter' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/5e5ca408-a146-4c86-9b18-989151d5ebf1/thumbnail/1200x675/603f820f516a65125b658256c29bd3d5/vesia-getty.png"
      ],
      "datePublished": "2025-10-24T22:23:48.000Z",
      "dateModified": "2025-10-24T22:23:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Syracuse vs. Georgia Tech odds, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/georgia-tech-syracuse-prediction-odds-line-start-time-2025-college-football-week-9-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/6bd8ed91-c760-4892-9703-77d9b1f1756d/thumbnail/1200x675/1ae392ed9e9d3f240fd14311ec517d9e/haynes-king-georgia-tech-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T10:08:10.000Z",
    "description": "\n        The Syracuse Orange look to get back on track when they take on the seventh-ranked Georgia Tech Yellow Jackets in an ACC matchup on Saturday.",
    "body": "\n        The Syracuse Orange look to get back on track when they take on the seventh-ranked Georgia Tech Yellow Jackets in an ACC matchup on Saturday. Georgia Tech is coming off a 27-18 win at Duke, while Syracuse dropped a 30-13 decision to Pittsburgh in Week 8. The Orange (3-4, 1-3 ACC), who have lost three in a row, are 1-1 on the road this season. The Yellow Jackets (7-0, 4-0 ACC), who lead the conference and are one of three unbeaten teams in the league, are 4-0 on their home field. Kickoff from Bobby Dodd Stadium in Atlanta is at noon ET. The Yellow Jackets are 17-point favorites in the latest Syracuse vs. Georgia Tech odds, while the over/under for total points scored is 52.5 via SportsLine consensus. Before making any Georgia Tech vs. Syracuse picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Syracuse vs. Georgia Tech. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Georgia Tech vs. Syracuse:Syracuse vs. Georgia Tech                                                                                         spreadGeorgia Tech -17 at DraftKings SportsbookSyracuse vs. Georgia Tech                       over/under52.5 pointsSyracuse vs. Georgia Tech                                                                                                       money line Georgia Tech -901, Syracuse +585Syracuse vs. Georgia Tech                                                                                               picksSee picks at SportsLineSyracuse vs. Georgia Tech                                                                                                 streaming Fubo (Try for free)  Why Georgia Tech can coverSenior dual-threat quarterback Haynes King helps power the Yellow Jackets' offense. In six games, he has completed 108 of 153 passes (70.6%) for 1,176 yards and four touchdowns with one interception. He has also carried 101 times for 560 yards and 10 touchdowns. In last week's win over Duke, he completed 14 of 21 passes for 205 yards, including a long of 49. He also rushed 14 times for 120 yards (8.6 average) and one touchdown.Senior running back Jamal Haynes has carried 81 times for 409 yards (5.0 average) and three touchdowns. He also caught 16 passes for 136 yards (8.5 average), including a long of 34. In a 45-24 win over Temple on Sept. 20, he carried 12 times for 107 yards, while catching four passes for 39 yards. He caught nine passes for 92 yards and two touchdowns in a 59-12 win over Gardner Webb on Sept. 6. See which team to back at SportsLine. Why Syracuse can coverJunior quarterback Steve Angeli suffered a torn Achilles tendon against Clemson on Sept. 20 and will be out the rest of the season. Taking over for him has been sophomore Rickie Collins. In parts of five games, he has completed 68 of 127 passes (53.5%) for 733 yards with five touchdowns and eight interceptions. He has also rushed 30 times for 102 yards (3.4 average) and one touchdown. In last week's loss to Pittsburgh, he completed 15 of 31 passes for 126 yards and two touchdowns with three interceptions.Also helping power the Orange in the passing game is junior wide receiver Johntay Cook. He is in his first season with the program after two years at Texas. In seven games this season, he has 37 receptions for 456 yards (12.3 average) and two touchdowns. He also has one carry for 18 yards. In a 34-21 win at Clemson on Sept. 20, he caught six passes for 113 yards, including a long of 59. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Syracuse vs. Georgia Tech picksSportsLine's model is going Over on the total, projecting 60 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Syracuse vs. Georgia Tech, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Syracuse vs. Georgia Tech spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Syracuse vs. Georgia Tech odds, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/6bd8ed91-c760-4892-9703-77d9b1f1756d/thumbnail/1200x675/1ae392ed9e9d3f240fd14311ec517d9e/haynes-king-georgia-tech-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T10:08:10.000Z",
      "dateModified": "2025-10-25T10:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Manchester United vs. Brighton live stream, where to watch online: Things are changing at Old Trafford - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/manchester-united-vs-brighton-live-stream-where-to-watch-online-things-are-changing-at-old-trafford/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/00834a93-352a-4df6-8913-fe71fe23a006/thumbnail/1200x675/82471fbb6c0cca764ca2214e08d9b8eb/untitled-design-2025-10-25t112411-401.png",
    "tag": "Sports",
    "date": "2025-10-25T09:30:36.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \nHosting Brighton at Old Trafford, Manchester United have a",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \nHosting Brighton at Old Trafford, Manchester United have an opportunity to do something that they haven't done in Ruben Amorim's 51 games in charge: win three Premier League matches in a row. While the Red Devils have one three-match winning streak in all competitions under Amorim from January 23 - 30, 2025, that included two Europa League group stage matches.Sitting ninth in the Premier League, after toppling Sunderland and Liverpool, a victory here would be a strong signal that the Red Devils are beginning to turn a corner as they work back to being European contenders. The insertion of Mason Mount into the starting XI has made a difference in helping improve the press, but that will be put to the test against Brighton. New keeper Senne Lammers has also shined since taking the starting role between the sticks, which is improving the defense.How to watch Manchester United vs. Brighton, oddsDate: Saturday, Oct. 25 | Time: 12:30 p.m. ETLocation: Old Trafford -- Manchester, EnglandTV: NBC | Live stream: Fubo (try for free)Odds: Manchester United -105; Draw +290; Brighton +250Only Crystal Palace have more expected goals than Manchester United's 15.46, but the Red Devils have only scored 11 goals from that figure, which sits at the middle of the pack. The problem for United, in addition to their somewhat wayward finishing is that their defense allowed an xG of 12.25. It's easy to see where improvement could come from. All that said, last season United had a goal difference of -10 while finishing 15th in the league, so they are definitely moving in the right direction.Small improvements will help move the squad forward, and each win makes the next one easier. Plenty of investment was put into the squad during the summer, and there are still holes in midfield, but defeating Brighton would be another step in the right direction. Since United lost in the Europa League final, tangible positives that reflect the squad's improvement have been hard to find under Amorim, and this is their first chance at one in a while. Brighton only have two wins in their last five matches, sitting right behind United in the table at 10th. Only two points off a top four spot without playing in Europe, if United can go on a run this season, who knows where they could end up. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Manchester United vs. Brighton live stream, where to watch online: Things are changing at Old Trafford - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/00834a93-352a-4df6-8913-fe71fe23a006/thumbnail/1200x675/82471fbb6c0cca764ca2214e08d9b8eb/untitled-design-2025-10-25t112411-401.png"
      ],
      "datePublished": "2025-10-25T09:30:36.000Z",
      "dateModified": "2025-10-25T09:30:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ole Miss vs. Oklahoma prediction, odds, line, picks, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-oklahoma-prediction-odds-college-football-week-9-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/19/0702020b-28b4-4d29-91b5-b23d50e03a7c/thumbnail/1200x675/964b9a052a279813db3795bdc59e19dd/john-mateer-oklahoma-sooners-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T10:02:25.000Z",
    "description": "\n        The No. 8 Ole Miss Rebels (6-1) and the No. 13 Oklahoma Sooners (6-1) link up on Saturday afternoon in a critical SEC matchup with both confe",
    "body": "\n        The No. 8 Ole Miss Rebels (6-1) and the No. 13 Oklahoma Sooners (6-1) link up on Saturday afternoon in a critical SEC matchup with both conference and College Football Playoff implications. The Rebels had their six-game win streak halted last weekend in a 43-35 loss at Georgia. Meanwhile, Oklahoma took down South Carolina 26-9. Oklahoma lists running back Jovantae Barnes and defensive back Gentry Williams as doubtful.Kickoff from the Gaylord Family-Oklahoma Memorial Stadium in Norman, Okla., is at noon ET. The Sooners are 5.5-point favorites in the latest Ole Miss vs. Oklahoma odds, while the over/under for total points scored is 52.5 via SportsLine consensus. Before making any Oklahoma vs. Ole Miss picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Ole Miss vs. Oklahoma. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Ole Miss vs. Oklahoma:Ole Miss vs. Oklahoma             spreadSooners -5.5 at DraftKings SportsbookOle Miss vs. Oklahoma                       over/under52.5 pointsOle Miss vs. Oklahoma                       money line Sooners -202, Rebels +168Ole Miss vs. Oklahoma               picksSee picks at SportsLineOle Miss vs. Oklahoma                 streaming Fubo (Try for free)  Why Ole Miss can coverLane Kiffin's offense has been dynamic all season long. They are third in the SEC in total offense (491.9) and fourth in scoring offense (37.4). Senior quarterback Trinidad Chambliss has stepped in at quarterback following an early-season ankle injury to Austin Simmons, and has 1,549 passing yards with eight passing touchdowns. He's thrown for 250-plus passing yards and a passing score in five straight games. Sophomore running back Kewan Lacy comes into this game third in the SEC in rushing yards (618) and second in rushing touchdowns (10). The Texas native has three games with 100-plus rushing yards and a score this season. He found the end zone twice last week. See which team to back at SportsLine. Why Oklahoma can coverJunior quarterback John Mateer is a dual-threat playmaker under center. Mateer has 1,567 passing yards, 209 rushing yards and 12 total touchdowns. The main target in the passing game has been junior receiver Isaiah Sategna III. He has 37 catches for 493 receiving yards and four touchdowns. In his last outing, Sategna III had 73 receiving yards and a score. Senior defensive linemen R Mason Thomas is getting into the backfield, leading the team in sacks (5.5) with 20 total tackles. Oklahoma is 1-0 ATS against ranked opponents and 3-2-1 ATS as the favorite in 2025. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Ole Miss vs. Oklahoma picksSportsLine's model is going Under on the total, projecting 49 combined points. It also says one side of the spread hits in nearly 70% of simulations. You can only get the pick at SportsLine. So who wins Ole Miss vs. Oklahoma, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Ole Miss vs. Oklahoma spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ole Miss vs. Oklahoma prediction, odds, line, picks, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/19/0702020b-28b4-4d29-91b5-b23d50e03a7c/thumbnail/1200x675/964b9a052a279813db3795bdc59e19dd/john-mateer-oklahoma-sooners-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T10:02:25.000Z",
      "dateModified": "2025-10-25T10:02:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Series schedule: Blue Jays vs. Dodgers Game 2 prediction, time, pitchers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/world-series-schedule-dodgers-blue-jays-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/2f54546c-01ba-4c3e-81f2-a4bc33e65ff3/thumbnail/1200x675/a938428dda6eafc8dd7fb00a38a3eaf8/jays-ohtani-dodgers-getty.png",
    "tag": "Sports",
    "date": "2025-10-25T03:57:48.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If the Los Angeles Dodgers are to become the first",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If the Los Angeles Dodgers are to become the first back-to-back World Series champions since the 1998-2000 New York Yankees, they will have to go through the Toronto Blue Jays. The Blue Jays have a 1-0 lead in the 2025 Fall Classic after running away with Game 1 on Friday night. The Jays exploded for a nine-run sixth inning on Friday, and they'll host Game 2 on Saturday.The Jays punched their ticket to the Fall Classic with a Game 7 win over the Seattle Mariners on Monday night as George Springer hit a game-winning home run. This is Toronto's first World Series appearance since 1993, when they won their second consecutive title. The Dodgers thoroughly dismantled the Milwaukee Brewers, owners of MLB's best record during the regular season, in the NLCS to return to the World Series. They are the first defending champion to reach the World Series the next season since the 2008-09 Philadelphia Phillies, and, in more than a few ways, this year's Dodgers are better than last year's.Yoshinobu Yamamoto will be on the mound for the Dodgers in Game 2 as L.A. tries to bounce back from just its second loss of the postseason. Kevin Gausman gets the ball for the Blue Jays.The Blue Jays (94-68) are the home team over the Dodgers (93-69) in the World Series because they had the better regular-season record. Here now is the schedule for the 2025 World Series. All games can be streamed on fubo (try for free).\nHow to watch Game 2Time: 8 p.m. ET | Date: Saturday, Oct. 25Location: Rogers Centre -- TorontoTV channel: Fox, Fox Deportes | Live stream: fubo (Try for free)Starting pitchers: RHP Kevin Gausman (TOR) vs. RHP Yoshinobu Yamamoto (LAD)Series odds: Dodgers -110, Blue Jays -110 (via DraftKings)\n 2025 World Series schedule Game \t\t\t\t \t\t\t\t \t\t\t\tDate \t\t\t\t \t\t\t\t \t\t\t\tStart time/scoreVenue \t\t\t\t \t\t\t\t \t\t\t\tTV \t\t\t\t \t\t\t\t \t\t\t\t1 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tFri. Oct. 24 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tTOR 11, LAD 4Rogers CentreFox \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t2 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tSat. Oct. 25 \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t8 p.m. ET \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\tRogers CentreFox \t\t\t\t \t\t\t\t \t\t\t\t \t\t\t\t3 \t\t\t\tMon. Oct. 27 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t4 \t\t\t\tTues., Oct. 28 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t5 (if nec.) \t\t\t\tWed., Oct. 29 \t\t\t\t8 p.m. ET \t\t\t\tDodger StadiumFox \t\t\t\t6 (if nec.) \t\t\t\tFri., Oct. 31 \t\t\t\t8 p.m. ET \t\t\t\tRogers CentreFox \t\t\t\t7 (if nec.) \t\t\t\tSat., Nov. 1 \t\t\t\t8 p.m. ET \t\t\t\tRogers CentreFoxGame 2 storylinesDodgers: The Dodgers will try to avoid falling into an 0-2 hole. Yamamoto will be making his fourth start of the postseason, having previously surrendered four runs across 19 ⅔ innings pitched. He's struck out 18 batters versus issuing just four walks in those outings.Blue Jays: The Blue Jays will attempt to take a 2-0 advantage in the best-of-seven series. MLB teams to do that have then, historically, won more than 80% of those sets. Toronto is looking for the franchise's first World Series title since winning consecutive championships in 1992-93.\nGame 2 predictionThe hope is that this series goes seven games and that they're mostly nailbiters. With that in mind, we'll have Yamamoto delivering and tying the series at 1-1 ahead of the locale shift to Los Angeles. Dodgers win 3-2. -- R.J. Anderson\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Series schedule: Blue Jays vs. Dodgers Game 2 prediction, time, pitchers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/2f54546c-01ba-4c3e-81f2-a4bc33e65ff3/thumbnail/1200x675/a938428dda6eafc8dd7fb00a38a3eaf8/jays-ohtani-dodgers-getty.png"
      ],
      "datePublished": "2025-10-25T03:57:48.000Z",
      "dateModified": "2025-10-25T03:57:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boise State vs. Nevada odds, picks, predictions, bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/boise-state-nevada-prediction-odds-2025-week-9-college-football-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/f66d2148-3d1c-4148-a2d6-66e91d78f045/thumbnail/1200x675/4d3ee130d3f72cdd40c28f502331655b/madsen-gaines-boise-state-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-24T23:45:35.000Z",
    "description": "\n        Conference rivals on opposite ends of the Mountain West standings square off as the Boise State Broncos (5-2, 3-0) visit the Nevada Wolf Pack",
    "body": "\n        Conference rivals on opposite ends of the Mountain West standings square off as the Boise State Broncos (5-2, 3-0) visit the Nevada Wolf Pack (1-6, 0-3) in college football Week 9 action on Friday. Boise State tops the Mountain West and is coming off of a big 56-31 win against UNLV. Meanwhile, the Wolf Pack occupy the conference cellar and are looking for their first victory since Week 2 against Sacramento State. Kickoff from Mackay Stadium is set for 10 p.m. ET on CBS Sports Network. The Broncos are 21-point favorites in the latest Boise State vs. Nevada odds, and the over/under for total points scored is 50.5. Before making any Nevada vs. Boise State picks, be sure to see what the SportsLine projection model has to say.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Nevada vs. Boise State. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for Boise State vs. Nevada in Week 9:Boise State vs. Nevada spreadBoise State -21 at DraftKings SportsbookBoise State vs. Nevada over/under50.5 pointsBoise State vs. Nevada money line Boise State -1724, Nevada +948Boise State vs. Nevada picksSee picks at SportsLineBoise State vs. Nevada streaming Fubo (Try for free)  Why Boise State can coverThe Broncos are 5-1-1 ATS this season, and three of their wins have been by more than 22 points. The offense leads the Mountain West with 478.6 average yards per game and is holding opposing quarterbacks to 189.7 passing yards. Starting quarterback Maddux Madsen is coming off of a four-touchdown day against the Rebels where he also threw for 253 yards, and he should comfortably move the ball down field against a mediocre Nevada passing defense. Boise State's defense is allowing 351.3 total yards and 26.1 points per game but is expected to contain a weak Wolf Pack offense. See which team to back at SportsLine. Why Nevada can coverThe Wolf Pack might be struggling overall, but they are still 3-4-0 ATS this season and have covered the spread in two of their last three games. That includes covering in a 24-22 loss to New Mexico as 13.5-point underdogs in Week 8. Nevada also covered as a 42.5-point underdog against Penn State in Week 1. Over three home games this season, the Wolf Pack has held two opponents to under 20 points. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Nevada vs. Boise State picksFor Boise State vs. Nevada in Week 9, the model is leaning over the total, and also says one side of the spread hits in well over 50% of simulations. See what it is at SportsLine.Who wins Boise State vs. Nevada, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Nevada vs. Boise State spread you need to jump, all from the model that is a combined 42-30 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boise State vs. Nevada odds, picks, predictions, bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/f66d2148-3d1c-4148-a2d6-66e91d78f045/thumbnail/1200x675/4d3ee130d3f72cdd40c28f502331655b/madsen-gaines-boise-state-imagn-cbs.jpg"
      ],
      "datePublished": "2025-10-24T23:45:35.000Z",
      "dateModified": "2025-10-24T23:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA gambling scandal: Adam Silver makes first public comments, says he was 'deeply disturbed' by allegations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-gambling-scandal-adam-silver-makes-first-public-comments-says-he-was-deeply-disturbed-by-allegations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/28ce5d20-f59d-4b52-b799-09714470cec7/thumbnail/1200x675/ccc6f3337d34375740addb80240fcc67/102425-adamsilver.jpg",
    "tag": "Sports",
    "date": "2025-10-25T01:36:32.000Z",
    "description": "\n        NBA commissioner Adam Silver was at Madison Square Garden on Friday night for the New York Knicks' matchup with the Boston Celtics, and durin",
    "body": "\n        NBA commissioner Adam Silver was at Madison Square Garden on Friday night for the New York Knicks' matchup with the Boston Celtics, and during the second quarter he appeared on the Amazon broadcast to make his first public comments about the gambling scandal that has rocked the league. \"My initial reaction was I was deeply disturbed,\" Silver said. \"There's nothing more important to the league and its fans than the integrity of the competition. I had a pit in my stomach. It was very upsetting.\"On Thursday, Miami Heat guard Terry Rozier, Portland Trail Blazers coach Chauncey Billups and former player and coach Damon Jones were arrested by the FBI as part of a wide-ranging investigation into illegal sports betting and rigged poker games.\n        \n            \n                NBA gambling scandal, explained: What to know as Chauncey Billups, Terry Rozier get arrested, suspended\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nThe Department of Justice filed two separate indictments, one relating to illegal sports betting and one relating to rigged poker games. Rozier was only named in the betting indictment, while Jones was named in both. Billups was only directly named in the poker indictment, but a person matching his description was mentioned in the betting indictment. The illegal sports betting allegations are more concerning for the NBA, because they put the integrity of the sport in question. According to the DOJ, Rozier and his co-defendants \"participated in a scheme to defraud the Betting Companies by providing, obtaining and using non-public information relating to NBA games to place and cause others to place fraudulent sports wagers for profit, and to launder the proceeds thereof.\" \nOne of the most damning allegations centered on Rozier's actions during a March 2023 game when he was still playing for the Charlotte Hornets. Rozier is said to have told people close to him that he was planning to leave the game early, and members of the betting ring then placed multiple prop bets totaling more than $200,000 on his unders. Rozier ended up playing just nine minutes and 34 seconds, and his unders cashed. The NBA was alerted to unusual activity relating to prop bets on Rozier at the time of the game in question. The league conducted its own investigation, but found no violation of NBA rules. When news broke in January that Rozier was under federal investigation, the league said it would cooperate with law enforcement. On Friday, Silver gave an extended explanation for why Rozier had previously been cleared by the league:\n\"Because bets were placed through legal betting companies, they picked up abberational behavior around a particular game in March of '23. So that was brought to our attention by the regulators and the betting company. We then looked into that situation, and we were very transparent about it. While there was that abberational betting, we frankly couldn't find anything. \"Terry, at the time, cooperated and gave the league office his phone. He sat down for an interview. We ultimately concluded that there was insufficient evidence -- despite that abberational behavior -- to move forward. We then worked directly with law enforcement -- as they said at the press conference, the league has been cooperating. That was obviously over two years ago. The federal government has subpoena power, can threaten to put people in jail, can do all kinds of things that the league office can't do. We've been working with them since then.\"Billups and Rozier have both been placed on indefinite leave. Tiago Splitter has been named the interim coach of the Trail Blazers in Billups' place. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA gambling scandal: Adam Silver makes first public comments, says he was 'deeply disturbed' by allegations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/28ce5d20-f59d-4b52-b799-09714470cec7/thumbnail/1200x675/ccc6f3337d34375740addb80240fcc67/102425-adamsilver.jpg"
      ],
      "datePublished": "2025-10-25T01:36:32.000Z",
      "dateModified": "2025-10-25T01:36:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Jays' supporting cast comes through in World Series Game 1 in blowout victory over Dodgers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/blue-jays-dodgers-world-series-game-1-barger-varsho-clement-kirk-lukes-gimenez/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/fcf1ba73-61c4-464c-a207-da87a8bb5524/thumbnail/1200x675/af159b2d1afea1f23720ef718828c12c/clement-getty.png",
    "tag": "Sports",
    "date": "2025-10-25T04:02:25.000Z",
    "description": "\n        Something shook loose for the Toronto Blue Jays' lineup in late May. They turned into an offensive force. And while the star power was there ",
    "body": "\n        Something shook loose for the Toronto Blue Jays' lineup in late May. They turned into an offensive force. And while the star power was there with Vladimir Guerrero Jr., a Bo Bichette bounce-back and in a renaissance season from George Springer, what really made this group hum was the supporting cast. The main characters were great, of course, but the contributions from the rest of the roster is what truly made the Blue Jays a scary offense, top to bottom. That was on full display in Game 1 of the World Series, an 11-4 blowout victory over the defending champion Dodgers.The big blast of the game was a pinch-hit grand slam from Addison Barger, the first in World Series history. What illustrates depth better than something like this happening? \nBarger entered the season with only 225 career MLB plate appearances and he was a .197/.250/.351 (68 OPS+) hitter. He took 502 plate appearances in the 2025 regular season, hitting .243/.301/.454 with 32 doubles and 21 home runs. He hit 20 home runs in 377 at-bats against right-handed pitchers, but usually struggled against lefties and regularly avoided seeing them. Here, he came through with one of the biggest blows in World Series history against a left-hander in Anthony Banda.\"To be honest with you, I don't even remember,\" Barger said after the game when asked what he was thinking about while rounding the bases. He said it was a \"blackout moment.\" Nathan Lukes had pinch hit earlier in the inning and drew a bases-loaded walk after falling behind on an 0-2 count. He fouled off four pitches during that plate appearance. His walk made it 4-2 Blue Jays. It really sums up the Blue Jays depth that they used two pinch hitters in one of the biggest innings in World Series history.\nLukes was not a top prospect. He wasn't ever really even a prospect. A seventh-round pick in 2015, Lukes spent 10 years in the minors. He was just about to hang up the cleats for good before finally getting a shot. He's now 31 years old. In 135 games this season, he hit .255/.323/.407. In the playoffs, he's found a home in the second spot in the batting order, hitting between Springer and Guerrero. In the ALDS and ALCS, Lukes hit .333/.381/.410 with seven RBI in 11 games.The Blue Jays actually trailed Game 1 of the World Series Friday night, 2-0, heading to the bottom of the fourth inning. Daulton Varsho -- named after his dad's former teammate Darren Daulton, who was the catcher during Joe Carter's 1993 World Series walk-off home run in this ballpark -- clubbed a two-run shot. \nThat was the first home run Blake Snell allowed to a lefty since June 2 of last season and that was to the great Juan Soto. Snell hadn't even given up a single hit to a left-handed hitter so far in the 2025 playoffs.\nVarsho, whose father Gary spent time as a fourth outfielder with the Cubs, Pirates, Phillies and Reds and transitioned to an MLB scouting role, was a second-round pick out of Wisconsin-Milwaukee in 2017. He came up through the minors mostly as a catcher and was traded to the Jays by the Diamondbacks in exchange for Gabriel Moreno and Lourdes Gurriel Jr. Today, Varsho is one of the best defensive center fielders in baseball, an amazing feat for a minor-league catcher. Varsho was hurt for a good amount of the 2025 season, but he hit 20 home runs in just 71 games, slugging .548. He was a monster against the Yankees in the ALDS, going 7 for 16 with three doubles, two homers, four RBI and seven runs in four games.Two innings after Varsho tied the game, Ernie Clement's bases-loaded single in the bottom of the sixth gave the Blue Jays the lead for the first time in a World Series game since Carter's home run in 1993. That single kickstarted the all-time great, nine-run inning; only two innings in World Series history (the 1968 Tigers and 1929 Athletics) have ever seen a team score more runs.Clement was a fourth-round pick in 2017. He was claimed off waivers by the A's from Cleveland and then released in the spring of 2023 before signing a minor-league deal with the Blue Jays. This year, he put together a quiet 4.3-WAR season, serving as a utility infielder. In the first two rounds of the playoffs, he hit .429/.444/.619 with seven RBI and 10 runs in 11 games. \nBetween Barger, Varsho, Clement, Lukes, catcher Alejandro Kirk -- he's a two-time All-Star, but I think he still qualifies as \"supporting cast\" on this team -- and shortstop Andrés Giménez, the Blue Jays got eight hits, all 11 RBI and nine runs scored from their non-stars. Remember, Giménez hit a pair of game-changing, two-run home runs in the ALCS in Seattle. Though he was quiet in Game 1, Davis Schneider is another supporting cast guy who has come through often for the Blue Jays this season.Here in World Series Game 1, Kirk hit a two-run home run after the game was probably already in hand, but he needs to be spotlighted as well. A squatty 5-foot-8, 245 pounds, Kirk certainly doesn't look like a modern professional athlete, but he's a very good player. He went 3 for 3 with a walk and home run Friday night, following a .282/.348/.421 (111 OPS+) season. Much like the rest of the supporting cast, he wasn't setting the world on fire or anything, but having steady producers throughout the lineup is what made the Blue Jays a great offense in the regular season.\nIn fact, they were one of the best offenses in all of 2025, leading the majors in batting average. It was May 29 when they really started to pour it on, though. From that game through the end of the season, the Blue Jays hit .279/.342/.455, compared to the league average this season of .245/.315/.404. The league average runs per game was 4.45. From May 29 until the end of the regular season, the Blue Jays scored 5.5 runs a game. In that time span, the Jays were first in batting average, second in on-base percentage and first in slugging percentage. Bichette, Guerrero and Springer had great years. The aforementioned bounce-back from Bichette and renaissance from Springer were integral, as was the All-Star season from Guerrero. This was not, however, a top-heavy team. It's a deep team. And it was on display in Game 1 of the World Series.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Jays' supporting cast comes through in World Series Game 1 in blowout victory over Dodgers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/fcf1ba73-61c4-464c-a207-da87a8bb5524/thumbnail/1200x675/af159b2d1afea1f23720ef718828c12c/clement-getty.png"
      ],
      "datePublished": "2025-10-25T04:02:25.000Z",
      "dateModified": "2025-10-25T04:02:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]