[
  {
    "title": "Clemson vs. Louisville prediction, odds: Week 12 ACC picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/clemson-louisville-prediction-odds-time-week-12-college-football-friday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/79330270-2cd7-4f3a-8069-14971080d2d1/thumbnail/1200x675/53a52e56dd23021c228e0049b826b3b3/usatsi-27072592-1.jpg",
    "tag": "Sports",
    "date": "2025-11-14T11:13:38.000Z",
    "description": "\n        The 15th-ranked Louisville Cardinals look to keep their conference championship hopes alive when they battle the Clemson Tigers in a key ACC ",
    "body": "\n        The 15th-ranked Louisville Cardinals look to keep their conference championship hopes alive when they battle the Clemson Tigers in a key ACC matchup on Friday. Clemson is coming off a 24-10 win over Florida State, while Louisville looks to rebound from a 29-26 loss to California last Saturday. The Tigers (4-5, 3-4 ACC), who are 10th in the conference standings, are 2-1 on the road this season. The Cardinals (7-2, 4-2 ACC), who are sixth in the league, are 4-2 on their home field in 2025.Kickoff from L&N Federal Credit Union Stadium in Louisville, Ky., is at 7:30 p.m. ET. Clemson leads the all-time series 8-1, but Louisville won last year's meeting 33-21. The Cardinals are 2.5-point favorites in the latest Clemson vs. Louisville odds, while the over/under for total points scored is 51.5 via SportsLine consensus. Before making any Louisville vs. Clemson picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Clemson vs. Louisville. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Louisville vs. Clemson:Clemson vs. Louisville                                                                                         spreadLouisville -2.5 at DraftKings SportsbookClemson vs. Louisville                                                                                     over/under51.5 pointsClemson vs. Louisville                                                                                                                                                                                                     money line Louisville -129, Clemson +108Clemson vs. Louisville                                                                                                                                                                                             picksSee picks at SportsLineClemson vs. Louisville                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make Clemson vs. Louisville picksSportsLine's model is going Over on the total (51.5). The Tigers have gone over in four of the past six games, while the Cardinals have gone over in six of their last 10. Clemson quarterback Cade Klubnik is projected to pass and run for a pair of touchdowns, while Louisville signal caller Miller Moss is projected to pass for more than 220 yards and two touchdowns, while rushing for another. The teams combine for 54 points as the Over clears in well over 50% of simulations. The model also says one side of the spread hits more than 50% of the time. You can only get the pick at SportsLine. So who wins Clemson vs. Louisville, and which side of the spread hits more than 50% of the time? Visit SportsLine now to see which side of the Clemson vs. Louisville spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clemson vs. Louisville prediction, odds: Week 12 ACC picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/79330270-2cd7-4f3a-8069-14971080d2d1/thumbnail/1200x675/53a52e56dd23021c228e0049b826b3b3/usatsi-27072592-1.jpg"
      ],
      "datePublished": "2025-11-14T11:13:38.000Z",
      "dateModified": "2025-11-14T11:13:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coppin State vs. Central Michigan prediction, odds: 2025 Showdown in St. Pete picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/central-michigan-coppin-state-odds-prediction-time-2025-showdown-in-st-pete-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/4e2d2346-e80b-4350-b950-501b2b6488b5/thumbnail/1200x675/3c337b75db90211b5d83a57e8767375c/larry-stewart-coppin-state-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-14T11:03:07.000Z",
    "description": "\n        The Central Michigan Chippewas will look to rebound when they battle the Coppin State Eagles in the second of three games at the inaugural Sh",
    "body": "\n        The Central Michigan Chippewas will look to rebound when they battle the Coppin State Eagles in the second of three games at the inaugural Showdown in St. Pete Tournament on Friday morning. Central Michigan opened the event with a 66-64 loss to South Alabama on Thursday. The Eagles (0-4), who are coming off a 100-50 loss at South Florida on Wednesday, finished seventh in the Mid-Eastern Athletic Conference at 4-10 and were 6-24 overall in 2024-25. The Chippewas (1-2), who finished tied for ninth in the Mid-American Conference at 7-11 and 14-17 overall last year, are 0-2 at neutral sites over the past two years.Tipoff from the McArthur Center in St. Petersburg, Fla., is set for 11 a.m. ET. This will be the first-ever meeting between the teams. Central Michigan is a 9.5-point favorite in the latest Central Michigan vs. Coppin State odds from SportsLine consensus, while the over/under for total points scored is 144.5. Before making any Coppin State vs. Central Michigan picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every college basketball game 10,000 times and has returned over $2,200 in betting profit for $100 players on its top-rated college basketball picks over the past three seasons. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen huge returns.    Now, the model has simulated Coppin State vs. Central Michigan 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Coppin State vs. Central Michigan:Coppin State vs. Central Michigan                         spread:    Central Michigan -9.5Coppin State vs. Central Michigan         over/under:    144.5 pointsCoppin State vs. Central Michigan                                       money line:    Central Michigan -571, Coppin State +417Coppin State vs. Central Michigan                                       picks:    See picks at SportsLineCoppin State vs. Central Michigan                                       streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Coppin State vs. Central Michigan picksSportsLine's model is going Under on the total (144.5 points). The under is 5-5 in both the Eagles' and Chippewas' last 10 games. The SportsLine model says no Coppin State player will score more than 7.8 points on average, while just one Central Michigan player will be in double-figure scoring. Rodney Johnson Jr. is projected to lead the Chippewas with a projection of 12.7 points. The Under clears in nearly 70% of simulations. The model also says one side of the spread hits in nearly 70% of simulations. You can only get the pick at SportsLine. So who wins Central Michigan vs. Coppin State, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Coppin State vs. Central Michigan spread to back, all from the advanced model was profitable on top-ranked college basketball picks last season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coppin State vs. Central Michigan prediction, odds: 2025 Showdown in St. Pete picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/4e2d2346-e80b-4350-b950-501b2b6488b5/thumbnail/1200x675/3c337b75db90211b5d83a57e8767375c/larry-stewart-coppin-state-imagn-images.jpg"
      ],
      "datePublished": "2025-11-14T11:03:07.000Z",
      "dateModified": "2025-11-14T11:03:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Purdue makes case to return to No. 1 with road win at No. 8 Alabama - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/purdue-boilermakers-alabama-crimson-tide-braden-smith/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/2d635a23-70fc-41d1-925c-b9f6c144d80a/thumbnail/1200x675/0c93569985c8890c538e0938bea68879/gettyimages-2246025032-1.jpg",
    "tag": "Sports",
    "date": "2025-11-14T04:28:06.000Z",
    "description": "\n        No major conference team in college basketball is playing with more pace and operating with a more modernized offense -- prioritizing, like m",
    "body": "\n        No major conference team in college basketball is playing with more pace and operating with a more modernized offense -- prioritizing, like many an NBA team, 3-pointers and layups as their primary shot diet -- than the Alabama Crimson Tide. But on Thursday night it was ironically an old-school attack from No. 2 Purdue -- a deliberate halfcourt offense with high-level execution, control in the paint and punishing physicality -- that dealt the No. 8 Tide their first defeat of the young season.The final: Purdue 87, Alabama 80. Purdue scored the win as road underdogs and in the process proved it should not have been underdogs in this game -- and, perhaps, should not be underdogs in any game this season -- because of its inside-out star power and quality of depth. Braden Smith was the main attraction in this one: He finished with 29 points, four assists and seven boards. But co-star Trey Kaufman-Renn in his first appearance of the season coming off injury was highly effective, too, turning in 19 points, 15 boards and a game-high five assists. \n        \n            \n                First assessments of college basketball's top portal hauls: Grades for Kentucky, St. John's and more\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \nAlabama coach Nate Oats said earlier this week Kaufman-Renn \"had his way\" with Alabama's frontcourt last November when he went for 26 points and eight boards and downed the Crimson Tide in West Lafayette. It was more of the same Thursday this time in Tuscaloosa. Kaufman-Renn made a team-high nine field goals, had a plus-minus of +20 to lead both teams and was a key component in maximizing Purdue's potent weapons around him.Contrasting stylesStyles make fights in college basketball and that's why Thursday's battle between these two top-10 teams was such a rare treat. Alabama leads the country in adjusted tempo among major conference teams, and its offensive style under Oats is simple: Take a 3-pointer or a layup, or find someone else who will. The sight of a shot chart where a player's toe is on the 3-point line physically makes Oats wince.\nPurdue's approach is much more nuanced. Its adjusted pace is seventh-slowest in the sport according to KenPom.com data. Its focus isn't just on 3-pointers and layups but rather on clean looks. Coach Matt Painter, as Oats said this week, has \"a gazillion sets and different counters to everything they do.\" The result is this beauty of a shot chart below that couldn't be much more different. Purdue on the right, you can see, took shots from deep, shots at the rim, shots around the elbows -- and everywhere in between. Alabama took almost exclusively 3-pointers, layups or shots inside the painted area. The two attempts outside the paint that weren't 3-pointers will undoubtedly be called out in film review as no-nos. I'd bet a dollar on it. Maybe even two.Purdue won with its own less modern approach Thursday but that is in no way a suggestion Alabama should consider tweaking its own attack. It didn't result in a win on this night because Purdue is a great college basketball team and it got great performances from its best players. But Alabama under Oats is 13-7 in games his team has attempted 40 or more 3-pointers. Two of those losses were in overtime, two of those losses were to Purdue, and three were games in which Bama was an underdog in the betting market by tipoff.\nThat's a long way to say: Oats' formula is a winning one. You don't get the Tide to a Final Four by happenstance and luck.Still, Purdue's operation was as efficient as a NASCAR pit crew. This game was not an indictment on Alabama's style but instead an ode to the goodness of Purdue's. It outscored Alabama 30-22 in the paint, won the battle on the boards 52 to 28 (!!!!) and pulled down 19 offensive rebounds -- helping it to 16 second-chance points in a category that may have been the deciding factor in the outcome.Purdue also made 23 2-point shots to Alabama's 12. Of those 23 for Purdue, six were layups and two were dunks. \n\"The tougher team won tonight,\" Oats said. \"They outrebounded us by 24. That's embarrassing.\"Purdue's key to victoryPainter and his staff are accustomed to, and keenly aware of, what Alabama wants to accomplish on offense. They've seen this team in three straight years now and have seen the dynamism of their outside shooting. So ironically, Painter after the game said Purdue's plan in this one -- against a team heavily reliant on 3s and highly successful in making them -- was to force the ball outside of the painted area and make them win on the perimeter.\"We wanted to square the ball [defensively] and keep it in front of us,\" Painter said. \"But we didn't want to give their big guys slips. We saw in their last game they got so many layups. We wanted to keep it on the perimeter. They took 44 3s. ... But at the end of the day, outside of Holloway, nobody really got away from us.\"\nOats' initial postgame assessment of Alabama's struggles -- outside of the obvious issues rebounding the ball -- was more or less the same. \"They collapsed heavy,\" he said. \"When they collapse as heavy as they did, they're going to give up 3s, and we got up 44. So they packed it in pretty tight and tried to keep it out of the lane.\"Purdue primed to jump to No. 1Despite a 2-0 start to its season, Purdue, the preseason No. 1 team in college basketball, was demoted to No. 2 earlier this week in the first in-season AP Top 25 poll of the season. It is just the second preseason No. 1 team in college basketball in two decades to fall from the No. 1 spot despite not suffering a loss. (The other: Kansas in 2018-19 fell from No. 1, leapfrogged by the RJ Barrett and Zion Williamson-led Duke Blue Devils.)\nI expect voters will rectify the mistake come Monday and push Purdue back to the top spot.With Kaufman-Renn back in the lineup this Purdue team is as formidable as we expected it'd be at full strength. A win over a top-10 road team that just days earlier defeated a top-five team on the road is an incredible feat. \"They're tough,\" Oats said. \"They deserved to win the game. In sports, it's nice when the team that deserves to win, wins. And they deserved to win this one tonight.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Purdue makes case to return to No. 1 with road win at No. 8 Alabama - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/2d635a23-70fc-41d1-925c-b9f6c144d80a/thumbnail/1200x675/0c93569985c8890c538e0938bea68879/gettyimages-2246025032-1.jpg"
      ],
      "datePublished": "2025-11-14T04:28:06.000Z",
      "dateModified": "2025-11-14T04:28:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FSU's Ethan Pritchard out of rehab after shooting, seeks return to football - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/florida-state-ethan-pritchard-rehab-shooting-return/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/61e84bfe-e53f-40dc-aa80-054cc33f52e7/thumbnail/1200x675/e7209fda4b92d46aad7004fe42867be3/gettyimages-2233235287-1.jpg",
    "tag": "Sports",
    "date": "2025-11-14T03:38:40.000Z",
    "description": "\n        Florida State freshman Ethan Pritchard is on his way home for the first time since an Aug. 31 shooting left him critically injured. The Semin",
    "body": "\n        Florida State freshman Ethan Pritchard is on his way home for the first time since an Aug. 31 shooting left him critically injured. The Seminoles linebacker was released from a rehabilitation facility in Jacksonville on Thursday, marking another milestone in his recovery from the incident. He had been in rehab for over a month following his Oct. 9 release from Tallahassee Memorial Hospital.Pritchard gave his first interview since the shooting and reflected on the incident and his road to recovery. He said he remembers everything that occurred leading up to the shooting and that his ultimate goal is to return to the football field.\"It started off with me waking [my father] up at 1:30 in the morning just moving my arm,\" Pritchard said of his recovery. \"When I first got here, I couldn't even move my whole right side. It started off with that, and then after that, it just got better and better.\"\nOne day after Florida State's season-opening win over Alabama, Pritchard was shot in the back of the head in what law enforcement said was a case of mistaken identity. The incident occurred in Havana, Florida, while Pritchard was driving family members home from a gathering. Pritchard said he heard shots ring out and put the car in reverse before blacking out.Authorities arrested four suspects in connection with the shooting. Three men -- Jayden Bodison, Caron Miller and Germany Atkins -- and an unnamed minor face three counts of attempted murder and one count of shooting into an occupied vehicle. Atkins was also charged with a count of probation violation.\nFlorida State players and coaches visited Pritchard during his hospital stay, and when he was released, they gathered at the facility to cheer him on as he departed for the rehab center. Seminoles coach Mike Norvell paid a visit earlier on, just after Pritchard opened his eyes for the first time.\"It was something that was emotional for everybody, to be honest with you,\" Norvell said. \"It's still a long part of the progress in this process moving forward, but it puts all things in perspective -- the appreciation of a blink.\"Florida State honored Pritchard, a true freshman and three-star recruit in the 2025 class, at its first game following the incident. The linebackers' teammates carried his jersey to midfield for the coin toss, among other tributes.\nPritchard, a Sanford Seminole product, was a longtime Florida State recruiting target and signed with the program over offers from a number of Power Four programs including perennial College Football Playoff contenders such as Miami, Notre Dame and Tennessee. He suited up for the season opener against Alabama but did not play any snaps.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FSU's Ethan Pritchard out of rehab after shooting, seeks return to football - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/61e84bfe-e53f-40dc-aa80-054cc33f52e7/thumbnail/1200x675/e7209fda4b92d46aad7004fe42867be3/gettyimages-2233235287-1.jpg"
      ],
      "datePublished": "2025-11-14T03:38:40.000Z",
      "dateModified": "2025-11-14T03:38:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 11 final picks: Jameis Winston to spark Giants? Eagles vulnerable? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-11-final-picks-predictions-odds-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/ce0919e5-3778-4b64-92cd-e4de127e9ef0/thumbnail/1200x675/bb3f036de62dbac2bd17c982a9a12d64/jam.jpg",
    "tag": "Sports",
    "date": "2025-11-14T10:00:47.000Z",
    "description": "\n        I truly believe NFL Week 11 could go down as the best week of the regular season. We get the Tampa Bay Buccaneers at the Buffalo Bills, a rem",
    "body": "\n        I truly believe NFL Week 11 could go down as the best week of the regular season. We get the Tampa Bay Buccaneers at the Buffalo Bills, a rematch of that magical matchup between Joe Flacco and Aaron Rodgers from a few weeks ago, a battle between the two best teams in the NFC with the Seattle Seahawks and Los Angeles Rams, and a \"Sunday Night Football\" showdown between the Detroit Lions and Philadelphia Eagles.As for my picks, I'm really close to just saying ignore the top picks and follow the \"Other Week 11 picks\" at the bottom. Or just follow who I have winning straight up. I'm 83-66 against the spread and a ridiculous 103-45-1 straight up while being 23-27 on my top picks. I'm sorry, but I thought the Carolina Panthers could cover the spread against the worst against-the-spread team in the NFL last week and that the Pittsburgh Steelers could take advantage of one of the worst offensive lines in the league. Nope.Here's a look at what I'm thinking this week. As always, credit to the CBS Sports research team for making me sound smart. \nTop five picks ATS record: 23-27Overall ATS record: 83-66Straight up record: 103-45-1All odds via FanDuel Sportsbook. Bet NFL Week 11 games on FanDuel and get $150 in bonus bets with a winning $5 wager.Washington Commanders at Miami Dolphins (-2.5) (Madrid)Sunday, 9:30 a.m. ET (NFL Network, Stream: Fubo, try for free)\nThe Commanders have lost four straight games by 21 points, which tied the longest single-season streak since 1970. I don't care that Dan Quinn is taking over defensive play-calling duties from Joe Whitt, because this secondary can't cover anyone and Daron Payne has been suspended after punching Amon-Ra St. Brown in the face.Washington hasn't covered the spread in five straight games, which is the longest active streak in the NFL. With the number under a field goal, I'll take the team that just upset Josh Allen and the Bills. De'Von Achane is already one of the most explosive players in NFL history, and Jaylen Waddle has looked great as well.\nThe pick: Dolphins -2.5Projected score: Dolphins 23-17Green Bay Packers (-7) at New York Giants Sunday, 1 p.m. ET (Fox, Stream: Fubo, try for free)\nThis was a great week for the Giants. Not only did Brian Daboll get fired, but the team promoted Jameis Winston over Russell Wilson. With Mike Kafka now in charge, it's time for the interim bump!The Tennessee Titans didn't get the interim bump when they fired Brian Callahan earlier this year, but that's just because they're the Tennessee Titans. This Giants team has some talent, and I'm excited to see what Winston can do to spark the offense. I'm not going to take New York to win this game straight up, but I'm going to take the Giants to cover the spread vs. a team that lost to the Panthers in Week 9 and then scored just seven points at home in prime time on Monday night. The Packers are 1-6 against the spread over the last seven games.The pick: Giants +7Projected score: Packers 21-20\n        \n            \n                The Giants' next coach will determine whether Jaxson Dart becomes a franchise savior or just another statistic\n                \n                    Ryan Wilson                \n            \n                            \n    \n                \n                    \n    \nSan Francisco 49ers (-3) at Arizona CardinalsSunday, 4:05 p.m. ET (Fox, Stream: Fubo, try for free)\nThis pick is more fading the Cardinals because of their injuries. The past few days have been disastrous for the wide receiving corps, as Zay Jones tore his Achilles, Marvin Harrison Jr. is recovering from appendicitis and Simi Fehoko suffered an arm injury that landed him on injured reserve. That means Michael Wilson, Greg Dortch, Xavier Weaver and Andre Baccellia are the only healthy receivers for Jacoby Brissett. \nIt's ironic since the 49ers have been the walking wounded all year, but their injury report is actually shorter than Arizona's! The Cardinals have won just one of their last seven games, while the 49ers are 3-0 against the spread following a loss this season. The pick: 49ers -3Projected score: 49ers 27-20Detroit Lions at Philadelphia Eagles (-2.5)Sunday, 8:20 p.m. ET (NBC, Stream: Fubo, try for free)\nI've said it several times this week. When it comes to this game, I'm taking the more explosive team. I'm taking the Lions to outscore the Eagles -- who managed just one touchdown last week against the Packers. A.J. Brown is complaining about the offense, and I would be too. The Lions are an NFL-best 12-6 against the spread as an underdog over the past four seasons, and Dan Campbell has the best cover percentage (65%) by a head coach since 1970. Detroit is also an NFL-best 13-2 in prime time over the last four seasons. I simply have more faith in the Lions' weapons with Jahmyr Gibbs, Sam LaPorta, Amon-Ra St. Brown and Jameson Williams.\nThe pick: Lions +2.5Projected score: Lions 33-28Dallas Cowboys (-3.5) at Las Vegas RaidersMonday, 8:15 p.m. ET (ESPN, Stream: Fubo, try for free)\nThis will be the first time the Cowboys take the field without their brother Marshawn Kneeland following his tragic passing. This Dallas defense has been one of the worst units in the NFL this season, but I bet it has its most impressive performance of the year in Vegas to honor its teammate. Similar to Lions at Eagles, I'm going to take the better offense to simply outscore the other. Dallas has averaged the most points per game (29.2) by a team with a negative point differential (-14) through nine games in NFL history. Can Geno Smith and Ashton Jeanty keep up? The Raiders have scored 29 points just once all season. I believe Dak Prescott's group comes out firing and covers the spread. The pick: Cowboys -3.5Projected score: Cowboys 28-21Other Week 11 picksPatriots (-12.5) 30-10 over JetsFalcons (-3.5) 21-16 over PanthersChargers (-3) 24-20 over JaguarsSteelers 28-24 over Bengals (+5.5)Bills 29-27 over Buccaneers (+5.5)Vikings (-2.5) 28-23 over BearsTexans (-5.5) 24-17 over TitansRams (-3) 30-24 over SeahawksRavens (-7.5) 27-17 over BrownsChiefs 24-21 over Broncos (+3.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 11 final picks: Jameis Winston to spark Giants? Eagles vulnerable? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/ce0919e5-3778-4b64-92cd-e4de127e9ef0/thumbnail/1200x675/bb3f036de62dbac2bd17c982a9a12d64/jam.jpg"
      ],
      "datePublished": "2025-11-14T10:00:47.000Z",
      "dateModified": "2025-11-14T10:00:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Patriots vs. Jets: Live stream, prediction, preview for 'TNF' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-jets-vs-patriots-tv-channel-live-stream-and-preview-for-tnf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/035fbb1c-ffb2-47da-a4b7-b266f71f15df/thumbnail/1200x675/2fac90a24227206c5e6afeb92455efac/patriots.jpg",
    "tag": "Sports",
    "date": "2025-11-14T01:20:57.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    New England looks to make it eight straight wins on Thursday night\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 13, 2025\n                            \n                    at\n    8:11 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Two AFC East rivals kick off NFL Week 11, as Drake Maye and the New England Patriots host Aaron Glenn's New York Jets in Foxborough, Massachusetts. The Patriots are coming off an impressive 28-23 upset victory over the Tampa Bay Buccaneers, while the Jets defeated the Cleveland Browns, 27-20.(Follow live updates on Jets vs. Patriots!)The 8-2 Patriots are arguably the hottest team in the NFL, having won seven straight games. One more victory would mark New England's first eight-game winning streak since the Tom Brady era. Like the dynasty of old, the Patriots are powered by a talented defense and a star quarterback. Maye is tied with Matthew Stafford in having the best MVP odds entering Week 11.Bet Patriots vs. Jets at FanDuel Sportsbook, where new users get $150 in bonus bets with a winning $5 wager. Claim your bonus here:As for the 2-7 Jets, not much has gone right in Glenn's first season at the helm, but the Jets have won back-to-back games following an 0-7 start. Also New York has won two of the last three meetings with New England, so you never know what could happen in this league and with this rivalry.\nWhere to watch Patriots vs. Jets liveDate: Thursday, Nov. 13 | Time: 8:15 p.m. ETLocation: Gillette Stadium -- Foxborough, MassachusettsStream: PrimeFollow: CBS Sports AppOdds: Patriots -12.5; O/U 43.5 (via FanDuel)Jets vs. Patriots: Need to knowRookies are making an impact. The main headline from New England's win in Tampa was the impact made by first-year players. The Patriots became the first team to have rookies score three 50-yard touchdowns from scrimmage since 1998. TreVeyon Henderson had 55-yard and 69-yard touchdowns, while Kyle Williams caught a 72-yard touchdown pass. Henderson has finally arrived, as he recorded 150 yards from scrimmage.More of that special special teams play. The Jets couldn't have defeated the Browns last week without special teams. They became the first NFL team since 2017 to have a kick return touchdown and punt return touchdown in the same game, and the first team since 2011 to have back-to-back possessions with a kick return touchdown and punt return touchdown. Kene Nwangwu ran back a kick 99 yards for a touchdown in the first quarter, then Isaiah Williams ran back a 74-yard punt return touchdown following a Browns three-and-out. Speaking of special teams, we have to give a shoutout to kicker Nick Folk as well. He's one of two kickers to have not missed a field goal this season, going a perfect 19 of 19. He hasn't missed an extra point yet either. The Jets will need good play from special teams if they want to upset the Patriots. Mike Vrabel's historic start. The former NFL Coach of the Year is tied in having the best 10-game start for a coach who inherited a 13-loss team in NFL history. Andy Reid started 9-2 in his first season with the Kansas City Chiefs, and finished 11-5. Four for IV. The Jets aren't known for their defense, but Will McDonald IV racked up four sacks vs. the Browns last week. He became the first Jet to record four sacks in a game since John Abraham in 2001! No other Jets player has more than 2.5 sacks this season. Jets vs. Patriots prediction, pick\nThere's too much going against the Jets in this matchup. The defense has recorded just one takeaway all season, Justin Fields has thrown fewer than 60 yards in three out of his last four starts and Garrett Wilson is expected to miss a few weeks with his knee injury. I don't believe the Patriots will win this game by 40 points, but I'll take them at -12.5. Pick: Patriots -12.5; Under 43.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Patriots vs. Jets: Live stream, prediction, preview for 'TNF' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/035fbb1c-ffb2-47da-a4b7-b266f71f15df/thumbnail/1200x675/2fac90a24227206c5e6afeb92455efac/patriots.jpg"
      ],
      "datePublished": "2025-11-14T01:20:57.000Z",
      "dateModified": "2025-11-14T01:20:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cardi B welcomes baby boy into the world with Patriots' Stefon Diggs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cardi-b-welcomes-baby-boy-patriots-stefon-diggs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/87ce1c3f-31d4-46d7-a644-da04bed4cf61/thumbnail/1200x675/e644efa7de46ef300b7b56c090156240/cardi.jpg",
    "tag": "Sports",
    "date": "2025-11-14T02:19:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Grammy Award-winning rapper Cardi B announced on T",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Grammy Award-winning rapper Cardi B announced on Thursday night that she recently welcomed her fourth child to the world. The father of this baby boy is New England Patriots wide receiver Stefon Diggs, and the news broke to the public just as Diggs was taking the field for the Patriots' prime-time game against the New York Jets.It's unclear when Cardi B actually had the child, but she confirmed with an Instagram post that she had a newborn, and said on her Instagram story that it was a baby boy. Check it out, here:\n\n\"My life has always been a combination of different chapters and different seasons. My last chapter was the beginning of a new season. Starting over is never easy but it's been so worth it! I brought new music and a new album to the world! A new baby into my world, and one more reason to be the best version of me, one more reason to love me more than anything else or anyone else so I can continue giving my babies the love and life they deserve. This next chapter is Me vs. Me! It's me against all odds me against everything meant to get in my way. I've started prepping for tour getting my body right getting my mind right. There's nothing thats gonna stop me from giving you guys the performance of a life time! I've learned i've healed, and im loving the woman i've become! Thats what this next era means to me and i'm stepping into it better than ever.\"Back in September, Cardi B announced on \"CBS Mornings\" that she was expecting a child with Diggs. \"I feel like I'm in a good space. I feel very strong. I feel very powerful that I'm doing all this work. But I'm doing all this work while I'm creating a baby, me and my man, we're very supportive of each other,\" she said.\n\"Her man\" has been on fire this season. Despite tearing his ACL just over a year ago, Diggs has caught 50 passes for 554 yards and three touchdowns in 10 games played this season. The four-time Pro Bowler has caught touchdowns in three consecutive games for the first time since 2022, and just became the seventh active player to reach 11,000 career receiving yards.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cardi B welcomes baby boy into the world with Patriots' Stefon Diggs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/87ce1c3f-31d4-46d7-a644-da04bed4cf61/thumbnail/1200x675/e644efa7de46ef300b7b56c090156240/cardi.jpg"
      ],
      "datePublished": "2025-11-14T02:19:55.000Z",
      "dateModified": "2025-11-14T02:19:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aaron Judge named American League MVP: Yankees slugger beats Mariners' Cal Raleigh - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/aaron-judge-mvp-2025-american-league-award-yankees-mariners-cal-raleigh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/ab223fc8-c23a-4286-b865-3241dbe39001/thumbnail/1200x675/50b090597e1935b87142d0de3a36a97a/judge-getty-1.png",
    "tag": "Sports",
    "date": "2025-11-14T01:24:13.000Z",
    "description": "\n\n\n    \n                                    This marks Judge's second MVP award in a row and third of his career\n        \n                            ",
    "body": "\n\n\n    \n                                    This marks Judge's second MVP award in a row and third of his career\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 13, 2025\n                            \n                    at\n    7:54 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        For the second straight season, New York Yankees captain Aaron Judge has been named the American League's Most Valuable Player. Judge beat out Seattle Mariners catcher Cal Raleigh and Cleveland Guardians third baseman José Ramírez for the award, the BBWAA announced Thursday night.As the voting results show, it was a close race between Judge and Raleigh: Player1st2nd3rd4th5th6th7th8th9th10thPointsAaron Judge, Yankees1713355Cal Raleigh, Mariners1317335José Ramírez, Guardians1965224Bobby Witt Jr., Royals91911215Tarik Skubal, Tigers1271043139Julio Rodríguez, Mariners188651136George Springer, Blue Jays176743125Garrett Crochet, Red Sox14564274Junior Caminero, Rays11312537Jeremy Peña, Astros47632Byron Buxton, Twins331730Nick Kurtz, Athletics1123429Vladimir Guerrero Jr., Blue Jays11314Cody Bellinger, Yankees1117Maikel Garcia, Royals317Bo Bichette, Blue Jays115Riley Greene, Tigers113Aroldis Chapman, Red Sox11Yandy Díaz, Rays11Jacob Wilson, Athletics11This is Judge's second straight MVP and the third of his career (he also won in 2022). He is the 13th player with three MVPs. Only Barry Bonds (seven) and Shohei Ohtani (four), who won this year's National League MVP, have more. Judge is the fourth Yankee with three MVPs, joining Hall of Famers Joe DiMaggio (1939, 1941, 1947), Yogi Berra (1951, 1954-55), and Mickey Mantle (1956-57, 1962).He joins Shohei Ohtani, the Dodgers superstar who won National League MVP.Judge slashed .331/.457/.688 this season and led baseball in batting average by 20 points, on-base percentage by 58 points, and slugging percentage by 66 points. His 53 home runs were second in the AL behind Raleigh's 60. Judge's 9.7 WAR was 1.7 wins better than the next best player, per Baseball Reference's calculations. \n\n        \n            \n                Aaron Judge wins third MVP, but Yankees still searching for World Series ring during all-time great stretch\n                \n                    Matt Snyder                \n            \n                            \n    \n                \n                    \n    \nRaleigh had a historic season and in fact is the first player other than Judge and Ohtani to receive a first-place AL MVP vote since José Abreu won the award in 2020. His 60 home runs are a new single-season record for a catcher, for a switch-hitter, and for a Seattle Mariner. Raleigh is one of only seven players with a 60-homer season. All told, Raleigh hit .247/.359/.589 and led the AL with 125 RBI, and also in games started at catcher (119) and innings caught (1,072). FanGraphs WAR, which includes catcher framing, pegs Raleigh as a 9.1 WAR player in 2025. That is third among all players behind Judge (10.1) and Ohtani (9.4). In just about any other year, Raleigh wins AL MVP with ease. Ramírez has finished in the top five of the MVP voting six times now, though he has yet to win the award. He had another tremendous season, hitting .283/.360/.503 with 30 home runs and 44 stolen bases. It was Ramírez's second straight and third career 30-30 season. His 5.8 WAR was sixth among AL position players. \nVoting for the BBWAA's awards (Rookie of the Year, Manager of the Year, Cy Young, MVP) takes place before the postseason. They are regular-season awards.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aaron Judge named American League MVP: Yankees slugger beats Mariners' Cal Raleigh - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/ab223fc8-c23a-4286-b865-3241dbe39001/thumbnail/1200x675/50b090597e1935b87142d0de3a36a97a/judge-getty-1.png"
      ],
      "datePublished": "2025-11-14T01:24:13.000Z",
      "dateModified": "2025-11-14T01:24:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LOOK: Patriots wearing new Storm Blue alternate uniform for first time on 'TNF' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/look-patriots-to-wear-new-storm-blue-alternate-uniform-for-first-time-ever-on-thursday-night-vs-jets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/36dbb1d5-f0fa-48ae-af3a-032195f834cb/thumbnail/1200x675/f76787a6831a79d7a94d23f2b2cb8dee/gettyimages-2244853462.jpg",
    "tag": "Sports",
    "date": "2025-11-14T00:59:11.000Z",
    "description": "\n        When the New England Patriots take the field on Thursday night, the team will be wearing a new alternate uniform it has never worn before: Th",
    "body": "\n        When the New England Patriots take the field on Thursday night, the team will be wearing a new alternate uniform it has never worn before: The Nor'easter. The uniform was unveiled back in August as part of the NFL's \"Rivalries\" program. The Patriots were one of eight teams to get a \"Rivalries\" uniform for 2025, and they'll be the fourth team to debut the new look.The plan behind the \"Rivalries\" program was to design a uniform based on a theme that's local to each team. With the Patriots being located in the northeast, the team decided to create a \"Nor'easter\" jersey and helmet combination that \"blends the region's natural elements, rich maritime history, and football tradition into a bold, future-forward design,\" according to the team. \nThe official color of the uniform is Storm Blue, which was picked because it's \"Rugged, weathered, and worn in, like the coastline after a gale.\" The uniform has six stars on the neckline, which represents the six New England states. \n\n        \n            \n                Where to watch Patriots vs. Jets: Live stream, prediction, preview for 'TNF'\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nThe Patriots are wearing the uniforms for the first time ever in their Thursday night game against the New York Jets, which kicks off at 8:15 p.m. ET on Amazon Prime. Fans got their first look at the uniforms in person when the Patriots headed out for warmups at Gillette Stadium. \nLet's check out what Drake Maye looks like in the new uniform. \nAnd now, let's take a closer look at the helmet. \nThe Patriots teamed up with Nike to create the new uniform with a design that's suppose to harness \"the power and unpredictability of a New England storm.\"The Storm Blue look is definitely a hit in the Patriots' locker room. \"Probably the nicest uniform I've worn in my whole football career,\" Jaylin Hawkins said this week, via ESPN. \"They're dope; the color scheme. Has a lot of 'aura' to it.\"\nWith the Thursday game being played at Gillette Stadium, the Patriots will be celebrating their new uniform by giving their field a new look. The his will mark the first time in the history of the stadium that the end zone have been fully painted for a Patriots game. \nThe Patriots are one of eight teams that will be participating in the \"Rivalries\" program this year. This program was announced DURING the 2025 NFL Draft back in April, so a lot of people missed the initial announcement. Over the next four seasons, one NFC division and one AFC division per year will get to debut a new \"Rivalries\" uniform, so not every team got a new uniform this year. \nHere's when each division will be getting their \"Rivalries\" uniform: 2025: AFC East and NFC West (See all the 2025 uniforms here)2026: AFC South and NFC North2027: AFC West and NFC East2028: AFC North and NFC SouthAfter the Patriots wear their new uniform on Thursday night, we'll be getting another \"Rivalries\" uniform game on Sunday when the Los Angeles Rams show off their new look against the Seahawks. Here's the the full \"Rivalries\" schedule for 2025 (The team listed first is the \"Rivalries\" uniform team):Week 4: Cardinals vs. Seahawks (See the uniform here)Week 4: Dolphins vs. Jets (See the uniform here)Week 5: Bills vs. Patriots (See the uniform here)Week 11: Patriots vs. Jets (Thursday, Nov. 13))Week 11: Rams vs. Seahawks (Sunday, Nov. 16)Week 14: Jets vs. Dolphins (Sunday, Dec. 7)Week 16: Seahawks vs. Rams (Thursday, Dec. 18)Week 18: 49ers vs. Seahawks (Jan. 3 or Jan. 4)The NFL approved a new rule in April that will allow each team to wear an alternate uniform in four different games, which is up from three. That means that any team with multiple alternate or throwback uniforms will now have an extra opportunity to wear those during the regular season. The \"Rivalries\" uniforms will only be worn once this season by each team. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LOOK: Patriots wearing new Storm Blue alternate uniform for first time on 'TNF' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/36dbb1d5-f0fa-48ae-af3a-032195f834cb/thumbnail/1200x675/f76787a6831a79d7a94d23f2b2cb8dee/gettyimages-2244853462.jpg"
      ],
      "datePublished": "2025-11-14T00:59:11.000Z",
      "dateModified": "2025-11-14T00:59:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aaron Judge's MVP award serves to highlight Yankees' World Series drought - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/aaron-judge-mvp-american-league-yankees-world-series-ring/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/1069f72b-1e16-4b19-a315-8c43d893835b/thumbnail/1200x675/d6be3583f9cbfa82f6dbf1a0547b2d3b/judge-getty-2.png",
    "tag": "Sports",
    "date": "2025-11-14T01:06:48.000Z",
    "description": "\n        Yankees right fielder Aaron Judge won the 2025 American League MVP, cementing this as one of the greatest stretches in MLB history. And yet, ",
    "body": "\n        Yankees right fielder Aaron Judge won the 2025 American League MVP, cementing this as one of the greatest stretches in MLB history. And yet, there's something missing. This would go for any player having such a stretch, but it's especially magnified when we look through the lens of Yankees history. The Yankees haven't won the World Series since 2009. That's 16 empty seasons in the Bronx. They went 17 years between the 1978 and 1996 titles, but there wasn't a World Series in one of those seasons (the 1994 strike caused a World Series cancellation and the Yankees had the best record in the AL that year). Keeping this in mind, the Yankees have tied their longest stretch of World Series without winning one since their first in 1923. And, again, they're doing it with Judge on a historic individual run. This isn't recency bias or hyperbole. I'm not being a prisoner of the moment. Judge has now won three MVPs in the last four seasons. The one time he didn't win it, he missed 56 games due to injury and lost out to a historic Shohei Ohtani season.\n\n        \n            \n                Aaron Judge named 2025 American League MVP: Yankees slugger beats Mariners' Cal Raleigh in tight award race\n                \n                    Mike Axisa                \n            \n                            \n    \n                \n                    \n    \nStill, we're talking about a four-year stretch in which Judge has hit .311/.439/.677 (209 OPS+) with 210 home runs, 464 RBI, 471 runs and 35.9 WAR. The general guideline for WAR is that 8.0 is an MVP-caliber season. Judge is averaging just about 9.0 per season in the last four, even accounting for the extended absence for injury in 2023. He's also averaging 53 home runs, 116 RBI and 118 runs. How many players have won three MVPs in a four-year span? Not many. Barry Bonds did it twice (1990, 1992-93 and then 2001-04)Shohei Ohtani is on a current run of four out of fiveThat's it. The other players to win three MVPs (Jimmie Foxx, Joe DiMaggio, Stan Musial, Roy Campanella, Yogi Berra, Mickey Mantle, Mike Schmidt, Alex Rodriguez, Albert Pujols and Mike Trout) did it with their hardware more spaced out. If we zero in on Judge's age, his feats become that much more ridiculous. The only players to ever hit at least 200 home runs from ages 30-33 are Aaron Judge and Sammy Sosa (1999-2002). The only players with at least 450 RBI and 450 runs from ages 30-33 are Judge, Sosa, Babe Ruth, Bonds, Foxx, Willie Mays, Jeff Bagwell, Lou Gehrig, Rogers Hornsby, Bill Terry and Charlie Gehringer.\nHow many players hit at least .300 with a .400+ OBP and a slugging percentage over .600 from ages 30-33? Just eight. Judge, Sosa, Ruth, Gehrig, Foxx, Manny Ramirez, Larry Walker and Ted Williams. How about an OPS+ over 200 in that age group? It's just Judge and Ruth. Ruth's Yankees won the World Series seven times. There were only 16 teams then and one round of the playoffs (straight to the World Series for each League Champion from the regular season), so it was much easier to win. Still, when it comes to the Yankees, more than any other team, the checklist includes one more element: a ring.\nLook at the other three-time MVPs from the Yankees. DiMaggio won nine rings. Berra won 10! Mantle \"only\" won seven. A-Rod -- yes, one of his MVPs was with another team -- was a huge part of the 2009 championship. Even beyond those guys, Roger Maris won two MVPs and two rings with the Yankees. Gehrig won two MVPs and seven rings. Phil Rizzuto won an MVP and seven World Series. Spud Chandler won an MVP and six World Series. Joe Gordon won an MVP and five World Series. Elston Howard won an MVP and four rings. Thurman Munson won an MVP and two World Series before his tragic death in a plane crash at age 32. That leaves Don Mattingly, who won MVP in 1985, and Judge as the only Yankees MVPs without a World Series title.Judge, again, has three MVPs in four years with one of the greatest four-year stretches we've ever seen. \nSome of this is on the current circumstances, given how many more playoff teams there are, meaning more rounds of advancement are needed before the World Series. Some of it is, frankly, on Judge. Though he was awesome this season in the playoffs, he was 1 for 12 with seven strikeouts through the first three games of the 2024 World Series; the Yankees lost all three. He also had a bad error that opened the doors to a huge Dodgers rally in Game 5. Still, there's only so much one guy should be required to do for a team, so we have to place a good amount of the burden on Judge's Yankees' teammates and the front office. We can't say the Yankees are wasting Judge's best years just yet, but the clock is sure ticking louder and louder. He's not going to be this awesome much longer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aaron Judge's MVP award serves to highlight Yankees' World Series drought - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/1069f72b-1e16-4b19-a315-8c43d893835b/thumbnail/1200x675/d6be3583f9cbfa82f6dbf1a0547b2d3b/judge-getty-2.png"
      ],
      "datePublished": "2025-11-14T01:06:48.000Z",
      "dateModified": "2025-11-14T01:06:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, picks, bets, predictions: This Thursday basketball parlay returns +500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-bets-thursday-november-13-basketball-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/3a0d38c1-644c-42de-a76c-6418c6223d72/thumbnail/1200x675/706fddb990302a451dbe8d5431fbf401/deandre-hunter-cleveland-cavaliers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-11-13T22:21:24.000Z",
    "description": "\n        There's an abbreviated slate of NBA games on Thursday with just three on the schedule, including Raptors vs. Cavaliers (-7.5, 238.5) at 7 p.m",
    "body": "\n        There's an abbreviated slate of NBA games on Thursday with just three on the schedule, including Raptors vs. Cavaliers (-7.5, 238.5) at 7 p.m. ET, and Pacers vs. Suns (-4.5, 232.5) and Hawks (-1.5, 233.5) vs. Jazz, both at 9 p.m. ET. Trae Young (knee) and Kristaps Porzingis (rest) are among those out for Atlanta.What are the NBA best bets for Thursday, and which combination of picks should you target in a Thursday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight seasons. The model enters Week 4 of the 2025-26 NBA season on a sizzling 26-13 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +500. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Thursday, Nov. 13After simulating every game 10,000 times, the model is backing the Cavaliers (-7.5) to stay within the spread against the Raptors in Cleveland at 7 p.m. ET.Both teams should be at full strength after the Cavs rested several players in a 130-116 win at Miami on Wednesday. The Raptors are coming off a 119-109 win at Brooklyn on Tuesday. The Raptors have won five of their last six games.The model is projecting five Cavaliers players to score 15 points or more, led by Donovan Mitchell (toe), who was held out of Wednesday's game for rest purposes. The model is projecting that this game will be decided by double figures as Cleveland covers in nearly 60% of simulations. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Thursday, Nov. 13The model also has locked in two other spread picks, one of which hits in nearly 60% of simulations. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Thursday, and which best bets should you target for a chance at a payout of over +500? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, picks, bets, predictions: This Thursday basketball parlay returns +500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/3a0d38c1-644c-42de-a76c-6418c6223d72/thumbnail/1200x675/706fddb990302a451dbe8d5431fbf401/deandre-hunter-cleveland-cavaliers-imagn-images-1.jpg"
      ],
      "datePublished": "2025-11-13T22:21:24.000Z",
      "dateModified": "2025-11-13T22:21:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jalen Brunson injury updates: Knicks star to be evaluated day-to-day, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jalen-brunson-injury-updates-knicks-star-evaluated/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/4ac200ca-db81-486c-8180-c691ce43e148/thumbnail/1200x675/a58445f123dd7bba174391be4fcc1dd3/jalen-brunson.jpg",
    "tag": "Sports",
    "date": "2025-11-13T23:23:22.000Z",
    "description": "\n        New York Knicks star guard Jalen Brunson is expected to miss Friday night's matchup against the Miami Heat with a Grade 1 right ankle sprain,",
    "body": "\n        New York Knicks star guard Jalen Brunson is expected to miss Friday night's matchup against the Miami Heat with a Grade 1 right ankle sprain, per ESPN. The injury isn't serious, as he'll be evaluated on a day-to-day basis, which is a huge sigh of relief for the Knicks.Brunson sustained the injury in the closing minutes of New York's 124-107 loss to the Orlando Magic Wednesday night. With 1:54 left in the fourth quarter Brunson was attacking the rim, and as he attempted to plant his foot to elevate off the floor he landed on the foot of Orlando big man Wendell Carter Jr. Brunson popped up quickly and shot both of his free throws, though he had a considerable limp. After converting one of the two shots from the line, Brunson intentionally fouled Jalen Suggs to get out of the game, and immediately walked to the Knicks' locker room without going to the bench.Here's where the injury occurred:\nAfter the game, Knicks coach Mike Brown said he didn't know anything other than Brunson turned his right ankle on the play. The All-Star guard was seen exiting Madison Square Garden in a walking boot with crutches following the loss. It's the same ankle Brunson injured last season that forced him to miss 15 games, but it sounds as though this situation is nowhere near that severe.Brunson's status is a positive outcome after an embarrassing loss to the Magic. Brunson was still in the game despite the game decidedly out of reach, which may raise questions about why he was still out there in the first place. If this injury was more severe that would certainly be a bigger plot point, but the good thing is that becomes a moot point with him not expected to miss much time.\nA rejuvenated offenseKnowing Brunson isn't going to miss a ton of time also ensures the Knicks can keep building on the momentum they've built over the last six games. Before that stinker against the Magic, the Knicks were on a five-game winning streak. They have the second-best offense in the league, implementing Brown's new system that has the Knicks taking the third-most 3s in the league. That's a massive change from New York ranking 27th in that same category a season ago, but it's contributed to the Knicks' success so far.It took some time for everyone to adjust, which contributed to the 2-3 record New York started the season with, but over the last batch of games things have been clicking offensively. They're not just taking more 3s, this new system has also taken the ball out of Brunson's hands slightly. In the past, the Knicks ran a ton of isolation plays for their lead guard to great success. Brunson dominated the ball, and while that's still the case, we've seen a slight decrease so far this season.\nSeasonTime of possession (seconds)Isolation frequency2025-267.811.7%2024-258.617.3%2023-248.615.1%2022-238.513.2%The Knicks have been humming along with this new system, and can continue to do so knowing that Brunson won't be sidelined for too long. If there's one adjustment the Knicks need to make, though, it's getting more production out of their second unit.The Knicks' bench unit has been a weakness in what's been an otherwise strong start. That second unit ranks 25th in scoring, and as the grind of the season picks up, they'll need guys like Josh Hart and Jordan Clarkson to produce more.Hart's production has taken a step back this season, and while he's never been a high volume 3-point shooter he's certainly been more efficient inside the arc. After averaging 13.6 points a season ago, he's managing just 8.4 points on 44.4% from the floor. Clarkson was brought in this summer to give the Knicks more scoring depth off the bench, but so far he's been streaky. He's a former Sixth Man of the Year, and is certainly capable of putting up 20 points on some nights. Both guys may just be adjusting -- and Hart did enter the regular season banged up -- but come April and May the Knicks are going to need those guys to give more than what they've been showing so far.But we haven't even reached the one-month mark on the season, so these are minor issues. The positive is that the Knicks don't have to figure out how to carry on without Brunson for an extended period of time, and this top-tier offense they've been operating with can continue to build chemistry as New York tries to establish itself as the team to beat in the Eastern Conference.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jalen Brunson injury updates: Knicks star to be evaluated day-to-day, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/4ac200ca-db81-486c-8180-c691ce43e148/thumbnail/1200x675/a58445f123dd7bba174391be4fcc1dd3/jalen-brunson.jpg"
      ],
      "datePublished": "2025-11-13T23:23:22.000Z",
      "dateModified": "2025-11-13T23:23:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 11 Dynasty rankings: Garrett Wilson injury update - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-dynasty-rankings-update-for-week-11-garrett-wilson-is-a-sell-for-contenders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/299abbd9-3cec-40b2-acbb-3a5256d2b4d4/thumbnail/1200x675/ef2ebddd047243c06efa766c1cf60dec/garrett-wilson-new-york-jets-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-13T23:21:07.000Z",
    "description": "\n        There is not much worse as a Dynasty Fantasy Football contender than having one of your young core players suffer a significant injury in the",
    "body": "\n        There is not much worse as a Dynasty Fantasy Football contender than having one of your young core players suffer a significant injury in the second half of the season. Contenders with Garrett Wilson on their roster know exactly what I am talking about. Wilson was the number seven wide receiver in Fantasy through the first six weeks of the season. He hasn't scored a Fantasy point since, appearing in just one game, and isn't expected to be a contributor until the Fantasy playoffs, at least.The thing that complicates this is that he is 25 years old and still a valuable piece in Dynasty. He is currently my WR22, and that is factoring in almost no production the rest of this year. Since rebuilders don't care about 2025 points, he is even more valuable than that. This is the kind of player who could land you an immediate contributor, but also the type of talent you could regret trading for the next five years. Wilson could have a new quarterback in 2026, and he undoubtedly has top-12 upside. This week was a one-man mailbag on Fantasy Football Today Dynasty, where I answered your Dynasty questions about Wilson and much more. To have your question answered in the next mailbag, send an email to fftdynasty@paramount.com. I face this dilemma in our 14-team Dynasty league, and the choice I have made is to try to sell. I've made a couple of offers, trying to turn Wilson into a star WR by adding picks. If that doesn't work, I'll be trying to see if I can just turn him into a WR2 and a future pick. It is hard to talk about specific players to target because the guys you should be targeting are the good wide receivers in your league who are on the rosters of non-contenders. \nAs a general rule, I would be looking for someone you believe can be a top 18 wide receiver for the rest of this season. I would exclude someone like Davante Adams, because I don't want to trade a stud wide receiver entering his prime for one who is 32 years old. The easiest way to find targets would be to check out the trade charts over at SportsLine and compare values. One final note, this is not just an article for contenders with Garrett Wilson. Any Dynasty manager who is not contending should at least be doing a price check on Wilson. There is a very good chance his value goes up before your Fantasy team plays a meaningful game again. \nAs always, you can get my weekly updated Dynasty Trade Charts over on SportsLine. There you'll find trade values for both Superflex and One-QB trades to help you dominate your Dynasty league.Here are my updated Dynasty Quarterback Rankings:Here are my updated Dynasty Running Back Rankings:Here are my updated Dynasty Wide Receiver Rankings:Here are my updated Dynasty Tight End Rankings:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 11 Dynasty rankings: Garrett Wilson injury update - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/299abbd9-3cec-40b2-acbb-3a5256d2b4d4/thumbnail/1200x675/ef2ebddd047243c06efa766c1cf60dec/garrett-wilson-new-york-jets-imagn-images.jpg"
      ],
      "datePublished": "2025-11-13T23:21:07.000Z",
      "dateModified": "2025-11-13T23:21:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Playoff odds implications for Cowboys vs. Raiders on Monday Night Football - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-playoff-implications-for-cowboys-vs-raiders-on-monday-night-football-from-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/ddae64eb-5e9b-4700-ad97-280f64125145/thumbnail/1200x675/53bdd30da61e71b5a7bb2094d57c5e29/dak-prescott-dallas-cowboys-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-13T21:49:15.000Z",
    "description": "\nIf the Dallas Cowboys want to keep alive their chances to avoid missing the playoffs for a second straight year, they're first going to have to win a",
    "body": "\nIf the Dallas Cowboys want to keep alive their chances to avoid missing the playoffs for a second straight year, they're first going to have to win a vast majority of their eight remaining games. That must begin in Week 11 of the 2025 NFL season, when they visit the Las Vegas Raiders on Monday Night Football.The Cowboys (3-5-1), who were on a bye last week, have lost three of their last four games and have yet to post back-to-back victories this season. The fell to 1-4 on the road with a 44-24 setback against the Denver Broncos in Week 8 and dropped a 17-17 decision to the Arizona Cardinals at home the following week.Dallas currently is 11th in the NFC but can jump ahead of Minnesota this week with a triumph over Las Vegas and a Vikings loss to the Chicago Bears. But the Cowboys still will have two teams standing between them and the third wild card spot in the conference, and things will get much more difficult for them as they face the Philadelphia Eagles, Kansas City Chiefs and Detroit Lions in their next three games.\nHowever, Dallas first must focus on its meeting with a Raiders team that has struggled mightily in Pete Carroll's return to the head-coaching ranks. Las Vegas has lost three consecutive contests and seven of eight since defeating the New England Patriots on the road in its season opener.Dallas' offense is among the most productive in the NFL as the team ranks third in passing (257.8 yards) and fourth in both scoring (29.2 points) and total offense (378.4 yards). But for the Cowboys to have a legitimate shot at the postseason, they'll have to improve dramatically on the other side of the ball as they are 28th against the run (143.0 yards allowed), 29th against the pass (254.4) and 31st in total defense (397.4) and points allowed (30.8).SportsLine's Inside the Lines team currently doesn't give Dallas much of a chance to qualify for the playoffs, and the team's outlook improves minimally with a victory against Las Vegas. However, the Cowboys' prospects become almost obsolete with a third consecutive defeat.According to the ITL team's model, which simulates every NFL game 10,000 times, the Raiders have no chance to avoid missing the postseason for the fourth straight year and eighth time in nine campaigns. A win on Monday night would do virtually nothing to improve their outlook.CHANCES OF MAKING PLAYOFFSTEAMCURRENTWITH WEEK 11 WINWITH WEEK 11 LOSSDIFFERENCEDallas Cowboys7.9%10.7%2.8%7.9%Las Vegas Raiders0.0%0.1%0.0%0.1%Winning their second NFC East title in three years doesn't appear to be in the cards for the Cowboys, as the Eagles are soaring to their second straight crown with a 7-2 record. Three of Philadelphia's next four games are against bona  fide playoff contenders in the Lions, Bears and Los Angeles Chargers, so the slimmest of chances are there for Dallas, which also faces the Eagles in that span -- should the reigning Super Bowl champion lose those contests.The model currently gives the Cowboys less than a 2% chance to win the division and says a win on Monday night barely moves the needle regarding their outlook. Meanwhile, a loss would all but put them out of contention.CHANCES OF WINNING NFC EASTTEAMCURRENTWITH WEEK 11 WINWITH WEEK 11 LOSSDIFFERENCEDallas Cowboys1.8%2.5%0.6%1.9%Philadelphia Eagles97.7%98.9%96.3%2.6%Washington Commanders0.5%0.9%0.2%0.7%New York Giants0.0%0.0%0.0%0.0%The model gives the Raiders no consideration when it comes to finishing atop the AFC West, a division in which the other three members all are above the .500 mark. Most of Las Vegas' problems are on the offensive side of the football, as the team is 27th in passing (185.2 yards), 29th in rushing (87.4), 30th in total offense (272.7 yards) and 31st in scoring (15.4 points). In addition, Geno Smith is tied for second in the NFL with 12 interceptions.Las Vegas is in the middle of the pack in most defensive categories, but it will have to be close to its best on Monday. Dallas quarterback Dak Prescott is sixth in the league with 2,319 passing yards and seventh with 17 touchdown tosses, running back Javonte Williams ranks third with eight TD runs and sixth with 716 rushing yards, and wideout George Pickens is fourth in both receiving yards (764) and scoring catches (six). Tight end Jake Ferguson also has hauled in six touchdown passes, and CeeDee Lamb has 491 yards in just five full games played.One of the few offensive bright spots for the Raiders has been the play of running back Ashton Jeanty, who was the sixth overall pick in the 2025 NFL Draft. The 21-year-old rookie is 10th in the league in rushing with 547 yards and has made four TD runs, including Las Vegas' lone score in last week's 10-7 loss to the AFC West-rival Broncos.The Cowboys are 3.5-point favorites against the Raiders in the latest consensus odds, and the ITL team's model is projecting a 28-22 victory for Dallas, which would keep the team in the mix for a playoff spot in the NFC every so slightly.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Playoff odds implications for Cowboys vs. Raiders on Monday Night Football - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/ddae64eb-5e9b-4700-ad97-280f64125145/thumbnail/1200x675/53bdd30da61e71b5a7bb2094d57c5e29/dak-prescott-dallas-cowboys-imagn-images.jpg"
      ],
      "datePublished": "2025-11-13T21:49:15.000Z",
      "dateModified": "2025-11-13T21:49:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shohei Ohtani named National League MVP: Dodgers star wins fourth award in five years - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/shohei-ohtani-mvp-national-league-dodgers-mlb-award/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/24ecc4f5-2dd6-4150-a331-4566c7407f13/thumbnail/1200x675/5c48d5eeef2b2bd2c0da0aa59cf78d64/ohtani-getty-1.png",
    "tag": "Sports",
    "date": "2025-11-14T01:02:11.000Z",
    "description": "\n\n\n    \n                                    Ohtani joins Barry Bonds as only the second MLB player with four career MVP awards\n        \n              ",
    "body": "\n\n\n    \n                                    Ohtani joins Barry Bonds as only the second MLB player with four career MVP awards\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 13, 2025\n                            \n                    at\n    7:24 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Once again, Los Angeles Dodgers two-way star Shohei Ohtani has been named his league's Most Valuable Player. On Thursday night, Ohtani won National League MVP, beating out fellow finalists Kyle Schwarber (Philadelphia Phillies) and Juan Soto (New York Mets). By sweeping all 30 first-place votes, Ohtani was a unanimous selection for the award. Here is the voting. Player1st2nd3rd4th5th6th7th8th9th10thPointsShohei Ohtani, Dodgers30420Kyle Schwarber, Phillies23511260Juan Soto, Mets41592231Geraldo Perdomo, Diamondbacks371132111196Trea Turner, Phillies12626131102Paul Skenes, Pirates27241383Corbin Carroll, Diamondbacks33573383Fernando Tatis Jr., Padres213545178Pete Crow-Armstrong, Cubs24351263Francisco Lindor, Mets14344261Pete Alonso, Mets11213248Christian Yelich, Brewers1411234Freddie Freeman, Dodgers1124129Brice Turang, Brewers112423Cristopher Sánchez, Phillies14316Michael Busch, Cubs1111Manny Machado, Padres11211Matt Olson, Braves137Nico Hoerner, Cubs15Seiya Suzuki, Cubs13Will Smith, Dodgers113Ketel Marte, Diamondbacks12Elly De La Cruz, Reds11This is Ohtani's third straight MVP and the fourth of his career. He is the second player in history with four career MVP awards, joining Barry Bonds, who won a record seven. Bonds (2001-04) is the only other player to win three MVPs consecutively.Last year, Ohtani joined Hall of Famer Frank Robinson as the only players to win MVP in each league. Ohtani won the 2021 and 2023 AL MVP awards with the Los Angeles Angels and now the 2024 and 2025 NL MVP awards with the Dodgers.\nHe joins Aaron Judge, the Yankees captain who won the American League MVP over Mariners slugger Cal Raleigh.Ohtani, 31, had another thunderous season at the plate, slashing .282/.392/.622 with 55 home runs and 20 stolen bases. He led the National League in slugging percentage (.622) and OPS (1.014), and all of baseball in runs scored (146) and total bases (380). Ohtani's 6.6 WAR as a position player only ranked eighth in baseball.In June, Ohtani returned to the mound following his September 2023 elbow surgery. He threw 47 innings in 14 closely monitored starts and was terrific, pitching to a 2.87 ERA with 62 strikeouts and only nine walks. Ohtani amassed 1.1 WAR as a pitcher. His combined 7.7 WAR was third highest in baseball.\nSchwarber, now a free agent, slugged an NL-leading 56 home runs in 2025. He also led baseball with 132 RBI and hit .240/.365/.563 overall. Schwarber finished with 4.7 WAR despite starting 154 of 162 games at DH.Soto got off to a relatively slow start to his first season with the Mets, but rallied to finish the year with new career highs in home runs (43) and stolen bases (38). He hit .263/.396/.525 and was worth 6.2 WAR.Voting for the BBWAA's awards (Rookie of the Year, Manager of the Year, Cy Young, MVP) takes place before the postseason. They are regular-season awards.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shohei Ohtani named National League MVP: Dodgers star wins fourth award in five years - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/24ecc4f5-2dd6-4150-a331-4566c7407f13/thumbnail/1200x675/5c48d5eeef2b2bd2c0da0aa59cf78d64/ohtani-getty-1.png"
      ],
      "datePublished": "2025-11-14T01:02:11.000Z",
      "dateModified": "2025-11-14T01:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]