[
  {
    "title": "AT&T Pebble Beach Pro-Am 2026 parlay, props: PGA longshot picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/a-t-t-pebble-beach-pro-am-2026-parlay-props-picks-predictions-golf-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/1e2def9c-4334-4811-8219-391841ae7439/thumbnail/1200x675/af84d489da05d7a110ef91d2ef42c074/rory-mcilroy-pebble-beach-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:20:59.000Z",
    "description": "\n        The 2026 AT&T Pebble Beach Pro-Am marks the first Signature Event of the season, with several of the world's best competing at Pebble Beach G",
    "body": "\n        The 2026 AT&T Pebble Beach Pro-Am marks the first Signature Event of the season, with several of the world's best competing at Pebble Beach Golf Links in Northern California. Scottie Scheffler is the +300 favorite, per the latest PGA odds, while other contenders include defending champion Rory McIlroy (+1300), Xander Schauffele (+2500), Justin Rose (+2500) and Hideki Matsuyama (+3000). Outside of making PGA bets on the outright winner, you could create a 2026 Pebble Beach parlay featuring finishing positions, head-to-head outcomes and many other golf props.Ryan Gerard may not be the first name you think of when constructing a PGA longshot parlay, but the UNC alum has three runners-up over his last four starts. He's at +1000 to simply notch a top-5 at the AT&T Pebble Beach Pro-Am 2026 and at +7600 to win his second PGA event. That could be a standalone golf bet or part of a lucrative golf parlay for Pebble Beach 2026. Before making any 2026 Pebble Beach   picks or golf parlays, you need to see this PGA Tour parlay from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its best bets since the restart, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 Pebble Beach   field is locked in, SportsLine simulated the tournament 10,000 times. It has locked in betting picks to form a 5-leg golf parlay that pays out over $40,000 for a $10 bettor. See the picks and full parlay by heading to SportsLine.Top 2026 Pebble Beach parlay, PGA Tour picksFor the AT&T Pebble Beach Pro-Am   2026, one of the picks featured in the model's 5-leg PGA Tour parlay is McIlroy finishing as the Top European at +370. The defending event winner, McIlroy won at Pebble Beach with a score of 21-under-par last year, and that score to par is the lowest ever in the history of this tournament at this specific course. He broke par in all four rounds as that was his first of three victories in 2025. The Irishman is teeing off at his first PGA Tour event of this year, but he did place third in a European Tour event last month.\nThat event had many of the fellow Europeans he will be competing against at Pebble Beach, and McIlroy's game is well-suited for what's the second-shortest course in use for the 2026 PGA Tour season. McIlroy was second in driving distance last season as his length off the tee will well position him for easier chips. Then once he gets on the green, McIlroy is coming off a year in which he ranked in the top 10 in putting average and strokes gained: putting. Thus, his strengths are magnified at a short course like Pebble Beach, making this +370 golf prop one that's worth investing in. See the rest of the PGA Tour parlay legs here.New users can also check out the latest FanDuel promo code and get $100 in bonus bets at FanDuel if your $5 bet wins:How to make PGA Tour parlay picks The model has also picked an outright winner, plus a prop that returns nearly +1000 among its five PGA Tour picks for the 2026 AT&T Pebble Beach Pro-Am     parlay that pays over $40,000 on just a $10 bet. You can only see the picks and the full parlay at SportsLine.\nSo, who will win Pebble Beach 2026, and what combination of PGA Tour props could unlock a $40,000 payday on just a $10 bet? Visit SportsLine now to get the PGA Tour parlay and picks for the AT&T Pebble Beach Pro-Am, all from the golf model that's nailed a whopping 16 majors entering the weekend, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AT&T Pebble Beach Pro-Am 2026 parlay, props: PGA longshot picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/1e2def9c-4334-4811-8219-391841ae7439/thumbnail/1200x675/af84d489da05d7a110ef91d2ef42c074/rory-mcilroy-pebble-beach-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:20:59.000Z",
      "dateModified": "2026-02-11T01:20:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-mavericks-odds-prediction-time-spread-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:12:03.000Z",
    "description": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in th",
    "body": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in the conference and coming off back-to-back losses, including a 109-103 defeat to Philadelphia on Saturday. The Mavs (19-33) are the No. 11 seed and have lost each of their last seven games, most recently falling, 138-125, to San Antonio on Feb. 7. Klay Thompson (rest) is listed as questionable for Dallas.Tipoff is at 9 p.m. ET from Mortgage Matchup Center in Phoenix. The Suns have won four of the last five matchups, including the lone meeting earlier this season. The latest Mavericks vs. Suns odds list Phoenix as the 8.5-point favorite, with the over/under at 227.5. Before making any Suns vs. Mavericks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Mavericks vs. Suns 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Suns vs. Mavs:Mavericks vs. Suns   spread                                                                     Suns -8.5 at DraftKingsMavericks vs. Suns   over/under:    227.5 pointsMavericks vs. Suns  money line:    Suns -309, Mavericks +246Mavericks vs. Suns   picks: See picks at SportsLineMavericks vs. Suns   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Suns vs. Mavericks picksSportsLine's model has simulated Mavs vs. Suns 10,000 times and is going Over on the total (227.5 points). These teams have met twice since the start of 2025, with both contests eclipsing the total. Each of the last two Mavs games have also gone over, and the team is coming off allowing 138 points in its last contest, which is the most Dallas has given up in a non-overtime game all season.With those defensive struggles for Dallas, the Suns are projected to score 7 points more than their season average. Even with that, the Mavericks are forecasted to have more double-digit scorers (six) than Phoenix (five). The model calls for the total to be surpassed with points to spare, with the Over hitting in 51% of simulations.It also says one side of the spread hits over 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Suns vs. Mavs, and which side of the spread hits over 60% of the time? Visit SportsLine now to see which side of the Mavericks vs. Suns spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:12:03.000Z",
      "dateModified": "2026-02-11T01:12:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-150-bonus-bets-clippers-rockets-nebraska-purdue-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:59:07.000Z",
    "description": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bet",
    "body": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bets after placing a first wager of $5 or more. The Cornhuskers and Boilermakers rely on their perimeter shooting, so SportsLine's proven computer model is taking the Over (147.5) in that game. According to the latest college basketball odds, Nebraska is favored by 1.5 points at home. It also likes Iowa State (-6.5) to cover against TCU, along with the Over (209.5) in Rockets vs. Clippers in its NBA best bets. Claim the latest bet365 bonus code CBSSPORTS here:Check out our bet365 bonus code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Tuesday's top picks, best betsNebraska vs. Purdue: Over 147.5 (-119)Iowa State (-6.5) vs. TCURockets vs. Clippers: Over 209.5 Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +712 (risk $100 to win $712). Bet it at bet365 here:Over 147.5 in Nebraska vs. Purdue\nPurdue avoided an upset loss against Oregon on Saturday when Fletcher Loyer hit a clutch 3-pointer with less than one minute remaining, and he is 10 of 14 from 3-point range over his last two games. The Boilermakers are shooting nearly 40% from downtown this season, while Nebraska takes more than half of its shots from the perimeter. Nebraska junior Pryce Sandfort leads the Big Ten with 80 3-pointers, shooting 40.6% from distance. The model has these teams combining for 156 points, as the Over hits in 74% of simulations. Back the Over at bet365 here:Iowa State -6.5 vs. TCUTCU has struggled against the top teams on its schedule this season, going just 3-6 against Quad 1 opponents. The Horned Frogs recently lost to then-No. 10 Houston by nine points at home before getting crushed by unranked Colorado in an 87-61 final on Feb. 1. Iowa State is riding a five-game winning streak, with four of those wins coming by 13-plus points. The Cyclones have won and covered the spread in six straight head-to-head meetings between these teams, and the model has them covering 66% of the time on Tuesday night. Back Iowa State at bet365 here:Over 209.5 in Rockets vs. ClippersThe Rockets and Clippers have gone Over the total in five straight meetings, and the over/under was 219.5 when they met on Dec. 23. They combined for 236 points in that contest, shooting a combined 29 of 67 from 3-point range. The Clippers have gone Over in four of their last six games, and their last four games have featured totals of 219 or higher. The model thinks this total is too low, as it projects 222 points to help the Over cash 68% of the time. Back the Over at bet365 here:\nLooking for more NBA and college basketball picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg"
      ],
      "datePublished": "2026-02-10T21:59:07.000Z",
      "dateModified": "2026-02-10T21:59:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rockets vs. Clippers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/rockets-clippers-odds-prediction-spread-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/39cf4f94-8758-4734-b648-0a8ec934fc76/thumbnail/1200x675/e5d6e136926abc318068c6c9528fa591/kevin-durant-alperen-sengun-houston-rockets-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:58:26.000Z",
    "description": "\n        Two streaking Western Conference teams will square off on Tuesday's NBA schedule as the Los Angeles Clippers visit the Houston Rockets. L.A. ",
    "body": "\n        Two streaking Western Conference teams will square off on Tuesday's NBA schedule as the Los Angeles Clippers visit the Houston Rockets. L.A. (25-27) has won six of its last nine and is coming off a 115-96 Sunday victory over Minnesota. Houston (32-19) is also 6-3 over its last nine, with its last contest being a Saturday win over Oklahoma City, 112-106. Darius Garland (toe) remains out and won't make his Clippers debut.Tipoff is at 8 p.m. ET from the Toyota Center in Houston. The teams split their two matchups earlier this season, with the home team winning each. The latest Clippers vs. Rockets odds list Houston as the 8.5-point favorite, with the over/under at 213.5. Before making any Rockets vs. Clippers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Clippers vs. Rockets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Rockets vs. Clippers:Clippers vs. Rockets   spread                                                                     Rockets -8.5 at DraftKings SportsbookClippers vs. Rockets   over/under:    213.5 pointsClippers vs. Rockets   money line:    Rockets -315, Clippers +251Clippers vs. Rockets   picks: See picks at SportsLineClippers vs. Rockets   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Rockets vs. Clippers picksSportsLine's model has simulated Clippers vs. Rockets 10,000 times and is going Over on the total (213.5 points). The model takes into account prior matchups, and each of the last five meetings between these two have eclipsed the total. It's worth noting that all five of those had a higher O/U than 210.5, as the five averaged 233.4 combined points. Three of the last four Clippers road games have gone over, and with the team trading away All-Defensive member, Ivica Zubac, Los Angeles is nowhere near as stout defensively.Two players are projected to top 20 points in scoring, while another eight players score more than 9 points. Given that, and the spread trends with these squads, SportsLine's model has the total being eclipsed by double-digits. The model has the Over in 62% of simulations.It also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Rockets vs. Clippers, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Clippers vs. Rockets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rockets vs. Clippers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/39cf4f94-8758-4734-b648-0a8ec934fc76/thumbnail/1200x675/e5d6e136926abc318068c6c9528fa591/kevin-durant-alperen-sengun-houston-rockets-cbs-imagn.jpg"
      ],
      "datePublished": "2026-02-10T21:58:26.000Z",
      "dateModified": "2026-02-10T21:58:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-pacers-odds-prediction-spread-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:24:41.000Z",
    "description": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The P",
    "body": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The Pacers are at the bottom of the East with a 13-40 mark overall, while New York is second in the conference at 35-19. The Knicks have won nine of their last 10. Indiana has dropped four straight as it has primarily set its focus on the future. Tipoff is set for 7:30 p.m. ET at Madison Square Garden. New York is an 11.5-point favorite in the latest Knicks vs. Pacers odds, while the over/under is 225.5. Before making any Pacers vs. Knicks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Knicks vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Knicks: Knicks vs. Pacers spread                                                                     Knicks -11.5Knicks vs. Pacers over/under:    225.5 pointsKnicks vs. Pacers money line:    Knicks -588, Pacers +428Knicks vs. Pacers picks: See picks at SportsLineKnicks vs. Pacers streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Pacers vs. Knicks picksSportsLine's model has simulated Knicks vs. Pacers 10,000 times and is going Over on the total (225.5 points). New York won 114-113 when these teams met in December, and the Over hit in that matchup.This time around, the model is projecting Pascal Siakam to lead the Pacers with 21.6 points, while Jalen Brunson paces New York with 26.7 points in the simulations. The teams combine for 229 points as the Over hits 51% of the time. The model also says one side of the spread hits nearly 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Pacers, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:24:41.000Z",
      "dateModified": "2026-02-10T21:24:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-norway-norweigan-biathlete-interview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:52:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after wi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after winning a medal at the Games, but it's typically tears of joy, not sadness, that accompany the highlight of their athletic lives. However, after winning bronze in the men's 20km biathlon, Norwegian skiier Sturla Holm Lægreid broke down for a much different reason. In an interview with the Norwegian Broadcasting Corporation, he confessed to cheating on his now ex-girlfriend and pleaded with her to take him back. \n\"I told her a week ago. And it's been the worst week of my life,\" Lægreid said, via NBC. \"I had a gold medal in life, and there's probably a lot of people out there who look at me differently now, but I only have eyes for her. Sports has taken a bit of a back seat these past couple of days. Yeah, I wish I could share this with her.\"\nLægreid's partner broke up with him after he informed her he'd been unfaithful, but hoped his public confession and act of contrition would convince her to take him back. \"I'm not ready to give up. I hope that committing social suicide might show her how much I love her,\" Lægreid said. \"I accept the consequences of what I've done. I regret it with all my heart. Maybe I'm dumb as a rock. I'm a member of Mensa, but I still do stupid stuff.\"\nHe added that he wanted to \"put it all on the table\" in hopes she might take him back, although this plan could backfire spectacularly as not everyone would take kindly to this kind of admission and airing of laundry on a national (and now international, after the interview went viral) scale. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg"
      ],
      "datePublished": "2026-02-10T21:52:46.000Z",
      "dateModified": "2026-02-10T21:52:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Purdue vs. Nebraska prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/purdue-nebraska-odds-prediction-spread-time-2026-college-basketball-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/06/ddfa900a-2926-4a27-97fc-81ba4be974f8/thumbnail/1200x675/f23498d9970c0476c5f2a0e86d709820/braden-smith-purdue-boilermakers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:14:43.000Z",
    "description": "\n        The 12th-ranked Purdue Boilermakers battle the ninth-ranked Nebraska Cornhuskers in a key Big Ten matchup on Tuesday night. Purdue is coming ",
    "body": "\n        The 12th-ranked Purdue Boilermakers battle the ninth-ranked Nebraska Cornhuskers in a key Big Ten matchup on Tuesday night. Purdue is coming off a 68-64 win over Oregon on Saturday, while Nebraska defeated Rutgers 80-68 that same day. The Boilermakers (19-4), who are 3-2 against ranked opponents this season, are 5-2 on the road. The Cornhuskers (21-2), who are 2-2 against ranked foes, are 12-1 on their home court.Tipoff from Pinnacle Bank Arena in Lincoln, Neb., is set for 7 p.m. ET. Purdue leads the all-time series 21-7. Nebraska is a 1.5-point favorite in the latest Purdue vs. Nebraska odds from DraftKings Sportsbook, while the over/under for total points scored is 147.5. Before making any Nebraska vs. Purdue picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 15 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on an 11-5 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Purdue vs. Nebraska 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Nebraska vs. Purdue:Purdue vs. Nebraska                 spread:    Nebraska -1.5 at DraftKings SportsbookPurdue vs. Nebraska                                                                                                                                                                                               over/under:    147.5 pointsPurdue vs. Nebraska                                                                         money line:    Nebraska -114, Purdue -106Purdue vs. Nebraska                                                                                                                                                                                                                            picks:    See picks at SportsLinePurdue vs. Nebraska                                                                                                                                                                                                                             streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Purdue vs. Nebraska picksSportsLine's model is going Over on the total (147.5 points). The Over has hit in five of the last nine head-to-head meetings between the schools. The Over has also hit in two of the last four Purdue games, and in the last Nebraska game. The model projects the Boilermakers to have four players score 12.1 points or more, including Braden Smith's projected 15.9 points. The Cornhuskers, meanwhile, are projected to have five players score 11.9 or more points, led by Ugnius Jarusevicius, who is projected to score 17.8 points. The Over clears in well over 70% of simulations. The model also says one side of the spread hits more than 50% of the time. You can only see that pick at SportsLine.So who wins Purdue vs. Nebraska, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Purdue vs. Nebraska spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Purdue vs. Nebraska prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/06/ddfa900a-2926-4a27-97fc-81ba4be974f8/thumbnail/1200x675/f23498d9970c0476c5f2a0e86d709820/braden-smith-purdue-boilermakers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:14:43.000Z",
      "dateModified": "2026-02-10T21:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jai Opetaia next fight: Aussie to face Brandon Glanton at Zuffa Boxing 04 for championship - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jai-opetaia-next-fight-brandon-glanton-zuffa-boxing-04-main-event/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/6eedb193-b50e-405a-b5bd-72147eea27c4/thumbnail/1200x675/7c30368560b43e5715b923ca2c6377ac/jai-opetaia-weighin.jpg",
    "tag": "Sports",
    "date": "2026-02-10T22:52:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jai Opetaia has been the biggest signing for Zuffa",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jai Opetaia has been the biggest signing for Zuffa Boxing, and now he has his first opponent set. Opetaia will face Brandon Glanton in the main event of Zuffa Boxing 04 on March 8 at the Meta APEX in Las Vegas, Dana White announced on Tuesday. The fight will crown the first Zuffa world champion with the Zuffa Boxing world cruiserweight title on the line. Opetaia (29-0, 23 KO) is the reigning IBF cruiserweight champion, having won the title with a 2022 decision over Mairis Briedis in a hard-fought battle that saw Opetaia break his jaw in two places. After a TKO of Jordan Thompson, Opetaia vacated the belt when the IBF ordered him to face Briedis in a rematch and the champ decided to face Ellis Zorro in a stay-busy fight while Briedis recovered from injury.Opetaia would regain the title in his next fight, defeating Briedis by decision in their rematch. He has since made four successful title defenses, all by knockout. His knockout of Huseyin Cinkara was a runner-up in the 2025 CBS Sports Knockout of the Year.\nThe goal for Opetaia has been to unify the four world championships in the division, but he has been unable to make any unification bouts happen, instead being forced to face a string of middling competition, with an April 2025 win over Chris Billam-Smith as the standout title defense in that stretch.In Glanton (21-3, 18 KO), Opetaia faces a fighter who has gone just 4-3 in his seven most recent fights. While that recent run may not look impressive on paper, Glanton lost to David Light by split decision, Soslan Asbarov by majority decision (Asbarov received a six-year suspension for a failed drug test after his next fight) and lost to Billam-Smith by a narrow unanimous decision, showing he can be competitive even in defeat.\nGlanton has also shown big power against lower-tier opposition and will be able to make Opetaia pay if the Aussie is not careful.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jai Opetaia next fight: Aussie to face Brandon Glanton at Zuffa Boxing 04 for championship - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/6eedb193-b50e-405a-b5bd-72147eea27c4/thumbnail/1200x675/7c30368560b43e5715b923ca2c6377ac/jai-opetaia-weighin.jpg"
      ],
      "datePublished": "2026-02-10T22:52:14.000Z",
      "dateModified": "2026-02-10T22:52:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Errol Spence Jr. vs. Tim Tszyu in the works for June in Australia, per reports - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/errol-spence-jr-vs-tim-tszyu-fight-rumors-date/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/dcd24d7c-b03f-4da5-954b-d793038e4c1e/thumbnail/1200x675/d25e3f0145749844e89f58cfac073a62/errol-spence-jr-boxing-cbs-sports-feb-10-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:07:50.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Errol Spence Jr. is reportedly mounting a comeback",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Errol Spence Jr. is reportedly mounting a comeback. Former unified welterweight champion Spence is expected to end his nearly three-year hiatus, making his 154-pound debut against former WBO junior middleweight champion Tim Tszyu. Spence vs. Tszyu is expected to take place in Australia in June, according to ESPN, following an initial report by Ring Magazine and subsequently reported by veteran journalist Dan Rafael. The fight is expected to take place on either June 6 or June 13, with a venue still to be determined. The fight would headline a PBC on Prime Video pay-per-view, according to Rafael and ESPN.Spence (28-1, 22 KOs) has not competed since July 2023. Spence suffered his first career loss that night, suffering three knockdowns and a ninth-round stoppage in an undisputed welterweight title fight against Terence Crawford. Rumors tied Spence to a fight with WBC middleweight champion Sebastian Fundora, but it never materialized. Fundora will instead defend his title against former unified champion Keith Thurman on March 28.Tszyu (26-3, 18 KOs) is undergoing his own rehabilitation. Tszyu's 24-fight undefeated streak was snapped by a split decision loss to Fundora. He went 2-2 after that: beating Anthony Velasquez and Joseph Spencer, but getting stopped by Bakhram Murtazaliev and Fundora.\nSpence's expected comeback ends speculation that he'd retire after the \"Bud\" fight. Instead, Crawford retired after winning his third undisputed weight class title.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Errol Spence Jr. vs. Tim Tszyu in the works for June in Australia, per reports - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/dcd24d7c-b03f-4da5-954b-d793038e4c1e/thumbnail/1200x675/d25e3f0145749844e89f58cfac073a62/errol-spence-jr-boxing-cbs-sports-feb-10-2026.jpg"
      ],
      "datePublished": "2026-02-10T21:07:50.000Z",
      "dateModified": "2026-02-10T21:07:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boxing schedule for 2026: Ryan Garcia vs. Mario Barrios on tap to start year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/boxing-schedule-for-2026-dates-location-fights-teofimo-lopez-shakur-stevenson-canelo-alvarez-oleksandr-usyk/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/8f839459-e0d2-4c37-b3b3-2b7d566f5065/thumbnail/1200x675/bd8a5e3ee82bc8be6f030b967f34b3af/barrios-garcia-presser.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:44:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The start of a new calendar year often means a slo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The start of a new calendar year often means a slowdown for the sport of boxing. That is not the case for 2026, as the schedule is loaded with intriguing fights in January and February.The early highlight of the schedule was Shakur Stevenson's domination of Teofimo Lopez Jr. to win the WBO junior welterweight championship. It was a true pound-for-pound performance from Stevenson, who won nearly every second of a fight against the most dangerous foe of his career.Zuffa Boxing returns on Feb. 15 for the third card in promotion history. In the main event, Efe Ajagba will battle former heavyweight champion Charles Martin.Then, near the end of the month, a DAZN PPV is set with a terrific welterweight title main event. Champion Mario Barrios is set to defend his belt against Ryan Garcia in a fight sure to deliver action.There are many other title fights, featuring top fighters, which have created a very intriguing kickoff to the sport for 2026.Take a look at the calendar for 2026 below.\nNote: This will be updated constantly with changes and additions. Upcoming boxing schedule for 2026DateLocationMain eventWeightclass/titleNetworkFeb. 15Las Vegas Zuffa Boxing 03: Efe Ajagba vs. Charles MartinHeavyweightsParamount+ (subscribe now)Feb. 21Las VegasMario Barrios (c) vs. Ryan GarciaWBC welterweight titleDAZN PPVFeb. 21Nottingham, EnglandJosh Warrington vs. Leigh WoodJunior lightweightsDAZNFeb. 22DetroitClaressa Shields (c) vs. Franchon Crews-DezurnUndisputed heavyweight titleDAZNFeb. 28Glendale, ArizonaEmanuel Navarrete (c) vs. Eduardo Nunez (c)Unified junior lightweight titleDAZNMarch 8Las VegasZuffa Boxing 04: Jai Opetaia (c) vs. Brandon GlantonIBF cruiserweight titleParamount+ (subscribe now)March 15Yokohama, JapanKnockout CP Freshmart (c) vs. Shokichi IwataWBC junior flyweight titleTBAMarch 28Las VegasSebastian Fundora (c) vs. Keith ThurmanWBC junior middleweight titlePrime Video PPVMarch 28Manchester, EnglandMoses Itauma vs. Jermaine Franklin Jr.HeavyweightsDAZNApril 4LondonDeontay Wilder vs. Derek ChisoraHeavyweightsDAZNApril 11TBATyson Fury vs. Arslanbek MakhmudovHeavyweightsNetflixMay 2Las VegasGilberto Ramirez (c) vs. David BenavidezUnified cruiserweight titleDAZN\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boxing schedule for 2026: Ryan Garcia vs. Mario Barrios on tap to start year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/8f839459-e0d2-4c37-b3b3-2b7d566f5065/thumbnail/1200x675/bd8a5e3ee82bc8be6f030b967f34b3af/barrios-garcia-presser.jpg"
      ],
      "datePublished": "2026-02-10T21:44:26.000Z",
      "dateModified": "2026-02-10T21:44:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Verlander returns to Tigers on $13M deal, joins rotation with Skubal, Valdez - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/justin-verlander-tigers-free-agency-contract-rotation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/17e40239-d0cb-4295-a90e-258d603171ee/thumbnail/1200x675/de02cd3adde864bf954aa55c44505754/verlander-getty.png",
    "tag": "Sports",
    "date": "2026-02-10T22:56:12.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Detroit Tigers have signed franchise legend Ju",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Detroit Tigers have signed franchise legend Justin Verlander to a one-year free agent contract for the upcoming 2026 season. The club announced the move on Tuesday. The deal is for $13 million with $11 million of the total commitment being deferred, FanSided reports. Verlander, who turns 43 on Feb. 20, is coming off a 2025 season for the Giants in which he pitched to a 3.85 ERA (103 ERA+) with an identical FIP of 3.85 across 29 starts and 152 innings. This pact reunites Verlander with the team that first drafted him out of Old Dominion with the No. 2 overall pick in 2004. Verlander went on to spend the first 12-plus seasons of his MLB career in a Detroit uniform. Over that span, he won 183 games and put up a WAR of 56.6 in a Tigers uniform. In 2011, Verlander as a Tiger won the American League Cy Young and MVP honors. With Verlander in tow, the Tigers made it to five postseasons and won the pennant during Verlander's rookie season of 2006. Verlander's time with the Tigers came to an end during the 2017 season, when he was traded to the Astros. Verlander in the years to come won two additional Cy Young awards with Houston. A future Hall of Famer, Verlander will enter the upcoming season with a career WAR of 82.2; 266 wins; and 3,553 strikeouts. Back with the Tigers, Verlander figures to be part of the contending rotation that's fronted by back-to-back AL Cy Young winner Tarik Skubal and notable free-agent addition Framber Valdez. The Tigers in 2026 will be angling to make the postseason for a third straight year, and Verlander will help stabilize a rotation that also includes Jack Flaherty and Casey Mize. Starter Reese Olson will miss the entire 2026 season after undergoing shoulder surgery earlier this month, the Tigers announced Tuesday.\nVerlander returns to Detroit with 2,373 strikeouts as a Tiger, which puts him 307 behind Mickey Lolich for the most in franchise history. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Verlander returns to Tigers on $13M deal, joins rotation with Skubal, Valdez - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/17e40239-d0cb-4295-a90e-258d603171ee/thumbnail/1200x675/de02cd3adde864bf954aa55c44505754/verlander-getty.png"
      ],
      "datePublished": "2026-02-10T22:56:12.000Z",
      "dateModified": "2026-02-10T22:56:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James' 21-season All-NBA streak officially ends, and his mark will probably never be broken - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lebron-james-all-nba-streak-ends-lakers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/74c05335-a85b-44b7-8052-a65592c173a9/thumbnail/1200x675/b5105e64a1844208f507b99447198216/lebron-getty-20.png",
    "tag": "Sports",
    "date": "2026-02-10T22:20:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        LeBron James will miss out on making an All-NBA te",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        LeBron James will miss out on making an All-NBA team for the first time since his rookie year, snapping a streak of 21 straight seasons with the Lakers superstar on an All-NBA team. James will miss his 18th game of the season on Tuesday night against the Spurs, as the 41-year-old will not play in a back-to-back due to left foot arthritis. That 18th absence for James, who didn't make his season debut until Nov. 18, means he cannot reach the NBA's 65-game minimum for awards and All-NBA voting consideration. While it would've been questionable whether James would make it this year on merit based on his current production -- 21.8 points, 6.9 assists and 5.7 rebounds per game -- his regular absences in his 23rd season will prevent even a strong second half of the season from getting him into the conversation. His 21-year All-NBA streak seems like it'll stand the test of time for a variety of reasons. For one, it's rare to have a player reach All-NBA status as quickly as James did in his career, making his first All-NBA team as a second-year player. It's even more rare for a player to remain at that level deep into their 30s, much less as a 40-year-old as James did last year. \n\n        \n            \n                LeBron James offers blunt assessment of Lakers after loss to Thunder: 'That's a championship team, we're not'\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nThe closest streak to James all-time is Kobe Bryant with 15 straight All-NBA nods, offering a good representation of how incredible LeBron's run has been. No one has ever sniffed the 20-year mark in NBA history, and it'll only get more difficult going forward. Beyond the requirement of consistent greatness for more than two decades, the same 65-game threshold that officially ended any hopes James had at a 22nd All-NBA selection makes it even more difficult for stars to maintain streaks of their own. Giannis Antetokounmpo has the longest active streak with nine straight selections, but he will also miss out this season due to too many games missed. Nikola Jokić is next with seven straight All-NBA appearances, but is also perilously close to being ineligible for voting this year after missing 16 games already this season. \nLongest All-NBA streaksPlayerSeasonsDatesLeBron James212005-2025Kobe Bryant151999-2013Karl Malone141988-2001Tim Duncan131998-2010Shaquille O'Neal131994-2006Between the rules governing eligibility and the amount of talent across the league, it's difficult to see anyone coming close to matching James' mark. Records, as they say, are meant to be broken, but it would take a truly unbelievable career for anyone to top James' All-NBA streak. That officially comes to an end and is the latest reminder that the end of the James era is nearly upon us. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James' 21-season All-NBA streak officially ends, and his mark will probably never be broken - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/74c05335-a85b-44b7-8052-a65592c173a9/thumbnail/1200x675/b5105e64a1844208f507b99447198216/lebron-getty-20.png"
      ],
      "datePublished": "2026-02-10T22:20:04.000Z",
      "dateModified": "2026-02-10T22:20:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Holy hoops! Villanova and Notre Dame finalizing plans to tip 2026-27 college basketball season in Rome, Italy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/villanova-notre-dame-2026-27-college-basketball-season-rome-italy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/fff549e8-9d61-427c-9eb2-9beab14c4b22/thumbnail/1200x675/90e0adc535922f4100c30fa2e04b036f/novapopend.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:34:19.000Z",
    "description": "\n        Villanova and Notre Dame are in the final stages of solidifying a monumental scheduling sacrament to begin the 2026-27 college basketball sea",
    "body": "\n        Villanova and Notre Dame are in the final stages of solidifying a monumental scheduling sacrament to begin the 2026-27 college basketball season. The Wildcats and Fighting Irish's men's and women's basketball teams have been given special clearance by the NCAA to open next season in Rome for a doubleheader on Sunday, Nov. 1, sources told CBS Sports. College basketball's official start to the season is Monday, Nov. 2, but the NCAA quietly approved a waiver in January to allow the teams a one-day head start, given the historic precedent of the games.The motivation for the overseas twinbill happens to be one of the most famous people on the planet: Pope Leo XIV.The two universities are prominent private Catholic schools with connections to the Pope. For Villanova, an obvious one: Robert Francis Prevost is a 1977 alumnus. The Notre Dame piece is tied to the school's massive global brand. Notre Dame is regarded as the most prominent Catholic institution of higher learning in the world. It also has an outpost in Rome. An avowed sports fan, the Pope also grew up in Chicago, which has a significant Notre Dame fan presence given its proximity to nearby South Bend, Indiana. (Soon after Prevost was named the most powerful man in the Catholic Church, online detectives went back and found he appeared on television during the White Sox's 2005 World Series run.)\nNotre Dame's women's program is a powerhouse with two national titles and nine Final Fours. Since 2020, Niele Ivey has been the coach. Villanova owns three national titles in men's basketball and has made the Final Four seven times, most recently in 2022 under Jay Wright. It's now coached by Kevin Willard.Villanova and Notre Dame worked in concert on arranging the game for months, sources said, with talks seriously materializing in the early fall. Paperwork has not been finalized, but both schools are moving forward with the expectation that one of college basketball's most ambitious scheduling ideas in recent memory will transpire on the first day of November.Fox is on board to broadcast both games, per sources, with the doubleheader scheduled to play out in the afternoon in Rome. That means breakfast-time basketball in the United States. While final details are still being worked through, the general plan is to have Villanova-Notre Dame lead into NFL coverage on Fox in the United States on that Sunday. The women's game is planned to air afterward on Fox Sports 1. \nStarting a season in a foreign country isn't unprecedented: Women's college basketball opened this past season in Paris with Duke playing Baylor. On the men's side, Villanova and Notre Dame is believed to be the first season-opener on foreign soil and the first regular season Division I basketball competition in Italy.The teams will play the doubleheader at the Palazzetto dello Sport, known more colloquially as the PalaTiziano. The arena seats 3,500 people for basketball games and has existed since the late 1950s. It was built in the lead-up to Rome's hosting of the 1960 Olympics. The PalaTiziano underwent significant renovations from 2018-2023 and is approximately 30 minutes from the Pope's residence in Vatican City. The Pope's involvement in the event — if any — is unclear and very much to be determined, according to sources, though officials from both schools have been in contact with the Pope and people around the Holy See. Notre Dame's president and others had a private meeting with the Supreme Pontiff in November, while Villanova had officials fly to the Vatican last May to see Pope Leo's inaugural mass. Villanova's president, Rev. Peter M. Donohue, was not in the same class as Prevost in the 1970s, but the two did overlap as undergrads at VU.\nThe schools intend to make the trip not just about basketball, but a huge educational experience as well. Rome, which surrounds Vatican City, is a destination for millions of devout Catholics and tourists every year. And come November, should all go to plan, it will play host to a global American sporting event.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Holy hoops! Villanova and Notre Dame finalizing plans to tip 2026-27 college basketball season in Rome, Italy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/fff549e8-9d61-427c-9eb2-9beab14c4b22/thumbnail/1200x675/90e0adc535922f4100c30fa2e04b036f/novapopend.jpg"
      ],
      "datePublished": "2026-02-11T01:34:19.000Z",
      "dateModified": "2026-02-11T01:34:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man United don't cut it at West Ham, draw puts viral fan's haircut dream on hold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/manchester-united-vs-west-ham-score-ucl-chances-fan-haircut/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/66daaec5-094d-4add-9c9a-6ae0a2b8eb82/thumbnail/1200x675/825cb7e36af2acd932b9aa7b1be85ce0/man-united-1.jpg",
    "tag": "Sports",
    "date": "2026-02-11T00:00:41.000Z",
    "description": "\n        Michael Carrick's win streak as Manchester United's coach came to an end on Wednesday with a surprise 1-1 draw at West Ham United, one in whi",
    "body": "\n        Michael Carrick's win streak as Manchester United's coach came to an end on Wednesday with a surprise 1-1 draw at West Ham United, one in which they had to come from behind to pick up a point and avoid their first defeat in five.United were the heavy favorites in this matchup, in part because of their strong attacking record this season, but their offense was ineffective at the London Stadium. There were just five combined shots between the two teams in the first half, while neither side managed more than a single shot on target. Their combined expected goals tally was 0.28, the quality of their shots just as unremarkable as the quantity. (Expected goals measures how likely an individual shot is to land in the back of the net, which means 0.28 xG for a total of five shots is a low conversion rate – and yes, makes for a banal game.)Things were only slightly better in the second half, though they tilted in West Ham's favor quickly when Tomas Soucek scored for the hosts in the 50th minute. Jarrod Bowen received the ball on the right flank and made a long pass towards goal, where a handful of teammates were waiting. Soucek was the first to gain a hold of it while standing at the near post, finishing the shot from close range and ensuring relegation-threatened West Ham had a much-needed advantage.The strange thing about the second half, though, was that United's productive attack never got their act together. They managed to outshoot West Ham the rest of the way, taking six shots after Soucek's goal while West Ham took just four, their reward finally coming in the sixth minute of stoppage time. Bryan Mbeumo whipped a cross into the box and Benjamin Sesko was there to receive, casually flicking the ball into the back of the net to ensure the Red Devils would extend their unbeaten run to five games.\nAgain, though, shot quantity was not matched by shot quality. United may have had more shots than West Ham after Soucek's strike but somehow, they never managed to outdo the hosts' xG tally – West Ham not only generated 0.49 xG from their final four shots of the game, slightly better than United's 0.4 xG from six shots, their overall xG count after 90 minutes was 1.03, better than United's paltry 0.62 showing at the final whistle.The sputtering attack is the latest in a growing trend for Carrick's United. Five games into his tenure as the head coach, the Red Devils average 2.2 goals per game, higher than the 1.7 goals per game tally they had this season under ex-coach Ruben Amorim. It may just be beginner's luck for Carrick, though – his version of the team takes an average of roughly three fewer shots per match and generates 0.5 fewer expected goals along the way.Though a sample size of five matches is small, the draw at West Ham paints a peculiar picture for Carrick's tenure in charge of United so far. Though four wins preceded Wednesday's tie, each of those games was fairly distinct; United outplayed an out-of-form Manchester City and Tottenham Hotspur during this stretch, overperformed against a frantic Arsenal, played an even game against Fulham and now underperformed against a West Ham side that currently sits in the drop zone.\nIt makes Carrick's impact on United hard to read in some ways, though he appears to have shifted the vibe since taking the helm last month. Amorim, his predecessor, was known for a rigid tactical approach while captain Bruno Fernandes said after Saturday's 2-0 win over Spurs that Carrick has afforded the players more flexibility – and responsibility.\"I think Michael came in with the right ideas of giving the players the responsibility, but also some freedom to take the responsibility on the pitch during the decisions that are needed,\" Fernandes told TNT Sport. \"He's very good with the words and I think he still remembers when I told him last time he was our manager, for our last game [during his four-game spell as a caretaker in 2021], and I was sure Michael could be a great manager and now he is showing it. We hope we can help him even more so everyone can see, not just us as the players, that we are good players and that is why we are at Manchester United, but also the staff is very good.\"The good news for Carrick and company is that it has not put that much of a dent in their hopes of qualifying for next season's edition of the UEFA Champions League – Chelsea's 2-2 draw with Leeds United means the Blues still sit a point behind them, though Liverpool can close the gap to three points with a win at Sunderland and Brentford can do the same against Arsenal.\nNo haircut for viral Manchester United fanWhile United are still on course for a finish inside the Champions League places, there is someone who has to start his streak from scratch – viral fan Frank Ilett, who has not cut his hair in over 500 days as he awaits a five-game winning streak from the team. After Saturday's victory over Spurs, the Red Devils got as close as they have since Ilett began his challenge, but the fan will now have to wait until mid-March at the earliest to get a haircut.\nCarrick said he was aware of Ilett and his growing mane but admitted on Monday that it would not provide added motivation for his side, who were instead focused on the task at hand on the pitch.\"My kids have made me aware of it,\" he said. \"I can understand what's going on with it and it does make me smile, but it certainly won't go into the team talk from a professional level.\"\nUnited's next five matches are against Everton, Crystal Palace, Newcastle United, Aston Villa and Bournemouth. Ilett said he intends to donate his strands to charity when – or if – he is finally able to cut his hair.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man United don't cut it at West Ham, draw puts viral fan's haircut dream on hold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/66daaec5-094d-4add-9c9a-6ae0a2b8eb82/thumbnail/1200x675/825cb7e36af2acd932b9aa7b1be85ce0/man-united-1.jpg"
      ],
      "datePublished": "2026-02-11T00:00:41.000Z",
      "dateModified": "2026-02-11T00:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Santander injury update: Blue Jays slugger out 5-6 months - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/anthony-santander-injury-blue-jays-shoulder-surgery/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/f3e2bdd5-ed66-476c-808b-dc687ad477e0/thumbnail/1200x675/b17ba1d98cfd5500ab93b245a135f1e5/santander-getty.png",
    "tag": "Sports",
    "date": "2026-02-10T22:28:58.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Toronto Blue Jays enter the 2026 season as the",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Toronto Blue Jays enter the 2026 season as the defending AL East and American League champions. The goal this time around would be to erase the sting of losing Games 6 and 7 of the World Series at home, especially after going to the ninth inning with a lead in Game 7. They lost Bo Bichette in free agency, but otherwise return a strong team for this season.And then bad news struck right at the start of spring training. Oufielder/designated hitter Anthony Santander needs left labral (shoulder) surgery and will miss five to six months, Blue Jays manager John Schneider announced Tuesday.Santander, 31, signed a five-year, $92.5 million deal with the Jays last offseason and didn't provide much in his first year. He hit .175/.271/.294 (57 OPS+) with -1.0 WAR in 54 games. He missed significant time, requiring two different stints on the injured list with left shoulder inflammation. Just because the Jays didn't get anything from Santander last season doesn't mean they weren't counting on him this time around, though. The offense lost one of its top contributors in Bichette to free agency. In looking to pick up that slack, Santander was one of the most obvious places. Now that is off the table until past the halfway point of the season. \nThird baseman Kazuma Okamoto was signed out of Japan and that's one place where the Blue Jays will look to alleviate some of the Bichette loss. Nathan Lukas and Davis Schneider are also options to see increased playing time. Santander is a switch-hitting outfielder while Lukas (left) and Schneider (right) could platoon in that now-open lineup spot. Also remember that injuries held center fielder Daulton Varsho to just 71 regular-season games last year. This is to say that while Santander was being counted on to beef up the offense, the Blue Jays have options to replace him and areas where they can still pick up the lost production from Bichette's signing with the Mets and Santander's surgery.\nThe Blue Jays won the AL East over the Yankees last season via tiebreaker, as both finished 94-68, tied for the best American League record. Baseball Prospectus released its PECOTA projections on Tuesday and essentially have the two teams in a dead heat atop the AL East again.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Santander injury update: Blue Jays slugger out 5-6 months - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/f3e2bdd5-ed66-476c-808b-dc687ad477e0/thumbnail/1200x675/b17ba1d98cfd5500ab93b245a135f1e5/santander-getty.png"
      ],
      "datePublished": "2026-02-10T22:28:58.000Z",
      "dateModified": "2026-02-10T22:28:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]