[
  {
    "title": "UFC Fight Night results: Melquizael Costa scores stunning knockout in Houston - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-houston-results-highlights-melquizael-costa-knockout-dan-ige/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/22/c009ff0a-f147-4bcb-9b62-7b8107e31ce3/thumbnail/1200x675/23467178072d2d074083b9193b1ea277/melquizael-costa-ige-knockout.jpg",
    "tag": "Sports",
    "date": "2026-02-22T03:32:18.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It's time to put some respect on Melquizael Costa'",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It's time to put some respect on Melquizael Costa's name in the UFC featherweight division. Costa (26-7) recorded his sixth straight victory on Saturday at UFC Fight Night in Houston and did so in spectacular fashion inside the Toyota Center by becoming the first fighter to finish veteran Dan Ige (19-11). The 29-year-old from Brazil scored the sixth spinning back kick knockout in UFC history when he caught Ige ducking down to avoid a potential punch that put him directly in line for the kick. Referee Dan Miragliotta leaped in to stop the fight at 4:56 of Round 1 as Costa likely secured a top-15 ranking at 145 pounds. \"I told everybody this week, I just fought a legend,\" Costa said. \"No one has been able to finish him and I said that I was going to do that. I was able to do it.\"\nAfter Ige scored an early takedown, Costa quickly scrambled back to his feet and began to wear Ige down in the clinch with knees to the body. From there, Costa showcased his full offensive bag by stunning Ige with a front kick to the face and going to the body with a variety of strikes that led up to the finish.\nCosta extended his win streak that began following a second-round knockout loss to Steve Garcia in 2023. Of his six wins on his current run, four have come by stoppage. After the fight, Costa called out a former two-time featherweight title challenger who was sitting Octagonside. \"There is a guy here that you all love and I love, too,\" Costa said. \"Diego Lopes, let's go at it.\"\nIge, a 34-year-old native of Hawaii, suffered his fifth loss in his last seven fights. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night results: Melquizael Costa scores stunning knockout in Houston - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/22/c009ff0a-f147-4bcb-9b62-7b8107e31ce3/thumbnail/1200x675/23467178072d2d074083b9193b1ea277/melquizael-costa-ige-knockout.jpg"
      ],
      "datePublished": "2026-02-22T03:32:18.000Z",
      "dateModified": "2026-02-22T03:32:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rondale Moore dies at 25: Death under investigation for Purdue star, Vikings WR - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rondale-moore-dies-purdue-vikings-cardinals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/22/7543e1c1-13cb-44bc-bb39-5dd1b0259402/thumbnail/1200x675/470fa5a08ab31146f9fc4b1f3e40e740/rondale-moore-cardinals-g.jpg",
    "tag": "Sports",
    "date": "2026-02-22T03:26:32.000Z",
    "description": "\n        Rondale Moore, 25, died on Saturday of a self-inflicted gunshot wound, said New Albany Police Chief Todd Bailey, who told multiple local medi",
    "body": "\n        Rondale Moore, 25, died on Saturday of a self-inflicted gunshot wound, said New Albany Police Chief Todd Bailey, who told multiple local media outlets that Moore's body was found in a garage. An autopsy is scheduled for Sunday, per WLKY-TV. Moore was born and grew up in New Albany, Indiana.The former star wide receiver at Purdue signed with the Minnesota Vikings in 2025 but suffered a season-ending knee injury during the year's first preseason game. Moore spent his first three seasons with the Arizona Cardinals, which selected him with the No. 49 overall pick in the 2021 NFL Draft, before moving to the Atlanta Falcons, where he also suffered a preseason knee injury that prevented him from playing in 2024.\"We are deeply saddened by the passing of Rondale Moore,\" the Vikings said in a statement. \"While we are working to understand the facts, we have spoken with Rondale's family to offer our condolences and the full support of the Minnesota Vikings. We have also been in communication with our players, coaches, and staff, and will make counseling and emotional support resources available to anyone in need. Our thoughts are with Rondale's family and friends during this devastating time.\"The most dynamic player in college football during his freshman campaign with the Boilermakers, Moore was a consensus All-American, Paul Warfield Trophy winner and the CBS Sports Freshman of the Year in 2018, a season in which he amassed 1,258 yards receiving, 213 yards rushing and 14 total touchdowns. He only played seven games over his sophomore and junior seasons.\n\"Rondale Moore was a complete joy to coach,\" said Jeff Brohm, who led the Purdue football program while Moore was enrolled, in a statement. \"The ultimate competitor that wouldn't back down from any challenge. Rondale had a work ethic unmatched by anyone. A great teammate that would come through in any situation. We all loved Rondale, we loved his smile and competitive edge that always wanted to please everyone he came in contact with.\"Moore's best NFL effort was his third year with the Cardinals, his lone full professional season, when he gained 530 yards of total offense and scored two touchdowns. Moore gained 1,450 total yards and four touchdowns in Arizona.\n\"I am devastated by the news of Rondale's death,\" said Vikings coach Kevin O'Connell. \"While Rondale had been a member of the Vikings for a short time, he was someone we came to know well and care about deeply. He was a humble, soft-spoken, and respectful young man who was proud of his Indiana roots. As a player, he was disciplined, dedicated and resilient despite facing adversity multiple times as injuries sidelined him throughout his career. We are all heartbroken by the fact he won't continue to live out his NFL dream and we won't all have a chance to watch him flourish. My prayers are with Rondale's family, friends, teammates and coaches as we all deal with this tragic news.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rondale Moore dies at 25: Death under investigation for Purdue star, Vikings WR - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/22/7543e1c1-13cb-44bc-bb39-5dd1b0259402/thumbnail/1200x675/470fa5a08ab31146f9fc4b1f3e40e740/rondale-moore-cardinals-g.jpg"
      ],
      "datePublished": "2026-02-22T03:26:32.000Z",
      "dateModified": "2026-02-22T03:26:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Mario Barrios vs. Ryan Garcia: Fight start time, PPV price - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/mario-barrios-vs-ryan-garcia-fight-start-time-where-to-watch-live-stream-ppv-price/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/4903a8e8-135c-4d17-9986-a15abc625a7f/thumbnail/1200x675/f0bb5746ac70f4746cb26fdd1ac6553d/mario-barrios-weighin-baby.jpg",
    "tag": "Sports",
    "date": "2026-02-21T23:32:56.000Z",
    "description": "\n        Ryan Garcia has the chance to become world champion for the first time in his career on Saturday. Garcia will face WBC welterweight champion ",
    "body": "\n        Ryan Garcia has the chance to become world champion for the first time in his career on Saturday. Garcia will face WBC welterweight champion Mario Barrios in a high-stakes showdown from T-Mobile Arena in Las Vegas.Garcia is one of boxing's top stars, though various missteps have set his career back at multiple times. After starting his career 23-0, Garcia was dominated by Gervonta \"Tank\" Davis before Davis scored a seventh-round knockout with a body shot. Two fights later, Garcia put on a career-best performance, knocking down WBC junior welterweight champion Devin Haney multiple times en route to a majority decision victory. Unfortunately, Garcia missed weight for the bout, seemingly not even attempting to make the junior welterweight limit after months of apparent struggles with a mental illness episode playing out on social media. Compounding those issues, Garcia failed his drug test for the fight and the result was overturned to a no-contest.Garcia followed up his suspension from the failed drug test with a listless performance against Rolando Romero, dropping the fight by a clear unanimous decision.\n        \n            \n                Ryan Garcia looks to bounce back from uninspired loss when he faces Mario Barrios: 'Do or die moment'\n                \n                    Brian Campbell                \n            \n                            \n    \n                \n                    \n    \nBarrios has also been uneven in his performances in recent years. He was competitive with Davis in their 2021 fight before suffering a knockout in Round 11. That fight was followed by a loss to Keith Thurman. After rattling off a three-fight winning streak that saw him capture the WBC interim welterweight title, Barrios was promoted to full champion, where he has successfully defended his title against Abel Ramos and Manny Pacquiao, though both defenses ended in draws.\nThe undercard on Saturday features plenty of intriguing players in the 140-pound division. WBA junior welterweight king Gary Antuanne Russell gets a tough test from Andy Hiraoka in a featured bout. And former title challenger Frank Martin is in action when he faces Nahir Albright with both men looking to get back to the title level.Check out how you can watch the action on Saturday night below, but be sure to check out our staff predictions and expert picks for the main event as well.Where to watch Barrios vs. GarciaDate: Saturday, Feb. 21 | Location: T-Mobile Arena -- Las VegasStart time: 5:45 p.m. ETWhere to watch: DAZN PPV | Price: $69.99Barrios vs. Garcia fight card, oddsOdds via DraftKings Sportsbook\nRyan Garcia -250 vs. Mario Barrios (c) +195, WBC welterweight titleGary Antuanne Russell -350 vs. Andy Hiraoka +260, WBA junior welterweight titleFrank Martin -390 vs. Nahir Albright +290, junior welterweightsWho wins Mario Barrios vs. Ryan Garcia on Saturday, and which pick should you target for a huge payday? Visit SportsLine now to see Josh Nagel's best bets for the Saturday welterweight title bout, all from the combat sports specialist who has covered the sport for more than 20 years, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Mario Barrios vs. Ryan Garcia: Fight start time, PPV price - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/4903a8e8-135c-4d17-9986-a15abc625a7f/thumbnail/1200x675/f0bb5746ac70f4746cb26fdd1ac6553d/mario-barrios-weighin-baby.jpg"
      ],
      "datePublished": "2026-02-21T23:32:56.000Z",
      "dateModified": "2026-02-21T23:32:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lionel Messi's Inter Miami blasted in MLS opener, fall to LAFC 3-0 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/lionel-messi-inter-miami-vs-lafc-score-mls-opener/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/22/e0edaca0-0c7a-4100-85b7-535713cd84a1/thumbnail/1200x675/7bc55a3ed05ca20a03aada18cd8b26b9/inter-miami-messi.jpg",
    "tag": "Sports",
    "date": "2026-02-22T04:53:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Lionel Messi and Inter Miami kicked off their s",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Lionel Messi and Inter Miami kicked off their season on Saturday, it's clear that there is some rust to shake off as they fell to Los Angeles FC 3-0. The Herons began the season away from home at the Los Angeles Memorial Coliseum, where new LAFC coach Marc Dos Santos was able to kick things off with a statement victory against the reigning MLS champs. David Martinez had the winning goal for the Black and Gold, but it's a match that could've had a much larger gap between the sides if LAFC brought their finishing boots, which is saying something considering that it was a three-goal margin of victory. Martinez, Nathan Ordaz, and Denis Bouanga found the back of the net for the Black and Gold as 75,673 got to cheer their team on in Los Angeles. It's the second largest attendance in MLS history and the largest ever on the opening weekend of a season.Playing their first match without Sergio Busquets following his retirement, the lack of a midfield leader showed. On LAFC's second goal by Bouanga, no one tracked back and got the defense organized, which was a hallmark of the defensive midfielder, who is also known for his ability to quickly and accurately move the ball into dangerous positions to kickstart the attack.Rodrigo De Paul is expected to fill that void, but with so many changes to the roster --  three starters in the match weren't with the club last season -- there will be growing pains, which were seen in this match.\nMessi's quiet night saw him visibly frustrated with the teams lack of cohesion, as well as LAFC's ability to play physical. While Inter Miami remain one of the favorites to win MLS Cup 2026, LAFC may have just proven, at least early on, that they could be the team to beat.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lionel Messi's Inter Miami blasted in MLS opener, fall to LAFC 3-0 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/22/e0edaca0-0c7a-4100-85b7-535713cd84a1/thumbnail/1200x675/7bc55a3ed05ca20a03aada18cd8b26b9/inter-miami-messi.jpg"
      ],
      "datePublished": "2026-02-22T04:53:26.000Z",
      "dateModified": "2026-02-22T04:53:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USA vs. Canada: Start time, where to watch and picks for hockey gold medal game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/team-usa-vs-canada-hockey-where-to-watch-start-time-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/a8981ffb-d51b-4078-921d-b8cd4073d26b/thumbnail/1200x675/78da3bf09d5c7c614ab88d55de48b03d/gettyimages-2262714287-2.jpg",
    "tag": "Sports",
    "date": "2026-02-22T02:30:40.000Z",
    "description": "\n        The gold medal matchup that everyone in North America hoped for has come to fruition. Team USA and Canada are set to settle their intense riv",
    "body": "\n        The gold medal matchup that everyone in North America hoped for has come to fruition. Team USA and Canada are set to settle their intense rivalry with a gold medal on the line.The two best teams in this Olympic field, the U.S. and Canada had to fight to get here. The Americans needed overtime to beat Sweden in the quarterfinals, and the Canadians required third-period comebacks to beat Czechia and Finland in the knockout rounds. With both squads now battle-tested, this gold medal game has all the ingredients for an all-time classic.\"There's hatred there,\" Brady Tkachuk told ESPN. \"I mean, they've been the top dog. They've been the best for the last bunch of years, and for us, we want to be in that position, be the best. So it's going to be a game where I think a lot of guys could say, this is the biggest game that they've ever played in.\"On paper, these are two evenly-matched teams, and the oddsmakers see it as a toss-up too. According to DraftKings, the Canadians are slight favorites at -125 with the Americans at +105 odds.\n\n        \n            \n                Team USA vs. Canada: Ranking the 10 best players in the gold medal game of the 2026 Winter Olympics\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nBefore the puck drops on this highly anticipated clash of the hockey titans, we'll take a deeper look at the matchup and make our pick for the gold medal winner.Where to watch USA vs. CanadaDate: Sunday, Feb. 22 | Time: 8:10 a.m. ETLocation: Milano Santagiulia Arena -- Milan, ItalyTV: NBCOdds: Canada -125, USA +105USA vs. Canada previewThe U.S. and Canada are two different teams with two very different strengths. The Canadians are built on an elite core of forwards with a lineup capable of scoring in bunches, and the Americans are built to prevent that very thing. Which philosophy will win out on Sunday?\nThus far, the Canadians scored their way out of trouble, and Connor McDavid and Macklin Celebrini are lethal together on the first line. Canada also brings Nathan MacKinnon, the leading scorer in the NHL, as its second-line center. The real wild card here is the health of Sidney Crosby. He missed the semifinal game with a lower-body injury, and if he can go, Crosby gives Canada incredible depth as the third-line center. If Crosby misses the game, that matchup gets more favorable for the U.S. with Nick Suzuki slotting in there.Mitch Marner, Bo Horvat and Brandon Hagel bring playmaking and scoring on the wings. Marner was the hero in Canada's overtime win over Czechia, pulling off a show-stopping move to win the game.The Americans have a nice one-two punch down the middle as well, even if they don't have the offensive ceilings of McDavid and MacKinnon. Jack Eichel and Auston Matthews are elite two-way players, and they've lived up to that billing in Milan. That duo has its work cut out for it in trying to contain their Canadian counterparts, but Eichel and Matthews are capable of doing it at their best. Larkin is a great third-line center for Team USA, and he's been heating up over the last two games.\nOn the wings, the U.S. brings a balance of skill and sandpaper. Matthew and Brady Tkachuk embody that dynamic, blending physicality with finesse around the net. The most interesting winger for the Americans, however, is known more for his flash. Jack Hughes has made some brilliant plays at the Olympics, and he's playing at a superstar level, which is good for the U.S.\"It's been 46 years. So many players that have paved the way for us that haven't had a chance to win gold for us, that for our dream to be right there,\" Tkachuk said. \"It's something that we're not taking lightly. And I mean, we have an opportunity to achieve a childhood dream.\"Defense is where the balance of power shifts to the U.S. Led by Quinn Hughes and Zach Werenski, the Americans are loaded on the blue line. Those two are excellent puck-movers who can be trust to contribute in all three zones, but the U.S. has plenty of versatility behind them. Jaccob Slavin is one of the best shutdown defenders in the NHL, and Brock Faber fits well beside him in a similar role. Charlie McAvoy is great in his own end -- and he's not afraid to lay the lumber -- but he can also chip in on offense. I'd be remiss if I didn't mention Jake Sanderson as an underrated star either.\nThe Canadian defense has more questions. They have the best defenseman in the world in Cale Makar, but the team's decision not to take more players with offensive upside was exacerbated by Josh Morrissey's injury early in the tournament. Drew Doughty and Travis Sanheim are fine in their own end, but they can't be relied upon consistently in the offensive zone. The same could be said for Colton Parayko, who is there for more of a physical presence. Shea Theodore and Thomas Harley have some offensive chops, but the latter is having a poor season with the Dallas Stars.In goal, we have a real conundrum. Connor Hellebuyck is arguably the best goalie in the world, but he has been known to shrink in the Stanley Cup Playoffs. Jordan Binnington is statistically the worst goalie in the NHL this season, but all he does is turn into Martin Brodeur on hockey's biggest stages. The U.S. has the edge on paper, but history and experience tell us the goaltender position might be more of a wash.USA vs. Canada predictionThe Americans have been tormented by the Canadians on the world stage for my entire lifetime. I've seen 2002 in Salt Lake City, 2010 in Vancouver, 2014 in Sochi and last year in the 4 Nations Face-Off. The U.S. hasn't been able to slay this Red-and-White dragon in a game that really matters.\nHowever, this is the best American team that's ever been assembled, and it's right there with the Canadians as the most talented squad in the world. Canada still holds an edge, but as Czechia and Finland have proved, it's by no means immortal. Beyond that, Team USA was built with the idea in mind that it would have to slow down this Canada team. Were some of the roster decisions made in service of that mission highly questionable? Yes, but the Americans have a real identity.If I were making this prediction five days ago, I may have gone a different direction. The Canadians looked unstoppable in the preliminary round, and the Americans didn't always look like juggernauts. That said, the U.S.has developed chemistry over the course of this tournament, and it's improved with each passing game. Meanwhile, Canada has struggled with inferior opponents in its last two matchups.Perhaps it's recency bias, but one team has looked better than the other over the last couple of games. The Americans seem to be hitting their stride just in time for this showdown with Canada, and I think they find a way to harass the Canadian defense and get to Jordan Binnington. Pick: USA 3, Canada 2 (OT)\nSo who wins the 2026 Winter Olympics men's ice hockey final between USA and Canada, and what are the best bets for this matchup? Visit SportsLine now to see the 2026 Winter Olympics men's ice hockey picks and best bets from a hockey insider, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USA vs. Canada: Start time, where to watch and picks for hockey gold medal game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/a8981ffb-d51b-4078-921d-b8cd4073d26b/thumbnail/1200x675/78da3bf09d5c7c614ab88d55de48b03d/gettyimages-2262714287-2.jpg"
      ],
      "datePublished": "2026-02-22T02:30:40.000Z",
      "dateModified": "2026-02-22T02:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC Fight Night start time: Where to watch Sean Strickland vs. Anthony Hernandez - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-sean-strickland-anthony-hernandez-where-to-watch-stream-paramount/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/3ac2543e-922c-4d24-a029-e81cc63b5b89/thumbnail/1200x675/513a30d0735164ae81145f0d282a67d7/ufc-octagon-general-logo.jpg",
    "tag": "Sports",
    "date": "2026-02-22T00:00:55.000Z",
    "description": "\n        Anthony Hernandez will look for the biggest win of his career on Saturday when he faces Sean Strickland in a middleweight clash in the main e",
    "body": "\n        Anthony Hernandez will look for the biggest win of his career on Saturday when he faces Sean Strickland in a middleweight clash in the main event of UFC Fight Night from Toyota Center in Houston.Strickland is a former UFC middleweight champion, having scored a shock win over Israel Adesanya at UFC 293. He would go on to drop the title in his next fight, a split decision loss to Dricus du Plessis at UFC 297. Strickland rebounded with a split decision win over Paulo Costa before losing in a championship rematch with du Plessis.Sign up for Paramount+ and WATCH UFC Fight Night LIVE for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription. Plans start as low as $8.99/month or $89.99/year!Hernandez's UFC career got off to a rough start, going 1-2 in his first three fights in the Octagon. He has since rattled off eight wins in a row to climb to the No. 4 spot in the official UFC middleweight rankings, one spot behind Strickland.\nUFC Fight Night also features two perennial contenders looking to protect their places in the pecking order. Geoff Neal (No. 12) battles the tenacious Uros Medic, and Dan Ige (No. 14) tries to snap Melquizael Costa's five-fight win streak. Both veterans approach fight night renewed after overcoming personal health issues. For Neal, a five-year battle with substance abuse. For Ige, eye injuries before the Patricio Pitbull fight. Elsewhere on the undercard, ranked heavyweights are set to collide when Ante Delija and Serghei Spivac face off. Delija is looking to bounce back from a surprising knockout loss to rising contender Waldo Cortes Acosta in November. Prior to that, Delija scored two first-round knockouts in his first two UFC appearances. And an interesting UFC debut is set at welterweight when Josiah Harrell takes on Jacobe Smith. Harrell was scheduled to make his promotional debut at UFC 290 against Jack Della Maddalena, but during his fight week medical screening, doctors discovered he had Moyamoya, a rare brain disease that causes the arteries supplying blood to the brain to become narrowed or blocked. Now, nearly three years later, he gets his chance to make a first impression.Below is all the information you need to catch the action on Saturday night. Be sure to check out our preview and expert picks on the main event.\nUFC Fight Night viewing informationDate: Saturday, Feb. 21| Location: Toyota Center -- HoustonStart times: Prelims -- 5 p.m. | Main card -- 8 p.m.Watch live: Subscribe to Paramount+Subscribe to watch UFC on Paramount+Paramount+ is the new home of UFC. All 13 UFC numbered events and 30 UFC Fight Nights will stream exclusively on the service for the next seven years through 2033. It is a monumental move that makes UFC more accessible than ever.All Paramount+ subscribers -- Premium and Essential -- can also stream an extensive archive of UFC content, including a deep library of past UFC fights on demand, iconic fights and features on champions and UFC legends, series like UFC Embedded and UFC Countdown, exclusive interviews with athletes, previews of every numbered event with CBS Sports experts and much more.\nWhat devices support Paramount+?Stream Paramount+ on any device listed here! For more information, including supported models or operating systems, visit the Paramount+ FAQ: Computer, Apple TV, iPhone and iPad, Apple Vision Pro, Android TV, Android phone and tablet, Chromecast, Cox Contour bo, DISH Hopper 3 with Hopper Plus, DIRECTV Gemini, Fire TV/Tablet, GoogleTV, Portal TV, PlayStation 4 and 5, Roku, Samsung TV, Vizio TV, LG TV, VIDAA TV, Xbox, Xfinity and Xumo.UFC Fight Night fight card, oddsAnthony Hernandez -278 vs. Sean Strickland +225, middleweights Geoff Neal -218 vs. Uros Medic +180, welterweights Melquizael Costa -218 vs. Dan Ige +180, featherweights Ante Delija -142 vs. Sergehi Spivac +120, heavyweights Jacobe Smith -310 vs. Josiah Harrell +250, welterweights Michel Pereira -155 vs. Zach Reese +130, middleweightsWho wins Strickland vs. Hernandez, and which UFC best bet of over +500 should you be all over? Visit SportsLine now to get detailed picks and analysis from the advanced model which showed a 6.1% ROI from over 500 fights from 2023-25, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night start time: Where to watch Sean Strickland vs. Anthony Hernandez - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/3ac2543e-922c-4d24-a029-e81cc63b5b89/thumbnail/1200x675/513a30d0735164ae81145f0d282a67d7/ufc-octagon-general-logo.jpg"
      ],
      "datePublished": "2026-02-22T00:00:55.000Z",
      "dateModified": "2026-02-22T00:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Real Madrid shocked at Osasuna as LaLiga door opens for Barcelona - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/real-madrid-osasuna-upset-la-liga-barcelona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/648634a1-a74d-410f-adef-41753eb86240/thumbnail/1200x675/dd7bdd8e611fc4b222741d6749f9077d/real-madrid-alaba.jpg",
    "tag": "Sports",
    "date": "2026-02-21T21:48:02.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Just like that, the LaLiga title race has shifted ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Just like that, the LaLiga title race has shifted back in favor of Barcelona as Real Madrid lost 2-1 to Osasuna on Saturday. Vinicius Junior scoring in his third consecutive match wasn't enough to see Los Blancos take all three points as they look to maintain a slim one-goal advantage over Barcelona while also seeking advancement to the last 16 of Champions League play with a second leg versus Benfica looming on Wednesday (catch the action on Paramount+).With the loss, Barcelona can go one point clear atop the league with a victory over Levante on Sunday, ramping up the road to El Clásico on May 10. Real Madrid still controlstheir destiny but matches like this one, where points were dropped, conceding a goal in the 92nd minute of play, are the ones that will loom if manager Alvaro Arbeloa isn't able to secure the LaLiga crown. Of course, a loss had to come somewhere when Real Madrid were previously unbeaten in their last nine league matches, so it's better that it happens here instead of at another time down the road.The improved form of Vinicius will be good to see in the long run, as it'll make Real Madrid a more balanced side, but this is another match where too many easy chances were given to Osasuna. Los Blancos gave up 13 shots, including a penalty for a total of 2.05 xG, and even with rotation in defense, it's a strange one for Real Madrid to allow to a team that has only scored 30 goals all season. Margins are fine, and expectations are high for Los Blancos, so these are moments when Arbeloa's leadership is critical, especially during a week with trying incidents like this one.\nIn Champions League play, Vinicius Junior was allegedly racially abused by Benfica winger Gianluca Prestianni, and it's hard to tell how that impacts the squad during matches like this one, especially with another match against the Portuguese side looming. On any given day, Arbeloa has a tough job managing Los Blancos, but it's one that becomes much harder when needing to take into account events like that. They'll have to have a short memory of these dropped points as well, with UCL play returning, but when they're coming off a lengthy winning streak, there's no better time than midweek to start their next one.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Real Madrid shocked at Osasuna as LaLiga door opens for Barcelona - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/648634a1-a74d-410f-adef-41753eb86240/thumbnail/1200x675/dd7bdd8e611fc4b222741d6749f9077d/real-madrid-alaba.jpg"
      ],
      "datePublished": "2026-02-21T21:48:02.000Z",
      "dateModified": "2026-02-21T21:48:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics medal count - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-medal-count/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png",
    "tag": "Sports",
    "date": "2026-02-21T21:22:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Am",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics in Milan and Cortina d'Ampezzo, Italy, will run from Friday, Feb. 6 through Sunday, Feb. 22. Over the course of those two weeks, athletes from 92 countries -- not including Russia or Belarus -- will compete in 16 different sports.At the 2022 Beijing Olympics, the United States finished tied for third in the gold medal count, just behind Norway and Germany. The U.S. brought home nine gold medals, which was tied with China in that category, but the Americans finished fifth in the overall medal count with 25.Team USA has already exceeded its overall medal tally, now at 27, and stands to add to both the overall count and possibly even the gold medal count. A win over Slovakia on Friday would assure the U.S. men's hockey team of some type of medal as it would advance to Sunday's final.On Thursday, figure skater Alysa Liu, 20, became the first American woman to take home a singles gold in 24 years and the U.S. women's hockey team rallied from a 1-0 third period deficit to a 2-1 overtime victory over rival Canada to reach the top of the podium for the first time in eight years. And speedskater Jordan Stolz added to his collection of two previous gold medals with a silver in the men's 1,500 meters.\nNorway will attempt to defend its title as the most awarded country in the Winter Olympics, both from 2022 and all-time. The Norwegians won 16 gold medals and 37 total medals at the Beijing Games four years ago, and they possess a large edge in the all-time medal count. Entering these Games, Norway had won 148 gold medals and 406 total medals in its 24 appearances at the Winter Olympics. The Americans are a distant second with 330 total medals.Russian and Belarusian athletes are permitted to compete, but only as individuals under a neutral flag. They'll be classified as \"Individual Neutral Athletes,\" and their medals won't factor into the overall count. Russian and Belarusian teams are still banned from competing the Olympics.\nKeep track of the live medal count over the next couple weeks as the United States looks to fill up its trophy case while competing across Northern Italy. COUNTRYGOLDSILVERBRONZETOTAL\n            \n        \n    \n        NOR\n    \n    \n        Norway\n    \n\n    18111140\n            \n        \n    \n        USA\n    \n    \n        United States\n    \n\n    1112943\n            \n        \n    \n        NED\n    \n    \n        Netherlands\n    \n\n    107320\n            \n        \n    \n        ITA\n    \n    \n        Italy\n    \n\n    1061430\n            \n        \n    \n        FRA\n    \n    \n        France\n    \n\n    89623\n            \n        \n    \n        GER\n    \n    \n        Germany\n    \n\n    79824\n            \n        \n    \n        SUI\n    \n    \n        Switzerland\n    \n\n    68620\n            \n        \n    \n        SWE\n    \n    \n        Sweden\n    \n\n    66416\n            \n        \n    \n        AUT\n    \n    \n        Austria\n    \n\n    58518\n            \n        \n    \n        JPN\n    \n    \n        Japan\n    \n\n    571224\n            \n        \n    \n        CAN\n    \n    \n        Canada\n    \n\n    56920\n            \n        \n    \n        CHN\n    \n    \n        China\n    \n\n    43613\n            \n        \n    \n        KOR\n    \n    \n        South Korea\n    \n\n    34310\n            \n        \n    \n        AUS\n    \n    \n        Australia\n    \n\n    3216\n            \n        \n    \n        GBR\n    \n    \n        Great Britain\n    \n\n    3104\n            \n        \n    \n        CZE\n    \n    \n        Czechia \n    \n\n    2215\n            \n        \n    \n        SLO\n    \n    \n        Slovenia\n    \n\n    2114\n            \n        \n    \n        ESP\n    \n    \n        Spain\n    \n\n    1023\n            \n        \n    \n        BRA\n    \n    \n        Brazil\n    \n\n    1001\n            \n        \n    \n        KAZ\n    \n    \n        Kazakhstan\n    \n\n    1001\n            \n        \n    \n        POL\n    \n    \n        Poland\n    \n\n    0314\n            \n        \n    \n        NZL\n    \n    \n        New Zealand\n    \n\n    0213\n            \n        \n    \n        FIN\n    \n    \n        Finland\n    \n\n    0145\n            \n        \n    \n        LAT\n    \n    \n        Latvia\n    \n\n    0112\n            \n        \n    \n        DEN\n    \n    \n        Denmark\n    \n\n    0101\n            \n        \n    \n        EST\n    \n    \n        Estonia\n    \n\n    0101\n            \n        \n    \n        GEO\n    \n    \n        Georgia\n    \n\n    0101\n            \n        \n    \n        BUL\n    \n    \n        Bulgaria\n    \n\n    0022\n            \n        \n    \n        BEL\n    \n    \n        Belgium\n    \n\n    0011\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics medal count - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/5b3391b4-1fe0-4e37-817c-0e2c08182250/thumbnail/1200x675/74d72b2f1f9cce710394205ae32012f1/untitled-design-2026-02-19t182732-124.png"
      ],
      "datePublished": "2026-02-21T21:22:40.000Z",
      "dateModified": "2026-02-21T21:22:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cruz Azul vs. Chivas live stream, odds: How to watch on CBS Sports Golazo Network - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/liga-mx-schedule-live-stream-odds-cruz-azul-chivas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/a9df2434-c788-4b1a-8aff-2d9dfe1209c3/thumbnail/1200x675/170590b2fff1ba77fe1daab9ad9b8dab/cruz-azul-1.jpg",
    "tag": "Sports",
    "date": "2026-02-21T20:06:29.000Z",
    "description": "\n\n\n    \n                                    A huge weekend of action sees Cruz Azul and Chivas battle Saturday night on CBS Sports Golazo Network\n    ",
    "body": "\n\n\n    \n                                    A huge weekend of action sees Cruz Azul and Chivas battle Saturday night on CBS Sports Golazo Network\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 21, 2026\n                            \n                    at\n    3:06 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        This weekend, it's a loaded slate of Liga MX action on CBS Sports, with Chivas Guadalajara looking to continue their perfect start to the Clausura portion of the season. With six wins in six matches, they couldn't ask for a better start to the campaign, but travelling to Puebla to face Cruz Azul will be a tall task. Chivas haven't won a portion of a Liga MX title since 2017, finishing as runners-up in 2023, but their lack of Concacaf Champions Cup play is something that can be used to their advantage during this compressed schedule.How to watch Cruz Azul vs. Chivas Guadalajara, oddsDate: Saturday, Feb. 21 | Time: 10:05 p.m. ETLocation: Estadio Cuauhtémoc -- Puebla, MexicoLive stream: CBS Sports Golazo NetworkOdds: Cruz Azul +140; Draw +230; Chivas +185Sunday's slate will be headlined by Pumas looking to keep their own form going while Monterrey continues to adjust to life without German Berterame after his move to Inter Miami. With so many changes to Monterrey's attack, they've struggled for consistency in the early portion of the season. But with the ability to feel things out while advancing to the last 16 of the Concacaf Champions Cup. Pumas may have been knocked out of the competition, but as Juninho gets going in the attack, while Pedro Vite and Adalberto Carrasquilla pace the midfield, this Pumas side are rounding into becoming a force in the league. Now up to fourth, it's a rare moment when Pumas are ahead of Monterrey, and with Keylor Navas in the net, this is also a defense that's improving by the day as they've been unbeaten in all six matches played so far, something that only three Liga MX sides can boast at this stage of the season. When it comes to making the playoffs, they're on the right track, but getting past Monterrey will be important to show their staying power. Striker Uros Durdevic still seeks his first goal for Monterrey after joining the club from Atlas, but given the quality of the Pumas defense, this may not be the match where that will happen.Check out the remainder of what's going on in Liga MX this weekend:Liga MX schedule and resultsAll times EasternFriday, Feb. 20Tigres UNAL 1, Pachuca 2Puebla 0, Club America 4Saturday, Feb. 21\nAtlas vs. Atletico San Luis, 6 p.m.Club Leon vs. Santos Laguna, 8 p.m.Necaxa vs. Toluca, 8 p.m.Cruz Azul vs. Chivas Guadalajara, 10:05 p.m. (CBS Sports Golazo Network)Sunday, Feb. 22Tijuana vs. Mazatlan, 12:10 a.m.Pumas UNAM vs. Monterrey, 6 p.m. (CBS Sports Network)Querétaro vs. Juárez, 8 p.m.\n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cruz Azul vs. Chivas live stream, odds: How to watch on CBS Sports Golazo Network - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/a9df2434-c788-4b1a-8aff-2d9dfe1209c3/thumbnail/1200x675/170590b2fff1ba77fe1daab9ad9b8dab/cruz-azul-1.jpg"
      ],
      "datePublished": "2026-02-21T20:06:29.000Z",
      "dateModified": "2026-02-21T20:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Duke vs. Michigan: TV channel, stream, odds, spread, prediction, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/duke-michigan-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg",
    "tag": "Sports",
    "date": "2026-02-21T23:15:37.000Z",
    "description": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No.",
    "body": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No. 1 Michigan and No. 3 Duke. After No. 2 Houston lost earlier this week to Iowa State, this game will more than likely determine who is ranked No. 1 in the AP Top 25 poll on Monday and the team that is in the driver's seat for the No. 1 overall seed in next month's NCAA Tournament. Duke and Michigan have combined for just three losses heading into the weekend. Duke lost to Texas Tech back in December and fell on the road earlier this month to in-state rival North Carolina after the Tar Heels hit a go-ahead 3-pointer with 0.4 seconds remaining after trailing the entire game. The Wolverines have won 11 consecutive games since losing to Wisconsin earlier this month. Michigan remains in firm contention to win the Big Ten regular season title. The Wolverines have a 2.0-game lead over Illinois heading into the weekend with just four conference games remaining in the regular season.  \n        \n            \n                Bracketology: Experts predict NCAA Tournament bracket before committee reveals early top 16 seeds\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nMeanwhile, Duke is 2.0 games ahead of Virginia in the ACC standings, also with four games remaining. Duke faces Virginia at home next weekend. \nHere is everything you need to know ahead of Duke's matchup with Michigan on Saturday.  Duke vs. Michigan: Need to know  No. 1 overall seed on the line: This game not only has major stakes for next week's AP poll, but also the top line of the NCAA Tournament. The winner of this game will be in the driver's seat to earn the No. 1 overall seed in CBS Sports Bracketology.  No. 3 Duke and No. 1 Michigan are 1-2 in WAB -- a new metric the committee will be looking at -- and the NET rankings. Duke and Michigan are tracking to be placed on opposite sides of the NCAA Tournament bracket, which could make this game a potential national title preview if both teams make it to Indianapolis. Frontcourt is the strength of both teams: Michigan's strength is its frontcourt. The Wolverines have one of the best frontlines in the nation in the trio of Morez Johnson Jr., Yaxel Lendeborg and Aday Mara. Michigan will face its toughest test yet, with a matchup against Duke big man Cameron Boozer, the current national player of the year frontrunner. Boozer has been the most consistent player in the sport. Boozer is a walking double-double. Mara is one of the best shot blockers and defenders in the nation. The key to this one will come down to how Michigan can slow down Boozer. \nGuards will be asked to step up: Yes, the strength of both teams is their frontcourt play, but the guards could also decide this game. On the Michigan front, Elliot Cadeau is familiar with Duke as anyone. He spent the last two seasons at North Carolina before transferring to Michigan last offseason. Cadeau's backcourt mate, Nimari Burnett, is a steady veteran presence. On the other side, Duke guard Isaiah Evans has stepped up and become the clear-cut No. 2 option. There are question marks about Duke's point guard play, with Caleb Foster and Cayden Boozer sharing that responsibility. Boozer has seen his role increase lately. That's a good thing for all parties.  Where to watch Duke vs. Michigan live  Date: Saturday, Feb. 21 | Time: 6:30 p.m. ET Location: Capital One Arena -- Washington, D.C. TV: ESPN | Live stream: fubo (Try for free)   Duke vs. Michigan prediction, pick  \nThis game is a rare nonconference Final Four/national title preview in February. It's truly going to be a toss-up. Duke and Michigan rank 1-2 in adjusted defensive efficiency, per KenPom.com, and are also No. 1 and 2 in most other metrics. The key will be the frontcourt and 3-point shooting. Duke shots 34.9% from the 3-point line, while Michigan knocks down 36.1% from beyond the arc. In a sense, Boozer has become almost underrated because people have just gotten used to how dominant he is. This is an opportunity for him to show everyone why he's a Tier 1 NBA Draft prospect. Duke wins behind Boozer and Evans. Pick: Duke +2.5\n \t \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            UM -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Duke vs. Michigan: TV channel, stream, odds, spread, prediction, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg"
      ],
      "datePublished": "2026-02-21T23:15:37.000Z",
      "dateModified": "2026-02-21T23:15:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UCLA will play 2026 home games at Rose Bowl, potential move to SoFi Stadium delayed - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ucla-football-2026-rose-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/568f5f86-3778-45fe-8103-230f88a0e4ef/thumbnail/1200x675/063ad1690a762be056398e5a5338e4a1/rose-bowl-ucla.jpg",
    "tag": "Sports",
    "date": "2026-02-21T19:37:35.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After exploring options to move home football game",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After exploring options to move home football games to SoFi Stadium, UCLA will remain at the iconic Rose Bowl for the 2026 season. \"UCLA will play the upcoming football season at the Rose Bowl,\" said UCLA vice chancellor for communications Mary Osako in a statement. \"We know how much game day means to Bruins — to our students, alumni and fans who plan their autumn around Saturdays together. Our priority is delivering a strong season experience for our student-athletes and our community, and we have great momentum in our football program. During this unprecedented time in college athletics, UCLA will always be guided by what's best for our student-athletes and the Bruin community.\"The decision to remain at the Rose Bowl comes a little over three months after the Rose Bowl and city of Pasadena filed a lawsuit against UCLA last October after plans for the Bruins to move home games out of the storied stadium became public. UCLA's current lease with the Rose Bowl runs through 2044, and the lawsuit alleged the Bruins moving home games to Inglewood would cause more than a billion dollars in damages to the city of Pasadena and its residents. Moving to the newer SoFi Stadium presented an appealing opportunity for UCLA. Not only is it a newer stadium with more amenities, but it's also 13 miles closer to UCLA's campus -- as attendance can be an issue at times for the Bruins at the Rose Bowl. However, with the pending lawsuit over their lease agreement with the Rose Bowl and their effort to build positive momentum within the program after hiring James Madison coach Bob Chesney, the Bruins opted to play in Pasadena without the dispute hanging over the preparations for the 2026 season.\nThe statement does not note what UCLA's long-term future plans will be, and it certainly seems as though this saga will continue into 2027 as the Bruins look to resolve the dispute over their lease with the Rose Bowl and explore their options for moving home games to the Inglewood home of the NFL's Los Angeles Chargers and Rams. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UCLA will play 2026 home games at Rose Bowl, potential move to SoFi Stadium delayed - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/568f5f86-3778-45fe-8103-230f88a0e4ef/thumbnail/1200x675/063ad1690a762be056398e5a5338e4a1/rose-bowl-ucla.jpg"
      ],
      "datePublished": "2026-02-21T19:37:35.000Z",
      "dateModified": "2026-02-21T19:37:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan State vs. Ohio State prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/michigan-state-ohio-state-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/7c6dc457-0fdd-43a0-834d-7606532989c0/thumbnail/1200x675/4cfc87099a0e85e09fe3f7ccf2e74f6f/jeremy-fears-msu.png",
    "tag": "Sports",
    "date": "2026-02-21T21:09:03.000Z",
    "description": "\n        Michigan State and Ohio State will meet for the first time on the hardwood this season Sunday on CBS in a pivotal Big Ten showdown with NCAA ",
    "body": "\n        Michigan State and Ohio State will meet for the first time on the hardwood this season Sunday on CBS in a pivotal Big Ten showdown with NCAA Tournament seeding and conference championship implications on the line. The two teams enter the day having won earlier in the week -- Michigan State over UCLA and Ohio State over Wisconsin, respectively -- setting up what should be a terrific matchup from East Lansing.Michigan State has been tough to beat on its homecourt this season, but it has not been infallible. It is 13-2 in games played in the Breslin Center, with both losses coming to teams ranked inside the top five. That should inspire at least a little confidence in the Buckeyes, who are in desperate need of stringing together some momentum after alternating between wins and losses in their last nine outings.Ohio State vs. Michigan State: Need to knowBig Ten title hopes: Michigan State enters Sunday 3.5 games back of Michigan in the Big Ten standings and likely needs to run the regular-season table to be in contention for a conference title. Given the way the Wolverines have played, it seems farfetched, but the Spartans can't lose sight of the goal against a Buckeyes team that could be easy to overlook if not taken seriously. Consistently inconsistent: Ohio State has alternated between winning and losing in its last nine games dating back more than a month, proving to be consistent only in its inconsistency. A win Sunday would be its first two-game winning streak since mid-January. It is coming off an 86-69 home win over Wisconsin.Fearsome Fears: Michigan State guard Jeremy Fears Jr. leads all of college basketball in assists per game (9.3) and also leads his team in minutes and points per game with 31.6 and 15.1, respectively. He's made a significant jump in production from last season and is coming off his fourth consecutive double-double in which he had 16 points and 10 assists in an 82-59 win over UCLA.\nWhere to watch Ohio State vs. Michigan State liveDate: Sunday, Feb. 22 | Time: 1 p.m. ETLocation: Breslin Center -- East Lansing, MichiganTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ Premium  Ohio State vs. Michigan State prediction, pickOdds below via FanDuel Sportsbook\nMichigan State's 13-2 at home this season and 7-5-1 against the spread as home favorites. I'm taking the Spartans to win and would probably lay the points with them as they prep for their penultimate home game of the season. The way Fears has played of late should inspire confidence, but more than that, this Michigan State team has leveled up defensively, too. If they can find a way to slow Bruce Thornton they can win -- and perhaps handily. Pick: Michigan State -9 \n\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            MSU -9\n                            \n    \n                                                \n                    \n    \n        \n                            Ohio St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ohio St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ohio St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ohio St.\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan State vs. Ohio State prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/7c6dc457-0fdd-43a0-834d-7606532989c0/thumbnail/1200x675/4cfc87099a0e85e09fe3f7ccf2e74f6f/jeremy-fears-msu.png"
      ],
      "datePublished": "2026-02-21T21:09:03.000Z",
      "dateModified": "2026-02-21T21:09:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jon Rahm not among LIV Golf players given conditional releases by DP World Tour - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/jon-rahm-liv-golf-conditional-releases-dp-world-tour-ryder-cup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/6f89a009-805e-41e7-b173-e715edfdaa61/thumbnail/1200x675/ca6fc2a2bd5f55d9662f202129e32c01/rahm.jpg",
    "tag": "Sports",
    "date": "2026-02-21T18:46:48.000Z",
    "description": "\n        The DP World Tour announced on Saturday that eight players from LIV Golf paid their fines and met certain requirements to be granted their co",
    "body": "\n        The DP World Tour announced on Saturday that eight players from LIV Golf paid their fines and met certain requirements to be granted their conditional release for the 2026 season and remain eligible to play in DP World Tour events and the Ryder Cup.  However, Jon Rahm -- the biggest European star on LIV Golf -- was not among that group.Tyrrell Hatton, Laurie Canter, Thomas Detry, Tom McKibbin, Adrian Meronk, Victor Perez, David Puig and Elvis Smylie agreed to pay their fines, withdraw appeals against the DP World Tour and participate in certain events, media activities and promotions for the tour. As such, they were granted the opportunity to play LIV Golf events that conflict with DP World Tour tournaments. Rahm was not part of that group, leaving his status with the DP World Tour -- and Europe's Ryder Cup team in 2027 -- still in doubt. The DP World Tour noted that the agreements for conditional release were not precedent-setting; they only applied to the 2026 season.Rahm has refused to pay fines (reportedly topping $3 million) for playing in LIV Golf events that oppose those on the DP World Tour. He and Hatton were eligible to play in the 2025 Ryder Cup at Bethpage Black after appealing their sanctions in September. A timeline has not been established for when a third-party arbiter will hear that appeal, but with this new agreement, Hatton (and Meronk, who was also part of the appeal) no longer needs to be involved. \nRahm still has another 18 months before he requires a ruling in his favor to be able to participate in the 2027 Ryder Cup at Adare Manor in Ireland; however, after not reaching an agreement with the DP World Tour alongside his eight LIV Golf compatriots, he's passed up a clear opportunity to regain status at least for this year. Given the nature of the agreement, which is only good for the 2026 season, a non-Ryder Cup year, Rahm may have felt it was unnecessary to relent in his legal battle. If Rahm's appeal is successful, he may avoid any financial penalties, and with LIV Golf picking up world ranking points this year, if Rahm maintains his rate of top 10 finishes from previous seasons -- plus strong finishes in the majors -- he can give himself a decent chance at qualification without needing many DP World Tour starts. \nStill, Rahm's European Ryder Cup teammates likely hoped he would have taken the opportunity to pay the fines, as Hatton did, and get back in good standing consdiering the positive vibes for the European squad coming out of their win in New York. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jon Rahm not among LIV Golf players given conditional releases by DP World Tour - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/6f89a009-805e-41e7-b173-e715edfdaa61/thumbnail/1200x675/ca6fc2a2bd5f55d9662f202129e32c01/rahm.jpg"
      ],
      "datePublished": "2026-02-21T18:46:48.000Z",
      "dateModified": "2026-02-21T18:46:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rams to propose NFL rule change after Seahawks' controversial 2-point conversion - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-propose-nfl-rule-change-seahawks-2-point-conversion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/4da99d97-9bb8-4373-9814-288d5f93aeee/thumbnail/1200x675/701c5799b890d5c8e594907c5baa5352/sean-mcvay.jpg",
    "tag": "Sports",
    "date": "2026-02-21T21:40:54.000Z",
    "description": "\n        The Seattle Seahawks' unconventional yet successful two-point conversion against the Rams in a Week 16 victory wound up being one of the most",
    "body": "\n        The Seattle Seahawks' unconventional yet successful two-point conversion against the Rams in a Week 16 victory wound up being one of the most consequential plays of the 2025 season.And sources tell CBS Sports the Rams are planning to propose rule changes that would effectively make the play an unsuccessful two-point try.\nThe Rams plan to propose at least one rule change this offseason, sources say, and there may be a second proposal aimed at certain details around that play. Teams regularly submit rules proposals toward the start of the new league year, and many of those proposals come in around the time of next week's NFL Scouting Combine.While the language remains unclear, one source with knowledge of the proposal(s) said the Rams' goal is to \"fix what went wrong in a few places.\"\nThe Rams and Seahawks opened Week 16 on \"Thursday Night Football\" on Amazon Prime. Both teams were 11-3, and the Rams held the tiebreaker for the top seed in the NFC after beating the Seahawks at home in Week 11.The Rams held a 16-point lead in the fourth quarter, and a win would have put L.A. in the driver's seat to win the NFC West and potentially earn the conference's No. 1 position in the coming weeks. But Seattle scored consecutive fourth-quarter touchdowns and trailed 30-28 with 6:23 left. On the Seahawks' two-point conversion attempt, quarterback Sam Darnold attempted a quick pass to running back Zach Charbonnet, but the ball hit Jared Verse's helmet and ultimately fell to the ground with the whistle being blown. Charbonnet, in nonchalant fashion after the whistle was blown, picked the ball up just inside the goal line and then began walking away from the end zone -- the play understood by those on the field to be an incomplete pass and an unsuccessful attempt.\nThe Seahawks eventually lined up for the ensuing kickoff before referee Brad Allen stopped the game to announce the play was under further review. Replay showed that Verse made contact with the ball behind where Darnold released it, making it a lateral. Charbonnet then recovered it in what the NFL rulebook would call the \"immediate continuing action.\" Had it been ruled a fumble, Charbonnet would not have been allowed to advance it on a two-point try. But because it was a backward pass, and because it was considered \"immediate continuing action,\" he could. It officially went down as a successful two-point rush by Charbonnet, tying the game at 30.Amazon Prime officiating analyst Terry McAulay, an NFL official for two decades, noticed the officiating quirk quickly on air before the review was initiated more than a minute and a half after the play was over. Earlier this month, NBC Sports reported McAulay called the league office to discuss the play, which may have led to the review being initiated. A statement by the league noted it is not unusual for the league office to be in contact with the game broadcast.Both teams failed to score in the remainder of regulation, including the Rams missing a 48-yard field goal that could have won the game. In overtime, the Rams scored on the opening possession and made the extra point. The Seahawks responded with a 65-yard touchdown drive of their own and converted a successful two-point attempt to win the game 38-37.\nAfter the game, Rams players and coaches were confused by the ruling. Coach Sean McVay called it \"very interesting\" in his postgame remarks, adding that he didn't get a clear explanation of the rule because the game was going on.\"I've never seen anything or never been a part of anything like that. And I've grown up around this game,\" McVay said. \"I'm not making excuses. We don't do that. I don't believe in that. It doesn't move us forward, but we do want clarity and an understanding of the things that we can do to minimize that when we rejected the two-point conversion.\"The result improved the Seahawks to 12-3 and dropped the Rams to third in the NFC West. Seattle won its next two games, including a division-deciding finale against the 49ers, to win the NFC West and earn the No. 1 seed in the playoffs. The Rams lost the following week to Atlanta, putting them out of reach for the division. L.A. got the fifth seed in the playoffs and played the entire postseason on the road.\nThe two teams met for a third time when they played for the NFC Championship in Seattle, where the home team won 31-27. Seattle went on to trounce the Patriots 29-13 in Super Bowl LX and deliver a second Lombardi to the Pacific Northwest.\n        \n            \n                Prophecies, pressure and a Lombardi Trophy: Inside the Seahawks' Super Bowl run\n                \n                    Jonathan Jones                \n            \n                            \n    \n                \n                    \n    \nOne can speculate as to what changes the Rams are seeking. Perhaps they wish to apply the fumble rules on a two-point try to a lateral that has been touched by the defender and goes forward. Or they want to have a time limit for a review to be initiated. The change could be related to the ball being possessed after the whistle blew. It may seek a clearer definition of what \"immediate continuing action\" is. Or it could be none of these.Any team can put forth rule change proposals, and occasionally teams bitten by a certain rule in the previous season will submit a proposal to fix that the following offseason.\nProposals will likely be announced within the next month. From there, the proposal language can be refined up until a vote. Team owners then vote on proposals at the annual league meetings, which this year take place in late March in Phoenix. Twenty-four owners representing a three-fourths majority must agree to the proposal for a rule to change.The Seahawks likely don't see this as a loophole in the rulebook, but clearly the Rams do. And they are seeking to close it on a rare play that may have shaped this year's postseason.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rams to propose NFL rule change after Seahawks' controversial 2-point conversion - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/4da99d97-9bb8-4373-9814-288d5f93aeee/thumbnail/1200x675/701c5799b890d5c8e594907c5baa5352/sean-mcvay.jpg"
      ],
      "datePublished": "2026-02-21T21:40:54.000Z",
      "dateModified": "2026-02-21T21:40:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why do Arsenal keep giving up golazos amid trophy chase? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-premier-league-conceding-wonder-goals-premier-league-ucl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/011fbb70-dc32-4d9e-8b55-502839539ea9/thumbnail/1200x675/1777fa4a58ca29add1f4312ef63ae92a/arsenal-defense-premier-league.jpg",
    "tag": "Sports",
    "date": "2026-02-21T20:28:56.000Z",
    "description": "\n        Arsenal's disastrous trip to Wolverhampton Wanderers ended with a few familiar crises to haunt Mikel Arteta and his players. Not just those i",
    "body": "\n        Arsenal's disastrous trip to Wolverhampton Wanderers ended with a few familiar crises to haunt Mikel Arteta and his players. Not just those increasingly justifiable questions over whether the league leaders have the hearts and stomachs of winners, but an altogether more fiddly issue -- why do so many of their opponents seem to save their goal of the season for the day when they line up against the Gunners?File Hugo Bueno's whipped strike into David Raya's far post alongside Eli Junior Kroupi's pearler in January, the best of Dominik Szoboszlai's many excellent free kicks, Matheus Cunha's bender into the bottom corner and/or the howitzer from Patrick Dorgu. You wouldn't make Bueno's the pick of the lot -- not when that's your list of nominees -- but as first Premier League goals go, it's not one to be sniffed at.Some of the goals that have beaten David Raya this season are not quite the sort that would have coaches demanding their players what they're doing with that step back, one-legged, do you practice that shot in training nonsense. They're not a million miles from it either though.If it feels like everyone is pinging in their best goals against Arsenal this season, well, maybe there's something in it. Six of the 20 they have conceded in the top flight have an expected goal (xG) value of 0.04, shots that you would expect to be scored once in every 25 attempts. All of those low xG shots have come from outside the box and while eight teams have conceded more long-range efforts than the Gunners, only Brighton get anywhere close to Arsenal's 30% of goals conceded coming from outside the box.\nLow xG, high scoringThose six less than 0.04 xG goals conceded are the joint-most of any team in the Premier League, and most of the rest of the division has a lot more volume to work with. Expand the criteria out to shots worth less than 0.1 xG and you end up with half of the goals this team have conceded. Do so and you're throwing plenty more unlikely goals into the mix. Center back Daniel Ballard charging up the gut to hit a peach of a drive over David Raya, Trevoh Chalobah's brilliant flick over nearly half the outfield players, Tolu Arokodare turning the shot of a Wolves teammate into a goal of his own.All that for a team who has allowed just 19 shots and five goals from shots worth 0.2 xG, both by far the most impressive marks in recent Premier League history. One regular goal against Arsenal. All I ask for. Will never infrequently happen.It is worth noting that Arsenal's total concession is broadly in line with their expected goals tally, 20 against from 207 shots worth 18.08 xG. However something a bit strange happens when you look solely at the xG value of the shots that Arsenal have let in.\nThe 20 shots have a combined xG value of 3.15. Maybe there is nothing particularly too where the goals are conceded, just the fact that they are broadly in line with the trend of the total volume of shots faced, but it is still the case that no Premier League team since the start of the 2020-21 season has a six times overperformance between their goals conceded and the xG value of them. Indeed, prior to that, no team had seen a four-and-a-half times overperformance.\n                                                                    TruMedia\n                                                            In short, the way it feels is reflected in reality. Arsenal goals against are golazo-heavy. And doesn't Arteta know it. Unprompted, he made reference to the xG value of Bueno's goal. \"To predict somebody with an 0.02 expected goal shot [sic - sorry but Opta has it at 0.03] ... nobody can really understand that.\"Searching for trendsAsked if this run of low probability goals was chance or something he might be able to address on the training field, Arteta was curiously unequivocal. \"Probably a bit of both,\" he said. \"I think we'll have to go goal by goal.\n\"Somebody from a really low scoring position can put the ball in the top bins, what are the odds for that to happen? I don't know. It depends on the players here in this league. They have a lot of quality as well. So, that's a clue.\"Perhaps we should start, as Arteta wishes, by going through those goals conceded to see if any patterns emerge. Starting with Bueno's there is one trend that does pop up on a few occasions. When a half cleared corner eventually comes to the Wolves left back, Piero Hincapie's instinct is the right one. He wants to show his man down the flank and bait the cross, which will go into an area where Arsenal have a host of bodies that should have no problems getting rid.Bueno finds space to step inside and curl a shot at goal \n                                                                    Premier League\n                                                            Hincapie's problem is that he is just too slow to get out to Bueno, who doesn't really have to adjust to anything the defender is showing him. The Arsenal defender has given his man so much space that by the time Bueno checks inside and shapes to shoot, it is too late. \nThere were similar issues when Kroupi struck for Bournemouth, who had nicely manouevred Arsenal around the pitch when once more they won the second ball off a corner. Hincapie was too slow to follow Kroupi inside as Bournemouth gave and go but he is hardly the only player who could just have done with registering the problem a bit earlier.\n                                                                    Premier League\n                                                            Arsenal have a six-on-five advantage in the backline when the ball is played into Kroupi in space but no one comes out to cover for Hincapie. That probably left the Gunners even more vulnerable, given Kroupi would have been as much of a threat to slip a through ball into that gap between Martin Zubimendi and William Saliba. No one in the visiting team really took ownership of the situation and with that they found themselves having to ride out a deeply uncomfortable final 15 minutes at the Vitality Stadium.You could offer similar critiques when Cunha bent one in to silence the Emirates last month. Having turned Declan Rice, the Manchester United forward found himself driving into altogether too much space with Gabriel perhaps feeling unable to push up as Benjamin Sesko attacked the space in behind him. It is also, possible, however that he defaulted to what has been one of the defining traits of Arteta's excellent Arsenal sides, that they defend the box better than anyone else. \nThere might be an issue for Arsenal when it comes to pressuring long range shooters. Within their own penalty box, the Gunners are outstanding at limiting touches and shots. When they do come, this team blocks shots like they've got Hakeem Olajuwon as their anchor. Outside the area, they don't swarm with quite the same ferocity. In all 47.3% of the shots they've allowed from those spots this season are what Opta terms low pressure shots. That's not the worst in the league but it's below average and it's rare to find a defensive metric where that is the case for Arsenal.\n        \n            \n                Arsenal's block party: How the Gunners defensive line stops shots before they reach goal at exceptional rates\n                \n                    James Benge                \n            \n                            \n    \n                \n                    \n    \nSagging off shooters might also explain why Arsenal have allowed 23 outside-the-box goals from 16.58 xG over the four seasons of their title contention. That is a 38.7% overperformance by their opponents, above average if we look only at the ever present teams in that timescale. Look at the players who have scored those goals -- more than one for Kevin De Bruyne and Marcus Rashford with smatterings of Bruno Fernandes and Szoboszlai in the mix. Those are the sort who convince Morgan Rogers that his xG when shooting from range is \"a whole load of nonsense\", who justify Arteta's comments that it \"depends on the players here in the league\". It is probably, for instance, not worth giving Cole Palmer much daylight when Chelsea rock up to the Emirates next week. The derby beforehand? *Checks Tottenham's injury list* Yeah, you're probably good.\nIt is, of course worth reaffirming one particular truth about Arsenal. This is a defense that has become the best in the world in no small part because of its ability to keep the other team from getting into the penalty area. If that means giving up long shots, then everything we have learned from the analytics movement is that that is a trade-off you make 100 times out of 100.Maybe if you are so focused on plugging the gaps in your box, you have to be prepared to ride some shooters' luck from range. Arteta, unsurprisingly for a man who arrived in north London intent on his side excelling in every single of the sport, sees it differently. Why not be the best perimeter defense too? \"That's what we want,\" he said. \"There are certain margins there in terms of when we approach the player, the space that you cover in relation to the defender and the keeper. So, there are things that we are constantly working on and try to improve them.\"\nIs the goalkeeper a problem?There was one other factor in Arsenal's problems with long range shot that was consistently mentioned by supporters when I noted just how many worldies were going in their net this season. Like a single, successful and attractive man in his early 30s, all I was hearing was Raya.And while it is rarely wise for a case to be constructed on evidence compiled from Arsenal fans on social media after a bad result, maybe there's something here. After all, there's no denying that of all the goalkeepers to have played in the Premier League since the start of 2023-24, the 6ft 0in Raya is the shortest. Does the average sized shot stopper in their division, all 6ft 3in of him, get a glove on Bueno's goal? Quite possibly, going off the image below.\n                                                                    Premier League\n                                                            Maybe this exact moment reflects the problem with not discriminating for height in goalkeeper recruitment but it is hardly like this has been a problem all through his career. Raya concedes 0.21 goals from outside the box per 90 minutes. The average Premier League goalkeeper concedes 0.23. In his two seasons prior to this he had an 83% success rate at saving shots from range. Again, that is above average.\nArsenal's crisis against long shots?As for this season. Raya's success rate has cratered but has he become an inferior goalkeeper by any other observable facet? Not really. He remains an outstanding sweeper keeper, instinctively excellent when shots are fired his way from close range. It is just that this season when Bueno has took a swing from 20 yards out, he has contrived to hit a shot 6ft 1in outside his reach. You could pick faults in Raya's positioning for Cunha's goal but it's still a spectacular finish to punish a goalkeeper for being half a step too far to his right. Dorgu, Szoboszlai? Put two keepers in the net and those shots aren't getting stopped. Then you round out that sample with Zubimendi giving the ball to Richarlison to lob into an empty net. A few players not timing the ball quite so perfectly and Arsenal's difficulty with long rangers would go unnoticed.There might be some difficulty there. A long trail of xG suggests this is a team conceding a few more than it ought to from range. In all that time though Arsenal have been the best defense in the sport. There is no obvious sign that that has changed since the turn of the year when all these shots have been flying in from range. So why do teams keep scoring wonder goals against Arsenal? Because sometimes random events have the feel of a confluence.\nHow to watch Tottenham vs. Arsenal, oddsDate: Sunday, Feb. 22 | Time: 11:30 a.m. ETLocation: Tottenham Hotspur Stadium -- LondonTV: USA | Live stream: PeacockOdds: Tottenham +480; Draw +290; Arsenal -175\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why do Arsenal keep giving up golazos amid trophy chase? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/011fbb70-dc32-4d9e-8b55-502839539ea9/thumbnail/1200x675/1777fa4a58ca29add1f4312ef63ae92a/arsenal-defense-premier-league.jpg"
      ],
      "datePublished": "2026-02-21T20:28:56.000Z",
      "dateModified": "2026-02-21T20:28:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]